{"courses": ["ENGL101", "ENGL391", "ENGL101S", "ENGL308C", "ENGL101", "ENGL101", "ENGL296", "ENGL101", "ENGL391", "ENGL294", "ENGL391", "ENGL101", "ENGL296", "CINE245", "ENGL245", "ENGL391"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Alan Montroso", "course": "ENGL101", "review": "Great teacher!", "rating": 5, "expected_grade": "A", "created": "2021-09-02T18:59:27Z"}, {"professor": "Alan Montroso", "course": "ENGL101S", "review": "Course isn't done yet but since registration is happening now I'm gonna drop a review and say that he's an amazing professor. EXTREMELY understanding of late work (don't even worry, unless youre gonna take extra weeks instead of days and not communicate). Overall very chill and grades very leniently too. The assignments are the same as any other eng101 course, so he doesnt have much leeway to change the assignments but he does make them easier where he can. TAKE HIM IF YOU CAN!", "rating": 5, "expected_grade": "", "created": "2021-11-20T23:17:29Z"}, {"professor": "Alan Montroso", "course": "ENGL308C", "review": "He's quite possibly the best professor I've ever had at UMD. He's so nice, so approachable, and so understanding. He also genuinely cares about your performance in class. Our entire class actually became really close with him. The workload never felt like too heavy, yet we all learned so much. He also made Shakespeare's plays and really intense theory super easy to understand. He's so down to earth and genuine. Honestly, you'd be an IDIOT to pass up on taking one of his classes. Don't be an idiot.", "rating": 5, "expected_grade": "A+", "created": "2021-12-16T01:13:27Z"}, {"professor": "Alan Montroso", "course": "ENGL101S", "review": "Prof. Montroso was awesome. It is not his fault but the workload for this class is pretty heavy, but he made it bearable. He is also very lenient with due dates when you communicate well. He also grades in a very fair manner. I highly recommend taking him if you can.", "rating": 5, "expected_grade": "A", "created": "2022-01-20T06:07:30Z"}, {"professor": "Alan Montroso", "course": "ENGL101", "review": "Professor Montroso is the best English professor (and college professor) I have ever had! Like many other freshmen, I was dreading ENGL101, because research papers are often taxing/ tedious in college. However, Prof Montroso was engaging, understanding, and always willing to answer questions and give feedback. He is very approachable and is genuinely invested in the well-being of his students (e.g. extending deadlines if necessary). \r\n\r\n*Helpful Tip* If you are struggling with the research process, ask a librarian for help. Professor Montroso expects you to use academic sources which are mostly found on library databases. ", "rating": 5, "expected_grade": "A+", "created": "2022-08-05T20:28:52Z"}, {"professor": "Alan Montroso", "course": "ENGL101", "review": "all ima say is hes the best. So chill, had him as a 8 am and he was so chill he understood if you were late and there is no final. Essays are pretty slight work and they arent bad. If you submit a day late he would still say its on time, best teacher I had, made me actually feel confident about my suckish writing skills (english is not my first language) best professor!!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-16T16:28:15.185652Z"}, {"professor": "Alan Montroso", "course": "ENGL101", "review": "Professor Montroso was great! He was super understanding of students needs and would give extensions on anything if needed. He really cared about his students and it showed. He gave so much feedback and was more than willing to discuss anything outside of class time. Overall great guy and better professor, would highly recommend taking his class.", "rating": 5, "expected_grade": "A", "created": "2022-12-18T01:35:34.268561Z"}, {"professor": "Alan Montroso", "course": "ENGL101", "review": "I took English 101 with Professor Montroso. He is a flexible and interesting professor. He grades assignments easily and gives clear instructions for every assignment. He is my favorite professor this semester, please consider him as your professor, you won't regret it.", "rating": 5, "expected_grade": "A-", "created": "2023-12-07T18:09:33.964285Z"}, {"professor": "Alan Montroso", "course": "ENGL101", "review": "Great professor with lenient grading and a very manageable workload with an overall very understanding personality.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T21:05:30.351072Z"}, {"professor": "Alan Montroso", "course": "ENGL296", "review": "Professor Montroso made this class super fun and engaging. He's one of the kindest professors I've had at this university, and he brings something unique and new to every semester he teaches this course. He provides really excellent feedback on your assignments, and he delivers it in the form of personal recorded videos for each student. As someone who was always annoyed by the idea of geneds, always wanting to only take classes for my major, I've been pleasantly surprised by ENGL296 with Montroso and am very glad I took it.", "rating": 5, "expected_grade": "A+", "created": "2023-12-23T04:09:14.032122Z"}, {"professor": "Alan Montroso", "course": "ENGL296", "review": "This was one of the best gened courses that I have taken. Professor Montroso was very kind and understanding, and made lectures very interactive and engaging. Could not recommend him and this class more", "rating": 5, "expected_grade": "A", "created": "2024-03-24T16:58:23.406518Z"}, {"professor": "Alan Montroso", "course": "CINE245", "review": "Great professor! He makes sure that students actually understand all the material, evenly balances the workload between class and homework to ensure that students don't fall behind in his class or their others and always leaves very constructive comments for how to improve on future assignments. CINE 245 is an awesome class!", "rating": 5, "expected_grade": "A+", "created": "2024-03-28T12:17:40.608281Z"}], "name": "Alan Montroso", "slug": "montroso"}