{"courses": ["FIRE177", "FIRE277", "FIRE120", "FIRE198", "FIRE298", "FIRE398", "FIRE398", "AOSC200", "AOSC493", "FIRE120", "FIRE298", "FIRE398", "GERM103", "FIRE198", "FIRE398", "FIRE199", "AOSC494", "AOSC200", "AOSC493", "AOSC431", "AOSC200", "AOSC494", "AOSC200", "AOSC493"], "average_rating": 3.0667, "type": "professor", "reviews": [{"professor": "Alexandra Jones", "course": "FIRE298", "review": "Best professor I have had at UMD. She wants you to succeed and will always go out of her way to help you. I'm so glad I picked this stream for the FIRE program!", "rating": 5, "expected_grade": "A", "created": "2021-04-15T20:41:52Z"}, {"professor": "Alexandra Jones", "course": "FIRE198", "review": "Professor Jones is great. She is super understanding, I had to miss class due to being sick a few times with no problems. I have thoroughly enjoyed the Cloud Computing stream, even with it being online. It's been challenging but I have learned a lot.", "rating": 5, "expected_grade": "A", "created": "2021-05-04T17:37:45Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "This Professor is super nice. But as someone who not in the stem program at umd, I found this course to be super difficult. Everyone told me it be an easy course but I really struggled all semester!", "rating": 3, "expected_grade": "C+", "created": "2022-12-13T17:29:21.413518Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "Professor Jones is a great Professor. It is her first-semester teaching AOSC so some of our quizzes and tests are harder than the other sections because she has never made exams for the class before. She let the class retake a part of the midterm for points back and has been adapting the class to student feedback. She didn't have any practice exams which made studying difficult, but she started giving practice problems after the midterm which helped a lot. She is very knowledgeable about the topics and if you need any help she is more than willing to help. I really enjoyed AOSC200 because it was very interesting and not too difficult. I believe her future sections will be easier as she will have experience and more course materials to give to the class.", "rating": 5, "expected_grade": "A-", "created": "2022-12-14T12:39:15.746202Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "Professor Jones is really nice and you can tell she is really knowledgeable and she really wants you to do well. It seemed a bit more difficult than other professors' section because this was her first year teaching this course which also meant she didn't have past quizzes or exams that we could reference. However, she still did provide us with practice problems for example to help prepare us for potential questions. She really does try to work with you and she takes feedback to figure out how to best support the class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T18:55:11.141297Z"}, {"professor": "Alexandra Jones", "course": "FIRE298", "review": "She's such a wonderful professor, and I got to know her well over the last two semesters. She's no longer leading the cloud computing stream, but I can bet that she's an amazing choice for any other classes she's teaching.", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T05:49:08.864664Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "This semester was Dr. Jones' first time teaching this course, and although sometimes the assessments were pretty hard, she did her best to roll with that feedback and give everyone opportunities to improve their grades. She wants us to learn and do well. Overall I think she learned a lot and will be very well equipped to teach this class again in the future. Class was very organized and expectations for things to know were very clear. She clearly knew what she was talking about, too. Overall I expected the course to be a little bit easier, but I would recommend taking a course with Dr. Jones.", "rating": 5, "expected_grade": "A-", "created": "2022-12-24T20:13:08.288282Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "Very sweet professor! Unfortunately, she made the class a lot more difficult than it was supposed to be.", "rating": 4, "expected_grade": "A-", "created": "2023-02-22T01:57:45.941851Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "She is a very nice professor and pretty good at teaching the material. But if you're looking to take AOSC200 as an easy DSNL gen-ed I would not recommend taking it with her. There are closed-book exams on material that's pretty scientific if you're a non-science major, and grading is real harsh.", "rating": 3, "expected_grade": "B+", "created": "2024-03-06T02:29:30.616394Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "Do not take this course with her. She teaches the class like a 400 level course and expects you to remember everything. So not worth it.", "rating": 1, "expected_grade": "", "created": "2024-03-19T18:17:20.026576Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "She is very nice however she makes the class much more difficult than it needs to be. The class is supposed to be for non science majors who need to fulfill DSNS or DSNL credits yet she teaches the material as if this is a major course and not a gen ed. The midterm was extremely hard and she had little to no study materials or practice questions and the practice questions she did have, didnt even have the correct answer posted so you have no idea if you are doing it correctly or not. The quiz was open not yet still graded very harshly and had very in depth complicated subjects. She is just a harsh grader overall and will deduct points for the smallest things. It is clear that the other sections with different professors have a much different experience in this class so DO NOT take this class with her if you are looking for an easy DSNL credit.", "rating": 1, "expected_grade": "B-", "created": "2024-03-25T20:52:34.633827Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "DO NOT TAKE! everyone says its so easy but she makes this class insanely hard. This is the hardest course I have taken here. You know its bad when everyone in the group me is saying they will be happy with a 30% on the first midterm. DONT DO IT", "rating": 1, "expected_grade": "C", "created": "2024-03-26T16:51:46.715718Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "She's very sweet professor but if you want an easy lab/class for credit DO NOT TAKE HER. I hear this class is much easier with the other professor. She makes it way more difficult then needed and has no practice material or stuff to study. She throws way too much info at you in one lecture and expects you to know a lot more then normal. I strongly recommend taking this with the other professor if you want a good grade.", "rating": 1, "expected_grade": "A-", "created": "2024-03-26T16:53:05.764728Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "She teaches the class like a 400 level course. Don't do it.", "rating": 1, "expected_grade": "", "created": "2024-03-26T16:56:32.216536Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "This is not the course to take if you want an easy gen ed class. She is relatively new to teaching so her exams are way too hard and she does not give any review or sample exams to study off of. The average of the first midterm was a 68 so take this class at your own risk", "rating": 1, "expected_grade": "B", "created": "2024-03-27T19:42:33.072801Z"}], "name": "Alexandra Jones", "slug": "jones_alexandra"}