{"courses": ["CHEM271", "CHEM705", "CHEM889A", "CHEM131", "HONR238G", "CHEM131S", "CHEM135", "CHEM403", "CHEM131", "CHEM131S", "CHEM403", "CHEM889A", "CHEM131", "CHEM705", "CHEM889A", "CHEM135", "CHEM403", "CHEM889A", "CHEM705", "CHEM889A", "CHEM135", "CHEM403"], "average_rating": 2.1609, "type": "professor", "reviews": [{"professor": "Alice Mignerey", "course": "CHEM271", "review": "Unapproachable, constantly messes up on her powerpoint slides. Exams super unfair. TA messes up just as much in discussion. She's going to need to put a huge curve on this class to make up for all the bad grades her students are receiving. ", "rating": 1, "expected_grade": "", "created": "2016-05-02T20:10:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Mignerey is a difficult teacher to get an A in. Don't follow the book religiously but more as a small supplement since her powerpoints are better. Her exams are a lot like the practice ones so be sure to do them. As a professor, she's not very good. Her answers aren't always clear and her explanations aren't always clear as well. I'll be following her explanation and then suddenly she makes some drastic jump that leaves everyone confused and wondering how to do the problem. She also does tend to get a little flustered when students keep asking questions. Don't rely on Mignerey for learning, go find a good study group or GSS session. ", "rating": 2, "expected_grade": "", "created": "2015-12-17T21:21:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Honestly, she is a very nice lady outside of class, and I actually have never ever written a review about a professor before.\n\r\nBut I warn you, please please please don't take her as your professor. \n\r\nEvery class she screws up at least one or two problems therefore making it incredibly hard for anybody to follow what she is saying, because if she is screwing it up how does she expect us to understand it?\n\r\nIf you try to ask a question she gets incredibly sassy and doesn't understand why you don't get what she is saying..probably because she doesn't even understand what she is saying.\n\r\nIf you want to actually learn concepts and understand the material and you HAVE to take her, don't go to class and just use the book.\n\r\nBut I would encourage all reading this that honestly, every class theres about 8 hands raised in the air and people are always looking around trying to see if anyone understands and what is going on, and the averages on the tests are embarrassingly low.\n\r\nDon't take her. Ever.", "rating": 1, "expected_grade": "C-", "created": "2015-11-13T14:02:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "eh... her lectures are a little difficult to follow and annoying. there is a decent curve at the end of the semester but the final exam was unreasonably long an therefore difficult to finish in the 2 hour time frame. she does masteringchemistry which is helpful but other than that Id consider another professor for Genchem 1 if I were you. I get the feeling she's a much better professor for more advanced courses, genchem 1 just isnt her thing", "rating": 3, "expected_grade": "", "created": "2015-06-10T16:04:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Mignerey is an interesting teacher to say the least. While you do not want to miss any lecture you also have to read in order to keep up. She blew past material really fast and also covers material that will not be on exams because she finds it interesting. In all seriousness, she is a very intelligent woman, but you have to have an interest in science in order to do well in her class.", "rating": 3, "expected_grade": "", "created": "2015-05-06T18:01:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "She's a fair teacher. Mignerey is not a bad teacher but she could have been better with her lectures. I didn't do good on the final. \n\r\nCon:\r\nHer TA, I think he replaced Mara. His name is Paul Diss and he is a snob! He's impatient and has an attitude that could throw anyone off.You will find it hard seeking help from him. Don't ever deal with him but only if you don't got a choice", "rating": 3, "expected_grade": "", "created": "2014-05-18T01:28:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "To start in all fairness - this professor is smart in her own right. She studies nuclear chemistry which is quite advanced compared to the introductory Chem 131. So i can't review how she teaches other chem courses.\n\r\nHowever! Even the smartest people can be the worst of teachers. Mignerey is one poor professor.\n\r\nHer lectures are read off of less than descriptive power points. Her shinannagins in class result from her inability to demostrate concepts correctly.\n\r\nFurthermore, asking questions to her in the middle of class is a joke. She gets mad so easily and instead of elaborating on a concept she just says \"it's like this right?...see right.\" She assumes the student knows the very questioned they asked about, which is silly because then why would they ask.\n\r\nThe most frustrating part! In her minimal effort to explain things she uses her stupid catch phrase \"boot strap ourselves through it.\" This is a cop out as a professor who is basically is using a poor analogy to explain a concept in chemistry. \n\r\nShe also has some ghoulish henceboy named Paul Diss who has inhereted Mignerey's inability to teach effectively, not to mention her snotty attitude. These two combined really make  the class an uncomfortable learning environment because they are always looking down their noses at students. It's sad they functionally exist in a teaching capacity. \n\r\nTesting: The tests are probably equivalent to other chem131 courses in terms of difficulty, but the professor does little to provide fundamental information in a coherent manner. Her class averages are depressingly low. The results you see on this website are most likely used after <50% of the class drops the course. \n\r\nThe TA's are the saving grace of Mignerey's career. Without them the class wouldn't do so well(minus the top percentile of students who just accel at   any class they take)\n\r\nI wouldn't trust anyone who thinks this professor is good. Chances are they have a passion or understanding of chemistry already and rely little on the professor. Thy are basing their judgments off of the tests which is not a true reflection of the professor's teaching abilities. \n\r\nIf you are a Chem major or interested in nuclear chemistry or anything close to that then this might be the professor for you.\n\r\nIf you are a student who needs to take Chem with a relatively different major and hope to be enlightened with coherent knowledge of the subject then you might want to take a different professor\n\r\n#Mignereysucks ", "rating": 1, "expected_grade": "", "created": "2014-04-16T20:22:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM271", "review": "The good:\r\n-Her TA Mara is amazing and so helpful\r\n-She posts practice exams and formula sheets which are helpful before exams\r\n-No conceptss - just problems\n\r\nThe bad:\r\n-Always makes mistakes..\r\n-Is a bad lecturer\r\n-Semi bad at explaining\r\n-Can get angry easily\n\r\nDon't waste your money on a textbook, you won't need it. Or just buy the $1 old edition", "rating": 3, "expected_grade": "B+", "created": "2012-12-24T16:17:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM271", "review": "Exams are fair and proportional to the material taught in class. She has an open door policy with office hours and is extremely helpful. \n\r\nLike any chemistry course at UMD, expect to keep with the course and study! If you have a choice between her and Kahn, take Mignery.", "rating": 5, "expected_grade": "B", "created": "2012-08-16T13:47:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM271", "review": "Dr. Mignerey is a pretty good professor. I found the material very interesting and you can tell she is really enthusiastic about what she does. She was pretty accessible and if you asked her intelligent questions she would answer you clearly. \n\r\nHer exams are kind of challenging. Averages for 2/3 of them were low and because of that there was a decent curve. The final was pretty hard so make sure you come prepared. The exams really do test how prepared you are and if you are not, your grade will pay. Final is 40% of your grade so make sure you take it seriously. \n\r\nYou have to go to lecture because she has in-class quizzes that are an easy way to get points.\n\r\nThe TA, Mara, is phenomenal. She is very helpful in discussions. ", "rating": 4, "expected_grade": "", "created": "2012-05-22T23:54:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM271", "review": "All i know is after dropping chem with kahn this class is a breeze!! Seriously her exams are almost identical to the practice exams she puts up!!! Going to class is a must because there are \"quizzes\" which are 1 pt daily problems on notecards that you can work on with others.", "rating": 4, "expected_grade": "", "created": "2012-05-12T15:42:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Make sure you understand the material when you come into lecture.  She'll point out all the little things you need to know but you have to go back to the book and read up on it, thankfully the book is really easy to understand.  \n\r\nHer tests are basically what she gives you on the practice exams, understand the concepts, memorize the equations and you'll do well on the tests.  \n\r\nBe wary she's not to approachable.  Yes she does want you to do well but it's best to understand when she raises her voice at you it's not because she's mad.  \n\r\nI could have gotten an A in this class.  In fact I got an A on the final.  I wish she had a policy like Dixon's where if you get an A on the final you get an A in the class.  ", "rating": 4, "expected_grade": "B+", "created": "2011-12-22T18:07:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Guys don't take her. Take Eichorn. I would suggest this. Go to two of her lectures, and go to two of Eichorn's, you will figure out four yourself. I knida' did it, but I did too later to drop Mignerey's class and go to Eichorn's. So, yea. Trust me. Take Eichorn. A better professor from every angle. \n\r\n>Mignerey doesn't teach you concepts, Eichorn does.\r\n>Mignerey puts everything in the powerpoint and everything is organized so she goes really fast over the material and loses a lot of her students in the middle. So, after she does every question, there would be 10 hands up by the students asking what she did. >Eichorn puts questions up, doesn't put steps up. Does on the board. So goes slowly. You get the concepts and understand how to approach the problem, and solve it slowly.\r\n>Mignerey faces board and powerpoint while teaching. Eichorn faces you.\r\n>Mignerey doesn't tell you the conceptual background of the question. Eichorn does.\r\n>Eichorn, in general, just gets more student's attention because he is animated. Makes stuff interesting. Mignerey, not any of that.\r\nEtc.. \n\r\nEichorn > Mignerey", "rating": 1, "expected_grade": "", "created": "2011-12-22T04:31:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "While I'll admit I failed the course, I don't feel like it's Mignerey's fault. I'm just really bad at the math in the course. She tries her best to convey the material and is probably one of the better teachers in the course. She seems to try her hardest to get people to pass the course, which is typically used as a drop course. Do the homework and the quizzes - she gives you extra credit for it. I MIGHT be able to scrape a D from the EC, despite getting really low exam grades. \n\r\n---Edit---\r\nI ended up with a C- due to the massive curve. Lucky me.", "rating": 3, "expected_grade": "C-", "created": "2011-12-14T14:39:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Mignerey was not a bad teacher at all. Her exams were very straight forward. The only thing is that, I wouldn't go to her for office hours because she spoke to me with a condescending tone. But her TAs really wanted us to do well so I went to them often. The class wasn't hard but do not ever wait until the last minute to do your mastering chem. But for chem131, I recommend her", "rating": 4, "expected_grade": "B", "created": "2011-06-20T00:29:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Dr. Mignerey is a very nice and interesting person.  I just could really get interested or engaged in that class.\r\nShe knows her material very well, but conveying it to the general public is not her strong suit and is very hard to follow along with when she gets lost in her own thoughts.\r\nHer exams are interesting. She posts a practice exam along with an answer key, but when the actual exam comes, there are several questions that were talked about for one lecture slide.  Things like that make the averages of the exam around a 55.\r\nI think that in this case, either you lover her or you hate her.", "rating": 2, "expected_grade": "", "created": "2011-05-14T16:55:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM146", "review": "Dr. Mignerey is a really nice lady and she really cares about her students. She gave us plenty of opportunities for extra credit and has office hours all day the day before the exam. Her quizzes are usually not too difficult and you can make up for any low grades with extra credit from the homework. In class she gives plenty of examples to help you understand the material. Her exams are generally not too difficult if you do your part which means doing the \"optional\" homework and completing her practice exams. Before every exam she gives us a practice test which depicts EXACTLY what will be on the exam. She doesn't expect us to memorize a lot of things so if you understand the material, you'll do well on the exam. ", "rating": 4, "expected_grade": "A", "created": "2010-12-17T23:53:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM271", "review": "GREAT Professor!  One of the few in the Chemistry department who WANT you to succeed and do well.  She is always open for office hours, and her powerpoints-style of lecturing is amazing.  If you miss a class it's fine, but better even that she highlights the MAIN concepts, and gives straight examples, so you know what the test will be like (exactly like the study guides).  Compared to Dr. Khan, whose averages hover around 50%, and he does concepts, Mignerey teaches by example, and if you attend every class, do the homework, and study hard the night before, and can memorize a few equations and use your brain to manipulate them on an easy 80 point exam, then TAKE Dr. Mignerey!", "rating": 4, "expected_grade": "A+", "created": "2010-05-04T00:58:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "This class has been terrible for me! The online homework took hours to complete, but wasn't worth many points. The practice tests weren't always accurate depictions of the actual test. I am doing poorly, and have to drop the course! Do not ignore these reviews. Some people don't mind her, but she didn't work for me. Be cautious when choosing this professor!", "rating": 1, "expected_grade": "", "created": "2008-04-07T00:27:00Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "A very sweet lady, but unless you really need or love to take chemistry, do not take this class. Mignerey did not know how to work the equipment in the room, and after wasting ten minutes of each 50 minute class, she presented bare-bones powerpoint slides that she just read off of the whole time. Also, you had to show up at the beginning of class to answer questions with your clicker, and many people just left immediatewly afterwards (which disrupted the class even further). Three tests and a final. And the accompanying lab is awful (Chem 132).", "rating": 3, "expected_grade": "B", "created": "2007-11-14T02:15:00Z"}, {"professor": "Alice Mignerey", "course": "HONR238G", "review": "A fine professor for HONR238G that was enthusiastic on the topic. Really bad with technology but she admits to it and I can't fault her for that. Did not have her for any CHEM classes so I can't comment on it.", "rating": 4, "expected_grade": "A", "created": "2018-05-11T00:05:45Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "If you haven't taken AP/IB Chem or are bad at Chemistry, DO NOT take Mignerey. Mignerey is a brilliant nuclear chemist but she is not a teacher. Her slides have many mistakes and she makes mistakes during lectures pretty constantly. She does release practice exams that are helpful for the first two exams but the last two killed me. If you do have to take her, make sure to keep up-to-date with discussion worksheets and find a good GSS session or tutor.", "rating": 2, "expected_grade": "", "created": "2019-12-13T02:31:31Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Worst professor I have ever had, if you have an option do not sign up for her lecture. I learned the entire course myself through reading the textbook and watching videos on Khan Academy. Her lectures are unbearable to sit through and she never explains what/why she is teaching what she is. She is smart and competent, but a bad teacher.", "rating": 1, "expected_grade": "", "created": "2020-03-26T17:17:36Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "She seems like a nice person. Now that that's out of the way, she isn't a great professor. She's always messing up in lecture and isn't proficient with technology. A lot of the ways she teaches concepts are unnecessarily hard. She makes a lot of mistakes while explaining concepts. That being said, she provides practice exams, which are essentially the real exam. But unless you find yourself going to GSS or office hours a lot, I would advise against taking her. ", "rating": 2, "expected_grade": "A", "created": "2020-04-16T14:57:32Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "She is a nice person, very sweet old lady, However, her class wasn't as sweet. Since school is online this semester, she just does not know how to teach over zoom. She is all over the place and when she finally lectures you literally only get a broad overview of the material. She isn't detailed in what she teaches which makes it hard to understand what's going on. She is not good at explaining the material. One question quizzes were given during lecture (meaning you had to go) and were quite frustrating. HW on TopHat and Chem101 were long and tedious and difficult( on Chem101). Tests were hard. It was a game of chance if the test was like the homework. It could be the same difficulty or easier, but sometimes the tests were much much harder than what we went over in class and the practice exams given. You really have to take in the time to learn the material so I would highly recommend GSS or Organic Chemistry Teacher on YT. Yeah she's nice but would not reccomend taking her. But if you have, PLEASE go to GSS or review often. ", "rating": 2, "expected_grade": "B-", "created": "2020-12-08T02:49:16Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Not ideal for online learning. Spends half on the lectures trying to figure out how to make her iPad show on the screen. She is not a good lecturer and constantly has mistakes on her slides which students have to correct. First 2 exams were hard but doable. 3rd exam was so difficult and half of the questions were concepts that we haven’t don’t in class. If you don’t have an extensive chemistry background then I do not recommend.  ", "rating": 1, "expected_grade": "B", "created": "2020-12-09T22:40:05Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Her behavior this semester was outrageous to say the least. She made sure our section knew she had a vendetta against us. Her emails towards us were disrespectful and childish. \r\nHer online lecture were so bad. She would constantly mess up and for god sake she couldn't use the ERASER tool. I had to spend time looking at her math to try and make sense of what she wrote. \r\nIt got so bad I ended up self teaching the class for the entire semester with a few friends. I will be the first to say I learned more from my study group than her teaching. \r\nOur 3rd exam had a massively low average. It was an outlier compared to the performance on our other exams. The only difference between the 3rd exam and the other ones was the fact that Dr. Mignerey made the questions. Instead of trying to understand what occured on her 3rd exam she decided to insult our section and justify why she placed every question on said exam. \r\nDr. Mignerey is a egotistical and sympathizing teacher. Avoid her and go for Papoian ", "rating": 1, "expected_grade": "A-", "created": "2020-12-15T20:16:04Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "She cares about the subject and seems like a nice person. However, if you are not doing good in the class or if the class teams up to achieve a better grade she pulls out attitude. The exams weren't that bad for online classes since they were on chem101 not canvas. The last midterm is worse than the final exam. She is understanding and flexible if you have a problem or need to take the exam at a different time. Overall, not a bad teacher. ", "rating": 3, "expected_grade": "B+", "created": "2020-12-17T19:46:12Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "In a bubble Professor Mignerey is a cat lady @daisy.\r\nBut actually.\r\nShe was not the greatest teacher out there, but also not bad. What she lacks in clarity though she makes up for in good character. For more than one test she allowed students to take a retest. She also was generally pretty good about communication, which I've realized is super important. Some other teachers don't respond to emails ever.\r\nIt's not a very tough class. If you're some who's solid at chem, you'll probably fly through this class pretty easily. If not, just try to pay attention in class, and (more importantly, I think) do the Homework. The HW is the exact same form and website as the tests, so questions are similar. If you understand the HW, you will do well on the tests.", "rating": 3, "expected_grade": "A", "created": "2020-12-18T17:13:09Z"}, {"professor": "Alice Mignerey", "course": "CHEM131S", "review": "I took AP Chem in high school and got the credit but decided to repeat the class for a review. This professor is pretty average. It is simple enough if you have a good chemistry background, but she can be quite difficult to understand and very mean when she answers students' questions. She does write out all the problems by hand which helps to explain a lot, but her tests can be quite tricky with the wording. I can understand why a lot of student's dislike her, but if you have a good chemistry foundation and can't take any better professors, Mignerey isn't the worst choice.", "rating": 3, "expected_grade": "A", "created": "2021-10-25T14:39:44Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Honestly Mignerey is probably average in comparison to the rest of the chem department which isn't saying much. She consistently says the wrong information in lectures and someone who sits in the front has to constantly raise his hand and correct her. She's very all over the place during class. The TA is even worse. On the first day of class she told us it's her first time in America and if we have suggestions on how to improve her english we should email her. Hearing that the first class I was initially concerned but thought \"how bad could she actually be?\" The answer to that is terrible. Any time anyone asks a question she just goes back to a random slide that has nothing to do with the question and points to it. Mignerey gives more than double the amount of homework as other professors give. Be prepared to have over 100 problems weekly for homework. I will say that the tests are somewhat fair if you understand what's going on in class. If you didn't take AP chem in high school though, be prepared to learn everything on your own. Also our last class of the semester we have an exam which was just lovely. She is pretty good at communication and responding to emails which is better than most professors. ", "rating": 2, "expected_grade": "", "created": "2021-12-08T02:04:34Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Professor Mignerey is not a good teacher at all. Her lectures go way too fast and she is terrible at explaining things. Her slides also have wrong answers sometimes. She quizzes up on problems that we just learned on TopHat for completion and correctness. Her exams are so unfair. The final exam had questions on it that we didn't even learn. She didn't give us a practice exam for the final and just told us to look at the midterm exams and chem 101. There were like 3 world problems on there that were on the midterms, otherwise all the problems are different and we couldn't even practice them. Do not take her class. Get another professor. ", "rating": 1, "expected_grade": "", "created": "2021-12-16T18:05:19Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Horrible teacher, good person. Her exams are extremely hard for no reason. She needs to explain topics better. Half of the stuff on the final exam was not on anything we learned in the class. Maybe I am just bad at chemistry but having a better teacher would make things better. I just wish the stuff she teaches would actually be on the exam and not other stuff.", "rating": 1, "expected_grade": "B", "created": "2021-12-16T23:06:35Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "I did not take AP Chem in high school and came into this class with just taking 10th grade honors chemistry. Here are some of my takeaways from this course\r\n- Professor Mignerey is a good teacher and person. Her lectures can be quite dry, but if you pay attention and follow along with her in class, you will have a much better understanding of the topic. Her office hours are very helpful and going to discussion is important to review the material\r\n- She gives daily in class quizzes on TopHat which at times can be challenging, but are usually on what we just learned in class earlier. \r\n- In terms of Homework, it's a bit on the heavy side but the homework genuinely helped me understand the material better. She assigns usually 2 Chem 101 quizzes per unit and 2 TopHat readings. The Chem101 problems are probably the most similar questions to the ones on her exams. Review those and understand those if you want a chance at doing well on her exams. \r\n- Her exams are tough, but relatively fair and cover most of the material in lecture however you do need to put in a bit of extra work and look over the Chem101 problems. - The final exam was long and the majority of the questions were questions we've had on previous exams just with different numbers. She did in fact tell us to study those and posted them with answer keys. \r\n- I recommend taking her if you are a chem major or interested in Pre-med and want to have a good base knowledge of chemistry before taking Orgo or any other chem class", "rating": 4, "expected_grade": "A", "created": "2021-12-17T18:35:39Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Alice Mignerey is a terrible Professor. I would give her 0 stars if I could. She doesnt know how to communicate her knowledge to the class at all and frequently glazed over the fact that only 20-30% of the class understood in class quizzes. Her exams are difficult and do not match her lectures what so ever. She doesnt post important math equations on her slides which makes questions impossible to understand if you are confused and need to review. If you have to take this course and you have no other option, Im praying you have taken AP Chem or at least have a strong background in chemistry. Avoid this course at all costs. ", "rating": 1, "expected_grade": "", "created": "2021-12-17T21:15:22Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Professor Mignerey can be nice but also condescending and its so discouraging to get LAUGHED at when you ask a question about a topic that is obviously hard for someone who doesn't have a PhD in Chemistry like her. This happened to multiple people, oh and she was also extremely rude to people who came in to fix simple technological issues that she could not figure out. This class is so heavily dependent on the exams which makes it so stressful, and the final was hard. Although chemistry is gonna be hard with any professor most likely, you are probably better off with a professor that tries to be understanding so take someone else.", "rating": 1, "expected_grade": "", "created": "2021-12-19T07:09:46Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Knows what she’s doing, lectures are mainly her doing practice problems and not going over any actual material. Classes are mainly her proving that she knows how to do the problems.  I would recommend doing the readings before the week starts to understand anything during class.  Huge curve tho  ", "rating": 1, "expected_grade": "", "created": "2022-01-12T01:32:18Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Honestly, if you do not have a good background in Chemistry. I would say avoid her like the plague. Unless you have an AP Chem background or feel like you have yourself together and can go above and beyond to get help from outside resources (GSS, Khan Academy, Academic Tutoring, etc.) then this is not the class for you. Her Exams were HARD, the final exam was even worse. Only thing that saved me was the curve. She gives out way too many midterms, the 3rd midterm is most likely to be the lowest grade (If you do decide to ignore this warning and take her class), since it's literally 2 weeks after the 2nd midterm. Mignerey as a person, she's a nice person BUT she can be very rude at times and oblivious to the idea that half of the class can be completely lost and she'll still move on like everything is going 100% well. I studied, went to GSS, looked at online Youtube videos and still didn't do as well as I wanted to, BUT I PASSED. So it's doable, but your stress levels will definitely be through the roof over this one class. But also bare in mind, I did not have a strong background in Chemistry at all. ", "rating": 1, "expected_grade": "", "created": "2022-01-13T18:13:10Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Professor Mignerey accused me of being a liar when I asked her about inconsistent grading on her test, when a classmate received credit for the same work that I did, when I had not. She is rarely available, pretty rude, and practice assignments do not correlate with the tests provided. You will be relying on Organic Chemistry Tutor on YouTube for learning this material. Would not recommend unless you have a really strong background in chemistry, and even then you could find a better professor.", "rating": 1, "expected_grade": "A-", "created": "2022-02-06T22:19:33Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "The reason I did well in this course was because I knew most of the content from high school. The lectures were not that helpful and I found myself relying off of instincts I developed in high school instead of paying attention. The averages on exams were incredibly low (in the 50s and 60s), although the class had a very generous curve at the end (at least 6%). The curve is the only reason Alice is getting more than one star.", "rating": 2, "expected_grade": "A", "created": "2022-04-23T21:08:11Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Not a friendly person, was an average lecturer at best. Exams were difficult, but she gave practice exams that were very similar to the actual exam. Gives a generous curve at the end of the semester.", "rating": 3, "expected_grade": "A", "created": "2022-11-07T03:12:02.819690Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "everything written about her on here and rate my professors is correct, perhaps even worse. take that as you wish.\r\nthe exams are whack, she gets her own problems during lecture wrong and then gets fiesty when a STUDENT fixes her mistake.\r\nshe doesn't answer emails, only reason I might pass this class is because of the TA's and GSS sessions. ATTEND EVERY SINGLE ONE! they're the only place you're going to learn anything. she assigns you 50+ questions a week that are 100x harder than what you've seen in class, and expects you to get that down on top of an exam every 3 weeks and learning the material. her averages ranged from 52-63, nothing ever higher. i don't know one person who has passed one of her exams with an A. i strongly recommend taking ANYONE BUT HER IF YOU CAN! FOR YOUR OWN SAKE!", "rating": 1, "expected_grade": "C+", "created": "2022-12-05T03:34:14.857906Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Regularly copies things down wrong or makes mistakes while demonstrating examples, then when everyone is confused acts like we’re all stupid. If she finally realizes her mistake, Mignerey goes around in circles instead of reexplaining. Hostile to people who ask questions during class, but also unavailable during office hours. Pray that you get a different teacher.", "rating": 1, "expected_grade": "A", "created": "2022-12-05T15:32:18.966957Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Do not take Mignerey. Dr. Mignerey is one of the worst teachers I have ever had. She consistently makes mistakes while doing problems and when students are confused, she is condescending and rude. She also consistently skips steps in example problems leaving students lost, and unable to follow without explaining the steps she has skipped. She makes every topic much more confusing than it has to be. She also assigns an astronomical amount of homework that is due Monday nights and sometimes does not teach the material until that Monday leaving those with busy Mondays completely screwed. Dr. Mignerey teaches badly, is condescending, and is never there for office hours.", "rating": 1, "expected_grade": "B", "created": "2022-12-05T16:47:18.559482Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Mignerey was the reason I dropped premed and decided to go into business.  She does not give time for students to process the information that they are learning. When lecturing, she messes up her own problems and then the TA has to call it out. The whole class would follow her until someone decides to speak up and she would then fix it. The only good thing about chem are the discussions. Please go to the discussions because those are the reasons why you will pass the exams. Before withdrawing and getting first hand experience from my friends, she would give multiple chapters of reading along with the learning curves and hw that would all be due in a week.", "rating": 2, "expected_grade": "W", "created": "2022-12-08T22:06:17.277444Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "I feel like her exams do not reflect what she teaches us at all! I feel confident going into every exam, I understand the review guides, did well on the homework, go to lectures, etc... yet do so terribly on the exams??? and It's not just me the averages on the exams are embarrassingly low. I understand this is a difficult course but I'm not sure what else one can do to improve. The only reason I did alright in the class is because of the TA, Sam who is very helpful. He also teaches the discussions and goes over practice problems during those so definitely don't skip! If you ever have to email Dr. Mignerey also email Sam because he will respond within minutes not days.", "rating": 1, "expected_grade": "B", "created": "2022-12-15T01:01:09.213373Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Please don't listen to these other reviews. Mignerey is not good, but easily the best chem131 professor available. Guest is terrible, Baxter is brand new and gives students no material to prepare for tests with, averages in both classes were 50s and below. Literally just go to class and discussion and GSS if you're still confused and you'll be fine. She posts practice exams a week before each exam that are basically the same as the test. Plus Sam (TA) and Jen (GSS) are so so so helpful. Take this professor I promise.", "rating": 5, "expected_grade": "A+", "created": "2022-12-15T01:52:47.044103Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "I'd say your grade in this class depends entirely on you. Mignerey's lectures aren't helpful, she goes way too fast, doesn't transition well into topics, and never explains anything conceptually. It's up to you to go through the textbook and teach yourself. BUT she's not as bad as everyone else says though - her exams are pretty similar to her practice exams. Sam, the TA, is also really helpful, as well as Jen (GSS). If you know how to self-study you should be fine. My best advice is to attend every discussion with your TA and go to GSS as much as you can (especially the ones before exams). Baxter's definitely better, Guest is um no comment but I just wanna emphasize that Mignerey isn't totally horrible.", "rating": 3, "expected_grade": "A", "created": "2022-12-15T19:58:20.153378Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Honestly not that bad. If you were an A student in high school, you're gonna be an A student in this class. A lot of the reviews about mignerey are incorrect. She was nice and provided a lot of material to learn and prepare for the tests. The final exam was whack though and nearly impossible! Definitely the best general chemistry professor available.", "rating": 4, "expected_grade": "A+", "created": "2022-12-15T22:27:40.277824Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Honestly, I don't even know what to say. I have never felt this bad about a class in my life. This class is very draining and it's even worse when the professor is no help. She doesn't explain concepts well during lectures and I can only get proper insight when I go to discussions. When students ask her questions during lectures, she doesn't know how to answer them at all and usually the TA steps in to help. I'm glad we had a good TA because without Sam, I wouldn't have been able to do as well(barely) on the exams. Even though I understood the material, the exams did not reflect well. It was sometimes hard understanding what the questions were asking. Her midterm averages ranged from 50s-60s. Also, her last exam is a week before finals which seems like a set up for failure in her class. It just makes no sense and gives us little time to study for the final which is cumulative. The final was a total fail and I am only hoping she gives a really generous curve because that is all I am relying on right now. Allegedly, she gives a generous curve at the end and if she does I could possibly get a C-.", "rating": 1, "expected_grade": "C-", "created": "2022-12-16T18:14:42.780753Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "She's definitely not as bad as people make it out to be. It's going to be difficult to understand what is going on in class if you don't read the textbook since she doesn't really cover any conceptual ideas and if she does then it's covered in a very short amount of time and difficult to understand. The class is mostly going over practice problems and she does move fast but that is expected since they are only 50 minute lectures. She gives practice exams that are very similar to the actual exams that you receive, so as long as you understand how to do those and are able to do problems that are slightly different than the ones given on the practice exams then you should be fine. The averages on all of the midterms were in the 50s to low 60s and the final's average was in the low 50s, but don't let this scare you because as long as you put in the work then you'll do well. Before the exams always make sure to first have read all of the required chapters in the textbook and understand the concepts, do the practice exam given, and do the worksheets that are made by the TA and GSS leader. This is a very exam heavy class where your entire grade is entirely determined on the exams so make sure you don't slack off with not studying for an exam as it will be difficult to recover your grade. The word problems on the final were definitely more difficult than on the midterms in my opinion but it is still very attainable to get an A on the final.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T20:19:37.957779Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "All the positive reviews were given by the few students who fully understand chemistry and found this class to be easy, so I would advise that most students reading this do not listen to them unless you fully understand chemistry too. This is the absolute worst class I have ever taken. During finals week, this one class caused me so much stress that I physically couldn't eat. I was always hesitant to ask Mignerey a question, but one day I did, and she was very rude in her answer. During lecture, she goes way too fast and does not explain stuff well. If you ask her a question, she'll answer it in the most condescending way and then say \"right?\" while laugh. The only reason I passed this class was because of the homework. If you fail the exams but do all the homeworks, you should pass. Surprisingly, her curve was 20% so I passed the class with a 50%.", "rating": 1, "expected_grade": "C", "created": "2023-01-05T00:00:36.355807Z"}, {"professor": "Alice Mignerey", "course": "CHEM403", "review": "The only reason Prof. Mignerey is getting three stars and not one is for two reasons. Firstly, Radiochemistry is her specialty. She was proud to teach us all about her life's work and was excited to teach everyday. We even took a class trip to visit the reactor! Secondly, ALL of the exams, including the final exam, were take home! She would make the exam available after class on Friday and it would be due Monday by 11 am. We could use any resources we could as long as we didn't work with each other. \r\n\r\nThat's about where the positives end. Prof. Mignerey would spent way too much time during class logging in and keeping track of files on her laptop. It was like a geriatric was just discovering what a computer is. She didn't even know what minimizing and maximizing a window did. It was excruciating. She had a very confusing lecturing style when writing on the blackboard. You kind of had to just write everything down and try to decipher it later. She also said that the material for the course is more like a graduate level course and it felt like it too. The exams, even though they were take home and open note, took me hours to finish. All in all, this class was worth it for an upper level chem elective.", "rating": 3, "expected_grade": "B", "created": "2023-01-18T08:25:00.764526Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Other comments basically say what I want to say, and one more thing I want to ask, this professor gave the practice exam and her actual exam have anything to do with it??????", "rating": 1, "expected_grade": "A", "created": "2023-03-03T23:35:47.488287Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "if i could do 0 stars i would. ended up failing and retaking with dr. guest which is much better. mignerey did not teach at all.", "rating": 1, "expected_grade": "", "created": "2023-04-29T21:45:25.875140Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "She straight up doesn't know chemistry. All she does is ask the TA for help and tell students to read the textbook because she has no clue what is going on and if she does she can't communicate it. She makes mistakes in every lecture and often has to \"give up\" on problems because she can't figure them out. I learned nothing. biggest waste of my time and money.", "rating": 1, "expected_grade": "", "created": "2023-05-01T17:12:56.340816Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "I see a lot of poor reviews about Prof. Mignerey, and I really think for the most part they are about the class and less about her. She is not nearly as bad as described. She mostly does practice problems, which I actually find very helpful. If you can review the material a bit before class to get familiar with the concepts, the class is almost like free study time. If you go to office hours, do the homework, and put in the effort, you should be okay. It isn't an easy class, but she really isn't that bad. She always gives practice exams which are very similar to the real thing, and the homeworks are always more difficult than the exams. She can come across a bit condescending at times, but otherwise she is a fine professor if you're willing to do some work.", "rating": 4, "expected_grade": "A", "created": "2023-05-02T01:08:39.667617Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "she did not teach the material, she just did practice examples in the lecture and assumed we knew things from the textbook. I was told by the TA that she is there to \"clarify the material, not teach\" and that we should be primarily learning through the textbook. So why shouldn't I just self-teach the class and save money? Which is pretty much what I ended up having to do. Even after reading the textbook and fully understanding it through that, mignerey made the material more confusing and after lecture, I felt like I was back at square one. I am inclined to think I would have done better in the course if I didn't go to the lectures. Without going to all the GSS, reading all of the textbook, organizing study sessions outside of class, and doing the discussion worksheets provided, I don't believe it would be possible to get through this class. This amount of work would make sense for a more upper-level class, but for Gen Chem, this seems ridiculous. I spent 4-6 hours on an average week just looking over material and studying/GSS on a NON-exam week. Plus the time it took to do the weekly homework which is at least an hour. At max (exam weeks) I spent 10/11+ hours working on this class to get [without the curve] around a B- (2 hours of GSS, 1.25 hours of lecture, 1 hour of discussion, 4 hours of group study, 3+ hours studying on my own). The average for exams we were told was about 45% for the first two which is ridiculous to me. at least there will be a good curve", "rating": 1, "expected_grade": "A", "created": "2023-05-03T18:26:25.553879Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "I literally stopped going to lectures after the second week of class because she spent the first 15 minutes each time struggling with technology. She also kept writing down incorrect things and fully relies on her TA Sam. He is great. If you do the homework you should pass but the average for every one of our exams was below 50%.", "rating": 2, "expected_grade": "B", "created": "2023-05-04T16:07:25.719024Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "I'm just going to reiterate what others said about Mignerey and give some more key points, it's going to be long but it is worth the read:\r\n\r\n-She would often go on tangents during lectures that weren't related to what we were discussing, making most of us more confused about the topic she was going over. \r\n-As someone said below me, she would also get confused about problems she was doing and then eventually say \"I give up\" on the problem (this was especially bad with the stoichiometry and combustion reaction units). \r\n-The practice exams she gave before tests were a \"review of concepts learned in class\" (as stated by Mignerey) they were way easier than the actual exams and not similar at all to the tests we took in class.\r\n- Each exam average was ~43 out of 100. For reference, my friends who had Baxter said the average was ~62. The average for our exams was also lower than ORGO averages.\r\n- I went to all GSS, lectures, and discussions, as well as additional studying, and still wasn't enough for me to do well \r\n-The students who did well in her class were either very proficient in chem, AP chem students retaking the class, or those who studied over 10 hours a week outside of the class (I mean it's possible but I had a busy schedule and like sleep), and the small few who are just naturally good at it.\r\nProfessor Mignerey is a very nice person but an awful teacher who could not teach to save her life and is very stuck in her ways. She is considerate of your questions and does try to answer them to the best of her ability, but her teaching style is terrible and the exams were unnecessarily hard. If you have to take 131 I would suggest getting Baxter, she teaches well and her exams are hard but fair.", "rating": 1, "expected_grade": "", "created": "2023-05-05T23:52:40.217397Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Absolutely the worst teacher I have ever come across. She is rude, condescending, and makes you feel completely stupid if you ask her to clarify something. Never have I experienced so much anxiety and cried because of one class (an introductory level class too) because of a teacher. Had I taken this course with any other teacher, my grade would be much better. Don't even think to take chemistry with her, she doesn't know how to teach the material. Her TA Sam, is excellent and is the only reason I even understand anything that she says.", "rating": 1, "expected_grade": "", "created": "2023-05-15T13:50:37.118899Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "absolutely not. take anyone. anyone else. guest and baxter both get an exam dropped and baxter in particular gets an exam replaced if you do better on the final. both classes also have multiple choice whereas Mignerey does not and they get a equation sheet with much much much more information than we did since she expected us to memorize literally everything. unless you've taken AP chem and thought that it was the easiest thing you've ever done, DO NOT take her class. Our exam average was 42% with a general class average of 52% and then she proceeds to blame us for the terrible averages????? she's condescending when you ask her questions and seems like she purposely ignores hands that are raised. Sam, the TA, is extremely helpful and nice so if you get stuck with Mignerey definitely rely on sam to actually you teach you the concepts. She expects you to go into lecture already knowing the information and only goes over practice examples in class and that's all her lecture slides are. literally all math. the math itself isn't hard but the way she expects you to know what to do and when to do it can be confusing. i swear she wants her students to fail. there's supposedly a 20% curve and her final exam was literally just awful. I studied a week straight ignoring my other classes for the final studying what she SAID would be on the exam. still had to leave 3 questions blank. After the first exam and realizing I was fcked, i proceeded to have a mental breakdown every single time before the rest of her exams :)There are also upperclassman that re-take her class which kinda messes up the curve but they have to because if you re-take the course with a diff professor you'd literally have to learn new things all over again since she teaches whatever she wants to and its very different from the other classes' material. \r\nIf I could give her negative 5 stars I would. By farrr the WORST prof I've ever had and i am genuinely so sorry to anyone that has to end up taking her.", "rating": 1, "expected_grade": "B-", "created": "2023-05-17T16:06:01.980490Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "-expects you to know all the material before lectures, doesn't teach in class and just goes over problems so her lecture slides are fully filled with just math \r - she's condescending and ignores raised hands\r - Sam (the TA and extremely helpful and nice) has to always correct her in lecture \r - our exam average was a 42% and a general grade average of a 52% and she blamed it on us \r - pretty sure she doesn't care if you pass or fail\r - homework can save your grade\r - just don't take her\r -other profs get multiple choice and equation sheet, mignerey does not \r -final was terrible, she just straight up put random things on it \r - even if you think your good at chem, take anyone else bc this class material is so so different from the other classes and you will 100% do much better in literally any other prof", "rating": 1, "expected_grade": "B-", "created": "2023-05-17T16:12:59.902832Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "The professor views teaching college courses like this: the student learns concepts on their own essentially via the textbook they should read before class (and in general ofc). The prof's role is to simply lecture important concepts but at a very basic level of understanding and does the math problems over and over again. The TA's job is to actually TEACH the material to you and help you understand concepts and the math all together. If you want a prof who will actually teach concepts, do not take mignerey. The exams are tough, but I found after the first exam you need to utilize the textbook in order to do well. A lot of studying and time going into the tests and homeworks. The only grades are the 3 midterms, 1 final, the homeworks totaled to 100 points, and learning curve totaled to 50 points. DO THE HW!! If you find yourself taking this course and not chem oriented, my advice as someone who is the same: go to GSSs, utilize the TA (Sam is amazing) and ask questions, utilize the textbooks, and truly understand the practice exams she gives before tests, not just memorize the way she presents problems on there (practice exams are different from actual tests, but basic concepts are still present).", "rating": 2, "expected_grade": "A", "created": "2023-05-18T15:45:20.213895Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Couple things:\r\nGreatest prof out there? No. Easiest class? Maybe if you took AP CHEM in HS/good at chem, if you don't fall under those categories, it will be very hard. However, some people I think make it seem like her class is the hardest thing anyone will ever take (which could be the case as well). The prof expects you to read the textbook to understand the concepts and she'll do the math for you doing lectures to show you how to do it. IMO, as much as I prefer profs to go over concepts, this does not make her some horrendous prof. Many classes require you to read their textbook, simply how college goes. Another thing, yes she did make mistakes during lecture, but some people make it out to be like she was all over the place and was not conveying the correct methods of how to solve problems. She might forget an extra number, put it in her calc wrong, add instead of subtract, small things like that where 99% of the time, her mistakes were caught and corrected. Overall, her doing problems during lecture was not confusing. In addition, yes she can have a bit of an attitude, but it was not as horrible as some people took it to be. I do not think she was having malicious intentions, I think she just does not realize her response is a bit standoffish and possibly seems rude at times. Not excusing it, but also being more realistic about it as there was times she had been objectively rude. A lot of people expected I feel for her to hold our hand thru this, but she simply will not do this. Exams were a lot and you have to put in the work for it. While a 100 level class, it is still a weed out class unfortunately. Utilize GSS, TAs, and the textbook and you'll do fine. DO NOT EXPECT THE PRACTICE EXAMS TO BE THE SAME AS THE TESTS!! She writes up the tests in such a way where you need to completely understand how the equations for various problems work and what the question is asking for; simply memorizing how to do the practice exams will get you a bad grade. I know this is long, but last piece of advice: put in the work, utilize all resources, and don't expect the prof to solely get you thru this course.", "rating": 3, "expected_grade": "B+", "created": "2023-05-19T02:25:52.138531Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "There are a couple problems I have with Mignerey. Lectures were mainly practice problem based which I arguably liked because it helped a lot when understand some problems. I will say that it made the class rather boring though. She made many mistakes during her lectures and would sometimes have to have the TA, Sam, help out because she couldn't figure out what she did wrong. The class average was extremely low which is great if you're on the curve, but not so great if you want to actually understand chemistry. Mignerey herself isn't the worst, I do believe she doesn't want the class to be seen as a \"weed-out\" class. But the class itself is so difficult that it makes it appear that way. Now lets talk about her final, her final was really hard. While Baxter was doing stoichiometry on their exam, Mignerey was doing complex thermodynamic questions. PRIOR, to the final exam I think she realized that her class average was so low that she was trying to give us options to help us pass the class (which is a good thing.) For example, she offered that if you were able to \"pass the final\" (meaning getting anything above the avg on the final) she wouldn't give you anything less than a c-. HOWEVER! She only OFFERED that during the spring 2023 semester, and she didn't offer it during the Fall 2022 semester. Finally, I actually passed chemistry with a 40% in the class. Which means her curve was roughly around 30%. In conclusion, if you want to understand chemistry I would probably suggest taking someone else. But if Mignerey is your only choice, just be prepared when it comes to doing a lot of self studying.\r\n\r\nP.S do the homeworks, they actually have a huge impact on your grade. They're are freebie points and will boost your grade a lot near the end of the semester.", "rating": 2, "expected_grade": "C-", "created": "2023-05-23T04:41:28.638972Z"}, {"professor": "Alice Mignerey", "course": "CHEM131", "review": "Never went to class because she was bad at lecturing. Sam, the TA was godsend. He was incredible at teaching. If you needed to learn, discussion was the most useful. The averages for exams were mid 40s but there was a 15% curve. I took AP chem but the questions in her exams were tricky and unusual.", "rating": 2, "expected_grade": "A-", "created": "2023-05-27T01:44:18.783094Z"}, {"professor": "Alice Mignerey", "course": "CHEM271", "review": "Great professor, knows what she is talking about. The classes she teaches are difficult classes so this is why she tends to get bad reviews. Her test are fair and just like any other teacher teaching the course.", "rating": 5, "expected_grade": "A+", "created": "2023-10-17T14:06:59.319302Z"}, {"professor": "Alice Mignerey", "course": "CHEM271", "review": "I love prof.Mignerey! She taught us everything that we needed to know for our exams. Exams were very fair and her office hours were really helpful. Overall 10/10 and would take her again.", "rating": 5, "expected_grade": "A+", "created": "2023-10-17T23:41:02.713448Z"}, {"professor": "Alice Mignerey", "course": "CHEM271", "review": "Mignerey is a great teacher who actually teaches us everything we needed to know to do well in her class. Her exams were EXACTLY like the practice exams. She was great at showing us the problems we had to solve and show us how to do it while integrating the concepts.", "rating": 5, "expected_grade": "A+", "created": "2023-10-27T15:24:24.626107Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "The most boring and horrible professor I have ever seen. If you haven't taken AP Chem or reviewed chem in the past year you are screwed. The only way to learn in her class is to do the homework which takes forever if you don't know what you are doing. Lectures are extremely boring and are mostly filled with examples that tell you nothing about what will be on the homework. Please switch to another professor!! The only good thing was that her practice exams and her exams are the same format.", "rating": 1, "expected_grade": "A-", "created": "2023-11-01T18:03:00.484599Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Pick anyone other than Mignerey for CHEM135. We have a homework software(ALEKS) that takes the whole day just to do. Not only that but her lectures are so boring, you rather just look at her posted slides and watch videos to get by. Don't rely on her practice exams that she provides, they not similar. All her exams are just calculations problems and more difficult than other chemistry professors like Griffith. Always take Griffith for CHEM135.", "rating": 1, "expected_grade": "C-", "created": "2023-11-12T23:33:42.679619Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Her lectures are not that helpful, but if you use the textbook, the class isn't nearly as bad as what other people say. Her teaching style is definitely not good, but she makes up for it with her exams that are very similar to her practice exam format, and she also gives a list of the exact topics you will need to know, which is also quite helpful for preparing for exams.", "rating": 3, "expected_grade": "A+", "created": "2023-11-30T14:50:00.520481Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Mignerey is genuinely the worst teacher I have ever had in 13 years of schooling. There are so many complaints I don't know where to begin. For starters, her lectures are absolutely useless. Her lectures consist of her copying down her slides (which look like they were last updated in 2008), fiddling with tech that she doesn't know how to use, and making mistakes upon mistakes COPYING down her OWN work. She makes so many mistakes in her lectures that many students find it more useful to NOT attend her lectures and read the slides themselves. On top of her terrible, almost non-existent teaching skills, she assigns the most painfully tedious and boring homework. No joke, I have recorded almost 90+ hours on ALEKS (the homework software) which she also assigns over \"break\" and holidays. Her practice tests may be similar to the actual exams, but the exams themselves are created in ways as if it seems she wants the students to fail them. Additionally, for some reason she decides to have four midterms, the last of which is A WEEK before the final exam.  Although the TA tries, she is unable to makeup for the horrendous teaching practices of Mignerey, If you need to postpone taking chemistry for a semester I would STRONGLY recommend that over wasting a hundred hours on a teacher that doesn't even care about teaching her class.", "rating": 1, "expected_grade": "B+", "created": "2023-12-05T01:35:11.072043Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Definitely not the professor you want for chem. If you are good at teaching yourself, then you'll be fine, but otherwise, I would recommend avoiding her.  Her lectures are just her flying through PowerPoints (too fast to write down notes) and talking about examples of topics that she barely even taught us, and the discussions didn't help much with that either. The only thing that I actually learned from were the homework assignments. The one good thing though is that she gives practice exams that are pretty similar to the actual exams, and she does have a decent curve at the end of the class. Also, she does grade very quick, so you don't have to worry about that. Overall, it was between a 2 and a 3, but I chose 2 just because of how confused I was taking her class. If you can get a better professor, go for it, but if you get her, its not the end of the world.", "rating": 2, "expected_grade": "B+", "created": "2023-12-06T21:09:52.121312Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Avoid choosing this professor at all costs!  Her lectures are not that helpful, and the homework software (ALEKS) is not representative of the material on the test.  She assigns multiple (40 topics) that have 5 questions in each topic, you will be doing chemistry homework all night with little reward.  Yes ALEKS teaches you better than she does but the test looks nothing like the homework.  I HIGHLY recommend choosing another professor as this should be a VERY LAST RESORT, I would recommend dropping out before taking this class.  Practice exams are somewhat helpful but she makes multiple errors and is always correcting mistakes that others find.  Lastly, DO NOT TRUST the fake responses below saying she is amazing because they are just trying to boost her rating.", "rating": 1, "expected_grade": "C-", "created": "2023-12-07T04:24:46.333909Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Mignerey is the worst teacher I have had in thirteen years of school. Her teaching style is nonexistent as the majority of her lectures consist of her failing to set up technology, copying down the slides, and making COUNTLESS mistakes. In fact, her lectures are so poor that the majority of students feel like its more beneficial to not attend and just look at the slides, as her narration makes concepts MORE confusing. On top of her terrible teaching she assigns hours of tedious homework as if this is the only class the students are taking. Although the homework software, ALEKS, does help students learn; it ends up taking 95 hours of your semester to complete (seriously  -- and she assigns work over break) . In addition to her terrible teaching and tedious homework Mignerey structures her class to have four midterms, the last of which is taken only one week prior to the final exam. These exams do not test your knowledge in the course as Mingerey randomly cobbles together niche topics from her slides. The only reason I was able to get an A in this class was because I put over 100 hours of self study time ( which is completely unnecessary when better teachers exist). DO NOT TAKE ALICE MIGNEREY, restructure your schedule if you need to.", "rating": 1, "expected_grade": "A", "created": "2023-12-09T21:44:44.289491Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "If you have to take CHEM135 at UMD then please take another professor. She teaches solely using half assed slide decks and never puts any effort into teaching in an engaging manner or in any manner that allows students to learn well. The practice exams she posts to review for the midterms are much easier than the actual midterms so you always go into tests feeling better than you should. On two tests this year there have been questions that were simply never covered in class. The homework software (ALEKS) that all students have to use is horrible and takes an ungodly amount of time ( I spent over a hundred hours just on homework this semester), and is the only way anyone actually ends up learning any content. PLEASE switch teachers if you have her or simply drop the class and take it another semester as it is simply not worth it. I would give her 0 stars if I could.", "rating": 1, "expected_grade": "B-", "created": "2023-12-10T20:29:44.328941Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Lectures are so boring and unhelpful. She has a bunch of example problems that she'll go through each class, but she reads everything off the slides as if you already know it. The homework was tedious and took a ridiculously long time, but it was also the only way I learned anything in this class. She provides good study materials but I basically had to teach everything to myself. This class isn't hard if you take it with a different professor.", "rating": 2, "expected_grade": "A", "created": "2023-12-12T03:43:42.117086Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Do not get me wrong, Professor Mignerey is a very brilliant woman but she should not be teaching this course. Do not take her for chem135, I have spent 148hours on my homework she gives this semester alone. She provided 4 midterms this semester, the last one being the second to last day before finals. On one of my exams she gave me 0/8 points for a problem but gave a fellow classmate 6/8 points on the same question when we both had the same work and the same answers. She lets you submit regrades but sometimes she will take away points during a regrade. Her grading is so inconsistent.", "rating": 1, "expected_grade": "C-", "created": "2023-12-15T04:53:29.898258Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Mignerey got to be the most  useless professor I have ever seen. Not only her lectures so bad you wish you haven’t taken this class altogether, but also she just so boring. If you’re not good at chemistry then don’t bother even taking her class. She never explains the concepts well which makes it harder for beginners to do well at all in her class. Her supposed practice exams were never useful at all because they were made easier than the actual exams. The only thing useful from the practice exam are the same style and format that is written. I’ll say take any other professor for chemistry as a whole other than Mignerey. She just a poor professor overall.", "rating": 1, "expected_grade": "C", "created": "2023-12-21T08:39:57.216325Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "She’s really not a great lecturer and her exams are tough to boot. Expect a MASSIVE curve in her course, average going to a B, ~15%. Ingratiate yourself with a TA, it’s much needed when she struggled to convey concepts in a cavernous lecture hall.", "rating": 1, "expected_grade": "B-", "created": "2023-12-21T16:39:10.653441Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "So, in short: should you take Mignerey for CHEM135? Definitely not if there are any other professors available. Or even if you can take the course next semester instead. But if there does happen to be an unfortunate turn of events and you do have to take this course, I guarantee that you’ll be fine. You’ll probably learn more from this class than any other class you’re taking - not about chemistry, but about how to deal with a whole lot of setbacks. Our class average prior to the final exam was ~55%, to which Mignerey responded “that’s a little bit lower than I expected - I like to aim for 60.” Suffice it to say that the exams are rough. They typically include information Mignerey says won’t be on the exam, so if she says it won’t be there, study it. That’s the gruesome beauty of this class - as much as it sucks, if you adapt to it you’ll be able to pull through. It’s worth noting that the curve is just as insane as the averages, meaning that your average 55% grade will translate to roughly a B-. As long as you pay attention and study, your GPA won’t take too much of a hit. And on the bright side, your friends from this class will be your comrades for the rest of college. Suffering has a way of bringing people together, and this class is a whole lot of suffering. Between the inane lectures where Mignerey frequently makes odd noises, the intentionally confusing exams, and the copious amounts of homework, this class deserves its infamy. Never before have I been so happy to get a C+ on an exam, or to leave a lecture hall at the end of a long day. And in spite of all of this, my GPA has stayed fairly healthy and I’ve learned a lot of hard lessons through this odd experience of a class. Relax, take a deep breath. Even if it feels like it sometimes, Mignerey’s class is not the end of the world. Adapt and you’ll be just fine.", "rating": 2, "expected_grade": "A", "created": "2023-12-30T14:42:47.204913Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "This professor is very condescending to all of her students and only does practice problems for lectures. The homework software Aleks was about 50 dollars to access and do homework. The homework is very long and complicated with your progress regressing for wrong answers. Avoid her at all cost for CHEM135. The only redeeming quality was her curve at the very end of the class, the average was about 65% and I had a 60% that turned into a C+. If you're stuck with her good luck.", "rating": 1, "expected_grade": "C+", "created": "2024-01-06T02:51:26.947127Z"}, {"professor": "Alice Mignerey", "course": "CHEM403", "review": "Mignerey will fight her computer every class, but she is extremely smart and really wants you to understand the material. Radiochem is by its nature a difficult class conceptually, but she tries her best to make the grading easy. All of the problem sets and exams were open, take-home. You get to go on a tour of the nuclear reactor on campus as a field trip which was very fun. The textbook is horrific, but you can find it online for free. Don't skip this class because you will be lost.", "rating": 5, "expected_grade": "A", "created": "2024-01-16T22:38:00.169725Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "She is horrible at teaching, she ignores your questions, is super rude and thinks you're dumb if you ask her a question during class. She only does practice problems during class without teaching so you cant really follow along cause she never taught us how to do it just makes us watch her do it. she assigns homework that take 8 hours to do and im not even overexaggerating... please if you have to rearrange your schedule or put it off a semester just please do not take her, she will probably spend 90% of class figuring out her computer and then mumble and give attitude to everyone for the rest of class.", "rating": 1, "expected_grade": "F", "created": "2024-02-09T16:41:22.596100Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "She was a terrible professor for CHEM135, banning us from using TI84 (or any other programmable) calculators on tests. Furthermore, the class (which is supposed to be chemistry for engineers) felt like a general chemistry class, and many of us still cannot see how it relates to our degrees (especially if the degree only requires CHEM135), while I heard that other professors connected it to engineering. Other than that, the homework is assigned in a terrible website on which if two different assignments are due on one day, the second assignment will not even be accessible until the first one is completed. \r\n\r\nWhile she did provide practice tests and office hours (in which she was willing to answer any questions), her answers were quite harsh (like a strong callout) and they could have been more constructive.\r\n\r\nIf you end up enrolling for her CHEM135 class, I recommend you to unenroll and (if all other classes for the semester are full) take it next semester with a different professor or split up the chemistry requirement into CHEM131 and CHEM134.", "rating": 1, "expected_grade": "", "created": "2024-03-03T16:28:51.232157Z"}], "name": "Alice Mignerey", "slug": "mignerey"}