{"courses": ["JOUR130", "JOUR130", "JOUR130", "JOUR130", "JOUR130", "JOUR130", "JOUR130", "JOUR130", "JOUR130", "JOUR130"], "average_rating": 4.9, "type": "professor", "reviews": [{"professor": "Amber Moore", "course": "JOUR130", "review": "She is amazing! Such a great speaker and person. We had a total of 6 presentations and one big final paper, but the topics were interesting. She will definitely help you improve you communication and presentation skills. You'll get an A if you do the work and participate. This class was a life-changing experience; I would take her again if I could!", "rating": 5, "expected_grade": "A", "created": "2019-12-21T00:49:22Z"}, {"professor": "Amber Moore", "course": "JOUR130", "review": "She is an amazing professor. I often struggled with public speaking and honestly if you just put in the effort and truly show improvement she is most likely going to give a good grade on your presentations. ", "rating": 5, "expected_grade": "B+", "created": "2021-12-09T20:26:55Z"}, {"professor": "Amber Moore", "course": "JOUR130", "review": "Professor Moore is well-suited for this class. She is so encouraging of her students and allows students to take their time to emotionally prepare before speaking which I found extremely helpful. She doesn't want students to fail or do bad in her class and you can clearly see that in her teaching!", "rating": 5, "expected_grade": "A", "created": "2021-12-14T02:52:55Z"}, {"professor": "Amber Moore", "course": "JOUR130", "review": "It was great to take a class on communication from someone who has real-world experience speaking in front of a TV camera! You can tell she wants the students to learn and succeed and will answer any questions and doubts you may have. Although I took it for a general education credit, I learned some information about public speaking and video recording which I will use in the future. The class isn;t difficult, mostly just reading from a textbook and then several projects.", "rating": 5, "expected_grade": "A+", "created": "2022-02-07T23:13:59Z"}, {"professor": "Amber Moore", "course": "JOUR130", "review": "You have to be good at public speaking in order to expect a good grade. She does not grade off of improvement but rather a rubric that applies from beginning to end. As long as you can follow her rubric then you'll be fine. If you want an easy COMM class, this one is not the one to take.", "rating": 4, "expected_grade": "B", "created": "2022-11-30T19:45:17.864860Z"}, {"professor": "Amber Moore", "course": "JOUR130", "review": "Amber is a great teacher, very helpful, and knows what she is talking about. The actual class is easy, and her feedback is super helpful. 6 presentations and a mid-term, you will learn a lot about public speaking, definitely worth it, especially since it's an easy A Oral Com gen ed. My only complaint is that the last month was fully virtual for us(she didn't explain why), and that limited the presentations. Be creative, she really grades easily if you are creative and put in the effort.", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T17:09:14.567374Z"}, {"professor": "Amber Moore", "course": "JOUR130", "review": "She’s definitely a strong lecturer and public speaker. She’s also invested in students - she’ll schedule a one-on-one meeting with you if you aren’t doing as well in the class, to answer questions about her feedback and help you make a plan to improve.", "rating": 5, "expected_grade": "A", "created": "2023-04-29T13:51:01.893930Z"}, {"professor": "Amber Moore", "course": "JOUR130", "review": "Professor Moore is amazing!  She has real world experience in the topic and does a really good job at using it to help everyone succeed.  She is super kind and extremely invested in her students' success.  The course itself is super straight forward, she is not the type to make things difficult just to make things difficult.  If you just show up, listen to her feedback, and put in some effort you'll end up learning more about public speaking than anyone would in a gen-ed course.", "rating": 5, "expected_grade": "A", "created": "2023-05-04T23:03:42.797659Z"}, {"professor": "Amber Moore", "course": "JOUR130", "review": "I had this professor last year but never really got around to reviewing her. The fact that I often recommend her to friends reminded me that I should leave a positive review for selecting a professor for JOUR130. I absolutely hated public speaking and so naturally everything bad that could happen during a presentation happened. However, Professor Moore was understanding and lenient and even with my absolutely horrendous performance, I was still able to get a C. Thanks to her teaching style, I bounced back and ended the class with an A. I recommend taking her 100%!", "rating": 5, "expected_grade": "A+", "created": "2023-09-26T22:48:21.061019Z"}, {"professor": "Amber Moore", "course": "JOUR130", "review": "I loved Professor Moore! She gave really helpful feedback on the presentations and was always clear about her expectations for each assignment. She also wanted everyone to succeed and did her best to make you feel comfortable presenting in front of people. She was super kind and approachable, I would definitely recommend taking her for the FSOC gen ed.", "rating": 5, "expected_grade": "A", "created": "2023-12-06T21:14:50.931483Z"}], "name": "Amber Moore", "slug": "moore_amber"}