{"courses": ["CHEM401", "CHEM889C", "CHEM135", "CHEM608V", "CHEM611", "CHEM498B", "CHEM601", "CHEM889D", "CHEM276", "CHEM612", "CHEM146", "CHEM498V", "CHEM602", "CHEM271", "CHEM498V", "CHEM608V", "CHEM271", "CHEM401"], "average_rating": 3.25, "type": "professor", "reviews": [{"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "Vedernikov is the BEST.\n\r\nHe's a nice guy and dealt with our obnoxious class. His exams are almost exactly like his old ones, so use those to study. He actually cares about his students so don't be scared of him. ", "rating": 5, "expected_grade": "A", "created": "2015-01-23T23:44:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM401", "review": "Dr. Vedernikov is a very nice guy and a good professor. An 83% is an A. Just study his slides and go to class and you will do fine. Their is Homework due every 2 weeks. Questions very similiar to the homework problems and the old exams are on the exams. If you every need help understanding Inorganic Chemistry Dr. Vedernikov is very open to helping you be successful, just go to his office.", "rating": 5, "expected_grade": "A", "created": "2013-06-01T19:55:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "His accent is kind of hard to understand, but if you pay close enough attention (don't sit in the back and browse facebook and actually pay attention), I'm sure you'll learn enough. I chose to not pay attention and just read the textbook. I found the textbook to be very helpful, and Verdernikov's slides are right from the book and pretty useful (though I still recommend reading). His tests are very easy, and if you read the book, you'll be fine. The curve (85%+ is an A) is very generous and shouldn't be hard to pass.", "rating": 3, "expected_grade": "A", "created": "2013-04-21T16:14:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "Yes he has an accent, but you get used to it. I can't comment much on how good his lectures were since I didn't pay attention. However, he does explain anything you need to know well if you go to office hours. His old exams are also almost identical to his newer exams, so study those and you should be fine.", "rating": 4, "expected_grade": "A", "created": "2012-12-19T20:57:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "His accent was my favorite part of this class. \r\nDr. Vedernikov was definitely accessible, he had office hours every day, and always ended his classes with an invitation for students with questions to come up to him and ask. \r\nIt was hard to stay focused in lecture sometimes - we would cover a lot of material and then he would sometimes have to rush through the last few slides.\r\nThe last five minutes of class were always characterized by loud shuffling noises from the 300 or so people all packing up their stuff while the professor was still lecturing, making it impossible to hear. \r\nWe covered a ton of material for the third exam, which had a silver lining in preparing us for the final the next week. ", "rating": 4, "expected_grade": "A", "created": "2012-11-30T14:09:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM401", "review": "Dr. Vedernikov is straight up awesome.\n\r\nThe first part of this class was centered around quantum mechanics and group theory, but he tries to make it as interesting as possible. From there, the class shifted into organometallic chemistry and catalysis, which is his area of research so he brings in a lot of modern day applications. \n\r\nAlthough his accent is a little tough at first you get used to it after the first week. And he's always willing to help if he was unclear about something. \r\nExams are very fair, as in they never cover something you've never encountered in lecture or the homeworks - so go to class, do your work and you'll be just fine (oh, and the cutoff for an A is an 80%, which is good too). ", "rating": 4, "expected_grade": "A", "created": "2012-07-29T20:20:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "For those complaining about the clicker questions, just make a friend, give them your clicker, and switch off going to class. The homework on MasteringChem was easy (most of the answers are on yahoo answers) and if you get enough correct, you can get over 100%. The tests were okay, and I didn't pay attention AT ALL in class, just self-studied from the textbook/his powerpoints. For not paying attention in class and being sick and absent for three weeks, I thought a B was pretty good. This class is MUCH easier than Dixon's class, I always felt bad when my friends in her class were studying and I was doing nothing. \r\nI took AP chem in high school, and that class was much harder than this one (might be just my school) but I didn't remember much and still did well.\r\nOh also his office is impossible to find. But he was really nice when I had to make-up an exam.\n\r\ntl;dr: Homework answers can be googled, you can self-study and do okay, if you actually pay attention in class an A is pretty easy, MUCH MUCH easier than Dixon.", "rating": 3, "expected_grade": "B", "created": "2012-01-05T16:52:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "He seems like a nice guy. Never really paid attention in his class but the workload is very light. He gives so much opportunities for extra credit like in homework which is masteringchemistry gives 13 but only counts 10 and in clicker points where he gives 50 but only counts 40. Most of the material I learned myself since I tend to fall asleep in his class since I don't keep up. He posts past exams and the final which is very similar to the tests that he gives out. Overall, just take him if you're not doing anything chemistry related in engineering. Easy A for you.", "rating": 5, "expected_grade": "A", "created": "2011-12-13T20:47:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "Vedernikov was a fabulous teacher.  Aside from the accent, which you can understand relatively quickly and easily, and his \"g\" looking like a \"p\" there is nothing really to complain about him.  He utilizes both powerpoints and blackboard.  The powerpoints will have definitions, pictures, and examples, but then elaborates on those things by writing more definitions on the board, explaining things with his own drawings, and doing more examples on the boards. All of that is really helpful in better understanding the material.  However, despite his good notes, you do need to actually read and take notes on your own (I know, it's a shocker) because it will give you a better understanding of everything and if you do it before the lectures you will be prepare to actually sit and listen rather than just sloppily copy down notes.  Overall, he has been my favorite professor so far, even though this is my first semester here, so the lesson to be learned is; pay attention in class, and do work on your own outside of class, namely take your own notes, and then you can easily get an A in the class.", "rating": 5, "expected_grade": "A", "created": "2011-11-30T22:07:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "I took CHEM135 because I need it for engineering.  Vedernikov sucked.  I took AP Chemistry last year as a Senior in high school, and I ended up getting a B+ in the class but only a 3 on the AP exam.  I came in expecting for the class to be an easy A because I was told it was basically going to be a review of AP Chem.  The first thing I noticed about Vedernikov is that he has a thick Russian accent and that he speaks quietly, even with the microphone it's hard to hear his if you are any further back than a third of the way from the front.  He has all the material on the powerpoints he does in class and he posts them on ELMS after (or sometimes before) class.  He has at least 1 clicker question in class and about halfway through the semester he started to do a clicker question at the beginning AND end of class, so you have to stay for all of class to answer all the clicker questions.  You really cannot afford to miss any (or many) lectures, though what a friend of mine and I did towards the end of the semester was one person would take both clickers each day and the other person could relax and not go to class.  I must say though, I do like his grading scale.  I got a 77, 71, and 53 on my tests (in order of test 1, 2 and 3.  I admit I could have gotten better if I studied and paid more attention) but I ended up getting a 105.7 out of 100 on my homeworks, so that helped balance out my grade b/c he has a points system (best 40 clicker questions counted at a point each per right answer, .5 points per wrong answer, lowest three homeworks dropped out of 13 homeworks (counted at out of 100 points) and 100 points each for the three tests.  that plus the 200 point final adds up to 640 points).  His grade range is pretty nice too, 85%+ for an A, 75%+ for a B, etc. and he said he curved max two points up on the final grade.  Overall, I would not recommend him for Chem135.", "rating": 2, "expected_grade": "C", "created": "2011-04-07T16:11:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "I ended up with a B because I didn't study. It is not difficult to get an A in his class. Vedernikov posts his old exams on ELMS and if you study and understand them, then you'll do fine on his tests. He does have an accent, but by the end of the first week you'll understand him just fine. He has clicker questions, which means you have to attend class. His class is also extremely boring, but he does allow the use of laptops in class, so you can get other work done. He is an easier teacher than Dixon, so if you don't really care about learning chem and just want a good grade, then take his class.", "rating": 3, "expected_grade": "B", "created": "2011-02-17T23:05:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "My \"OurUM\" account is dedicated to the famous Mr. Vedernikov. \r\nAKA worst teacher I have ever had in my entire life. \r\nHas he been fired yet?", "rating": 1, "expected_grade": "", "created": "2010-12-16T17:58:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "Vedernikov has many problems as a professor.  He gives practice exams which are great to study from for each exam, but when you get the actual test there are questions that are not featured on the practice.  Its not that problems were different, the whole concept was missing.  He just does a poor job of preparing students for tests.  The accent depends on the person because sometimes I could understand him and other times I couldn't.  If you take CHEM 135 with Vedernikov be prepared for grueling exams and terrible lectures", "rating": 2, "expected_grade": "C", "created": "2010-12-13T19:56:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "Prof. Vedernikov is a pleasant professor who cares about his students. He responds to emails quickly. Don't worry about his accent; it's completely understandable. \r\nThe exams are extremely do-able since they are nearly identical to the previous years' exams (which he posts on Blackboard). The online homeworks aren't too bad. It isn't too hard to get an A (85% and above) or a B (75% and above).", "rating": 5, "expected_grade": "A", "created": "2010-07-02T18:06:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "The class overall isn't that hard. If you took high school chem it's about the same material. When I had him an A>85, B>75.. and so forth. It's a pretty fair class; you get what you put in. \r\nBut if you have him for an 8am its brutal. He talks with an accent and has a monotone voice so you have to be somewhat alert.\r\nIf you can avoid taking him at 8 do it. But overall he isn't a bad professor.", "rating": 4, "expected_grade": "B", "created": "2010-06-08T18:07:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "He had an accent so I was not always able to understand him.  His handwriting was horrible so if you didnt understand what he said would would also not understand what he writes on the board. My TA was great and did a wonderful job of explaining the concepts.", "rating": 2, "expected_grade": "c", "created": "2010-03-16T01:33:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "I didnt find that his accent was much of a problem, tho he does tend to talk a bit softly, so do sit near the front. His exams were EXACTLY like those of past years, just with different numbers. The curve is also quite generous. Homework was a bit annoying, but easy. As some have said, sometimes his explanations are not the best, but hopefully you will have a good TA, mine last semester was great. Most of the time, though, stuff was pretty clear, and discussion was unnecessary. The professor himself was very approachable, and was just very sweet and uber helpful. I most def recommend him.", "rating": 5, "expected_grade": "A", "created": "2010-02-08T19:21:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "Like most other reviews have said, Vedernikov is a pretty decent teacher.  His accent isn't too bad, and his practice exams are really helpful to prepare for the real ones.  However, if you aren't really a science/math person, this class might be somewhat challenging.  I put a lot of work into the course and maintained a B.  And also I almost never took notes in lecture because he tends to go all over the place; I took notes from the book (following the topics covered in the syllabus lecture schedule).", "rating": 4, "expected_grade": "B", "created": "2010-01-26T15:08:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "Like others have said, his accent is slightly distracting and his handwriting can be difficult to read at times. However, his exams are extremely easy, his class is graded on a curve, and 3 of the lowest hw grades, 10 clicker questions are dropped.  ", "rating": 4, "expected_grade": "B", "created": "2009-12-28T20:55:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "Really nice guy, pretty good professor. His lectures/notes are kind of disorganized; also his handwriting can be kind of difficult to read. His accent, for me at least, took some getting used to. Sit near the front and you'll do better understanding him and reading his writing. An 85 is an A and a 75 is a B which is nice. He drops the 3 lowest of 13 homeworks. The homework isn't usually too hard, just annoying to do. I don't really feel like I understand chemistry all that well after his class, but it really doesn't matter because I'm a business major. Partly it's probably because I didn't put in all that much effort. He posts a practice exam online before each exam, and it's basically the same as the exam, just with different problems. My only issue was that I felt after each test that I had done really well and then I usually found that I had scored ~10 pts lower than I thought, for whatever reason. Go to every lecture--there's clicker questions. I often slept through my 8 am class and missed the CQs, bringing my grade down.", "rating": 4, "expected_grade": "B", "created": "2009-12-26T14:25:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "Professor Vedernikov is a good professor. He is friendly towards his students. But, his lectures are a little disorganized. The notes he writes on the blackboards are sometimes all over the place, so sometimes it is hard to follow what he is writing or saying. Usually, he likes to use a lot of examples to explain what certain terms mean, but I wish he would give us the definitions first rather than going straight to examples to make it more understandable. \n\r\nThe exams are fairly easy as long as you review the sample exams because they are very similar. There's a 5 point bonus question at the end of every exam. \n\r\nClicker questions at the start of class every morning are easy because he explains what they are going to be before we actually answer them. They are based on what we learned at the last lecture.\n\r\nThe online homework is tedious, and he drops the lowest 3 out of 13 total. ", "rating": 3, "expected_grade": "A-", "created": "2009-12-09T15:28:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "Vedernikov is a really nice professor, he really seems to care about his students, and he answers emails very quickly. The class doesn't have a curve, however that's only because an A=85% and above and a B=75% and above. The tests are easy, and are exactly the same as the practice exam that he posts. The only problem is lectures. His accent is totally understandable, there are no problems there, however you have to go to every lecture because he gives clicker questions every single class. So I usually go and then fall asleep. The homeworks are easy, just use your textbook, the answers are like directly in there. If you want a A take Vedernikov.", "rating": 4, "expected_grade": "A", "created": "2009-10-21T10:15:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "Even though Vedernikov may not be the best lecturer, he gets concepts across to the students.  The additional work he has including homework and clicker questions definitely boost your grade and REALLY help with the tests, as do the practice exams he posts. If you want an \"A\", take him!!", "rating": 4, "expected_grade": "", "created": "2009-07-23T01:42:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "Overall, the class wasn't too hard. There were three midterms, online homework, clicker questions, and a final. I didn't ever take notes in class, I just read the book. Vedernikov is an okay professor, although his accent is distracting. The class is supposed to be for science majors, but I'm a non-science major and I did just fine in the class.", "rating": 3, "expected_grade": "A", "created": "2009-04-27T16:59:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131S", "review": "Dr. Vedernikov was the most fair professor for CHEM131. Although his lectures went off on tangents a little, he explains concepts pretty well and supplementing the book with his lectures helped a lot. The old exams he posts online are very similar to the hourly exams as well as the final he gives.", "rating": 5, "expected_grade": "A", "created": "2008-12-21T03:27:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "He posts all the previous year's midterms with answers, and the midterms we actually take are the same midterms, only with different numbers and slight variations.\r\nHe really likes to have people understand the material, so he wants people to attend office hours and whatnot.\r\nHis lectures are boring at 8AM, but if you took AP Chem, you will do well. I put little effort into this class. Dr. Vedernikov is much easier than Steffek or Dixon from what I hear from friends who took the others.\r\nHis accent is not too hard to understand after acclimating to it.", "rating": 5, "expected_grade": "A", "created": "2008-12-19T16:55:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "Vedernkov is a terrible lecturer.  His powerpoints do little to explain the concepts and his lectures in general did little for me in terms of understanding class material.  I basically had to teach myself from the book and picked up a lot from lab rather than lecture (I got an easy A in lab).  The only good thing about his class is that his tests are fairly easy, but the class doesn't have much of a curve compared to other professor's classes and since he doesn't teach the material well, having easier tests doesn't go too far...", "rating": 1, "expected_grade": "B", "created": "2008-12-18T13:25:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "Dr. Vedernikov is a good Professor. However, his lectures can be all over the place sometimes. But, overall he is able to explain the concepts well. If you read the book and go to lectures, you will be fine.\n\r\nHe is easy to get a hold of and always answer emails quickly. He is easy to approach If you have a question or a concern about the class or material.", "rating": 4, "expected_grade": "A", "created": "2008-12-11T14:10:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "Dr vedernikov is a great teacher. his class is fair and the clicker questions are easy IF you come to the class before and PAY ATTENTION. i havent really put a lot of effort into doing well in this class which is why my grade expected is a \"C\". his tests are fair and easy, i didn't study for them much and got a C. \r\nso you can listen to the students with the  expected grade A that say hes awesome. or you can listen to the failing student complain about the work... point is He's a good teacher if you pay attention and take notes. the homeworks can be really hard and the exams are pretty easy. if you have a 85% thats' an A. if u have a 75% thats a B..  etc. hope this helped. (i took him for chem131. P.S i have gone to tutoring and heard students complain about dixon and the other teachers being difficult.. and  most wish they'd taken vedernikov... ", "rating": 3, "expected_grade": "C", "created": "2008-12-01T12:37:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "He does not explain concepts very well. It would best if you can take your own notes, and practice problems at the end of each chapter. His practice exams are somewhat helpful, but he gives different problems in his tests, so its better not to depend completely on his practice exams. I have also found that this year's exam are much much harder than last years.", "rating": 1, "expected_grade": "", "created": "2007-12-16T15:46:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "I agree with most of what LHaggerty said. He sometimes strays during the lecture onto somewhat related tangents which eat up valuable lecture time. On the positive side, he makes sure to explain difficult concepts in different ways to clarify things. His accent becomes easy to understand after about 10 minutes, so do not let a foreign accent discourage you. He was fair and friendly in dealing with me when I missed an exam.\n\r\nIt is annoying to have to purchase a 40$ clicker and OWL access to do the graded assignments. He grades attendance and the homeworks can be long and tedious. \n\r\nI would recommend, as it can be an easy A.", "rating": 4, "expected_grade": "A", "created": "2007-12-03T16:35:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "Approachable and friendly, I found him relatively easy to understand despite his accent.  Gives online homework assignments that help a lot when test time comes around and it's easy to score well on these if you put in the time.  Tests are very reasonable if you take advantage of the practice tests he posts.  Participation points are earned by attending lectures and answering a clicker question at the beginning of class.  Lectures are not particularly clear, so it's best to take your own notes and go to lecture as review of your notes and to pick up extras not in the book.", "rating": 3, "expected_grade": "A", "created": "2007-11-20T15:03:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM131", "review": "The thing I found most difficult about this professor was how he did not explain the concepts very well, and his thick accent makes it all the harder to understand. Uses Power-points for lectures.", "rating": 3, "expected_grade": "", "created": "2007-11-19T23:55:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM146", "review": "He's a nice guy, only thing annoying is he mumbles when explaining stuff sometimes and can be hard to hear and understand. His lectures are pretty boring and he usually goes over things in way more detail than necessary which isn't a horrible thing because then the exams seem more straightforward. There is homework due every week that takes anywhere from 1-2+ hours. He provides sample exams that are super similar to the actual exam so those are great study tools. The class is curved so an A is an 85. If you put in the time to at least do the homeworks and go to class for the clicker questions you shouldn't fail if you do somewhat okay on the tests. I never went to office hours because I was slightly intimidated. ", "rating": 3, "expected_grade": "A", "created": "2021-12-02T17:45:47Z"}, {"professor": "Andrei Vedernikov", "course": null, "review": "Lectures have nothing to do with what is on the test. He only lectures on concepts mostly and mentions nothing about any of the calculations on homework's and on the exams. The TA seems really unprepared for every discussion and doesn't explain either. This is 100% a self taught class.", "rating": 2, "expected_grade": "", "created": "2021-12-08T03:50:33Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM146", "review": "Very nice professor, but his lectures were very concept based and did not seem to connect much with the midterm or homework concepts. His practice exams covered what was on the test almost exactly so I would recommend studying from practice tests instead of lecture content. The TA for the class was terrible, he never seemed to double check his slides or have clear communication with Dr. Vedernikov.", "rating": 3, "expected_grade": "", "created": "2022-01-07T21:51:06Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM146", "review": "Lectures have nothing to do with what's on the test, and everything in the textbook is expected to be prior knowledge. Couldn't follow his lectures at all and was not good at taking questions. Posts old exams that are exactly the same as the ones he gives. Only an easy class if you already have a good chem background(I had none). Went from an A to a B- in the last week. Easy to pass but hard to learn anything. ", "rating": 2, "expected_grade": "B-", "created": "2022-02-04T19:59:44Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM271", "review": "Thick accent, speeds through the slides and doesn't work through problems (just clicks too fast). Smallish curve (A-85%, A 88%), doesn't take questions. Lots of side theory stuff that won't be tested and not enough practice problems during class.\r\n\r\nRead the textbook early. I would have an A/A- rather B+/A- if I started reading the textbook earlier, usually I rely on the prof.", "rating": 2, "expected_grade": "B+", "created": "2022-12-08T16:22:20.563835Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM271", "review": "His curves are predetermined before the class ever starts and he will not stray from it. He only had about a 2% curve which is not a lot for a chem class. His teaching and slide has nothing to do with what is on the tests its just conceptual. The textbook is what has all the actual problem sets and content you need to know. If you are like me and have a hard time teaching concepts to yourself DO NOT TAKE HIM. The TA was not helpful and just made the class even more confusing. If chem is not your forte or you normally rely on curves to help your grade this is not the class for you.", "rating": 1, "expected_grade": "", "created": "2022-12-19T16:35:34.954587Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM271", "review": "The lectures and discussion are mostly conceptual while the exams which are worth 400 out of 520 points of your total grade is on equations and word problems. His curve is predetermined before you even step into the class and he will not deviate from it. This curve was only 2% and even people within a percent of passing would still not pass because according to him \"once points are put into ELMS they are final\". If you rely on curves or do not want to take a \"teach yourself\" class DO NOT TAKE. If you do go to lectures he has a thick accent and goes through his slides (which are not posted till after lecture) very quickly and doesn't answer any questions.", "rating": 1, "expected_grade": "", "created": "2022-12-19T16:41:51.753502Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM271", "review": "Dr. Vedernikov is a rather underwhelming, but decent professor. The class is extremely consistent in both workload and difficulty, as you'll be expected to do one online homework assignment every week and the exams are extremely similar to the practice exams. However, the lecture slides are generally not helpful as they do not relate to the homework, and he speaks too softly to hear when he is lecturing at the front of the lecture hall. He will oftentimes not demonstrate how a problem is solved, or if he does, he goes into theory that is beyond the scope of this class. If you are any good at teaching yourself, you'll be fine. Otherwise, choose a different professor.", "rating": 3, "expected_grade": "B+", "created": "2023-01-03T02:15:27.548461Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM271", "review": "I am not that great at physical chemistry lol but shout out to Bryan the ta for hosting the most amazing review sessions and sending them out to us as recordings. saved my ass fr. \r\nstopped going to class few weeks in, slides did not help imo but provides some context. youtube lol. Dr. V is nice and he just talks very softly. sit in the front if you do go. lectures are not recorded. homework on pearson due every week just about. he really does like going into theory behind the problems but might not go through a problem. can tell is a professor who really likes the subject he teaches. i stayed up pmuch whole night studying for final. DO THE PRACTICE EXAMS!!!!!", "rating": 4, "expected_grade": "B-", "created": "2023-12-14T20:43:50.721895Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM271", "review": "Pmuch no curve in this class. be prepared to STUDY THE PRACTICE EXAMS.", "rating": 4, "expected_grade": "B-", "created": "2023-12-14T20:45:00.783619Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM401", "review": "Does not teach the course and instead goes off the lecture slides. You have to teach yourself the material.", "rating": 1, "expected_grade": "", "created": "2024-02-21T09:50:30.570323Z"}], "name": "Andrei Vedernikov", "slug": "vedernikov"}