{"courses": ["CMSC858K", "CMSC451", "CMSC858Q", "CMSC798", "CMSC457", "PHYS457", "CMSC657", "CMSC451", "CMSC657", "CMSC451", "CMSC451"], "average_rating": 4.5833, "type": "professor", "reviews": [{"professor": "Andrew Childs", "course": "CMSC451", "review": "Good professor but has very high expectations for students.", "rating": 4, "expected_grade": "", "created": "2018-03-30T13:23:11Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Great at lecturing. I learned a lot.", "rating": 5, "expected_grade": "A", "created": "2018-05-18T21:13:14Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Great professor. No slides, but excellent lectures with clear notes on the board.", "rating": 5, "expected_grade": "B", "created": "2018-05-19T17:59:23Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Pros:\r\nHe is very smart\r\n\r\nCons:\r\nYou'll never be as smart as he is\r\nThe class is genuinely difficult\r\nHe is a very boring lecturer\r\n", "rating": 3, "expected_grade": "", "created": "2019-07-08T15:34:53Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Incredible professor. His lectures are very clear and the expectations for students are very reasonable. This is a challenging class, but it's worth taking because you'll learn a ton.", "rating": 5, "expected_grade": "A", "created": "2019-11-28T20:00:39Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Childs is probably the best professor I have ever had out of all the other CMSC professors next to Max for 423. Hands down takes the best notes, is easy to follow in class, and he is really interesting (his field of study is quantum algorithms). The only sort-of complaint I have is he doesn't post his notes online, but that never really bothered me and you definitely learn a lot when you're at lecture.\r\n\r\nMore importantly however is how hard this class is. Yes, the first half of the class is 351 material, but with 2 week long assignments and a final that is worth almost half your grade, the class has very little room to make up for lost points easily due to its structure.\r\n\r\nI will say the class was harder than 351 for me, as I had Golub for 351 and received a B at the end, and I wasn't the best at proofs coming in to this class.\r\n\r\nMy advice is if you are VERY confident in your ability to solve proofs then you should definitely take Childs; he's absolutely the best professor for this class. It honestly all comes down to how confident you feel about taking 451.\r\n\r\nP.S: I'm giving 5 stars because Childs is AMAZING, not because of the course material or its difficulty.", "rating": 5, "expected_grade": "C", "created": "2019-12-14T20:34:38Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Childs is insanely smart; he, for the most part, single-handedly managed the course Piazza. He writes his notes (on an iPad projected to the screen) in a way that students can copy word for word, which is nice when we need to review the concepts, but makes class a frantic effort to copy notes (missing a lot of what Childs has to say verbally).\r\n\r\nHis final was pretty fair in my opinion. He sticks very close to the book \"Algorithm Design\" (available as a PDF online).\r\n\r\n451 is a tough class. I guess it will improve some algorithmic thinking skills.", "rating": 4, "expected_grade": "C+", "created": "2019-12-19T00:37:01Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Probably one of the best professors to have for a difficult class. He almost instantly replies to all Piazza posts, has great lectures, and he is very kind. This class was hard but the material I learned from it was invaluable and absolutely essential for any CS student.", "rating": 5, "expected_grade": "A", "created": "2019-12-20T15:50:51Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "the course is pretty hard in general. there were a lot of smart people when i took the course and exam averages were in the high 60s. \r\n\r\nbut as for andrew childs himself, if you can take this class with him, do it. he is a great lecturer. while he might be fast at times he does address student questions during class. i went to his office hours fairly often and i got a lot of my questions answered and i overall learned a lot in this class. it's a challenge and bit stressful since the final is worth 45% but i think if you did well in 351 (B or higher) and you're interested in learning more about algorithms then take this class with childs. ", "rating": 5, "expected_grade": "B+", "created": "2019-12-21T02:36:47Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Andrew Childs is such an amazing professor. He is clear and calm in his lectures, always willing to re-explain material, and his homeworks and exams are very fair. Not easy, but fair.\r\nWhen I had him, he took notes on an iPad and displayed them on the board as he taught, to show many examples and explain theorems. However, he didn't post those notes - so make sure you take your own!\r\n\r\nOverall, I would want no one else to teach me 451. I feel like I actually learned a lot. I wish he would teach 351 as well!", "rating": 5, "expected_grade": "C", "created": "2019-12-21T16:51:15Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Definitely the best professor for CMSC451. The lecture videos are concise, well put together, and very informative. The course was also structured in a way that allowed for a lot of flexibility for students. Exams are fair and you will do well if you do the homework's. Professor Childs is very knowledgeable about algorithms and is also able to answer questions and explain concepts very well. Overall, really enjoyed his class.", "rating": 5, "expected_grade": "A-", "created": "2020-12-24T06:32:01Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "\r\n(Disclaimer: had him during fall 2020 virtual semester) \r\n\r\nI found the course a lot easier than 351. The homeworks were a bit challenging but I found that the TAs, at least during this semester, graded very generously (the rubrics are not like 351 where it’s basically 0%, 50%, or 100% per question). The tests were kind of hard to do under a time crunch but they were generally easier than the homeworks and again had generous rubrics. Childs is a nice professor and responsive to the students - he extended the deadline on one of our homeworks. If you’re interested in 451 I recommend taking it with him. ", "rating": 5, "expected_grade": "A", "created": "2020-12-26T16:56:33Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Childs was really fair, and I felt like a learned a lot through the course. It was challenging, but I could tell that all of the material was important. Grading was fast, and lectures were recorded. Piazza questions were answered quickly. ", "rating": 5, "expected_grade": "B", "created": "2021-01-04T00:17:44Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "I took this class Fall 2020 (online semester), but I thought Childs was a great professor. He's probably one of the most organized professors in the CS department. His course is heavily dependent on the textbook (which is amazing), but he does a really good job of breaking things down in a digestible way. I would like to say that I'm algorithmically-challenged, but I was still able to follow all of the lectures. He is extremely responsive on Piazza, and very lenient with partial credit. The class is not easy, and you'll definitely need to work for your grade, but overall this is a great class and I would 100% recommend taking it. ", "rating": 5, "expected_grade": "A-", "created": "2021-12-23T19:34:49Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "pretty tough class but Childs is a very smart professor who explains content very well. homeworks take a long time (there are only 5 though so it's not terrible). wouldn't recommend taking this course with a heavy schedule but otherwise definitely recommend", "rating": 5, "expected_grade": "B", "created": "2022-05-19T01:44:08Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Definitely one of the best professors in the department. Explains everything well, and the class definitely felt more manageable than 351, although that's not saying much. Homework is long though, so definitely start early on those.\r\n\r\nIf you're not algorithmically challenged like I am, this class might be fairly easy for you.", "rating": 5, "expected_grade": "B", "created": "2022-05-23T18:53:38Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "I came into this class with high expectations due to his ratings and reviews, but honestly think he is a bit overhyped. He speaks so fast during lectures that I physically wasn't able to keep up with notes, and had to stop coming to class and watch the videos instead so I could actually understand what was happening. Additionally, this may be subjective to each individual, but for me personally I felt that his lectures lacked structure which made it especially difficult for me to take organized and digestible notes. These are minor issues though-- my biggest disappointment was that he is not the kind of teacher that recognizes and reciprocates effort. I had hoped to TA this class in the future, and made a substantial effort to build a rapport with him, but he is simply just not the kind of professor that you can build a rapport with. He is not approachable in a way that makes you feel comfortable asking him questions, and I've seen/experienced several instances of him responding a bit curt/rudely to questions on Piazza. Overall, I feel that the way he communicates with students is not conducive to learning. TLDR: Very smart professor that really knows his stuff, but his expertise in algorithms does not exactly translate to an expertise in teaching.", "rating": 3, "expected_grade": "A", "created": "2023-03-11T21:40:59.687296Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "He's a good teacher who's very organized. This class is tough. There are 5 HW assignments and he drops your lowest. Final is worth 40% so that's stressful. Class is curved. He is not the harshest grader. Stressful since you won't know your grade until its published.", "rating": 4, "expected_grade": "C+", "created": "2023-05-04T16:00:28.720626Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "I have some issues with this class that I'll discuss later but overall I think it's worth taking. It builds a lot of really useful skills and really helps you practice thinking critically.\r\n\r\nPros:\r\nThe class is organized very well. There's 5 homework assignments, each worth 10% of your grade with one dropped (so 40% total). They can take a long time to do and be pretty difficult, but you're allowed to work together on them. The TAs and prof are helpful during OH and responsive on Piazza. The hws help you to practice and build your understanding of the course content. The questions on the homework are about 1 or 2 levels more difficult than what'd you see on an exam, so they're good prep for that as well.\r\n\r\nThere's one midterm and one final, which is nice because the exam load is less. The midterm is 20% of your grade and the final is 40%, which imo is too much but ig that's the tradeoff for only having 1 midterm. The midterm was pretty difficult (avg 60%) but the professor says he intends to curve at the end of the semester based on where grades fall with the final. \r\n\r\nThe content is useful. I think I learned a lot about how to actually build and design new algorithms using existing algorithms or ideas (versus where in 351 you focus just on analyzing existing algorithms, not actually building anything new). That's the main difference between the 2 classes. He structures the class by first showing you 3-4 examples of algorithms using a specific technique (i.e. greedy) and then having you apply those algorithm's ideas to hw or exam questions. I think generally this class helped me to think critically about complex problems you'll encounter regularly in CS.\r\n\r\nCons:\r\nI felt the lectures were rushed and sometimes unclear. The professor would often handwave proofs especially towards the end of the semester to save time which resulted in them being difficult to read and understand. The book does have each proof in it written in depth, and is generally very good. I'm not usually a big fan of learning from textbooks and would rather get content from lectures, videos, or online, but I found this one very well written and helpful. I'd consider reading the textbook required to be successful in this class, even though the professor considers it \"recommended\".\r\n\r\nThis was a con for me but may be a pro for you. I personally kinda suck at proofs, and this class is *entirely* writing proofs (mainly proving your algorithm is correct). I think it was good experience to get but it was pretty difficult for me, especially at first. If you like proofs you'll do fine, but be prepared to be writing or studying proofs basically every day.\r\n\r\nA final being 40% of your grade imo is too much. I'd much prefer to have 2 midterms in this class and a lower weighted final. This is more so personal preference though.", "rating": 4, "expected_grade": "A-", "created": "2023-05-16T16:21:11.181277Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Childs is one of the smartest Professors I've ever met and for a course like 451, him being able to answer as many questions as he did in class or piazza on the spot was very impressive. He really knows the algorithms and would be able to point out flaws in some of the suggested \"what if ... \" questions and I am super glad I took this class with him. I came into this class with not any more hope than to learn about some better ways to solve algorithm problems but am now considering getting a masters because I was very passionate about this class. \r\n\r\nIf you want to be great in this class, I suggest doing the textbook readings before class, because the information definitely can be a lot and gets covered quickly sometimes. This way you can come to class with the knowledge and Childs can break it down further for you.", "rating": 5, "expected_grade": "B", "created": "2023-05-20T11:44:58.532328Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Very organized. Set up Piazza and office hours times weeks before the semester began. He knows the textbook forwards and backwards. He follows the assigned textbook readings very closely. So if you're struggling to keep up during lecture, do the assigned readings beforehand. \r\n\r\nThe homework are long. HW3 (dynamic programming) was especially difficult. Make sure to start early (you're given 2 weeks to complete). The consist of 5 questions, typically all questions (except the NP HW) ask you to write an algorithm, prove its correctness, and state its running time. Use the textbook to complete homework early. Do not start any later than a week before the deadline. Each assignment took 10-20 hours to complete. Make sure to go to office hours to verify your thought process or you may get half credit on questions you incorrectly approach. The homework is however very fair and directly relevant to what we covered in class. HW average between 80-90%.\r\n\r\nI think what made me respect Prof Childs the most was that he was willing to answer questions during lectures fully. Even if this meant we did not get through supplementary topics at the end of the semester (had to cut out quantum lecture but posted for viewing on ELMS), he made sure to take any question serious and answer it without making anyone feel stupid. That's a classroom culture I appreciate. Sometimes however he does rush at the end to finish a proof if we got derailed with too many questions, but usually he saves it for the next class. \r\n\r\nDuring office hours, he was helpful. He gave hints on how to approach the homework. It was honestly helpful to explain my thought process and get that feedback from him. He allows multiple students in Zoom room at once or in person, so you get to listen to other students questions and perspectives as well, which is enriching. In regards to what 2 reviews down said about rapport, I will say that my interactions during office hours were mostly focused on course material and homework or practice problems. I think it is possible to build rapport, but you'll have to come with questions and willingness to share your interests. Most importantly, I felt like he did care about me and my understanding of the material. Sometimes he cracks jokes. \r\n\r\nRegarding exams, he made an especially difficult/ time crunch midterm (60% average), but he adjusted for it with a more lenient final exam (75% average). Overall cutoffs for the course: A-: 84, B-: 71, C-: 58. The biggest advice for exams I can give is to understand the homework well (what are the key concepts, thought processes), but then make sure to do as many practice problems as possible. Get your thought process verified by Childs or a TA. Big shout out to Aditya Acharya. He is the best TA for the course, go to his office hours if you can!! He makes his office hours basically into a discussion section for the course, white boarding concepts and helping get started on homework. \r\n\r\nAdvice: Start HW early (1+ week) so that you can spend 10-20 hours. Stay up to date with the lecture. Attend in person if you can even though its recorded. Take advantage of Piazza since Childs responds very actively. Take advantage of office hours, especially TA OH for homework. Prepare early for the exams. Good luck! Take him if you have the privilege and get a seat. I feel like I learned a lot and it greatly helped me with my logical/algorithmic thinking.", "rating": 5, "expected_grade": "A", "created": "2023-05-22T18:56:44.587932Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "Great course and great professor. You learn a lot and the course content is really valuable knowledge. Childs is really smart, answers all questions, and does his best to help everyone succeed. The homeworks are very difficult so I would say start them very early. The midterm and final are really really really difficult and hard to finish on time with averages in the 60s. Don't panic though because the course has a huge curve at the end of the semester. Biggest piece of advice is to start the homeworks very early and go to TAs with any questions. The hws are graded harshly for correctness and take up a huge portion of your grade, so do them well. Overall its a hard class but if you think you can handle it its very worth taking, especially with a professor childs because you can tell he really knows his stuff.", "rating": 5, "expected_grade": "B+", "created": "2023-05-28T23:10:12.729546Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "I think he's a bit overrated in my opinion. He's very hard to talk to but he is receptive to questions, especially during lectures. However, he doesn't provide much insight regarding anything else. His responses are very brief and terse. The TAs were helpful at the very least. The tip to doing well in Childs's class is honestly to just LC. Many of the questions that appear are LC related especially divide and conquer, dynamic programming, and general graph algorithms (BFS/DFS/topological sort). You also don't need to attend class because he basically just summarizes the textbook which he didn't do amazingly. This is a decent class to take but there are more useful classes as you can just LC and learn the patterns yourself).", "rating": 3, "expected_grade": "A-", "created": "2023-06-08T19:52:19.917609Z"}, {"professor": "Andrew Childs", "course": "CMSC451", "review": "1. Did you think the exams or other major assignments were fair? \r\n· HW is fair but time-consuming, 10-15 hours each. The dynamic programming (HW3) was the hardest, 20 hours. \r\n· The midterm exam was challenging due to time constraints, but the final exam was very fair.  \r\n· The bulk of assignments and exams require writing an algorithm, proving its correctness, and stating its run time.\r\n—\r\n2. Did you think the professor had reasonable expectations of the students in the course overall? \r\n· Reasonable workload, with five homework assignments (one dropped)\r\n· Reasonable exam difficulty of one midterm and one final exam.  He provided practical and clear exam preparation advice and plenty of practice.\r\n· I strongly recommend not to leave the homework until the last two days. Start a week early and go to OH!\r\n—\r\n3. Were you a fan of the professor's teaching style? \r\n· Most organized professor I've had at UMD. \r\n· Assignments punctually released and graded.\r\n· Homework and lectures are very closely aligned with weekly suggested textbook readings. I highly recommend doing the readings before class if you're struggling. \r\n· His ability to present the content clearly and logically with drawings and clarifications impressed me.\r\n· I admired Childs’ willingness to answer questions during lecture even if it meant going slower. He frequently paused and encouraged asking for clarifications and questions.\r\n· He recognizes the difficulty of the course and pointed out historically confusing parts.\r\n· His handwritten iPad notes are well structured, a great resource, and updated promptly after lecture. I suggest writing your own notes by hand because of the open-note exams.\r\n· Recorded lectures. However, I recommend attending class because of the opportunity to ask questions, stay up to date,  and there was unrecorded Q&A at the start. \r\n· When I asked questions during office hours, he demonstrated a thoughtful listening approach and genuine interest in helping me understand the course material better. Childs offered valuable feedback and diligently addressed questions. I valued the inclusive environment he fostered by allowing everyone to participate in the room/zoom, rather than seeing people one by one.\r\n· To establish a personal relationship with Prof Childs, it is necessary to take the initiative and bring forth topics for discussion. \r\n—\r\n4. Was the workload appropriate for the number of credits? \r\n· Pretty heavy/demanding if you want an A. \r\n· Homework required considerable time and effort, 10-15 hours on each due biweekly. \r\n· The readings took around 2 hours per week.\r\n· Exam prep required approximately 20 hours each exam. \r\n—\r\n5. Was this course a waste of time or was it beneficial in some way? \r\n· Challenging but highly rewarding course.\r\n· Deepen my understanding of computer science, algorithmic frameworks, and especially honed my critical and logical thinking. \r\n· Useful practice on presenting your ideas and algorithm. Topics like graphs, BFS, DFS, paths, cycles, topological sort, connected components, greedy (internal) scheduling, 1D 2D dynamic programming, etc are relevant for more advanced FAANG, leetcode interviews. \r\n· Reductions (network flow, NP completeness) helped me practice transforming a new problem into an instance of known problems. \r\n· A toolkit for writing algorithms! \r\n—\r\n6. How much support were you given throughout the semester (office hours, extra resources, etc.)? \r\n· Representative practice problems for exams, but no solutions. You have to get feedback on your attempt through office hours or Piazza.\r\n· Childs displayed high responsiveness on Piazza, checking multiple times a day, including weekends, and personally responding to most questions. \r\n· Childs and TAs had 2 office hours per week each. \r\n· I highly, highly recommend Aditya Acharya's office hours!\r\n· Attending office hours and seeking early feedback significantly contributed to my success.\r\n—\r\nTLDR: Highly organized professor, reasonable exam expectations, challenging time-consuming homework, great teaching assistants, follows the textbook closely, records lectures and posts notes, useful for interviews, rewarding course, tangible improvements in algorithmic thinking, but heavy workload for an A. Highly recommend 451 with Childs!", "rating": 5, "expected_grade": "A", "created": "2023-08-26T00:16:26.269048Z"}], "name": "Andrew Childs", "slug": "childs"}