{"courses": ["ENGL101", "ENGL101", "ENGL398C", "ENGL101", "ENGL101A", "ENGL101", "ENGL101S", "ENGL393", "ENGL393", "ENGL101", "ENGL101A", "ENGL101", "ENGL246"], "average_rating": 4.9412, "type": "professor", "reviews": [{"professor": "Andrew Howard", "course": null, "review": "AMAZING TEACHER! He made this class so fun and engaging, I really enjoyed coming to this class. Also a lenient grader!", "rating": 5, "expected_grade": "", "created": "2021-12-01T21:16:29Z"}, {"professor": "Andrew Howard", "course": "ENGL101", "review": "Prof Howard is very kind and personable. He's really lenient about deadlines if you're having trouble and takes a lot of care with his students. He's always trying to improve his class experience and is always available for questions and review. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-02T17:50:28Z"}, {"professor": "Andrew Howard", "course": "ENGL101", "review": "Honestly, he is a great teacher and always has the energy and passion to teach every day that I was in his classroom. He also is very cool too and helps with essays that someone might be stuck on. Overall good guy", "rating": 5, "expected_grade": "", "created": "2021-12-03T22:31:20Z"}, {"professor": "Andrew Howard", "course": null, "review": "Prof. Howard was an AMAZING teacher who respond well to the class and taught with such passion and ability. He's young and you can tell he knows how to really connect with students. His assignments were fair, he was really understanding and definitely wanted you to succeed, especially if you showed him that you cared about his class", "rating": 5, "expected_grade": "", "created": "2022-05-01T23:32:22Z"}, {"professor": "Andrew Howard", "course": "ENGL101", "review": "If you don’t know if you should or shouldn’t take him, then take him; he’s one of the best professors at UMD.", "rating": 5, "expected_grade": "A", "created": "2022-12-12T15:17:29.670252Z"}, {"professor": "Andrew Howard", "course": "ENGL101", "review": "I turned in assignments like 15 days late and still got full credit super chill and understanding professor. Take him if you can.", "rating": 5, "expected_grade": "A", "created": "2023-04-17T01:05:06.688175Z"}, {"professor": "Andrew Howard", "course": "ENGL101", "review": "The best professor, take him if you can! He is understandable and his class is manageable.", "rating": 5, "expected_grade": "", "created": "2023-05-08T17:48:48.801211Z"}, {"professor": "Andrew Howard", "course": "ENGL101S", "review": "i really enjoyed his class. they were very chill, he was very accommodating, and would be very flexible.", "rating": 5, "expected_grade": "A", "created": "2023-05-09T15:24:07.112618Z"}, {"professor": "Andrew Howard", "course": "ENGL101S", "review": "Love this man, Scholars kids take advantage if he has slots open", "rating": 5, "expected_grade": "A", "created": "2023-05-10T01:18:46.741694Z"}, {"professor": "Andrew Howard", "course": "ENGL101", "review": "This is the greatest professor for any class at UMD. His due dates are very felxible, and always willing to talk with you about your essay and see what improvments can be made.", "rating": 5, "expected_grade": "", "created": "2023-11-13T21:25:08.324584Z"}, {"professor": "Andrew Howard", "course": "ENGL101", "review": "Professor Howard is an AMAZING professor definitely one of the best at UMD. He is super flexible with just about anything (due dates, rules to assignments, etc) and will give you advice if you ask. However unlike other professors he doesn't proof read your drafts unless you go out of your way to ask and he takes an almost insane amount of time to grade. Once he grades he's a super easy grader so its not a huge deal but its hard to know what grade you have until the end of the semester. He's a great guy though and class is super fun!", "rating": 4, "expected_grade": "A", "created": "2023-12-03T04:24:25.449722Z"}, {"professor": "Andrew Howard", "course": "ENGL101", "review": "Best ENGL Professor ever!! He does take a good amount of time to grade but, he is very interactive with the class (knows everyones name and even talks to us before class to get to know us). Responds quickly to emails and gives amazing feedback (just email him and he will go through your entire essay, he reviewed mine the day it was due and it was like 10 pages). Also he is super flexible, funny, and chill. TAKE HIS CLASS!!!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-04T16:13:50.439165Z"}, {"professor": "Andrew Howard", "course": "ENGL101", "review": "Andrew is THE GOAT. he really does care about his students and makes it easy to succeed in the course. He does take a fairly long time to grade stuff (upwards of 1-2 months if he isn't particularly interested in the assignment) but he is a very fair grader and its easy to do well in the class if you just show up and do the work. Take this man if you have the opportunity!!", "rating": 5, "expected_grade": "A", "created": "2023-12-09T20:30:10.737112Z"}, {"professor": "Andrew Howard", "course": "ENGL101", "review": "Professor Howard is the best English professor! He is so kind, has a great sense of humor, and you can see that he truly wants his students to succeed. Lectures are not mandatory, but I went to nearly all of them because of how engaging and fun they were. He is very lenient and will give you extra time if you need it, but I found there to be ample time with most assignments. He is so helpful and I had the best experience - I want to take another one of his classes. All of these five stars are so accurate, he truly deserves this rating. Choose Professor Howard if you see his name while registering!", "rating": 5, "expected_grade": "A+", "created": "2023-12-23T00:54:04.837814Z"}, {"professor": "Andrew Howard", "course": "ENGL101", "review": "Really good professor and very lenient overall to the class. He understands that the class is not something most want to take, but also helps present the importance of the material and helps ensure you succeed both in terms of learning and grade wise. I highly would recommend him to anyone needing to take the class.", "rating": 5, "expected_grade": "A", "created": "2023-12-24T23:54:20.662825Z"}, {"professor": "Andrew Howard", "course": "ENGL101A", "review": "Professor Howard is sincerely one of the best professors I have had this Fall 2023 semester and made my transition into college 10x easier. He made sure to never to bore you in his class and is really funny. I love how he creates a welcoming space for his students and gives great feedback on his grading. He is the type of professor who cares about your success & understands YOU ARE HUMAN!!", "rating": 5, "expected_grade": "B+", "created": "2024-01-01T19:27:50.117749Z"}, {"professor": "Andrew Howard", "course": "ENGL101", "review": "Professor Howard is a good english teacher who does care about his students. Assignments are pretty easy, but he can take 1-2 months to grade your papers. Sometimes the english class itself can be boring or dry, but overall he is a good teacher who grades pretty lightly.", "rating": 5, "expected_grade": "A-", "created": "2024-01-19T16:02:56.102028Z"}], "name": "Andrew Howard", "slug": "howard_andrew"}