{"courses": ["CMLT270", "ENGL101", "WMST275", "CMLT235", "ENGL362", "LASC348E", "AMST298Q", "CMLT277", "ENGL235", "CMLT275", "ENGL101", "ENGL101A", "WGSS275", "AMST298Q", "ENGL101", "ENGL235", "ENGL393", "ENGL101H", "ENGL101S", "ENGL243", "AMST298Q", "ENGL101", "ENGL235"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Andrea Knowles", "course": null, "review": "very helpful professor", "rating": 5, "expected_grade": "B", "created": "2018-08-04T04:27:31Z"}, {"professor": "Andrea Knowles", "course": "AMST298Q", "review": "really fair & accommodating of any deadline concerns! the course had a lot of readings but when it felt like too much for the class she adjusted it downwards and was also always understanding when people couldn't keep up as closely ", "rating": 5, "expected_grade": "A+", "created": "2022-05-11T18:09:38Z"}, {"professor": "Andrea Knowles", "course": "CMLT275", "review": "The kindest professor out there! She is fair and truly cares about her students. During the midterm review, multiple students expressed concern about completing weekly reading responses, so she decided to drop an additional one out of the grade book. She gives a lot of feedback and her ultimate goal is to create an open and inviting conversation. Once I went into office hours to get help on the first paper, and she was unable to tell me the form of the poem, so instead she gave me resources to find it myself. However, a few hours later I received an email from her with all of the details about the poem's form, and some suggestions about how I could incorporate that research into my paper. She is extremely caring and altruistic. Definitely take her course!!", "rating": 5, "expected_grade": "A", "created": "2022-10-28T20:25:22.590436Z"}, {"professor": "Andrea Knowles", "course": "ENGL235", "review": "Dr. Knowles is probably the nicest and realest person you'll ever meet. I'll keep it short and simple though...\r\n-  She is a pretty easy grader, there are people who cannot write an essay, she gives them amazing grades, so if you try, you'll do amazing\r\n- I personally didn't take notes on everything, I slightly wish I would've (I'm forgetful, so if you aren't, then you'll be perfect)\r\n- Essays and paper prep she helps with! In class group work will give you time to find examples, make a thesis, etc in a google slide show that you can later use\r\n- There's a bit of group work, everyone in the class was really nice and loved having convos with eachother and her!\r\n- She's really smart, but she is tired, which is not her fault at all\r\n- Super sweet and if you talk to her, I promise she will help and be so nice\r\n- Weekly Reading Responses to your readings, keep up or skim the reading, most of the short ones are shown in class anyways\r\n- If you see her class, take it, I do believe she will be on maternity leave for Fall 2023, but besides that, amazing teacher", "rating": 5, "expected_grade": "A", "created": "2023-05-06T03:46:53.560026Z"}, {"professor": "Andrea Knowles", "course": "ENGL101", "review": "Dr. Knowles is a great choice -- very understanding, lenient grading, didn't make ENGL101 any more difficult than it needed to be. It was a great experience having her!", "rating": 5, "expected_grade": "A", "created": "2023-12-22T02:04:28.509951Z"}], "name": "Andrea Knowles", "slug": "knowles"}