{"courses": ["ENGL101", "ENGL101", "ENGL101", "ENGL101H", "ENGL101S", "ENGL101", "ENGL393", "CMLT235", "ENGL393", "ENGL101", "ENGL101S", "AASP298L", "ENGL234", "CMLT235", "ENGL101"], "average_rating": 4.4615, "type": "professor", "reviews": [{"professor": "Anthony Batts", "course": "ENGL101", "review": "Pretty nice professor who is chill. Sometimes we get out early from class. You are allowed to skip 4 classes without losing credit which is nice. The lectures he gives are pretty helpful in terms of content. The only negative is that we do not receive very much feedback from our final projects other than a filled out rubric which makes it difficult to learn from our mistakes. Other than that, I would recommend this professor.", "rating": 4, "expected_grade": "B+", "created": "2021-12-16T04:00:20Z"}, {"professor": "Anthony Batts", "course": "ENGL101", "review": "Good Professor. The contact taught in class is helpful for assignments. He is also very accommodating and easy to talk to regarding assignments. ", "rating": 5, "expected_grade": "", "created": "2021-12-19T19:40:09Z"}, {"professor": "Anthony Batts", "course": "ENGL101", "review": "Dr. Batts is a nice guy and an interesting person but he gave more assignments than necessary (they weren't hard but took time and there were like 2+ a week) and graded fairly. He's flexible on turning in assignments late and sometimes let us out early. Dr. Batts tried to get to know his students through 1 on 1 meetings and made lectures go by fast through different assignments and groupwork. However if you don't like writing you might want a professor who gives less work. ", "rating": 4, "expected_grade": "A-", "created": "2022-01-07T20:25:29Z"}, {"professor": "Anthony Batts", "course": "ENGL101", "review": "There are a few activities and feedback that I found to be unhelpful for my following assignments or personal improvement, but overall Batts provides reasonable grading and does his best to find what methods will help out the students the most. He would also frequently let us out early. Batts is nice and understanding, especially when you turn in some assignments late. The workload may be heavy at times, and you have to start at a reasonable pace. Despite this I can't find any other professor who would offer a lighter workload, especially when Batts slightly adjusted the requirements a couple of times for our benefit. Don't be afraid to reach out to him for clarification or help. ", "rating": 5, "expected_grade": "", "created": "2022-01-11T22:48:06Z"}, {"professor": "Anthony Batts", "course": "ENGL101", "review": "Grades a little tougher than some other 101 professors from what I see, but is reasonable.  He’s a super cool guy and lets us out early from class some times so that’s tuff. All hail Batts ", "rating": 4, "expected_grade": "A-", "created": "2022-05-22T00:50:08Z"}, {"professor": "Anthony Batts", "course": "ENGL101", "review": "Batts is super chill and very organized. He often lets class out early which is also nice. \r\n-0.5 star for tougher grading for an ENGL101 course.\r\n-0.5 for strict(ish) attendance policy (only 2 unexcused absences for tues/thurs and 3 for MWF) Although if you email him with an excuse he is accommodating. \r\nIf you take his class just make sure to come to class- final drafts are graded a bit harsher and took more work than expected. rough drafts and other assignments graded very nicely (i.e. completion). He's super approachable and usually answers emails in 24 hrs. All around a nice guy. \r\nOverall I'm glad I took his class. He's a really great teacher, I certainly learned a lot from him.", "rating": 4, "expected_grade": "A", "created": "2022-11-29T14:45:40.344514Z"}, {"professor": "Anthony Batts", "course": "ENGL393", "review": "He was one of the most kindest and responsive professors I have ever had. He was always open to questions or concerns that I had throughout the entire semester. In these ways, he made the class much more enjoyable than it already was. Very reasonable grader, the course was designed such that it was easy to navigate and work, and the amount of detail he put into his assignments was absolutely amazing.", "rating": 5, "expected_grade": "A", "created": "2023-01-25T06:39:24.273730Z"}, {"professor": "Anthony Batts", "course": "ENGL393", "review": "Took ENGL393 with Batts over the winter. Take him. That's all that needs to be said.", "rating": 5, "expected_grade": "A+", "created": "2023-02-28T04:36:36.776293Z"}, {"professor": "Anthony Batts", "course": "ENGL101H", "review": "Great professor , easy going and I earned a lot. Good feedback on essays.", "rating": 5, "expected_grade": "A", "created": "2023-03-15T14:49:29.659301Z"}, {"professor": "Anthony Batts", "course": "ENGL101", "review": "Dr.Batts is a nice guy and you can tell he really enjoys teaching. He grades much harder than one would expect for English101, so you definitely cannot get away with bs-ing your work. That being said, he is so chill if you ask for help or ask for an extension. I definitely improved my writing and learned a lot", "rating": 4, "expected_grade": "A-", "created": "2023-05-24T02:34:41.093779Z"}, {"professor": "Anthony Batts", "course": "ENGL101", "review": "No matter what professor you take, Engl101 is going to take a good amount of time because of all the writing thats required. Even though English is not my best subject, I believe that Dr. Batts graded my work fairly. Dr. Batts explains what is required for each big project through his lectures and by providing examples of past students work. Overall, if you follow what he says you should succeed in his class. I don't know how good the other Engl101 teachers are but if you see a section open for Dr. Batts I would recommend taking him.", "rating": 5, "expected_grade": "A-", "created": "2023-12-17T06:21:15.437266Z"}, {"professor": "Anthony Batts", "course": "ENGL101S", "review": "He graded a lot tougher than I thought he would, and I have always been a decent writer. However, he's chill and has a pretty easy going attitude.", "rating": 3, "expected_grade": "B-", "created": "2024-01-04T17:25:45.679540Z"}, {"professor": "Anthony Batts", "course": "CMLT235", "review": "Solid professor. Stresses themes throughout the readings you do so you remember the key ideas even after taking the class. If you complete the readings on time and put effort into the 2 or 3 writing assignments throughout the semester you should get an A or high B.", "rating": 5, "expected_grade": "A", "created": "2024-01-16T01:29:40.716721Z"}], "name": "Anthony Batts", "slug": "batts"}