{"courses": ["MATH140H", "MATH141", "STAT400", "MATH120", "MATH141H", "STAT401", "STAT410", "SURV410", "MATH140", "HLTH672", "SPHL601", "SPHL602", "SPHL603", "MATH240", "MATH410", "SPHL610", "STAT464", "MATH120", "MATH120", "STAT100", "STAT401", "MATH498T", "STAT100", "STAT401", "MATH120", "STAT100", "STAT401", "DATA100", "MATH240", "MATH423", "STAT401", "DATA100", "MATH120", "STAT100", "STAT401"], "average_rating": 4.5909, "type": "professor", "reviews": [{"professor": "Archana Khurana", "course": "MATH141", "review": "Her test are fair and she holds more office hours/review sessions than you could ever dream of going to. She will do anything to make sure you succeed. ", "rating": 5, "expected_grade": "B-", "created": "2017-12-13T23:18:38Z"}, {"professor": "Archana Khurana", "course": "STAT401", "review": "She might be new but don't let that scare you off; Archana is a great instructor. Her explanations are easy to understand and she works though tons of examples in class. Exams were fair and you generally know what to expect on them.\r\n\r\nShe also genuinely cares that people do well in her class. Don't be surprised if you go to office hours after an exam and she already remembers what mistakes you made. I did a double take the first time but honestly it's pretty refreshing in a huge school like UMD.", "rating": 5, "expected_grade": "A-", "created": "2018-11-01T15:18:02Z"}, {"professor": "Archana Khurana", "course": "STAT410", "review": "Very standard professor. She's very nice and considerate, but also isn't amazing. She lectured from notes and sometimes it felt like she wasn't as fluent in the theory as the applications.", "rating": 3, "expected_grade": "A", "created": "2019-12-24T16:34:10Z"}, {"professor": "Archana Khurana", "course": "STAT401", "review": "Really cares about her students performing well. She will add extra credit and assignments to help students. Her lectures are easy to follow and follows the textbook well. Taking her again for STAT410.", "rating": 5, "expected_grade": "A", "created": "2020-01-10T21:07:57Z"}, {"professor": "Archana Khurana", "course": "MATH240", "review": "I've struggled in other math classes up until this one, but she really takes the time needed to have everyone understand the topics and parts that build up to a new topic. Haven't needed to but I would feel very comfortable going to her if an issue came up as well", "rating": 5, "expected_grade": "A-", "created": "2020-04-18T18:27:08Z"}, {"professor": "Archana Khurana", "course": "STAT401", "review": "Very nice professor that cares about her students. Lectures were recorded and she would give an ELMS quiz after learning new chapter content in class. We also had weekly ELMS worksheets. It seems like a lot of assignments at first but she would go over the questions in lecture. Exams had the same topics as practice exams, was open book, and gave us all day to complete it. Would answer emails regarding questions fairly quickly and would not hesitate to help.", "rating": 5, "expected_grade": "A-", "created": "2020-12-28T20:15:56Z"}, {"professor": "Archana Khurana", "course": "STAT401", "review": "Probably the most fair stat professor I've had so far. (after taking STAT400 twice). Highly recommend", "rating": 5, "expected_grade": "", "created": "2021-12-17T21:53:37Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Fair teacher. Made the reviews about the same or harder than the test so you'll be prepared as long as you do them. Straightforward assignments. I always studied the night before and it worked out alright so if you have to take this class don't freak out. Make sure you understand all the material and if not Archana is always willing to help and is very good at responding to emails", "rating": 4, "expected_grade": "A", "created": "2022-01-14T02:51:33Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Mrs. Khurana was sometimes hard to understand. Also, she made a lot of mistakes while teaching which made it confusing and hard to understand sometimes.", "rating": 3, "expected_grade": "B+", "created": "2022-04-28T16:57:17Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Hard to understand but shes very sweet and takes her students feedback into consideration! Def take her.", "rating": 5, "expected_grade": "A-", "created": "2022-05-03T14:46:40Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Best Math professor I have taken by far. She was considerate of us and dropped a bunch of assignments on the MathLab, extended due dates for the homework and the exams were similar to the practice she goes over in class. She also goes pretty fast in lectures but just let her know she is going too fast and she will take that into consideration. Please take her ", "rating": 5, "expected_grade": "A", "created": "2022-05-10T18:45:44Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "She is a lovely woman! She has a very thick accent so it can be kind of hard to understand her but its easy enough. In class, she mostly just writes problems and you copy stuff down which makes it hard to learn, but if you go to her office hours, she's always happy to answer any questions and help you. You have groupworks or a quiz in almost every discussion section but she drops the lowest one at the end of the semester. HW assignments are virtual on MyMathLab but you have 3 attempts on every question and the ability to see an example worked through. She also drops your lowest 3 homeworks at the end of the semester too. She was very lenient with deadlines for the homework so if you have an issue, just email her. Exams were straight forward, just make sure you do the exam review guides that she posts before them. TA's give partial credit for so many questions on exams so as long as you try and at least write something, you'll get some points for a question. 10/10 recommend her.", "rating": 4, "expected_grade": "B-", "created": "2022-05-13T20:13:23Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "I have only good things to day about this professor. She is one of the best mathematics professor I’ve ever had! I’m going to be upfront and say I suck at math, never been good at it, but professor Khurana made it very easy to understand. She is very caring and always happy to answer questions, her sample exams are usually harder than the actual exams so practice until you feel comfortable with it and you’ll do well on the actual exam!", "rating": 5, "expected_grade": "A-", "created": "2022-05-18T23:45:07Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Amazing math teacher! She makes the content easy to digest and makes reviewing for exams easy. She will often provide review exams for students to practice on before each exam. She is also very understanding and willing to extend homework assignment if students need it. She welcomes questions in class. She genuinely cares deeply about her students and makes learning math easy. I heard students saying she made things difficult or wouldn't prepare us enough but I don't believe those students used the resources she gave us to study at home. To get a high grade in any class practice at home is needed! She is an amazing professor and gives us lots of resources to study from. Would highly recommend!", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T04:58:50.873724Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "She is the most caring teacher who will literally drop any bad grade if you ask her to and also offers extra credit options. It takes some time to get used to her accent but it is well worth it if that means having her as a teacher. She cares about her students so much and will cater to each and every one of their requests. She is also the fastest responder on email and will answer at any time (even in the middle of the night some times). Best math teacher!", "rating": 5, "expected_grade": "", "created": "2022-12-12T21:54:39.144582Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "I am really bad at math, so I was nervous going into MATH120. However, Khurana is really good at explaining all of the concepts. Just make sure to show up to class in order to succeed. The review problems are always much harder than the actual tests, which I like a lot.", "rating": 5, "expected_grade": "A", "created": "2022-12-13T22:35:37.477405Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "With MATH120, Professor Khurana is the best you're going to get. She is a very patient and caring teacher despite having so many students and multiple sections under TAs. If you can take her, do it! She is always willing to help students and her teaching style is easy to follow.", "rating": 5, "expected_grade": "A-", "created": "2022-12-14T21:19:19.669824Z"}, {"professor": "Archana Khurana", "course": "STAT100", "review": "She has a thick accent and I initially had trouble understanding her, but after the first week it got easier. Overall, her class is organized in a way that the practice exams are very similar to the actual exams, so you don't have any surprises on the actual test. She does a really great job simplifying complicated problems and making them easy to understand. Overall, I would recommend her class .", "rating": 5, "expected_grade": "", "created": "2022-12-15T01:16:48.686937Z"}, {"professor": "Archana Khurana", "course": "STAT100", "review": "Besides her thick accent which takes getting used to, Archana is easily understandable, very knowledgeable and flexible as an educator.   She is always willing to extend deadlines, take the time to go over what we struggle with, meet during office hours, and models exams off of older examples so it’s easy to know what to expect.", "rating": 3, "expected_grade": "C+", "created": "2022-12-16T18:08:38.159447Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "I have never taken cal before in my life and she made this course so clear! As long as you try and review her practice exams, you'll be golden. The TAs also review before the exams as well. Best math professor ever!", "rating": 5, "expected_grade": "A", "created": "2022-12-18T22:38:55.557840Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "I loved Archana! She is such a sweet lady and really cares about her students doing well. She is a bit hard to understand at first because of her accent but you get used to it pretty quickly. I think she is the best math120 teacher that you can take at maryland. She really teaches well and goes slowly until everyone understands the topic. I STRONGLY encourage anyone to take her class. She is the best!", "rating": 5, "expected_grade": "B+", "created": "2023-01-05T20:39:29.041405Z"}, {"professor": "Archana Khurana", "course": "STAT100", "review": "It does not get better than her when it comes to STAT100. She constantly pushes back assignment due dates, posts slides, and the exams are fair. I could not recommend her enough, she is great!", "rating": 5, "expected_grade": "A+", "created": "2023-01-22T09:33:19.582035Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Professor Khurana is a very sweet and lenient professor. I did not consider myself a math person but I found myself loving this class! Lots of potential for leniency (multiple tries on homework, very lenient about pushing back due dates, etc). Exam questions are easier than homework questions. Weekly quizzes in discussion sections (1 week individual, 1 week group) are easier than they sound (the TA's will explain the exact style of questions on the quiz) and very helpful in retaining class material.", "rating": 5, "expected_grade": "A+", "created": "2023-01-26T00:00:03.515939Z"}, {"professor": "Archana Khurana", "course": "STAT100", "review": "Dr. Khurana is an amazing and understanding professor. She listens to her students during lectures and extends due dates for assignments if students are having any difficulty with them or if she hasn't covered any concepts on these assignments. Weekly discussions are great too. The TAs help a lot with R assignments and exam reviews. Both Dr. Khurana and the TAs explain the style of questions you would see on the exams very well and make you feel prepared for them (even when you don't study sometimes). She's very sweet and caring, making her a lot more personable and someone to go to if you have any questions.", "rating": 5, "expected_grade": "A-", "created": "2023-04-21T18:26:05.849791Z"}, {"professor": "Archana Khurana", "course": "STAT100", "review": "this class was a breeze. her lecture slides are quite detailed, so it's easy to follow on your own. her lectures move a little slow, but she always goings over examples to make sure you understand. TAs help a good amount in discussion. There are a lot of assignments to boost your grade that aren't very hard. As long as you put in a reasonable amount of effort, you'll be fine. I would definitely choose her for other math classes she teaches. 10/10", "rating": 5, "expected_grade": "A", "created": "2023-05-03T19:09:48.097707Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "amazing professor. lectures are recorded, she makes sure pacing is suited to students and posts practice exams and has a zoom review before exams. there are a few quizzes (group and individual) in discussion sections but the TAs prepare you well for them, and shes very caring and will adjust due dates and pacing based on the class", "rating": 5, "expected_grade": "A+", "created": "2023-05-04T20:52:32.407404Z"}, {"professor": "Archana Khurana", "course": "STAT100", "review": "overall:\r\nprofessor khurana's class is overall really easy as long as you put in the effort. she does have a thick accent which can make hearing her in lectures hard, but she goes very slowly so it's easy to keep up. her practice exams are exactly the same as the test, so if you keep doing them until you get 100%, you'll ace every exam. for me, the downside of the class was the r-assignments that would take so much time for no reason. you would get time to do them in discussions but my TA was honestly incompetent so he was no help. just go to her office hours  if your TA is useless and she'll help you with the r-assignments if you're having trouble. the class is also really easy if you took AP Stat in high school.\r\n\r\nrecommendations/heads up:\r\nshe records like 60% of lectures (and if the class asks her to record she will), discussion didn't attendance for me, if even one person asks for an extension she'll extend assignments for everyone (so almost every assignment got an extension lol)", "rating": 4, "expected_grade": "A", "created": "2023-05-10T16:24:52.029606Z"}, {"professor": "Archana Khurana", "course": "STAT401", "review": "She is an amazing professor that cares about her students. Her lectures can be slow, but she does an amazing job at explaining concepts and makes sure everyone understands. She takes students' feedback seriously and will make sure the quizzes and assignments are reasonable. I would recommend people to go to class because sometimes she will literally give you the answers and hints for quizzes and assignments. Her exams are fair and I would recommend people to take her class! All the assignments are reasonable and fair!", "rating": 5, "expected_grade": "A", "created": "2023-05-10T19:03:20.904271Z"}, {"professor": "Archana Khurana", "course": "MATH498T", "review": "A fun class oriented around practical + applied concepts. Archana was a kind professor that cared deeply about students actually learning concepts. She was highly receptive to students' feedback and always tried to improve overall learning experiences. She would ask students for input on the curriculum topics, assignments, and possible improvements to the course. Anyone is capable of succeeding in her class if they put in effort.", "rating": 5, "expected_grade": "A-", "created": "2023-05-11T07:52:14.707091Z"}, {"professor": "Archana Khurana", "course": "MATH498T", "review": "A fun class with practical concepts + applications. Archana was an exceptional professor that deeply cared about students genuinely learning concepts. She was deeply invested in making sure everyone has an effective learning experience. She would take student input with regards to curriculum, assignment details, and general course improvements that helped students. She created an environment where anyone could succeed if they put in effort.", "rating": 5, "expected_grade": "A-", "created": "2023-05-11T07:59:37.788782Z"}, {"professor": "Archana Khurana", "course": "MATH498T", "review": "Interesting course and very sweet and accommodating professor.", "rating": 5, "expected_grade": "A", "created": "2023-05-18T14:39:18.289347Z"}, {"professor": "Archana Khurana", "course": "STAT401", "review": "One of the best instructors at UMD. She is so kind and understanding and truly cares about her students performing well. She is also exceptionally responsive to student feedback which is rare. We had two exams and a final. Homework is reflective of lecture examples and exams are in turn reflective of the homework, quizzes, and practice exams. So basically, no surprises. Quizzes are timed usually 10 to 15 minutes for one or two short questions and based directly on the material taught in class, so I’d highly recommend reviewing your lecture notes before attempting them. She also posts all her handwritten lecture notes on Canvas, which is super helpful, especially if you aren’t the best notetaker. 10/10 would take again and recommend to anybody choosing between professors!!", "rating": 5, "expected_grade": "A+", "created": "2023-05-18T15:35:49.359868Z"}, {"professor": "Archana Khurana", "course": "MATH498T", "review": "Archana is really nice, caring, and accommodating to students. She went over linear programming problems (LPP) for minimization and maximization, the simplex method, the Big M method, the dual of a primal LPP as well as their relationship, transportation problems, transshipment problems, assignment problems, traveling salesman, and integer programming. There are bi-weekly homework assignments (5 HWs each around 3-4 problems as determined by a majority vote by the class) along with some short classwork and take-home quizzes (2 classwork sheets and 2 quizzes). The homework, classwork, and quizzes are worth 30%. There are two midterms, each worth 20%. The final exam is cumulative with more weight put on the second half of the semester. The final is worth 30%. Archana also gave us an optional extra credit project where we had to program a function to solve the traveling salesman problem (I didn't do it but I overheard from some classmates that it was challenging). Overall, the grading was very lenient and the course content itself was not too difficult, provided that you know some basic linear algebra. You only had to get a 92% to get an A in the class so I believe that many students did fairly well.", "rating": 5, "expected_grade": "A+", "created": "2023-11-14T16:25:46.831491Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Archana Khurana is a very kind individual and is very accommodating for her students. She wants students in her class to succeed. It is that simple, she's the G.O.A.T", "rating": 5, "expected_grade": "A", "created": "2023-12-05T00:06:19.492753Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "She is a great teacher. I remember thinking in the first week she was hard to understand but have not thought about it since you get used to it. I never took calc before and aced the class. She does a good job teaching, and a better job preparing you for exams. For every exam, she gives you three practice exams that are exactly the same as the exam you will take. If you can, get in this class to fulfill your math req", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T21:35:35.614696Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "I was able to do well in this course since I took Calculus before, but definitely would have struggled a lot if I hadn't. Because of this, I didn't really attend lectures and felt like reviewing the textbook was more informational. Professor Khurana isn't the best teacher, I was only able to understand concepts more through the AMP sessions. Her lectures include problems that seem easy, but then you look at the review for the tests that include ones 10x harder and feel like you're screwed. Just make sure you study a lot for the exams since they're worth a pretty large portion of your grade, and you should do well. Overall I would say her grading policies are pretty accommodating and for your lowest-scoring exam; she drops the grading scale from 100 to 50, but her teaching style isn't so great.", "rating": 2, "expected_grade": "A", "created": "2023-12-09T19:26:40.863653Z"}, {"professor": "Archana Khurana", "course": "STAT100", "review": "I had Prof Khurana in Spring 2023. STAT100 was difficult for me. I met with Prof Khurana often and she was super sweet and helpful. The content in the class was hard but the assignments were doable. However, the exams destroyed me and I ended up failing the class with a D (oh well). I have a problem with the content, not the professor she is sweet.", "rating": 4, "expected_grade": "D", "created": "2023-12-11T21:19:38.617175Z"}, {"professor": "Archana Khurana", "course": "STAT100", "review": "Goes very slow to make sure that all students understand the concepts and actually helps people when they get confused instead of just telling a TA to go over it with them in discussions. She does have a thick accent which can make things a little difficult to understand at times, but overall a great professor", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T18:51:12.364841Z"}, {"professor": "Archana Khurana", "course": "STAT401", "review": "As most other reviews say, she is extremely nice and helpful. I had friends taking STAT401 with other professors at the same time and it seems to be much more work with others. Quizzes and worksheets are almost entirely multiple choice with six VERY simple projects. We were allowed to choose the software we used but she said she will be switching to Minitab next semester for the projects to be more inline with her lower-level courses. Exams you have cheat sheets, so it is very low stress around exam time. Highly recommend her for STAT401.", "rating": 5, "expected_grade": "A+", "created": "2023-12-14T21:40:54.796730Z"}, {"professor": "Archana Khurana", "course": "STAT100", "review": "Professor Khurana is one of the best professors here. Though she has an accent, it is not terribly difficult to understand her. She cares about her student's success and gives plenty of opportunities during the lectures to get extra credit. She's so sweet and takes her time to ensure that everyone understands the lesson. If you have the chance to take this class with her, definitely do it!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T21:13:52.919125Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "I don't usually write reviews but I had to write one for Ms. Khurana because she is one of the best professors I have had at this school so far. I initially took MATH120 with Mr. Timothy, however, I dropped it after the first exam in his class since his teaching methods were not my way of learning. Upon reviewing the ratings for MATH120 classes I saw that this professor had the most rating, so I took her, one of the best decisions ever. Her exams are literally the same as her practice exams. She just changes the numbers, but the concept is the same. After the first exam in her class, I honestly rarely showed up in her class for lectures and I did fairly well. For the third exam, I did not go to her lecture for any of the material on it but I got a 95% for that exam. I used mathlab to help me and I practiced the practice exams to know what to do. If you are thinking about taking her, DO IT! It will be worth it! After taking this class with Mr. Timothy, I thought it would have been very hard, but in reality, Ms. Khurana made learning in the class fairly easy.", "rating": 5, "expected_grade": "A-", "created": "2023-12-20T15:30:55.658069Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Professor Archana is a very nice woman. However, I really do not believe she is the best at teaching. It seems like she teaches the material like we should already know it, which for some people, is not true. She can be kind of confusing when explaining information during lecture, and most of the time I did not know what was going on. I learned most of the content during discussion classes with the TA and through other people. However, Professor Archana is super accommodating and is very open to helping her students since she truly wants them to succeed. This being said, I don’t think she’s necessarily the best professor, but I think she is the best choice for MATH120. I would recommend asking for help from the TAs and attending the AMP sessions, since those helped me a lot throughout the semester.", "rating": 3, "expected_grade": "A-", "created": "2023-12-24T18:15:58.860072Z"}, {"professor": "Archana Khurana", "course": "STAT401", "review": "STAT401 with Dr. Khurana is one of the most organized and fair courses I have taken. She wishes her students to do well and during office hours, she tries her best to resolve problems and accommodates students as much as possible. The lectures are intuitive and well-planned, with the exams similar to lecture examples and practice exams. If you come to lectures you will do well in her class.", "rating": 5, "expected_grade": "A-", "created": "2024-01-24T16:49:19.296472Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Do not recommend. Overall class was organized and had good structure but she was not a good lecturer. She was confusing and hard to understand on occasion. TA sessions were useless because they both were equally as bad as explaining content. Only good thing was the AMP sessions. Her AMP Dana was fantastic and a great resource throughout the course.", "rating": 2, "expected_grade": "C-", "created": "2024-03-21T02:13:05.898533Z"}], "name": "Archana Khurana", "slug": "khurana"}