{"courses": ["CMLT275", "WGSS275", "CMLT270", "ENGL101", "ENGL391"], "average_rating": 3.6667, "type": "professor", "reviews": [{"professor": "Ariana Nash", "course": "CMLT275", "review": "Professor Nash is a very nice professor. The class is very interesting and she really tries to keep your focus on the meaning of the text instead of throwing books at you. She wants you to try to understand the texts through several lenses and really cares about how much effort you put in rather than your interpretation of the text. The reading load can be a lot but it's all fairly interesting so it's not too bad. She is very considerate of her students needs and adjusts the workload accordingly. The actual workload is approximately 500 words a week which is very manageable. Grading is very much about how much effort and thought you put in so if you put in effort and do your readings the class is fairly easy. She is also very nice and accommodating so if you have any issues just send her an email or go to her office hours and she will try her best to help you.", "rating": 5, "expected_grade": "A", "created": "2023-11-27T20:02:21.996709Z"}, {"professor": "Ariana Nash", "course": "CINE245", "review": "Nash was the TA for CINE245 this past semester. In discussion, she expects everyone to voice their opinions, yet will openly tell you that you’re wrong if she disagrees. Nash expects you to make the gen-ed your life and told us to devote 2+ hours to the readings on top of watching the movies. She grades super harshly (especially if your interpretations don’t align), so I would not recommend having her if you’re looking for an easy A.", "rating": 1, "expected_grade": "A-", "created": "2023-12-22T14:08:30.604982Z"}, {"professor": "Ariana Nash", "course": "CMLT275", "review": "Ariana was such a lovely professor. She is compassionate and empathetic towards all of her students, and gives thoughtful feedback and emails. The workload was a bit much for the class, sometimes having to finish one novel in a week and a half. If you consider yourself a slow reader, this class might be a bit hard to keep up with. Lots of the readings were interesting, some not as much. There were weekly reading responses of 500 words, a midterm paper, and a final paper. Overall, the class was not a breeze but I still enjoyed her discussions. I would recommend Ariana for any class, honestly.", "rating": 5, "expected_grade": "A", "created": "2024-01-29T23:24:20.742946Z"}], "name": "Ariana Nash", "slug": "nash_ariana"}