{"courses": ["PHYS142", "PHYS798L", "PHYS131", "PHYS174", "BIPH698L", "CHPH709L", "PHYS115", "PHYS375", "BIPH698L", "CHPH709L", "PHYS798L", "PHYS275", "BIPH698L", "CHPH709L", "PHYS115", "PHYS798L", "BIPH698L", "CHPH709L", "PHYS798L", "PHYS275", "BIPH698L", "CHPH709L", "PHYS115", "PHYS798L", "BIPH698L", "CHPH709L", "PHYS275", "PHYS798L", "BIPH698L", "CHPH709L", "PHYS798L"], "average_rating": 4.2, "type": "professor", "reviews": [{"professor": "Arpita Upadhyaya", "course": "PHYS142", "review": "I didn't pay attention in class, so I'm not going to rate the teacher. She's a nice lady and she goes through her powerpoints in class. \n\r\nHere's the breakdown:\n\r\nHomework- 10%\r\nQuizzes- 10%\r\nFirst Exam- 15%\r\nSecond Exam- 15%\r\nThird Exam- 15%\r\nLab Reports (free points) -10%\r\nFinal Exam- 25%\n\r\nI learned from reading the book doing the homework. The quizzes are straightfoward, and easy if you study. For each exam, you get a notecard, but its pretty much filled with formulas. Exams are variations on homework problems. If you know how to use the formulas, you're set for the most part. ", "rating": 4, "expected_grade": "B", "created": "2011-12-19T19:46:00Z"}, {"professor": "Arpita Upadhyaya", "course": "PHYS174", "review": "She's a really nice lady and will pretty much tell you what to do. Also a pretty easy grader. She'll also hold a review session before the practical where you can pretty much go and write down notes on how to do everything on the practical. ", "rating": 5, "expected_grade": "A", "created": "2010-12-23T19:44:00Z"}, {"professor": "Arpita Upadhyaya", "course": "PHYS174", "review": "shes a fine teacher. seems to want to help if she can", "rating": 4, "expected_grade": "C", "created": "2018-05-02T19:37:48Z"}, {"professor": "Arpita Upadhyaya", "course": "PHYS115", "review": "PHYS115 was one of my required classes. At first, I was weary about taking this class, but it's not that bad or difficult. There is homework (basically lab reports) due after each class, three exams, and a final presentation, and your lab notebook gets graded. Professor Upadhyaya is a good professor, and she does want each of her students to succeed. That being said she is a bit unorganized, and demeaning at times. We didn't have a TA for half of the year, so the grading was VERY slow, and she would question you if you were confused. Overall this class and professor were not bad at all, and don't hesitate to take the class if you need to.", "rating": 4, "expected_grade": "A", "created": "2023-12-20T16:32:51.476604Z"}, {"professor": "Arpita Upadhyaya", "course": "PHYS115", "review": "Pros: reasonable expectations, easy-ish workload, open-notebook exams, pretty lenient grading\r\nCons: sometimes disorganized and messy teaching style, not always patient\r\nOther notes: in every class you do a lab with your partner and submit a lab report (sometimes finished in class, sometimes not)", "rating": 4, "expected_grade": "A", "created": "2024-01-25T16:31:02.925153Z"}], "name": "Arpita Upadhyaya", "slug": "upadhyaya"}