{"courses": ["ENGL101H", "ENGL101S", "ENGL393", "ENGL394", "ENGL393", "ENGL394"], "average_rating": 4.5, "type": "professor", "reviews": [{"professor": "Aubrey Zinn", "course": "ENGL101H", "review": "Fantastic professor, really kind and cares about her students. Gives a lot of extra credit. Readings are never discussed in class and are thus unnecessary to do.", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T14:52:54.407421Z"}, {"professor": "Aubrey Zinn", "course": "ENGL101S", "review": "Although I will end the semester with a A- instead of A+, I learned a lot in the class. Professor Zinn is EXTREMELY understanding. She also has a no-questions asked late policy for 24 hours on the first few major assignments. She takes time with grading, I do have to wait like 2-4 weeks but she really does comb through a paper and even gives pointers on what to do better. She also is understanding to those that don't understand prompts, during the break. The first day off she allowed us to schedule virtual office hours, which is honestly very helpful. She was also one of the few teachers that remembered my name and the topic of my essay. Overall she is an amazing person, you can tell that through the small personal anecdotes/conversations you have with her. But better than that she is an excellent Engl101 professor. The only reason I have anything other than a A+ was due to my papers earlier on in the semester, but my writing did improve as the semester went on.", "rating": 5, "expected_grade": "A-", "created": "2023-12-12T20:21:43.210985Z"}, {"professor": "Aubrey Zinn", "course": "ENGL101H", "review": "This class has to be one of the dumbest ones I've had to take. I get that this is for a GenEd, so chances are, it'll suck, but this was unbearable. The assignments are so boring, and sometimes I feel like the grades are way too harsh for what the class is. I love to read for fun, and I have always done well in English, but this was hard, simply because I was not engaged at all. Now, Professor Zinn was super nice. She was understanding when I couldn't make it to the lectures and would ask me if was doing alright when I was going through stuff. She is probably the best Professor for this dumb class. The only thing is she does take a while to grade, but I guess that can be expected in an English class.", "rating": 4, "expected_grade": "A", "created": "2023-12-15T17:33:59.702764Z"}, {"professor": "Aubrey Zinn", "course": "ENGL393", "review": "Loved taking ENGL393 with Professor Zinn. It was a very unique English class. We took part in fun activities and group projects to learn the content. The assignments were at times difficult, but if you work hard, you will get the grade you want. Only problem was grades took long to get back to us.", "rating": 4, "expected_grade": "A", "created": "2023-12-16T15:42:31.696164Z"}, {"professor": "Aubrey Zinn", "course": "ENGL101S", "review": "If you're in Engl101 this review will fit for you as well.  She is a very chill, humble teacher. I love her she will make everything seem light even if you have essays to do and understands if you need an extension on assignments. Her pacing for the class is amazing as well from what I've noticed you'll be ahead of all the other English classes and won't be stressed by the end of the semester which was REALLY helpful when it came to studying for finals. Lastly, be mindful to check the syllabus but you one thing I love about her is the fact she doesn't fully rely on it all the time, she makes sure to stay on track for major assignments with the syllabus but small things, and she is not necessarily strict on it to lighten your load!! 10/10 would recommend !!", "rating": 5, "expected_grade": "A", "created": "2023-12-21T04:12:25.461994Z"}, {"professor": "Aubrey Zinn", "course": "ENGL393", "review": "Really fun class where we participated in many activities to get hands-on knowledge of what was being taught. Only issue is grades took long to get back. Highly recommend.", "rating": 4, "expected_grade": "A", "created": "2023-12-28T15:01:59.812526Z"}], "name": "Aubrey Zinn", "slug": "zinn"}