{"courses": ["ENGL393", "ENGL391", "ENGL395", "PHSC497", "ENGL391", "ENGL393", "PHSC497", "ENGL393", "ENGL395", "ENGL393", "PHSC497", "ENGL393", "PHSC497", "ENGL390", "ENGL395", "PHSC497"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Aysha Jawed", "course": "ENGL393", "review": "Professor Jawed is a gem. As long as you follow her instructions and try your best, you're in good hands. After you complete your first draft, she'll review it and suggest corrections. If you correct it properly, she'll give you full credit. You can also send her your draft at any time, so be sure to utilize her expertise. It is up to you how difficult you want your research to be, so don't stress over the research project, just choose a topic you are passionate about.", "rating": 5, "expected_grade": "A+", "created": "2021-09-03T01:40:10Z"}, {"professor": "Aysha Jawed", "course": "ENGL393", "review": "This is the best professor you can have for technical writing. She gives you relevant assignments that can be utilized in your future and always provides excellent feedback when grading your rough draft. Not only is Professor Jawed understanding, but she genuinely cares about your well-being while encouraging you to do your best in the course.", "rating": 5, "expected_grade": "A+", "created": "2021-12-18T01:51:38Z"}, {"professor": "Aysha Jawed", "course": "ENGL395", "review": "Professor Aysha is a very devoted teacher and gives you assignments that will help you in the future too. Easy grader, will first suggest edits on your draft and then grade it after you work on your mistakes. Lecture does get very boring especially because it is a 3 hour long class, but very helpful too.", "rating": 5, "expected_grade": "", "created": "2022-04-11T23:33:39Z"}, {"professor": "Aysha Jawed", "course": "ENGL393", "review": "Prof Jawed is very nice and she explains the material well. The lecture is from 6:30-9:10 but she made it not so boring. You can get very good grades for assignments as long as you meet all the requirements.", "rating": 5, "expected_grade": "A+", "created": "2022-12-23T20:06:08.454092Z"}, {"professor": "Aysha Jawed", "course": "ENGL393", "review": "Very helpful and responsive.  Sets clear guidelines for assignments and gives great feedback on rough drafts.", "rating": 5, "expected_grade": "A+", "created": "2022-12-31T03:18:44.472591Z"}, {"professor": "Aysha Jawed", "course": "ENGL393", "review": "Prof Jawed is extremely nice and receptive to questions. The course necessarily isn't the most fun as the assignments are somewhat draining, but Prof Jawed does a great job of balancing the class. Recommended.", "rating": 5, "expected_grade": "A+", "created": "2023-01-21T17:06:49.967196Z"}, {"professor": "Aysha Jawed", "course": "ENGL393", "review": "Took ENGL393 during the Winter 2023 semester. There were 3 main projects/essays: technical instructions, infographics (which is based on the technical instructions), and a cover letter + skills-based resume. In addition, there were straight-forward discussion posts to do a few times a week. Just follow the rubric, ask the professor for clarification if needed, and put in the work.", "rating": 5, "expected_grade": "A+", "created": "2023-04-01T18:27:55.852704Z"}, {"professor": "Aysha Jawed", "course": "ENGL395", "review": "Dr. Jawed has been my favorite instructor from my time at UMD! She is incredibly kind and devoted.\r\n\r\nDr. Jawed also gives you incredible advice on your writing, and will help you become a writer. In this class you will work on a resume, cover letter and/or personal statement that you can use for professional/graduate life. You will also work on a review paper that is a great learning process.", "rating": 5, "expected_grade": "A+", "created": "2024-01-24T19:51:22.574048Z"}], "name": "Aysha Jawed", "slug": "jawed"}