{"courses": ["PHYS420", "PHYS171", "PHYS270", "PHYS475", "PHYS675", "PHYS779A", "PHYS274", "HLTH672", "HLTH710", "PHYS371", "PHYS371", "PHYS420", "PHYS420", "PHYS420"], "average_rating": 3.5, "type": "professor", "reviews": [{"professor": "Bei Lok Hu", "course": "PHYS122", "review": "I don't recommend taking physics with Dr. Hu. For one thing, it's pretty difficult to understand what he says half the time because of his accent. Also, he never really explained concepts fully. He would derive equations, which sometimes had different symbols from those given in our textbook; PHYS122 is an introductory physics course- we are expected to know concepts and not derivation of equations, especially since this course is not calculus-based. He would go over problems using the derived equations but they were difficult to follow because he never really would explain WHAT the concepts were. Furthermore, his lectures were Powerpoint presentations often containing images and excerpts from our textbook. In a class such as physics where going over problems step by step helps in explaining concepts, powerpoint presentations were completely ineffective and useless. Using the blackboard would have been a much better approach to teaching this course. Dr. Hu also sometimes never completed problems that he started; thus, often my notes were incomplete. \r\nI feel that a majority of the class got by because most of the problems on the exams and quizzes were similar to (or the exact same) suggested review problems that he gave from the textbook as well as our homework problems (which were from the textbook as well). I suppose the predictability of the problems on the exams etc was one good side to Dr. Hu's teaching. This allowed me to get an A+ in the course, despite Dr. Hu's poor teaching skills. \r\nI believe Dr. Hu is very knowledgeable and also friendly and easy to approach; however, he does not seem to be the best professor.", "rating": 2, "expected_grade": "A", "created": "2009-07-08T17:53:00Z"}, {"professor": "Bei Lok Hu", "course": "PHYS122", "review": "Dr. Hu was a very difficult professor to follow and I do not recommend him at all.  He used notes and examples from a different textbook, and would jump into topics without explaining basic concepts such as what is a wave, or what is electricity.  Even though our course was a non-calculus based course, he relied heavily on mathematical explanations instead of actually explaining concepts conceptually.  He rarely worked through examples from the course textbook FULLY, from start to finish.  His demonstrations were not effective as many students did not understand the scientific principles behind them.  Very few students attended lecture as the course was not tailored to the abilities, background knowledge, and interests of non-physics major undergraduates.\n\r\nThe only good thing is that the exams were fair (textbook problems - nothing like the weird examples from class) and I liked that we could use notecards for them.  There were also weekly quizzes (no notecards) consisting of a textbook problem and weekly homework sets of ~8 hw problems.", "rating": 2, "expected_grade": "", "created": "2009-05-03T15:25:00Z"}, {"professor": "Bei Lok Hu", "course": "PHYS274", "review": "Very kind and cares about his students. Expect to work a lot but to get a lot out as well. Very approachable.", "rating": 5, "expected_grade": "", "created": "2020-04-20T19:08:55Z"}, {"professor": "Bei Lok Hu", "course": "PHYS274", "review": "Prof. Hu was amazing! He taught this class so well that I can do some of the problems in my sleep, and was never boring. Great guy!", "rating": 5, "expected_grade": "A+", "created": "2020-05-31T17:12:01Z"}, {"professor": "Bei Lok Hu", "course": "PHYS371", "review": "Dr. Hu the GOAT! he is extremely passionate to teach physics. The exams and homework are very similar. Strongly recommend taking this course with him.", "rating": 5, "expected_grade": "A", "created": "2022-12-22T01:46:35.171185Z"}, {"professor": "Bei Lok Hu", "course": "PHYS371", "review": "Dr. Hu is a very difficult professor. He cares deeply about his students and wants them to succeed, but his teaching skills make it difficult for most students to do that. He is very approachable and kind and was willing to give extensions/move things around if necessary. However, his lectures consist mostly of him projecting his notes onto the board and speeding through them. Many derivations are left incomplete and topics barely explained. To succeed in his class, most students had to either entirely teach themselves or have prior experience in the topics. I would highly advise avoiding him if possible.", "rating": 2, "expected_grade": "C+", "created": "2023-01-11T15:51:58.018279Z"}], "name": "Bei Lok Hu", "slug": "hu_bei-lok"}