{"courses": ["AAST200", "AAST351", "AAST355", "AMST298C", "AMST328W", "AAST388", "AAST498W", "AAST200", "AAST351", "AAST355", "AMST298C", "AAST200", "AAST351", "AAST388", "AAST498W", "AAST201", "AAST351", "AAST388", "AAST498W", "AAST355", "AAST355", "AAST355", "AAST200", "AAST298O", "AAST351", "AAST388", "AAST200", "AAST351", "AAST388", "AAST440", "AMST298C", "AAST351", "AAST388", "AAST440", "AAST498T"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Binod Paudyal", "course": "AAST355", "review": "I personally think this professor is very good when it comes to this class. Even though he didn't had any live classes, he tries his best to entertain us by giving us certain movies to watch. While there wasn't any rough work, the given time for the exams were reasonable. Usually exams take about 2-3 hrs to finish. When it came to him, he gave us about like 4-6 hours to finish exams. I think it's due to the fact that the readings he assigned were very dense. And we basically know it's impossible to remember details for at least 8 readings a week. So this teacher is pretty good!", "rating": 5, "expected_grade": "A", "created": "2022-01-23T15:32:57Z"}, {"professor": "Binod Paudyal", "course": "AAST200", "review": "TLDR: Nice guy, likes participations, enjoys the content.\r\n\r\nPaudyal was a breath of fresh air in the life of this Cs major. \r\nHis class was chill and straightforward. He enjoys what he teaches and provides interesting insight.\r\n\r\nHis lectures are a bit boring but very informative.\r\n\r\nHe appreciates participation. \r\nHe wants discussion and encourages people to share.\r\nYou don't need to however speaking up often feels refreshing.\r\n\r\nIn terms of grading he's and straight as they come.\r\nI don't want to say easy A but he'll give you one as long as your work is relevant.", "rating": 5, "expected_grade": "A", "created": "2022-05-09T01:18:35Z"}, {"professor": "Binod Paudyal", "course": "AAST200", "review": "Truly a great person and professor overall. Let me give you the stuff you want to read:\r\n[ABOUT THE CLASS]\r\n- He gives out readings for HW. He wants you to read them, but it's not necessarily required.\r\n- Sometimes he gives videos to watch for HW. It's cool.\r\n- You have to do a presentation/mini-lecture about the topic of the day that you select. It's simple, just a slideshow going over the reading of the topic.\r\n- Exams are very simple, and as long as you take notes and pay attention to class, you should not be getting less than a B. \r\n- Final project is easy so long as one of your members is willing to carry the group, or as long as the group works as a group. PICK A GOOD GROUP, DON'T PICK LAZY PEOPLE.\r\nOverall, the class is easy. He does participation points, but so long as you say something you'll get them. At the end of almost every class, there is an in-class participation activity, which is just answering a few questions related to the class that day. Literally, just pay attention and you'll get an A. I didn't do readings, but because I took notes and listened to his lectures, I came out of my exams with only one question wrong (they're online). I'm a CS major like the person below me, so this class was 100% a breath of fresh air that gave out 2 GenEds. \r\n\r\n10/10 class.\r\n\r\n[ABOUT THE PROFESSOR]\r\nProfessor Paudyal is truly one of the best professors at this institution. Not only is he understanding and kind, but he does also care about you and the other students. He really is interested in the topic that he is teaching. \r\nWhen no one answers his questions, he doesn't wait for an answer and answers it himself (which is extremely sad, but it saves the awkwardness of no one speaking).\r\nFor our final project, we were given the chance to do a research paper or create a piece of media. I went with a Youtube documentary, but he allowed other groups to use TikTok. What other class and professor allow TikTok as a submission for a final assignment?\r\nI really wish that if you take this class, have him as your professor. He doesn't yell, is not harsh, and will not punish you for small fractures. Truly one of the best professors that make college bearable.\r\n\r\n10/10 professor.", "rating": 5, "expected_grade": "A", "created": "2022-12-08T17:36:04.464947Z"}, {"professor": "Binod Paudyal", "course": "AAST351", "review": "I took this course in Fall 2022\r\n\r\nPros:\r\n+ Extremely passionate and knowledgable about Asian American history\r\n+ Very relaxed if you miss deadlines. If you email him and politely explain your situation, he may grant you a deadline extension on minor assignments.\r\n+ There are weekly assignments, but they are short and essentially graded on completion.\r\n+ Overall, a very easy grader\r\n\r\nCons:\r\n- There are four short response assignments (500 words each), and they are definitely not spaced out over the semester properly. Two of them were due in the same month, with only a week gap between them", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T17:41:22.011267Z"}, {"professor": "Binod Paudyal", "course": "AAST498W", "review": "Professor Paudyal was actually my favorite professor and this class was the best I have taken yet. He is so knowledgeable on South Asian issues and literature and does an amazing job putting those two topics together. He's understanding about any situations that may arise and just asks of you to read, write your discussion post and participate at least once in class. He cares about his students and you can tell how excited he is to interact with you and get to know you. I could not recommend this class more, especially if you're South Asian or want to know more about South Asian history and experiences. The books were also interesting & did not feel like a chore to read.", "rating": 5, "expected_grade": "A+", "created": "2023-05-11T03:03:22.514297Z"}, {"professor": "Binod Paudyal", "course": "AAST355", "review": "Solid guy. He's pretty lenient on grading when it comes to his exams. There are also a lot of readings assigned, but it doesn't mean you have to read them. You should be watching the movies though because there are usually questions based on those. Some of the movies are good but some of them are also kind of boring and hard to watch. Since it's only three weeks it's worth to get your gened credit.", "rating": 5, "expected_grade": "A+", "created": "2023-06-18T14:29:22.521516Z"}, {"professor": "Binod Paudyal", "course": "AAST351", "review": "Very nice professor and lenient if you need extensions. I will say there is a lot of work, but it's not hard work. There are weekly dense/long readings and annotations, but I barely read them and just did the notes on a few passages (completion grade). Attendance for class is mandatory as he does take attendance and makes in class activites (usually just an exit ticket type thing). There are short response papers throughout the class and a midterm paper. The final is a group project which you can choose. I decided on the 10-12 page essay with my group and it wasn't bad. Basically, just go to class and its fine.", "rating": 5, "expected_grade": "A+", "created": "2023-12-13T18:08:33.343037Z"}, {"professor": "Binod Paudyal", "course": "AAST355", "review": "Everything already said in the other reviews, but BEST PROFESSOR YOU'LL EVER HAVE!!!!!!!! TRUST!!!!!!!!!!", "rating": 5, "expected_grade": "A+", "created": "2024-03-14T04:05:56.936626Z"}], "name": "Binod Paudyal", "slug": "paudyal"}