{"courses": ["EDCP682", "PSYC234", "PSYC234", "PSYC234", "PSYC234", "PSYC234", "PSYC234", "PSYC234", "PSYC234"], "average_rating": 4.9333, "type": "professor", "reviews": [{"professor": "Carole Sebenick", "course": "PSYC234", "review": "She is literally the nicest human being in the entire world. She cares so much about mental health and her students individually (which is what a teacher should do). This course is also really easy and super interesting! We have reflection papers and 3 quizzes that were online and had a final project rather than a final test. I literally can't recommend this class enough! Please take it!", "rating": 5, "expected_grade": "A", "created": "2021-12-16T23:55:29Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Professor Sebenick was a great professor. Her lectures were very engaging and overall the topic of the class is very interesting. She showed multiple times that she really cares for her students and their well-being. I highly recommend taking this course!", "rating": 5, "expected_grade": "A", "created": "2022-01-18T18:16:43Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "One of the best and most understanding teachers! She was clearly very interested in the class and has a wonderful teaching style! ", "rating": 5, "expected_grade": "A+", "created": "2022-01-19T16:39:12Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Love love love this woman. Cares about her students, genuinely kind, willing to talk about stuff, super open-minded, makes content interesting. I recommend this class to everybody I know", "rating": 5, "expected_grade": "A+", "created": "2022-05-12T00:43:05Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Super accommodating, and the nicest woman you'll ever meet. She comes in every day with a smile and ready to teach. The lectures can get a little boring at times, since it's just slideshows, but she posts them anyways in case you miss something. No final, just a group project. As long as you do all the work, you will get an A.", "rating": 5, "expected_grade": "A+", "created": "2022-12-10T22:52:39.306479Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "This professor wants to make the class unstressful and there's barely any homework. Her quizzes are kind of tough, but she offers so much extra credit that I ended up with over 100 before the last quiz. Definitely recommend.", "rating": 5, "expected_grade": "A", "created": "2022-12-16T05:42:16.654702Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "So sweet and genuinely wants to see all of her students succeed. The course material was easy & interesting to learn. You have a couple of quizzes, a happiness workbook to fill out throughout the semester, discussions, and one group project. Not a huge time commitment at all and there's no final.", "rating": 5, "expected_grade": "A", "created": "2022-12-19T22:02:51.702911Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Ended the course with above 100% because of the sheer amount of extra credit she gives. She's extremely nice and understanding and always smiling! The quizzes were all online and we could do them in our own time (the last one was even open-note). The group project was the bulk of the work here, but even as someone who doesn't like to work with groups, I can tell you that it was not bad at all. She gives plenty of class time for us to work on it, so our group managed to get the majority of the planning done during class, and we only had to meet once in our own time. It was basically just a PowerPoint presentation, where the group members split the work on, and it was presented via recording a Zoom call which we were all on, and the video was later played in class. Overall, it's a really chill class. Take this if you want an easy gen. ed. or GPA booster!", "rating": 5, "expected_grade": "A+", "created": "2022-12-20T21:58:14.536182Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "easy and enjoyable class but the group project is questionable and seemed disconnected and unorganized from the normal content of the class/quizzes", "rating": 4, "expected_grade": "A+", "created": "2023-01-05T17:16:26.851977Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Easy, interesting course. She is very kind and accommodating to anything you may have going on. All the assignments are fairly straightforward, the last assignment is a group presentation which can feel unorganized depending on your group-mates but during the summer (like-me) it should be simple.", "rating": 5, "expected_grade": "A", "created": "2023-08-13T13:37:51.619908Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "I took this as a summer course. Dr. Sebenick is super kind and understanding and you can definitely tell she cares a lot about her students. The course content was super interesting and applicable to daily life. The structure consisted of a weekly discussion board, the happiness strategies workbook with activities each week, a reflection paper and the final group project which we worked on throughout the summer session. The final project wasn't bad and was actually quite interesting to work on. Overall I'd recommend anyone to take this course with Dr. Sebenick!", "rating": 5, "expected_grade": "A+", "created": "2023-08-23T11:46:43.172497Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Good course, good professor. No complaints. Quizzes and exams were light and because they are open note not at all stressful. There are weekly quizzes but again they are not hard. The course content is interesting. Although this isn't even remotely related to my major, and I was just taking this as a gen ed, I'm very glad I chose this course because I was genuinely interested in the content. The main part of the course is the writing assignments, which comes out to a total of about ~7 pages of essays over the course of the semester (not bad at all).", "rating": 5, "expected_grade": "A-", "created": "2023-12-10T17:28:03.084029Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Very kind and obviously cares about her students. The class itself is pretty easy and the content is interesting even if you're not a psychology major. There is an overarching project throughout the school year where you have to research happiness for a specific population. Make sure to not choose an obscure or overly specific population because you will have a VERY hard time trying to find people to interview/research articles relating to the population. She gives a decent amount of class time to do the project though, so it's not terribly difficult. Overall, very chill class and professor.", "rating": 5, "expected_grade": "A+", "created": "2023-12-13T19:59:43.567026Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Very little effort required. Weekly quizzes and exam are super easy. I never had to study. The projects aren't too bad either. She really cares about the subject and her students. I'd recommend her to everyone. Best gen ed.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T19:09:25.305062Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "She truly cares about her students and is very understanding! The content is super interesting. \r\n\r\nWeekly quizzes on one or two chapters in the textbook (I just skimmed through the chapter). Each chapter was about 15 to 40ish pages. If you attend the lectures you'll get the same information from the textbook as a helpful review. She embeds a fair amount of extra credit opportunities, so you almost have a guaranteed A if you do all the work! \r\n\r\nThe only thing I didn't like was the happiness project, ONLY because my group didn't do their fair part. Otherwise, chill class.", "rating": 5, "expected_grade": "A+", "created": "2024-01-13T19:03:35.331806Z"}], "name": "Carole Sebenick", "slug": "sebenick"}