{"courses": ["PHYS273", "PHYS410", "PHYS375", "PHYS405", "PHYS273H", "PHYS748", "PHYS407", "PHYS165", "PHYS407", "PHYS407", "PHYS165", "PHYS407", "PHYS748", "PHYS407", "PHYS406", "PHYS265", "PHYS406", "PHYS407", "PHYS748", "PHYS406", "PHYS407"], "average_rating": 4.3, "type": "professor", "reviews": [{"professor": "Carter Hall", "course": "PHYS410", "review": "Dr. Hall is a fantastic teacher.  Everything is clear, concise, and on point with what you need to know.  He keeps all his lectures and notes in a logical order and there's hardly confusion when reviewing over them again.  Homeworks are from the textbook and are generally not too terribly difficult.  Exams (take-home this semester) were tough, but doable.  He's a bit of an android in terms of emotions or humor, but it's hilarious when he does joke.  This is my second semester with him (previously PHYS 273) and I'd, without a doubt, take another class with him.", "rating": 5, "expected_grade": "A-", "created": "2014-05-11T18:23:00Z"}, {"professor": "Carter Hall", "course": "PHYS273", "review": "This guys is the most excellent professor I've ever met. Super smart + humble = clearly covers concepts and wants students to learn the stuff. Homeworks were somewhat challenging but the test were recast/simplified homework questions! Ahhh, why aren't all my professors like him?!?", "rating": 5, "expected_grade": "", "created": "2013-05-13T21:45:00Z"}, {"professor": "Carter Hall", "course": "PHYS273", "review": "The textbook for this class has a one star rating on Amazon, so I didn't get it. But it was okay because he posts his notes on his website, and they cover literally everything he goes over in class. Technically, you don't even have to take notes!\n\r\nHe lectures very clearly and effectively and definitely wants the students to do well. The class is called waves, but he describes the class as a pre-quantum mechanics, mathematical methods class. Thus, as a math major, I already knew a lot of the stuff he taught and thought he taught the beginning of the semester rather slowly. Other students didn't seem to have this problem though.\n\r\nThe exams are easy and straightforward (he provides equation sheets). For the second exam, I only studied for about an hour (I had a lot of other exams that week), finished it early, and only lost two points. They test concepts rather than little details, so if you go to every class and pay attention, you'll do fine. Homework is also fairly easy, maybe 3 hours a week.\n\r\nAnother tidbit: my friend took this class with a different professor two semesters ago, and it was extremely difficult. He worked really hard, but ended up with a B. This shows how much this class can vary with different professors.", "rating": 5, "expected_grade": "A", "created": "2012-12-23T18:39:00Z"}, {"professor": "Carter Hall", "course": null, "review": "Unlike a lot of other teachers, Hall does actually seem like he wants students to do well. He is one of the first physics teachers I've had who actually posted notes online and his tests are quite easy (so far). However his homework, which he writes, can be convoluted. For example he often says \"solve the system\" without saying for what to solve. So for some homework I'll spend more time reading it than actually solving it. But unless the rest of the class goes much worse, Hall seems to actually want students to get A's and B's. However, I think he makes it very clear that he doesn't actually like teaching. When I ran into him after the semester he obviously did not remember that he had taught me in a class of 20 nor did he even seem like he wanted to talk about his research or congratulate me on doing my own research.", "rating": 3, "expected_grade": "B", "created": "2012-12-18T04:59:00Z"}, {"professor": "Carter Hall", "course": "PHYS401", "review": "This professor is a no-nonsense professor. His notes just get straight to the point. His notes are also very clear and excellent. His tests are no-nonsense. They are similar to the homework problems, and his final exam just re-used questions from old homeworks and midterms. He is not out there to try to get you or screw you over. He is just straightforward. If you study, you'll do well; that simple. No strings attached. His assignments are simple, and are much more testing of concept, and not just mathematics. An excellent physics professor indeed.  I dont think he'll teach PHYS401 a year from now ... which is unfortunate for many (as the PHYS dept. does 3 - year cycles). Good luck to those who have not had this guy for 401. ", "rating": 5, "expected_grade": "B-", "created": "2011-12-26T01:44:00Z"}, {"professor": "Carter Hall", "course": "PHYS401", "review": "I've had Dr Hall twice now. I liked him the first time (phys272) and I loved him the second tie (phys401). He's a good lecturer. His notes were very well organized, which is something I find extremely helpful in understanding the material. He also would use the discussion time to go over the answers to the homework, which was amazingly helpful. The tests for 401 were take home, which made it more about what you actually understand and less about what you can remember in an hour.\r\nHe has definitely been my favorite physics professor.", "rating": 5, "expected_grade": "", "created": "2010-11-09T12:50:00Z"}, {"professor": "Carter Hall", "course": "PHYS272", "review": "Excellent professor. Comes prepared for the lectures and the recitation sections are actually useful to go to, since the exam questions are very similar. You finish the course knowing the material, and the exams are usually very straightforward, since they test the concepts. ", "rating": 5, "expected_grade": "A", "created": "2008-12-18T13:47:00Z"}, {"professor": "Carter Hall", "course": "PHYS272", "review": "He is a very good and patient prof. answers all your questions in class and will make time to meet you outside of class if you want. \n\r\nhomework is a bit long, but easy enough that you can do it without going to lecture.\n\r\nhis tests are very straightforward. no calculators, or notes. he will provide an equation sheet which isn't' that help full... but if  you know the material you will do fine. cause all the questions ask about concepts and rarely about little details. the only bad thing is that they are always out of 20-30 points, so you better get everything right....", "rating": 4, "expected_grade": "A", "created": "2008-05-02T14:15:00Z"}, {"professor": "Carter Hall", "course": "PHYS165", "review": "Dr. Hall is a fantastic professor. No matter the course, (for me, PHYS165), he provides clear and concise information that is directly relevant to assignments. The programming itself was not super difficult but not incredibly easy either. You will learn in his courses and I would recommend him to anyone.", "rating": 5, "expected_grade": "A-", "created": "2023-06-12T22:08:53.818594Z"}, {"professor": "Carter Hall", "course": "PHYS165", "review": "Professor Hall does not know python. He often says that it's impossible to do something that is actually possible to do. Wait to take this class in the fall semester with Sullivan if at all possible. \r\n\r\nHall is also bad at working with ADS accommodations, asks for extra documentation (which is not allowed), and is dismissive in general of students.", "rating": 1, "expected_grade": "A+", "created": "2023-11-02T21:04:08.217738Z"}], "name": "Carter Hall", "slug": "hall_carter"}