{"courses": ["INAG110", "EXST030", "HLTH672", "HLTH710", "INAG253", "INAG110", "INAG110", "INAG110", "INAG110", "INAG110", "INAG110", "INAG110"], "average_rating": 4.5357, "type": "professor", "reviews": [{"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Professor Mays-Williams is great. For one, she don't want you to fail the class. She tells you the first day of class what you need to do to get an A. She's very fair while grading the speeches and if you ask her she'll explain how you can improve.\r\nShe loves, loves, loves participation in class. I think it makes a bit sad when we don't participate. She keeps the class interesting with little games sometimes. I really don't like public speaking but prof mays makes the class bearable.\r\nAll in all, i'll advice everyone to take her class.", "rating": 5, "expected_grade": "", "created": "2019-11-26T16:36:05Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "The class is easy, but she is not really a good teacher. She is extremely vague on assignment details/due dates and often contradicts herself. It also seems like she constantly just pulls assignments out of her ass, as a lot of them are assigned last minute and don't make much sense. That being said, it is still easy to get an A, especially if you know how to b.s. for those stupid assignments or when she calls on you in class discussion.", "rating": 2, "expected_grade": "A", "created": "2020-04-05T17:47:53Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "To her credit, Prof. Mays-Williams is very kind and seems very knowledgeable about the content of the textbook she teaches. However, to put it simply, she is not good at teaching. She often gives incredibly vague instructions for assignments, and when asked to clarify, either gives a more confusing answer or contradicts herself. Also, she very clearly pulls assignment ideas out of thin air, which results in a lot of our assignments being not well thought out and therefore tough to complete properly. That being said, if you're willing to just keep your head down and power through the confusion, it's not very difficult to get a good grade.", "rating": 1, "expected_grade": "A", "created": "2020-05-07T23:46:58Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Mays-Williams is such a caring and nice professor and really fun to talk to! Her assignments can be a little confusing but she's an easy grader. ", "rating": 5, "expected_grade": "", "created": "2020-09-03T01:51:50Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "The other reviews are right in saying that Mays-Williams has pretty confusing assignments/instructions sometimes but our discussions in class are always interesting and she's an easy grader. I'd advise you to take this class if you're willing to power through the confusion of the assignments and she's a really understanding and nice person! ", "rating": 4, "expected_grade": "", "created": "2020-10-06T22:57:34Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "She is not a very effective teacher in that, because of COVID, we didn't have any lectures and she didn't do a great job explaining assignments before they were due. I got most of my answers from the class groupme instead of from the Professor, which is not great, but it is also not a very hands on class.\r\nI took this class with her because the grading distribution was good and I thought I could just get an easy A for my GenEd. That's exactly what happened. The discussions are definitely interesting, but she was not too involved in them except asking a few questions. There are only a few assignments, she is an easy grader, and generally it is not hard to get a good grade in the class with a medium amount of effort. I'd recommend for anyone looking to knock out their oral comm credit ", "rating": 3, "expected_grade": "A", "created": "2020-12-20T04:25:45Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Very relatable and nice professor that gives an expected workload. She sometimes has miscommunications about assignment due dates and grading, but aside from that, I would recommend her for INAG110.", "rating": 4, "expected_grade": "", "created": "2020-12-27T19:19:42Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Very relatable professor. We asked her to clarify instructions for certain assignments and she gladly explained everything to us in class. Once she realized that instructions were unclear for several assignments, she began going over all assignments that were due. She also created a weekly assignments announcement at our request. As for the class itself, it's not too difficult, especially since Mays-Williams is an easy grader. The only issue I had was that the first 3 weeks had an insane amount of work for me to do. It dies down after a while, but I spend those first few weeks only doing work for this class. ", "rating": 5, "expected_grade": "A", "created": "2022-01-02T00:24:06Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "She made a super stressful class enjoyable for me! I agree that some of the assignments can be confusing, but she will clarify in class if there are any questions. She gets to know her students and doesn't give an insane amount of work. Weekly reading quizzes and group discussions. She provides helpful feedback and allows us to pick speech topics that are actually interesting. I definitely recommend her!", "rating": 5, "expected_grade": "A", "created": "2022-02-04T17:35:53Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Great teacher, made a class I was stressed about doing enjoyable. She's a very nice person and very responsive to emails. The class could be unorganized at times but other than that it was fine. I would 100% recommend her in your plan on taking an Oral Comm class. ", "rating": 5, "expected_grade": "A", "created": "2022-05-16T20:18:35Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "At the beginning of the term, nobody understood what the assignments meant, but she clarified them and we all eventually figured it out. Mays-Williams would have class in Hornbake Plaza if the weather allowed. She is nice enough, and very forgiving with issues. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-20T21:22:10Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Honestly I was not looking forward to this class and I went in super stressed about giving speeches, but I absolutely loved my experience in their class. They grade very leniently; coming from someone who is not a good public speaker and definitely messed up a lot in my speeches, I got either 100 or a point or two off on all major speeches in the class. The workload is super manageable, and although the first few weeks are filled with assignments, after that there's nothing except practicing for speeches. They're also very kind and understanding of any problems, and I genuinely enjoyed coming to class. If you're also someone who hates public speaking and has bad anxiety, take your oral communications credit with Mays-Williams.", "rating": 5, "expected_grade": "A+", "created": "2022-11-10T22:36:18.040109Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Coming into this class being a public-speaking hater, I was not excited to give speeches. But her class environment was very comfortable, and the grading was very lenient. Would definitely recommend her if you have speech anxiety.", "rating": 5, "expected_grade": "A+", "created": "2022-11-26T05:53:06.492602Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "I was very stressed about this class but the environment that they created made it not only easy, but fun as well. The grading was very lenient and they are very understanding about stage fright and never deduct points because of it. Additionally, the workload is very manageable and they are willing to adjust to each individuals persons/the classes needs.", "rating": 5, "expected_grade": "A", "created": "2022-12-13T23:22:27.858196Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "They do an amazing job making the course engaging, fun, and light. The coursework is generally easy and the final/midterm do not have much weightage. Highly reccomend them if you're looking to take this course.", "rating": 5, "expected_grade": "A", "created": "2022-12-14T13:36:59.555966Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "honestly shes so chill and acts like a friend in a good way! my tip is do well on your speeches! if your speeches are a high grade you can fail the final and midterm and still end up with a B or low! Not a class you need to go every time but I would say easiest gen-ed ever, I got ended with a 82% which is pretty good bc i did not try with my speeches but if i did try i bet i wouldve ended up with an A. Also make sure to make friends in the class bc the first week there's like a small group project (leading a discussion)", "rating": 4, "expected_grade": "B", "created": "2022-12-16T16:37:20.398425Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "honestly shes so chill and acts like a friend in a good way! my tip is do well on your speeches! if your speeches are a high grade you can fail the final and midterm and still end up with a B or low! Not a class you need to go every time but I would say easiest gen-ed ever, I got ended with a 82% which is pretty good bc i did not try with my speeches but if i did try i bet i wouldve ended up with an A. Also make sure to make friends in the class bc the first week there's like a small group project (leading a discussion)", "rating": 4, "expected_grade": "B", "created": "2022-12-16T16:37:20.426960Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "My favorite professor by far. They create such a welcoming and entertaining environment. The class work is extremely light. They are the kind of professor that wants you do to well, so there are a lot of extra credit opportunities and they are a lenient grader. The class itself was very rewarding. We had amazing discussions and the speeches were so entertaining, to do and to watch. Professor Mays-Williams is honestly just a pure, fun soul whom fosters great relationships with their students. If I could, I take more classes with them.", "rating": 5, "expected_grade": "A+", "created": "2022-12-17T16:18:41.496912Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "I'm very glad I chose them as a professor. I was not looking forward to public speaking, but Mays-Williams created a comfortable environment for every student to succeed. I could tell that they made an effort to get to know each student. The grading was also lenient in my opinion. I gave speeches that I personally thought were bad, but I would only get a few points off, never to the point where it significantly impacted my grade. The midterm/final were just multiple choice questions that were easy to answer if you just paid attention during the in-class lectures and reviewed vocab a bit. Would totally recommend Mays-Williams for this class.", "rating": 5, "expected_grade": "A", "created": "2022-12-21T04:55:56.715131Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Very nice, personable teacher with super generous grading policies. Would 100% recommend taking INAG110 with her, or any other courses she offers as well.", "rating": 5, "expected_grade": "A", "created": "2022-12-24T14:13:27.809825Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Super chill professor - Prof Mays may come off a little disinterested/stoic at first, but once she opens up, she's such a funny and lovely soul. She is very accommodating towards students and I can't stress that enough. If there is something going on, just go talk to her and she will make things work. Class workload was manageable - you have 4 speeches, 1 midterm and 1 final. Public presenting is difficult but she makes the small class environment a warm and welcoming one so you won't ever feel embarrassed to go up there.", "rating": 5, "expected_grade": "A+", "created": "2023-01-08T17:03:55.477846Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "simply put, an amazing professor AND mentor", "rating": 5, "expected_grade": "A+", "created": "2023-05-11T19:38:29.785055Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Mays-Williams is a great person and professor. She is very understanding and wants everyone to do well.", "rating": 5, "expected_grade": "A+", "created": "2023-05-13T15:30:34.139669Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Great professor, very generous and understanding when it comes to due dates. Very funny and takes her teaching serious without being harsh. Definitely would recommend.", "rating": 5, "expected_grade": "A", "created": "2023-06-28T20:50:59.351865Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Amazing prof, she made class enjoyable and made me want to wake up for the 9am class with no hesitation. She doesn't take attendance minus for the one week of the last set of speeches for audience credit. As long as you fulfill the speech requirements, she's giving you a 100% on everything. The quizzes are really easy (and two tries), just command+f the online textbook. Impromptu speeches are completion so don't stress about them. I went in reluctant about a comm gen ed but she made me so much more of a confident speaker - especially for longer durations and I loved that we could choose our own topics. BTW she loves pumpkins. Participate because class is only fun that way and when you participate, others usually follow and the students can lowkey make or break the experience (my class had very engaged students and she even said we were her fav class because we were actually engaged and participated, she def reciprocates the energy we give her). I recommend her to anyone needing to take INAG", "rating": 5, "expected_grade": "A+", "created": "2023-11-30T04:12:08.135749Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Great professor, understands that this is an easy class that most students are taking to cover their comm credit. Doesn't grade harshly, even if you don't like public speaking, very accommodating and offers extra credit, both assignments and for participation. We had three speeches, with a few more really minor ones, and our \"final\" was a simple creative project, but we got to vote for it, so might be different in other classes. Additionally, Prof. Mays-Williams is really kind and friendly, loved her as a person. Plus, class size was small (15-20 students), so overall chill, friendly atmosphere, and made speeches much less nervewracking in front of a small audience. Would definitely recommend!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-13T03:07:07.776960Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Great person all around.  If you meet all of the requirements for your speech, she will give you full points.  Any comms class will push you out of your comfort zone if you're not accustomed to public speaking, but she makes it doable for her students.  Her class has a very light workload.  There are 4 total speeches, ranging in time requirements from 1.5-10 minutes, a handful of open-book take-home quizzes (free points), small assignments here and there, and a few extra credit assignments.  My class had no midterm and a final assignment.  In all, Prof. Mays-Williams is such a kind, understanding, and intelligent professor that will make your comms class a breeze :)", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T02:08:33.915471Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Course: Course was public speaking with other assignments focusing more on interactions with others and inclusivity. Quizzes you can CTRL F the textbook pages. Speeches progressively get longer as the year goes on. I finished with a 100.04%\r\nBreakdown:\r\n- Speeches (4), 60%, these go Introductory, Informative, Persuasive, and Professional. The times go from 1-2 minutes, 4-5 minutes, 6-8 minutes, 8-10 minutes, respectively. It sounds intimidating but if you choose a topic you are actually interested in, it goes by pretty fast. The last two have visual aid slideshows. These get easier as you have more practice, and as long as you prepare well, then you should be fine.\r\n- Assignments (11), 35%, these include chapter quizzes, speech reflections, and impromptu speeches. Chapter quizzes are pretty easy as long as you can find it in the textbook, speech reflections should take no longer than 15 minutes to complete, and impromptu speeches are kind of like pop up speeches on the fly, but are really easy. Just talk about something that you like about for 1 ½ - 2 minutes and you will get points.\r\n- Final, 5%, this is really easy. You get to vote as a class as to what you want your final assignment to be, and ours was to create an advertisement. I finished it in 20 minutes virtually asynchronous and got 100%.\r\n\r\nProfessor: SHE IS THE BEST! She is very understanding of the fact that public speaking is a hard skill and a very big fear of many people, and makes the class a very warm and welcoming environment. She WANTS all of her students to end with an A+, and those who came to class and put in minimal effort ended up with an A. She is super nice, cares about every single person, and she felt more like a very knowledgeable friend rather than my professor. I would recommend anyone to take her for a communications class, if they’re ok with earlier classes (class starts anywhere from 8:00 - 10:30 AM). If there is only 8 am left, take it, it's worth it!", "rating": 5, "expected_grade": "A+", "created": "2023-12-26T16:53:00.876550Z"}], "name": "Chelsea Mays-Williams", "slug": "mays-williams"}