{"courses": ["FIRE198", "FIRE298", "FIRE120", "FIRE398", "FIRE398", "FIRE120", "FIRE298", "FIRE398", "GERM103", "FIRE198", "FIRE398", "FIRE199", "BSCI223", "FIRE199", "FIRE120", "FIRE298", "FIRE398", "BSCI223", "BSCI223", "FIRE198", "FIRE398", "BSCI223", "FIRE120", "FIRE298", "FIRE398"], "average_rating": 3.5, "type": "professor", "reviews": [{"professor": "Cherisse Hall", "course": "FIRE120", "review": "Professor Hall is a pretty good teacher and is open to further explaining topics outside of class if you are confused. She seems a bit rude at first but overall she is a nice professor to have. The workload is light and you have plenty of time to complete projects and other assignments.", "rating": 5, "expected_grade": "A+", "created": "2021-01-24T20:03:37Z"}, {"professor": "Cherisse Hall", "course": "FIRE120", "review": "Do not recommend taking her for FIRE120. Harsh grader", "rating": 1, "expected_grade": "A-", "created": "2022-12-05T23:05:51.356370Z"}, {"professor": "Cherisse Hall", "course": "FIRE120", "review": "Professor Hall provides really good feedback  on our team work that helps to improve our final work due later in the semester.", "rating": 5, "expected_grade": "A+", "created": "2023-01-03T19:04:08.602677Z"}, {"professor": "Cherisse Hall", "course": "FIRE198", "review": "Nice Person and decently helpful when in lab. However, she waited until the end of the semester to grade most of the assignments in class, including our final lab report which significantly lowered my grade. In general the stream is what you make of it, but Dr. Hall, despite being a very nice person, is a terrible grader.", "rating": 3, "expected_grade": "A-", "created": "2023-09-03T18:36:08.074533Z"}, {"professor": "Cherisse Hall", "course": "FIRE120", "review": "This course should be an easy A+ just by submitting weekly assignments on time and going to class. Very few assignments are actually graded on the quality of your work, but make sure you take the time to read over your assignments before submitting regardless. A lot depends on the group you are placed into towards the middle of the semester, but just check other people's work if you are worried about them lowering your grade.", "rating": 5, "expected_grade": "A+", "created": "2024-01-13T19:56:09.511579Z"}, {"professor": "Cherisse Hall", "course": "FIRE198", "review": "I'm leaving this review here since I'm in the FIRE stream that Dr. Hall runs, Bacterial Pathogenesis. However, she was away on maternity leave for most of the semester when I took this class. In her absence, the lecture part of this class was taught by Dr. Weiner and Dr. Zeidan. But the lab is way more important than lecture, so it shouldn't matter that much.\r\n\r\nThis class is not hard at all, but it is deceivingly time consuming. When you sign up for this class on Testudo, you only see a 1-hour lecture once a week. What they don't tell you is that you're required to a spend an extra 3-5 hours a week in the lab. That means that in terms of time commitment, this class is at least as much as an entire lab session. Some weeks, it might end up being like two whole 3-hour labs! You have to plan to go to the lab whenever its open, but you aren't told the hours until 2 weeks into class. So if your schedule and the lab's schedule don't fit together, you're in trouble. If you're taking a lot of credits, or you're taking a hard class where you have to do lots of studying on your own time, you will struggle to get stuff done because of how much time this class eats up.", "rating": 2, "expected_grade": "A-", "created": "2024-03-31T20:33:50.952195Z"}], "name": "Cherisse Hall", "slug": "hall_cherisse"}