{"courses": ["ENGL310", "ENGL395", "ENGL393H", "ENGL479D", "ENGL375", "ENGL377", "ENGL404", "ENGL391", "ENGL297", "ENGL212", "ENGL301", "ENGL393H", "ENGL391", "ENGL393H", "ENGL391", "ENGL391", "ENGL391", "ENGL391", "ENGL391", "ENGL243", "ENGL402", "ENGL391", "ENGL391"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Christopher Crane", "course": "ENGL377", "review": "Fantastic teacher. Here's just five (and a bit) reasons why:\r\n1) Great availability outside of class, with availability over email, Skype, phone call, etc. (So important for a class with a heavy workload like ENGL377!)\r\n2) Wants his students to know and understand all course material. 3) His enthusiasm makes more \"boring\" material like Beowulf fun, interesting, and relevant, which is pretty hard to do IMO.\r\n4) Creates highly productive and engaging in-class discussion that isn't high brow or exclusionary.\r\n5) Provides constructive and nuanced commentary on assignments\r\n\r\n**Also allowed our class very cool extra credit opportunities!", "rating": 5, "expected_grade": "A", "created": "2019-12-20T21:54:17Z"}, {"professor": "Christopher Crane", "course": "ENGL377", "review": "Great professor who knows his stuff upside down and inside out. He is very passionate about English and Tolkien in particular, which is clear in the high quality of both his in-class/online discussions and assignment feedback. A very pleasant and approachable professor. Great class, was definitely worth the hard work! Read, write good notes, and ask questions and you'll succeed.", "rating": 5, "expected_grade": "A", "created": "2020-01-03T22:44:03Z"}, {"professor": "Christopher Crane", "course": "ENGL479D", "review": "Dr Crane is amazing!!! he is very flexible with assignments and lets you turn things in late, lets you revise papers, and overall creates a lovely atmosphere for learning. He genuinely wants his students to learn and isn't as focused on tests and things like that. I genuinely think he is one of the best professors I've had so far. not to mention his personality is great as well. he also brought us breakfast on exam day! highly recommend.", "rating": 5, "expected_grade": "A", "created": "2024-01-18T23:03:58.342453Z"}], "name": "Christopher Crane", "slug": "crane_christopher"}