{"courses": ["AMST289A", "LGBT448C", "AMST629O", "LGBT488Q", "AMST629M", "LGBT488A", "AMST878A", "ARHU158F", "LGBT488B", "AMST498V", "AMST629C", "AMST878", "AMST878B", "AMST878C", "AMST628T", "AMST450", "LGBT488C", "AMST601", "AMST101", "AMST628F", "AMST603", "LGBT488D", "AMST602", "AMST629L", "WMST698L", "AMST101", "AMST498V", "LGBT448C", "AMST101", "AMST628F", "AMST628P", "AMST628P", "WGSS698P", "AMST101"], "average_rating": 4.6667, "type": "professor", "reviews": [{"professor": "Christina Hanhardt", "course": null, "review": "Christina was a great professor and the TA's were awesome as well. The class, I realized, didn't interest me that much, but somehow their teaching ability made it more than bearable and quite interesting. Very fair grader on the assignments. \n\r\nCan't get much better than this for a class I took just to fulfill two CORE requirements at once", "rating": 5, "expected_grade": "A", "created": "2012-07-18T13:19:00Z"}, {"professor": "Christina Hanhardt", "course": "LGBT448C", "review": "I wish all of my classes were like this. Although we had a substantial amount of reading, Christina kept class stimulating, entertaining, and engaging. It was such a comfortable learning atmosphere, and she's so great at explaining things you have questions about. You could constantly hear laughter coming out of our classroom, yet the class really opened my eyes up to a lot of LGBT issues. Highly recommended. ", "rating": 5, "expected_grade": "", "created": "2008-12-09T03:37:00Z"}, {"professor": "Christina Hanhardt", "course": "AMST101", "review": "Professor Hanhardt made it very easy to succeed in AMST101. I could tell that she cared a lot about our learning along with our two TAs. Grading was very lenient and it is very easy to get an A. Participation in lecture (attendance) and discussion is a grade but all you have to do is show up for class and participate a few times in discussion to get an A. There were readings and/or videos along with a response paper due every week. The readings and videos sometimes took a few hours to read or watch which was kind of annoying. The response papers were 300-500 words but they aren't formal and they aren't individually graded (there's a overall response paper grade which you get at the end of the semester). They were also posted to a discussion page so everyone in your class could view your responses, which in my opinion, made it hard to get really personal with the topics because I didn't want my peers to read some of my responses that would be very personal to me. I would say that my biggest concern taking this class is the lack of grades. The first grade was the midterm grade which came a few weeks after it was due, so it was hard to know how you were doing grade-wise in the class until the very end. My TA facilitated great discussion which enhanced my learning on the topic, and the ~7 guest lecturers throughout the semester were engaging and great to listen to. Overall, Professor Hanhardt is a great professor and I would recommend AMST101 for a Gen-ed requirement.", "rating": 5, "expected_grade": "A+", "created": "2022-12-24T00:59:06.009423Z"}, {"professor": "Christina Hanhardt", "course": "AMST101", "review": "Dr. Hanhardt asks really interesting questions for in class discussions. She also makes lectures really open-ended and up to interpretation which I find is super helpful with this class and the content. The response papers required are super simple and easy points if you show you read the reading and input your own ideas into them. She's also really good with flexibility due to illness or and personal issues. The class itself is kind of lacking, but Dr. Hanhardt is really good at creating thinking points and discussion topics. I also found the readings sometimes quite interesting and there is plenty of variety for everyone.", "rating": 5, "expected_grade": "A+", "created": "2023-11-27T17:02:51.104520Z"}, {"professor": "Christina Hanhardt", "course": "AMST101", "review": "Dr. Hanhardt is an amazing professor. I had her in my first semester of college (Fall 2022). She is a great lecturer and is very passionate about American history, specifically LGBTQ+ American history. If you are LGBTQ+ or anyone I would 100% recommend taking AMST101 for a general education requirement. Dr. Handhardt is also hilarious and makes class fun. The content in the class is good as well. She is also very personable I met with her over a year later to catch up. Fun Fact: She has been arrested for protesting.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T19:50:31.345908Z"}, {"professor": "Christina Hanhardt", "course": "AMST101", "review": "If you are reading this and considering taking AMST101 with Dr. Hanhardt, I need to emphasize to you that the bulk of this class is talking about different marginalized groups and I probably wouldn't have taken this class if I knew what it would be about. If you want an easy A, this class is fine, but you kind of have to write what you think the TAs want to hear which gets annoying after the 11th weekly response paper. Hanhardt is a really chill person, so I was able to spend 80% of class time doing random stuff on my laptop. The class is fine, I just want to make sure you know if you are considering taking this class that it is way closer to an LGBT or feminist studies course than an actual history/mainstream American culture course.", "rating": 3, "expected_grade": "A", "created": "2023-12-21T04:11:54.547452Z"}], "name": "Christina Hanhardt", "slug": "hanhardt"}