{"courses": ["HIST213", "HIST639L", "HIST408I", "HIST289N", "HIST628", "HIST619K", "AMST628W", "WMST298L", "SPHL601", "SPHL602", "SPHL603", "HIST428W", "HIST819G", "WGSS298L", "HIST639K", "WGSS298N", "HIST210", "HIST213", "HIST608A", "WGSS298L", "HIST289N", "HIST396", "WGSS298N", "HIST619L", "HIST395", "HIST289N", "WGSS298N", "HIST289N", "HIST395", "WGSS298N"], "average_rating": 3.5455, "type": "professor", "reviews": [{"professor": "Clare Lyons", "course": null, "review": "this class is just a core and there should definitely not be a lot of work or readings necessary. she puts her outlines and lectures based off of it but does not go in order. her midterm and final exam consists of IDs. should be easy but she should at least explain all the words. sometimes she would not finish the lecture and does not pick up off there. also depends on your ta... this class is only worth it if the ta is easy on you. ", "rating": 4, "expected_grade": "A", "created": "2011-12-07T19:31:00Z"}, {"professor": "Clare Lyons", "course": "HIST213", "review": "I took this class online over the summer and found it to be somewhat interesting. The online lectures are tedious to listen to and some of the readings are lengthy, but if you do a moderate amount of work you'll do well. Be forewarned that there is a 3, 4, or 5 page paper due everyweek for the online class.", "rating": 4, "expected_grade": "A", "created": "2010-11-23T16:08:00Z"}, {"professor": "Clare Lyons", "course": "HIST213", "review": "HIST213 was one of the most interesting classes I've ever taken. She was a great lecturer and was always well-prepared for class with an outline, primary documents, and interesting movies. \n\r\nShe definitely expects a lot from her students--there was tons of reading every week. As long as you keep up with the reading, you should easily pull off an A in the class. \n\r\nThis is also not a class where you can expect to skip lecture and just do the readings on your own. I missed lecture once and missed a huge chunk of information. Thankfully, the midterm and final consist of 6-8 identifications (basically stating why the topic is important to the history of sexuality) and a paper that is 70% of the midterm. She puts 10 key terms on the tests, but you only need to know 6, but don't make skipping lecture a habit.", "rating": 5, "expected_grade": "A", "created": "2010-05-21T16:50:00Z"}, {"professor": "Clare Lyons", "course": null, "review": "The professor is very knowledgable in the subject, but the class is EXTREMELY boring.  I took this class because I dropped another class and needed something to fill my schedule.  I would not take this again if I had the option.  The topic is so boring I pretty much stopped going to lecture half way through because I couldn't stand it, although going to lecture is kind of important because she doesn't post her outlines online.  There was a lot of reading each week, often dealing with obsure, bland topics such as the treatment of black laudry women in atlanta after the civil war.  The paper you have to write is also extremely boring and you have to write it on the book she wrote.  Overall the material is easy to grasp (the answer to every question in this class is prostitution)but there was way to much pointless busy work, I felt like I was in high school again. ", "rating": 3, "expected_grade": "A", "created": "2009-01-21T11:02:00Z"}, {"professor": "Clare Lyons", "course": null, "review": "Really Really Easy Class Why? Because You Have A Month To Write A Paper In Which In Mine I Just Added Half The Paper With Footnotes SoMy 8Page Paper Was REally Only Less Than 4 Pages And The Exams Are Very Easy A Lot Of MaterialIs Taught At You But A Lot Of It IS General Its Easier ToMemorize General Things On Her Exams She Gives Us 10 Terms To Identify To Get Perfet Credit You Only Have ToIdentify 6 Of Them! 6 out of 10 isperfect 5 out of 10 is a b 4 outof 10 is a C so soso son She makes us write very very general essays on her exams I didnt study first quarter 2nd quarter i didnt study buttook notes and only tudied them hours before the final exam and i still almost got an A in the class! i also skipped about 1/2 my discussions which were graded for participation. If I went probably would have gotten an A.    ", "rating": 5, "expected_grade": "B", "created": "2009-01-13T18:59:00Z"}, {"professor": "Clare Lyons", "course": null, "review": "I didn't like this class, and I wasn't particularly a fan of Prof. Lyons. \n\r\nThere was A LOT of reading every week. So if you take the course don't take your discussion on Monday or your stuck with the reading over the weekend. \n\r\nLyons' lectures can be very bland and often seem repetitive (but thats just how history is, I guess). \n\r\nThe course consists of four assignments, each 25% of your grade: \r\nParticipation\r\nMidTerm\r\nFinal\r\nPaper\n\r\nThe midterm, and I assume the final will be the same way, are straight forward but there is A LOT of writing. They consist of identifications of terms in class (date, why it was important), and essays. \n\r\nThe paper was tedious and annoying. She has you compare primary documents to things she talks about in her own book, so you have to read all of that in addition to all the assignments you already have. \n\r\nOverall, this class was way too much work for a CORE class. Its not really hard, but its very tedious.", "rating": 2, "expected_grade": "A", "created": "2008-12-12T03:16:00Z"}, {"professor": "Clare Lyons", "course": null, "review": "Prof. Lyons is overall an interesting teacher, but the class is hard. To understand the material you need to go to lecture. There isn't a specific text book, but rather a lot of primary documents and sources. You also need to go to discussions to hand in weekly writing assignments and to increase participation and attendance. The discussion group doesn't go over specifics of what Lyons said, but rather the overall themes. However, the specifics are on the exams. ", "rating": 3, "expected_grade": "B", "created": "2008-12-08T17:50:00Z"}, {"professor": "Clare Lyons", "course": "HIST289N", "review": "DO NOT TAKE HIST 289N. I went into this thinking it would be a fun, interesting class. Instead, I was met with boring lectures, extremely harsh grading, and lack of instructions. There’s not a rubric for any of the assignments in the class, yet on almost every assignment there are a ton of points taken off with no explanation as to why. Most of the assignments the high isn’t even a 100, which does not make any sense. Anyways, this class has been my main source of stress this semester and makes me extremely angry. Do not take it.", "rating": 1, "expected_grade": "", "created": "2022-03-31T12:34:33Z"}, {"professor": "Clare Lyons", "course": "HIST289N", "review": "The class is interesting and the things we learn about are very new/do not come up in your average history class. But the professor is VERY vague about grading and we do not get a rubric for any papers. For the first half of the semester we got video lectures but once we got to the second unit on LGBT history we only got power point slides to read through. Considering the loose structure of the class the grading is pretty harsh as well. ", "rating": 3, "expected_grade": "A", "created": "2022-04-25T16:16:39Z"}, {"professor": "Clare Lyons", "course": "HIST289N", "review": "I loved the class, it was very interesting and educational. If you want to do well on her assignments be as detailed as possible when answering questions, unfortunately there are no rubrics to work from but that’s the pattern I’ve picked mid semester, the more I write the higher the grade. I wouldn’t call this an easy class, I had to put a lot of time into it due to all the assigned readings, but it was also not too difficult, definitely time consuming. ", "rating": 4, "expected_grade": "A-", "created": "2022-05-18T23:53:54Z"}, {"professor": "Clare Lyons", "course": "HIST428W", "review": "Prof. Lyons is an awesome person and I found the class to be really fun. I took her class in 2020 and she was always accommodating and always approachable. My only word of advice is to be prepared to read a LOT, there was considerably more reading in this class than in other classes I have had.", "rating": 5, "expected_grade": "A", "created": "2022-12-01T13:08:00.531157Z"}], "name": "Clare Lyons", "slug": "lyons_clare"}