{"courses": ["COMM450", "COMM498V", "COMM738T", "COMM468T", "COMM478", "COMM401", "COMM652", "COMM399", "COMM399", "COMM301", "COMM468T", "COMM399", "COMM399", "COMM652", "HDCC106", "COMM399", "HDCC105", "HDCC379", "ARHU338", "COMM301", "COMM399", "HDCC379", "ARHU338", "COMM399", "HDCC105", "HDCC379"], "average_rating": 4.5, "type": "professor", "reviews": [{"professor": "Damien Pfister", "course": "COMM401", "review": "Professor Pfister and his TA's were great, especially during this pandemic. All assignments, except the exams, could be turned in late because they were cognizant that COVID-19 was a weird and tough time for a lot of people. The exams were exceptionally fair and open note. They asked for an acted upon feedback from students mid-semester.\r\n\r\nAssignments wise, there were 3 exams (non-cumulative),  weekly reflections on readings (200-400 ish words), 2 short papers, a group project that was like a podcast (15 minutes), small video assignment (group or individual), and some in class participation points. The lectures were asynchronous and came in podcasts with associated readings. They had transcripts for these lectures as well. The discussion were held every other week and were synchronous. ", "rating": 5, "expected_grade": "A+", "created": "2021-01-13T16:20:31Z"}, {"professor": "Damien Pfister", "course": "COMM450", "review": "Damien is one of the most friendly and engaging professors in the COMM department. He's incredibly respectful of student needs while also providing a deep and involved classroom experience.", "rating": 5, "expected_grade": "A", "created": "2021-11-11T21:24:04Z"}, {"professor": "Damien Pfister", "course": "HDCC105", "review": "Loveeeee Damien, his energy is so fun and you can tell he genuinely wants to engage and interact with you (he memorized all 65 of our names within a week). This was his first time teaching HDCC105 and a lot of us came into DCC with stories about Dr.Lu's teaching style and we were thrown off by Damien's. It is really awesome to look back and see how much we accomplished despite not really putting in much time outside of class. My one star off is that he would move from huge project to huge project really fast and most of the time we had overlapping group projects with not enough time and it made it hard to really commit to anything. Also one star off because too much AI, i understand why its important to discuss this but i wish this wasnt the topic for the whole semester and everyone in dcc agress with that", "rating": 4, "expected_grade": "A+", "created": "2023-12-01T13:23:18.787850Z"}, {"professor": "Damien Pfister", "course": "HDCC105", "review": "I had so much fun in this class, with all the group projects. The grading was super lenient and you can tell that he genuinely enjoys teaching this class!!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T20:28:30.019490Z"}, {"professor": "Damien Pfister", "course": "HDCC105", "review": "Overall: Damien is a great professor, and you're lucky to be taking this class with him! You get as much out of it as you put in, so take advantage of the freedom and creativity you get in this class!\r\n\r\nPros:\r\n- Very evident how much he actually cared about students, reflected this in every class (getting to know names/people, talks about your interests)\r\n- Lots of creative group work/independence so you could tailor projects to your specific interests and get to know people\r\n- Lenient and understanding grader (made it clear he did not want to stress out students)\r\n- Not much time needed to be spent outside of class time\r\n- Projects were nice, and you had something to show for your effort (podcast, paper, website, dance video, baking etc.)\r\n\r\nCons:\r\n- Overlapping group projects made it a bit overwhelming\r\n- Topic of AI was fun and unique at first, but began to feel repetitive (would appreciate more variety in topics)\r\n- Fun traditions got cut from the syllabus which was a bit of a letdown", "rating": 5, "expected_grade": "A", "created": "2024-01-20T05:50:31.823520Z"}, {"professor": "Damien Pfister", "course": "HDCC105", "review": "Pros: Relatively engaging lecturer, grades reasonably, flexible, open to fun ideas and activities\r\nCons: Changed the syllabus and major projects multiple times, often unclear on expectations, often seemed unprepared for class, generally not there for support often. The TA's were a huge help", "rating": 3, "expected_grade": "A", "created": "2024-01-26T19:30:57.563571Z"}], "name": "Damien Pfister", "slug": "pfister"}