{"courses": ["EDCI688M", "EDCI651", "EDCI488P", "TLPL403", "MATH470", "TLPL102", "TLPL401", "TLPL479D", "SPHL601", "SPHL602", "SPHL603", "TLPL489D", "TLPL678", "TLPL478D", "TLPL101", "TLPL478D", "TLPL401", "TLPL403", "MATH470", "TLPL101", "TLPL401", "TLPL403", "MATH470", "TLPL478D", "TLPL489D", "TLPL401", "TLPL403"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Dana Grosser-Clarkson", "course": "MATH470", "review": "Highly recommend. She really cares about her students and makes the class really manageable. The class was fun too :)", "rating": 5, "expected_grade": "A", "created": "2020-05-05T18:01:11Z"}, {"professor": "Dana Grosser-Clarkson", "course": "MATH470", "review": "Dana is amazing. If you ever have the opportunity to take a class with her I 100% recommend. This makes it very clear that she cares about her student's growth and forms personal relationships with everyone in the class.", "rating": 5, "expected_grade": "", "created": "2020-05-08T22:37:13Z"}, {"professor": "Dana Grosser-Clarkson", "course": "MATH470", "review": "Dana is the best teacher I have ever had, you can tell she got her PhD in teaching. 470 is so well thought out and enjoyable. If you have the opportunity to take Dana or MATH470, go out of your way to take them. It was a lot of fun and I learned a ton.", "rating": 5, "expected_grade": "A+", "created": "2022-05-11T14:58:41Z"}, {"professor": "Dana Grosser-Clarkson", "course": "MATH470", "review": "Best course and professor at UMD, no competition. If you want to remember why you enjoy school, take this class with Dana. She will reignite your desire to learn and spark your curiosity. This is unlike any other course at UMD. You are set in groups and are encouraged to discuss and explore all the things that make math beautiful. The focus is on learning with little to no focus on grades, so long as you are engaged and participating. For example, in the midterm, we were given six thought problems and given the full period to explore one. You were largely graded on your attempt at trying to solve the problem and not the actual outcome so long as you followed logical steps and justified your ideas. The course also features an emphasis on exploring unrepresented people in math, we got to learn about a lot of cool people through presentations that took place during the entirety of the course. The second half of the semester is centered around the book Mathematics for Human Flourishing by Francis Su. You are given adequate time to read the book, then discuss and explore the current chapters during the class period. I recommend this to any and everyone that can find a way to fit this into your schedule.", "rating": 5, "expected_grade": "A", "created": "2022-08-19T22:21:03.052903Z"}], "name": "Dana Grosser-Clarkson", "slug": "grosser-clarkson"}