{"courses": ["ENGL101", "ENGL101S", "ENGL391", "ENGL398R", "ENGL391", "ENGL398R", "CMLT270", "CMLT270"], "average_rating": 3.6667, "type": "professor", "reviews": [{"professor": "Daniel Sidman", "course": "ENGL101", "review": "Professor Sidman's a pretty good professor. He's your average professor if that makes any sense. You will easily pass English101 with him as long as you show up to class.", "rating": 4, "expected_grade": "B+", "created": "2022-05-25T23:24:09Z"}, {"professor": "Daniel Sidman", "course": "ENGL101", "review": "He's an okay professor. Not too bad not too good. I have noticed some micro aggressions from him. And me and this other POC in the class would give each other the look. So I knew I'm not crazy when I hear the things he says... But he is overall an okay professor.", "rating": 1, "expected_grade": "B+", "created": "2022-10-06T02:46:46.499736Z"}, {"professor": "Daniel Sidman", "course": "ENGL101S", "review": "He's fine, def take him if you need to fulfill a gen ed requirement. This class was always mandatory, when I feel like class could of been canceled or over zoom.", "rating": 4, "expected_grade": "B+", "created": "2022-12-07T14:04:21.373410Z"}, {"professor": "Daniel Sidman", "course": "ENGL101S", "review": "I liked him, not too difficult. He tried to make a somewhat dull class interesting.", "rating": 3, "expected_grade": "A-", "created": "2022-12-08T23:10:18.535434Z"}, {"professor": "Daniel Sidman", "course": "ENGL101S", "review": "He is a pretty average professor and could be monotoned sometimes, but if you do the work he grades pretty fairly. Nothing specifically negative.", "rating": 4, "expected_grade": "A", "created": "2022-12-16T05:36:56.266230Z"}, {"professor": "Daniel Sidman", "course": "ENGL101S", "review": "Hes a good professor. Show up to class and you will pass. His comments on assignments can be not the clearest sometimes but other than that hes fine. Class can be dull and slow sometimes but it's not hard or anything and its only 50 minutes.", "rating": 4, "expected_grade": "A-", "created": "2022-12-24T07:35:26.998506Z"}, {"professor": "Daniel Sidman", "course": "ENGL398R", "review": "Professor Sidman is awesome. Very understanding/ caring professor who is very knowledgeable. He wants to expose his students to Non-Fictional Narratives, and throughout the semester your write 3 essays (all under 1200 words) and create an e-portfolio. He doesn't grade the essays by letter grades since \"they're subjective\" and will give you a pass/ fail based on if you completed the assignment correctly or not, which is sweet. Even though it's only 3 essays, you really work on making these essays great through in class workshops and peer/ teacher review. I know he offers his classes pretty early but if you can make 80% of the classes, I would recommend taking him.", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T13:20:46.311839Z"}, {"professor": "Daniel Sidman", "course": "ENGL391", "review": "I take this class because it required for my major. I never went to his class after the first week and this dude is super chill about whether you go to his class or not, as long as you doing the homework, you will be fine, and he give generous grade. Workload is easy, I never struggled for his class. if you don't have time for the paper, trust me just write something and he will give a pretty good grade as long as you submit something. Very chill professor.", "rating": 5, "expected_grade": "A+", "created": "2023-12-04T01:40:33.894333Z"}, {"professor": "Daniel Sidman", "course": "CMLT270", "review": "This course is quite difficult if you are not a good essay writer. There are not a lot of assignments so the two essays are weighted heavily and they are graded quite harshly. The final is graded quite loosely so that is an easy grade boost. Sidman is an okay professor although it is quite hard to understand what happens in class as the texts are complex and hard to read.", "rating": 3, "expected_grade": "A", "created": "2024-03-12T00:22:43.697416Z"}], "name": "Daniel Sidman", "slug": "sidman"}