{"courses": ["ENES317", "ENES472", "ENES424", "ENES317", "ENES472", "ENES305", "HESI771", "ENES317", "ENES424", "ENES472", "ENES305", "ENES317", "ENES472", "HESI771", "ENES317", "CHSE338K", "ENES338K", "ENES317", "ENES317", "ENES424", "ENES472", "ENES305", "ENES317", "ENES472", "ENES317", "ENES424", "ENES472"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Darren Pierre", "course": "ENES317", "review": "He's really nice guy who's super passionate about what he's teaching.", "rating": 5, "expected_grade": "A+", "created": "2022-12-01T02:19:08.533437Z"}, {"professor": "Darren Pierre", "course": "ENES472", "review": "Really really friendly. Takes material seriously. If you do your work and display care, you'll succeed. He's super great to talk to and you can always ask him for advice or for help if you don't understand something or want some suggestions on how to do something. Great professor.", "rating": 5, "expected_grade": "A", "created": "2023-05-05T12:09:10.149155Z"}, {"professor": "Darren Pierre", "course": "ENES317", "review": "Dr. Pierre is very passionate about his leadership course. He is always full of energy during his presentations and is very knowledgeable of the topics covered. Most of the assignments in the course are very simple and straightforward, and the two quizzes we had were open-notes. You should note before taking his course that (1) he opted not to share his lecture slides, so you have to either take note or take pictures of the slides and (2) the class asks for quite a bit of involvement, so be prepared to do some activities during class. All in all, this is an easy course where you get exposure to different kinds of leadership models. I would recommend this course.", "rating": 5, "expected_grade": "A+", "created": "2023-05-25T14:16:20.444855Z"}, {"professor": "Darren Pierre", "course": "ENES317", "review": "This class is a joke when it comes to a grade. I got a 102.5% in the class. Dr. Pierre is extremely nice and really cares about each student and their well being. Class is an easy A I would recommend it or any class with Pierre to you.", "rating": 5, "expected_grade": "A+", "created": "2023-12-27T21:31:23.569492Z"}], "name": "Darren Pierre", "slug": "pierre_darren"}