{"courses": ["KNES289Y", "KNES287", "KNES614", "KNES485", "KNES613", "KNES789P", "KNES630", "KNES287", "KNES616", "KNES689B", "KNES485", "KNES613", "KNES628", "KNES287", "KNES287", "KNES485", "KNES287", "KNES614"], "average_rating": 4.5455, "type": "professor", "reviews": [{"professor": "David Andrews", "course": "KNES287", "review": "Dr. Andrews is super knowledgeable in this subject. His class helped me understand how sports relate to the economy, politics and life. It's really interesting, a lot of athletes take the class to. There are 3 exams and 2 essays, you can turn in essays early for review before your final turn in. Also, Andrews is super understanding, if you have a problem he's easy to talk to in person or by email.", "rating": 5, "expected_grade": "B", "created": "2016-01-20T14:19:00Z"}, {"professor": "David Andrews", "course": "KNES287", "review": "One of my favorite classes! Dr. Andrews is an engaging and awesome professor. He teaches with enthusiasm and makes lectures interesting and fun to attend... Few papers to write, but get TA help and you'll be fine", "rating": 5, "expected_grade": "A", "created": "2013-11-05T03:28:00Z"}, {"professor": "David Andrews", "course": "KNES287", "review": "He was a great professor, he always made the lectures entertaining and still taught you everything you needed to know.  The tests were exactly what he put on the slides, just make sure you understand the concepts because a lot of times his questions could be argued two ways and pointing it out could get you points back.  He's great at responding to students concerns.  Overall an awesome and very fair teacher.", "rating": 5, "expected_grade": "A", "created": "2011-12-22T18:03:00Z"}, {"professor": "David Andrews", "course": "KNES287", "review": "I took this class as an elective and a diversity requirement (also fills SB) .  As far as an elective goes it is definitely a bit more work than it should be.  However Dr. Andrews is very engaging and open to students' concerns.  He is a very fair teacher.  Come to class as whatever he goes over in class is what is going to be on the test.  If you like sports and sociology definitely take this class.", "rating": 5, "expected_grade": "", "created": "2011-12-12T16:37:00Z"}, {"professor": "David Andrews", "course": "KNES287", "review": "Fantastic professor. Engaging and incredibly intelligent and knowledgeable in his field. He wants his students to do well and makes himself available and open to them. Thoroughly enjoyed attending his classes.", "rating": 5, "expected_grade": "", "created": "2009-09-04T15:05:00Z"}, {"professor": "David Andrews", "course": "KNES287", "review": "Funny and a genius, knows everything there is to know about class material. Tests are surprisingly hard, considering material is interesting. Final paper not that tough and quizzes less than once a week.", "rating": 5, "expected_grade": "B", "created": "2008-12-17T01:43:00Z"}, {"professor": "David Andrews", "course": "KNES287", "review": "Great teacher with good personality! Good sense of humor and wants to help the students do well in his class. The hardest part of the class is the first test. Material is not hard- just takes a while to grasp the diction used by the British professor. class becomes easier if your familiar with sociology and well versed in sports events. ", "rating": 4, "expected_grade": "B", "created": "2008-12-04T18:52:00Z"}, {"professor": "David Andrews", "course": "KNES287", "review": "Andrew is a fun guy, I'll give him that. However the course material is extremely difficult and way too much work for a 3 credit GenEd class. Also, TA Brandon gives really harsh grades. If you want a B from a class with a lot of fun, go for it", "rating": 3, "expected_grade": "B+", "created": "2018-12-14T01:30:10Z"}, {"professor": "David Andrews", "course": "KNES287", "review": "Taking this as a winter course. The lectures are interesting but cumbersome and excessive. You won't pass the quizzes without watching the entire lecture. It's clear Dr. Andrews expects KNES students to think and write like sociology students in a graduate mindset. It's best to avoid this professor if you're  to knock out this req without much stress. I'm sure the glowing reviews must come from an engaging personality in person, but online this class feels like a drag and we're only halfway through.", "rating": 3, "expected_grade": "", "created": "2022-01-11T00:01:30Z"}, {"professor": "David Andrews", "course": "KNES287", "review": "Prolly one of the most down to Earth professors at the university. If you have the opportunity to get him, take it.", "rating": 5, "expected_grade": "A-", "created": "2022-12-22T07:19:11.561507Z"}, {"professor": "David Andrews", "course": "KNES287", "review": "I loved going to Dr. Andrews's class. He is the most genuine and hilarious professor. He genuinely cares about what he teaches and also cares about the students. He makes his lectures fun and the class itself is really interesting. His TAs are also both really great, I had Lilah but I've heard great things about both her and Brandon. Each week there are topic source notes, which get tedious but I promise they really help in the long run. Basically, you get a question and sources and you have to pick two (1 academic, 1 non-academic) and analyze how they apply to the question plus add in your own personal experience. I loved how I was able to always add in my own experience and it is so highly encouraged. There are also only 2 essays the midterm and the final. For those, you get to pick a question from your topic source notes and then elaborate on it, so basically each week you are getting your feet wet in potential essay topics which I found super helpful. There are also weekly quizzes that are open notes and easy if you go to the lecture. Literally the first day Dr. Andrews will say he doesn't care if you go to a lecture or not, but GO I swear it's genuinely so much fun and interesting. He always adds one or two questions directly from the lecture as a way to reward those who go which makes it easy to score well. They graded the essays very thoroughly which I appreciated because they were the first real college papers I had. Overall, Dr. Andrews class was phenomenal and I definitely plan on taking other classes with him if I can.", "rating": 5, "expected_grade": "A-", "created": "2023-01-23T19:05:06.329308Z"}], "name": "David Andrews", "slug": "andrews_david"}