{"courses": ["PHYS122", "PHYS121", "PHYS115", "PHYS161", "PHYS132", "PHYS131", "PHYS270", "PHYS260", "PHYS261", "PHYS261M", "PHYS271", "PHYS271M", "EXST155", "PHYS331", "PHYS332", "PHYS131", "PHYS132", "PHYS161", "PHYS331", "PHYS131", "PHYS132", "PHYS161", "PHYS331", "PHYS332", "PHYS131", "PHYS161", "PHYS131", "PHYS132", "PHYS260", "PHYS261", "PHYS270", "PHYS271", "PHYS260", "PHYS131", "PHYS132", "PHYS260", "PHYS261", "PHYS270", "PHYS271", "PHYS131", "PHYS132", "PHYS161", "PHYS131", "PHYS260", "PHYS121", "PHYS131", "PHYS161"], "average_rating": 3.3947, "type": "professor", "reviews": [{"professor": "David Buehrle", "course": "PHYS161", "review": "He's terrible at teaching. His lectures are so vague and he never does examples. I give him three stars because his class wasn't too hard. The clicker questions are online so you can not go to lecture and still do the clicker questions, you just have to always be looking at your computer so you know when a new questions pops up.", "rating": 3, "expected_grade": "A-", "created": "2016-11-15T10:42:00Z"}, {"professor": "David Buehrle", "course": "PHYS132", "review": "Buehrle is your best bet with physics II. We tend to repeat material in class from the class before and after, which helps enforce the topic. The class didn’t seem to be a lot of work besides the lab, which will never not be a pain in the ass, but at least there is no take-home work from lab. Honestly the key to success with either physics for the life sciences (I or II) is to do well on the homework. Find a group of friends and work on it together, and go to office hours with a TA who seems the most competent. And hint hint, the homework get reused usually each semester. Overall I would recommend taking PHYS132 with Buehrle, seems like a pretty chill and nice guy.", "rating": 5, "expected_grade": "A", "created": "2016-06-03T10:28:00Z"}, {"professor": "David Buehrle", "course": "PHYS132", "review": "Great professor. His motto is: ZERO STRESS. He recycles A LOT of clicker questions on his weekly quizzes and on his exams. Great at answering questions and responding to student concerns. And he doesn't use those annoying white boards from 131 which is awesome! ", "rating": 5, "expected_grade": "A-", "created": "2015-06-08T19:42:00Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "I never leave reviews for professors unless I have a bad time. I had a bad time with this guy.\n\r\nThis guy straight up gives you old AP Physics C problems as exams. Those by themselves are hard. He does not actually teach anything, especially as an introductory Physics class. All he does is derivations on the board. I went to every lecture and it seemed like the time spent in class did not help at all and was a complete waste of time. All in all, bad teacher and really hard exams. Reading the book and watching videos helps a bit.\n\r\nWeekly quizzes which are usually pretty hard and can rarely be done in the time given. Discussion is utterly useless as all you have time to do is take the quiz then go over the answers to the quiz after it is collected.\n\r\nNow, after all this there is a pretty big curve. Be aware the final is really hard. I would recommend just doing old AP Physics C Free Responses to prepare for the exams. \n\r\nI worked really hard in this class and was able to pull off an A- in his class after the curve but if I had the option to take it with someone else that actually teaches, I would. (Side note: This guy is treats guy and girls completely differently -- to the point where me and several other students in lecture would pick up on the way he would talk to guys as opposed to the way he talked to girls.)", "rating": 1, "expected_grade": "A-", "created": "2015-05-29T01:03:00Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "He is engaging and enthusiastic in his teaching. Grading was fair with the exams being manageable. I'll say the same for quizzes.\n\r\nIt's important to actually do the homework problems and GSS worksheets. If you practice until you can get the answers without error, you will get an A in the class. I became lazy and started googling the homework answers since they are all online. Still managed a B in the class.\n\r\nI should mention this is my third physics class since I am a biology major and the material in this was a bit different.\n\r\nDefinitely would take a another class with him.", "rating": 5, "expected_grade": "B-", "created": "2015-01-20T14:13:00Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Buehrle was a decently dynamic teacher, but ultimately lectures were superfluous and I rarely went. Having taken AP Physics, I was quite bored by the class and he didn't do enough to change that. This would've been fine, but his mastering physics homeworks were ridiculous. They would often take hours and be significantly harder than anything he had talked about in class. On top of this, his exams were laughably difficult and the averages seemed to generally fall in the 60s. I don't feel like I learned the material well at all. That being said, the curve is definitely in your favor and relative to what I've heard of other teacher's for 161 you could do far worse.", "rating": 3, "expected_grade": "A", "created": "2014-12-04T01:39:00Z"}, {"professor": "David Buehrle", "course": "PHYS121", "review": "Buehrle is a top notch professor. His lectures were very interesting and he is a really nice guy. His tests got progressively more difficult but he is a fairly easy grader. ", "rating": 5, "expected_grade": "A", "created": "2014-08-20T03:13:00Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "First, you are going to have endless amounts of Mastering Physics. It sucks. They take 2-5 hours depending on the week and your Googling ability. They don't match up all that well with the difficulty and style of the problems you get in class.\n\r\nSecond, he does not go over many examples in class, and mostly does formula derivations, which is not very helpful for learning how to actually do the problems.\n\r\nThird, his exams are really hard. People walk out and say \"I don't know if I got a single point.\" They are all curved, usually a lot, so there is no final curve on the class. Many people had already learned the material but the University did not give them AP credit, so that messed up the curve.\n\r\nFourth, he is an engaging and energetic lecturer. He likes to bring in demonstrations that are not necessarily helpful, but at least interesting. He lets class out 10-15 minutes early almost every day.", "rating": 3, "expected_grade": "B", "created": "2014-05-28T21:22:00Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Buehrle is such a nice, straightforward person. He's teaching style is slow but thorough. If you've gone through AP Physics B you'll be fine for most of the course (you can probably skip most lectures and be fine on the exams). If you've never had physics before, he is also a great choice because of how thorough. \n\r\nI definitely recommend him.", "rating": 5, "expected_grade": "A", "created": "2014-04-26T02:14:00Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Buehrle was a very straight forward and easy to understand professor. He explains everything VERY slowly compared to physics professors I've had in the past, which is good when you get into slightly more complicated topics. He's also easy to approach and is probably the least condescending professors I've ever had.\n\r\nHis tests are more difficult and fast paced than his teaching style would suggest, but they are graded leniently. I'm usually decent at predicting my test scores, and I was confident I got a C or B at best on each test, but I actually got all As BEFORE the curve. The curve on each exam was around 10%. The tests did have a lot of questions without numbers, which could be a problem for some people.\n\r\nI noticed the reviewers that complained were in 121 or 122. I took those classes when I was a biology major, so I'm guessing they are also bio majors. I met a lot of bio majors while getting my microbiology degree at umd, and I hate to generalize, but a large percentage of them are incredibly lazy when it comes to certain classes (mainly pre-meds who want the glory of being a physician, but don't want to put in the work). My point is, don't judge Buehrle by those reviews.\n\r\nP.S. The last paragraph wasn't meant to offend pre-med students. There are plenty of hard working pre-meds who will be great physicians one day!\n\n", "rating": 5, "expected_grade": "A", "created": "2014-01-31T15:47:00Z"}, {"professor": "David Buehrle", "course": "PHYS122", "review": "Ouch this guy is so outta whack. Do your GPA a favor, take someone else. His exams are all over the places. If your physic is semi ok, you'll feel like crap when taking his exams. I don't understand why he doesn't write his own exam that is related to what's teaching in the classroom, but instead he takes some questions from college board website, probably copy and paste and said he wrote them. At the end of the class, I think he curved like 1% or something geez. ", "rating": 2, "expected_grade": "B+", "created": "2013-09-04T00:09:00Z"}, {"professor": "David Buehrle", "course": "PHYS121", "review": "Explains things really well. Easy to talk to and willing to help.", "rating": 5, "expected_grade": "A", "created": "2013-08-19T00:46:00Z"}, {"professor": "David Buehrle", "course": "PHYS121", "review": "I also disagree with the first review of the professor. He is one of the kindest individuals I've ever met and explains the concepts very well. His tests are not too difficult. Physics is one of those subjects you either get or don't. I would say I'm usually one of those students who wouldn't get it...but I truly excelled in this course. If you have taken physics in high school...then you will do absolutely fine. Usually 800+ out of 100 points is an A.", "rating": 5, "expected_grade": "A", "created": "2013-01-14T15:04:00Z"}, {"professor": "David Buehrle", "course": "PHYS121", "review": "Buehrle is the king. \n\r\nPros: EXTREMELY nice, presents the material in an understandable, friendly way. Tries to make sure all of his students get a concept before he moves on. He also curves a BOATLOAD apparently. He says an 80 is rounded to a 90, and looking at his stats in our umd he is really generous. Also, his homework is graded on completion and not correctness.\n\r\nCons: Dude teaches you AP Physics. Straightup. He uses old AP physics questions for his own exams, and his final. You can google the questions from his key and ap exams from like eight years ago show up. This is a royal pain when you're studying class notes and from the book and he asks you something that you've never come across before, which none of the other current phys professors do. However, there's usually only one or two of those on each test, and other than that they're OK.\n\r\nIMPORTANT note: Make sure you have the old exams when taking this class. He reuses a lot of his questions, and this is pretty convenient. What I found was the best way to study was to study old exams, notes, old AP physics problems, homeworks. That's listed in order of importance.\n\r\nI walked away with a decent understanding of basic physics and an excellent grade (I got about 910 points looking at my total grades)\n\r\nMake sure you do the force and motion survey at the beginning, it's worth like 1.5%", "rating": 4, "expected_grade": "A+", "created": "2012-12-22T07:55:00Z"}, {"professor": "David Buehrle", "course": "PHYS121", "review": "I completely disagree with the above review about this professor.  He explained concepts very thoroughly and made lecture both fun and enjoyable (which is difficult especially for a 2 hour lecture).  He is very responsive to students who do not understand the material, and knows how to teach it better than some of the other professors because he used to teach high school (so he isn't mainly a researcher).  His tests and quizzes were difficult, but fair.  If you did the practice problems he gave you then you would do fine.  Clearly he is not too difficult a grader because his grade distribution is all A's and B's.", "rating": 5, "expected_grade": "A", "created": "2011-10-13T12:09:00Z"}, {"professor": "David Buehrle", "course": null, "review": "For the record, it should be said that physics is my weakest and least favorite subject and I hope to not come off as bitter in this review. Buehrle is a friendly and funny guy, but when it comes to teaching physics, he is not that good. I tried my best to learn the material from the lectures, but I guess I just don't get it like everyone else does. A lot of the time, it seems like he just talks about the problem but doesn't do them out completely. His exams were pretty challenging and they were both heavily curved. \r\n\r\nHonestly, my only advice is to grind through his class and watching videos like Khan Academy on YouTube and hopefully you'll do better than I did. I regret not taking Hailu Gebremariam because I have heard that his section is having a better time than I am. Also, it should be said that my experience is not representative of everyone else's experience, and best of luck if you take him.", "rating": 1, "expected_grade": "C", "created": "2018-05-03T03:47:43Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "You’re 100% not going to take anything from this class. I would honestly say he is the worst professor I’ve had at this university, and it’s a shame because he’s a nice guy and says funny things and engages the class - all building façade that you might be learning something useful or that those practice problems you just went over or the demo he did will end up being beneficial. The BAM here comes midterm number 1 ready to just bend you over and dilate your orifices until you walk out of the lecture hall physically and emotionally drained, wondering how you got to that point, and whether or not you’ll ever make it as an engineer when you thought you studied and prepared for this exam only to stare at the first problem and then at your formula sheet and realize you didn’t learn a damn thing in this class and it’s only getting worse from here on.\r\n\r\nFor anyone discouraged after taking this course, PHYS260 is arguably harder in terms of content, but so long as your professor actually teaches you things they test you on, then you’ll be fine. \r\n\r\nJust rely on Buehrle’s curve to pass this class, I’d honestly say it’s impossible otherwise unless you took physics in high school. ", "rating": 1, "expected_grade": "B", "created": "2018-06-02T10:29:05Z"}, {"professor": "David Buehrle", "course": "PHYS132", "review": "He is a pretty good lecturer but the class is still difficult. Reuses a lot of questions on clickers, homework, quizzes, and exams. One nice thing is that the exams do not count for a large percentage of the final grade. The exams have way too many questions to get done in the time period allotted. ", "rating": 3, "expected_grade": "A-", "created": "2018-11-20T17:13:11Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "The lectures were boring and long, but the homework was easy. However, the exams were tough. He gives a good curve because the average was low, but you still have to put in effort to get a good grade", "rating": 3, "expected_grade": "A", "created": "2019-05-25T01:20:53Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Great Guy, Lectures were really boring sometimes, but HW was free and the exams were pretty fair, quizzes were really dumb sometimes tho", "rating": 4, "expected_grade": "B", "created": "2019-12-13T19:06:46Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Covers the material well, makes the occasional physics jokes, and is personal with each student's concerns and requests. He teaches at a manageable pace and posts his lectures slides. The exams however are quite difficult, but he curves.", "rating": 5, "expected_grade": "A-", "created": "2020-04-10T20:48:57Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "He's a funny and nice guy, but with this class, you get what you put in. The lectures are mostly pretty boring and the exams are pretty tough. There is a curve for the exams tho, plus he drops 1 of the 3 exams since the other physics professor only gives 2 exams. ", "rating": 3, "expected_grade": "A-", "created": "2020-05-07T23:49:34Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Buehrle is a chill professor who makes the occasion physics jokes. The homework is easy, but the exams are usually pretty difficult, but he always curves the average to around 80%", "rating": 5, "expected_grade": "A-", "created": "2020-05-13T18:38:51Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "The first thing people think about Professor Buehrle is that he looks like Mark Hamill. Aside from that, Buerhle is a laid back professor, and teaches similarly to AP Physics C. The notes were not too helpful with homework, but was doable. Exams were difficult, but he always curves to make the average 80%. Since quizzes were online, there was nothing to do in discussions, and therefore were pointless, unless you had a homework question.", "rating": 3, "expected_grade": "B+", "created": "2020-05-26T22:11:57Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "David Buehrle is a pretty nice guy, but his lectures were pretty boring and not too helpful; most of the content was ripped straight out of the textbook (including examples), and he didn't start doing more beneficial examples until halfway through the course. \r\nHis online lectures were about the same as in-person. Homework was fairly straightforward and easy, but it took a lot of time to do. Exams were probably the worst part of the course: they either escalated the difficulty of problems or didn't give enough time to complete everything and check your answers. The raw average scores of most of the exams were in the upper 50's to lower 60's; however, he curved exams by 20-30% (around the average), which was a blessing.\r\n\r\nOverall, I didn't learn too much from his course, but I had taken AP Physics (so it wasn't utterly terrible). Since this is a requisite for engineering majors, I wish you the best of luck!", "rating": 3, "expected_grade": "B-", "created": "2020-06-08T21:52:31Z"}, {"professor": "David Buehrle", "course": "PHYS270", "review": "Buehrle was great. Online lectures were helpful and frequently ended early. OH were helpful and he was cool. Exams were standardized and on ExpertTA", "rating": 5, "expected_grade": "A", "created": "2020-12-04T23:06:43Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "This class was super chill. The class focused more on theory than doing math (great for me because I suck at math!). The homework and weekly quizzes can be difficult but he repeats very similar questions on his exams. His online lectures were reused from spring and summer sessions. This made me feel disconnected from the class which was hard for me mentally and made it difficult to stay engaged. Online lab was fine because there is no work outside of the lab. You work with your assigned group over zoom through out the semester and everything is done on the computer. You can put in some effort and do fine. ", "rating": 4, "expected_grade": "A-", "created": "2020-12-27T04:04:55Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "As far as the quality of physics lecturers goes, Buehrle's probably up there as one of the better ones. Pretty entertaining guy in-person. His exams were somewhat challenging but he infamously had really generous curves on them. The flipside is this meant he didn't curve final grades, no matter how close you may have been to the next grade cutoff...", "rating": 4, "expected_grade": "A-", "created": "2021-01-13T06:49:40Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "The grading scale is heavily tilted so its almost impossible to fail the class. But, don't expect to get much out of the class because its a disorganized nightmare", "rating": 1, "expected_grade": "", "created": "2021-05-15T16:49:45Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "This class was run asynchronously and he just posted old lecture videos from previous courses he taught, not even necessarily from PHYS161! This means it was extremely disorganized and nothing he said in the lecture about the exams/homeworks was actually true. The tests were very hard, though they were curved insanely generously. Personally, I literally got nothing out of listening to his lectures which consisted only of slides from the textbook company and the example problems from the book. I had to do a ton of self-teaching just to pass the class. He also didn't respond to my emails and took forever to grade exams (like a month!!).", "rating": 2, "expected_grade": "B", "created": "2021-05-21T15:41:14Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "If you need to get physics out of the way because it is just some random requirement, then this class is for you. He puts a huge curve on the grades, so even though I knew literally maybe 20% of the content I still got an A in the class (my exam scores were 88.5%, 68%, and 135/200 on the final). His lectures are absolutely useless, because he never teaches you how to actually think through and solve a physics problem. Most of the quizzes and homeworks could be found on old UMD PowerPoints and quizlets. With all this in mind, I have never known less for a class and came out of it with an A, despite the fact that I literally don't know anything about physics. This sucks for me because I am a pre-med student, so now I have to self study physics for the MCAT since he did not teach me anything. So if you actually want to learn, I would give this class a 2/5, but if you are looking for an A with minimum effort to simply get a physics requirement out of the way I would give this class a 4/5.", "rating": 2, "expected_grade": "A", "created": "2021-05-23T17:35:29Z"}, {"professor": "David Buehrle", "course": "PHYS270", "review": "Buerhle explains every single concepts very clearly and concisely in his lectures, and even taking the course over the summer, he always host office hours regularly and he won't even mind to meet students at times other than office hours. He addresses every question very well, and once when I got stuck on a problem for hours, he and I spent 30 minutes together and we figured it out. Exam questions formatted a lot like the homework questions, perhaps there may be one question that threw people off especially on the third midterm or the final exam, but I promise you will learn a lot from his lectures and the class as a whole. \r\nIf you are planning on taking PHYS 270 over summer, even when it definitely will be in-person next summer, still, do it! I guarantee it will be the best experience! ", "rating": 5, "expected_grade": "A", "created": "2021-07-21T23:22:16Z"}, {"professor": "David Buehrle", "course": "PHYS132", "review": "This class is a dub. Even though my man is the epitome of laizefaire, the class is an absolute W.", "rating": 5, "expected_grade": "A", "created": "2021-08-26T21:03:56Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "PHYS161 isn't easy, and it is a benchmark course for engineering at UMD. My one and only retake was at UMD, and I took the class with Professor Buehrle.\r\n\r\nPros:\r\nSemi-generous curve.\r\nNo textbook is required. (Physics textbooks can be really expensive.)\r\n\r\nCons:\r\nLong lectures.\r\nExtremely difficult exam problems.", "rating": 4, "expected_grade": "A", "created": "2021-09-03T01:30:07Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Other people I've talked to think he's great, but personally I think he's just okay. His lectures felt almost entirely conceptually based, meanwhile his exams were only applied problems so it felt like a lot of extra work to keep up. The discussion sections cover applied problems but unfortunately I didn't have a great TA so I was kind of on my own. The HW software wasn't great and was tedious at times. The curves on the exams did help quite a bit, but the questions tend to be more difficult than any other applied problems done during discussion and HWs. I only have Khan Academy to thank for my A in this class.", "rating": 3, "expected_grade": "A", "created": "2022-03-02T00:47:47Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "This professor did quite well in teaching the course, however as many people point out, his lectures are really long and extremely boring at times. His exams tend to be kind of difficult to some extent, but honestly I never found them to be insultingly hard. He curves SUPER generously and the grade distributions basically means that, as long as you get the average on all the midterms and do well on the homeworks and online quizzes, you'll basically have an A by the time you take the final. Not only that but he also drops your lowest midterm, meaning that if you did very well on the first 2 midterms, you don't even have to take the last one. Hell, I only took the last midterm for practice and for funsies. Didn't study at all, barely knew what I was doing, yet I STILL got a good grade on the exam. That's how good the curve is. Overall, study hard for the midterms, course is pretty straight forward, decent professor.", "rating": 4, "expected_grade": "A-", "created": "2022-05-12T22:18:54Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "He's a nice guy. You gotta respect him. He gives a nice curve given the exams which he gives are difficult. I wouldn't recommend emailing him he doesn't really help with that kind of thing. Overall pretty good, just do the hw and you will be fine. ", "rating": 4, "expected_grade": "A-", "created": "2022-05-15T19:36:32Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Quick overview of the course: 2 homework and 1 quiz a week, 3 midterms, 1 final, and you get a formula sheet for every exam\r\nMy experience: I learned nothing from this class. Buehrle's lectures were very long and boring, meaning there is very little chance you will be able to focus enough to understand what he is teaching (many people gave up on showing to class after a while). He also didn't prepare us for the level of difficulty of his exams, so the only thing that will be keeping your grade afloat will be the curve. When I say difficult, I really mean his exams were designed to mess you up. For instance, one of the test questions this semester had 2 paragraphs talking about a block's movement and like 15 variables listed, all of which was completely useless to solving the problem. Instead of testing your knowledge, the problem was only meant to make you waste your time trying to use all of the information given. This is why the curve is critical. He curves the average grade of every midterm up to an 80% and drops your lowest scoring one. I doubt you'll end up learning anything from this class, so at least take the teacher who curves like crazy. GOOD LUCK!!! ", "rating": 3, "expected_grade": "B+", "created": "2022-05-17T21:58:53Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "The homeworks and the labs are very tedious. But the exams are easy as long as you review the practice exams. Plus the (required) textbook is well written and helps to understand lecture. He's a very engaging lecturer by the way. And he's willing to answer any questions you have about the material. Yeah physics might be required but at least you got Dave C Buehrle to help you out.", "rating": 4, "expected_grade": "", "created": "2022-05-19T01:04:09Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "His lectures are a bit long and dull, and his exams are on the harder sides. However, he does apply a generous curve to most exams and he drops your lowest exam grade, so it's still possible to do well in this class even if you absolutely bomb one of your exams ", "rating": 4, "expected_grade": "B", "created": "2022-05-19T12:52:58Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Pros:\r\nVery-generous curve.\r\n\r\nCons:\r\nLectures are pretty bad.\r\n", "rating": 4, "expected_grade": "", "created": "2022-05-20T01:46:07Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Overall, taking physics with Buehrle was okay, but it was the hardest class I have taken here at UMD so far. There is a lot of room to get A's on assignments, especially with the expert TA homeworks, because even though they can be frustrating, they are very doable. The quizzes have very vague and conceptual questions and I think that the wording is intentionally tricky. His exams are very hard since very little information is given to you in each question and you may be unable to see the path that you're supposed to take to answer a question. I also found it very frustrating that the exams asked questions that were similar to lectures, but the expert TA homeworks and quizzes didn't exactly line up with lecture, so it could feel like you were practicing skills you would not be tested on. Buehrle also had no control over the 300 student lecture hall. It was always noisy and distracting and very difficult to learn in that environment. I think Buehrle is a nice guy, and if you already have a solid foundation in physics, you can probably do well in his class. If you never took Ap physics in high school, you should probably find a different professor simply on the fact that it is really hard to focus in his class and the exams and quizzes will be extremely difficult since the expert TA homeworks aren't good practice for them. ", "rating": 3, "expected_grade": "A-", "created": "2022-05-24T14:16:08Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "As someone who has never liked physics this class was painful. Buehrle seems like a nice guy, but his lectures weren't helpful especially because he posted his slides which were straight copied from the textbook and didn't say anything different than what was included in the text. I found it really hard to study for this class because expert TA and quizzes were nothing at all like the problems on exams. I feel like I learned nothing, did average on exams, and only got an A because of a very large curve.", "rating": 3, "expected_grade": "A-", "created": "2022-06-08T01:23:25Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "The professor is a really nice guy and is very understandable. People say his exams are harder, but he also curves pretty generously. Overall this guy is really nice and his class is more engaging than Hailu's, so he's a better bet over Hailu so long as you make the effort to understand what's going on in lecture.", "rating": 4, "expected_grade": "A", "created": "2022-12-11T00:18:31.967890Z"}, {"professor": "David Buehrle", "course": "PHYS132", "review": "I always enjoy his lectures, even though I've never liked physics much, because he does a good job of incorporating a lot of examples and practice problems. The class is definitely doable - he has lots of Tophat questions for completion that help boost your grade, and the hws and labs, while tedious, aren't too bad if you work with others or go to course center hours. Exams aren't too hard, they're usually similar to many of hws and old exam practice problems. Buehrle's a very nice and understanding professor - when one of our exam averages was pretty low this semester, he gave us the opportunity to make up points on a couple of the problems, which I really appreciated as not many STEM professors will do this. Glad I got to take his course for 131/132.", "rating": 5, "expected_grade": "A", "created": "2022-12-16T19:00:30.605189Z"}, {"professor": "David Buehrle", "course": "PHYS132", "review": "Dr. Buehrle is seriously one of the best people, and professors you can have as a student at this University. It is rare to find a professor who is not only genuinely passionate about the material they teach but also about the students they teach it to. Dr. B is very accommodating of students' needs and will do anything in his power to ensure they succeed. I highly recommend taking any class he teaches.", "rating": 5, "expected_grade": "A-", "created": "2022-12-17T23:28:39.085506Z"}, {"professor": "David Buehrle", "course": "PHYS132", "review": "Dave Buehrle is a legend. He may seem intimidating at first through lecture or email, but I promise you he is a genuinely nice professor and person. His lecture is engaging and interesting, and I promise you will learn a lot of useful information. The grading is setup so that as long as you put in effort you will NOT fail. I'm not sure what these other reviews are about, but definitely chose this professor and come ready to class.", "rating": 5, "expected_grade": "A", "created": "2022-12-26T04:57:49.688882Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "The only reason I got an A- in this class was the extremely generous curve. In lecture, I felt like I understood the material when it was taught and studied it. However, when it came to exams I had no idea what I was doing- meaning I wasn't really understanding the material in the first place. As someone who has never taken physics before, his lectures teach you the step above before teaching you the basics- which was detrimental for someone like me who has never seen the material before. I even tried to learn and study the basics, but was still confused when exams came around (though I have come to realize that physics is one of my weaker subjects).\r\n\r\nOverall, I would take Buehrle if you just want to pass the class as he generously curves. Personally, I was not happy taking this course because I wanted to understand the material and found that his lectures hindered my learning instead of helping it.", "rating": 3, "expected_grade": "A-", "created": "2022-12-28T15:47:52.308237Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "Such an amazing teacher. Attend lectures. Ask questions during office hours. He really is there to help you understand and apply physics to everyday life. He truly wants his students to succeed. Take him!!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-29T04:57:15.775405Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Great guy and decent lecturer. Homeworks give plenty of attempts and are mostly straightforward (there are a lot however). Quizzes are also pretty simple. Exams are tricky with Buehrle but he curves them pretty significantly. Overall good experience and would definitely recommend taking it with him.", "rating": 5, "expected_grade": "", "created": "2023-01-03T18:44:13.584107Z"}, {"professor": "David Buehrle", "course": "PHYS132", "review": "Phys132 was very disorganized. The lectures, labs, homeworks, exams, and textbook were all out of sync with each other. The material in the 2nd half of the semester was poorly taught, not enough examples to prepare for assignments. Easy A but did not learn a lot.", "rating": 2, "expected_grade": "", "created": "2023-01-05T20:59:48.931580Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "Really good professor. He answers emails really quick, he cares about students understanding the content, and he is very considerate with grades. It's not a hard class if you take some time to study. Homework can be challenging so make sure you take some time to complete them. There are a lot of easy points for the class, and I recommend going to lecture. Exams are tricky, but he gives you a bunch of material to practice with... USE IT! I definitely recommend taking Buehrle.", "rating": 4, "expected_grade": "A", "created": "2023-01-13T18:39:13.732867Z"}, {"professor": "David Buehrle", "course": "PHYS132", "review": "Actually the worst professor of the worst class ever. Everything in this class is a mess. None of the material is relevant to the tests, and the tests are not meant to be answered by students of this class. Most people will get an A, if that's what you're worried about. But if you want to actually learn physics DO NOT take this class.\r\nThe absolute WOAT", "rating": 1, "expected_grade": "A", "created": "2023-01-26T21:39:26.010663Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "The worst. He thinks that he knows what he's talking about but does not. Worst professor EVER. The curves are pointless and the exams are rediculous. HE LIED WHEN HE SAID THAT THE EXAMS ARE EASIER THAN THE HW. JUST THE WORST!", "rating": 1, "expected_grade": "B-", "created": "2023-03-11T01:11:20.904540Z"}, {"professor": "David Buehrle", "course": "PHYS260", "review": "If you are the type of student who has to be walked through examples as you learn the material, Buehrle likely is not the professor for you. I have had a lot of problems with retaining physics information specifically because of this. He does a good job dumbing the concepts down to a conversational level, but the way he lectures makes it difficult to really understand the theories and math behind the physical concepts, which is what a lot of physics exams revolve around. It's especially difficult because he does very few practice problems in class. He usually has the work for the problem pre-written and presents it during class, which doesn't help me at all because I don't understand the steps he took to get there.\r\n\r\nThe layout of the class is like this:\r\n- ExpertTA homework assignments every Monday, Wednesday, and Friday (lowest homework score is dropped I believe)\r\n- A weekly quiz due every Sunday on ELMS\r\n- Three midterm exams, lowest score is dropped\r\n- One final\r\n\r\nThe homework assignments are usually way more difficult than what he covers in class, and the TA I have hasn't been much help in learning the material either. He allows a little leniency for the homework due dates, so if it's a day late you can still potentially get full credit. He doesn't make his own practice problems for exam studying, he only provides textbook practice problem answers, which have helped a bit, but I would prefer personal problems. After having Hailu for 161, I would say Buehrle is actually harder to deal with due to my learning style. Every previous review says the curve is generous, which I'm hoping for, but generous or not the struggle in finishing the class almost isn't worth it.", "rating": 2, "expected_grade": "", "created": "2023-04-17T02:49:38.314388Z"}, {"professor": "David Buehrle", "course": "PHYS260", "review": "Lots of homework, assigns 3 ExpertTA homeworks and a quiz every week. Some of the homeworks are quite hard or long but others are short and straightforward, it varies a lot. Assigned 3 very challenging homework assignments over spring break for some reason. Exams questions were moderately difficult, but we were allowed a formula sheet which made them much easier. Also exam curves were pretty forgiving and he drops the lowest exam grade. Skipped most lectures so can't say much about his lecturing skills but I didn't find it too hard to do decently well in the class.", "rating": 4, "expected_grade": "B", "created": "2023-05-03T18:35:32.343640Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "If you can stay awake and not get bored during lectures you will be fine. The material is incredibly boring, but the homeworks and quizzes aren't too hard and give you a good cushion for your grade. The exams are a little tricky but a lot of the questions are literally word for word from the practice exams with the numbers changed so if you study those you're fine. He also drops your lowest of the 3 midterms which is great. He also drops some of your lowest homework and quiz grades which is also very nice. Overall if you pay attention in lecture and study the practice exams a lot you will do great in his class.", "rating": 4, "expected_grade": "A-", "created": "2023-05-04T22:43:29.933027Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Not the best professor or the worst. The grading structure surrounding the class is great such as with the lowest grades being dropped and very generous curves. However in terms of learning he doesn’t really go over problems and just talks about the theory. Which in a class like physics I would say hurts the learner a lot. Take this class if you just need to fulfill some requirements to graduate and pass.", "rating": 3, "expected_grade": "B", "created": "2023-05-05T07:21:33.607743Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "Buehrle is an incredibly boring lecturer to the point that it's extremely hard to stay focused in class. Nothing prepares you for the tests, the exams take a while to get graded, and if you learn by example, he won't be a good professor for you. I found it really difficult to connect each of the concepts because of the way his lectures are structured. He does try to make class interesting, and the dropped midterm is helpful, but other than that I've barely learned anything this semester.", "rating": 2, "expected_grade": "B", "created": "2023-05-08T02:03:37.204462Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "The main two selling points for Buehrle is his ability to (somewhat?) keep you awake during his lectures, and his kind personality. His lectures on the other hand? Pretty much next to useless. The entire time you will go to lecture, there will be examples that he goes over that mostly just consist of long derivations and RARELY one actual problem that is useful. The only reason why I'm doing well in this course is the extremely generous curve that he applies to every single exam. I'm a physics minor, so I came into this class looking to learn something for my future classes but I'm afraid to say that I've learnt pretty much nothing in this course. The exams are difficult, and the homework questions are nothing like the exam questions so the practice you get out of the homework is very minimal. If you're actually trying learn something in physics, despite Hailu's rep of being boring, take Hailu instead since he actually does relevant examples, but if you want the B- for gateway requirements, etc, take Buehrle for the curve.", "rating": 2, "expected_grade": "B", "created": "2023-05-11T14:43:14.178673Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "I wouldn't say Buehrle himself is terrible, I've heard he's more engaging than Hailu which I guess I can understand and is probably true. However, his exams are very challenging—they are not like the quizzes or the expert TA homeworks, and while they do get curved individually it's really not that much because he curves the average to be around an 80. I should've looked at his grade data for 161 more closely. My one piece of advice is, actually try and study for the third midterm—everyone's going into this one thinking it'll be their drop one, some don't even show up and many people leave halfway after looking at the questions. Why should you study then? Because the curve for this exam is actually good, and it could bring your grade up. I know because I went in thinking I was gonna drop it, but I still studied and tried, and ended up with a slightly higher score than the first exam (which was the easiest of the three) because of the curve. I guess Buehrle prepares you for the final because you're exposed to the combined topic problems he likes to put on his midterms, but I can't say Hailu is better or worse because I haven't seen his exams. \r\nThe only other things contributing to your grade are homeworks (which can be long and difficult, but you get multiple tries per question) and the quizzes. The quizzes can be kind of tricky, and he only drops two so prepare for those. He drops four homeworks, but I would recommend saving those four drops for the end of the semester because there are homeworks due literally a couple of days before finals and nobody has time for that. So don't be lazy during the semester because you'll regret it if you have to do the ones near finals that are on topics you don't even need for the exam.\r\nAnyways I think this course was made more challenging than it should have been to get an A, so I'd probably go with Hailu. Good luck!", "rating": 2, "expected_grade": "A", "created": "2023-05-23T03:38:00.211137Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "I feel like Buerhle is probably your best bet for 161. I took AP physics C in high school so I found most of the course content pretty easy. In my opinion, he is a very good lecturer, although I know some people felt that he “dumbed down” the content too much while he was explaining. He spends most of class time doing practice problems from the textbook. His exams are pretty brutal but there is usually a nice curve. The weekly quizzes are on Canvas so you can take them at your leisure with notes, and Expert TA homeworks have unlimited hints and 5 attempts with no deductions.", "rating": 4, "expected_grade": "B+", "created": "2023-05-24T04:00:36.598132Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "Decent professor, funny guy, but average at teaching. Didn't learn anything from this class. Curve was an 82 for an A- and 88 for an A. For how low the exam scores were, the curve should've been stronger. Still, labs were so tedious and annoying, but there was no pre-lab or post-lab so lab wasn't much work outside of the actual lab timing. We got out like an hour early usually which was nice.", "rating": 3, "expected_grade": "A-", "created": "2023-05-27T01:52:14.682376Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "Heres the thing about this professor: hes a nice guy but does not know how to teach. I am a straight A student (getting As in orgo 1 and 2) and still couldn’t manage to get an A in this course though the odds were much greater. The practice exams are the only thing you can look at to prepare and even then I got 50s and 60s on the exams. During class he talks about the theories and the concepts but rarely ever includes actual problems that involve calculating anything which is an issue because half of the exam includes calculating something. You are allowed to bring an equation sheet to the exams but they arent much help when you don’t know what equations to put on it and which situations you need to use them for. As long as you get near the exam averages and do all the assignments you will get and A-, but to get an A its pure luck", "rating": 3, "expected_grade": "A-", "created": "2023-05-29T17:57:28.015190Z"}, {"professor": "David Buehrle", "course": "PHYS260", "review": "This class was not a walk in the park. Three homework every week, and almost weekly quizzes. Midterms were pretty hard, but you could definitely succeed in this class. The final was super hard and not like the midterms at all. If you can do good on two midterms and not miss any homework or quizzes you could get an A, but it requires you to put in the time and effort.", "rating": 4, "expected_grade": "A-", "created": "2023-06-05T00:50:54.599689Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "I don't think I really learned anything significant in this class. He's passionate about physics and he's a nice guy, but Buehrle spends the majority of class going over the textbook definition and then very extensive examples, which I felt like I never used in the exams or homeworks. I attended the majority of the lectures, granted literally falling asleep in a few of them, but I still found his exams to be extremely difficult. In each exam, there's usually four problems with one of them being a concept matching or multiple choice. Three exams with curves and one is dropped. Only upsides is that the quizzes are online and multiple choice (use your resources if you know what I mean) and that his chalk handwriting is nice. Don't bother going to lecture if you take Buehrle.", "rating": 2, "expected_grade": "B", "created": "2023-06-07T17:38:58.068835Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "He's a very engaging professor but the exams and grading is hardddd. Thankfully theres a nice curve and a bunch of additional assignments to help you cushion your grade. Just study the hw problems and practice exam to prep for the exams. Make use of tophat too.", "rating": 4, "expected_grade": "A", "created": "2023-11-01T01:21:49.245085Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "This class is horrid, the prof doesn't teach you anything during lecture and the exams are graded without any sort of feedback to help you understand what you did wrong. The homeworks are insanely long and the labs are also pointless. Everything about this class is a joke, at least each exam is curved by 20%.", "rating": 1, "expected_grade": "", "created": "2023-11-12T20:50:44.690399Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "Can't learn anything in this class. Teaches kinda abstract but then tests are long, only 50min, and very hard. Luckily he drops a test and 60% of points is from lab/HW/participation. Huuuuuuge curve is only reason why I'll get a B+ (maybe a B if I fail this final). I'm pre-med bio major so I was required to take it. Get your credits and move on.", "rating": 3, "expected_grade": "B+", "created": "2023-11-28T15:55:56.918515Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "Ok so I personally hate physics which is already a bit of a bias against Buehrle, but he really doesn't teach anything. The whole \"flipped class\" model is useless and you can't learn anything from it. Lectures are so abstract and conceptual that you can't do the math that's expected for the exams. The only reason that I have been doing well on exams is because I took AP Physics in high school but I was forced to take 131 because I'm a bio major. If you have little to no physics background you will do poorly on his exams, and that's why the averages are consistently 50% that have to be curved to 80%. I don't think it is hard to get a passing or even a good grade in thsi class but you will not learn enough physics for the MCAT from this class (I don't think this is specific to just Buehrle) so be ready to self-study physics if you're pre-med. Homework is mind-numbingly long, labs are hardly related to course material, and the worksheets you do for the first hour of lab don't even have answer keys for you to know if you're doing them right. \r\nBasically all I have to say is: you will not learn anything in this class but getting a good grade won't be that hard.", "rating": 2, "expected_grade": "A+", "created": "2023-12-06T02:08:40.128678Z"}, {"professor": "David Buehrle", "course": null, "review": "Professor Buehrle has a way of teaching that isn't very common for most of us. During lectures he more-so talks and try to get us to understand concepts and when to use them, rather than actively doing practice problems with us. During lecture I would sit there and think I have a good understanding on what he's talking about, then get to the homework and exam and feel like I'm just now being introduced to it. He try's to make it sound easy, but it's physics sooooo...However he is a great person and you can tell he actually cares about the wellbeing of his students. He knows that all of us are not interested in physics and only take this class because we are required to, so he doesn't expect us to be amazing physicists. Even if you do poorly on the exams, there are MANY other points that you can easily earn that will help you keep your grade afloat. You are definitely able to succeed in this course if you put the work in, just expect to teach yourself some of the concepts. Although this isn't Buehrle's fault, the labs are absolutely awful and feel like the biggest waste of time. I hope the department changes the curriculum for the lab PLEASE.", "rating": 4, "expected_grade": "B", "created": "2023-12-12T03:34:14.729586Z"}, {"professor": "David Buehrle", "course": "PHYS121", "review": "Dr. Buehrle is a good professor but the lectures can get boring and luckily he records them so you don't have to go in-person. XTA HW can be quite tricky with some explanations making no sense or us never really learning the concept. 3 Lecture exams, with the lowest being dropped, were quite difficult...but heavily curved. The only bad thing I can say is that the TAs were soooooo slow at grading lab reports and sometimes grading exams (one even grades in pencil...like wtf?). Anyways overall, chill professor and would recommend to anyone.", "rating": 4, "expected_grade": "A", "created": "2023-12-15T17:10:40.724840Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "Spends too much class time teaching the very basic fundamentals, and then leaves us with relatively difficult homeworks and exams. Coming from someone who has taken previous physics courses, if I didn't have that background intuition to begin with, I would've struggled a lot more in this class. Buehrle is a pretty decent and jolly class lecturer but for some reason, he seemed standoffish and intimidating when interacting with him one on one. Overall, class exams are severely curved. I would go to course center office hours to get help with homeworks, and you should be fine in this class.", "rating": 3, "expected_grade": "A", "created": "2023-12-22T17:59:48.284220Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "This is not an easy A like everyone says, the year I took this class he stopped completely giving out A's. You need to get at least B+ avg on all the exams and absolutely crush lab and hw which are not as easy as they look. Maybe the worst teacher I have ever had lecture is pointless.", "rating": 1, "expected_grade": "B+", "created": "2023-12-24T00:14:23.440901Z"}, {"professor": "David Buehrle", "course": "PHYS131", "review": "I definitely think Dr. Buehrle has the capabilities of being a good professor, but this course itself is just not well done in my opinion. The entire lecture is pretty much theoretical, with little to no emphasis on equations, when to use them, and the math needed to complete them. Therefore, when the exams come around that require this math, many cannot do it, and the average grades are in the 50s. Our final exam was so difficult and not reminiscent of content learned in class, that he didn't even release raw scores or conduct an exam viewing, leading me to believe the average was insanely low. Additionally, homeworks and labs have limited connection with what's covered in lectures, with labs not even providing solid instructions on how to complete the report. When I showed my pre-med friend (not a bio major) who is in PHYS121 what I was doing, he looked at me with confusion and said, \"why are you guys even doing that?\" The pros of this course are that there are a lot of free points offered, and the exams are curved heavily, therefore you should do pretty well overall when it comes to the final grade. However, if I did not have to take this course as part of being a biology major, I would have much rather taken PHYS121, and likely would have gotten more out of it.", "rating": 3, "expected_grade": "A", "created": "2023-12-27T23:25:30.242943Z"}, {"professor": "David Buehrle", "course": "PHYS161", "review": "[Taken Spring 2023] David Buehrle is a swell guy but he taught me absolutely nothing about physics. It's odd because his lectures sounded like they made sense, but in effect it's like he's blabbering on about nothing for an hour and fifteen minutes. His exams are extremely hard and everyone bombs them, but his grading scheme is perhaps the most generous that you will find during your time in the engineering program. His class is curved like crazy and the lowest exam is dropped. Because of the grading, you can pass this class without understanding a single concept like myself and many others and laugh about it in the future. In conclusion, if you are already well versed in basic physics such as kinematics and work and energy, you may as well take him to benefit from the generous grading. If you are like how I was and had never taken physics before, avoid him and take Hailu so that you can actually learn the stuff before dynamics.", "rating": 2, "expected_grade": "C", "created": "2024-02-27T21:17:59.376202Z"}], "name": "David Buehrle", "slug": "buehrle"}