{"courses": ["INST346", "INST154", "INST346", "INST228", "INST362", "INST639J", "INST346", "INST362", "INST154", "INST346", "INST362", "INST639J", "INST208Z", "INST154", "INST346", "INST154", "INST346", "ENES200", "INST346"], "average_rating": 3.9286, "type": "professor", "reviews": [{"professor": "Dennis Frezzo", "course": "INST154", "review": "Dr. Frezzo is very knowledgeable and a funny guys. The class isn’t hard and has no exams, only projects and papers. Overall a good class selection but can be boring if you aren’t super interested in Apollo already.", "rating": 4, "expected_grade": "A", "created": "2022-04-28T21:08:51Z"}, {"professor": "Dennis Frezzo", "course": "INST154", "review": "I don't think I've ever had a teacher care as much about student learning as Dr. Frezzo. The man spends hours preparing for his lectures and it really pays off. He is approachable, gives constructive feedback, and creates a welcoming environment. He openly welcomes student feedback, and he really knows his stuff. He is an engineer, so he tends focus a lot on the science-heavy parts of the course. Since I'm a STEM major, I appreciated that, but I know some of my liberal arts classmates found the science stuff difficult to understand. That said, you could understand literally zero about the science stuff and still get a perfect grade in this course. All of the projects were great too, except for the one group project which wasn't even his own design. Loved this class and really appreciated Dr. Frezzo.", "rating": 5, "expected_grade": "A+", "created": "2022-05-06T00:55:08Z"}, {"professor": "Dennis Frezzo", "course": "INST154", "review": "Excellent guy and a great professor. I always found his lectures super informative and entertaining. Not only does he know the history of Apollo well, but he also combined it with his own personal experiences as an engineer to give more context to some of the engineering challenges. This was a STEM-heavy class, so a lot of the work and lectures naturally gravitated towards STEM topics. Despite this, I think he did a great job trying to diversify the lectures to focus on the non-STEM aspects of the Apollo program too. He also values student feedback and participation, and he encourages his students to participate in discussions if they have questions or comments. Furthermore, he is very accommodating and approachable, which really helped me when I got sick during the semester. I 110% recommend this class and Dr. Frezzo!\r\n\r\n", "rating": 5, "expected_grade": "A+", "created": "2022-05-17T15:11:45Z"}, {"professor": "Dennis Frezzo", "course": "INST346", "review": "Frezzo is passionate and knowledgeable. He's a nice guy. But unfortunately the class is poorly organized and the lectures can be confusing to follow since he sometimes goes on tangents. There aren't slides or anything either so it can be really hard to figure out what's going on, especially since this is the first exposure to this topic for many. I would not recommend taking 346 with him just because of the poor organization alone.", "rating": 3, "expected_grade": "", "created": "2022-09-22T18:17:45.054419Z"}, {"professor": "Dennis Frezzo", "course": "INST346", "review": "He's a chill guy but there seems to be barely any structure to his lectures. His homework questions sometimes make no sense too.", "rating": 2, "expected_grade": "A+", "created": "2022-12-25T22:45:23.135491Z"}, {"professor": "Dennis Frezzo", "course": "INST346", "review": "Professor Frezzo is a very smart guy, which means he's super passionate about the content in this course. He assigns a TON of busy work every week. If there are other sections with some other professors, I recommend taking them instead.", "rating": 2, "expected_grade": "A", "created": "2023-04-17T16:20:11.473905Z"}, {"professor": "Dennis Frezzo", "course": "INST346", "review": "It's A LOT of work but frezzo is always available if you need help. He's very knowledgeable and passionate about the subject. Just make sure to keep up with the work", "rating": 5, "expected_grade": "A", "created": "2023-04-21T01:13:10.455145Z"}, {"professor": "Dennis Frezzo", "course": "INST362", "review": "Passionate dude but the workload is ridiculous. Assignments take way longer than they should. He's really nice tho", "rating": 3, "expected_grade": "A", "created": "2023-04-25T18:31:10.118168Z"}, {"professor": "Dennis Frezzo", "course": "INST346", "review": "Professor Frezzo was overall a great caring professor, he always wants his students to succeed and get good grades, he even gives extra credit. The only thing is he does assign a lot of work weekly which consist of packet tracers, labs, and homework. The class also has a required in person lab and 2 exams. As long as you stay on top of your game in this class and start assignments early you will be good.", "rating": 5, "expected_grade": "A+", "created": "2023-12-14T21:34:50.028358Z"}, {"professor": "Dennis Frezzo", "course": "INST154", "review": "Frezzo is a really smart professor who you can tell is passionate about what he teaches. There was little work outside of class, just a quiz that had to be completed before each one. There were graded discussions during class but I didn't mind showing up because his lectures were thought out and interesting. Every few weeks we would have a decently large project due which required a good bit of work outside of class but besides these the class was easy. The final paper was definitely the hardest assignment (obviously) and has a large workload but, he provides ample resources and time for you to complete it. I didn't use these resources and procrastinated so the final was pretty hard for me but that was my fault, not his. Overall, this class is really interesting and Frezzo is a teacher who cares about the subject as well as his students. His TAs were also great and were almost always available to help with assignments.", "rating": 4, "expected_grade": "A-", "created": "2023-12-18T20:31:44.745494Z"}, {"professor": "Dennis Frezzo", "course": "INST154", "review": "He is very passionate and informed on the subject so it is interesting to listen to his lectures. The course is very STEM-heavy so if you're not interested in STEM or Apollo you will probably get pretty bored of the content. There are homework assignments due every class that take a long time but are otherwise pretty easy. Attendance isn't mandatory because you can make up the discussion questions in every class. There are no midterms/finals but a few papers and projects that aren't graded very hard.", "rating": 4, "expected_grade": "A+", "created": "2023-12-18T21:39:34.584506Z"}, {"professor": "Dennis Frezzo", "course": null, "review": "He is a very passionate teacher. If you do the work, you will defiently end up with an A in the class. He even accepts late work. He puts in the work to make sure people pass his class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T21:37:28.629844Z"}, {"professor": "Dennis Frezzo", "course": "INST346", "review": "Dr. Frezzo genuinely cares about making sure his students pass the class. He's always available through ELMS and has a quick response rate. He does give out a lot of work that can feel tedious at times but he grades rather leniently and much, much, faster than other professors.", "rating": 4, "expected_grade": "A+", "created": "2023-12-23T04:11:15.865714Z"}, {"professor": "Dennis Frezzo", "course": "INST154", "review": "The class was somewhat tedious (there's something due every single class, and attendance is mandatory) but the actual assignments are fairly easy, and the grading is pretty lenient. The class content itself is quite interesting, regardless of your major, and I don't regret taking it at all. He seems like a nice dude too, and he's very passionate about the history of aerospace.", "rating": 4, "expected_grade": "A+", "created": "2023-12-23T04:13:12.263590Z"}], "name": "Dennis Frezzo", "slug": "frezzo"}