{"courses": ["HACS208N", "HACS408L", "HACS208N", "HACS408L"], "average_rating": 1.25, "type": "professor", "reviews": [{"professor": "Denzel Prince", "course": "HACS408L", "review": "This review is being written halfway through the semester, but even though this course isn't finished, I think it should be a very strong projection of how the rest will go. \r\n\r\nThe Testudo description is no longer an accurate description of what this class is. In fact the description is so off base I think what is happening here should be looked into by the ACES program. The labs are very surface level and I'm sure if you've taken the prereq ACES courses, much of this material will not be new to you. I was not a fan of the lecture style, which often involved just playing some youtube videos of how to use software and reading off the slides, when at the very least he could've done a live demonstration. It would just be easier to have this class be asynchronous. The final project is a large research paper, of which you choose any cybersecurity relevant topic and relate it back to forensics. It basically has nothing to do with the material we've been going over, yet writing this paper is a very large focus of the class. For the lectures that have happened so far, all the material feels very jumpy and doesn't really make sense how it relates to this class. There also haven't really been any cases of applying lecture to technical assignments. A lot of offensive security is being taught, and very very little about actual digital forensics. It feels like I'm taking an intro to offensive cybersecurity class, which would be cool if this wasn't a 400-level elective about digital forensics.\r\n\r\nI'd hope this can all be chalked up to lack of preparation on when this course was assigned to him, since Testudo had TBA until just a few weeks before the semester start. If this was his decision to make the course less technical, it really should be changed back. The whole appeal of many ACES electives and classes is to dive into more niche cybersecurity fields that wouldn't be covered in general computer science courses. I think he's a good guy and is trying to make this course cover all the basics of cybersecurity so no one is left behind, but it's pretty frustrating to have a HACS class that was displayed as heavily technical and nuanced being reduced to this. I know some ACES electives are pretty easy, but this class borders on James Green level (iykyk) which I think is more of a bad look for the minor program then anything else.", "rating": 2, "expected_grade": "B", "created": "2023-10-09T23:01:13.084938Z"}, {"professor": "Denzel Prince", "course": null, "review": "Easy class, terrible professor, the more detailed review will give you the intricate experience, and the rest of the class went exactly as expected, we learned nothing relevant to the title of the course and barely had any labs involving any hands on technical work. He's not a bad guy, and I understand it was his first run with this course, but it was disappointing at best.", "rating": 1, "expected_grade": "A", "created": "2023-12-19T09:14:24.005227Z"}, {"professor": "Denzel Prince", "course": "HACS408L", "review": "If you don't read anything else, just know this is likely the worst professor in the ACES program. Unless, of course, you like being threatened with pop quizzes, called out in front of the whole class, backhanded comments, and writing more than you had to than in the introductory English class UMD makes you take. Genuinely just a rude person. My favorite part of the class was writing documentation on the forensic analysis tool Autopsy, just to never actually use it! No technical skills were taught- just writing \"documentation\". What really got me was him making comments about people's final presentations and how they didn't relate enough to forensic analysis. Perhaps actually teaching us what forensic analysis is in the first place would have helped???", "rating": 1, "expected_grade": "", "created": "2023-12-20T18:22:33.232510Z"}, {"professor": "Denzel Prince", "course": "HACS408L", "review": "There's not much to add to the other reviews here, I just wanted to emphasize my disappointment with the course. This class was disorganized and did not adhere to the syllabus. Most \"labs\" were just writeups about some cybersecurity tool or topic, with almost nothing about digital forensics (what this class is supposed to be about). It's funny how I learned more about digital forensics by researching the Autopsy tool in my cyber threats class, HACS408M (great class by the way), than an actual Digital Forensics class. I was expecting us to do technical labs with digital forensics software as the course description stated, but that was not the case. He said he would give us detailed comments on labs and reports but never did, instead, it seemed like you just got full credit if you had something that aligned with the assignment requirements. The final research paper/presentation was also useless, just pick a general cybersecurity topic, and write a detailed paper about it. And then he pushed onto us that we need to relate that topic to digital forensics and/or demonstrate a tool. Like hello?? Wasn't it your job to teach us how these relate and to teach us about these digital forensics tools? What stings the most is that apparently this class was perfect with the old instructor, it's a shame that he doesn't teach it anymore. What a disappointing mess of a class, at least it was a free A.", "rating": 1, "expected_grade": "A", "created": "2024-01-20T06:40:42.739890Z"}], "name": "Denzel Prince", "slug": "prince_denzel"}