{"courses": ["MATH648M", "MATH241", "MATH424", "MATH463", "MATH858M", "AMSC466", "MATH462", "CMSC466", "AMSC673", "MATH673", "AMSC466", "MATH424", "MATH464", "AMSC466", "CMSC466", "AMSC466", "CMSC466", "MATH424", "MATH858G", "AMSC466", "AMSC673", "CMSC466", "MATH673"], "average_rating": 4.587, "type": "professor", "reviews": [{"professor": "Dionisios Margetis", "course": "MATH241", "review": "He's a really funny guy but I was definitely scared to ask questions in class because he made fun of like everyone who talked in class. His exams are fair and although he said there wasn't a curve at the beginning of class, there ended up being a small one because I had a 91.6 on ELMS but I still got an A", "rating": 5, "expected_grade": "A", "created": "2015-05-19T21:27:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Amazing professor. One of the best in the Mathematics Department. His exams are very straight forward and you WILL do well if you do all of the recommended problems. Make sure you get on your TA's good side. At the end of the semester, Dio sits with his TAs and goes through his roster and asks his TA what grade each student deserves. Dio really wants you to learn and if you ever have the opportunity to take him, TAKE HIM!", "rating": 5, "expected_grade": "A", "created": "2014-12-30T20:33:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Dio is really a great teacher. He is passionate, and clearly loves to teach. His tests were graded a bit harshly, and one test with stupid mistakes was enough to drop me to a B. That being said, I think his expectations were fair and he did a good job of imparting the material. If you're the type of person who doesn't feel like going to every class, you could certainly get away with it. It wasn't very hard, and from what I've heard he's the best Calc 3 teacher you're going to find at UMD.", "rating": 5, "expected_grade": "B", "created": "2014-12-04T01:41:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Dio is an excellent lecturer. He is very engaging when he speaks and is never boring. He is also very easy to understand and writes clearly on the board. He is also hilarious, but usually at the expense of one of my classmates. The only reason I was hesitant to give him five stars is that he will destroy you in front of the whole class if you ask a question, no matter how legitimate it might be. Nonetheless I still enjoy his class and have learned quite a bit. The TAs are also excellent. I often learn as much in discussion as I do in lecture. The grades are fair. You do not have to turn in homework, but it is an excellent study tool. Also, the exams are not overly challenging. I would definitely recommend Margetis, just try not to provoke him.", "rating": 5, "expected_grade": "A", "created": "2014-02-10T03:40:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Great professor indeed.\r\nBut gotta say his exams were way too easy, including the final. \r\nGetting an A in this class is easy as long as you attend all the lectures, read the book, and do a lot of practice problems.\n", "rating": 5, "expected_grade": "A", "created": "2012-01-21T11:09:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "This class should have been an A :(\n\r\nDr. Margetis is one of the prominent research professors in the Math department who happens to be a terrific lecturer. At times he may go a little too fast but his hand writing is pretty clear. \n\r\nThe last 2 chapters are the difficult ones. Good Luck.", "rating": 5, "expected_grade": "B", "created": "2012-01-01T05:03:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "In talking with my friends, I regret that I didn't have Justin. Justin's exams were more straightforward compared to Dio's this semester. I could not rely on just his lecture material to prepare me for his exams. There were times that I didn't follow his notes, but I would never dare ask him to explain it in front of the class. Asking for any kind of help from him would be too intimidating. ", "rating": 2, "expected_grade": "D", "created": "2011-12-25T22:38:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Dr. Margetis is a great lecturer and is wonderful at teaching the content of the course. His exams were exceptionally easy, however, which ended up being a bad thing because of the difficulty of the combined final.", "rating": 5, "expected_grade": "A", "created": "2011-12-24T20:03:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Wrote very clear, organized, detailed, and neat notes. Would not recommend him if you like to ask questions in class and mind being made fun of. I also doubt he is someone you would want to ask for help from during office hours.", "rating": 5, "expected_grade": "A", "created": "2011-12-21T21:46:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH463", "review": "The reviews below do a good job of summing up Margetis. Phenomenal lecturer. Writes crystal clear, precise notes on the board, making reading the textbook unnecessary. There is a reason he is one of the highest rated professors on ourumd. His tests are really easy, and he drops the lowest grade. As mentioned below, however, he will absolutely destroy anybody asking questions. He can get away with it because he lectures so well, but it is nevertheless really embarrassing when you think you are asking a legitimate question and he rips you a new one. People very soon stop asking questions. In spite of this, I would recommend taking him over any other professor in the department. You will learn the material really well and get a good grade for it.", "rating": 5, "expected_grade": "A", "created": "2011-05-11T03:04:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "By far the best professor in the math department", "rating": 5, "expected_grade": "A", "created": "2011-01-03T01:14:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "tests were extremely easy, maybe too easy.\r\nthe people who said that his tests were fair are being ridiculous. he pretty much told us which questions would be on the tests as he was teaching the material, and during the lecture before the test he would give many hints. \n\r\nthe best part of class was when he would completely rip apart the people in the first few rows when they would ask ridiculously dumb questions. margetis can be quite funny in these outbursts, but if you are the target you might be embarrassed in front of ~200 other people.\n\r\nOverall he is an excellent 'teacher', from what i have heard a brilliant mathematician/physicist, and quite the entertainer.\n\r\nAlthough he may rip you apart for a dumb question, if you ask a bright question or make an insightful point during lecture he will praise you and ask you your name in front of ~200 people.\r\nand those are definitely rewarding moments.\r\nbasically, choose your questions and comments wisely during lecture.\n\r\nFinal was hard, though. avg. in my section was a 120/200. \n", "rating": 5, "expected_grade": "A", "created": "2010-12-21T19:41:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Great professor; will burn you in class if you ask stupid questions. Engaging and fair tests (sometimes).\n\r\nIf you have a good TA, then you are in for a easy math semester, if not, you probably have to do extra work out of class :T\n\r\nBut overall, Calc III was fun with Margetis! :D", "rating": 5, "expected_grade": "", "created": "2010-12-05T18:32:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Good choice for Calc 3\n\r\nDio is excellent at teaching the material and lecturing. I was able to follow his lectures and not have to read the book for almost the entire course which is very uncommon for me. His grading and tests are very fair and his website is organized. The only problem I had with him is that asking questions in lectures usually resulted in a condescending or hostile answer and sometimes he even ridiculed the student asking the question. I understand this is just his personality but it made me reluctant to raise my hand in lecture. ", "rating": 4, "expected_grade": "A", "created": "2010-12-02T17:25:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Overall great class. He's a good professor and very straightforward. His tests are fair and are based on problems gone over in lecture or in discussion. He doesn't collect any homeworks and doesn't give any quizzes in actual lecture so there is no incentive to go. Absolutely take Margetis, he's the best for calc 3.", "rating": 5, "expected_grade": "A", "created": "2010-11-30T01:15:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "He's a good professor.  He's very straightforward about the concepts, and has a great sense of humor.  However, he doesn't bring anything else to the table that you couldn't find elsewhere.  I stopped going to lecture pretty quickly.  The examples he gives are similar to the ones in the book, and although the explanations of the concepts in the book don't make much sense, you can find good ones online (I recommend Paul's Online calculus Notes).  He doesn't grade the homework, so there isn't much incentive to do it, but I would recommend doing it anyway since a lot of the tests problems are very similar, if not exactly the same as the ones he assigns for hw.", "rating": 4, "expected_grade": "B", "created": "2010-01-18T14:20:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "I went to about three lectures since 10am is a bit early for me. He is a very articulate speaker and knows how to explain the material well to even non-science/math majors like me. I'm horrible at math but still managed a C+ despite never getting above a 50% on my tests or quizzes. ", "rating": 5, "expected_grade": "C+", "created": "2010-01-10T23:20:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Overall, an excellent professor. He focuses on what you need to know for the course, with an occasional dose of humor. Takes 3/4 highest tests, 7/8 highest quizzes and 4 Matlabs (worth 7% of the overall grade). I also happened to have a terrific TA, so that definitely made the experience great. If you are going to take Calc III, I can't think of a better person to take it with.", "rating": 5, "expected_grade": "A", "created": "2009-12-17T02:20:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Absolutely wonderful Professor. Extremely articulate and teaches lessons beyond just Calculus. Was an enjoyable class to go to and never felt like I was wasting time by going to lecture. I don't see how a professor can get much better. ", "rating": 5, "expected_grade": "B", "created": "2009-12-16T07:06:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "This class was exceptional. People taking the other professors classes (Rosenberg) were dealing with 60-70 test averages and our test averages were a cool uncurved 80. Dio made the material very easy to follow with no required homework. There are quizzes in discussion that are easy and matlab homework that's basically extra credit (and only 4 of them). He also drops a test and a quiz. \n\r\nAlso his English is very articulate and easily understandable unlike other teachers you run into at UMD.\n\r\nThe tests were also much easier than the tests I saw from Rosenberg... The tests did test the material but they were not unreasonable so no real surprises. Sometimes you had to think but you weren't stretched too far. Also has his TAs give very reasonable partial credit.\n\r\nOverall: Wonderful class.", "rating": 5, "expected_grade": "A", "created": "2009-12-14T19:40:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Great teacher i would definitely  recommend this instructor to other students. Fair grader, fair tests and he actually cares about his students, unlike manyyyyy manyyy other teachers on this campus. He wants his students to do well in his class and as long as you go to his lectures and solve the recommended hmw you should definitely be able to do well in class.  ", "rating": 5, "expected_grade": "B+", "created": "2009-12-13T20:34:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "He might seem a bit crazy at times, but to be honest it makes him a better professor. He will yell, but not at the students, it is for emphasis which is great in a morning class. He also allows for a one page one side cheat sheet on every exam and two sides on the final, it proves to be very useful. If I could get another course with him as the professor I would.", "rating": 5, "expected_grade": "A", "created": "2009-12-11T00:17:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Awesome professor. very energetic guy and talks very loud which makes u pay attention. gives 4 exams (drops lowest) and about 8 quizzes. every quiz is announced about a week in advance. \r\njust go to class becasue his exam questions are the examples he gives in class, just different numbers.\r\noverall, very good class\n", "rating": 5, "expected_grade": "A", "created": "2009-06-05T12:11:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Dio is awesome! His lectures are incredibly easy to follow, which is especially necessary at 9am. His homework is optional, he takes no attendance, and the quizzes aren't bad, either. Gives plenty of warning for upcoming exams and possible exam problems during lecture. His tests can be tricky if you don't prepare well enough, but his notes + the book gives you more than enough information. One of the best professors at Maryland.", "rating": 5, "expected_grade": "A", "created": "2009-02-25T15:21:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "He's really charismatic and his explanations are simple and he repeats the important things. His tests are also significantly easier than other professor's tests. ", "rating": 5, "expected_grade": "A", "created": "2008-12-27T19:52:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "great lecturer, and fair grader. does not go over the top on the tests, if you know the basics it will be easy. no tricky stuff or senseless complication. probably one of the best put together courses i have ever taken.", "rating": 5, "expected_grade": "B", "created": "2008-12-21T22:26:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "A very good teacher. He makes all the concepts easily understandable, perhaps to such a great extent that it gets a little repetitive. That said, I would defiantly recommend him. He also talks loudly so you will pay attention, but also makes jokes, which make the class more interesting.", "rating": 5, "expected_grade": "A+", "created": "2008-12-20T18:18:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "One of the best lecturers I've ever had at UMD.  He was very engaging and explained the material very well.  His exams and quizzes are very straight forward.  4 exams - drops lowest one, 6-8 quizzes, drops lowest one.  Some problems on exams and quizzes came directly from problems he showed in lecture.  He will tell you during lecture which problems he thinks are \"hot\" for an upcoming exam.  He's also a really funny guy and cracks jokes quite often, but not enough to seem unprofessional.  I highly recommend Dr. Margetis for 241.", "rating": 5, "expected_grade": "A", "created": "2008-12-20T16:36:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Great professor.  Wants you to understand the material.  Teaches straight from the book, but helps you understand it a little better.  I cruised by the class. Consists of 7 quizzes (you can drop 2 of them) and 4 tests (you can drop 1).  NO HOMEWORKS, DOES NOT TAKE ATTENDANCE, AND ANNOUNCES THE DAYS OF EVERY QUIZ AND EXAM AT THE BEGINNING OF THE YEAR.  Exam and quiz questions are just examples he gives in class with different numbers.  If you are good at understanding math you dont even have to show up to class and can teach yourself with the book like I did.  If you make a stupid mistake on something but otherwise set a problem up right he will only deduct a few points.  Definately try to get Margetis if he is teaching your class. ", "rating": 5, "expected_grade": "A", "created": "2008-12-20T05:43:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Dios is an incredible professor. Every morning i wake up looking forward to his early lectures, cause thats when he drinks coffee, and it makes him super energetic! even at 9 am he still cracks jokes, but he still gets right down to work and explains every section thoroughly. to all of you i recommend this professor for calc III!", "rating": 5, "expected_grade": "A", "created": "2008-12-12T14:51:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "Dio is the man!! i am very blessed to have him as my calc professor. he is great at lecturing the material and he grbs your attention. his tests are really easy, and the quizzes aren't too bad either. i highly recommend him.", "rating": 5, "expected_grade": "", "created": "2008-12-11T04:37:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "I don't know if my compliments are enough for the guy. As a professor, he gets everything down to the point. Every lecture session reinforces the previous session, so you won't be clueless. The guy tries very hard to make sure you knows the topics. As a person, he's a funny and caring guy. He throws jokes quite often and so there's not always a tense studying environment. He's easily approachable and will help if asked. His tests and grading policy in my opinion are a little too easy, not that its a bad thing, but he does teach well and you will come out knowing the material of the course IF you try. Take him if you can. I highly recommend him. ", "rating": 5, "expected_grade": "A", "created": "2008-12-03T14:38:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "He's a great teacher! If you can get him, definitely do.  His explanations are usually really good and he gives examples in class that are very similar to those he puts on the exam.\r\nIf you do the recommended homework problems, you'll definitely get A's on the exams. \r\nOverall, it's a great class with him.", "rating": 5, "expected_grade": "A", "created": "2008-11-19T23:18:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "This professor is a very charismatic guy. He often yells when presenting the topic, which keeps you awake. He is a good teacher and explains things very thoroughly The grading is fair and as long as you do practice problems then getting an A is really not very tough.", "rating": 5, "expected_grade": "B+", "created": "2008-01-21T12:13:00Z"}, {"professor": "Dionisios Margetis", "course": "MATH241", "review": "I just wanted to preface this by saying that I did indeed get an A in Dio's class, and a pretty decent grade on the final (188/200). Not trying to brag, but I'm just showing that he's a pretty solid teacher. \r\n\r\nDio is a good lecturer if you like his teaching style. He goes very fast and draws a ton of diagrams, but doesn't really slow down for people who like to ask questions or perhaps take time to understand things. If you went to lecture and did hw problems as soon as the lecture was over (or, at least before the next class), you'll be more than fine. He stresses that you should do the problems. You should - they're vital to your understanding of more complicated topics like Stokes or Greens theorems (to name a few). \r\n\r\nI failed the first test - 21/40. Luckily, he drops your lowest exam, and also your lowest quiz grade. I think he just made the first test intentionally tough to weed out the kids who weren't serious. That being said, the next three tests were a joke with regards to difficulty, and I got straight 40/40's on all three, making my test average a 100. Legit, doing the problems, as well as looking at his pasts tests on koofers, gets you through his tests. \r\n\r\nThe final wasn't easy, but it wasn't that bad either. That being said, Justin's average was a cool 6 points higher than Dio's, making me believe that perhaps Dio's teaching style didn't really suit everyone. I stopped showing up to lecture because once you miss one, he moves way too fast to keep up with - I just watched professor leonard on youtube. \r\n\r\nWith regards to TA's... well taht's a toss up to be honest. You may get lucky with a good one, or unlucky with a bad one. Either way, the material is easy to self study if you find yourself behind for a quiz, and there are plenty of resources online necessary to do so. \r\n\r\nFinally, they do bump letter grades if you were a good student and did well on tests/quizzes (for those who don't do super well on the final). For instance, one of my friends got bumped from a B+ to an A- for his final grade. I also have friends who had 91.0 and up who all got bumped to A's. Just keep a nice relationshpi with your TA and you should be fine. \r\n\r\nAll in all, Dio was good. Grades weren't super hard to get and he's a good teacher. But if you can, take Justin. Seriously, that guy's a legend.", "rating": 4, "expected_grade": "A+", "created": "2018-01-05T03:47:32Z"}, {"professor": "Dionisios Margetis", "course": "AMSC466", "review": "arrogant, doesn't explain well", "rating": 2, "expected_grade": "B", "created": "2020-12-21T17:42:09Z"}, {"professor": "Dionisios Margetis", "course": "AMSC466", "review": "I thought Margetis is pretty good. His (online, synchronous, not recorded) lectures were very organized and he writes neatly using an tablet. He can be mean sometimes so the class wasn't exactly responsive when he asked questions (at least I was intimidated), and those silent moments were awkward. The assignments consisted of ~10 problem sets, 3 midterms plus the final. Homework was reasonable, basically asking to replicate things he did in lectures. Tests were timed, with the midterms basically homework-looking questions and the final slightly more involved than the homework. I found the exams extremely stressful, mostly because of the time pressure, and for that I screwed up a lot of computations. Otherwise the exam problems were fun.\r\nThe course forced me to relearn calculus, which was good. I don't like my grade :/ But still this is one of my favorite classes taken. I have no complaints...", "rating": 5, "expected_grade": "B", "created": "2021-01-12T20:04:25Z"}, {"professor": "Dionisios Margetis", "course": "AMSC466", "review": "The last review is spot on. He's sort of intimidating and gets noisy when asked questions, but overall his lectures are extremely organized. Exams were mostly computational which can be annoying if you screw up. He gives more time than if it were in person, but I felt like you have to use the entire time if you want to make sure you answered everything the way he wanted you to. I also think his offering of 466 is probably on the easier side, because I don't think I learned very much. Interpolation is heavily emphasized, while nothing about linear systems is covered. He also really wants people to turn on their cameras which made me a little uncomfortable. People sort of stopped caring after a few weeks though.", "rating": 4, "expected_grade": "A", "created": "2021-01-18T06:45:12Z"}, {"professor": "Dionisios Margetis", "course": "AMSC466", "review": "Mark my words, this class is death, and Dio is the poison. The material is extremely dry, which is not the professor's fault. I did feel as if Dio was a somewhat dry lecturer, and at times our class fell down the rabbit hole and we were so far off-topic I couldn't understand which way was up or down. While the online-exams were not extremely difficult, the algebra was brutal. He would require us to solve huge algebraic equations, just to get to the next problem which would have us do the exact same thing but even more so (aka orthogonal polynomials). This class was awful, I do not recommend, do yourselves a favor and take AMSC460 instead. For the record, I perform very well in all math classes and this was my first non-A. Avoid, avoid, avoid.", "rating": 2, "expected_grade": "A-", "created": "2021-03-09T20:05:30Z"}, {"professor": "Dionisios Margetis", "course": "AMSC466", "review": "Not going to lie, the course sucks. It is not interesting. But if you take my warning you should be warned that AMSC460 is not much better if at all, at least according to my pals.\r\n\r\nDio himself as a lecturer is very polarizing; I found I didn't like him at first, along with the content, but eventually I found that he was not too bad. He is very witty and quick on the nose. He tends to be very thorough, although because of the material this meant that class time was a little snoozy.\r\nIf he was teaching a course that was more interesting I would take him again.\r\nThe homework was not too bad and neither were the exams. However he chose not to have a final but instead a doubly weighted homework (probably to spare himself the trouble of grading a final), but this is a pro for most students (including me). Feel bad for the grader though.", "rating": 3, "expected_grade": "A", "created": "2021-05-15T00:52:40Z"}, {"professor": "Dionisios Margetis", "course": "AMSC466", "review": "Cruel grader and arrogant.", "rating": 1, "expected_grade": "", "created": "2021-05-15T04:42:42Z"}, {"professor": "Dionisios Margetis", "course": "MATH424", "review": "He's a bit crazy, but he's a good teacher", "rating": 5, "expected_grade": "", "created": "2021-12-11T01:38:47Z"}, {"professor": "Dionisios Margetis", "course": "MATH424", "review": "He's a savage but he really does care about his students. He roasts you when you are unattentive but it's out of genuine honesty. Always attend his lectures as they are legendary.  I usually zone out while I attend lectures but for this class, Dio always makes them entertaining and he explains concepts super well. ", "rating": 5, "expected_grade": "", "created": "2021-12-18T02:23:19Z"}, {"professor": "Dionisios Margetis", "course": "MATH424", "review": "Good lecturer, very passionate about the material. Can be a bit intimidating at times, but going to lectures and asking questions makes the class pretty enjoyable. He follows the textbook very closely, and holds reviews before every exam. The course is an easy A if you have a strong background in probability and can learn finance terms. ", "rating": 5, "expected_grade": "", "created": "2021-12-20T06:15:42Z"}, {"professor": "Dionisios Margetis", "course": "MATH424", "review": "Dio is a very passionate about his teaching. The content of the course is heavy with finance terms and dio does a great job of explaining the concepts in lecture. His lectures are very entertaining and he keeps you engaged, but if you miss lecture catching up can be difficult. He also gives out hints and tips for exams and Homeworks during lecture, so attending class is important for getting a good grade.", "rating": 5, "expected_grade": "A-", "created": "2022-01-04T20:51:44Z"}, {"professor": "Dionisios Margetis", "course": "MATH424", "review": "I like Prof. Margetis very much. He looks like a strict guy but he is funny and super passionate. We had great class atomsphere and everyone can ask questions. He teaches the class very clearly and all the things are easy to follow. It is great that he allows formula sheet for exams, exams are easy if you understand. Notes will not be posted so please pay attention to all the lectures.", "rating": 5, "expected_grade": "A", "created": "2023-01-23T23:42:50.384612Z"}], "name": "Dionisios Margetis", "slug": "margetis"}