{"courses": ["HESP120", "HESP300", "HESP120", "HESP120", "HESP120", "HESP120", "HESP120", "HESP120"], "average_rating": 4.1818, "type": "professor", "reviews": [{"professor": "Dominique Mwepu", "course": "HESP300", "review": "Dr. Mwepu has an energy about himself that is unmatched in other professors, and you will experience it right out of the gate. He will expect you to be interactive and participate, so be ready for that. Ask questions if you do not understand something! I can not stress this enough. At times his exams had material we did not cover in class, so be sure to actually do the readings he lists on the syllabus. Overall he is a good professor with lenient grading, but this will not be an easy \"A\", so put in the work.  ", "rating": 4, "expected_grade": "B", "created": "2021-05-18T14:53:50Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "The actual worst. I could not understand his lectures, and me moved through the material at lightning speed. Took this class because I am a HESP major. If you do not do well don't get discouraged. Other professors in the department are great. You need to do the readings and the homeworks to do well. I am a good student and the homeworks are HARD. I even went to office hours and his explanations did not help. NOT AN EASY A. My hardest class I took both semesters of freshman year. The final project is fun and that is what boosted my grade. Second half of the semester is easier than the first! Good luck everyone. ", "rating": 2, "expected_grade": "A-", "created": "2022-03-02T17:39:59Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Dr. Mwepu is one of the worst professors I have ever had. He goes through the material extremely fast and gives little time to ask questions. When you do ask questions he finds a way to not give you the right answer. Definitely the hardest class I have taken. DO NOT TAKE AS A GEN-ED. This class is not worth your time with Dr. Mwepu. ", "rating": 1, "expected_grade": "B", "created": "2022-05-10T18:55:03Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "TLDR: nice, funny, quiet professor with a tendency to ramble. The class is easy if you read the textbook and go to lecture. It would probably help if you already had an interest in linguistics/languages.\r\n---\r\nI was originally planning on majoring in HESP, but I switched to LING because of Dr. Mwepu (and some other factors, ofc). He is a bit introverted and sometimes takes a while to answer questions. However, he is really funny and understanding of his students. Lecture can get kind of dry when he's speed running through the powerpoint slides, so it helps to sit in the front of the class to pay attention.\r\n\r\nThe class was structured so that we studied, in order: phonetics, phonology, morphology, syntax, semantics, pragmatics, psycholinguistics, then social/developmental linguistics. This follows the textbook EXACTLY, so I highly suggest you READ THE TEXTBOOK. The class will be insanely hard if you don't. Some quiz/homework questions are also answered directly in the textbook. The practice questions at the end of each chapter in the textbook are also similar to exam questions. There are 6 homework assignments (but he drops your lowest score), a few pop quizzes (go to class), 3 non-cumulative exams, and a final group project.", "rating": 5, "expected_grade": "A+", "created": "2022-05-18T01:09:28Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Dr. Mwepu is one of the greatest professors I've had. He has a genuine love for linguistics and his students and his class is engaging and pretty easy. I don't understand why there are some bad reviews here, I truly have nothing bad to say about him!", "rating": 5, "expected_grade": "A+", "created": "2022-11-19T15:31:36.229464Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Dr. Mwepu was an amazing professor! He is very approachable and is very willing to help his students. He is also very encouraging and you can tell that he wants his students to do well. This class was probably my favorite class out of all the classes I've taken. I will say that you will need to work hard in order to do well. However, if you read the textbook, take good notes, and go to lectures you will understand the concepts fairly easily. He does give study guides for exams and if you follow along and review the concepts on there, you will do fine. Make sure you are really familiar with the IPA chart.", "rating": 5, "expected_grade": "A+", "created": "2022-12-10T02:44:38.122943Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Would definitely recommend his class, was super interesting. It does go a little fast at times, but there are opportunities to get help in office hours. You don't really need to do the readings to get a good grade as his lectures cover most everything you will be quizzed on (at least in hesp120) but I do recommend doing so anyway if you can find the time. He is a lenient grader on the exams.", "rating": 5, "expected_grade": "A-", "created": "2022-12-15T01:05:02.015748Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "This professor gave me such a love for linguistics and I am truly excited to go to class. He always has something kind to say and he genuinely is so proud of his students when they get something right. The coursework is balanced and if I ever had questions, he was quick to respond with an answer that really made me think. Need to go to class, he explains most things that would otherwise be difficult. Two pop quizzes but never got grades for them. He is so funny unintentionally and I wish he taught more classes. He is a lenient grader and gives a lot of partial credit and extra credit. Grade breakdown is nice, exams aren't weighted too heavy. Textbook is not needed lectures have everything.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T17:48:08.790528Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Dr. Mwepu is great! His lecture slides are pretty straightforward, and he is very good at answering questions. He is very passionate about linguistics, which is what makes the class so engaging. He is also very funny, which is another reason behind why the class is engaging as it is.", "rating": 5, "expected_grade": "A-", "created": "2023-09-05T18:23:46.407700Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Dr. Mwepu is a super engaging professor who is very passionate about linguistics. However, this class is not the easiest. The workload is pretty hefty as we have weekly homework (that take a lot of time), quizzes, exams, and a group project. He does move through the material fairly quickly, but he's always willing to answer your questions. Attendance is mandatory. Only thing that was kind of annoying was towards the end of the semester he gave out \"pop\" quizzes every class and they were graded, but besides that he was a pretty good professor. Just study and work hard and you'll be fine.", "rating": 4, "expected_grade": "A-", "created": "2023-12-11T16:54:40.916628Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Dr Mwepu is a really great professor! His lectures are engaging and interesting. But, he sometimes moves very quickly through the powerpoint notes. You need to put in the work to do well on the tests and homework assignments, but it is definitely not too much work to handle. I really enjoyed his class and I would recommend it.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T19:31:16.866701Z"}], "name": "Dominique Mwepu", "slug": "mwepu"}