{"courses": ["ASTR430", "ASTR695", "HONR238W", "ASTR120", "ASTR121", "HONR289V", "ASTR100", "ASTR330", "ASTR450", "ASTR330", "ASTR101", "ASTR630", "ASTR101", "ASTR630", "ASTR630", "ASTR101", "ASTR101", "ASTR101", "ASTR399", "ASTR101", "ASTR399", "ASTR430", "ASTR101", "ASTR399", "ASTR430", "ASTR630", "ASTR101", "ASTR399", "ASTR430", "ASTR450", "ASTR450", "ASTR300"], "average_rating": 2.4211, "type": "professor", "reviews": [{"professor": "Douglas Hamilton", "course": null, "review": "Doug Hamilton - Astronomy.\n\r\nThis guy is amazing. He is one of the best professors that I have had at UMD. He is so passionate about astronomy and makes lectures really interesting and fun. I love going into his office hours to get extra help and to talk about random space things. He has made me love space so much that I am adding an astronomy minor!\n\r\nIt is definitely one of the more difficult non science major labs because the labs and homework can be sort of tough and the tests are very challenging. The average on all of our tests have been D's. With that being said it is not impossible to get an A on a test as long as you study a lot and care about what you are learning.  He also curves the tests a lot so that the average is a C/B. He gives an extra credit point or two at 95% of the lectures which helps a lot. \n\r\nGreat guy, great class, don't take it if you want to easily get an A, take it if space interests you and you want to learn a lot about it.", "rating": 5, "expected_grade": "A+", "created": "2015-12-01T23:12:00Z"}, {"professor": "Douglas Hamilton", "course": "ASTR450", "review": "ASTRONOMY - Doug Hamilton\r\n------------------------\n\r\nPretty good lecturer.  Very funny.\n\r\nThe course itself was pretty difficult at times, but putting in your time will get you a good grade.  Go to the study sessions he provides, ask questions, read the book, go to class, do the homework early, and you'll learn a lot.  (If you're reading this review for his lower level astronomy classes, it won't be nearly as difficult as ASTR450, but you still have to put in a little work.  It's not an easy A, but actually doing the work, studying, and caring a little will get you a grade you're happy with at the end of the day).\n\r\nHe also emphasizes other tricks that are super useful, such as checking units, taking limits, symmetries, etc. which are very handy for gaining intuition behind equations (things that should be taught early to freshmen physics/astronomy students).", "rating": 4, "expected_grade": "", "created": "2015-05-07T20:57:00Z"}, {"professor": "Douglas Hamilton", "course": "ASTR120", "review": "profesor hamilton is a very good lecturer, trys to make sure every one knows whats going on. takes lots of questions and answers them during class. he is big on teaching big general concepts, but their have been times on homeworks and test that i lose points for being too specific, and times i have lost points for being too general. its rather hard to figure out what he wants work wise. claims are made of intense use of math, but their really is only light calculus, and that is rare. most of the time their is no math at all.", "rating": 4, "expected_grade": "", "created": "2008-02-22T00:38:00Z"}, {"professor": "Douglas Hamilton", "course": "ASTR330", "review": "I really enjoyed this class! Dr. Hamilton was very engaging and it was clear he was really passionate about the topics in the course. He was really kind to students and I loved his teaching style! For lecture, one downside is that I felt he didn't hit on the points needed in the exams or had an organized way of conveying information, since it felt like I got a bit lost during lecture. Other than that, I would take a class with Dr. Hamilton again.", "rating": 4, "expected_grade": "", "created": "2020-12-09T01:51:18Z"}, {"professor": "Douglas Hamilton", "course": "ASTR330", "review": "Doug Hamilton is such a wonderful guy. This class is challenging, so this review is based solely on who he is as a professor.\r\nHe is engaging, animated, and funny. He's a bit of a dork, which is so fun to be around. 9:30 classes never felt like it with the energy he brought. You can always come to him for help in math (which I desperately needed as an English major.)\r\nHe is an empathetic and sweet person. The nice things I have to say about the dude is unending. Not to mention he is very bright and an expert in this field. Even my mom loved him when she facetimed me during office hours. Do yourself a favor and choose him for this class. You won't regret it. \r\nOne of the best professors in the entire university. ", "rating": 5, "expected_grade": "C", "created": "2021-12-07T18:13:36Z"}, {"professor": "Douglas Hamilton", "course": "ASTR330", "review": " I have taken 3 ASTRO 3XX classes and this one being my last and fourth one to fulfill my COMPSCI upper level concentration requirement. I got an A- in both ASTR380 and ASTR340 and a B- in ASTR350. These classes were structured in a way that the professors understood that the students in this class take it as an elective, so that's how much they expect from you. However, they are 3xx level classes so their is still a good amount of studying and work to do in order to well. In addition, for these three classes all the hw, quizzes. and exams only relied on class sides, no textbook. These professors also dropped lowest HWs and even Quiz grades.\r\n\r\n ASTR330 on the other hand was something else. The professor required you to read and memorize line by line every single word and concept from the textbook he makes you buy. His class slides were not helpful nor meaningful at all as they only contain a title heading and one picture per slide. He mainly just talks about everything in class and expects you to memorize everything that he has said. The hws are also long and very confusing. His chapter quizzes are also very horribly designed as they can be anything from the dense chapter you have to read and memorize. I barely passed the class, I would not recommend taking this class with this professor if you are thinking that you can easily pass, you need to really work hard for this class as if this was one of your major classes. ", "rating": 1, "expected_grade": "", "created": "2022-06-16T16:46:01Z"}, {"professor": "Douglas Hamilton", "course": "ASTR330", "review": "Professor Hamilton is a cool, funny, and easy to approach person, but I will admit this class was seriously a jumble of work(his grade distribution of the class should tell much of the story). The class focuses around a textbook you are forced to read as all the class' content will be drawn from there. The class slides are an attempt to give you more context, however, this consisted of an image and like 2 words lol. The reason he does this is to convince more people to come to class to hear his lecture and what he says during the slides. There are quizzes for each chapter to which the questions can range from \"oh i heard that in lecture\" to \"u have to memorize every detail of the chapter to get this one\". Sometimes there will be online quizzes - which are open note. The homeworks were extremely difficult and graded strictly. I would come into office hours for help and professor Hamilton would spout a lot of random stuff but if you come prepared with questions and an honest attempt, he will offer more help. Treat homeworks seriously as overall they will be weighed more to the final. There were 2 exams and a final, all of which honestly required a lot of memorization. He allows you to have a cheat sheet but that just gives him incentive to make it harder. If you score higher than the average you are in a really good spot, but easier said than done. But I scored below average on the first exam(by a lot) and the final(by quite a bit) and still got a B- b/c I did good on the hws, did pretty good on the quizzes, and scored above avg for the 2nd exam\r\nThere is an automatic curve after every assignment, which is nice but he curves around a C range based on the average(so the average score becomes the C). There is also extra credit provided and a lot of points for participation, which helps for the loss of points from homeworks and exams- so come to class and office hours. Overall, one hell of a class and a lot more work than I would have anticipated. You will need to put a lot of work and time into this class if you want a good grade... and have really good memorization skills. ", "rating": 3, "expected_grade": "B-", "created": "2022-06-26T01:38:50Z"}, {"professor": "Douglas Hamilton", "course": "ASTR330", "review": "Very interactive class and super interesting guy if you're into astronomy.  I found that by reading the book and going to class I didn't have to spend too much time studying at all.  His lectures don't strictly follow the book, so be sure to take notes for quizzes and exams.  ", "rating": 5, "expected_grade": "A+", "created": "2022-07-26T14:08:24Z"}, {"professor": "Douglas Hamilton", "course": "ASTR120", "review": "While he's not a terrible professor, going to office hours I've gotten the impression that he doesn't really know anything about neurodivergency or what being a woman in STEM is like.  I'd avoid if you actually want to enjoy your time in Astronomy.", "rating": 1, "expected_grade": "P", "created": "2022-11-04T20:18:00.394937Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "Took this class for GenEd lab credit... big mistake. Lectures are all over the place and don't at all match up with textbook readings or labs. He can be condescending which isn't helpful when you are trying to understand material. His exams are also very strange- they have a ton of hypothetical questions that there's no way you could know the answers to. When the class asked what to study for exams, the exact content he told us to focus on studying wasn't even on the exam, which was so frustrating. Just avoid all together.", "rating": 1, "expected_grade": "", "created": "2022-12-12T03:29:58.220457Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "Professor Hamilton is very knowledgeable on astronomy but he seems out of touch with teaching. He does not use powerpoints during lecture, and expects students to take notes on what he is saying for over an hour. Very challenging for visual learners or those with focus issues. The only reason I am passing the class is because I learned all the material on my own time with my own resources. There is a curve for exams but that is because the average grades are so low that everyone would be under a C. If you are super smart and type A then you will do fine but otherwise I would try to find someone else.", "rating": 2, "expected_grade": "B-", "created": "2022-12-13T16:25:39.032895Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "I took this class as a gen ed and because I had a personal interest in astronomy. I wanted to learn more about the field and become more engaged with STEM. However, I left this class feeling unmotivated, embarrassed, and frustrated. Dr. Hamilton seems to have a general dislike for the youth. He frequently makes comments about how we don't pay attention or don't participate when he is abrasive to those who do. I really enjoyed his personality, but the silliness became belittling. Especially so as a woman. Another review mentioned how he doesn't understand much outside of a binary sense, making the class hard for neuro-divergent students. Exams were incredibly difficult and broad, and there was little to no guidance on what materials were to be studied. He also uses archaic ways of conveying information. Overall, unless you are very interested and well versed in astronomy/physics, I don't recommend this class.", "rating": 1, "expected_grade": "B-", "created": "2022-12-14T01:08:03.144955Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "Douglas is an all around inefficient educator with a poor attitude towards his student body. Any chance there has been class feedback opportunities, there have been no changes to improve instruction, exam formatting, and teaching to better assist students in succeeding. There have been a few times when the professor outright humiliated his class by displaying the statistics on class scores, later placing all blame on our efforts and lack of attendance rather than shortcomings that have been voiced on his end. This created a hostile environment and relationship professor to student where few in the class felt psychologically safe to ask for further help. When a class average for an exam is a 58, this says more about the failure of an educator than each individual in the classroom. I would never recommend Doug’s class to anyone hoping to enter science at a novice level. You will be thrown for a loop. I had a 4.0 before him and don’t know what to expect now.", "rating": 1, "expected_grade": "C", "created": "2022-12-14T15:44:10.130367Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "This man is a joke of a professor. Save yourself the mental turmoil and stress of trying to work through his inefficient teaching and lack of respect for students. With so many students failing to grasp concepts enough to pass an exam, the blame cannot just be on us. He needs to take some responsibility for his shortcomings as he time and time again refuses to.", "rating": 1, "expected_grade": "B-", "created": "2022-12-16T18:04:30.858445Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "Dr. Hamilton is a generally uninteresting lecturer who still uses overhead projectors even though he has a projector and a computer available to him. He tries to make the lectures interesting with demos that are momentary distractions from the boredom of being in his class. On top of this, his exams are unreasonably hard for a gen ed lab requirement, with the average of many exams being around a C or a D. He also accuses everyone of cheating on homework’s he doesn’t prepare us properly for, and will give harsh penalties if you use Google or any other resource besides the textbook. Sadly, not even the textbook seems to have these answers either. He’s just a generally out of touch guy who seems to think most college students are lazy and unmotivated, and will blame us for doing badly on exams. I would avoid his class if possible.", "rating": 2, "expected_grade": "B-", "created": "2022-12-20T23:32:41.659425Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "Don't get me wrong this dude tries his hardest to make his class entertaining and engaging, the thing is that he's not a good professor. The average for the exams in the course were low and he made it seem like he would curve them by assigning a letter grade (For example I got a 74.5 on Exam 1 and I got my exam returned with a B+ on it). However, this was very misleading as at the end of the semester he said the letter grades were not a curve but instead to \"let you know how you're doing in comparison to the rest of the class\". Further, he used collective punishment in class. He got upset that many people weren't attending lectures so he said he would not post lecture recordings and slides until class attendance was over 60%, which was completely unfair to people who attended class regularly and had no control over the attendance of other people. This also hurt people's ability to review for exams which is probably why the grades were so low. Overall his grade distribution in an entry-level \"easy A\" astronomy course was 34 As, 54 Bs, 67 Cs, 15Ds, 5 Fs. I overall wouldn't recommend him for this course however I've heard other people have had a better time with other professors.", "rating": 1, "expected_grade": "A-", "created": "2023-01-06T17:09:02.160331Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "The class is harder than it should be for a 100-level course. He is friendly but could be more organized. He did give a LOT of extra credit during lectures which honestly carried my grade. The exams were way too hard, but thanks to the extra credit, my grade did not suffer as much. Still, I found the class very interesting. My TA, Brian, was really good and made labs fun and interesting. It is a good class to get the Lab Credit if you are interested in astronomy and can come to lectures/labs.", "rating": 3, "expected_grade": "B", "created": "2023-01-30T03:50:40.145601Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "Unfair exams, completely out of touch with is students, blames students for being lazy even though he does not put in the effort to communicate with his students. Stay away.", "rating": 1, "expected_grade": "", "created": "2023-05-27T02:36:40.726023Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "I took this class expecting it to be a simple gen ed but Douglas had other plans. His exams were completely unfair with his averages being very low. He blames students for being lazy while he doesn't try to communicate with anyone. His lectures were structured horrible as he would put his notes on a projector written in dry erase markers. Study material barely reflected what was being tested on and his homework were undoable with out having to search the answers up on Google. This would spark the \"cheating\" epidemic in which he accused his students of cheating on his abysmally hard homework. The TAs I had did not care about the class and did not make an attempt to help the struggling students. She would sit on her phone the entire lab period and when students would ask for an explanation she would say she didn't know what to do then go back on her phone.\r\n\r\nTerrible. Just take a different gen ed", "rating": 1, "expected_grade": "", "created": "2023-05-27T02:47:07.479193Z"}], "name": "Douglas Hamilton", "slug": "hamilton"}