{"courses": ["JOUR150", "JOUR200", "JOUR458O", "JOUR150", "JOUR150", "JOUR150", "JOUR458O", "WGSS428O", "JOUR150", "JOUR150", "JOUR150"], "average_rating": 4.6923, "type": "professor", "reviews": [{"professor": "Edward Alwood", "course": "JOUR150", "review": "If you have the chance to take this professor, do it. He is the most caring, sweet, and understanding man you will ever meet. The workload in this class is extremely minimal, with only 4 essays (that are only a page each), and 3 mid-term exams. The only thing is you have to do somewhat well on those because thats your only grade besides attendance. I wish I could take this class again, I learned so much from him.", "rating": 5, "expected_grade": "A", "created": "2020-05-08T01:57:51Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "he is a very knowledgable and caring professor. the essays are easy, but you will need to memorize a lot for the exams. overall a great choice for an easy gen-ed", "rating": 4, "expected_grade": "A-", "created": "2020-05-20T18:35:14Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "very sweet professor - lectures were recorded, but he showed them during a live zoom meeting to stay interactive with students; grades are basically determined off of a couple tests and 3 2-page essays, which honestly are pretty easy; if you put even a bit of effort in this class you will pass with a good grade since everyone else barely puts any effort in", "rating": 5, "expected_grade": "A", "created": "2020-12-05T01:33:52Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "Very sweet and fun! He tried his best to make lectures interesting. His papers were not difficult or time consuming. The exams were fair and easy. I would VERY MUCH recommend this for an interesting class and easy gen ed!", "rating": 5, "expected_grade": "A", "created": "2021-04-29T04:06:24Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "He is the best teacher ever. Very nice guy, very easy class, and very interesting lectures. The essays are easy as shit and the exams are a breeze if you study a little bit the day before. Overall great class", "rating": 5, "expected_grade": "A+", "created": "2021-11-05T15:37:35Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "This is the boy. Super funny and nice. A professor you definitely want to have. Not only is he great but 150 is a piece of cake.", "rating": 5, "expected_grade": "A+", "created": "2021-12-20T05:21:39Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "I love him and this class but I wish we had more things to bring our grade up because I got a B on one test and now I might not be able to get an A unless I do really well on the final.", "rating": 4, "expected_grade": "A-", "created": "2022-05-03T14:43:21Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "Really sweet guy and an overall pretty interesting class. There are 3 exams that make up 89% of your grade and the rest is participation (coming to class). Exams are fair and you get a study guide for each exam and if you put the terms in a quizlet and get those down you should be able to get an A. It kind of sucked that such a large part of your grade are exams but it is nice not having to worry about this class (besides showing up) other then exam weeks.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T03:59:51.747251Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "Very nice and understanding professor, 3 exams total and those are the only grades so if you don't do that great you can't really bring it up", "rating": 5, "expected_grade": "B", "created": "2022-12-10T19:52:04.608573Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "Professor Alwood is fantastic! This semester, he did however only have the class be based on 89% exams, 10% participation, and 1% syllabus quiz. It was stressful only having these things to go off of, so unless he changes the structure, this is what you might expect! Not sure if it was just some experimental way to run the class or how he wants to continue it, but I just wanted to let that be known. He is very knowledgeable in this subject matter, and his lectures are usually engaging and relevant. Just be sure to take good notes and attend every session, as in my experience, lectures are not recorded. You will also need to get a textbook for this class, but the reading isn't too dense, so just a nice skim would do. Overall, I had a good experience in this class and would recommend Prof. Alwood! He very much cares about the class and what he does and it shows.", "rating": 4, "expected_grade": "A", "created": "2022-12-13T05:15:01.500555Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "Prof. Alwood is extremely kind and teaches the course very well. His lectures are engaging and he provides great perspective from his time as a former reporter. The workload for this course is extremely minimal, there is a \"required\" textbook but everything you need to know for the tests will be covered in class. I never read the textbook and still had an easy time. He is strict in his rule against using phones in the classroom, but the lectures are interesting enough to give your full attention to. I would absolutely recommend him and this course to anyone looking for an easy gen ed!", "rating": 5, "expected_grade": "A+", "created": "2022-12-17T05:06:37.905747Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "This class is very well taught and the Professor knows what he's talking about. He's picky about attendance, but only because handfuls of people never show up and expect to do well. If you attend regularly and pay attention in class, this can be a free A just by studying for the three tests (which make up your whole grade in the class aside from participation). Take this if you need an easy gen ed", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T20:31:13.763286Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "Prof. Alwood genuinely wants the best for all of his students, and clearly has the experience to be teaching this class. He definitely is a little old school (ex. no electronics), and his lectures were not always the most engaging. Additionally, there are only 3 tests that are worth 90% of your grade so you really have to make sure you are attending class and paying attention. But he is a super nice guy and the content isn't super hard to remember. I would recommend if you need a gen-ed", "rating": 4, "expected_grade": "A-", "created": "2023-12-15T20:36:06.541294Z"}], "name": "Edward Alwood", "slug": "alwood"}