{"courses": ["KNES350", "KNES451", "KNES451H", "KNES498", "KNES350H", "MUSC328", "KNES350", "KNES350H", "KNES451", "KNES451H", "SPHL399", "KNES350", "KNES350H", "KNES451", "KNES451H", "KNES350", "KNES350H", "KNES451", "KNES451H", "SPHL399", "KNES451", "KNES451", "KNES350", "KNES350H", "KNES451", "KNES451H", "KNES350", "KNES350H", "KNES451", "KNES451H", "KNES350", "KNES350H", "KNES451", "KNES451H"], "average_rating": 4.7273, "type": "professor", "reviews": [{"professor": "Elizabeth Brown", "course": "KNES350", "review": "Dr. Brown is one of the most kind, fun, and interesting professors I have had the pleasure to take classes with at UMD. I would take anything she teaches. Not only does she try to give all her students the best possible grades, but her classes are actually enjoyable. Make sure you take notes from her lecutres. They're mostly composed of personal stories so she asks questions about them on her exams.", "rating": 5, "expected_grade": "", "created": "2012-07-14T12:47:00Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "Very sweet woman. Subject matter is interesting, but attendance is pretty much mandatory. There are ways to find past notes online for her class, but solely relying on those is probably a bad idea. She makes the class fun and interesting. She also lets the class out early a lot, which is also a plus. ", "rating": 5, "expected_grade": "A", "created": "2012-05-19T18:43:00Z"}, {"professor": "Elizabeth Brown", "course": "KNES451", "review": "My 2nd time taking Dr. Brown and it was as expected - AWESOME. This class is very easy and like her 350 lecture, involved plenty of stories, videos, and easy tests if you attend class because she will quiz you on her stories and such. \r\nDo NOT take this class if you plan on skipping, most of your grade is based on participation, so don't be an asshole and skip, she'll certainly notice too with only 30 students. Have fun with it and the papers are easy too.", "rating": 5, "expected_grade": "A", "created": "2011-12-16T22:53:00Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "Definitely one of the best classes I have taken at UMD.  Dr. Brown is hilarious and so engaging.  You would be silly not to take this class!", "rating": 5, "expected_grade": "A", "created": "2011-02-05T11:05:00Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "Dr. Brown is great. Friendly, outgoing, dynamic - her lectures were funny and enjoyable. All you need to do is write. Write down everything! write. down. everything. she. says. Word for word. All stories and examples. Just write for the entirety of the hour and twenty minute lecture each day. Also, she normally lets us out at least 20ish minutes early. She's really a great teacher and loves getting to know her students. ", "rating": 5, "expected_grade": "A", "created": "2010-12-23T23:55:00Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "Dr. Brown is the best professor I have ever had! She truly wants to see her students succeed. Her class is entertaining, and extremely fascinating. She is very engaging in her lectures, and students really enjoy being there. Her tests are all multiple choice or T/F and very very straightforward. Straight from class discussions and lectures. She tests on the most random things, just to make sure you were in class and listening, but her test averages are usually mid 80's. Overall she is probably the best teacher I have ever had and would certainly suggest taking her for anything she teaches! ", "rating": 5, "expected_grade": "A", "created": "2010-12-19T05:30:00Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "One of the best teachers in Kinesiology. Shes funny, gets to know the class on a personal level. Tests are easy- all you have to do is go to class (which is always engaging and fun) and study for 1 hr at most. TAKE 350 WITH DR. BROWN shes awesome!", "rating": 5, "expected_grade": "A", "created": "2009-04-29T02:29:00Z"}, {"professor": "Elizabeth Brown", "course": "KNES451", "review": "Out of the KNES department Dr. Brown is hands down my favorite professor. As a senior graduating I honestly never had an interest in psychology but her 350 class made me interested. Attendance is mandatory for points participation points at the end and because she only lectures with no slides. You should take notes on literally everything she says (family stories, videos/TedTalks watched in class, family stories) and you'll pass the exams with flying colors. If you have any issues making class communicate that to her and she'll catch you up. I also recommend her office hours even if you're doing great in the class, she has a lot of career insight for a major that has a lot of niche job fields. This is one professor I'll absolutely reach out to after I graduate and I'm not office hours type!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T16:35:29.673013Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "Best professor I've ever had. She teaches by telling really interesting real life stories and relates them back to the current topic. You have to go to class since she has no slides but her humor actually makes you want to go... you will never be bored. During class take notes on everything including details of the stories and she will also point out what to write. Exams will be easy as long as you have good notes.", "rating": 5, "expected_grade": "A+", "created": "2023-03-30T16:01:16.665456Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "Dr. Brown is by far one of the best professors I've ever had. Her style of lecturing takes some getting used to, as she just talks without any lecture slides or material on the board. However, she is one of the most caring professors I've had the opportunity to learn from. Considering her exams are open note, as long as you take notes on everything she says, you will pass the class with an A, no question. She doesn't talk very fast, so typing notes on my laptop were not ever an issues. She also tends to repeat important stuff and spell out names . She is an amazing professor and I would absolutely recommend her for any course she teaches.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T00:27:04.667542Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "i can't believe she's still teaching. the content we did in class was so repetitive and she would spend a lot of time rambling about her daughters and sharing personal anecdotes that weren't related to sports psych. it is definitely an easy A but I dreaded this class. the 100 question exams would have repeat questions and the formatting was so inconsistent", "rating": 2, "expected_grade": "A", "created": "2023-12-22T13:55:38.948906Z"}], "name": "Elizabeth Brown", "slug": "brown_elizabeth"}