{"courses": ["BSCI160", "BSCI477", "BIOL708D", "BSCI160", "BIOL708D", "BSCI477", "BSCI160", "BIOL708D", "BSCI477", "BSCI160"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Emily Bruns", "course": "BSCI160", "review": "Bruns is an amazing lecturer with a real passion for the things she teaches. She often integrates her own research into the lecture information and provides many different examples that make the content both easy to understand and retain. She makes this class very interesting with her enthusiasm for the subject and her exuberance for specific phenomenon is invigorating! She is very understanding and grades come back quickly (homework set grades within a week, exams within 5 days and frequently within 3), and she drops lowest midterm and quiz grades. Overall, I highly recommend Bruns for BSCI160", "rating": 5, "expected_grade": "A", "created": "2021-12-02T01:45:16Z"}, {"professor": "Emily Bruns", "course": "BSCI160", "review": "Bruns is clearly very passionate about ecology, and does a fantastic job teaching it. Her lectures are easy to understand and usually have a couple clicker questions for easy participation points. Quizzes and exams are very fair, especially since we get a full page of notes to use on the exams. She drops the lowest quiz and exam, which can be a midterm OR the final. There are a few projects throughout the semester, one of which is a group project about different ecosystems, but grading seemed pretty lenient. \r\nBruns is by far the best choice for 160.", "rating": 5, "expected_grade": "A+", "created": "2021-12-18T16:11:07Z"}, {"professor": "Emily Bruns", "course": "BSCI477", "review": "This course is amazing. The best bio class I've ever taken. Firstly, Dr. Bruns is passionate about the material and it shows. She provides every opportunity to help you learn. There are paper discussions which are interesting and relate to the material. The content overall is so interesting. The exams were fair. If you study all of the lecture slides and the study guide given, you will do well. Couldn't recommend taking this class with Dr. Bruns more. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-13T16:37:07Z"}, {"professor": "Emily Bruns", "course": "BSCI160", "review": "Dr. Bruns is very passionate about the content in this course and it really shows during her lectures. She truly cares that her students are learning something. As for the course itself, the exams are very fair if you follow what she puts out in the study guide, and you can also bring in a notecard during exams. Your lowest midterm also gets dropped which is a nice perk. Overall, she makes the class enjoyable to attend, and makes the workload manageable, for this course I would take this professor if you can!", "rating": 5, "expected_grade": "A", "created": "2022-12-02T16:40:15.005944Z"}, {"professor": "Emily Bruns", "course": "BSCI160", "review": "Even though the lectures aren't the most interesting, she is very knowledgable and teaches everything thats on the exam. There are a few long hw assignments that are graded on accuracy but I recommend going to TA office hours because they basically give you the answers. Her exams are very fair and you should be able to do very well by just studying your notes. This class grade is almost entirely dependent on the exam grades(about 70%) but she does drop the lowest.", "rating": 5, "expected_grade": "A-", "created": "2022-12-16T04:03:38.195106Z"}, {"professor": "Emily Bruns", "course": "BSCI160", "review": "Great professor - she is very interested in what she teaches and it really shows.\r\nThe exams were not bad, and they only had information from her slides and classes on them.\r\nNothing much else to say - this is a pretty run-of-the-mill class. If you have to take BSCI160, try to do it with Bruns.\r\nSomething minor, but the homeworks and worksheets were time-consuming and confusing, but that's the only gripe I had with this class.\r\n\r\nIf you have already taken ANTH222 and/or BSCI222 before taking this class, like I did, then BSCI160 is a breeze.", "rating": 5, "expected_grade": "A+", "created": "2022-12-20T17:22:47.637217Z"}, {"professor": "Emily Bruns", "course": "BSCI160", "review": "Prof. Bruns is a fantastic teacher. She's engaging and it's clear that she has a genuine passion for the field and enjoyment of teaching the content to the students. Exams were pretty typical, we could bring a notecard and they weren't too difficult. Lectures were also quite typical, just taking notes from slideshows. Overall, this is a course with decent content that I really enjoyed, in no small part thanks to the energy Prof. Bruns brought to class everyday.", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T17:06:17.021169Z"}, {"professor": "Emily Bruns", "course": "BSCI160", "review": "Dr. Bruns was very passionate about eco and evolution! There is a lot of material to cover but she makes it very straight forward. I was balancing Orgo 1 with this class so my time was split making it difficult to completely focus on BSCI160, so my grade is a little lower. Overall, I would take her again! She is the best professor to teach this course.", "rating": 5, "expected_grade": "B", "created": "2024-01-20T01:21:51.147282Z"}], "name": "Emily Bruns", "slug": "bruns_emily"}