{"courses": ["ENGL398B", "ENGL398B", "ENGL398B", "ENGL398B", "ENGL398B", "ENGL398B", "ENGL398B"], "average_rating": 4.4, "type": "professor", "reviews": [{"professor": "Eric Thiel", "course": "ENGL398B", "review": "Professor Thiel is one of the best professors I've come across in college. He teaches you real skills, makes the classroom environment super comfortable, makes assignments low stress. He really cares about his students succeeding and like I said, learning real communication skills. Anyone who doesn't give him 5 stars is insane. Take him for PW you will not regret it.", "rating": 5, "expected_grade": "A", "created": "2023-04-17T14:56:18.277907Z"}, {"professor": "Eric Thiel", "course": null, "review": "this class is a joke. cancels class often or puts to zoom. super nice and friendly guy. most of this class is group work so if you have a good group you will do just fine in the class. 10/10 recommend", "rating": 5, "expected_grade": "", "created": "2023-05-01T03:21:31.309790Z"}, {"professor": "Eric Thiel", "course": "ENGL398B", "review": "Nicest man to walk the earth. This is a very easy professional writing class. All group work, you basically start your final project the first day of class and work out it throughout the semester. This makes it less overwhelming and easier to accomplish. I learned a lot from him I recommend this class.", "rating": 5, "expected_grade": "A", "created": "2023-08-09T14:35:37.417699Z"}, {"professor": "Eric Thiel", "course": "ENGL398B", "review": "Took this professor because he had great reviews and was recommended by a few people. Professor Thiel is a great guy, but I would not recommend him as a professor. He sends incredibly long voice memos as feedback which takes forever to translate into detailed notes. He also is very negative with his comments and expects way too much from his students. Nice guy, frustrating professor.", "rating": 2, "expected_grade": "A", "created": "2023-12-10T18:42:27.247978Z"}, {"professor": "Eric Thiel", "course": "ENGL398B", "review": "I'm giving Professor Thiel a five because he's an incredibly nice professor. However, this class is extremely tedious compared to most PFW classes. The final project makes it feel more like a business class. Throughout the semester, there's a lot of pointless assignments that don't really do much to your grade and just serve as busy work.", "rating": 5, "expected_grade": "", "created": "2023-12-15T17:08:24.260354Z"}], "name": "Eric Thiel", "slug": "thiel"}