{"courses": ["ENGL393", "ENGL101", "ENGL294"], "average_rating": 4.6667, "type": "professor", "reviews": [{"professor": "Erin Green", "course": "ENGL101", "review": "Literally got an 100. Didn't show up for 3/4 of the class. Grades major assignments 10/10 instead of giving percentages. Literally could not have gotten an easier teacher. They cancelled class half of the time. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-06T02:49:53Z"}, {"professor": "Erin Green", "course": "ENGL393", "review": "I'm taking Professor Green right now for the 3 week winter session. I definitely recommend signing up for this professor's class if at all possible. They are an amazing professor and give really good writing feedback. Makes this class super painless. Don't get me wrong, you still have to write a lot, but this professor doesn't gatekeep or nit-pick and take off points unnecessarily. Take Professor Green!", "rating": 5, "expected_grade": "A", "created": "2022-01-17T17:51:17Z"}, {"professor": "Erin Green", "course": "ENGL101", "review": "I love them. Made Engl101 so brain dead easy, which was awesome for me considering I had way more stressful classes to worry about. Don't get me wrong, they give good feedback on your writing assignments and are a good professor. What made me love their class is how nonchalant it is, and how stress free. Recommend 10/10 if you can get them.", "rating": 5, "expected_grade": "A+", "created": "2022-01-25T21:48:12Z"}, {"professor": "Erin Green", "course": "ENGL101", "review": "Erin Green was a great professor and his ENGL101 class was both interesting but also very laid back. ", "rating": 5, "expected_grade": "A+", "created": "2022-02-13T22:02:01Z"}, {"professor": "Erin Green", "course": null, "review": "Erin was super accommodating, major assignments were clearly defined, and weekly assignments were relaxed and usually pretty interesting. They are a great professor to have! ", "rating": 5, "expected_grade": "A", "created": "2022-05-23T22:23:15Z"}, {"professor": "Erin Green", "course": "ENGL393", "review": "While Professor Green's course was easy, and I appreciated her upgrading method, the course was useless, and I highly recommend taking 393 with another instructor if you wish to get anything out of the course. The entire class was zombie-themed, even down to the resume and cover letter. None of the writing done in this class will you be able to reuse. The resume and cover letter must be tailored to a zombie-themed position and the instructional manual and infographic assignments are also zombie-themed. Imagine submitting a zombie-themed writing sample to an employer. I'm sure that would look reallllyyy professional. Again, don't take 393 with Erin unless you really love zombies and don't mind wasting your time writing a bunch of useless assignments.", "rating": 3, "expected_grade": "A", "created": "2024-01-16T16:07:03.807192Z"}], "name": "Erin Green", "slug": "green_erin"}