{"courses": ["BSCI223", "BSCI412", "BSCI223", "BSCI223", "BSCI223", "BSCI412", "BSCI223", "BSCI223", "BSCI223", "GEMS296", "BSCI223", "BSCI412", "GEMS297", "BSCI223", "GEMS396"], "average_rating": 3.2, "type": "professor", "reviews": [{"professor": "Erin Tran", "course": "BSCI223", "review": "Has no idea how to teach. All she does is read the slides (everyone in college can read on their own thank you!!!!). Mandatory clicker points so you much show up to hear her read. Nice person, but other than that, pretty bad teacher.", "rating": 1, "expected_grade": "A-", "created": "2019-02-28T02:32:37Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "She was pretty average. The class mostly depends on lab points. The exams she gives are pretty difficult but I've heard they're better than Buchner's. She kept things clear and relatively easy to understand.", "rating": 3, "expected_grade": "A-", "created": "2020-05-22T04:53:46Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Not a very engaging professor. You can tell that she likes to read off the slides. However, her exams were fair but lacked clarity and often not provide clear directions when it comes to assigments and projects. In hindsight, the class seemed to be all over the place. ", "rating": 2, "expected_grade": "A-", "created": "2021-03-31T02:17:50Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Dr. Tran is awesome. She is very knowledgeable and from I have experienced does not read off of slides? She explains concepts very well and you can tell she has enjoys teaching. ", "rating": 5, "expected_grade": "A", "created": "2021-04-20T00:21:24Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Dr.Tran is an amazing and kind professor. I will admit that the lab assignments were pretty annoying. Dr.Tran's exams are very fair, as long as you attend the lectures and review the material you will succeed on her exams. She also gives extra credit.", "rating": 5, "expected_grade": "A", "created": "2021-05-24T13:23:10Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Dr. Tran is an amazing and nice professor. She is really clear at explaining things in her videos and lecture. This class may seem like a lot of work but many of the assignments are small and/or done in groups (and completion grades). A lot of the grading is done by the TA. As long as you keep up with the material, you can do well in the class. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-20T16:18:19Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "I am not learning anything in this class. They just flood you with pointless assignment after pointless assignment. It's also screwed with my mental health and made me resent one of my favorite subjects.\r\n\r\nInstead of a 1-hour exam per week, you're expected to a 20-30 hour assessment that basically forces you to redo all of the classwork you did so far, only with entirely different set-ups, if that makes sense. Then you have a massive report due that constitutes 50% of your grade during the same week the huge assessment is due. \r\n\r\n Expect to spend 8 hours a week in this class, and that's just the lecture, lab and \"discussion\". Not counting the endless work you have to do. They also pick apart your grade for the tiniest things, and every instruction is a 3-page word salad with thousands of requirements. It's also very condescending. \"Your idea must have real genetics and biochemistry to back it up... nothing from the realm of fantasy or science fiction land.\" I have seriously never seen instructions like these that insult you, confuse you and overload you at the same time. This class also demands brevity out of you despite dumping walls of text infront of you. I've seriously read an assignment 8 times back and forth for an hour and have lost 20/30 percent of the points for missing one small step. I've also made a single mistake and had that repeatedly docked from my total in the same report. I have to white-knuckle through this class and beg for my efforts to be seen.  One day you've spent 8 hours straight doing homework and the minute you look up you drop a letter grade for something that would have been a 1 or 2 pt deduction in any other class. Even in classes I have taken that grade harshly in writing, like psych and english, don't grade your writing as harshly in this class. And to what end? It's a fucking micro class. \r\n\r\nI just feel like the class expected us to be more immature than we were and simultaneously way more experienced in microbio. I have roommates in the grad school at UMD and they tell me that this class is more ridiculous than what they have to do. Whatever they're trying to do, it's really not working. \r\n\r\nIf you can wait to take this class until a prof that gives exams teaches it, do so. If you can take it at a diff college, do so. If you can put it off until your last semester so it doesn't affect your grad/med school app, do that. Do not take this as an elective no matter how much you care about the subject. Would you take Math115 as an elective? This class is seriously the same way. Do what you can to avoid this class.", "rating": 1, "expected_grade": "P", "created": "2023-03-15T03:57:12.902779Z"}, {"professor": "Erin Tran", "course": "BSCI412", "review": "Dr. Tran only ran the lab portion of 412, which counted for around half of the points in the class. She made a prelab quiz due before each session, and they were always unnecessarily tricky. I feel like I always lost points over some dumb or confusing wording. The lab protocols weren't written very well, and often just had straight up wrong directions, so it's important you really listen to your TA. I think Dr. Tran used the protocols from a previous professor, but never bothered to update them so hopefully she does in the future. \r\n\r\nThe labs themselves were usually pretty fun, and ended early most of the time. It could get monotonous with repetitive pipetting and diluting, but nothing we did was particularly complicated. The semester was divided into three projects: 1) UV mutagenesis in E. coli for phage resistance, 2) lacZ plasmid transformation and mutagenesis, and 3) P. aeruginosa transposition's effect on biofilms, motility, and lacZ. At the end of each section, we had to write a pretty lengthy project report which was always a pain. The guidelines were very clear though, she pretty much tells you exactly what you need to include in every part of the report. The grading on them was lenient, pretty much everybody got an A.", "rating": 4, "expected_grade": "A", "created": "2023-05-22T15:55:40.331843Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Loved the prof. Super understanding (gave me an extension on a big assignment just cuz I asked) Very down to earth and encourages you to use outside sources and collab with friends. You can zoom into lectures but there is participation credit via turning point questions. But you can miss 3 lectures and still get 25/25 participation points. \r\n\r\nThe lab was super fun and interesting I just got fucked with my TA, Husan T. He is an asshole and also grades way too harsh.", "rating": 5, "expected_grade": "A-", "created": "2023-05-25T02:40:49.232223Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Prof Tran is soo nice. She is so caring and welcoming. She always is available for office hours too. Her lecture style is mainly focused on participation, but its through the form of clickers. You can also attend class on zoom and participate on clickers too. As long as you turn in the weekly assignments, lab quizzes, and attend lecture either in person or online you should expect an A.", "rating": 5, "expected_grade": "A+", "created": "2023-11-02T14:26:27.235295Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "This class is very boring, the teacher gives long assessments and these assignments are ridiculous. Labs are long and never graded in person, only online assignments that don't even boost up your grade besides 0.5%. They don't care about your other classes and your mental health. I still got that A+ tho and thank you to myself.<3", "rating": 1, "expected_grade": "A+", "created": "2023-11-07T05:57:45.603722Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "literally the worst class ever. content wise, if you've taken BSCI222, BSCI330, BSCI410, or BSCI420, this class will be a piece of cake. workload wise, however, this class is absolutely RIDICULOUS. endless assignments due literally every single freaking day, so much busy work. I have not taken a class with 5 homework assignments due every single week since high school, and i'm a senior. be warned: just because the exams are online + open book does NOT mean they are easy. they are broken down into 5 individual assignments, each of which takes HOURS to complete. what's even worse is the day after the exam is due, you still have other assignments due. the labs are fun; the protocols, however, are not user friendly. they need to hire a new prep TA because they were not well prepared for some labs due to shortage of materials, culturing issues, confusions and mix ups. very bizarre and chaotic course. sorry, girl, but some of us have lives outside of this course and cannot be bothered by these dumb assignments.", "rating": 1, "expected_grade": "A", "created": "2023-11-10T14:35:00.902571Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Dr. Tran is a very helpful and kind professor. She holds office hours every week in which she is more than welcome to answer any questions you might have and she also responds to emails almost instantly. Participation points are based on clickers which you can do from Zoom. The class itself is not too difficult, but the grading is very strict. The workload is a bit heavy and for assessments, you get 6 days to do 5 assignments which could take many hours to complete, they are online + open note. Honestly, your grade depends on whether you can keep up with the assignments and how well you can understand the material and apply it to different concepts.", "rating": 4, "expected_grade": "B+", "created": "2023-12-11T20:46:59.185886Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "This class is entirely busy work and group work. Good luck if you aren't assigned a group with competent people. Your grade highly depends on your TA as well, as some are stricter with grading than others. As for the lab manual, you have to print out all of the pages prior to lab, and the protocols are very poorly written. The lectures are flipped-classroom style where the actual lectures are pre-recorded videos and the lecture time is more discussion-style. Overall this class is very time-consuming, however, I feel I have barely learned anything in the end.", "rating": 3, "expected_grade": "A", "created": "2023-12-15T03:12:44.702417Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Def a crap ton of work, a class I would not want to do again, but got the grade I wanted along with many other students", "rating": 3, "expected_grade": "A", "created": "2024-03-26T06:34:34.097666Z"}], "name": "Erin Tran", "slug": "tran_erin"}