{"courses": ["WMST298N", "WMST319E", "WMST368", "AMST203", "WGSS368", "WGSS487", "AMST101", "WGSS291", "AMST628C", "WGSS368", "WGSS487", "WMST698E", "AMST101", "WGSS378", "AMST628C", "WGSS368", "WMST698E", "WGSS378", "AMST628C", "WGSS291", "WGSS698E"], "average_rating": 4.6667, "type": "professor", "reviews": [{"professor": "Eva Hageman", "course": "WGSS291", "review": "Hageman was very nice, personable and funny. I enjoyed having her as a professor. The assignments were fun and manageable. I would recommended this professor.  ", "rating": 5, "expected_grade": "A", "created": "2022-05-23T22:26:06Z"}, {"professor": "Eva Hageman", "course": "AMST101", "review": "Took this class as a GENED and I believe that I got a lot out of it. We discuss a huge range of topics including systemic racism, accessibility, and material culture. You will do well in the class if you are in attendance, participate, and do the response papers every week (very simple, 400 word responses). There are usually weekly readings, however I was usually pressed for time and skimmed most of them or read a summary and still have a 100% in the class. I really enjoy discussing the topics in class, but a lot of students are reluctant to raise their hands and participate. She also provides a huge amount of extra credit opportunities such as participating a lot, attending guest speakers at the university, and uploading your notes for classmates on ELMS. The midterm was a paper and the final was a group project. Overall not a difficult class and I think it discusses a lot of topics that are very prevalent today.", "rating": 5, "expected_grade": "A+", "created": "2023-05-10T00:22:31.419632Z"}, {"professor": "Eva Hageman", "course": "AMST101", "review": "Professor Hageman isn't too bad. The class isn't that difficult, it's a standard Gen Ed. The only thing I'd point out is that she's a little unspecific when it comes to rubrics and such. Other than that, she's a good professor.", "rating": 4, "expected_grade": "B+", "created": "2023-05-28T21:02:26.356351Z"}], "name": "Eva Hageman", "slug": "hageman"}