{"courses": ["CMSC320", "DATA200", "DATA320", "CMSC320", "DATA200", "DATA320", "CMSC320", "DATA200", "DATA320"], "average_rating": 4.1304, "type": "professor", "reviews": [{"professor": "Fardina Alam", "course": "CMSC320", "review": "Terrible professor. Inconsistent exam, terrible lecture style. Throughout the exam she had to make multiple corrections and some of the questions weren't related to course material.", "rating": 1, "expected_grade": "", "created": "2023-10-11T21:39:03.012619Z"}, {"professor": "Fardina Alam", "course": null, "review": "It's just a messy and confusing class. She is often 5-10min late (and will hold us late), talks through exams, and homework is vague/subjective and is graded harshly. Our first exam had a very confusing format. Short answer questions switched from the answers being a/b/c/d to I/II/III/IV halfway through. Questions looked like short answer until you turned to the next page-- surprise! It's multiple choice. The exam was also 10 pages long for a 50min class. She also seems to have a bit of an attitude by default-- told us mid exam that if we miss an exam, we need to tell her ahead of time, otherwise we'd lose points... this was DURING the exam, when everyone was rushing to finish, because the exam was so long. She also often glosses over student concerns when they are brought up in class. The class shouldn't be hard or confusing at all-- but it is somehow.", "rating": 1, "expected_grade": "A-", "created": "2023-10-15T22:21:03.590782Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "Fardina is amazing, the problem is me", "rating": 5, "expected_grade": "XF", "created": "2023-11-13T20:49:17.516883Z"}, {"professor": "Fardina Alam", "course": null, "review": "Awful professor. I understand she is new, but it feels as if she's rubbing her intelligence in our face when she teaches. In face, it doesn't feel like she's even teaching. She shoves down content she doesn't explain well down our throat without giving adequate examples and really going over them. She has a lot of work to do", "rating": 1, "expected_grade": "A", "created": "2023-11-14T01:40:14.665274Z"}, {"professor": "Fardina Alam", "course": null, "review": "Very messy and inconsistent. Lectures are unordered and unclear. She is extremely new to teaching and assumes all her students knows the 'basics' when we clearly do not. She makes assumptions about her students/class which are blatantly wrong. Her first exam was horribly written and most of the questions were ambiguous. The TAs are on a power trip. She is hard to understand because of her accent and her English grammar is not great, making hw questions hard to understand. Would suggest to all that are reading to avoid this professor as she will make 320 (a CS elective) harder than the main classes, like bruh. Will say the projects/hws aren't crazy bad though.", "rating": 1, "expected_grade": "A", "created": "2023-11-14T01:47:29.253535Z"}, {"professor": "Fardina Alam", "course": null, "review": "Course has been fine so far, she seems nice and makes detailed slides you can study from. First exam was a bit of a time crunch but the content itself was easy if you understood what was on the study guide and the average ended up being pretty high.", "rating": 4, "expected_grade": "A-", "created": "2023-11-14T02:23:53.512290Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "It is her first time teaching the course, so there were some hiccups, but Fardina is very receptive to student concerns and the course has generally been smooth", "rating": 5, "expected_grade": "A-", "created": "2023-11-19T11:15:11.517969Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "Fardina is really great! Her slides are amazing and thorough, and you can tell she puts in effort into the class and material. She's kind and responds well to student feedback, and is responsive on Piazza and email. Her lectures can feel a bit rushed/confusing at times, but I think it's because this is her first time teaching the course and she's new. It didn't help that Max's previous exams are kind of chaotic too so we didn't really have anything to base content off of. But give her time and she has potential to become a favorite :) She's also really knowledgeable in data science!", "rating": 5, "expected_grade": "", "created": "2023-11-28T04:04:42.187238Z"}, {"professor": "Fardina Alam", "course": null, "review": "Although Fardina is new, she is really nice and tries to listen to students concerns. She is co-teaching for the first time, so seems like sometimes she cant make decisions independently. Our last midterm went really well; she mentioned that she took control of the exam paper. I am sure, with time, she will do an even better job.", "rating": 5, "expected_grade": "", "created": "2023-11-28T21:33:53.325173Z"}, {"professor": "Fardina Alam", "course": null, "review": "Awesome class! Fardina is nice, and I am enjoying her ML lectures more than the introductory ones. As a first-timer teaching this class, it has been pretty smooth overall. Honestly, it's been a pretty good experience so far.", "rating": 5, "expected_grade": "A", "created": "2023-11-30T20:02:49.130921Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "A super genuine person! Fardina always puts effort into understanding the students. Her slides reflect her sincerity in class (you can compare them with slides from other sections). She's active on Piazza. The question on Mid-Exam 02 was pretty fair, but honestly, I liked both questions. Our exam average for both midterms is far higher than that of the Max section. I wish her good luck!", "rating": 5, "expected_grade": "A", "created": "2023-12-05T20:21:13.687091Z"}, {"professor": "Fardina Alam", "course": null, "review": "dr. fardina is great. she goes through everything in class, and her exams and assignments are extremely fair! she also has a great subtle sense of humor -- her slides are sometimes funny (she'll put in relatable stuff and/or memes if you go through them). she's also very kind and responds promptly to piazza posts and emails.", "rating": 5, "expected_grade": "", "created": "2023-12-07T02:06:02.678962Z"}, {"professor": "Fardina Alam", "course": null, "review": "She is an outstanding professor due to how much of a girlboss she is.", "rating": 5, "expected_grade": "B", "created": "2023-12-11T15:38:10.688615Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "Her slides are detailed and reflective of the exam content. She is also very nice and takes student concerns into consideration.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T17:00:53.383487Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "Slides are informative, course content is easy. It's her first time teaching but she did very well aside from a few minor lecturing issues at the beginning of the year.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T02:11:47.974414Z"}, {"professor": "Fardina Alam", "course": null, "review": "The class is fine and it definitely falls on the more easygoing of courses, but I wouldn't take her course if you don't feel you have a significant amount of time to study for her exams. She and Max won't put out proper reviews and the exams can span a very wide range of content, making you feel like you have to spend copious amounts of time studying for the exams to catch all the details of what you need to know. She puts out a sheet of all the topics that will be on there but it can be lengthy and span a lot of equations and topics. Just be prepared to spend a lot of time studying so you feel secure before the exams.\r\n\r\nIf it's any consolation, the slides do a great job of teaching the content though and reading through them along with reviewing repeatedly has worked well in my experience.", "rating": 4, "expected_grade": "B", "created": "2023-12-15T04:49:32.510164Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "OMEGA STRAT TO GET AN A IN CLASS:\r\n\r\n- DONT GO TO CLASS\r\n- DO HW (start like a week in advance lowkey)\r\n- A WEEK BEFORE EXAMS READ REVIEW SHEET (OMEGA GRAIL)\r\n- SLIDES ARE SO CLUTCHHHHHHHHHH, W PROF\r\n- TAKE EXAM (hella fair fr fr)\r\n- PRAY", "rating": 5, "expected_grade": "A", "created": "2023-12-15T23:25:11.426711Z"}, {"professor": "Fardina Alam", "course": null, "review": "This was Fardina's first semester teaching, and I personally think she did a really good job. She is really nice and understanding to your concerns, and is also very responsive on Piazza. The syllabus and overall course were fair – you had a good idea of what to expect and our exams/homeworks reflected what we had learned in class. Her slides were also very useful since they basically gave you all the information you needed for the class, and she recorded most of her lectures I believe.\r\n\r\nSome negative reviews were complaining about the exams and the organization of the class, but it isn't her fault. The exams were lengthy, but definitely reasonable and honestly pretty easy if you just read through her study guide she posts on Piazza. The class was co-taught with Max, so I wouldn't say the structure of the class being so messy was her fault, but rather a mix of both.", "rating": 5, "expected_grade": "A", "created": "2023-12-16T04:23:13.429467Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "very chill professor. As a first time professor, she taught lectures well, very flexible if you have valid reasons. Most importantly, exams were very fair. Projects/homeworks were not too bad either.", "rating": 5, "expected_grade": "A", "created": "2023-12-16T06:39:47.879657Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "Easy, final had an average of 97.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T05:58:08.056205Z"}, {"professor": "Fardina Alam", "course": null, "review": "Great lecturer for 320, very nice and understanding. Homeworks and Exams were not hard at all.", "rating": 4, "expected_grade": "A-", "created": "2023-12-24T03:44:03.608444Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "She's a super nice professor who's very fair in her homework and exams.", "rating": 5, "expected_grade": "A", "created": "2023-12-28T16:48:48.906302Z"}, {"professor": "Fardina Alam", "course": null, "review": "The scope of the assignments was good and only a little bit of googling was needed if you kept up with lectures. The exams were very easy if you knew the material, and there were no trick questions. One thing I would like if I had to take this class with her again would be to know more about the homeworks in advance, but considering this was her first time teaching at UMD and CMSC320 gets changed up often, thats normal.  I think she could work on the lectures being a little more engaging, but her slides are great and she asks for questions often to make sure everybody is following along.", "rating": 4, "expected_grade": "A", "created": "2024-01-21T20:06:36.758813Z"}], "name": "Fardina Alam", "slug": "alam"}