{"courses": ["CMSC122", "CMSC131", "CMSC132", "CMSC131H", "CMSC250", "CMSC131", "CMSC132", "CMSC131", "CMSC131", "CMSC132", "CMSC250"], "average_rating": 4.2247, "type": "professor", "reviews": [{"professor": "Fawzi Emad", "course": "CMSC131", "review": "BEST PROFESSOR FOR CS! He is so funny and passionate about the topic. \r\nHowever the class is really hard, especially for people who have never coded before, like me. I struggled a lot in this class. You need to dedicate a lot of time to understanding the material. Class is hard but Fawzi is awesome!! ", "rating": 5, "expected_grade": "C", "created": "2016-05-12T12:22:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC250", "review": "Best professor in the Computer Science Department, and I don't think it can even be debated. I've taken him with both 131 and 250. \n\r\nFawzi teaches every course with a genuine interest and enthusiasm that just makes you want to learn and grasp every concept. His ability to teach with clarity is absolutely amazing. In addition, he's always there to help if you have any difficulties with the material. \n\r\nHis quizzes, homeworks, and exams are incredibly fair and with a good amount of studying, doing well in the class shouldn't be an issue. CMSC250 is traditionally known as one of the weedout courses, but with Fawzi it never seemed like one.\n\r\nIf you ever get a chance to decide between Fawzi and another professor, you pick Fawzi, end of discussion. ", "rating": 5, "expected_grade": "B", "created": "2015-05-19T09:15:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC250", "review": "Fawzi is the best teacher I have had at UMD, if not the best teacher I've ever had. He knows the material very well, is actively interested in it, and loves to spark interest in others.\r\nHis tests are not necessarily easy, but they are a very fair reflection of the course.\r\nThe best part about Fawzi, though, is that he's just a really cool guy. He has a great balance of nerdy, intellectual habits and a perfectly normal personality. He's the type of person you'd want to have as an uncle. ", "rating": 5, "expected_grade": "A", "created": "2015-05-15T12:08:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC250", "review": "Fawzi was a really fun and engaging professor for 250. Although the material in the class is fairly difficult, he manages to make the material fun and engaging sometimes. He's actually funny, which is another plus since his jokes will probably wake up the class if they ever decided to doze off. Tests were pretty fair too, sticking to questions that were on quizzes. The homework assignments were challenging, but at the same time doable. Overall a great class for me, and I definitely would take Fawzi again if I could.", "rating": 5, "expected_grade": "A", "created": "2015-05-06T10:10:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Amazing professor. Makes the material very interesting and got me involved in computer science. I am a business major and he was so good I started coding in my free time!\r\nSome people had trouble with certain parts of the class, but that was not his fault, but a function of the material.\r\nBottom line: Take Fawzi for anything he teaches. He is the man.", "rating": 5, "expected_grade": "A+", "created": "2015-01-21T12:51:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Fawzi is a FANTASTIC professor! I entered 122 with absolutely zero knowledge or experience in the subject, and by the end he had me switching my major!  He is exciting in class, extremely fair in his tests, helpful in assigned projects, and if you go to lectures he makes the material incredibly easy and understandable! With computer science, part of it will always be a natural aptness to computers and thinking in code that not everyone has.  However, for beginners and non comp sci majors, Fawzi is more than ready to help and always willing to repeat ideas.  If you are ever stuck, I've never been to a more productive office hours!", "rating": 5, "expected_grade": "A", "created": "2014-12-19T13:25:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi was an excellent professor for 131. He was really great at explaining the concepts and his projects were fair and fun to do. I would definitely take Fawzi if you get the chance. His class wasn't particularly easy, but if you want to learn the material and have a bit of a challenge take a class with him.", "rating": 5, "expected_grade": "A", "created": "2014-12-11T18:43:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Great instructor. His enthusiasm keeps you from falling asleep in his class. Projects aren't too bad, but I've never had programming experience so javascript was difficult for me. I heard he's helpful during office hours but I never went.\r\nTake this if you want comp sci experience, but not if you want an easy DSSP gen ed credit.", "rating": 5, "expected_grade": "B-", "created": "2014-05-19T21:27:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "As an freshman who is a CS Major with no prior experience in Computer Science, I can say that Fawzi Emad is an amazing professor. He keeps the class interesting while also teaching the material in an extremely clear fashion. However, if you are new to programming languages like Java, there are obstacles that you have to overcome (Don't worry, they're not to bad!). \n\r\n1. Fawzi can't review every topic with a fine tooth comb because it's only a semester-long course, therefore the rate at which new material is introduced is fast. You will have to attend pretty much every lecture if you want to be at a good pace, and you must take copious notes - Fawzi doesn't use the textbook (don't buy the textbook, it's completely useless). \n\r\n2. The projects. The first two projects are very easy and doable...however the difficulty then increases quickly. PROJECTS ARE THE MOST CRUCIAL IN GETTING A GOOD GRADE!!! The biggest problem students have with the projects is not figuring out what to do...it's actually completing the project on time. Fawzi gives you about a week and a half to do the projects, but most people wait till the last minute and their grade suffers mightily. PLEASE START YOUR PROJECTS EARLY. I CAN'T STRESS THAT ENOUGH. \n\r\nNow that I'm done addressing those who might be new to programming entirely, let me broaden my view to everyone taking the class. Fawzi's tests are perfectly fair. Not too easy, but definitely not hard as well. Study well, and you'll do fine. PAY ATTENTION TO THOSE STUDY QUESTIONS. They're the keys to a good test score. Quizes and Labs count for a small portion of your overall grade, but make sure you don't BS them. Fawzi's Final Exam was definitely tougher than both his midterms, so don't blow that off and make sure you study hard for that one. \n\r\nFawzi is a fantastic professor and I can't imagine any professor better in the CS Department who is better. ", "rating": 5, "expected_grade": "", "created": "2014-01-18T03:42:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Incredible professor. Teaches everything himself; never need to buy or look at the book (nor will it help you to). Take good notes in class; they are your only source of substantial information because truth be told, the online lecture slides (which are written by another professor anyway) are convoluted and give much extraneous information. Do not skip exams (as obvious as it sounds, it happens) or quizzes because he strictly adheres to university policy and will give you a zero. You can get by with showing up late but if you try and leave lecture early he will stop you and  make you feel terrible in front of the entire class. Start projects early (especially those toward the end of the course) since nobody can get it perfect the first time. Review the study questions he puts online, they mirror key questions on the exams.\n\r\nI came into this class a Business major with no computer programming experience whatsoever, but he goes out of his way to make sure that everyone understands the material.", "rating": 5, "expected_grade": "A+", "created": "2012-09-23T00:12:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is the best natural teacher I've ever seen in my life!  If you go to the lectures you will learn the material.  Period. He's also pretty entertaining and tries to keep things informal and low-key. If you see a few \"mixed reviews\" on sites like this, let me tell you why: Fawzi has a very low tolerance for students who are obnoxious during class. If you act like an ass during the lecture, he will shut you down!  It's pretty funny to watch. So you'll find a few negative reviews from some of those people. But trust me, Fawzi is the best instructor you could possibly get. I'll take him for any course I can.", "rating": 5, "expected_grade": "B", "created": "2012-09-21T08:42:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "This guy is brisk, jovial, relaxed, and accessible. Most lectures are teeming with material, but he somehow makes it all digestible and light. Thing is, some of the topics (like data structures) won't stick to your mind in just one lecture; so you must re-read the slides, draw memory diagrams, and then explain them to yourself until you're comfortable enough.\n\r\nThe projects are appropriate for the subject matter and most of them have their easy or advanced sections already implemented so you can focus only on the stuff you need practice on.\n\r\nQuizzes and exams are all easy as long as you go through the slides and maybe some of the example code. The discussion exercises are seldom helpful, but good for collaboration.\n\r\nI got an A+ and the class is my favorite (most informative) CS class yet.", "rating": 5, "expected_grade": "A", "created": "2012-08-30T23:15:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Fawzi was a great professor. Anyone saying he taught poorly probably just doesn't like Computer Science, not Fawzi. I don't know how you can make a computer class anymore simple or interesting. The TA's and his own office hours were extremely helpful for the projects. The tests and quizzes were straight from the lecture slides so if you go to class and then review them as study material you will get an A; the final is no exception. \n\r\nI had fun in this class and am now going to declare a Computer Science minor", "rating": 5, "expected_grade": "A", "created": "2012-07-18T12:33:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Programming is not really my thing, but Fawzi made the class more than bearable. His sense of humor and teaching style were very amusing and overall this was a great class. He grades reasonably, and the assignments were mostly pretty cool (except for one of them that drove me up a wall.) BTW, I thoght I was getting a C, but ended up with a B! Fawzi is more than fair when it comes to grades.\n\r\nSomebody else said Fawzi wasn't helpful in office hours, but that's total B.S. I don't know why that kid is so pissed off - Fawzi knows the material backwards and forwards and will go out of his way to make sure you understand it. I got a lot of help in office hours from Fawzi -- he was totally chill.", "rating": 5, "expected_grade": "B", "created": "2012-05-29T20:12:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "The class was fun!  Fawzi is truly a gifted instructor and does a great job making sure that everyone learns the material.  I met with him several times during office hours and he was very personable and helpful.  \n\r\nThe exams were very fair (actually, they were pretty easy).  The projects were reasonable, but don't start working on them at the last minute because office hours get crowded on the day the projects are due.\n\r\nThis is a course for beginners, so you don't need to know anything beforehand.  But be prepared to do some work. The projects take a good amount of time and there are frequent quizzes that you'll need to study for.\n\r\nOverall, this was a great class for me -- I learned a lot and enjoyed it quite a bit.", "rating": 5, "expected_grade": "B", "created": "2012-05-24T12:30:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "This class consisted of 2 midterms, the final, 10 quizzes, 5 programming projects, and an 8 page paper. The paper sounds bad but it's easy, basically if you do it and it's coherent, you should get an A. \n\r\nThe class is easy in the beginning, until you start talking about Javascript. However, I ended up getting an A in the class and I had no prior programming knowledge whatsoever. He tries to make lectures interesting and talk about things that could be useful and get you interested in computer programming, if you aren't already. \n\r\nThe tests have at most three questions where you have to write programs, and the rest are short answers, so he tries to help out the people who might not be good at writing programs and functions.\n\r\nGood class to take if you are willing to put in a little work for the A.", "rating": 4, "expected_grade": "A", "created": "2012-05-14T14:39:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "He doesn't care about his students.\r\nDon't take his class.\r\nHe knows his stuff, but expects his students to already know the content that he is there to teach about.\r\nWorst professor I've had at Maryland by far\n", "rating": 1, "expected_grade": "B", "created": "2012-05-01T12:49:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "I'm finishing up CMSC122 with Mr. Emad this semester.  So far (as a second semester Freshman) this is the best class I've had in college. I'm actually changing my major to Computer Science as a result of my experiences in this course. Mr. Emad's teaching style is outstanding -- he is very enthusiastic and his explanations are always logical and easy to understand. The exams were reasonable (not too long and at the right level) and the projects were decent. I'm looking forward to taking CMSC131 with Mr. Emad this summer and continuing on in the major.", "rating": 5, "expected_grade": "B", "created": "2012-04-22T20:31:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "1st: If you are a JOURNALISM MAJOR dont take this class with him.  and btw that expected grade is a C if he doesnt act like a complete douche.  He teaches 122 as if you already know coding and caters his class to people that will be majors or are trying to get into the major.  His grading is arbitrary and doesnt give you a rubric for the projects. Sketch. His grading is harsh, unforgiving and frankly unnecessary for an introductory class.  He doesnt curve, but takes off chunks of your grade for senseless things.  \n\r\nHe needs to think more about his audience, which is the key to being a good teacher.  Don't cater your class to people that already know material.  Bring everyone up or reconsider your profession\n\n", "rating": 1, "expected_grade": "C", "created": "2012-04-20T21:28:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "He is a great professor if you're smart. When I mean smart, I mean you know the material well, or pick it up while he's teaching. Everyday he comes to class he is disorganized but is a decent professor. He spends at least five mins per slide complaining about how the slides are wrong or not how he would have done it. The same with the coding examples you see on the CVS. He ASSUMES you remember almost everything from 131 but many friends of mine that tested or AP'ed (not sure how to say it) out of 131 have told me how much 132 sucks because he assumes you know more than you actually do. He is very meticulous with his grading and excessively strict. He is notorious for not curving the class so don't expect it. He curved for our first midterm (we had two) because the average was like a 65% percent. He told us that the exam was going to be easy, however many people didn't finish.\n\r\nHe's not for the average b student because he caters to the smarter crowd. Try to talk to him in person and tell me he isn't an self absorbed asshole. He invites questions but will sometimes ignore simple questions he assumes we should already know. He is rude and even if the TA's agree with you that one of his exam questions are unfair he will debate it to no end until you give up and realize it's impossible to convince him otherwise.\n\r\nDon't get me wrong, he's not a bad professor and I would even recommend taking him as a professor. I just think he's an asshole.\n\r\nRemember, he caters to the smart.He's a decent, but not the best, professor. The only reason I had an 85% was cause I know how to program decently even though I failed one exam. \n\r\nHe's good in the sense that he expects alot from you and in turn you work harder because he doesn't curve. He's tough but not horrible.", "rating": 2, "expected_grade": "B", "created": "2012-02-20T03:09:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "I enjoyed this class a lot from the academic perspective. I have seen him cut students short as is being argued below, but he needs to do so to teach all of the material, and when he does realize he had not heard someone's idea or question through that he should have, he will immediately apologize. He is confident but he does not devalue his student's ideas. In fact he encourages it, and I am confused by comments to the contrary.\n\r\nI may be biased since I had few difficulties understanding the actual material; however, I am new to programming, and did do a lot of work outside the class to keep my grade up and be able to ask suitable questions. Some students asked questions that they should ask during office hours. I have taken advantage of this in the past and he is very thorough at explaining things as long as other students' time is not being completely wasted.", "rating": 5, "expected_grade": "B", "created": "2012-01-22T18:00:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi rocks!  The reviews by the angry student below do not represent my views at all. Fawzi's lectures are thorough and clear, his exams are fair, and he has a great sense of humor.  I actually looked forward to going to his lectures! In office hours he isn't going to debug your code for you, but he'll give you enough hints to get you going if you're stuck.  I thought his exam reviews were extremely helpful -- he went over everything that we asked him to in great detail. The exams looked exactly like what he had prepared us for.  He really seems to care about teaching and I'll take any class with him that I can.", "rating": 5, "expected_grade": "A", "created": "2012-01-16T19:04:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "The guy is awful and you are not a great programmer.  Everyone who has not gone to his office, loves him.  Everyone who has seen him personally, thinks he is a world class douche.  I will admit, I am spiteful now because he gave me a D for being less than a point away from a 70 (did bad on the final, was doing well until I took it).  I asked him for something, anything to make up the small difference and not screw me for the next year, but he said it wasn't his problem and that was all.  If you are a natural programmer, take him.  If you need someone who is kind and willing to be nice behind the scenes as well, take ANYONE else.  I have found Golub, Nadua-Perez, Plane,much more approachable.  Fawzi really is a jerk if you are a guy who is a below average programmer.", "rating": 2, "expected_grade": "D", "created": "2011-12-17T23:09:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi was a great professor. He explained all the course material in a way that was easy to understand and retain. I took AP Comp Sci in high school and had no problem in this class. Those who dislike Fawzi must have either skipped class often or are not cut out to be Computer Scientists.", "rating": 5, "expected_grade": "A", "created": "2011-12-16T15:14:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi Emad is a good professor in the things that he does. However, he is not willing to adapt his style for students who do not learn from his particular style of teaching. He expects you to come to every class, and will tell you what to expect on exams and such only in class (he also teaches using slides).\n\r\n This is not unreasonable; however, for people who learn best by doing and have a hard time following lectures, this can be a problem. On the first midterm, there was a big portion of the grade that was not tested via a project beforehand which can be very problematic for kinesthetic learners.\n\r\nHe also does not offer review problems, or even a sheet listing things to study.\r\nHowever, it should be noted that if you attend class, keep track of the general topics discussed, and take very brief notes, then go back and study slides before the exam, you can do very well. You MUST do these things to succeed, because Fawzi will often test on things that he mentioned once in class that are just historical facts and you won't find in the materials.\n\r\nAlso, pay attention to what appears on quizzes, because it is likely to reappear on exams.\n\r\nBasically, I would say that if you know yourself to be a kinesthetic learner, avoid his class because it will be a struggle to go by his style of teaching, but it is possible to do well with some work outside your normal way of learning.", "rating": 3, "expected_grade": "B", "created": "2011-11-28T17:36:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is an excellent professor.  Explains the material really nicely and keeps the lectures interesting.\n\r\nDefinitely disagree with the idea of him not caring about his students.  He takes time to answer all questions in class and is very thorough in doing so.  The idea of him not caring about his students is quite far from what it seems like in my class at least.", "rating": 5, "expected_grade": "", "created": "2011-09-14T18:35:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "I also disagree with the person two/three posts below...  I had Fawzi for both 131 and 132.  I can assure you that he always went out of his way to help us learn the material.  His classes are actually FUN and he is always upbeat and energetic.", "rating": 5, "expected_grade": "A", "created": "2011-09-12T00:10:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "I disagree with the person one below me. Fawzi is a really nice guy, and he does care about students. You'll find that out if you go to his office for help. \r\nHe is definitely one of the best teachers in the CS department if not the best. Teaching people how to program isn't an easy task, and no one does it better than Fawzi. If you've never programmed before you'll have a hard time while taking cmsc131. It's because learning how to program for the first time is really hard, and you'll have to work extra hard in that class. He'll make sure that you learn all the material needed. He doesn't always write the exams, but he'll look at the exams and make sure there isn't anything that he didn't cover. When I took 131, he was running the class, and he wrote the exams, and the exams were very reasonable. On the other hand 132 was run by Nelson, and the exams weren't that great, but still fair.\r\nYes, CMSC389C (C++) didn't go that well, since it was the first time the class was being offered, and Fawzi tried to cover too much stuff in 3 weeks, which didn't work out so well. Fawzi hates curving, but he ended up doing a 10% curve in that class. Fawzi cares about his students, and he'll definitely straighten out that class the next time he takes it.\r\nFawzi has recently started to teach from slides, since he has some physical issues from writing on the blackboard for a long time, and his doctor told him not to write on blackboard. This is kind of unfortunate.\r\nHe is not like one of those dorky CS professors, he's a very fun guy.\r\nOn response to the reviewer one below me. Fawzi is a human being. He'll only get angry when there's a very good reason to be angry. One time a student was asking Fawzi if he could gchat with him over the weekend if he has any questions!!! You expect your professor to sit in front of his computer all weekend so that he can answer students' questions! Now who wouldn't get angry at that?\r\nI took 4 classes with Fawzi. And I would never take a class with anyone else if Fawzi's teaching it.", "rating": 5, "expected_grade": "", "created": "2011-06-12T13:18:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Let me begin by saying that CMSC122 is probably one of the most demanding CORE classes out there, and you should take it only if you're willing to LEARN something (not a class where you can beat around the bush and get an A). With that said, Dr. Emad makes the rigorous challenge of learning a programming language for the first time insanely fun. He's a great guy, and overall a professor that can actually TEACH. I usually suck at programming, but because of his guidance, I can actually program independently now. You will have to work your tail off in his class, but trust me, in the end it's the most accomplished feeling you'll ever have. Wish I actually majored in Compsci now, since he made everything seem so interesting! ", "rating": 5, "expected_grade": "A", "created": "2011-05-16T13:41:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Okay. I had this guy for 131 and 132. He's probably one of the better teachers in the department. He's a decent teacher. Not incredible. He is good at conveying the information, and you will learn the material pretty well. However, there are a few majors problems.\r\nFirst off, I don't think he cares much about his students. He is really into himself, and if you get in his way he will stomp you into the ground. Yes, he will teach you what you need to know, but he makes it fairly obvious that he doesn't care much about the students, but more about the fact that his boss wants him to teach in a certain way. Everything usually needs to go the way that he wants it, otherwise he will get angry.\r\nA big problem with his grading and tests is that he stresses trivial stupid points that don't have much to do with the class. Some of the tests will have not much concepts, but some stupid esoteric stuff about Java that does not really matter.\r\nAnother big problem was that he used lecture slides made by the department that he didn't like. He was always commenting on how the slides were wrong and stupid. Well, if he didn't like them, then he should make his own.\n\r\nHe's a little bit rude as well when it comes to dealing with students, and helps very little with actual exam preparation in the weeks before the final.\r\nOverall, 131 and 132 aren't too bad. The projects take some time, but if you work hard you can get an A. You should probably take this guy over some of the other 131/2 professors, but you should know what to expect. He just isn't as great as everyone says he is.\n\r\nBy the way, I'm not one of those students who happened to have a bad encounter with Fawzi or anything. I did fine in the class and didn't have any personal issues with him. I'm just telling you what you need to know about this guy.\n", "rating": 2, "expected_grade": "A", "created": "2011-05-14T13:46:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Very friendly and approachable person. Clearly passionate and knowledgeable. Unfortunately, he has apparently injured his clavicle from years of writing on the board, so he gave lectures from a PowerPoint. He seemed a little out of his comfort zone.\n\r\nNonetheless, great professor. If you know nothing of HTML, CSS, or Javascript he'll make sure you do by the end of the class! Always has office hours and always willing and able to address any concerns.", "rating": 5, "expected_grade": "", "created": "2011-04-25T19:34:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC250", "review": "Fawzi was a great teacher. Fawzi sets his expectations at a reasonable level and then expects you to meet them, unlike many teachers that expect WAY too much and then curve. Curves always seem to add more stress to the class than necessary.\n\r\nFawzi always did a good job conveying his thoughts, and was also good at coming up with multiple ways to explain the same concept for people who were struggling.\n\r\nFair exams too. Don't expect much of a curve, but you shouldn't need it since he's fair.", "rating": 5, "expected_grade": "A+", "created": "2011-03-21T00:37:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi is an excellent professor. I went into his class not having any programming experience and I came out with a great foundation in Java.  He really enjoys teaching, so his enthusiasm made the class fun and interesting.  His grading is very fair and he is very helpful and personable.", "rating": 5, "expected_grade": "", "created": "2011-02-07T09:38:00Z"}, {"professor": "Fawzi Emad", "course": null, "review": "I had Fawzi for both CMSC131 and CMSC132, and got A's in both classes, although both of my A's were very challenging and I worked hard to make sure I did well. If you are reading this page for 131 or 132, please take Fawzi's class. However, for an upper level class (meaning 250, 351, or in my experience 389C winter class) please do not take Fawzi unless it is necessary. He taught CMSC389C for the first time and threw so much material and difficult concepts at us in a 3 week winter class (without a TA or office hours), that half the class didn't finish the final project, and since the final project was so difficult and right at the time of the final exam (who gives a final exam for winter class?), the class average was horrendous as well. He was reluctant to curve, and even then it didn't make up for an extremely difficult class with very little allowance for people with no knowledge of C++. Hopefully he improves it in the future, but please take Nelson's winter class or someone else's class, trust me, you'll be better off.", "rating": 3, "expected_grade": "B", "created": "2011-02-04T04:15:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Excellent teacher, obviously I'm not the only one with this opinion looking at others people's appraisals. He knows java in and out, explains everything you need to know about the upcoming projects and he's just a likable person. His great personality makes the class bearable. If you have to take CMSC131, try to take it with Fawzi.", "rating": 5, "expected_grade": "B", "created": "2010-11-19T19:50:00Z"}, {"professor": "Fawzi Emad", "course": null, "review": "Fantastic. Explains concepts very well, with very good examples, is helpful at office hours, and very friendly and approachable. Not an easy A, but you will learn lots.", "rating": 5, "expected_grade": "A", "created": "2010-09-01T11:44:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC132H", "review": "Fawzi is a great guy. Really nice and respectful to students and he understands students very well. He is very funny too and an interesting teacher. He will often start the class saying \"What the hell am I doing right now?\" or something like that because he will chat with students almost to the point that he forgets he has to teach. But don't worry, you will always get through all the material for the day and you will understand it well enough. Biggest recommendation: start the projects early. You will be amazed at how good you feel and the stuff you can do when you've already finished your CS project early.", "rating": 5, "expected_grade": "A", "created": "2009-05-14T22:00:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Awesome professor. Makes sense of difficult concepts. Students of other professors always come in and sit in on his lecture because he is always a better teacher. \r\nHis exams are really easy also. He gives 2 mid terms and one final, about 8 quizzes, and 8 projects. ", "rating": 5, "expected_grade": "A+", "created": "2009-01-02T16:45:00Z"}, {"professor": "Fawzi Emad", "course": null, "review": "Fawzi is an excellent teacher. He won the teacher of the year award at the University of Maryland in 2006 and after taking his course I can definitely say he deserves this. Fawzi is one of the most helpful, interesting, and knowledgeable teachers at the University. If you get him as your teacher you will be very lucky because his teaching methods are exceptional and you will learn a lot. He is not an easy professor though and many of his tasks are quite challenging, but he does value hard work and effort. Fawzi deserves the  6 golden stars!!", "rating": 5, "expected_grade": "A", "created": "2008-12-21T02:19:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "He is a great teacher, he is fun to listen to, he has a great way of making difficult concepts easy to understand, and he is quite approachable. Very nice.", "rating": 5, "expected_grade": "", "created": "2008-11-07T12:15:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Not all professors are great communicators; Fawzi exceeded my expectations, providing excellent information in easily understood terms. Fawzi's classes had a good energy, making it easy to ask questions and get clear, concise answers.", "rating": 5, "expected_grade": "", "created": "2008-09-05T23:33:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "I dropped this class. he caters to those who already know the programming language. yes, he has a good personality, but if you don't know the material to begin with, expect to fail. not my fave.", "rating": 1, "expected_grade": "", "created": "2008-08-31T12:19:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi really is a excellent teacher, definitely one of the best at UMD. He explains everything extremely well, providing concrete examples along with easy-to-understand explanations of the material. I didn't have to buy anything for the class (books), just go to class and you will get a good grade, which is easy because the class is very enjoyable. If you can, definitely take a class with Fawzi.", "rating": 5, "expected_grade": "", "created": "2008-08-06T11:16:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Had him for 131 and he is damn good. One of the best profs in the CS department.\n\r\nHowever, there is a downside, in that if you don't know some level of programming before walking in, you will have trouble. This is partially because Fawzi does not curve extra to cope with kids who know code inside out and still take the class.\n\r\nAs his GPA spreads say, he is a tough professor, and curves pretty minimally, but in the end, he is a solid teacher. Regardless of the grade you get, you will know the material to a good extent.", "rating": 5, "expected_grade": "A", "created": "2008-05-12T19:22:00Z"}, {"professor": "Fawzi Emad", "course": null, "review": "Fawzi is one of the greatest professors I have ever had.  He's the most friendly guy in the world and explains everything with great clarity.\n\r\nClass was never boring and, unlike some other CMSC classes, he backed up all his notes with actual code and showed us how it all worked.\n\r\nFantastic.", "rating": 5, "expected_grade": "A", "created": "2008-04-11T17:26:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "the best professor Ive ever had in all of my educational experience. Very approachable, very cool, very nice. Ver good person, i wish he taught all my cmsc courses. ", "rating": 5, "expected_grade": "", "created": "2008-02-29T01:01:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Probably the best teacher I have ever had in college. Don't bother buying the textbook; just go to his lectures and you'll learn everything you need to. He's very friendly and approachable outside of class and will always try his best to help students out. He is pretty fair when it comes to tests, quizzes and projects - you will be challenged, but you will also learn a lot from him as long as you study.", "rating": 5, "expected_grade": "B", "created": "2007-12-12T22:54:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi is a great professor, he's incredibly approachable and he'll help you with any problems you're having. His class wasn't a walk in the park but it also wasn't made any more difficult than it had to be. Fawzi's exams were fair and he taught you what was necessary to understand the material you were expected to know. \r\nOne problem was that the book required for 131 was not even mentioned once by Fawzi, I assume the only reason it's required was for the other professor's lecture and sections. Make sure that the text is going to be used before you buy it for this class. \r\nAlso, Fawzi is a computer science advisor for non-freshmen, and he's really nice if you come in wanting to get advice about classes. He's just generally a cool guy.", "rating": 5, "expected_grade": "B-", "created": "2007-11-29T05:23:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Excellent professor, one of my favorites.  His lectures are interesting and he's a fun guy.  He does an excellent job explaining material and caters to the beginners in the class.  Will definitely be looking for him teaching other courses I need to take.", "rating": 5, "expected_grade": "", "created": "2007-11-08T01:21:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "I took a class with Fawzi a few semesters ago, and he is still the best professor I've had. This was the first comp sci class I took at UMD, and he went into great detail about all subjects, while still keeping the class interesting. I went to just about every class (something I never do now) because I knew I'd learn a lot and have a fun time. Great guy, great teacher...if you have the option, take a class with him", "rating": 5, "expected_grade": "", "created": "2007-11-06T18:26:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi's way of explaining the material really makes it stick. I'm not sure what it is. He just makes you see why a concept is useful or why it matters and the explains it in a logical manner. Everything just clicks. ", "rating": 5, "expected_grade": "", "created": "2018-05-11T00:37:43Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "This guy is both hilarious and very passionate about teaching. My favourite teacher so far! Take him whenever you can", "rating": 5, "expected_grade": "B+", "created": "2018-05-11T05:00:02Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Excellent lecturer! This was my favorite class to go to. The projects are interesting the exams were not too bad. Take that with a grain of salt since I have programmed before. He posts weekly study questions and those are the guide to acing the exams. ", "rating": 5, "expected_grade": "A+", "created": "2018-05-17T22:29:58Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fantastic professor, he is very engaging and pretty funny. The course (CMSC131) covers a lot of ground, so things move very fast-paced, but Fawzi does a great job covering everything. Study Questions are great for exam preparation (but not sufficient alone). Projects are not too difficult but become increasingly more time-consuming as the semester progresses, thus starting early is a good idea. Exams are very fair, not too difficult, not too easy. Things that are passed by in lecture may show up on the exam, so it is a good idea to make it to every lecture and take detailed notes. Definitely practice writing chunks of code on paper if you are not used to it, those are usually the most difficult portions of the exams and you won't have a lot of time to think of how to go about the problem, so it's important to know your approach immediately. Do the labs, the code that you have to write in those often resemble the code problems on the exams. Fawzi is superb at explaining abstract concepts and their practicality. The class is not an \"easy A\", but if you put in the work then you should be fine and will certainly learn a lot. The man is good at his job.", "rating": 5, "expected_grade": "", "created": "2018-11-20T22:16:52Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "One of the best computer science instructors I have ever had. He is extremely organized, and is great at explaining new topics in lecture. He is enthusiastic when teaching and wants to see you succeed. I would prioritize signing up for his class over anyone else. ", "rating": 5, "expected_grade": "A", "created": "2018-12-13T03:33:18Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi is a good lecturer, has good explanations. He is sometimes rude to students, specifically women, in lecture and in office hours.", "rating": 2, "expected_grade": "A+", "created": "2018-12-13T20:43:24Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Everything I want to say has already been said by all the 5-star ratings of Fawzi Emad! This man is an enthusiastic, organized, well-spoken professor who is passionate about whatever he teaches. Of course, if you don't put effort into reviewing concepts and doing the CS projects early, your grade will reflect that. \r\n\r\nI liked his teaching style. Very straightforward and to the point, plus his humor to enhance the learning environment. Fawzi is surely the way to go when deciding which professor to learn from! In fact, I'm taking him again for CMSC132 and CMSC250 this semester :)", "rating": 5, "expected_grade": "B+", "created": "2019-01-21T16:44:27Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is a solid lecturer. He explains concepts extremely well and is generally very articulate and well-spoken. \r\nHowever that being said, his quizzes for CMSC132 are unnecessarily difficult and he's often rude and condescending if you approach him at office hours. ", "rating": 3, "expected_grade": "B+", "created": "2019-04-17T13:27:18Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "This review gives 2 stars for his 132. (For his 250, it will be 4 stars.)\r\nI take his 132 after reading reviews of his 131 here, and realize that his 132 is pretty hard. He delivers content a bit fast in class, while the materials he provides on the website are not good enough to study for quizzes and exams. His quiz drives me mad. If you take his 132, you'd better take notes carefully and make sure everything is covered.\r\nOn the other hand, I recommend his 250, it's much easier than his 132, cool and relaxing. \r\nBy the way, he's really strict, just don't miss any assignment. I feel like he's not quite approachable.", "rating": 2, "expected_grade": "", "created": "2019-04-22T00:40:21Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "I had Fawzi for CMSC131 and CMSC132.\r\n\r\nPros: He is a really good lecturer that keeps students engaged and makes normally hard material easy to understand via great analogies, detailed examples, and in-class demonstrations.\r\n\r\nCons: Beware of pop quizzes. Also, there are instances of him giving difficult projects. Additionally, in his office hours, he tends to be a bit more condescending that what his lecturing style implies.\r\n\r\nOverall, my experience in his class has been a positive one. You will definitely learn a lot from him. However, be prepared to put in a lot of work every day.", "rating": 4, "expected_grade": "B", "created": "2019-05-28T01:56:12Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Yes, he's a good lecturer. He was horrible for 132 regardless. Incessant pop quizzes. Rude during office hours. Unfair exams. I've heard only good thing for his 131 class but don't drink the Kool-Aid: Fawzi isn't all that. ", "rating": 2, "expected_grade": "A-", "created": "2019-06-01T22:20:28Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "132 with him was drastically different from 131. Pop quizzes were really difficult and he was kind of a douchebag in office hours.", "rating": 1, "expected_grade": "B", "created": "2019-06-16T06:45:24Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Great Lecturer", "rating": 5, "expected_grade": "B", "created": "2019-08-06T04:17:45Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Trust these reviews. Fawzi knows how to teach CS to beginners unlike any other professor in the department. I came in with absolutely no knowledge of Java and got an A+. By no means is his 131 class easy, conversely it is actually very difficult. I am a business major adding CS and this was definitely the hardest class I've ever taken. You need to work really hard and study literally every day to do well in this course. Fawzi is an astounding lecturer and if you sit in the front, ask questions, and take notes on everything he says, you can do well. Fawzi is miles better than any other professor (including Nelson/Pedram) for CMSC131. Take  him!", "rating": 5, "expected_grade": "A+", "created": "2019-08-11T14:06:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi is pretty overrated. Maybe it's just me since everyone else seems to love him, but he was under-prepared for class almost every single lecture. Maybe its because I was his first class of the day, not entirely sure, but he'd frequently forget about slides or not have materials ready. His lecturing style was alright, but nowhere near as phenomenal as people make it out to be.", "rating": 3, "expected_grade": "", "created": "2019-08-15T06:01:04Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "I had Fawzi for both CMSC 131 and 132. I felt that his class for 131 was far better planned and overall the projects and exams were fair. However, for 132 his quizzes were a disaster, his teaching got more confusing, and whenever students approached him in office hours he was extremely rude. Honestly the most overhyped CS professor at UMD ", "rating": 2, "expected_grade": "", "created": "2019-08-19T20:59:25Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi is AMAZING! I don't see how anybody could give him a negative review. He is a true professional who loves teaching and cares deeply about his students. He's the best natural \"teacher\" I've ever had (including college and high school). The lectures were informative and held my attention the whole time. He was also very helpful and encouraging to me during office hours.  I wish I could take another class with Fawzi!", "rating": 5, "expected_grade": "A-", "created": "2019-11-16T22:58:06Z"}, {"professor": "Fawzi Emad", "course": "CMSC250", "review": "Fawzi is an amazing proffesor, one of the best in CMSC. He makes topics that could be really hard as easy as possible. Homework always fits well with the exams. Warning that he has a dry sense of humor so if you're not prepared for it you might think he's making fun of you. Hilarious and cares about his students.", "rating": 5, "expected_grade": "A", "created": "2019-11-27T20:28:01Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "I was worried taking this class with basically no cs experience, but fawzi definitely made everything feel doable. His lectures are great and because of the way his slides are made, you HAVE to attend every lecture if you don’t have a strong background. His quizzes are also very easy but he doesn’t drop so you have to make sure you go to every lecture and consistently stay up to date with his study questions. The two midterms are almost entirely straightforward questions and are very simple to study for by looking at past quizzes/study questions. The projects are easy A’s if you start them the day you’re assigned, which I made a habit.\r\n\r\nOverall, this class was the most time consuming class I’ve had so far, but also one where I learned the most. I definitely recommend taking fawzi, as I believe you’ll learn the most from him.", "rating": 5, "expected_grade": "A", "created": "2019-12-18T05:46:50Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is a good lecturer. I will give him credit in that he is able to present the material clearly and in a way you will understand. However, as a human being, he is very rude. He constantly is making comments to make himself sound so much better than you. He is rude in office hours about your concerns. I felt as though he did not take the time to feel the concerns or engage with the students. There were plenty of comments he made in class that left me feeling offended or upset. That being said, if you do not care about personality, he teaches well. If you want to have a good relationship with a professor, or are the kind of person who needs office hours with a professor, don't take his class.", "rating": 1, "expected_grade": "A", "created": "2020-05-07T21:19:26Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is a pretty solid lecturer for beginners and his exams are pretty fair. He is open to explaining any conceptual problems you have about what he's teaching (as long as you're willing to wait in the long line for him). \r\nHowever, his quizzes and some of his later projects can be much more difficult than how he formatted them in CMSC131. Specifically for the quizzes, some of them seemed straight up unfair (considering the resources his class provided and the content we had covered). \r\n\r\nI would say that his CMSC132 class is doable, but be prepared for the spike in difficulty transitioning from his CMSC131 class.", "rating": 3, "expected_grade": "P", "created": "2020-06-09T16:42:01Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "AMAZING professor. Clearly always prepared for his lectures, makes everything understandable and attention-holding, and easy to talk to. Great class even if you haven't done CS before. Overall, I had a great time in his classes (took CMSC131 and 132 with him). Projects are doable and interesting but will take time. He also has pop quizzes (better in 131 than 132 there). I learned so much from him!!", "rating": 5, "expected_grade": "A", "created": "2020-06-25T00:00:26Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is the best! He knows the material inside and out. If you watch his lectures, you'll understand everything. He's really good at explaining even the most difficult concepts. He's also a fun person with a great sense of humor that he uses to make the class even more enjoyable. I get the feeling he has a low tolerance for \"whiners\", which might explain some of the lower ratings.  Lol", "rating": 5, "expected_grade": "B+", "created": "2020-10-13T01:06:36Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "I had Fawzi for both 131 and 132. He's definitely the professor you want for either of these, if you really want to learn the material. His lectures are easy to follow and he makes the class interesting and fun. He's also very friendly outside of class. I went to his office about 6 times and he was always welcoming and helpful.", "rating": 5, "expected_grade": "A-", "created": "2020-10-28T19:25:53Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Had him for 132 in Spring 2020 and I couldn't recommend him more. Some other reviews say he's rude but I never got that vibe from him. In fact, he's one of the kindest and most humble professors I've had. He genuinely cares about his students. If you have to choose a prof to take online, I'd recommend Fawzi. He handled the transition to online learning very well.", "rating": 5, "expected_grade": "A", "created": "2020-10-29T18:38:39Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Such an awesome teacher for 131 and 132. He's fun and fair, and he's a good lecturer that makes sure you understand the material–as long as you pay attention during his lectures and show up, you can do really well in the class.\r\n\r\nHe also let me take my first 131 exam in his office after I accidentally slept through it, so I pretty much owe this man my life.", "rating": 5, "expected_grade": "A+", "created": "2020-11-02T17:43:32Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "The actual GOAT. I have minimal background programming experience and took this class to see if I enjoyed CS. Fawzi was a great professor with a great sense of humor and very fair exams/quizzes. He taught me so much about CS and I am very glad I took it with him, plan on taking 132 with him next semester to. If you can, take Fawzi.", "rating": 5, "expected_grade": "A", "created": "2020-12-03T18:34:18Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Really enjoyed his class - though lectures were recorded online, I was never bored when watching them, plus he makes the content really easy to understand for a beginner CS course; plus, quizzes + projects were not bad - would definitely reccommend!", "rating": 5, "expected_grade": "A", "created": "2020-12-05T01:27:30Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi was a solid professor with quality lectures and enjoyable, reasonable projects. His lectures were asynchronous and you had all day to watch them, which was convenient. If you enjoy challenges, then I guarantee you will like his Soldiers project which was a lot of fun to work with. The biggest downside is that his quizzes are little tough and can be tight on time. He also comes off a bit rude in his class-wide emails, however whenever I personally emailed him, he was receptive and kind.", "rating": 5, "expected_grade": "A", "created": "2020-12-14T15:49:05Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "He''s a great professor and all his lectures explain the concepts thoroughly. During COVID his lectures are recorded and it mandatory to watch for a grade. He posts them a day early.  His exams and quizzes are timed. He makes silly jokes in his lecture and overall, I definitely recommend him as a professor for this class. ", "rating": 5, "expected_grade": "A-", "created": "2020-12-15T00:47:59Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "I took Fawzi for 131 and will be taking him again for 132 in the spring. He is a great lecturer, explaining concepts well and then illustrating them with examples. He also keeps them fairly entertaining (which is hard to do with pre-recorded lectures, I'm sure his in-person classes are even better). All of the projects were fairly straightforward and most of the time you end up with a cool final product.  If you watch all his lectures and study your lecture notes, you'll do fine on quizzes/exams. He covers everything that winds up on his tests in his lectures.\r\n", "rating": 5, "expected_grade": "A", "created": "2020-12-26T22:22:10Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "I am a rising senior in CS and Fawzi is one of the best teachers that I have had alongside Teli. He explains the concepts well and is good at gauging what a freshman understands better than Yoon. You can't go wrong with taking him or Nelson. ", "rating": 5, "expected_grade": "C", "created": "2021-01-03T23:45:39Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Solid lecturer, though wouldn't recommend taking him if you don't do well under pressure due to the time constraints he had for tests/quizzes.", "rating": 4, "expected_grade": "B-", "created": "2021-01-11T00:45:38Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "His lectures (which were asynchronous) were always out in a timely manner, and when they weren't he would give you an extra two or three days to watch them. His lectures were not only well-taught and understandable but also entertaining, as he constantly cracks jokes. He is also very responsive to emails.", "rating": 5, "expected_grade": "B", "created": "2021-01-13T21:19:17Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "I had Fawzi for 131 last semester and he did an outstanding job. I really felt like I learned the material completely. I can't recommend him enough.", "rating": 5, "expected_grade": "B", "created": "2021-04-02T22:09:27Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Good lecturer, although he gave less time than some other professors for quizzes and exams which made them somewhat difficult.", "rating": 4, "expected_grade": "A-", "created": "2021-04-20T01:57:59Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Online lectures are asynchronous and are informative and well structured with lots of examples. Weekly Wednesday quizzes can be challenging but most of the time was on recent material. Exams and quizzes are both timed, however, the time given is reasonable and the content of the assessments is also reasonable. Also had Fawzi for CMSC131 last semester (Fall 2020 - Online) and enjoyed him thoroughly. ", "rating": 5, "expected_grade": "A", "created": "2021-05-04T17:30:56Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Prof. Fawzi is super reasonable and super knowledgeable. I would choose him over Nelson again (although I hear Nelson is great too). I loved the projects and the lectures were always informative and easy to understand. The quizzes are challenging but not unreasonable.", "rating": 5, "expected_grade": "A", "created": "2021-05-08T20:12:49Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "This semester was definitely an improvement from last semester when I took 131 with him. Fawzi kept up with the informative lectures and related coding examples, providing helpful study questions, and assigning projects and discussion assignments relevant to the course material. The quizzes and exams were much better time-wise this semester, hence me actually doing better this semester since I get stressed under a ton of pressure. Lectures were almost always out ahead of time, so we had plenty of time to watch them, and quizzes and exams always tested material that was on the lectures. I definitely recommend taking the class with him if possible!", "rating": 5, "expected_grade": "A", "created": "2021-05-26T15:40:46Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Absolute King of a prof. He's as funny as he is knowledgeable, and is an all-around great choice. His lectures are entertaining and informative, and he will pause periodically and wait for someone to raise their hand. After each lecture, he'll post his slides and any code he used in class as examples. As someone who's had a few years of experience in Java, the projects are challenging but always fair and well-implemented (and there's always a TA who can help you). Each week, he'll post practice questions that he'll occasionally directly copy onto quizzes and exams. The quizzes are easy but frequent enough that you're always forced to keep up with the information. The exams can be challenging but are never impossible. In each discussion section, he'll give a lab that is very reflective of any quiz or exam coding questions. \r\n\r\nOverall, Fawzi makes you want to learn and understand the info and I can't recommend him enough. ", "rating": 5, "expected_grade": "", "created": "2021-12-08T22:26:24Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "I LOVED FAWZI! He is the best CS professor you can ask for! His lecture is fun and easy to understand, his quizzes and exams are super easy. And he will give you a head start on the upper-level course, so it will be easier when you get to the higher-level CS course! !! There are also chances for you to be engaged in competition in his course where he will give out prizes to you and make you feel like a STAR! ! ! ALSO, his projects are super easy and some you can even put on your resume! ", "rating": 5, "expected_grade": "A+", "created": "2021-12-13T00:20:19Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Compared to Pedram, who I had for the same course, Fawzi taught this better in almost every way. He's very enthusiastic, makes jokes, and really tries to make sure the class understands difficult concepts before moving on. For really difficult things, he'll always tell you if it is testable material. Besides that, his quizzes are generally easy, projects can be finished in a couple of days, and the exams are fair. Also, this TAs this semester were very helpful whenever I did have problems with a project.\r\n\r\nI would recommend choosing him regardless of your experience with Java.", "rating": 5, "expected_grade": "A", "created": "2021-12-15T00:19:26Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Extremely easy to understand, excellent lecturer, very charismatic, and knowledgeable on the subject. Just all-around an excellent professor. He is incredibly invested in making sure his students understand the concepts, which is why he doesn't allow laptops in any of his lectures, but don't let that scare you off at all. Don't skip a class, start all the projects early, and you will easily pass this class. I will definitely take him for 132 next semester. \r\n\r\nI have heard that he can be very egotistical and arrogant in one-on-one conversations, but that's never happened to me. ", "rating": 5, "expected_grade": "", "created": "2021-12-17T01:44:52Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is one of the best lecturers at this university. He's very clear with describing topics, and goes through a lot of examples in class (which are posted) to help you understand the topics. I would strongly advise against skipping lecture since his slides are very basic, so you want to make sure that you are taking good notes. You do have weekly quizzes in discussion, but if you take notes and make sure that you understand the material, you should be fine. His exams are pretty straight forward, but he doesn't have practice exams for you to study from. He does however model his exams off of the quizzes and weekly study questions that he posts, so I would say they are pretty manageable (no trick questions). Office hours are also pretty helpful (usually run from 9-5 every weekday) for clarifying topics. Some of the projects can be a little tricky, but if you start early and go to office hours you'll be completely fine. I think he has a slight curve (couple of points) based on the class averages. I had him for both 131 and 132, and would definitely recommend taking him if you want a solid understanding of intro CS concepts and data structures!", "rating": 5, "expected_grade": "A+", "created": "2021-12-21T19:28:36Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "I’m glad I chose Fawzi for 131, and I would take him again for 132 if my schedule allowed me to do so.\r\n\r\nAs a beginner, I felt like his lectures were effective because his teaching style somehow got the material to stick in my head. He is straight to the point, but also occasionally throws in some humor to keep the class engaged. Lectures never really felt rushed, I think he was good at time management and knew when to cut off a lecture to not rush a topic. \r\n\r\nI’m not really sure if he has office hours, but TA hours (from 9-6) were a godsend. I don’t think I would’ve passed this class without his TAs. The TAs were helpful for getting me through the projects, but they also seemed to help other students with any questions about course content. \r\n\r\nThere were 2 major exams throughout the semester and 1 final. I thought they were all fair questions - study the study questions and notes from lecture, as well as last quizzes. Quizzes were basically weekly and also fair. The front of the worksheet was usually multiple choice or short answer questions, and the back was a coding question, and you had 20 minutes to do the quiz.", "rating": 5, "expected_grade": "A", "created": "2021-12-22T17:24:55Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Really nice and made class enjoyable to come to", "rating": 5, "expected_grade": "", "created": "2022-02-03T03:22:42Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi was pretty nice and his TAs were wonderful. I appreciated his teaching style (giving the specifics of each topic we covered) and discussing the concepts before jumping straight into the code. The weekly quizzes were a bit of a drag, but they did make sure that I learned and retained the material. Exams seemed fair and I would've taken him for 132 if I didn't have schedule conflicts.\r\n\r\nDO NOT SKIP CLASS THOUGH! He does not record and the slides are very barebones.", "rating": 5, "expected_grade": "A", "created": "2022-02-18T20:44:49Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "I took Fawzi for both CMSC131 and 132 in Fall 2021 and Spring 2022, respectively. He is an amazing lecturer and a \"fair\" professor. 98% of what will be on a test is what he has taught in class, but sometimes throws 1 or 2 multiple choice questions that he briefly mentioned. Moreover, the teacher assistants are super helpful: I can't make it in his class without their support, especially when it's for coding projects and reviewing for midterms (they make review slides and coding examples in my semester, and I hope the next TA will do that too). I never have an office hour with Fawzi, but the TAs are more than enough (he recruits amazing ones). \r\n\r\nThere are 3 advices to give to new students who take his class:\r\n1. DO NOT SKIP CLASS! Fawzi posts lecture slides but most are similar to outlines. To truly understand it, it's better to attend classes and see his thinking processes with examples and drawings. He is strict with time, so he prioritizes delivering all the contents he has for the lecture first then asking questions second.\r\n2. START PROJECTS EARLY! The day Fawzi posts the announcement that the next project is available is the day you should start right away! The TAs are there to help you. Immediately go to them if you don't know how to start. Don't wait until the last 4 days, unless you love being in a long queue of ~20 students (each takes like 5 minutes, give or take another 5).\r\n3. REVIEW LECTURES WEEKLY! Fawzi usually gives weekly quizzes and it's a good way to know what you need to review for midterms. I regret that I didn't do this weekly, which gave me lots of stress the day before the quiz or exam. This not only maintains good scores for all assignments during the semester but also helps you solidify your understanding of all contents for the final.\r\n\r\nPros:\r\n- Great lectures (easy and clear to understand, good examples)\r\n- Fair exams (what you have learned)\r\n- Supportive, friendly, and super helpful TAs\r\n\r\nCons:\r\n- Exams: because he tests all of what you have learned (some topics appears a lot and some only appears once), you have no idea what will worth lots of points. You study EVERYTHING, which is just ... a lot.\r\n- He doesn't record lectures (maybe once or twice if it's Friday before a holiday weekend).\r\n- Optional: \"nerds\" who ask a lot of advanced questions at the front and interrupts the lectures.\r\n\r\nPS: I failed the final (D), but all other assignments were high (B+). They balanced out.", "rating": 5, "expected_grade": "B-", "created": "2022-04-27T16:24:06Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "I'm really happy to take Fawzi again for CMSC132 (it was a close call because there was only one available spot left for me, probably someone dropped out), mostly because I like his teaching styles and his TAs. \r\n\r\n3 tips to get good grades in his class:\r\n1. Don't skip the lectures! Fawzi doesn't record his lectures\r\n2. Start projects early! You don't want to come to TA office hours 2-3 days before the due date\r\n3. Review weekly! There are weekly quizzes (don't get discouraged because you get low grades, it's a good review for midterms and final)\r\n\r\nThe only thing that is challenging in his course is that you have to study everything for his tests (no idea what he will put on specifically - you know what lectures he will cover, but the contents are massive). It's fair but difficult, sometimes.", "rating": 5, "expected_grade": "B", "created": "2022-04-27T16:33:41Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "If you ever have the opportunity to take him for 132, seize it. Fawzi is funny, knowledgeable, and honest. If you want to do well in his class, I would recommend:\r\n\r\n1) Starting Projects Early! Looking at the description is a good start, but I would suggest trying to code as much as you can, submitting, and reviewing the results from the submit server. If you are confused, try to debug the code yourself before seeing a TA.\r\n2) Attending Lectures! Fawzi's lectures are usually entertaining, but he knows when the content is boring and when students like to skip. Sometimes he will give you the topics for the quizzes and coding tricks. \r\n3) Attending Discussions! Discussions usually focus on coding and other technical things which are tested or used in a project. It's in your best interest to show up, do the lab, and ask for help. If you finish the lab, you can usually ask your TA questions about the class or the project.", "rating": 5, "expected_grade": "", "created": "2022-05-11T02:05:38Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is by far the best professor I've ever had (I'm only a freshman btw). His lectures are extremely informative and easy to follow, so DON'T MISS A SINGLE ONE! (He doesn't record them) Fawzi's exams and quizzes are extremely fair, and his projects weren't lifeless. I had Nelson for 131 and he was also a good option that had his pros, but Fawzi's projects are more satisfying when completed. Fawzi's projects often have GUIs that make you feel a sense of accomplishment after completing them. If I could, I would take every CS class with him. Yea he doesn't allow you to have laptops out, but you really don't need them in the first place to be able to follow through. Take his class and you won't regret it unless you never go to office hours or you start your projects late. ", "rating": 5, "expected_grade": "B", "created": "2022-05-11T18:56:21Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "This might be an unpopular opinion because everyone seems to love Fawzi at UMD, but he's just not my type of lecturer. He goes through topics super fast during class and his speed of talking is just a little too fast for me to comprehend. Can't doubt that he genuinely loves what he does and is always really enthusiastic about class though.\r\n\r\nMy least favorite fact about him is that he never records lectures. Sometimes if you're lucky he'll record them on religious holidays but other than that if you ever miss a class you're screwed. I had to miss class for a lot of personal reasons and it really brought me behind and I struggled to bring my grade back up. \r\n\r\nAdditionally, we only had 2 exams throughout the whole course. We literally learned about every type of data structure within one unit and were tested on it all at once. This is simply just too much information for one exam while most other 132 lecturers had at least 3 or four exams. Splitting it up would've not only helped my grade but would have allowed me to focus more on specific topics for specific exams. I just always felt super overwhelmed around exam time because they were pretty much making or breaking your grade. \r\n\r\nAlso it's a good idea to remember that he's not as lenient as Nelson. He doesn't allow computers or phones during class and he usually won't do any extensions unless you have a really good reason. His exams seem to be more difficult than Nelson's but a lot of people are okay with that since they like his style of teaching. This is all just me speaking from personal preference though.", "rating": 3, "expected_grade": "B", "created": "2022-05-13T07:35:41Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is an incredible lecturer who cares about his students learning and understanding the material. He's been teaching 132 for a while, so his materials for the course - including lectures, labs, and projects - are incredibly polished. It is also evident that he frequently practices giving his lectures in order to stay on top of his game. The material felt well-paced and, even though there were only two midterms, the testable material felt fair and it was not hard to succeed if you took good notes in lecture and sought extra help when needed.\r\n\r\nWith that in mind, make sure to take good notes in lecture! Fawzi does not allow the use of laptops for taking notes, and he does not record his lectures. You will need to be on top of your game and write things down in a way that really helps you to understand the content because the lecture outlines he posts online are really not so helpful. Also, start projects early. They are a joy to complete, and procrastinating will really hurt you with some of the projects in this course.\r\n\r\nIf you have the option to take Fawzi for 132, do it. He is a top-notch professor and a cut above the rest of the instructors for this course.", "rating": 5, "expected_grade": "A+", "created": "2022-05-18T13:49:24Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Unpopular opinion but without bluff like some of these other reviews. (NOTE: I had Nelson first semester and received a very good grade so 132 with Fawzi was a shock. I have completed the course but chose to leave it optional out of confidentiality).\r\n\r\nFawzi is too fast paced in lecture. On top of that his powerpoint are next to useless and he doesn't record lectures. On top of that he doesn't give fair exams in my opinion. I will admit the midterms were fair, but they test the smallest details which you wouldn't need in the real world or which a compiler would pick up. For example, on one of the exams I declared a variable incorrectly, with the rest of my code is logically and syntax correct I only received 2/14 points. I approach external TA's who said I should receive points, but when I approached Fawzi on the regrade he refused to give points back and gave an excuse as to why. In additions we only had 2 exams unlike other classes, where they would split we had all of OO(Object oriented programming) and the entire second exam on every DS (data structure). \r\n\r\nOutside of the course work to sum up Fawzi in a few words:\r\n- shrewd/out right disrespectful \r\n    - Doesn't help in office hours. Always acts like he's better and we know nothing.\r\n- not lenient at all\r\n     - Was sick and couldn't make it for a quiz. Fawzi told me either to come for the quiz or receive a 0 (this was the second time I was sick and couldn't use a self attested note). Especially for a time while we are still in a pandemic this was out right disrespectful and foolish that he is willing to risk the health of his TA's and students for a quiz.  \r\n- doesn't care about his students mental or physical health\r\n   - Over this semester I was struggling with my mental health a bit and when I approached Fawzi about his essential response was I don't care. He is not as nice and caring as nelson, I didn't receive any help throughout the course during this. Outside of that office hours were always packed and the TA's were quite bad. \r\n- comes off as some high achieving professor with lots of publications and no time for his students when in reality he's a lecture (massive ego problem)\r\n\r\nOutside of this his class is taught like we are all high end comp sci people who know what we're doing. His exams once again are more difficult than nelsons. If you could I would avoid Fawzi at all cost and take Nelson. Nelson was one of the best professors I've had across all departments. \r\n\r\nOther Notes (sorry if repetitive to some other parts of the review):\r\n- Doesn't give practice exams\r\n- Doesn't tell us a concept list like Nelson or any other teachers\r\n- Refuses to record lecture \r\n- Steep late penalty (20% off your highest score if submitted at or after 11pm. 100% off after submitting 24hrs after the deadline).\r\n- 1 practice packet with questions that don't resemble exams a week\r\n- Quizzes were very hard for weekly assignments (we also didn't know the context)\r\n- Purposely goes into harder concepts which aren't relevant material to the course (refers to 351 and theoretical CS concepts we don't learn a lot). \r\n- Final Exam is the worst. 30% of the grade. Everything we wouldn't have been tested on for an FRQ was there. You cannot expect first time students with no experience to come in and redo parts of their project by hand. You cannot make students code out concepts you referred to for 5minutes in a lecture. You cannot make students code a question we have never seen a code example for and something which was barely touched in class. A final is cumulative that includes everything we were taught not everything after the midterms and the concepts we barely went over. \r\n- Labs also aren't too helpful and I think he should adjust the labs to have a due date of completion so students actually do then and cut down on the weight of the final exam. a final worth 30% dropped by grade from B to (well you can do the math for that :)). \r\n- Projects in others classes are worth way more overall than ours. \r\n\r\nFinal thoughts: I wish I took nelson when I had the opportunity to while registering. If I could go back into that time and choose nelson I would've probably got a B+ at the lowest. Nelson's exams side by side Fawzi's are much easier on relevant materials and won't make or break your grade such as Fawzi. Unlike the other reviews I can't say that he enjoys teaching. From what I experienced he enjoys the idea of being the smartest in the room at what he does which isn't a trait for a good teacher.", "rating": 1, "expected_grade": "", "created": "2022-05-18T14:30:55Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi had a lot of positives that really made the semester quite good! His lectures are very informative and he's very good at what he does. After I left a lecture, I really felt like I knew what I was doing. I completely understood each thing he taught. The review before mine wraps up my thoughts completely, but I will reiterate them.\r\n\r\nFawzi, like was stated, is a VERY good professor which will make sure you understand his concepts. I had Nelson for 131 and switched to Fawzi for 132. Altogether, I highly prefer Fawzi. Lecturing is better, exams better reflect what we've learned, labs are useful, and the quizzes were fair. All in all, so long as you studied you should be fine. \r\n\r\nAs for criticism, I am not a big fan that he didn't record lectures. It makes it hard to catch up or do well if you have any need to miss class. I also had been a bit upset initially when he said no computers in class, but those who wanted to takes notes on it ended up ignoring it and taking notes anyways. He does try to hold people at the end of class and gets upset if you leave early. There was only 2 exams which were weighted heavily which also covered an extremely large amount of information.\r\n\r\nAll in all, I would absolutely recommend taking Fawzi if you want a strong foundation in CS fundamentals and data structures as a whole. However, it may be best to not take him if you are to not keen on going to every class or if you think that you aren't going to really put in the time to study for every exam.", "rating": 4, "expected_grade": "B", "created": "2022-05-19T20:45:30Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi continues to be an excellent CS prof as he maintained his sense of humor and teaching style that he had in 131. Any tips are obvious things you should already be doing (going to class, starting projects early, etc). The only problem I had with his class was that there were only 2 midterms, the second of which had an enormous amount of information that was covered. The projects can be challenging, but most of the TAs are great resources for help on class or project material. The final was fairly daunting and could've been designed better, but nevertheless, I would absolutely take Fawzi again if I could. ", "rating": 5, "expected_grade": "", "created": "2022-05-19T23:02:26Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "He's a decent lecturer, but still confused as to why he is so overrated. I definitely do not think his lectures are boring, I did get sleepy a lot of the times but that's probably because I had 8AM classes and was always extremely tired. He makes jokes and I think he tries to be an engaging professor. I will however say that he uses his pencil and a paper to visualize what he is describing, and his handwriting is very ineligible and he has to erase so many times that I can't help but bother about the amount of eraser dust he produces. I wish he just uses a tablet when he wants to draw things.\r\n\r\nWhat I disliked the most was his lecture slides that he makes on his own, which severely lacked a lot of information. He seems to hate the lecture slides the CS department made but the department's slides are far more helpful. He doesn't record lectures because he wants to encourage students to attend to his lectures, so you kind of always have to attend his lectures since you will miss out a lot if you are absent as his lecture slides are lackluster, but frankly, if you study the department's slides, I don't think his lectures and slides were particularly helpful at all.\r\n\r\nAside from that, he is extremely unapproachable. I'm not sure if he is \"rude\" per se as I haven't had a proper conversation with him, and he can be pretty sweet like asking \"how are you?\" to his students, but when someone asks him questions, he can be really condescending. I think I asked him questions only two times throughout the semester, during the exam and after the lecture, and both of the times he was very cold. Maybe I was asking dumb questions to his eyes, because he does seem to love whenever his top students ask advanced questions during the lecture.\r\n\r\nI think he also makes his exams on his own, and in my opinion, those are much harder than the practice exams provided by the department. I did decently on the second midterm and the final exam, but I did pretty badly on the first midterm, which hurt my grade the most, because I had no idea his exams would be as difficult. I'm not saying his exams are the worst, but you definitely need to study consistently on everything that he covers, and he also teaches things that the department curriculum does not seem to include just because he \"likes\" those particular topics.\r\n\r\nHis projects are enjoyable though. You might not wrap your head around initially for some projects, but once you do, they're pretty easy to solve, and the GUI he makes for some projects are quite fun. I still can't figure out the solutions for his secret tests however...", "rating": 3, "expected_grade": "B+", "created": "2022-06-07T12:27:31Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is a fantastic professor. Yes, he doesn't record lectures(unless on a religious holiday or if he is sick), but this encourages you to attend class and pay attention. His two midterms were COMPLETELY fair-game, and his final exam was difficult but was not as hard as I thought it would be. The secret to doing well in his course? Study his notes and lecture examples every day after class. His exam questions are ALWAYS based on his lecture examples and slides. Be diligent in your studying, and make use of his office hours, as they run 8-5, Monday-Friday, administered by TA's who are extremely knowledgeable and will help you with not only projects, but concepts as well that may seem confusing to you during lecture.", "rating": 5, "expected_grade": "A-", "created": "2022-07-06T16:51:34Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "He's good at explaining the concepts... but that's the only plus point I have for him. \r\nHe's got his TAs taking points off for missing a semicolon or parenthesis - that's not how coding works and losing points on things like that teaches you nothing relevant to being a programmer in the real world. He also speeds through his lectures and doesn't really save much time for answering questions. If you ask him a question outside the syllabus, a lot of the time his answer is 'I don't know.' Basically, he knows the material and not much past that. Also, he doesn't record his lectures so if you miss a class because you're sick or something like that, good luck catching up :( He isn't very understanding if you have to miss the weekly quiz (yes, there's a stressful quiz every week) for any reason that's not 'I'm severely ill' - he won't even reschedule. He also doesn't allow laptops in lectures - and taking handwritten notes for a CS class isn't really easy (in fact it doesn't make sense IMO). \r\nYou'll get the A if you work for it, but I know for a fact that you wouldn't have to work so hard if you managed to get a spot in one of Nelson's classes instead.", "rating": 2, "expected_grade": "A", "created": "2022-08-15T02:06:59Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "he talks too fast he is annoying and he is not beginner friendly", "rating": 2, "expected_grade": "", "created": "2022-10-17T00:59:41.248431Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi is harder than Nelson. He is a better teacher, but he is slightly harder. I would recommend taking him for 131 over Nelson to build a strong foundation though. If you are doubtful of passing though, take Nelson.", "rating": 5, "expected_grade": "A", "created": "2022-10-19T17:50:46.611723Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Excellent Professor. He explains concepts really well and gives fun interesting projects. If you're regular, the course won't be too hard for you. There are quizzes every week, but I think they keep you on track and make Comp sci easier overall. Would definitely recommend him for CMSC131 especially if you don't have much experience with programming before.", "rating": 2, "expected_grade": "A+", "created": "2022-12-02T19:15:35.966347Z"}, {"professor": "Fawzi Emad", "course": null, "review": "Excellent Professor.", "rating": 5, "expected_grade": "", "created": "2022-12-02T19:16:07.448508Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "The professor teaches really well.", "rating": 5, "expected_grade": "A+", "created": "2022-12-02T19:16:23.807663Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Overall I thought he was a good professor, he teaches pretty well in my opinion (but that may be due to myself having a little of CS experience beforehand) and he's pretty interesting! Compared to Nelson, Fawzi sticks to the lecture consistently during the entire time and always teaches till the class ends and I usually enjoy his lectures. He doesn't record his lectures unfortunately and doesn't allow laptops which wasn't the worst for me personally but I think it's worth it compared to taking Nelson.\r\n\r\nProjects are a little abstract to start out with but end up usually being for myself. They're rewarding because most of his projects are GUI based so you can see the progress of making something work which is fun. Compared to Nelson's projects, you learn the content better and just have more fun. Nelson's projects are more open ended ish but just aren't fun when compared to Fawzi. \r\n\r\nFawzi has almost weekly quizzes that are 15% of your grade and you usually have no idea of how to figure out what will be on the quiz beforehand so usually screwed on what to study for besides the Study Sets he gives you. This is one of my least favorite parts of the class.\r\n\r\nHe has 2 exams which is less than Nelson's but doesn't give you really any material to study for his exams, unlike how Nelson gives you practice exams for his tests. I feel like tests are not a good descriptor of the content to learn in the class and can sometimes feel like \"How was I supposed to know this?\" during the exams, but that's probably just me not being an absolute CS god unlike some people in the class. \r\n\r\nI think you should definitely take Fawzi over Nelson, Nelson goofs off too much and just doesn't have as good of content as Fawzi even if it comes at the cost of being harder. Maybe if you plan on just taking CMSC131 and that's it take Nelson but that's really the only edge case I can think of", "rating": 4, "expected_grade": "B", "created": "2022-12-07T15:24:54.478470Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Nothing on his test is stuff he never discussed in lectures. He's strict but not too strict. In my opinion his projects were very interesting which made it a whole lot easier to do. I highly recommend him.", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T18:22:07.803277Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi's projects are very interesting, and he is very good at explaining concepts to you. He does a good job of planning question time into his lecture especially on days with harder content, giving you time to really understand it. He has weekly quizzes that account for 15% or so of your grade, these quizzes I find are pretty easy to study for if you go to discussion every time. He gives optional labs during discussion that often reflect the concepts that will be on the quizzes, at least for the programming questions. If he is asking about concepts or has multiple choice questions, you would have to review the study questions ahead of time. The biggest resource for exams and quizzes in this class is your own notes, write down everything he says. A lot of things he says are not on the slides, his slides are for him to remember what to tell you so you can't skip class and easily understand the new material, if you have never seen it before. He doesn't record his lectures either. He also does not allow you to use laptops in class because it is really easy for you to get distracted and do other things so all notes you take are going to be on paper. His exams are easier, and they are fewer exams than Nelson's class, but the tradeoff is you have weekly quizzes.", "rating": 5, "expected_grade": "A", "created": "2022-12-10T13:33:24.607711Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi is a good lecturer, and he genuinely deserves a lot of credit for making the course so easy to understand for new comers. That said, my biggest gripe with Fawzi is the way he approaches quizzes and exams; he gives weekly quizzes which, while not difficult, are annoying. Furthermore, Fawzi gives two exams for 131, but he doesn't provide a practice exam for either, which is really just annoying. Still, he's a good lecturer and is good at making sure the content is understandable.", "rating": 3, "expected_grade": "A", "created": "2022-12-11T02:51:59.518489Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Fawzi is a great professor and I'm continuing to have him in Spring 2023 for CMSC132. While I'd say his tests can challenge you and question some things as he can bring up some slightly interesting topics on there, the content and the way he lectures is amazing and I am glad to have him again because I'm here to learn and not slack off from what it seems like from Nelson's class. Nelson can seem easy and great, but Fawzi does challenge you and academically pushes you to where you want to be. It may seem subtle at first, but it will start to become more rigorous as time goes on. As someone who normally gets As in classes, this A- does not disappoint and nor would having a B or B+ to say the least.", "rating": 5, "expected_grade": "A-", "created": "2022-12-16T04:07:13.585560Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Good lecturer and keeps class engaging. Weekly quizzes were a pain as a mistake will drop the quiz grade to basically a B. Projects were interesting and not too time consuming for me. The finals were kinda hard this year but that might just be me not studying enough. You cannot use electronics during his lectures and he doesn't record his lectures so you have to always be there in person. Overall, good lecturer but you will have to work for a decent grade especially if you have no prior programming experience.", "rating": 4, "expected_grade": "A-", "created": "2022-12-16T18:37:37.452685Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Hes a decent lecturer, but he doesn't have lecture recordings like other professors. The main problems I have with his class are his quizzes, exams, projects, and content. Fawzi likes to give weekly quizzes which are annoying to do, he also does not provide any sample exams so you are stuck trying to figure out what will be on there. His projects are quite difficult and you will find yourself at the TA's for most of it. Fawzi also likes to teach more than required, he likes to teach upper level stuff which was annoying considering this is a 131 introductory course.", "rating": 2, "expected_grade": "", "created": "2022-12-20T06:00:13.578106Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "He's a decent lecturer but if you rely on slides for notes you are doomed. Fawzi's slides provide no information and he does not do recorded lectures, so you are stuck with trying to listen and copy down notes. It doesn't help that he talks fast and teaches content outside 131 for upper level courses. He does weekly quizzes and has 2 exams. Both are graded strictly and he does not provide practice exams nor tell you what will be on there. The projects look cool but can quite difficult and you will find yourself at the TA's a lot.\r\n\r\nDO NOT TAKE FAWZI", "rating": 1, "expected_grade": "", "created": "2022-12-20T06:05:56.444445Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "So I can see the appeal of Fawzi's teaching, however it did not work for me. He made his projects interesting and was overall an interesting person who would take time to delve into concepts using examples in lectures which sounds very helpful. However, I found it quite frustrating when I had been sick for a little over 2 weeks when the only way for me to catch up on what we are learning was through someone else's notes. There not being recordings and how little information there is on his slideshows made catching up nearly impossible for me. Also weekly quizzes were a nussiance since he would not really tell us what topics would exactly be on the quiz. I remember one week, we were learning 2D arrays and the next quiz was coming up, so I thought the quiz would be on 2D arrays. I studies 2D arrays quite a bit, however the quiz was on something completely different. On a random topic taught weeks ago. I guess it can give incentive to be ontop of previous topics but that was quite the nuissance. TAs can be helpful, but they are often crowded and you have to wait your turn for every question you want to ask. Overall, he is a decent lecturer and I see the appeal, but did not work for me, or anyone who needs to review topics through recordings.", "rating": 2, "expected_grade": "D+", "created": "2022-12-25T02:09:23.550918Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Amazing professor. Teaches the subject very clearly and obviously loves the subject he teaches as well as teaching itself. Readily engages with students during his lectures. You do need to attend his lectures if you cannot get notes from a classmate though, as he does not record his classes and his lecture slides are really just so he remembers what to say during class.", "rating": 5, "expected_grade": "A", "created": "2023-03-09T00:31:28.125274Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "If you're stressing over Nelson, Fawzi, or Gonzales, DO NOT CHOOSE FAWZI. He makes you take a quiz every single week and they are literally my downfall. He gives you 3 release tokens that refresh every 24 hours instead of 12. AND THERE ARE ONLY 3. I genuinely love learning and computer science, but his assignments stress me out. I had a better time in Nelson and a better grade. I am literally on the verge of failing this class right now. So I'll be grateful if I even get a C-. There are no recordings and he goes really fast, so good luck if you're a literal beginner in computer science that is struggling to understand.", "rating": 2, "expected_grade": "C-", "created": "2023-04-07T01:38:21.694295Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Projects require some thinking. Exam 2 covers lot of material and final exam had tricky questions. The final topics that are taught are not covered by quizzes and exams so things like recursion only showed up on the final exam, not even in the projects. Good lectures but doesn't record, teaches some interesting topics slightly outside Java. Good prof, would recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T15:10:13.860030Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Projects require some thinking. Exam 2 covers lot of material and final exam had tricky questions. The final topics that are taught are not covered by quizzes and exams so things like recursion only showed up on the final exam, not even in the projects. Good lectures but doesn't record, teaches some interesting topics slightly outside Java. Good prof, would recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T15:10:14.559990Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Took him last semester. Personally vibe with his faster teaching pace. Just make sure you're on top of things because it is abit difficult to catch up. Also go to lectures and take notes.", "rating": 4, "expected_grade": "A", "created": "2023-05-03T21:47:22.248021Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "If I am being completely honest, Fawzi is a fairly good lecturer but when it comes to exams and quizzes and general stuff...oh boy. I understood everything conceptually in lecture but when it came to quizzes and exams, I was absolutely 100% lost. It is hard to really know WHAT to study because nobody can tell you what topics are necessary to study for the exam. The exams test you on the most intricate tiniest details possible that you will NEVER EVER need to know in the real world. It is hard to remember every small detail. Such as knowing the asymptotic complexities for the insertion of a linkedList, knowing what URL stands for, etc... There are only two exams whereas other classes split into three exams. So both exams are extremely content heavy. I had Nelson for 131 and regret not taking him again for 132. Fawzi's lectures are extremely fast paced, he doesn't record lectures, nor does he allow electronic devices (laptops/tablets) out in class at all. Not to mention, you can never get any access to his previous exams so there is NO understanding of just how much we need to study or what needs to be studied. The study question sets that get posted on canvas have ZERO answer keys so there is absolutely no way in knowing if you are getting the correct answers or not. When asking Fawzi questions regarding what was said prior, he will redirect you to his TAs and tell you to go to office hours which makes the huge assumption that you even have time to attend office hours. I failed both midterm exams even after studying lecture notes, slideshows, in class examples, and the study questions. There is no curve. I currently have a 65% but am hoping that with passing the final with a 75%, I can get a C-. His expectations are way too high for a class such as this. This class has made me debate my whole career as a Computer Engineering major and this is just a 100 level course.\r\n\r\nWhat annoys me the most is that Fawzi is always making comments in class such as \"Guys I don't even look at my slides until right before class and I gotta quickly re-teach myself the material\"... He is always commenting on the fact that he writes Android programs etc... It is just an ick. Not to mention, when you express concerns about potentially failing his class he gives no strategies or help on how to pass the class. He just says study and see what happens. Well I studied my butt off and still failed the exams. \r\n\r\nFor projects, they will start out by being open projects and then after the first three, they are all closed projects. He gives three release tokens that regenerate every 24 hours and THREE only. No negotiations which has completely screwed me over on some projects because if you are failing release tests, you are kinda screwed. It is extremely frustrating and annoying.\r\n\r\nIf you have the chance, avoid taking Fawzi unless you can somehow magically absorb information like a sponge.", "rating": 2, "expected_grade": "C-", "created": "2023-05-04T01:45:31.140781Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "I like the way Fawzi teaches his class and he makes sure that you understand the content he teaches. His quizzes are fair but at times you get points taken off heavily for small mistakes you make. The midterm is fair and the projects are fun to do. The only bad thing I can really say is that his lectures aren't recorded.", "rating": 5, "expected_grade": "C", "created": "2023-05-04T10:48:56.090258Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "By and large, Fawzi is a good lecturer, but his slides lack depth of content and thus do not help when preparing for exams. The projects were challenging, but possible with some time and thought. He just did not personally teach the way that I learned. He taught by talking at you for 50 minutes three days a week and expecting you to memorize everything that he said, no matter how insignificant you think it might be. If you have to take him, just be sure to take good notes and go to office hours for help, but I would personally recommend choosing another professor if possible.", "rating": 1, "expected_grade": "B", "created": "2023-05-05T15:06:22.507976Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "There are some mixed feelings on Fawzi but I feel the majority of people enjoy him. I'll discuss the pros and cons:\r\n\r\nPros:\r\nHis quizzes and exams are certainly fair. He will never throw material that is overly complicated or has not been done on quizzes/labs/projects on the exam. I did not attend labs and barely studied and was able to complete quizzes with relative ease. If you do attend labs and study, you should expect at least a B in Fawzi's classes, with a very solid chance of an A. CMSC132 is a very fast-paced course, but he does not ask overly specific questions that would make you have to study for 5 hours. \r\n\r\nHe is very easy to understand and his teaching style is not bad. You can tell he is really determined to teach at his best every single lecture, and will even apologize if he feels he is not explaining it to the best of his ability. Goes over concepts, even if most people understand, multiple times to ensure that EVERYONE in the class understands, even if it is boring to the more advanced programmers. \r\n\r\nCons:\r\nAlthough some of his projects can be pretty straightforward, others can be very challenging. I do not suggest procrastinating on his projects, especially if he specifically mentions it is a harder project. Projects are worth roughly 3% of your grade so doing good on most, if not all of them, is very important. \r\n\r\nHe does not record lectures. He expects his students to attend all of his lectures, so it is important that you do so if you want to keep up. Missing one lecture could put you pretty far behind. If you are someone who does not feel like attending all of the lectures, I suggest you do not take Fawzi or find someone who will write down notes and give them to you.", "rating": 5, "expected_grade": "B", "created": "2023-05-09T02:05:29.247330Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Great lecturer and very personable. Made sure to at least try to know some students of his 200+ student CMSC132 lecture. Has a great understanding of the topics he teaches and answers questions to the best of his abilities, no matter how abstract. Compared to Nelson, this class is completely different; DO NOT EXPECT HIS CLASS TO BE ANYTHING LIKE NELSON'S. If you want an easy A, take Nelson sure; but if you want to be challenged in a fair and constructive learning environment take Fawzi. He has weekly quizzes and I see a lot of people complaining about this but if you stay on top of them they are a great grade booster; they are NOT that hard if you take the time to review just a little bit. Does not record his lectures but I enjoy being forced to go to class, to be honest; having Nelson last semester made me kinda lazy about CS because of his recorded lectures. Although recordings are useful, they just are no supplement for really taking notes, especially if you're watching them on 2x speed. His projects are super cool, fun, and challenging at the same time. If you like the problem-solving aspects of CS you will thoroughly enjoy his projects; not only that he makes neat GUIs for some of them that I have shown friends (that aren't into CS) that have genuinely found them interesting. \r\n\r\nTLDR: Fawzi is a challenging professor, take Nelson if you want an easy time. But if you take Fawzi's class, it will be as rewarding as it is challenging, and you will be prepared for the next steps in your CMSC journey.", "rating": 5, "expected_grade": "A-", "created": "2023-05-11T21:24:24.444670Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Pros:\r\nHas a pretty fun teaching style, was always engaged in class. Answered emails fairly well, tho there were times when he didn't. A great lecturer overall and a fun professor, with engaging projects that will you make you fall in love with CS overall.\r\n\r\nCons:\r\nWeekly quizzes felt suffocating more than anything, but they did help in cramming material. NO preparation for any exams at all (for context other professors gave review material to their students). No recorded lectures so if you're sick at all, GOOD LUCK.", "rating": 4, "expected_grade": "B-", "created": "2023-05-20T03:38:41.261170Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "To start with the positives, Fawzi is genuinely a good lecturer. He presents concepts in a way that's really easy to wrap your head around. That's about where the positives end, though. The biggest problem with Fawzi is that he barely provides you with the materials you need to succeed; he's practically setting you up to fail. Although he provides you with study questions, they're basically useless since they don't resemble what's on the exams or quizzes at all. He doesn't give you practice exams, and the fact that there's a quiz basically every week basically just adds unnecessary stress. Beyond the exams, his projects are theoretically fun, but they're difficult, and the fact that he has only three release tokens every 24 hours is just annoying. Genuinely, Fawzi is really only good at lectures; everything else is just annoying at best and frustrating at worst, really. I wouldn't recommend taking him over Nelson, that's for sure.", "rating": 2, "expected_grade": "A", "created": "2023-05-21T16:22:26.387701Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Great lecturer, everything he taught made sense. But if you slack off you will fall behind very quickly (what happened to me). Quizzes were fair and the exams weren't bad, only complaint is that they took points off for the smallest things such as forgetting a semi colon while handwriting code. Projects were very fun and the TA's were very helpful. Only advice is to be on top of your game and start the projects somewhat early as you only get 3 release tests every 24 hours.", "rating": 5, "expected_grade": "C+", "created": "2023-05-22T14:57:46.998582Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "I honestly cannot fathom how he has such good reviews on here. His class has many issues, one of which is that he is just a very rude and inconsiderate person. He does not care if you get sick or have a personal issue, even if it’s something serious or entirely outside of your control, and will often be rude in his responses (many people I know who have taken his class have had this experience). \r\n\r\nThe lab exercises and projects often do not line up well with the lecture content; for example, by project 3 (mid-February) the only non-131 concept on the project was enumerations, which we had learned on the first day of class. We also wasted lab time by doing multiple labs on GUIs, which are not actually assessed on quizzes or exams. This means that you are getting quizzed on concepts that you might not have ever gotten a chance to practice before, and it can be difficult to anticipate what will be on the quizzes since they don’t always line up well with lectures. He also only has two midterms, both of which are fairly challenging, and there is no review material besides the TA-made review packet.\r\n\r\nFawzi also follows what seems to be a standard practice among the CS professors of not posting grades or assignments in Canvas. Although he did provide a grade calculator, he did not update it very regularly, so it was difficult at times to know how you were doing in the class.\r\n\r\nThe only reason I did not give one star is because he explains concepts well in lecture. Frankly, I just did not have the patience for Fawzi’s condescending and rude disposition and would not recommend him as a professor for 132.", "rating": 2, "expected_grade": "B", "created": "2023-05-24T03:57:23.289377Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "In general, he's a great professor. He gives you study questions and posts the slides and code examples, and his TAs are great resources. The only thing I had a problem with is he wouldn't record his lectures but he would let you voice record them. He doesn't allow computers or tablets in lectures and he's a tough grader when it comes to quizzes and exams, though his exams and quizzes are fair.  My advice for this class is to study the slides and code examples hard, his quiz questions are always based on stuff you can find on lecture slides. Also for projects get them done asap so you can go to the TAs for help if you get stuck. If you go to the TAs on the last day they're gonna be packed.", "rating": 4, "expected_grade": "B-", "created": "2023-05-26T20:27:34.150565Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "He is not that considerate. He doesn't give out practice exams,  which sucks because his exams are hard and he asks about nuanced things that he mentions in passing in lectures. He is a captivating lecturer, so learning during class is not the worst. The downside is that nothing is recorded, so if you miss lecture you are screwed. He is good for someone highly proficient with a lot of CS experience. Honestly, just try and take another prof. your grade will be better off. I think that the reveiws here are skewed, I am surprised its so high considering so many people complained during the semester about him kinda setting you up to fail for eg there is 2 midterms as opposed to the other classes that get 3(makes more of a difference than you would expect). If he would provide more materials/make his class and grading more fair he could be a better prof tbh.", "rating": 2, "expected_grade": "", "created": "2023-06-22T21:20:33.509207Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "I actually really enjoyed him as a professor. I had Nelson for 131, and I found that I enjoyed Fawzi's style of lecturing a lot more (Nelson gets off-topic A LOT which can make his lectures hard to follow along. Fawzi's lectures are straightforward and concise and are pretty engaging). The con I would say for Fawzi is that his exams are HARD and he gives no study material or practice exams (all of the study material you can find is made by the TAs and those resources are nothing like his actual exams). He also doesn't record lectures and there are weekly quizzes.", "rating": 4, "expected_grade": "B-", "created": "2023-07-06T21:56:38.497796Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Unfair exams, weekly quizzes, no piazza, no lecture slides, no lecture recordings, no practice exams, and no study guides. Must I say more? Students receive ZERO context as to what exams/quizzes will be on, so you are left to \"study everything\" as he constantly tells us. Not only that, but there is no leniency. This means that, for a 100-level course, you either get the question right, or lose 90% of that problem's total points. There is no curve, and he will look for every opportunity to dock points. Needless to say, take someone else if you actually want to pass.", "rating": 1, "expected_grade": "", "created": "2023-10-17T00:25:04.835397Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is a great, entertaining professor. He goes through many examples and answers questions thoughtfully, and all of his assignments and assessment are very fair. Make sure you follow everything on the style guide because the graders tend to be picky about that. Very relaxing class if you have prior coding experience.", "rating": 5, "expected_grade": "A+", "created": "2023-10-18T23:59:59.057053Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Easy but is the driest", "rating": 1, "expected_grade": "A+", "created": "2023-10-22T00:06:07.081476Z"}, {"professor": "Fawzi Emad", "course": "CMSC131", "review": "Truly among the greatest professor I've ever had. Inspired and proved to me that truly can code as well as anyone else. The summer course that I took with Fawzi was probably my most impactful experience in higher education.", "rating": 5, "expected_grade": "A", "created": "2023-11-02T19:33:36.068874Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "He is really good at lecturing, but that's about it. He has weekly quizzes that are simply unfair and tanked my grade despite doing really well on all the exams and projects. Fawzi does not care about his projects as much as his quizzes, so if you like projects that make you learn the content, don't take Fawzi. (Also no technology allowed in class and lectures are not recorded)\r\n\r\nI think he would be better as a CMSC131 professor than 132, so if you're making that debate between Nelson and Fawzi, Fawzi for 131 and Nelson for 132.", "rating": 1, "expected_grade": "C", "created": "2023-11-09T02:08:35.675719Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is a nice guy. Lectures themselves can sometimes be a bit boring but he is very well spoken and makes the content accessible. The course is hard, but not unnecessarily so. Purposefully takes away resources and information that other professors might give you, but it forces you to really learn the content. Show up to class and study and you'll do well.", "rating": 5, "expected_grade": "B+", "created": "2023-11-12T21:20:49.078479Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "I came into the class with prior coding knowledge so it was pretty easy. Fawzi is also an entertaining lecturer for the most part, so lectures are never boring. However, it is very difficult to miss a lecture as the content on the slides is barebones and Fawzi doesn't record. Fawzi also gave us reviews for the midterms which helped me brush up on skills. As long as you show up to lecture, this class is not bad.", "rating": 5, "expected_grade": "A", "created": "2023-11-23T20:56:22.555848Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "He is good at lecturing, but the powerpoints have hardly any information, and makes it hard to review. He is rude to other students, and his grading is horrible. For little syntax errors, he will dock off almost all your points even if everything else is right. If he makes a mistake, he is always right an dyou are punished for such.", "rating": 2, "expected_grade": "B+", "created": "2023-12-04T02:29:01.063233Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "It's pretty simple: If you see Fawzi's name, you enroll in his course. Fawzi is so good at presenting material in a straightforward, easy-to-understand way. His lectures always keep me engaged. Some others might complain that he only posts slides and not recordings, but I think you do need to show up to every lecture to gain a complete understanding of the course. Much of what's discussed in lectures isn't on the slides. His exams are also very fair (and graded very fast). I'm not sure if this is just Fawzi or all 132 professors, but we had TA office hours 9-5 Monday through Friday, which is helpful. I would be happy to take all of my future CS classes with him.", "rating": 5, "expected_grade": "A", "created": "2023-12-04T14:39:36.312844Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "TLDR: Very solid professor, probably a must have unless you tend to miss class\r\n\r\nFawzi is a great lecturer, responds to emails quickly, and gives very fair assignments. His lectures are thorough and cover all content that he quizzes/tests on. There are multiple TAs at office hours from 9AM-5PMish so you can get help easily. The coding projects are very doable as long as you don't procrastinate until the last day. The quizzes and exams are fair as he only tests us on content gone over in class. He sometimes flat out tells us that a specific topic will be quizzed/tested on.\r\n\r\nThe main downside is the fact that Fawzi doesn't post recordings of lectures and the slides aren't that useful without the verbal content. If you miss a class, you'll probably have to ask someone go over the content with you or give you their notes (if they're thorough).", "rating": 4, "expected_grade": "A", "created": "2023-12-05T03:27:33.714120Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "The greatest professor at UMD. He WILL make you interested in CS. He WILL make you enjoy data structures, algorithms, threads et cetera. For an intro level class he makes it just difficult enough for the challenge but not so easy that all the unserious people can get through. You need to be on top of shit when you take Fawzi but it is so so so so worth it.", "rating": 5, "expected_grade": "A", "created": "2023-12-06T19:53:07.087673Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is a great professor! I thoroughly enjoyed the class since he taught the content well and cracked a few jokes here and there. We get a quiz in discussion once a week (mostly on Wednesdays) which are helpful for brushing up on topics learnt. The exams are fair as well the projects! We got review material for exams and the TA's hosted a review session for each exam. The TAs for 132 vary quite a bit. Some of them are really helpful while others just confuse you more. The TA I had was nice but did not know a lot of the syntax and course material. Overall, I loved the class and for any CS classes in the future I would love to have Fawzi as a professor again.", "rating": 5, "expected_grade": "A", "created": "2023-12-06T21:09:52.550598Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "He teaches content in a way that is very easy to understand. The exams and quizzes are very representative of what we learn in class.", "rating": 5, "expected_grade": "A", "created": "2023-12-09T21:48:11.918522Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "fawzi is a tough cookie! he initially came off as rather rude and unapproachable, but he definitely warmed up to students as the semester progressed. he's an amazing lecturer and is able to present all of the content in an engaging and straightforward manner, but he doesn't post recordings and his slides don't go into detail about what was covered in his lectures. he also goes through the course content fairly quickly, so if you are unfamiliar with 132 content and struggle with taking notes in lectures, i'd be careful with taking fawzi. \r\n\r\nbesides that, we had 10 quizzes and 2 exams, all of which were fair and graded quickly. we also had 8 projects that aligned well with the content of the material we were learning in class, and ta office hours from 9-5 every weekday. the only complaint i have about him is his grading is a little unnecessarily harsh at times (primarily for small mistakes on quizzes), and the style grades for projects were very subjective and varied widely depending on your ta (my friends and i all lost different amounts of points for making the same mistakes). all in all though, i really enjoyed 132 with fawzi this semester and am excited to take 250 with him next semester :)", "rating": 5, "expected_grade": "A", "created": "2023-12-11T23:45:48.394627Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Great lecturer. Really made the hour fly by. I'd be scribbling down notes and then all of a sudden it's time to leave!", "rating": 5, "expected_grade": "A", "created": "2023-12-12T02:43:11.473563Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is a great professor, and I know you guys want to know the pros and cons. So I listed it below.\r\n\r\nPro:\r\n-Fawzi knows what he is doing; yes, every professor does, but he excels in the material and teaches it in a way that makes you understand. He teaches with passion, and you will get that feeling within the first few lectures.\r\n-Exams aren't too bad if you study and review materials consistently.\r\n-Two-sided coin here: Weekly quizzes help you prep well for the exam so you don't have to completely procrastinate.\r\n-Fawiz stays mostly on topic, doesn't go on tangents, and tries diligently to make the class interesting with his own life experiences.\r\n\r\nCons:\r\n-TAs. Some are great, while others are very skeptical. Some TAs waste your time in office hours while others know how to guide you correctly, so make sure you know what you are doing and are willing to \"waste\" time in some cases.\r\nQuizzes: As mentioned, quizzes can be annoying, but they are good practice, so again, a two-sided coin\r\n\r\nOverall, take Fawzi if you can. He is the GOAT.", "rating": 5, "expected_grade": "", "created": "2023-12-12T20:25:51.179809Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is quite good for a teacher, the only negative I can think of is how harsh he grades things, not to say its super bad its only like getting a 90 instead of a 94 or something, like its very minimal but it adds up over assingments. Definitely helps you understand the content though and weighs the 2 midterms and final as like 60% so as long as u study for the exams you should do fine overall in the class. This does mean though that if you aren't too good at exams its a little rough. If you're coming into UMD after taking ap csa Fawzi is great definitely feels like you're just picking it back up.", "rating": 4, "expected_grade": "B-", "created": "2023-12-13T01:17:04.463674Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi's the man. His lectures are incredibly engaging, and basically 9–5 office hours meant that if I ever had an issue it was trivial to rock up to office hours the next day and get my question answered. If you're sick and miss a lecture, however, it IS pretty punishing since he doesn't post recordings and the slides/examples he posts are pretty barebones. (I missed the lecture on Big-O and the relevant theorem involving limits: imagine my horror when it was on the first midterm!)\r\n\r\nIn terms of coursework, I didn't struggle much. Some might say the weekly quizzes were a bit much, but given that they're only ever on the lecture content from the week prior it's trivial to study for them. The projects were also fairly easy, and the later ones were actually super fun. I'd 100% recommend Fawzi for future 132 students.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T04:36:41.703381Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Don't believe any of the negative reviews here. If you want to succeed in any of Fawzi's courses, you will. He explains everything clearly in lectures and doesn't put any sort of trick questions on quizzes or exams. Sometimes he puts tricky questions on quizzes, but they are always still based on content he explicitly went over, and he makes quizzes worth barely any of your grade, so getting points off doesn't matter much in the long run. His no-technology policy is pretty unpopular, but I would recommend using an iPad if you have one. I sat in one of the front rows and used one all semester and he never said anything.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T01:13:09.332622Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi does an excellent job of teaching the content. You can tell from his teaching style how experienced he is. Exams were fair but were graded a bit harshly. There were weekly quizzes and no recorded lectures. The TAs provide review materials and comprehensive study guides for midterms.", "rating": 4, "expected_grade": "B+", "created": "2023-12-15T02:29:11.285448Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi might be one of the best professors I've ever had. All of his lectures are engaging and he presents the course content in a very thorough and straightforward way while still making it entertaining. He's a very funny guy and takes every opportunity to make a joke which keeps the whole class engaged. Quizzes are graded very quickly and exams are graded within two weeks or so, which is very reasonable. He also had TA office hours from 9-5 Monday-Friday which was a dream and helped so many times. Unfortunately since so many students take CMSC132 it was very packed, but still helpful nonetheless. The only downside I would say are that the quizzes are a bit difficult and the end of the class was a bit rushed, but overall, take Fawzi for any class you can, he's amazing.", "rating": 5, "expected_grade": "A", "created": "2023-12-18T02:26:54.465435Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "To start off with the pros, Fawzi is a genuinely good lecturer and explains things very well. His midterms this semester were also extremely easy, but I think he was trying something new this semester with midterms, since they are generally known to be very difficult, but atleast for this semester the midterms were really easy and fair. In the beginning of the semester he mentioned that his final would be generally easier than his midterms which is why he weighs it 30% of the grade. However, the final was an absolute dumpster fire. Especially compared to the midterms, the final felt way too difficult. I also don't like how he has us do quizzes every week, and will tell TAs to not tell us what is on those quizzes, so there are many times I try and study for quizzes but what comes up on the quiz is not something that I studied, because I assumed the quiz would be about another topic. I also feel like his project descriptions in this class were not very good. They were extremely brief and many of the projects, except for a few exceptions, were really basic and uninteresting. I had him for 131 as well and I felt his projects in 131 were much better and creative. Him also not recording lecture and posting incomplete and not detailed slideshows really puts him down from other professors as I feel it is unfair that I have to struggle to catch up if I cannot make it to a single lecture due to sickness, or etc. Like there is no way for me to attend every single lecture 3 times a week for the entire semester. He also never gives us practice material with answer keys when it comes to these quizzes or tests and no previous exams to practice with. I would say there are definitely better options than him, like for 131 and 132, it would be better to go with nelson, elias, or pedram. Even Larry Herman would be better for 132 since he atleast records lectures and gives extremeley comprehensive project descriptions. I would say he is still better than Yoon, but I personally feel is quite an overrated professor. If you genuinely feel like you would be able to attend every single possible lecture, then you would be fine, since lecturing is his biggest pro.", "rating": 2, "expected_grade": "B-", "created": "2023-12-18T02:55:11.119267Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi can sometimes have a boring lecture here and there, but overall he's a very smart man who knows a lot about the courses he teaches. He makes the information very easy to understand and if you pay attention in class, it should be smooth sailing.", "rating": 5, "expected_grade": "A-", "created": "2023-12-18T08:57:46.024910Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "i'd give him 4.5 stars if i could, but i rounded up to 5 since 4 is too low. fawzi's a pretty fair grader and test/quiz writer imo. most of the quizzes and tests have content that he covered pretty extensively in class. only reason i would dock him 0.5 is because you're never explicitly told what to study/expect for the weekly quizzes, but it's relatively easy to extrapolate based on the content we've covered in the last week. also, ta grading isn’t very standardized either. i got 0.5 points taken off on a quiz for missing an annotation but one of my friends got 2 points taken off so it’s really just luck atp. he's also a really good lecturer and if you focus in class, you'll definitely understand what he's talking about. he gives study questions before every quiz, so i'd suggest studying with another person (this really helped me this year). overall, definitely take fawzi if you have the option.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T20:40:41.363492Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "I had a pretty great experience with Fawzi and his class. I felt like the quizzes and exams were pretty fair, and the projects were always somewhat neat. He's a great lecturer, and his classes are always pretty entertaining to sit through to some degree. As some other people have mentioned, though, his powerpoint slides are pretty barebones and he doesn't record lecture, which makes it a little difficult if you have to miss class at some point. He also doesn't allow you to take notes on your laptop, but that didn't really end up being a problem for me because he didn't make a fuss about people writing on tablets.", "rating": 5, "expected_grade": "A", "created": "2023-12-18T20:43:16.435029Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is an amazing lecturer. He makes everything super clear and entertaining. It is easy to get near perfect scores on the projects as long as you test your code. Quizzes are a bit stupid at times and graded harshly. I find his study questions helpful for studying for quizzes. Exams are fair. All grades were rounded which was nice.", "rating": 5, "expected_grade": "A", "created": "2023-12-18T20:50:47.015977Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Beautiful professor, can be funny and personable, course does take work but a very enjoyable class and lectures are very engaging\r\nTake Fawzi whenever possible", "rating": 5, "expected_grade": "A-", "created": "2023-12-19T04:24:02.254450Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Great professor, has a clear talent for explaining things in a clear and concise manner. He also responds to email in an imrpressively timely manner, given that he had like 600-700 students this semester. That being said the class has a lot of material, so do NOT miss a lecture. Overall a very fun course though and you certainly learn a lot.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T13:35:39.709594Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Great lecturer and very fun professor. His lectures are sometimes fast paced but that is because he has to get through all the material. TA office hours were from 9-5 Monday through Friday. He really makes you understand the material through weekly quizzes and programming projects.", "rating": 5, "expected_grade": "B", "created": "2023-12-19T15:49:29.841975Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "The Fawzi rule: if you see his name next to a course, you take it. (Unless another section has Nelson, then it depends on your personality). \r\n\r\nPros: \r\n- The clearest, most focused and concise lecturer there is. Every lecture, he gives you exactly what you'll be expected to know: no confusion/ambiguity/wastes of time. You just have to be there, and you'll understand. I'm not lying: going to lecture felt like connecting a flash drive to my brain and downloading the entire course. He's just that good. \r\n- No recordings as is noted, but the slides are substantial enough that if you took notes in your lecture, you can find everything you need. \r\n- Extremely cracked at answering questions. Assuming you ask appropriate ones (no out of pocket ones), he'll be super clear and go in-depth. As a bonus, he'll often say \"I might ask you that on an exam\" when answering questions, then tell you the answer. I think at least 4 times in the semester, somebody's asked a question, Fawzi's said that, and then that question shows up on the exam (free points!). \r\n- Quizzes are veryyy predictable. I think I correctly predicted what would be on them for 8/10 quizzes we had. Essentially, he takes what you did the previous week, have a definition section, and a coding section which will be a slight variation of code done in lecture/lab. Essentially, if you study your definitions, do the labs, and remember the programming examples from lecture, you're guaranteed at least a 90 on all of them. \r\n- Exams are extremely fair. Exam 1: 85 median, Exam 2: 89 median, Final: 85 median. As mentioned before, he'll sometimes give you exam questions&solutions in lecture if you ask questions. Just like the quizzes, his exams are just definitions/applications of rules + coding problems. The coding problems are highkey easy: on every single exam, he stole a problem off of one of our labs, so if you study the labs, you'll be good. This really came to a head in the final: we had 3 programming questions, one was ripped straight off a lab, another straight off an example we did in class, and another straight off a project we did. Provided you study the code in the lecture examples, your labs, and your projects, you have nothing to worry abt :)\r\n\r\nCons:\r\n- Fawzi really does not exist outside lecture. If you have a problem, I don't think he'd be that flexible. He'll answer quick emails but nothing else. But don't worry, bc the course + lectures are clear enough you shouldn't need that extra help/support.", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T17:12:16.083904Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Super mixed feelings about Fawzi. On the one hand, he is a super captivating lecturer and interesting person to listen to. He is clearly very intelligent and talented. The issue is that he's fully aware of this, and comes off as really egotistical and stubborn. He doesn't like being corrected and can treat questions very rudely sometimes. \r\n\r\nI'm new to programming and ended with a B-, and because I had a heavy courseload this semester and was kind of spread thin, I will definitely admit that I could have put more work into this class. HOWEVER. I personally thought that the weekly \"mystery topic\" quizzes were ridiculous (\"You should be studying everything\", he says). Again, I was taking a fairly heavy courseload and while it would be nice to study All The Course Content All The Time, in my opinion it's kind of an unreasonable ask on a weekly basis. My quiz average is what ultimately tanked my grade, despite doing well on the midterms and *decent on the final.\r\n\r\nIt will feel like he doesn't really want everyone to succeed so that whoever's not up to par will be naturally weeded out. If you're taking 132 with Fawzi, you'll have a super engaging lecture to look forward to, but make sure you have the time and bandwidth to do what he expects of you. It's a lot, but you can succeed in this class if you prepare!", "rating": 2, "expected_grade": "B-", "created": "2023-12-19T21:14:31.645326Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "He’s a fine lecturer. Talks super fast and doesn’t record his lectures. His lecture slides are useless. Weekly quizzes suck. His midterms were straightforward and his final was challenging but fair. His quizzes and exams are graded ridiculously, with minor errors taking off almost all the points of a problem. No piazza. He seemed like a nice enough guy. I think he might be a better choice for a class like 250, but for 132 I’d take someone else.", "rating": 2, "expected_grade": "C+", "created": "2023-12-21T00:02:28.981512Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is a pretty entertaining professor and presents material very well. That being said, he doesn't post lecture videos and the slides are pretty vague, so make sure to show up to class and take good notes. Exams and quizzes are pretty fair, just make sure you study the material, he does test you sometimes on some things that you might not find to be too important. Pretty similar to other reviews here, the way he structures his class forces you to develop better learning habits, but his lecturing is good, so it's fine.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T05:05:00.044065Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "An honest review after taking Fawzi for 131 and 132: His class is not easy. If you want an easy grade, take someone else. However, if you want incredibly engaging lectures and projects that are interesting to implement, you take Fawzi. If you're willing to put a bit of extra effort in to get the best CS experience, TAKE FAWZI.\r\nHe has weekly quizzes, which I liked because it forced me to study weekly instead of cramming. His quizzes and exams are very fair. If you've been attending lectures, taking notes, and studying often, you'll have a great chance at an A.\r\nPros:\r\n- Very engaging lectures (You won't fall asleep)\r\n- He's very good at explaining concepts using examples.\r\n- Interesting Projects (Lots of very useful TAs during discussions and 9 am-5 pm office hours)\r\n- The TAs hold review sessions before every exam which are VERY helpful\r\nCons:\r\n- Lecture slides aren't always detailed (You need to listen to details in the lecture because he may test you on it)\r\n- Projects can be difficult and time-consuming, but there are lots of OHs to help\r\n- Fawzi's class becomes difficult if you get sick because lectures are mandatory if you want to do well in the course (He does not record lectures)", "rating": 5, "expected_grade": "A", "created": "2023-12-31T02:34:17.817567Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "tough but fair professor. would recommend \r\npros:\r\ngood lecturer, you will learn a lot\r\nvery responsive with regrade requests\r\nexams are tough but fair, pretty much asks stuff from lecture and projects and if you take good notes you will do fine\r\n\r\ncons:\r\nlectures arent recorded and slides are pretty bare :/ but lectures are very captivating so isn't the biggest chore going to them\r\nTHREE RELEASE TOKENS A DAY this will annoy the hell out of you but honestly forced me to start projects early and have good habits\r\napparently not accommodating? didn't have any experience with this but can imagine how this can be concluded \r\nweekly quizzes are annoying, but kept me accountable with the weekly material tbh and weren't worth that much points wise\r\n\r\nfawzi is a very old fashioned professor, but you will learn a lot and adopt good habits", "rating": 5, "expected_grade": "A", "created": "2024-01-05T17:45:25.518987Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Simply put, Fawzi is the GOAT. I didn’t even consider myself to be that interested in CS before this course, but he makes his lectures super engaging and he always sounds excited about what he teaches. Even though the material for this course is sometimes a bit tricky, he always explains things super well and makes things easy to understand (also his coding examples REALLY help explain the concepts he’s teaching). The “no laptops” during lectures rule may seem kind of annoying, but it honestly really helps you focus and learn better. If you take him though, DO NOT SKIP LECTURE. He does allow you to voice record lectures on your own if you need to, but he will not post the lecture recording - just the slides which are pretty bare-bones. This way of teaching really helped me stay on top of things and succeed, but I can't guarantee it will work for you.", "rating": 5, "expected_grade": "A+", "created": "2024-02-22T19:03:25.472617Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "At first I didn't necessarily like the way he taught since I suppose I was more used to having professors recording their lectures and letting us have our electronics out. With Fawzi, although he does not record lectures, doesn't let you have electronics out, and has weekly quizzes that he doesn't tell you what is going to be on it (it's honestly very predictable what's going to be on the quizzes if you go to lecture and pay attention), he is honestly an outstanding lecturer. He explains everything so clearly yet quickly. Fawzi isn't a bad professor, his lecture examples are very helpful and the coding problems on his exams are almost from those examples and discussion lab work. If you come into lecture, pay attention, and try to at least take notes and have good study habits, you will be fine. It is okay to stress over this course because I struggled too, but he does not trick us on exams and quizzes, they are straightforward and he provides us so many resources for us to study from. TA's give us study questions and hold review sessions. The projects can be VERY annoying but if you start early and go to office hours you will be a-ok.", "rating": 5, "expected_grade": "", "created": "2024-02-22T20:06:38.224708Z"}, {"professor": "Fawzi Emad", "course": "CMSC132", "review": "Fawzi is an okay professor. Although he is a very good lecturer he barely provides any resources to study so it is quite hard to prepare for exams. 132 is quite easy if you understand data structures. Since this is a coding-heavy class it is really easy as you can just look at code examples from class and projects to study. I am currently taking 250 with Fawzi and it is not a good idea since 250 is a mostly math course and he provides little to no practice for exams. He is an okay professor for 132 but don't take him for 250.", "rating": 4, "expected_grade": "A+", "created": "2024-03-12T00:17:30.046224Z"}], "name": "Fawzi Emad", "slug": "emad_fawzi"}