{"courses": ["AAST498E", "AAST398D", "AAST498O", "LGBT448E", "AMST328J", "AAST498Q", "AAST363", "AAST363", "AAST498Q", "AAST363", "AAST363", "AMST328J"], "average_rating": 1.5, "type": "professor", "reviews": [{"professor": "Gemirald Daus", "course": "AAST498Q", "review": "This class meets for 2.5 hours a week, but this class is a lot of work. We have weekly readings (which are not short), a case study paper as the final (10-15 pages), at least two 750 word papers, and a demographic profile presentation/paper that is not easy (and you have to do it with a partner). Our last reading required a two-page double-spaced reflection paper. I would really not suggest taking this class, it's giving me a headache more than my other classes. I have no idea how harsh his grading is yet, but I'm not too hopeful.\r\n\r\nGem's actual teaching is okay, this class is participation heavy so if no one talks, we're all just sitting in silence. It could be an interesting class since some of the topics we have learned about are interesting, but due to the workload, I view this class as a burden.", "rating": 2, "expected_grade": "", "created": "2023-02-25T21:39:56.515641Z"}, {"professor": "Gemirald Daus", "course": "AAST498Q", "review": "The way this class is structured is pretty even, but the workload for an upper-level AAST elective is ridiculous. Professor Gem assigns weekly assignments ranging from reading 2-3 short articles on Perusall to something outlandish such as reading 20-30 pages of an article, only for both to be graded similarly. As a result, it's a class that's more of a headache and chore rather than something enjoyable.\r\n\r\nAs the previous review states, it's more of a headache, and he grades exceptionally harshly. For the essays, he treats them as if they were a Ph.D. dissertation and dings point for GRAMMAR. This isn't an English course; it's an Asian American studies course. He expects everything to be MLA cited; if he sees any discrepancy in the information provided, he will drop it by a grade. This course is more brutal and annoying rather than fun and exciting.", "rating": 1, "expected_grade": "", "created": "2023-04-18T21:32:58.782535Z"}], "name": "Gemirald Daus", "slug": "daus"}