{"courses": ["ANTH448F", "ANTH298D", "ANTH240", "ANTH305", "ANTH451", "ANTH341", "ANTH688F", "ARTH305", "CLAS305", "ANTH651", "ANTH641", "ANTH242", "ANTH358A", "ANTH251", "ANTH436", "ANTH636", "ANTH789", "JWST319Y", "ANTH451", "ANTH651", "ANTH242", "ANTH305", "ANTH451", "ANTH453", "ANTH651", "ARTH305", "CLAS305", "JWST319Y", "ANTH242", "ANTH341", "ANTH641", "ANTH789", "ANTH789", "ANTH451", "ANTH651", "ANTH341", "ANTH436", "ANTH636", "ANTH641", "ANTH222", "ANTH451"], "average_rating": 4.4615, "type": "professor", "reviews": [{"professor": "George Hambrecht", "course": "ANTH242", "review": "Great professor. He is very passionate about the subject which makes his classes very enjoyable. ", "rating": 5, "expected_grade": "", "created": "2020-05-12T23:47:38Z"}, {"professor": "George Hambrecht", "course": "ANTH242", "review": "He loves this subject which is reflected in his course work, he is so understanding and will be willing to work with you! also sometimes he brings his dog to class which is a bonus but I highly recommend taking him! I loved this class", "rating": 5, "expected_grade": "A", "created": "2020-05-14T23:13:53Z"}, {"professor": "George Hambrecht", "course": "ANTH242", "review": "I don't know what was up with him this past term but he barely taught me anything. There was a point in the semester when I forgot I was even taking this class. It consisted of five 10-minute reading quizzes and then just 2 projects towards the end. Communication was bad since he barely emailed back and would skip over things in the syllabus. Half the time he never uploaded any lectures. He never even made any real contact with the class until we were 2 weeks into the semester. Throughout the semester it was super easy with barely any work and then at the end there are two big projects that determine your grade. ", "rating": 3, "expected_grade": "A+", "created": "2021-05-24T22:37:09Z"}, {"professor": "George Hambrecht", "course": "ANTH242", "review": "I found his lectures engaging to listen to and he was an interesting person to talk to. The projects were interesting and not difficult. The only real complaints I have are that the reading quizzes we had were graded strictly and the ELMS pages was a bit unorganized. I'm an archaeology nerd, so I really enjoyed this class, but I know others who were in this class and weren't anthropology people found this class a not interesting. He also brings his dog to class which was a major plus. ", "rating": 5, "expected_grade": "", "created": "2022-05-12T23:29:25Z"}, {"professor": "George Hambrecht", "course": "ANTH242", "review": "Super easy class, lenient grader, interesting lecturer/guy in general, easy A.", "rating": 5, "expected_grade": "A", "created": "2023-01-08T05:10:33.606941Z"}, {"professor": "George Hambrecht", "course": "ANTH242", "review": "I would say that this class is definitely geared toward those who are interested in anthropology, as Dr. Hambrecht is clearly very passionate about the content covered and lectures were on specific topics. That being said, I really enjoyed it! It was a project-based class with no tests or quizzes, which is my preferred class structure, and the 2 big projects we had to complete weren't too difficult. Dr. Hambrecht is a really chill professor who wants people to succeed in the class, which was also great. As others have mentioned, he also will bring his dog to class where he'll walk around and hang out. Great class overall!", "rating": 5, "expected_grade": "A", "created": "2023-06-14T17:08:49.845398Z"}, {"professor": "George Hambrecht", "course": "ANTH240", "review": "He brings his dog to every class, what more could you want? \r\n\r\nNo but he is a very genuine guy. A little spacey, clearly doing a lot, but he is understanding and willing to work with you. Do not expect responses to emails, but still send them because he will immediately forget whatever you talked to him about otherwise. \r\n240 is not a class he normally teaches. Take-home quizzes make up the majority of your grade. There are big projects near the end of the semester but you get a LOT of time. \r\nThe subject matter can be pretty boring if it's not your passion, but if you're in to prehistoric human burials it's an interesting class.", "rating": 4, "expected_grade": "B", "created": "2023-12-04T20:47:26.151627Z"}, {"professor": "George Hambrecht", "course": "ANTH240", "review": "Dr. Hambrecht is a really good professor.  He genuinely cares about his students’ learning and adjusts his assignments accordingly.  He makes the subject very interesting because of how engaging he is during lecture and how much he clearly enjoys talking about it (he would have a successful podcast if he wanted to start one).  The class structure is very simple with reading quizzes every few weeks and a couple of easy projects.  Final is a take home essay assignment.  Overall a great gen-ed that was really really interesting but also an easy A.", "rating": 5, "expected_grade": "A-", "created": "2023-12-07T14:46:38.561748Z"}, {"professor": "George Hambrecht", "course": "ANTH240", "review": "This professor is very passionate about this topic which made the lectures very interesting and engaging. I had this class at 9:30 and the slides were posted on ELMS but I still got up and went to class because his lectures were so interesting (at least to me). There were about 5 quizzes the entire semester which were pretty straightforward and easy since they are take home and open note. He assigned a textbook for us to read but I think if you attend lectures you can get away with not using the textbook. There were two other assignments besides the quizzes: a project where you compare two archaeology articles and the final exam. The final exam was 3 two page essays which I was not expecting. I figured it would be a cumulative exam but he announced that it was essays on the last day of class. I'm not complaining though because how easy the rest of the semester was cancels out the time spent writing those essays.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T19:02:20.133812Z"}, {"professor": "George Hambrecht", "course": "ANTH240", "review": "I expected this class to be easy and interesting but it was neither. Quizzes make up the biggest section of the grade and involve niche subject matter found in an incredibly dense textbook. The lectures were long, boring, and not often related to the graded quizzes and assignments. Dr. Hambrecht is clearly very passionate, opinionated, and knowledgeable about archaeology, but this class was my biggest regret this semester.", "rating": 3, "expected_grade": "A-", "created": "2023-12-20T20:46:29.118912Z"}, {"professor": "George Hambrecht", "course": "ANTH451", "review": "Hambrecht is a chill professor. The class is easy, and you will learn a lot. The professor is often disorganized regarding homework assignments and responding to emails, however he grades so leniently that it doesn't really matter. The professor is a supreme expert in environmental archeology, and you will learn a lot about environmental archeology in this class. The only thing to worry about is the final paper, which was a large undertaking. But, the professor will help you as much as you need for it (suggestions on where to start, doing some research for you, \"feedback at any stage\") and he graded it pretty leniently. I'd recommend this teacher, and I'd recommend this class.", "rating": 5, "expected_grade": "A", "created": "2023-12-28T05:26:32.708052Z"}, {"professor": "George Hambrecht", "course": "ANTH240", "review": "He clearly loves teaching and there honestly isn't much work at all. There's maybe 5 quizzes total, two big assignments, and a final paper. That's all, and he doesn't seem to grade harshly and is very fair. I forgot to take the first quiz and he let me retake it with no issue. Amazing guy and even better professor.", "rating": 5, "expected_grade": "A+", "created": "2024-01-03T21:32:22.094893Z"}, {"professor": "George Hambrecht", "course": "ANTH240", "review": "I took this class Fall 2023 thinking it was an easy elective; I was wrong. Although at the beginning of the semester it wasn't a lot of work which was kind of nice, BUT at the end of the semester you'll have 3 major assignments due including the final. Lectures were long, boring and they were not related to the quizzes on canvas. Textbook was long and confusing; quizzes were based 100% on the textbook. The course in ELMS was so unorganized, quizzes had lots of errors that TAs and Professor would have to go back and double check everything. Professor Hambrecht is very passionate about this class and it's reflected during lectures. He brought his dog everyday to lecture which was nice.", "rating": 3, "expected_grade": "B+", "created": "2024-01-20T01:38:24.935586Z"}], "name": "George Hambrecht", "slug": "hambrecht"}