{"courses": ["ENGL101", "ENGL297", "ENGL243", "ENGL398B", "ENGL222", "ENGL398B", "ENGL398N", "ENGL398N", "ENGL398N", "ENGL319C", "ENGL420", "ENGL398A", "ENGL422"], "average_rating": 4.8333, "type": "professor", "reviews": [{"professor": "Gerard Holmes", "course": "ENGL101", "review": "Really great guy. I took his course online. He really cares and understands that students have personal things going on in their lives too so he'll help you with assignments and deadlines.", "rating": 5, "expected_grade": "A+", "created": "2020-12-20T19:23:42Z"}, {"professor": "Gerard Holmes", "course": "ENGL101", "review": "Stand up guy. He accommodated students well during the pandemic, was easy to communicate with, fast response time, all that. The course load was sometimes overwhelming and it felt like we barely had any time. But besides that, he was super nice and made it manageable. ", "rating": 4, "expected_grade": "A+", "created": "2020-12-21T10:59:33Z"}, {"professor": "Gerard Holmes", "course": "ENGL222", "review": "Really great professor! Throughly enjoyed his class. The texts he assigns aren’t too long. The class was discussion heavy so be prepared to participate.", "rating": 5, "expected_grade": "A", "created": "2022-05-18T13:27:23Z"}, {"professor": "Gerard Holmes", "course": "ENGL398N", "review": "The actual GOAT. His class and rules are exceedingly simple: You do the assignments with a modicum of effort and you get an A+ in the class. (The reason I have an A and not an A+ is that I skipped a lot. Now before you sound the alarm bells over attendance!! hear me out)\r\n\r\nGrading: \r\n1. Bi-weekly discussion posts and mini-writing assignments. May seem an annoying time chore but these are graded on COMPLETION only, so you just need to write something. It's free points and takes like 20 minutes of your day. \r\n\r\n2. About 3 big papers split up into multiple sub-sections. These are graded VERY leniently (esp the drafts) so as long as you stick with the deadlines (which are fair as you have weeks to complete assignments) you will get 90+ on everything\r\n\r\n3. Effort grading. Show up at least twice for the in-class peer review (end of semester), and at least once a week. Also, make sure to provide peer feedback whenever assigned on elms and you get both of these credits for free.\r\nThat's literally it. No exams no nothing. Holmes grades pretty much everything on completion more or less as long as it looks like you tried decently well. As long as you keep up and do the work on time this is a free A. The sole difficulty of this class is just that there are a lot of little weekly assignments (the discussion posts and other minor mini-writing assignments) so you just need to remember that they exist and do them. Look at your Canvas calendar every day and you will be fine.\r\n\r\nClass Content:\r\nIt's about non-profits and as a CS major it wasn't terribly interesting or applicable to me. The content itself is also somewhat surface-level and easily learned from Google and can be seen as an intro to writing grant proposals and public relations papers. Not the most exciting of content but hey you're here for the free GPA and the PW credit anyway. \r\n\r\ntl;dr: Easy A, W prof, he's the goat take this class. (Also like no one ever signs up for this since it's so obscure so if he is teaching this or any PW class take it)", "rating": 5, "expected_grade": "A", "created": "2023-05-26T05:13:04.003131Z"}, {"professor": "Gerard Holmes", "course": "ENGL398N", "review": "Gerard Holmes is the GOAT, I cannot say enough nice things about him. If you have the option to take him absolutely do, one of the nicest and most understanding professors I have ever had he is an engaging professor, doesn't take himself too seriously and is willing to work and help you with anything that you need an absolute king.", "rating": 5, "expected_grade": "", "created": "2023-12-01T20:35:54.131794Z"}, {"professor": "Gerard Holmes", "course": "ENGL398N", "review": "As a CS major, this was an easy/rewarding course. Professor Holmes is an amazing professor and makes every step of the process extremely clear. The assignments fall into two categories: discussions and assignments. The discussions are pretty self-explanatory and very reasonable. The assignments aren't too lengthy (expect 1-2 pages per assignment). The final grant-proposal (the majority of your grade) is a culmination of all the previous assignment with some tweaking you've done along the way. Overall, great course if you're looking to fill your FSPW requirement or just looking for a great class to learn about the non-profit sector.", "rating": 5, "expected_grade": "A+", "created": "2023-12-29T03:55:40.749301Z"}], "name": "Gerard Holmes", "slug": "holmes"}