{"courses": ["MATH401", "MATH410", "AMSC808X", "AMSC460", "CMSC460"], "average_rating": 3.7143, "type": "professor", "reviews": [{"professor": "Haizhao Yang", "course": "MATH401", "review": "Probably the worst professor I've had at UMD. Nice guy but his exams are entirely too long, gives out way too much homework, a lot of lectures are confusing and/or not on what we will be tested on, and he is a harsh grader when it comes to exams. Do not recommend!", "rating": 1, "expected_grade": "C", "created": "2023-04-18T16:42:00.266597Z"}, {"professor": "Haizhao Yang", "course": "MATH401", "review": "Please ignore the other guy. Professor Yang is a good guy. He gave out a very fair first exam, which was literally the exact same as our homework problems. The second exam was definitely way harder, but he was literally doing the midterm WITH us (probably because he chose some random homework problems without checking them over and wanted to make sure the problems were okay). When he realized it was too hard, he said \"Forget about problem 3. That one's too hard.\" He seemed very apologetic the next class in which he discussed the exam, asked for and listened to our feedback (a lot complained about having to factorize a cubic and working with a 4x4 matrix), and told us \"I'll grade very kindly for this exam\" and \"I'll only give 2x3 and 3x3 matrices from now on\" and \"I'll make sure this doesn't happen again for the final exam.\" The person who gave a 1 star review probably didn't even go to that class because a lot of people skip lecture (and his lectures are admittedly not very helpful). For more information about the class, there's homework every week, and they are just ~10 exercises from the textbook. Each homework took me about 1-1.5 hours. He also gave us a few MATLAB projects throughout the semester where he gave us some code and we basically had to \"modify\" the code to do what it was supposed to do. Each project took me about 2 hours. I'm docking a star because he gave us homework and a project over spring break and because he really should've checked over the midterm problems before, not while, we took it.\r\n\r\nTLDR; Easy homework, easy matlab projects, kinda useless lectures, exams are fair. He messed up once, but he's planning on compensating us. He listens to his students' feedback on how unfair an exam is, which is something I think is worthy of praise.", "rating": 4, "expected_grade": "A", "created": "2023-04-21T17:16:04.614738Z"}, {"professor": "Haizhao Yang", "course": "MATH401", "review": "Dr. Yang is an extremely smart and kind professor. However, I find his lectures to be a bit confusing so I prefer to take notes on the textbook, which he directly follows. The homeworks are a few textbook problems each week, and the exams are problems taken directly from the textbook. The first exam was really fair, however the second one was significantly tricker, but he did not intentionally do that and as a result he graded extremely nicely (I was pleasantly surprised with my grade) and even removed one question from the exam that was harder than he initially thought. The matlab projects aren't too difficult either, just changing a few lines of code. Overall, he really wants his students to succeed and doesn't try to make anything unnecessarily tricky", "rating": 4, "expected_grade": "A", "created": "2023-04-24T21:58:24.213104Z"}, {"professor": "Haizhao Yang", "course": "MATH401", "review": "Pros: \r\n-Very nice guy.\r\n-Gave exam problems similar to homework problems.\r\n-Made himself accessible and was always willing to answer questions. \r\n-Very thorough during lectures. \r\n\r\nCons: \r\n-Course is a glorified rehash of MATH240. You won't really learn anything new. Did not feel like an \"applications\" of linear algebra class at all. The only applications we did were a few short Matlab projects which did not feel useful. \r\n-Lectures were confusing sadly due to his accent... he also did a lot of proofs which some might appreciate but I didn't care since this was an applications class. \r\n-Made a homework assignment and project due during the middle of spring break.\r\n-Second exam was a disaster because he did not work out the problems on his own ahead of time. This led to questions that had immense computational cost and questions that were practically unsolvable. He apologized though and tried to give as much partial credit as possible. \r\n\r\nThis was Dr. Yang's first time teaching this course, so some leniency is certainly in order. By the time the next set of students takes it, it may be a completely different course. I wouldn't particularly recommend taking this class with Dr. Yang the way it's currently structured, but he really is a nice guy who cares about his students.", "rating": 3, "expected_grade": "A", "created": "2023-05-13T15:09:43.373222Z"}, {"professor": "Haizhao Yang", "course": "MATH401", "review": "This guy is the absolute goat. He's super chill and lenient with grading and his exams are cake. Homeworks and Matlab projects are very easy but there's one every week which isn't too bad. Lectures are hard to follow because he's more focused on presenting mathematics from a research perspective rather than a teaching perspective, but he doesn't expect us to know and doesn't test the complex material so it's not a big deal. You can just grind the textbook and do practice problems and then you're guaranteed a good grade. He's also very accommodating to students as well in terms of receiving feedback and changing exams so we're more tested on concepts with smaller matrices rather than computations on large matrices Take this guy for any class he teaches. You won't regret it.", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T13:18:00.583746Z"}, {"professor": "Haizhao Yang", "course": "MATH410", "review": "HE'S THE GOAT. THE ABSOLUTE GOAT. IF HE TEACHES THIS CLASS AGAIN YOU HAVE TO TAKE AS SOON AS POSSIBLE. I have never been more excited to review a professor because he makes the class super interesting and intuitive. Office hours are super useful. Just take any class with this guy tbh.", "rating": 5, "expected_grade": "A", "created": "2023-12-16T06:20:39.427837Z"}, {"professor": "Haizhao Yang", "course": "MATH410", "review": "Really chill, very nice. cancelled the 2nd and 3rd midterm. lectures were boring though, but treated us as extra elementary which was nice.", "rating": 4, "expected_grade": "B-", "created": "2023-12-20T00:50:47.722940Z"}], "name": "Haizhao Yang", "slug": "yang_haizhao"}