{"courses": ["PSYC100", "PSYC234", "PSYC353", "PSYC100", "PSYC234", "PSYC433", "PSYC100", "PSYC234", "PSYC433", "PSYC100", "PSYC234"], "average_rating": 4.0909, "type": "professor", "reviews": [{"professor": "Heather Ganginis DelPino", "course": "PSYC100", "review": "Very easy class, but her lectures do not cover anything about the exams and oftentimes even the chapters. If you want to take a class about racism take this class. I often was scared to challenge her because I am a white male and was afraid she would tell me I am using my privilege over her. When teachers begin to suppress people's ideas and not have an open mind, this becomes dangerous. ", "rating": 2, "expected_grade": "A", "created": "2021-12-10T21:46:41Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC234", "review": "The course has light workload and is easy in general. On the downside, the course is so easy you hardly learn anything aside from how to set your mentality. Del Pino does her best to be understanding and encourages the students to express their thoughts on a topic, no matter how small. Majority of her topics include current news, such as the impact of COVID and racism. If you are interested in discussing world issues or a personal matter emotionally, or just an easy course to fill a requirement, this is for you. At the very least, make sure to properly complete your assignments, especially your final project as exam, as those two have the ability to completely flip your grade. If concerned, you can reach out to the professor or TA for review or help, make sure to if you question anything, since it is difficult to change the grade if not impossible once it's set out, with an exception of late assignments. On the other hand, Del Pino does offer multiple extra credit opportunities that will remain open for the majority of the semester.", "rating": 3, "expected_grade": "", "created": "2022-01-11T23:04:42Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC234", "review": "Easy class. You really only need to come to one of the two classes every week. The class times are just a group therapy session which is nice. She records every class, but if you participate in class she will like you. Follow the rubric for the assignments and you will get a 100. The final is a group presentation and a research paper.", "rating": 5, "expected_grade": "A+", "created": "2022-01-14T20:54:12Z"}, {"professor": "Heather Ganginis DelPino", "course": null, "review": "Mrs. DelPino is super nice and very laid back. I took her PSYC234 class and there was hardly any work. As long as you do the readings and complete the weekly reflection on time you should be fine. The classes are a bit boring but it is worth the easy A. She really cares about her students. I highly recommend this class.", "rating": 5, "expected_grade": "A", "created": "2022-01-24T23:54:23Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC353", "review": "Listen, Heather is a really nice woman, and she cares about psychology and discussing racial/societal issues, but does not cover class content. I took this class and was so excited, as I want to go into counseling so this class was important. Unfortunately, we spent 75% of class talking about her personal stories with clients or issues within society. At first, I enjoyed this. It has been helpful to hear her personal experience in the field, as well as understanding the ways in which racism, classism, gender, etc., play into the concepts we discuss. However, after a few classes I realized that this was the whole class. We never went over things in depth that were on exams. Towards the end of the semester, quizzes and exams had incorrect answer keys, which were only pointed out by students when their correct answers were marked wrong. The class is relatively easy, as paying attention is not necessary... since content is not discussed. Overall, she is a kind, understanding, and caring person, but she should really be teaching PSYC232- Psychology of Racism. ", "rating": 2, "expected_grade": "A-", "created": "2022-04-20T02:44:28Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC100", "review": "This class is overall very easy, you have reading quizzes that are online, easy papers that as long as you reach the page limit you should get a 100%, and three exams that are open book and open note that you take online. But the lectures are a waste of time honestly, you learn more from the book than you do from listening to her because she would talk about politics a lot. And as someone who doesn't share her views, I would just stay silent. But she is a very nice teacher and is very fair and reasonable (you don't even have strict due dates) and it was nice hearing her personal stories sometimes but the content just turned into a political tangent and some of the writing is very political.", "rating": 4, "expected_grade": "A", "created": "2022-12-01T00:44:40.149822Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC234", "review": "Starting off, the teacher is super kind. She is extremely understanding of differing viewpoints and even regarding missing assignments. The class aspect has weekly assignments where one has to reflect on the week's reading, always got a 100%. Class attendance is recorded but I am unsure if it affects one's grade. The only negative is that the classes are a bit boring but I enjoy the class discussions. I definitely recommend taking this class because it is an easy A and she truly cares about her students.", "rating": 4, "expected_grade": "A+", "created": "2022-12-08T20:06:52.929760Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC234", "review": "Easy class, super kind professor who actually cares about students. Class is a \"book club\"-y experience, where you read a couple chapters and discuss them in class. No imposed deadlines except for exams. Could be a pro or a con depending on your style. Weekly 1-2 page assignments reflecting on reading. Some bigger assignments (e.g. group presentation), but nothing crazy.  Final exam not in person, can turn in online.", "rating": 5, "expected_grade": "A+", "created": "2022-12-08T23:17:41.690139Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC100", "review": "Great professor and an extremely easy class. She accepted late work with no points off. She explained the content well and always knew the answers to student questions.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T18:03:27.827332Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC100", "review": "Honestly, this class is really easy to get an A with the assignments she assigns to us. The only assignments you turn in are chapter reflections, which are pretty straightforward, plus chapter reading quizzes which should be simple to do as well. There will also be mini exams after a couple chapters, but luckily they're online, which is the benefit. She is a very kind person and she shows dedication in her teaching. She explains her lectures really well and they are easy to understand, a lot of the notes I would write down are based on what she says rather than what would be on the lecture slides so that shows how interesting her explanations are. She tries to use up her time with digesting each chapter and I believe it is worth learning and gaining from from this professor, would recommend her. Besides easily passing her class, but also learning things from her.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T05:08:59.699342Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC100", "review": "Lovely professer, very nice and empathetic teacher who was very understanding with assignments. I liked how she uses her clients experiences to relate to class chapters. Would take again! :) Exams are online and you can take them anywhere, as well as the quizzes (super easy, answers are directly in the chapters).", "rating": 5, "expected_grade": "B+", "created": "2023-12-07T22:17:25.350128Z"}], "name": "Heather Ganginis DelPino", "slug": "delpino"}