{"courses": ["ENGL212", "ENGL101", "ENGL244", "ENGL101A", "ENGL101S", "ENGL255", "ENGL241", "INAG110", "INAG299A", "INAG299B", "INAG288", "INAG289", "UNIV110", "INAG252", "INAG110", "INAG199", "INAG110", "INAG199", "INAG199C", "INAG199D", "INAG288", "INAG199", "INAG206", "INAG199", "INAG199C", "INAG288", "INAG199", "INAG199C", "INAG206", "INAG199", "INAG199C", "INAG199E", "INAG288"], "average_rating": 4.75, "type": "professor", "reviews": [{"professor": "Heather McHale", "course": "ENGL101", "review": "Great teacher. She is a fair grader and actually tries to improve your writing. I wish she would diversify her in class readings though since every article we read was about women/feminism. ", "rating": 5, "expected_grade": "A-", "created": "2013-12-24T17:07:00Z"}, {"professor": "Heather McHale", "course": null, "review": "Great professor! I had her for British Literature. The class was A LOT of reading (5 novels and some short stories), but the pieces we read weren't that bad. Only 2 papers the whole semester, and she is very helpful if you have trouble writing the papers.\r\nGoing to lectures is a must! There are quizzes on most of the pieces we read, but if you actually read the piece then the quizzes are pretty easy. Lecture can be a bit boring, but it really helps with understanding the text and preparing for the final.\r\nOverall, not a bad HL class.", "rating": 5, "expected_grade": "A", "created": "2012-05-14T10:42:00Z"}, {"professor": "Heather McHale", "course": "ENGL101", "review": "The course itself is not particularly enjoyable, as it involves several papers and a pretty good amount of busy work, but Professor McHale is a pretty good professor!\n\r\nShe's SUPER liberal, which I loved, but she openly admits it and she's never offensive about it. I felt that sometimes she beat a dead horse with a stick, and class drug on, but in general the class isn't too bad. The class is really interactive, and she's got a nerdy, fun sense of humor. But prepare to wait a longgg time to get your paper graded and returned to you.\n\r\nEngl101 is a hard course to get an A in because the university wants students to take Junior English, so she was a tough grader, but it's definitely possible to get an A. ", "rating": 4, "expected_grade": "A", "created": "2011-12-09T22:30:00Z"}, {"professor": "Heather McHale", "course": "ENGL101", "review": "Her class was my most enjoyable class this semester. She has a sense of humor which makes the class fun, but she expects students to work hard. The work load is not quite as fun as the class; however, all of the English101 classes are tough. \r\nShe is not an easy grader though she is a fair grader.  ", "rating": 5, "expected_grade": "B+", "created": "2010-12-07T13:51:00Z"}], "name": "Heather McHale", "slug": "mchale"}