{"courses": ["ENGL312", "ENGL456", "ENGL275", "ARHU275", "WMST379F", "ENGL398N", "HONR229W", "ARHU318W", "HONR218O", "HNUH248X", "HNUH248X", "ENGL398V", "ENGL398V", "ENGL398V", "HHUM205", "ENGL398V", "ARHU158K", "ENGL398V"], "average_rating": 4.5, "type": "professor", "reviews": [{"professor": "Heidi Scott", "course": "ENGL275", "review": "I felt like the course was a bit too much work for a gen ed class, but it was fun to learn how to write a script. I was expecting a B+ because I got A-'s/B+'s for all my assignments no matter how much effort I put in, but I ended up with an A, so I think she doesn't follow the +/- system. It's a fun class if you're interested in screenwriting, but not an easy A. ", "rating": 4, "expected_grade": "A", "created": "2017-12-21T00:41:10Z"}, {"professor": "Heidi Scott", "course": "HNUH248X", "review": "Dr. Scott adapted the classroom to the online environment very well, so that I was actually able to establish good rapport with her and my classmates. The workload was very fair for the course, and grading wasn't very harsh. The course was a mix of synchronous and asynchronous, so we only met once a week to discuss material that you were expected to review beforehand, and she did a good job of diversifying the week's material so that they weren't all long readings. Midterm was fair and directly related to course content.", "rating": 5, "expected_grade": "A+", "created": "2021-03-04T14:55:41Z"}, {"professor": "Heidi Scott", "course": "HNUH248X", "review": "Dr. Scott is an understanding and personable professor - qualities I found particularly important considering we were virtual for the semester. The course was well organized, complete with relevant course readings (to be done on our own time) and a weekly meeting on zoom to solidify understanding and discuss the material assigned for that week. The midterm was very fair for the course, and we had a final project (individual or group) as the semester drew to a close. I enjoyed the course very much, and would definitely recommend it to those interested.", "rating": 5, "expected_grade": "A+", "created": "2021-05-26T15:19:04Z"}, {"professor": "Heidi Scott", "course": "HNUH248X", "review": "This may be the easiest class I've taken in college so far. We had barely any work and Scott is very understanding and kind. The workload for every week was simply a discussion post, but you work on it with 2-3 other people. The Direct Action project can be worthwhile if you make it, but she also has no way to enforce if you're doing it. There's a midterm in the class based on the weekly readings, and the average in the class for that was an A even though many don't do the readings. The final project is also open-ended and fun. My only complaint would probably be that the actual content of the class just seemed to be her opinions. She does teach us a lot of things, but the whole class was basically her just getting to share her views about everything. ", "rating": 5, "expected_grade": "A", "created": "2022-01-11T18:27:49Z"}, {"professor": "Heidi Scott", "course": "HNUH248X", "review": "Professor Scott made one of the chillest yet most interesting courses I've taken on this University. The work was minimal, with some group discussion posts and occasionally big monthly assignments (Photo Essay, Direct Action Plan & Manifesto, Midterm, Final Project), none of which were particularly hard or time consuming, plus she graded each one extremely leniently. There are weekly modules that she expects us to at least check out, but it's not really mandatory to go through as she also reviews it in class and doesn't have anything graded on it besides for discussion and eventually the midterm. There are also occasional field trips to parts of campus, which means there are days where there's literally only a participation grade with no pressure for additional work. She made the class feel welcoming and is passionate, knowledgeable, thought provoking, and is careful about a subject that could easily be polarized. She does have her own views and is upfront and obvious about it, but she also helps others build upon their understanding and really tries to reconcile both her viewpoint with anyone else's if they clash. Overall she made the class a very enjoyable experience, and if this course is being run again with her I highly recommend taking it with her. ", "rating": 5, "expected_grade": "A", "created": "2022-05-16T12:41:22Z"}, {"professor": "Heidi Scott", "course": "HHUM205", "review": "The class was fine and she's a nice woman, but sometimes she just randomly graded things too hard and she can be very critical", "rating": 3, "expected_grade": "A", "created": "2023-12-20T01:26:41.871409Z"}], "name": "Heidi Scott", "slug": "scott_heidi"}