{"courses": ["BSCI441", "BSCI454", "BSCI329", "BSCI455", "NEUR405", "NEUR479", "BSCI329", "BSCI455", "NEUR405", "BSCI329", "BSCI455", "NEUR405", "BSCI329", "BSCI455", "NEUR405", "BSCI329", "BSCI455", "NEUR405", "BSCI329", "BSCI455", "NEUR405", "BSCI329", "BSCI455", "NEUR405"], "average_rating": 1.4286, "type": "professor", "reviews": [{"professor": "Hilary Bierman", "course": "BSCI455", "review": "Not an interesting class made up of a lot of busy work. The professor is nice but very obviously picks favorites (this has an affect on the grade you get)", "rating": 1, "expected_grade": "A", "created": "2023-04-17T02:47:01.068910Z"}, {"professor": "Hilary Bierman", "course": "NEUR405", "review": "I enjoyed the lab portion for this class, but the lecture was long and wasn't helpful. It is a bit of busy work, but the class itself was not hard", "rating": 3, "expected_grade": "A", "created": "2023-05-15T21:29:05.584427Z"}, {"professor": "Hilary Bierman", "course": "NEUR405", "review": "Was told this was an easy A and it was, but not for everyone. Grading is nearly entirely done by your TA, and some are much harder on grading than others. Class has no curve, so if you get a harsh TA in terms of grading, you will likely struggle to get an A. It is unfair that your grade for each group assignment is a group grade despite each person writing their individual contributions on every assignment, you do not get graded based on your portions only. This sucks because your grade could be bad because of your group members mistakes and your grade does not reflect your own work. Assignments are not difficult but can be time consuming.", "rating": 2, "expected_grade": "B", "created": "2023-05-20T21:53:57.866985Z"}, {"professor": "Hilary Bierman", "course": "BSCI455", "review": "I did not enjoy BSCI455/NEUR405. I took this class because of the promising grade distribution compared to other BSCI courses. However, I should have given these reviews more thought before I signed up. It's not difficult to get an A or A- in this class, but your TA does play a massive part in the grades that you receive. Some people get lucky with a TA who grades leniently and is easy to communicate with, while others do not and must fend for themselves. In my opinion, the 2-hour lecture once a week is unnecessary: it doesn't do much to help you more in the class if you do all the readings and assignments on your own. You can expect to stay in the lab for the full 4 hours every week (besides the first couple of labs) even if your group members are well-prepared and did all the pre-lab readings and assignments. The assignments for this class are pretty straightforward, but they do take up quite a bit of time, and all of the big assignments are graded as a group. I do kind of agree with the review that the professor picks favorites, but it doesn't take much to get on her good side. Just be participative in class, and she'll learn your name and face pretty quickly. I think the hardest part of this class is doing the dissections in the lab and obtaining data, and troubleshooting can take you up to a couple of hours each week. All in all, this proved to be a lot of headache for a 3 credit course, but it's a given that you will get a decent grade.", "rating": 1, "expected_grade": "A-", "created": "2023-12-11T16:12:03.012453Z"}, {"professor": "Hilary Bierman", "course": "NEUR405", "review": "This class is so much work. Every week you have a prelab quiz, post-lab worksheet, pre-lecture reading, a four hour lab, in lecture worksheet, and a lab report due. The groups are divided up unequally. Some people have groups of five, which end up having way less work. If you are in a group of three people, you are basically cooked. You have to do so much more work with the same deadlines, and the grading does not reflect this. None of the experiments are going to work, so you have to pull everything out of your %. Everthing about this class is frustrating. She is also so condecending when you talk to her or ask for feedback. She is so uneducated at everything besides neurosceince. For the final project, she expects your research to be as good as a one year research project. If you have a chill TA, getting an A is not that difficult if you do all the work. However, if your TA is %, you are not getting an A. The lab reports are all going to be 30-40 pages long, and the TAs don't really grade the reports. They just look for reasons to take points off and specefically look for tiny wrong details just so to say they graded that. Also, my TA had no style. Dr. Bierman was also heavy.", "rating": 1, "expected_grade": "A-", "created": "2023-12-12T18:37:32.041933Z"}, {"professor": "Hilary Bierman", "course": "BSCI455", "review": "I wish I were kidding but this is the worst class I have taken in college. The workload/learning ratio is so high it's indescribable. Get ready to fill out useless worksheets, have 4-hour labs, and write 20-30 page lab reports which will be graded based on very small formality details rather than their content. If possible, make sure to join a group of 4 or 5 to divide the work better, if you have 3 people, power to you my friend. Don't worry though, after all the 700+ points of the class, you will get 3 bonus points because you were in a group of 3 for the whole semester. The labs don't work nearly as well as they are presented, your data is going to be super messy most likely, there is going to be a lot of troubleshooting in the lab and sometimes even the TAs cannot help. Grading is in the hands of your TA almost entirely so it can vary between sections so good luck with that as well. If you have the choice, take BSCI451. Lastly, the lecture is pretty useless, there is no reason for it to be 2 hours long, and half an hour would suffice. Not to mention, a lecture will not truly help you with lab report writing because the TAs are going to find the smallest details in your report, irrelevant to the content, and take off points. \r\n\r\nThere are two good things about this lab: The dissections which are cool but quite difficult and poster day at the end of the semester. That's it. Good luck.", "rating": 1, "expected_grade": "B+", "created": "2023-12-24T16:32:37.477443Z"}, {"professor": "Hilary Bierman", "course": "NEUR405", "review": "I got an A in this course but please listen to these reviews, they are all accurate. This truly was the worst class I've taken at UMD. It's upsetting, because the grade distribution makes it seem great. Even the actual labs are interesting, but the structure, workload, and TAs in the course completely ruined my experience. It really is a shame because you get to do really cool experiments in this course. \r\n\r\nMy TA took off insanely ridiculous exact decimal points for small details, despite working HOURS on the labs, attending all possible office hours, and emailing the TAs (by the way, they don't respond). The amount of work I put in for the class was insane. The TAs are not helpful, and you have to go to different TAs for different things which is frustrating. The lab reports are like 25% lecture TA content which your lab TAs have no idea how to do, and the rest is from the lab. The troubleshooting takes forever, which was expected, but the annoying part is how rude and passive aggressive the TAs and Dr. Bierman can be when you ask for help. My group and I were genuinely scared to ask for help because of how rude our TA would be when we asked. Be prepared for a rough semester. The weekly lab reports, quizzes, in-lab worksheets, and in-lecture worksheets are a lot. \r\n\r\nBut the last two weeks of the course was something else. You submit a proposal paper for an experiment you design yourself. After three weeks of data collection for that experiment (with weekly quizzes, weekly in-lab worksheets, and weekly lecture mini-presentations), you have to submit a research poster presentation in one week, present it in lab that same week, then a week later you have the cumulative lab report due, including another assignment where you are responding to comments that you got when you were being interrogated during the in-lab poster presentation. Then you present your poster in lecture. Then there is a final exam a few days later. The solution to this course is to make it 6 credits. \r\n\r\nI thought it was just me suffering in this course, until I started asking people how they felt and we were all suffering. Try to get a good lab group. Read the other reviews. There were only three reviews in before the Fall 2023 semester, now there are a bunch. Good luck.", "rating": 1, "expected_grade": "A", "created": "2024-01-27T02:50:14.813763Z"}], "name": "Hilary Bierman", "slug": "bierman"}