{"courses": ["BSST340", "BSST340", "BSST340", "BSST340"], "average_rating": 3.6, "type": "professor", "reviews": [{"professor": "Holly Roberts", "course": "BSST340", "review": "it's definitely worth noting that this class is a 300-level course and feels like it the entire time. I wouldn't take this as an alternative to other professional speaking classes if you aren't interested in national security and press briefings and things like that. The first assignment is the heaviest one- a ten-page paper and presentation on the paper- but once you get through that, the class isn't so bad. She's a nice woman who knows what she's talking about, but she grades harshly on papers. Heads up, buy professional clothing before you take the class.", "rating": 4, "expected_grade": "B", "created": "2023-01-16T21:51:27.230326Z"}, {"professor": "Holly Roberts", "course": "BSST340", "review": "Lectures are informative with slides to accompany them. Professor Roberts is a great speaker and always makes her lectures as engaging as possible. However, I was disappointed with the lack of instruction for major assignments. Professor Roberts did not give us clear instruction; instead, she posted poor past student examples under the \"Files\" section of ELMS. She avoids answering questions if asked and is a very harsh grader, which doesn't pair well with the few guidelines she set out. I spent hours on every paper and still received Cs despite making the changes she suggested. She gives out very little partial credit, also; if you fail to do something once, then large amounts of points are deducted. The workload is very, very heavy (understandable since it's a 300-level course) with a large speech/paper every few weeks and numerous quizzes and other assignments given out weekly. Overall, not a great course to take your first semester, especially as a Freshman Connection student. Although I learned some, I felt lost and unintelligent for the entire semester because of BSST340.", "rating": 2, "expected_grade": "B", "created": "2023-11-30T21:08:54.075383Z"}, {"professor": "Holly Roberts", "course": "BSST340", "review": "Genuinely top tier professor. Loved the class and the way it was taught. Yes there are a healthy amount of long research papers but that's expected in a 300 level course. If you have a genuine passion for national security/think you may pursue it as a career, this is definitely a course for you. Yes it may be difficult at times, but if you work hard an A is very doable.", "rating": 5, "expected_grade": "A", "created": "2023-12-09T01:54:19.543513Z"}, {"professor": "Holly Roberts", "course": "BSST340", "review": "I would recommend not to take this unless you are specifically interested in the area of study she is teaching.", "rating": 3, "expected_grade": "B", "created": "2023-12-18T03:49:32.107609Z"}, {"professor": "Holly Roberts", "course": "BSST340", "review": "Pretty solid class. If you're interested in politics or policymaking definitely take this class, as the whole class is basically simulating different roles in government. Roberts was a great lecturer, as she kept the class somewhat engaged for the full 3 hours. However, she was weird about some things, such as the time she gave everyone in the class a 0 on part of an assignment because nobody knew how to cite. It's also weird that it's a 300 level course for Freshman Connection, as there was quite a bit of work. Nonetheless the class was a lot of fun and gives you a small high school class-type feel. Definitely recommend.", "rating": 4, "expected_grade": "A", "created": "2024-03-12T21:26:41.617973Z"}], "name": "Holly Roberts", "slug": "roberts_holly"}