{"courses": ["ECON418M", "ECON424", "ECON200", "ECON644", "ECON185", "ECON424", "ECON200", "ECON424", "ECON185", "ECON424", "ECON644", "ECON418M", "ECON644", "ECON644", "ECON200", "ECON424", "ECON432", "ECON185", "ECON424", "ECON644", "ECON200", "ECON424", "ECON432"], "average_rating": 4.1321, "type": "professor", "reviews": [{"professor": "Hossein Abbasi", "course": "ECON200", "review": "I thought Abbasi was a good professor. Not great, but also not bad. Most of the students in my 300-person lecture could care less and only came because we had participation points (clicker stuff). I did pretty well in the class, but the average grade was around 80%. He explained things clearly with emphasis, but sometimes you tone out to his voice. ", "rating": 4, "expected_grade": "B", "created": "2019-02-28T14:54:48Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Totally fine. Had clickers (which you could do from your phone put I think they would be more difficult if you weren't in class). First exam had some grammatical errors but late midterms were fine. Lecturing covered what it needed with appropriate emphasis according to the importance of the topic. Solid choice for professor (just don't disrupt class).", "rating": 4, "expected_grade": "A-", "created": "2019-04-11T14:41:27Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "our class was not the biggest fan of him. personally i hate large lecture classes but if you like economics take this. if youre looking for a gen-ed to fill, do not take this, i made that mistake and wish someone had told me earlier", "rating": 2, "expected_grade": "B-", "created": "2019-12-06T00:42:30Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I found professor Abbasi to be very good. What was helpful is him posting all of the lecture notes, so if you miss something in class you can easily go back and take notes. He also posts practice exams which reflect the level of difficulty that you will face on the actual exam which is helpful. I think the exams were fair, but you have to put in a good amount of work to get an A in the class. Abbasi is approachable so you can easily reach out to him in person after class or during his office hours, or simply email him with any questions or concerns.", "rating": 5, "expected_grade": "A-", "created": "2019-12-22T18:03:16Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "He handled online classes really well and was a very good lecturer. Boring at times but very accessible and accommodating.", "rating": 4, "expected_grade": "B+", "created": "2020-12-04T21:40:44Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "He’s a really good lecturer. Workload is kinda heavy but exams aren’t awful", "rating": 4, "expected_grade": "B", "created": "2020-12-15T00:26:20Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I found professor Abassi to be a very good teacher. His lectures are clear and relatable. His tests are fair. I think the best way to do well in his class is to review the homeworks, attend the GSS study sessions and office hours if you have any questions, and read the textbook, and study hard and econ could be a very interesting class. the material is very valuable and helps you think about the world in a more practical light. it is very conceptual and not a lot of math. there are normally two chapters a week to read which can take an hour each at least because of the questions afterwards which are easy but a lot. the grade is counted for completion but the homework is counted for correctness.. Overall, the professor is there to help his students success and wants them to do well.", "rating": 5, "expected_grade": "A", "created": "2020-12-31T16:56:06Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Really good lecturer, but then again, the course material really isn't the hardest thing out there. Exams were very straightforward where if you actively paid attention to his lectures and did well on the assigned work, you'll be able to ace it with little studying, as the homeworks are generally a lot more difficult and oftentimes a lot more convoluted due to bad question writing than the exams. Overall, you definitely learn a lot in the class because the course material is oftentimes rather relatable and applicable - would recommend if you need a gen-ed during a semester where you have a lighter workload, as this course is rather demanding in that aspect.", "rating": 4, "expected_grade": "A", "created": "2021-12-03T18:49:59Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Professor Abbasi is an okay teacher. He basically just teaches from the powerpoints, but those powerpoints are extremely helpful. I used those to study for every exam and they helped a lot. He releases each powerpoint so you can use that to follow along. The smart books assignments really help your grade and so do the homework assignments if you do them properly. The exams really aren't harder than the homework assignments, so just make sure to review those.", "rating": 3, "expected_grade": "A-", "created": "2021-12-03T21:36:04Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Professor Abbasi was pretty solid and the class is structured that you don't need to attend the lectures. You can do just fine from home if you follow the notes and powerpoints on ELMS. The exams can be confusing and are a huge weight of the class so keep that in mind\r\n", "rating": 3, "expected_grade": "B", "created": "2021-12-08T18:16:15Z"}, {"professor": "Hossein Abbasi", "course": "ECON424", "review": "Professor new how to really explain the material in a methodical way. You really see clearly how everything builds off of each other. In the classroom he's very helpful in explaining concepts in a workshop setting. He is strict with turning things in on time but if you do that you should be fine. Before-lecture quizzes based on readings are lowkey a big part of your grade so don't let those pull you down.", "rating": 5, "expected_grade": "B", "created": "2021-12-15T03:45:32Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "really nice professor. lectures can be boring at times but he is very straightforward and tries to make as many physical connections to the concepts as possible. Really liked him and he was funny in lectures. workload is very light and practice exams were extremely helpful for the exams. ", "rating": 4, "expected_grade": "A", "created": "2021-12-15T15:26:03Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Good professory.  Be sure to do homework and practice exams in order to do well on regular exams.", "rating": 4, "expected_grade": "A", "created": "2021-12-20T20:40:47Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Abbasi is a great professor and an A in his class is very obtainable. You don't have to attend the lectures as he posts the slides and videos covering them online. There are 4 main exams that make up the majority of your grade which are online, just study and use the practice exams and you'll be very successful. The HW can be tedious at times but the overall workload is 2-3 hours a week. Great professor and enjoyed this class with him.", "rating": 5, "expected_grade": "A", "created": "2021-12-21T20:54:01Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Easy class if you actually do the smartbooks and the exams aren't too bad, just make sure you take the practice exams first because they prepare you for the concepts covered and also have some questions from the actual exam. You don't really have to attend as long as you review the slides and try on the smartbooks, I only attended for the first two weeks then never went again. Only reason I didn't get an A+ is because I didn't take time to completely learn the concepts on the 3rd exam and could've gotten a better grade.", "rating": 4, "expected_grade": "A-", "created": "2022-01-19T20:33:11Z"}, {"professor": "Hossein Abbasi", "course": "ECON185", "review": "Easy and straight forward class but you do have to put in the time to do the work. There are weekly online quizzes and discussions, the answers to them are found on the power points he provides. The only thing to watch out for is the wording of some of the questions on the quizzes, you cant always control+f the answers(you also get two attempts at each quiz). The main big assignments are the research papers and a final report. You get 6 days to do the 1250 word research papers. There are 5 in total and they are a chore to do. As long as you follow the rubric, you will be fine. The final report is basically your final for the class since there is no final exam. You do parts of it as the semester goes on and in total it will need to be above 2500 words minimum by the end of the semester. Again as long as you follow the rubric you will be fine. The reports are graded generously by the TA. Professor Abbasi is a good lecturer but if the topic does not interest you then you will find the class to be a huge chore. ", "rating": 4, "expected_grade": "A", "created": "2022-05-16T23:25:17Z"}, {"professor": "Hossein Abbasi", "course": "ECON185", "review": "This course is a super easy A. If you can read the slides and finish those quizzes, you don't have to attend classes. There are some papers to write and they are annoying. However, you can always get a 100% score. Take it!", "rating": 5, "expected_grade": "A+", "created": "2022-08-27T18:50:04.919290Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I signed up for this course as a requirement for my major, but ended up getting really into it. Abbasi is a great professor, his lectures are always clear and easy to understand. You can definitely do well if you just watch the recorded lectures, but I would say to actually go to in person lectures, cause he definitely says and emphasizes different things in person. He's also funny and gives a lot of real life examples that ended up sticking with me and helped me on exams. The smart books and HW's were super helpful so make sure you do them. Definitely not a super easy A, but totally manageable if you actually do the work.", "rating": 5, "expected_grade": "A", "created": "2022-10-21T18:08:12.929959Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Pretty good professor but was a difficult class for me personally, I think you either get the material or you don't. Practice exams and practice problems help a lot for exams. Pretty easy homework but there is quite a lot of it, most answers are on Quizlet. TA's grade exams are kind of weird sometimes tho so make sure you go and review your exam sometimes you might get extra points if you argue.", "rating": 4, "expected_grade": "B+", "created": "2022-12-01T00:37:24.194424Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Good professor who tries to keep class engaging.  The lectures are straightforward and the exams are a good reflection of what was covered.  He posts all of the slides and prerecorded lectures online so you can still do well without going to class which is nice.", "rating": 4, "expected_grade": "A", "created": "2022-12-01T20:33:25.233457Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Very straight forward and the exams are pretty easy if you stay on track. His lectures are recorded which is a big plus. He also posts every resource you might ever need. If you're taking econ200 I would highly recommend Abbasi.", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T18:24:00.023748Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Dr. Abbasi is the best professor for this class imo, he's very nice, understanding, and a great lecturer. His exams are reasonable and he provides practice exams that literally have the same questions as the actual exam sometimes. Just do the smartbook assignments and study for the exams and you'll be fine. He also drops the 3 worst hw grades so that's nice too. My only complaint is he doesn't allow a cheat sheet for the exams like most of the other profs for this class.", "rating": 4, "expected_grade": "B+", "created": "2022-12-08T23:45:28.570877Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "literally no one goes to class after the second week because all of the notes are online. many resources on his canvas page for practice. exams are really hard tho. wouldn't recommend for a gen ed, go find an easier one", "rating": 3, "expected_grade": "A-", "created": "2022-12-13T01:04:48.426917Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Overall a good professor who will prepare you for the exams. My only problem is his lectures are extremely boring", "rating": 4, "expected_grade": "B+", "created": "2022-12-13T03:24:17.872147Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "The professor posts all lectures online and gives practice exams and problems, overall making his content very accessible. This made it really easy to skip the class which wasn't good since I was struggling a little in the class, but all the material is there. Some of the exam questions are even directly from practice problems or lecture slides. Overall provides resources but lecture itself was just okay.", "rating": 3, "expected_grade": "B", "created": "2022-12-16T05:45:10.512069Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Abbasi's lectures are barely attended because you can learn everything he says by watching his recordings and reading his slides. You can play his recordings at 1.5x speed which is great. 2 midterms and a final do the practice exams they are super similar. Overall he himself doesn't really help or hurt too much it is mostly up to the student how well you wants to do in this class.", "rating": 3, "expected_grade": "A-", "created": "2022-12-16T21:47:40.633195Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "If you show up/ watch lectures and do the smart books and homework’s, and literally just study- you will be fine. I feel like a lot of people don’t do anything the entire semester and end up with a C and then they start complaining. Abbasi is definitely the best ECON200 teacher and obviously this isn’t an easy A, but you get what you put in. I mean this is college come on", "rating": 5, "expected_grade": "A", "created": "2022-12-23T19:19:31.510001Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Homework could be a little bit time consuming but not super difficult, and exams were based pretty much entirely off of the lecture slides he uploaded to elms and the textbook sections and were pretty similar to the practice exams so not very challenging and I found the homework harder than the exams. His lectures could be a little dry sometimes (it is economics) but solid so this class shouldn't be very hard if you consistently go to lecture and complete the homeworks.", "rating": 4, "expected_grade": "A-", "created": "2023-01-08T23:09:52.008456Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I loved Abbasi and his class. I found it easy to get a good grade if you dedicated time to actually learning the material. Homework and smartbook for every chapter (about 1-2 a week), but normally weren't incredibly time-consuming. Studying with friends was really helpful for this class, too. Abbassi also really cares about his students, so try to go to lecture if you can because he does his best to engage. Super sweet guy and very knowledgeable in the topic.", "rating": 5, "expected_grade": "A+", "created": "2023-01-18T04:16:38.064713Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Amazing professor, homework wasn't that bad, and his exams were very fair. Would definitely recommend taking him if you have the chance", "rating": 5, "expected_grade": "A-", "created": "2023-01-21T04:52:40.495508Z"}, {"professor": "Hossein Abbasi", "course": "ECON424", "review": "This course was challenging in a great way. As long as you GO TO CLASS (which Abbasi emphasizes over and over), you will learn from one of the best and funniest professors in the business. Initially, I took the course for the requirement, but Abbasi legitimately made me interested in numbers and statistical analysis. Would recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-03-07T19:29:02.558771Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "let me warn you with this: i am not a business or econ major, literally a stem major and took this class for no reason and it was just a poor choice as a gened.\r\n\r\nbut anyways this class was pretty easy, the homeworks were a little bit of a pain because they were so time consuming, but doable. also i never went to class. never. and i also didn't watch his pre-recorded videos either. regardless, his practice exams were actually the best study material ever. very similar to the real thing and all. I was only like 0.5 away from an A- but he did already give a 1% in extra credit so its whatever. \r\n\r\nthe class is definitely doable to get within the A range, i was just slacking, and even with that came pretty close. lecture: boring; resources: helpful.", "rating": 4, "expected_grade": "B+", "created": "2023-03-27T08:24:20.765608Z"}, {"professor": "Hossein Abbasi", "course": "ECON424", "review": "Professor Abbasi is one of the best Econ teachers I've had at UMD. He's great at explaining concepts that are complicated, and breaks them down into easy steps. Not only does he provide lecture notes for each lecture, he provides step by step videos to on how to solve problems for concepts for each lecture as well. This is a great class for the quantitative requirement. Not only are you learning valuable regression concepts, but the coding involved in Stata is easy enough for a beginner to understand. Even if you get a 55% average on the 3 exams, you can still pass the class easily with the other assignments. Exams are also straight forward to follow and have similar concepts from practice exams. I'd encourage anyone to take this class. It's not hard to pass and builds a good foundation on coding skills and statistical analysis", "rating": 5, "expected_grade": "B-", "created": "2023-04-09T02:56:26.477338Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "This mico professor is AMAZING. He is an amazing lecturer and super sweet and funny as a person. He prepares students extremely well for the exams. The multiple choice weren't too bad for me, but the long answers are challenging and require studying. I highly recommend taking him and not the other mirco professor. He is a great lecturer. His exam reviews are helpful because he lets students ask questions. His TAs were okay, but I'm not sure how much is really in his control in that aspect.", "rating": 5, "expected_grade": "B+", "created": "2023-05-17T23:06:03.342037Z"}, {"professor": "Hossein Abbasi", "course": "ECON185", "review": "I enjoyed his class and the lectures a lot. I enjoy writing papers which is why this class was a good choice for my i-series, and I was interested in the topic. The papers aren't too bad and I enjoyed a break from exams. I just overall love this professor and took him for micro and then thought I would enjoy this class. The quizzes are open note online and the discussions aren't too time consuming. Overall I think the class is interesting but don't take if you can't research or write papers.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T23:11:54.648762Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Mr. Abbasi is very funny and lighthearted. Attendance is not mandatory, and the smartbook (learning) and homework assignments do a good enough job of explaining the material. However, I need stress the importance of going to class, as his explanations for challenging concepts and graphical depictions are very helpful and ensure that you understand concepts well enough for essay questions. The multiple choice part of exams are much easier than the essay questions which require more prep. Nonetheless, he prepares you well enough for them with multiple exam reviews and office hours. If you can motivate yourself to go to class even though attendance isn't mandatory, then this is the perfect professor for you.", "rating": 4, "expected_grade": "B+", "created": "2023-11-29T23:12:09.571596Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Not a bad professor, and I truly do think it is just hard to teach an ECON200 course, but I did not feel like Professor Abbasi taught me anything that the smartbooks didn't. Lectures were useless, as all lessons were required as homework BEFORE the class began. Hard class but it should be expected. Use outside resources provided to your advantage.", "rating": 3, "expected_grade": "", "created": "2023-12-01T17:34:24.418162Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "He's not a bad professor, but I honestly felt like lectures were pretty useless. I stopped going after the first week because everything he covered in class was already covered by the Smartbook (reading/learning assignment) and homework. All his lectures are recorded too, if you prefer that to reading. I felt like exams were pretty fair, and he provided 2 sample exams for each exam which were overall pretty representative of the actual exam difficulty. Overall, this class shouldn't really be a problem with a little bit of effort.", "rating": 4, "expected_grade": "A", "created": "2023-12-04T06:48:40.465203Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Decent professor overall. Makes lectures interesting and I like how he includes problems in his lectures for students to solve and then goes over them. A lot of what he says, however, is not written on the slides. Homework and Smartbook assignments are easy to complete. His tests, on the other hand, are quite difficult, especially the open ended sections.", "rating": 4, "expected_grade": "B+", "created": "2023-12-05T18:26:18.812972Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "W ECON PROFESSOR: Mr. Habbasi has an old-fashioned sense of humor with his love for coconut cookies. His lectures are engaging as he has a polling system in his class for you to answer questions he proposes spread out through his lecture which does help with retaining information in the short run. But, sometimes he does ramble a lot in his lectures, like next level yap. I would have enough time to preview the slides he was about to present and copy them in my notes in the first ten minutes of class because of his rambling. But that's what makes his lectures engaging. There is a passion behind his complexities with microeconomics and a genuine love for the subject. I regret not going to his office hours more to personally get to know him and his thought process on microeconomics-related subjects. He also does not curve the class.", "rating": 3, "expected_grade": "C", "created": "2023-12-06T03:39:51.769954Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Abbasi is a great professor and a really nice guy. My only complaint was the insane amount of work required for this class. SmartBook assignments before every class felt like busywork given that we learned the same stuff in class, and the homework after class was often much harder than what was actually on the final. Overall, if you're going to take Micro, take it with Abbasi, but I wasn't a fan of this class in general.", "rating": 4, "expected_grade": "A", "created": "2023-12-06T14:46:17.978161Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I really liked this professor. The homework assignments are pretty helpful to actually learning the material, and combined with class notes, you have lots of material to be able to understand it all. The concepts can get difficult if you don't actually learn it and just cheat on every homework / barely take notes, so as long as you actually pay attention to what you're learning you're all set. The homework grades really add up so if you get 70s on every test you'll still be okay. Definitely take this professor if you can. I only went to maybe 5 classes and instead went over the recorded notes. The actual classes are long and draining and sometimes feel pointless.", "rating": 4, "expected_grade": "B+", "created": "2023-12-06T20:09:21.067729Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Professor Abbasi is very fun, kind, and sweet as a lecturer! As a Freshman Connection student, however, going to class sucked and I stopped going to lectures halfway into the semester because they were very late (7:30 - 8:45 pm). If I hadn't left class when it was dark outside, I probably would've actually attended the lecture. Previous reviews are correct though, even though I did not attend the lectures, I was able to mostly teach myself the content with the SmartBook, lecture recordings, and previous exams, getting me an A on the second midterm. Just make sure you complete your homework and take notes and you should be fine in this class with not too much effort!", "rating": 5, "expected_grade": "B+", "created": "2023-12-15T04:23:54.238058Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "His lectures were pretty boring but they were all online so you didn't even have to go. He is one of the nicest professors ever and truly enjoys teaching. The tests were somewhat difficult but the work consisted of smart books (completion) and HWs (accuracy but you have two tries). Definitely the best professor for 200", "rating": 4, "expected_grade": "B", "created": "2023-12-15T21:34:32.419671Z"}, {"professor": "Hossein Abbasi", "course": null, "review": "The class itself isn't too bad as long as you keep up with the assignments. There are a ton of resources - make sure you do the practice exams before the tests because they're very similar to the actual exams. Abbasi is a pretty good lecturer, however you don't really have to go to class as all the lectures are recorded.", "rating": 4, "expected_grade": "A-", "created": "2023-12-18T21:34:38.627241Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I did not show up more than 5 times for this course (including exam days). I barley ever actually read or studied the homeworks. I will probably still pass this course with a C or C-. If you show up and put in effort this course is a free A/B and you don’t need to try on the final. If you put in zero effort you can still probably get away with a C-.", "rating": 4, "expected_grade": "C-", "created": "2023-12-22T06:07:06.737487Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "If you had prior knowledge or can self study very well, then take the class. I would not recommend this as a gen ed if you’re business major or something along the lines of having this class mandatory. His classes were barely attend since he has a lot of resources posted on canvas and had pre recorded lectures. During class, he takes years on whatever topic he is yapping about and spends like 30 seconds on last on each side expecting you to get the concept down quickly and will end class not even halfway through the slides and moves on to the next chapter next class. Exams are exactly like the practice exams he posted but you really have to gasp the concepts and graphs down. I wish I took this at a cc and transferred it over but you just need a C- to pass with this class. He is also details oriented and will pay close attention to what you are doing on the work from what I heard from others. Overall, if you can teach yourself well enough then you will do fine.", "rating": 3, "expected_grade": "C+", "created": "2024-01-02T01:23:35.398079Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Genuinely very nice guy. Assignments are very helpful, and exams aren't too hard if you're willing to prepare a bit on your own. He provides 2 very useful practice exams too which are very similar to the actual test. Final is worth 35% of your grade though which is kind of stressful.", "rating": 5, "expected_grade": "A", "created": "2024-01-10T23:51:54.516568Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Abbasi is a good lecturer. The lectures aren't the most fun but he tries his best to be engaging. Most content can be self taught from the online textbook and assignments. Lectures are posted online weekly, so it's not necessary to go to the class. Two midterms and a final, all a combination of MC and open ended questions. The class definitely requires work to understand concepts and do well on exams. I would recommend taking it with Abbasi.", "rating": 5, "expected_grade": "B", "created": "2024-01-18T21:39:05.659324Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I absolutely loved this professor. He has recorded slides explaining each chapter so you don't even have to go to class. He emails fast and will help you whenever you need. There's a lot of TA's and he offers plenty of office hours if you are struggling. He gives multiple practice exams for each exam which basically mirrored the exam format. LOVE HIM!!!! MY KING!!!", "rating": 5, "expected_grade": "A-", "created": "2024-01-21T04:09:56.631801Z"}, {"professor": "Hossein Abbasi", "course": null, "review": "If you had prior knowledge or can self study very well, then take the class. I would not recommend this as a gen ed unless you’re business major or something along the lines of having this class mandatory. His classes were barely attend since he has a lot of resources posted on canvas and had pre recorded lectures. During class, he takes years on whatever topic he is yapping about and spends like 30 seconds on last on each side expecting you to get the concept down quickly and will end class not even halfway through the slides and moves on to the next chapter next class. Exams are exactly like the practice exams he posted but you really have to gasp the concepts and graphs down. I wish I took this at a cc and transferred it over but you just need a C- to pass with this class. He is also details oriented and will pay close attention to what you are doing on the work from what I heard from others. Overall, if you can teach yourself well enough then you will do fine.", "rating": 2, "expected_grade": "", "created": "2024-01-21T19:42:40.852539Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Such a big class size that it's hard to personally get to know this professor however I enjoyed his class and got a good impression from him. He's kind and often attempts to crack jokes during his lectures (he reuses his \"coconut cookies \" joke at least once per lecture but it's endearing). Lectures can be pretty boring and the content from the lectures is the exact same as the content in the reading so I went to three lectures over the course of the semester and still got an A (note that I did the reading and homework really thoroughly, studied hard for my exams, and at times attended GSS meeting for topics I didn't understand). I appreciated that he was a really organized teacher and all the class content, slides, recording, hw, study sheets, etc. were categorized in canvas and super easy to find. Tbh, it's such a big class that I don't think the professor will have that much of an impact on how you do in the class but abbasi is a good choice!", "rating": 4, "expected_grade": "A", "created": "2024-01-25T19:36:27.812869Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I HATE LECTURE CLASSES. I find it difficult to pay attention but more often than not— you have to attend for the sake of learning the content. That is not the case with this class! He provides so many resources and is super helpful. He's a really nice guy and wants you to succeed and provides as much help as he can to make that happen. Talks really slowly which is helpful for people who take notes in class but not my cup of tea. He also has lecture VIDEOS with are very helpful— I watched those exclusively at 2x speed and it was helpful. All in all, even if you don't like his teaching skills— the resources he provides are unmatched. \r\n\r\nHomeworks: You have auto 100% homeworks and than the actual homeworks. Both of which are fairly easy, sometimes a bit time consuming but relatively simple to complete as long as you don't save it for the very last minute. Very doable as long as you read the textbook/attend class. \r\n\r\nEXAMS: Each midterm was sectioned off on the respective chapters you learnt prior to it. He makes sure you KNOW what you need to study and provides two practice exams (VERY HELPFUL).", "rating": 5, "expected_grade": "A", "created": "2024-03-13T18:34:12.323725Z"}], "name": "Hossein Abbasi", "slug": "abbasi"}