{"courses": ["HIST201", "HIST289V", "HONR238R", "HONR348J", "HIST266", "HIST357", "BSST288R", "EXST030", "HIST201", "HIST357", "BSST288R", "HIST200", "HIST201", "HIST266", "HIST357", "HIST200", "HIST201", "HIST289V", "HIST357", "HIST357", "HIST357", "HIST357", "HNUH268K", "HIST201", "HIST219Q", "HIST266", "HIST357", "HIST200", "HIST201", "HIST289V", "HIST357", "HIST200", "HIST201", "HIST266", "HIST357"], "average_rating": 4.5854, "type": "professor", "reviews": [{"professor": "Howard Smead", "course": "HIST289V", "review": "I had to create an account just to review this man. Hands down, no question about it, the BEST professor at this school. I am currently taking him for HIST289V after I had him for 201. He is even better this semester than he was the last, partially because his TAs were terrible last semester. However, he is always happy, cracking jokes, talking about interesting current events, etc. I have only missed his class once all semester, and I wish I didn't even miss that class. He is a ray of sunshine. You should really take one of his classes at some point during your college career even if you don't have to", "rating": 5, "expected_grade": "A", "created": "2016-12-13T13:39:00Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Smead is an absolute delight! You may think the subject of history is boring but honestly his lectures are pretty interesting. He also has a great sense of humor and throws in jokes here and there and that can make the lectures fun. \n\r\nThe coursework is not a heavy load - 2 midterms, 1 final, and your discussion grade.\n\r\nI honestly would have aced this class but it was my discussion part that killed me. I had Greg as a TA and he talked so much and we barely had time to participate.. so yeah participate for sure every week in discussion.\n\r\nOtherwise, this class is great! A great, light class if you are looking for something to fulfill a GenED credit. ", "rating": 5, "expected_grade": "B", "created": "2016-05-12T12:19:00Z"}, {"professor": "Howard Smead", "course": "HIST289V", "review": "Smead is alright. Pretty funny, but he knows nothing about technology and usually spends the first few minutes of class figuring out everything again. The class topic itself \"What Does it Mean to be an American?\" is weird. It's basically an overview of U.S. history with some highlights on what people thought of the general populous and how that's changed. I find it pretty easy and sometimes enjoyable. Some of the TAs seem kinda uptight and snobby, but others are pretty nice. ", "rating": 5, "expected_grade": "A", "created": "2016-03-27T19:23:00Z"}, {"professor": "Howard Smead", "course": "HONR348J", "review": "Dr. Smead is a really knowledgeable and nice professor. The class consists of a weekly 2 page reflection paper. Overall the papers are fine but he tends to randomly assign grades without much explanation which is annoying. You MUST talk during the in class discussion or you will receive a B. Overall very interesting class, and definitely an easy A and not stressful at all.\n", "rating": 5, "expected_grade": "A", "created": "2014-12-15T21:44:00Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Strongly recommend taking a class with Smead. Funny and entertaining lecturer where I wish HIST201 was longer than 50 minutes, makes a potentially dull class/lecture very exciting and interesting. Terrorism seminar is also highly recommended - not a lot of work needed to be done while still being interesting and informative for people with little subject knowledge. ", "rating": 5, "expected_grade": "A", "created": "2014-12-14T17:46:00Z"}, {"professor": "Howard Smead", "course": null, "review": "I strongly dislike history, but Dr. Smead tries to make this class as engaging and informative as possible. I’m going to be blunt- I took this class because I had a heavy semester and I needed a GenEd course that was an easy A, and reviews told me that this class would get me one. However, I barely scraped an A- because I hardly participated in class. Dr. Smead is serious when he says discussion is a big part of your grade. He’s a very easy grader for the three essays and one presentation you have to give, but don’t slack on the discussion part. He makes a note every time you participate in discussion, so say something at least once every class to ensure you get an A. There is hardly any work for this class actually, just three essays and a presentation for the whole semester. If I wasn’t being a prick and doing work for other classes during this class, I probably would have learned a bit. Then again, I’m not a fan of history, but if you enjoy your history, I recommend this professor because he knows his shit.", "rating": 4, "expected_grade": "A-", "created": "2014-06-30T23:48:00Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Amazing!! Professor Smead lectures as if he's telling a story. He doesn't put much information on his powerpoints, but you get used to that quickly. He always seems so interested in what he is teaching. I actually looked forward to his lectures. The class was only 3 exams and reading several books. The books were relatively short and interesting, but you need to stay on top of the syllabus because they won't warn you that you have to read an entire book by next class. Strongly recommend for history and non-history majors. ", "rating": 5, "expected_grade": "A", "created": "2013-05-21T21:39:00Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Smead is a great lecturer. He knows his stuff and goes through the PowerPoints quickly. Exams are very straight to the point and the TAs are all very good. Smead offers 5 percent added to your grade at the end if you send a weekly email for the semester about a topic you learned about. Lots of books to read though.", "rating": 4, "expected_grade": "A-", "created": "2013-05-01T19:45:00Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Dr. Smead is a great lecturer and he seems like a nice guy. He brings a great energy to every lecture. I would definitely recommend him.", "rating": 5, "expected_grade": "B", "created": "2017-11-19T18:52:18Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Lectures are very entertaining, but for each exam, you have to write two essays which can be stressful if you are not the best writer", "rating": 5, "expected_grade": "A-", "created": "2019-12-18T04:43:41Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Best lecturer I've had at the university. The only reason I'm not giving him 5 stars is that he leaves too much up to his TAs. This means that lots of grading is inconsistent and things can take a long time to get back to you.", "rating": 4, "expected_grade": "A-", "created": "2020-05-15T19:11:19Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Great professor. Dr. Smead was one of the best and most entertaining professors I had at UMD. He somehow made history entertaining. A lot of grading is dependent on the TA, however. ", "rating": 5, "expected_grade": "A", "created": "2020-09-01T02:03:12Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Prof. Smead is ok! I took his class in Spring 2020, so I did not get to experience his in-person discussions. He really knows his stuff and is interesting to listen to if you have all day...but if you don't, I recommend listening to his lectures at 1.5-2x speed. He often goes off on tangents which can be frustrating when you're not interested in the subject but I imagine could be interesting if you are. He's a goldmine of knowlege for sure. My main complaint would be that he leaves so much up to his TAs - they can make or break a class. My TA, Kyle Stelzer, was ok but didn't respond to emails very quickly. ", "rating": 4, "expected_grade": "", "created": "2021-05-03T13:37:59Z"}, {"professor": "Howard Smead", "course": "HIST357", "review": "his lectures were engaging - hes very dry and sarcastic in an old man way and it made it more interesting. read the books and listen to the lectures and you should be fine even though it's time consuming. he was laid back regarding late work which was appreciated. ", "rating": 5, "expected_grade": "A", "created": "2021-05-11T16:37:45Z"}, {"professor": "Howard Smead", "course": "HONR238R", "review": "Difficulty: 2.5/5 \r\nInterest: 4/5 \r\n\r\nProfessor Smead is a great lecturer, and he is very willing to speak his mind while never crossing lines into being preachy or imposing his will unduly on students. The assignments were reasonable and interesting; they consisted of: a presentation and corresponding term paper, two brief reflections, a journal of our thoughts on the course, and a dropped participation grade. The grading was pretty fair with good feedback in a reasonable amount of time. It being during COVID and him not being the best with technology plus the class being in person yet most students phoning in through Zoom definitely hurt the experience because of reduced participation, but that is not his fault by any means, and we still had good discussions, just more often with him as the interlocutor than students amongst themselves. I would recommend taking this class in particular and Prof. Smead's in general. Unfortunately, I believe this particular course will only be offered once more, but if you enjoy history or foreign affairs, or have an interest in terrorism or philosophy or sociology, or just want a solid HONR class for the citation, then consider this. ", "rating": 5, "expected_grade": "A", "created": "2021-05-14T07:34:17Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Good class, really interesting. Two essays, two midterms and a final. We were behind though, and missed like 3 weeks worth of content. Other than that really solid class.", "rating": 5, "expected_grade": "A", "created": "2021-12-04T13:16:15Z"}, {"professor": "Howard Smead", "course": "BSST288R", "review": "Course was interesting and I appreciated Professor Smead's commentary, but it was clear that he played favorites with students. He also provided no feedback on written assignments, and when asked to elaborate on the grade received, gave no helpful information.", "rating": 3, "expected_grade": "", "created": "2021-12-16T19:36:19Z"}, {"professor": "Howard Smead", "course": "HIST266", "review": "Smead is the GOAT, man. There's not a better lecturer in the history department. There may not be a better lecturer at this entire university. Sometimes the slides could be better organized, that's the only complaint I have. Otherwise, Smead is just the best. His lectures are excellent, and the workload is more or less nonexistent, both for this class and his 300 levels like 357. Three exams and some discussion boards, that's it. No papers, no projects, no participation grades, nothing like that. This is the ideal way to run a history class. I wish Howard Smead taught more classes because I'd gladly take them.", "rating": 5, "expected_grade": "A-", "created": "2021-12-18T21:22:29Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Professor Smead is really really nice and he makes his class interesting. He gets sidetracked pretty easily, especially if someone asks a question. We were supposed to cover post-civil war America all the way to Trump but we hardly made it to Vietnam, so we missed a lot. I don't mind this because it made us have to study less for the final. Discussion awards points based on participation. There are 2 essays and 2 midterms but everything is graded by the TA, so it's usually lenient. I recommend this class and professor Smead", "rating": 5, "expected_grade": "A-", "created": "2021-12-22T02:09:23Z"}, {"professor": "Howard Smead", "course": "HIST266", "review": "He is a great professor but this class is hard tho. ", "rating": 5, "expected_grade": "B", "created": "2021-12-26T17:25:35Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Dr. Smead is a great lecturer. His slides are very informative and great materials to prepare for the exams.", "rating": 5, "expected_grade": "A", "created": "2022-01-02T17:45:19Z"}, {"professor": "Howard Smead", "course": "HIST357", "review": "I really enjoyed Dr. Smead's lectures, although he can get off on tangents, it is always really interesting info or facts that I never knew. However, he lost some stars for me because although the information itself is very interesting, we got very behind in class, like weeks behind. We were doing discussion posts about Obama when we were still learning about Reagan. It was hard to get 100 on those when you haven't learned the material yet. Like I said, super interesting info, and really enjoyed his teaching style and him as a person, but being behind the syllabus wasn't a good experience.", "rating": 3, "expected_grade": "A", "created": "2022-01-06T17:57:01Z"}, {"professor": "Howard Smead", "course": null, "review": "Great prof who is passionate about what he teaches which makes sure all the students excited to learn ", "rating": 5, "expected_grade": "A", "created": "2022-05-05T18:11:11Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "He is a pretty good teacher most of the time, but there are some days we he just randomly Strats listing event after event with no explanation. Your TA kind of dictates your class. \r\nOnly 2 tests, a final and a discussion grade so you have to do well on the tests, but I found them incredibly hard. You get 2 hours to write 2 essays on undisclosed questions. If you're good at history and a good writer, definitely take this class because there is minimal work. However, if you are not one of those, AVOID", "rating": 4, "expected_grade": "B+", "created": "2022-05-13T01:05:12Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Smead is a fun guy. As a lecturer, I thought he was interesting, funny, and informative. Some lectures can be a bit boring, while others will be more fun but that is just how a history class usually goes. Attendence is not mandatory, and all my lectures were recorded so if you missed class, you could just watch the recording on your own time. Overall, I definitely recommend Smead, you cannot go wrong with him as your professor.\r\n\r\nBut there is a reason that I put 4 stars:\r\n\r\nThe only issue with this class is that there are 2 exams, a final, and a discussion grade. So you need to do well on each exam and discussion to get an A- or better. Therefore, show up to every discussion and make sure to prepare well for all exams. The TA grades everything that you write (including your tests) so make sure that if you have any clarifying questions that you ask your TA first. Tests are usually 2 essay questions. Other than tests and the occasional discussion response paper, work is very minimal just make sure to look at the syllabus ocassionally to make sure that you are not missing any required readings.", "rating": 4, "expected_grade": "A", "created": "2022-05-20T04:47:43Z"}, {"professor": "Howard Smead", "course": "HIST200", "review": "Professor Smead is such a passionate lecturer, which makes his class engaging. I was not expecting to enjoy attending this class because I find that learning about history can sometimes be a bit boring, however, he made learning about these topics very interesting and exciting for someone who is not very passionate about the subject. There were two exams, the final, and one discussion post a week responding to a question. I never once felt overwhelmed by the work given in this class. He would always describe his exams as essay questions, but he really just wanted however much you felt it took to answer the question.\r\nTo be completely honest, I never read either textbook (American Yawp and Voices of Freedom) because everything I needed to complete each discussion post was already covered in the lecture. He tends to get sidetracked and often did not finish the slides as he intended, but since my class had a weird 45-minute class time with an additional hybrid component, we were able to cover everything in online recorded lectures that he would post.", "rating": 4, "expected_grade": "A-", "created": "2022-12-20T17:04:01.943279Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Dr Smead's lectures were interesting but he would never make it through all of the material he intended too. Lots of tangents and he would show up to lecture 5 minutes late every day. Class was supposed to make it to 9/11 but we only made it to Watergate. Class consisted of 2 exams and a final (all essay based) and weekly discussion sections with one mini essay. As long as you do everything you are guaranteed an A or a B.", "rating": 3, "expected_grade": "A-", "created": "2022-12-24T02:40:18.545471Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Will never answer your emails, but love the guy nonetheless. His lectures are extremely engaging, and if you have any interest in history whatsoever you'll definitely like 201. It might differ from TA to TA, but my only assignments were 2 midterms, a final, and a graded essay (which lumps into your discussion grade). This is nice in terms of workload, but it puts all the focus on the exams when it comes to determining your final grade. I found the exams to be difficult (2-3 essays within a tight time limit), but doable as Smead \"does not have a policy on notes during exams\".", "rating": 5, "expected_grade": "A", "created": "2023-01-03T20:50:53.757519Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "His lectures are interesting, but can be boring if you don't like history. There is quite a bit of reading for this class. Your grade will consist of 2 exams + a final, and a discussion grade. Attendance is mandatory for discussion, as there is a weekly quiz (open note). Participation is also a grade in discussion. His exams are fair. The reading is the only killer thing in this class.", "rating": 4, "expected_grade": "A", "created": "2023-05-03T19:03:02.175654Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Great lecturer, keeps things interesting and is funny. The coursework isn't bad at all, only a few essays and weekly readings for discussion. Can't go wrong with this gen ed class.", "rating": 5, "expected_grade": "A-", "created": "2023-05-04T20:19:27.440790Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Easy A. CHAT GPT is your friend. Dont forget to rewrite it in your own words", "rating": 5, "expected_grade": "A+", "created": "2023-05-12T18:47:15.499863Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Great Professor, his lectures tie into exams if you do miss a lecture though dont worry, you'll probably be able to catch up on it in discussion. 2 exams. Essay based. as long as you explain the questions throughly you should be able to get 100's on both", "rating": 5, "expected_grade": "A", "created": "2023-05-14T17:50:48.283014Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Attendance for lectures wasn't mandatory but I always went anyways because they were really interesting. Super cool guy, clearly very knowledgable about what he's teaching and doesn't take crap from people asking stupid questions. Your TA kind of dictates how much work the class will be, all Smead gives is 2 writing assignments and the exams. Lots of reading, but they were super interesting so I never had an issue with it.", "rating": 5, "expected_grade": "A", "created": "2023-05-22T00:12:49.117591Z"}, {"professor": "Howard Smead", "course": "HIST289V", "review": "Dr. Smead is an excellent professor! He really knows what he's talking about and the subjects of his lessons are really fascinating and engaging. Everything in lectures is tied into your exams, which are essay-style. Attendance is mandatory for discussions, and if you miss lecture you can catch up here, usually; discussions are also sometimes tied into the exams.", "rating": 5, "expected_grade": "A-", "created": "2023-05-23T22:08:08.340815Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Great professor, explains topics in digestible fashion and is interested in the subjects. Lenient grader and class has a simple structure.", "rating": 5, "expected_grade": "A", "created": "2023-09-26T16:34:39.120445Z"}, {"professor": "Howard Smead", "course": "HIST200", "review": "Great professor, and work load is quite small. Lectures are straightforward and interesting", "rating": 5, "expected_grade": "A", "created": "2023-09-26T16:35:25.710529Z"}, {"professor": "Howard Smead", "course": "HIST266", "review": "Professor Smead was very engaging in his lectures. They were easy to follow because he really know what he was talking about. He is also very funny and with a dry sense of humor.", "rating": 5, "expected_grade": "A", "created": "2023-11-30T05:14:00.858714Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Overall, this class is pretty easy. No electronics are allowed in the classroom. Exams consist of 2 essay questions that can be about any chapter that you learned, but they are not cumulative. Dr. Smead is very passionate about what he teaches and the TAs are helpful, but grading can take a little. Discussion is important to go to as there are readings each week but you don't have to prepare much. Would recommend for an easy Gen-Ed.", "rating": 4, "expected_grade": "B+", "created": "2023-12-03T22:28:08.861574Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "I had Dr. Smead in Spring 2023. He is hilarious and knows a lot about history. He is an excellent lecturer and the class was amazing and I learned a lot. The midterm and final exams in the class are take-home, which is great. I did however give Dr. Smead a 4 and not a 5 because he makes you buy his own book and laptops/phones are not allowed in class.", "rating": 4, "expected_grade": "A-", "created": "2023-12-11T20:47:31.896062Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Funny guy and great lecturer it's not impossible to get an A but it's very hard since it's impossible to ever get a 100% in anything even participation the max people always get is a 97%.\r\n\r\nThe workload consists of two exams, participation, and a final. The final and exams are just an essay based response under a time limit that being 1 hour for the midterms and 2 for the final. They are online so you can take them at your own time and there not monitored.\r\n\r\nGreat class to take with low workload but don't except an A so easily I would recommend taking it with smead if you liked what you read all the above like I said don't except an easy A.", "rating": 5, "expected_grade": "A-", "created": "2023-12-21T15:39:26.809684Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Course is super easy! Only need to go to discussions and take exams/a paper. With that being said this is an easy A- NOT an easy A.", "rating": 4, "expected_grade": "A-", "created": "2023-12-22T01:47:32.686163Z"}], "name": "Howard Smead", "slug": "smead"}