{"courses": ["BMGT302", "BMGT402", "CMSC106", "CMSC131", "CMSC122", "CMSC411", "CMSC389N", "CMSC216", "CMSC132", "CMSC411", "CMSC106", "CMSC216", "CMSC216", "CMSC411", "CMSC335", "CMSC411", "CMSC411", "CMSC216", "CMSC411", "CMSC106", "CMSC216", "CMSC411"], "average_rating": 2.4486, "type": "professor", "reviews": [{"professor": "Ilchul Yoon", "course": "CMSC131", "review": "Really nice guy. Co-taught CMSC131 with Dr. Pugh this past semester and didn't lecture much but still was active in teaching the course. I'm confident he'll do a great job teaching 131 next semester.", "rating": 5, "expected_grade": "", "created": "2017-12-28T20:23:02Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "Really, super nice. He's very excited and enthusiastic about teaching which is great.", "rating": 5, "expected_grade": "", "created": "2018-05-10T01:23:33Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "I work for him and he cares so much about his students and TAs", "rating": 5, "expected_grade": "", "created": "2018-05-10T01:32:51Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "Amazing professor! So friendly and approachable. He really cares about his students and listens to our concerns. He's also really excited about the topic which makes the lecture a lot more interesting to attend.", "rating": 5, "expected_grade": "A+", "created": "2018-05-11T15:42:27Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "Great prof, he's very enthusiastic about CS. He also cares a lot about is students and their success in the course. Definitely wouldn't mind taking CMSC 131 with him again.", "rating": 5, "expected_grade": "", "created": "2018-05-15T04:36:23Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "Professor Yoon is very respectful and does his best to teach the class fairly. Some of the projects/labs can get a bit difficult but there are countless office hours to get help and he often extends the deadline if the students feel that it is too hard. Despite this, his lectures are clear and helpful, and CMSC131 is completely doable with Yoon.", "rating": 5, "expected_grade": "B", "created": "2018-05-23T13:51:38Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "Not a great lecturer, but cares about students", "rating": 3, "expected_grade": "A", "created": "2018-06-02T14:30:29Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "Professor Yoon is a nice and careful lecturer. He provides enough time and hints for us to work on our projects and labs. However, he is not good at lecturing. So, if you do not have prior coding experience like me, you need to teach yourself to keep the pace with his lectures.\r\n", "rating": 4, "expected_grade": "B", "created": "2018-06-05T22:33:03Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "Not a great lecturer. Too little resource to prepare for the exam. Get ready to teach yourself if you are about to take this professor's class.", "rating": 2, "expected_grade": "B", "created": "2018-08-17T03:33:51Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "Pretty tough class if you don't understand. Exams are hard, there were not enough materials given to practice. He is understanding but not good as a lecturer.", "rating": 2, "expected_grade": "", "created": "2018-08-24T22:46:51Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "Dr. Yoon's delightful attitude towards student concerns was not enough to fully recommend him as a lecturer. This course is pretty dry and dull in terms of material, so I am not sure if any other teacher would've made it more interesting for me, but Dr. Yoon certainly did not.\r\n\r\nI took this course during a summer session so it was compacted into classes every day for 6 weeks. We had one midterm exam, a home work every week and a final exam. I felt so inadequately prepared for both exams, and the homeworks were tedious busy work. On top of that he assigned a coding project in C that was a simulation of the MIPS pipeline process (You learn about this during the class) and it was the second hardest project I ever took on and I felt it was just useless busy work. \r\n\r\nThe midterm was incredibly long and ridiculously packed with material not many were familiar with. He even said he anticipated low exam scores because people would not finish on time. For the first exam, we originally had 85 minutes, however since there was no class after ours let out he extended it to 100 minutes because people needed more time. This was the same situation for the final exam only no time extension. I barely got time to go to all the questions and just attempt them. \r\n\r\nThe one thing that makes this class with Yoon worth it, is it can be a passable class since he gives a butt load of extra credit and partial credit for just attempting questions but not necessarily answering them correctly.\r\n\r\nBecause of the unreasonable amount of questions on exams, the difficulty of the project and homeworks, the average of the class was a 56%. So Yoon curved the course NICELY. I ended up with a 66% and that was good enough for a B- .\r\n\r\nI like Yoon as a person and he's very helpful in his office hours but he still isn't very clear on the material a lot of times. Since I do not know how the other teachers are for 411 I cannot suggest taking them over Yoon. If you have to take Yoon just remember these things 1) The exams are unreasonably long and nearly impossible to get an A on, but he gives a lot of partial credit for simply attempting questions. 2) The project he assigns is hard and unnecessary busy work. 3) He isn't very effective as a lecturer, and does not give enough resources and practice materials to prepare you for exams. Even homeworks are not sufficient.", "rating": 2, "expected_grade": "B-", "created": "2018-08-25T18:00:11Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "One of the worst professors I've had. He is a terrible lecturer - anything he says goes in one ear and out the other. He gives extra credit and partial credit - but you don't learn anything in his class. If you actually want to learn something, I recommend taking another teacher.", "rating": 1, "expected_grade": "W", "created": "2018-08-27T21:39:27Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "A very dedicate professor, who always tries his best to help students to understand lessons.", "rating": 5, "expected_grade": "A-", "created": "2019-04-15T00:29:00Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "Although his teaching style is not that good and lectures are very hard to understand sometimes, Yoon has a great personality. The projects in this class can be hard, but he tries his best to make sure everyone knows what they have to do. Finally, the best thing about Yoon is that he makes big fair, curves in the class as a whole.", "rating": 4, "expected_grade": "C", "created": "2019-05-19T03:39:59Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "Yoon wasn't an amazing attention grabber during lecture but he taught the class really well. The projects really helped with learning the material and starting with Processing before Java was such a great idea. Overall highly recommend his class for beginners and experienced people alike.", "rating": 4, "expected_grade": "B", "created": "2019-06-02T23:20:59Z"}, {"professor": "Ilchul Yoon", "course": "CMSC389N", "review": "yoon dropped php and made this a javascript/react/mongo class. exam averages were 50% every time, with good curve (5-8%?) at end. around last half of semester <20 out of 110 kids attended lectures. Mostly a self taught class", "rating": 3, "expected_grade": "A", "created": "2019-12-21T16:40:41Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Yoon is a good professor for the material he teaches. I see that he has taught CMSC411 in the past, which does not surprise me. Yoon likes to attack the details of memory and other minutiae of the work done in the class. This is a good thing for those who can get a conceptual grasp of the content, but for those who are just here to code, it will be considerably difficult. Many students took to watching Nelson's lectures from previous semesters after the move to online because Yoon's lecture style proved too difficult to keep up with for some without being able to ask questions as they came to mind. Taking the time to understand Yoon's lecture style did prove very useful and I felt I learned quite a bit from the course overall.\r\n\r\nYoon's exams are tricky for similar reasons. Unlike Nelson, who will usually make his exams based around high-level understanding with code, a lot of Yoon's questions felt like tricks. There was a \"catch\" of some description in almost every coding question across all three exams, which can be annoying if one detail causes you to lose many points.\r\n\r\nYoon (and moreso Shankar) unfortunately did not do the best job of transitioning to the online environment after COVID-19 began making its rounds. I think they were unprepared for the scope of what they had to transition to, and as the semester progressed both got fairly crass. I don't hold this against Yoon too much, however, because the transition was hard for everyone.\r\n\r\nOverall, I'd recommend Yoon if Nelson is not teaching the course. You can always fall back on Nelson's material if Yoon's style does not make sense to you. Be prepared for tricky exams, but if you understand the low-level implementation of many different features in C, you should be able to score at minimum a B in the course.", "rating": 4, "expected_grade": "A-", "created": "2020-05-16T01:22:22Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Sometimes hard to keep up with during lectures, but he knows his stuff", "rating": 4, "expected_grade": "A-", "created": "2020-05-17T20:01:59Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "I thought CMSC351 with Kruskal was the worst class at UMD, but CMSC411 with Yoon over Summer makes a close second or possibly #1. The way the class is taught, organized and graded is a joke and I learned nothing because of this professor's teaching style. \r\n\r\nThe syllabus describes having up to 5 homeworks with NO due date. We ended up with 4 homeworks released randomly during the semester, one of which was released the last week of class  with 3 days notice - Mean. The class project also did NOT have a release date or due date on the syllabus and it takes half the semester to get even a few points (most of the class couldn't score more than 50% on the project). How are we supposed to plan for a semester with NO DUE DATES????\r\n\r\nFinals week was unnecessarily stressful. Last homework was due, the month-long project was due, and the final exam were due all one day after another. My mental health took such a hit with this bombardment of assignments and inadequate teaching from lectures that I couldn't study for the final at all. Somehow if you just write something down you get partial credit? But did I learn anything? Absolutely not. \r\n\r\nThe only way I passed was because the class had an average of 59% +/- 20%. Nobody had a clue what their grade was going into finals week. I somehow passed but I honestly did not care if I failed, this class was garbage and I feel it took more out of me than what it offered. I wish I had seen a review like this that would have made me change my 4-year plan to avoid this garbage, but at least I can graduate a semester sooner. \r\n\r\n", "rating": 1, "expected_grade": "C", "created": "2020-08-26T03:48:15Z"}, {"professor": "Ilchul Yoon", "course": "CMSC389N", "review": "Hard exams, but the content is extremely worthwhile when you get a job.", "rating": 5, "expected_grade": "A", "created": "2020-10-26T16:00:24Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "I took this course in Spring 2020.\r\n\r\nCons:\r\n- Lectures are quite boring, and once we went online they became significantly longer.\r\n- Exam content was completely unlike the practice, ESPECIALLY for the final. Practice material given was utterly insufficient in terms of relevance.", "rating": 3, "expected_grade": "B+", "created": "2020-12-22T01:40:19Z"}, {"professor": "Ilchul Yoon", "course": "CMSC389N", "review": "Don't ever take this class with this professor. On exams there's just a lot of problems that are impossible to complete in the given time limit, averages were about 50% for every exam. Barely curved and overall felt like he wasn't effective in getting the important points across. If you want to take this course wait til a different semester when there is another professor, that's what I wish I did.", "rating": 1, "expected_grade": "B", "created": "2020-12-24T17:51:38Z"}, {"professor": "Ilchul Yoon", "course": "CMSC389N", "review": "The online version of this class is not easy. Exams are long and very detailed, so Yoon definitely expects you to go over all minor concepts and code snippets before you take an exam. Midterm and final average was around 55%. However, the workload is not bad, and I think everyone was given fair amount of time to complete each project. Yoon applied a roughly 6% curve at the end, according to the statistical information of class. The teaching quality is pretty average. Overall, if you have to take this class, arrange this class taught by Yoon to one of your light-weight semesters, and you will be doing just fine.", "rating": 3, "expected_grade": "B+", "created": "2021-01-03T22:06:37Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "As a senior, who is doing a double major with engineering, I say that he is the worst professor that I have had at UMD. He rambles and does not connect with students at all. If you learn on your own, you will have no problem with him because you would have already taught yourself everything that you need to know. It is unfortunate to have professors like this who you technically pay to teach you. However, learning on your own is an essential skill in Comp Sci anyways. Stay away if you can.", "rating": 1, "expected_grade": "", "created": "2021-01-03T23:42:48Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Although Yoon is a decent (in-person) lecturer, once the pandemic started his exams were insanely difficult, with barely any time and literally nothing we learned on it.  Half of the class would fail these disastrously bad exams. Also, projects were vague and confusing, and the lectures online were scratchy, boring, and equally confusing. DO NOT TAKE.  ", "rating": 1, "expected_grade": "B", "created": "2021-01-04T19:30:53Z"}, {"professor": "Ilchul Yoon", "course": "CMSC122", "review": "Yoon definitely knows what he's talking about, and he goes into the small details about programming. But his exams and quizzes are extremely difficult, and he didn't give us a lot of time for the final project. The only thing that's a saving grace in this class is that his curves are insane, I went up two letter grades from my original percentage ", "rating": 3, "expected_grade": "B", "created": "2021-02-06T15:58:14Z"}, {"professor": "Ilchul Yoon", "course": "CMSC389N", "review": "I just want to say this dude is one of the worst professors at UMD. even worse than kruskal or teli or whoever else you want to name. I mean how do you turn a course about Javascript into having similar exam averages to cmsc351? That's absurd and complete blasphemy. You want to learn JS then just learn from w2schools. Don't take 389N expecting it to be an easy elective because it's not if you are taking it with Yoon. I also had him for 131 before which was a better experience but honestly that's the only class he should ever be teaching since 131 is a weedout course.", "rating": 1, "expected_grade": "B", "created": "2021-02-09T22:04:07Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "I have put my blood, sweat, and tears into this class. Every week, I open my legal textbook PDF and read a good 30 pages of it in addition to watching Ilchuls absolutely disorganized, unintelligible, garbled lectures. We have a lovely 5 quizzes, 5 homework assignments, 2 midterms, and a programming assignment that seem to be on things that Ilchul has never spoken of during lectures. Luckily, he sometimes gives practice material that sometimes helps you prepare for midterms/quizzes. When I think about this class, I feel like 50lbs of burning coal have amassed onto my chest. That being said, Ilchul is extremely clever; he will always give us quizzes/midterms that are impossible to finish, but then give a brief apology and swear a soon-to-be reneged promise to make the next quiz/midterm more fair and doable.\r\n", "rating": 1, "expected_grade": "A", "created": "2021-04-26T23:39:45Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "While I'd give Yoon a 3/5, all these 1-star ratings are just silly. There are only a few key ideas that you need to know that will get you a B/C on assignments, which will likely get curved up to an A/B anyways. People who overstress about trying to memorize endless pages and slides of material aren't approaching the course (and school) in the right way.", "rating": 5, "expected_grade": "B", "created": "2021-05-05T17:45:27Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "Nice guy, but a terrible teacher. The class is terribly structured, and the TAs are not helpful. I feel like I barely learned anything from this class.", "rating": 3, "expected_grade": "B", "created": "2021-05-17T15:01:46Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "I should preface this review by saying that not only did I take CMSC411 with Yoon, but I also took CMSC216 and CMSC131 with him. I was left with a sour taste in my mouth after 131 and 216. The common theme with all three of these experiences is that he is a subpar lecturer and his exams are hard. He very much adopts the philosophy of making exams harder than they need to be in hopes of students having a more thorough understanding of course material as a result. In 216, I completely disregarded his lectures and managed to pass the class solely through self-study of the recommended textbook. I anticipated that I would adopt a similar strategy for CMSC411, but it actually turned out to be the opposite. In 411, I learned practically all of the course material through lecture slides and their accompanying lectures. Reading the textbook isn't really necessary, but it is a useful second resource. I watched every recorded lecture and I was able to understand most of it, and it was not entirely because of the lecture slides. Yoon's lecturing was useful in understanding a lot of the complexities of computer architecture that I likely would have been lost on if I relied solely on the textbook (the textbook is far from an easy read), but the lectures were not easy to get through. The material for this course can be extremely boring at times. The project for this course is not to be taken lightly; absolutely start it as soon as possible. Class final grade average was ~62 and the cutoff to pass the course was basically a 50. Overall, I do feel like I learned a lot but it's not likely to be needed on a day-to-day basis so I will probably forget 90% of it. Yoon is quick to respond to piazza posts, punctual and courteous, but not the best lecturer.", "rating": 3, "expected_grade": "B", "created": "2021-05-21T22:24:11Z"}, {"professor": "Ilchul Yoon", "course": "CMSC389N", "review": "This class is very different from a regular computer science course. Many of intended requirements and documentation for the class is not explicitly written, and you have to watch videos in order to understand what your HTML, CSS, and JavaScript is even supposed to do. If you enjoy having explicit criteria for how your projects are supposed to function and do not like to have to watch a poorly made and slow video many times in order to understand the projects, I would avoid this class. On top of having to watch such unorganized criteria for such videos, his written documentation for projects are not very helpful either and lack critical information and details. It is obvious that little effort is made into writing the project descriptions. His lecture slides are not very organized and do not go into proper detail of the course content, so I find myself google everything for the class. I did not attend very many lectures, but his recordings had low audio quality and he rambles quite a lot. His examples are needlessly hard, and loves to go into random edge case quirks of the language that are almost never actually used or even considered in practice. I took this class thinking it would be an easy CS class, but the lack of structure and direction made me wish I was retaking 351 again.", "rating": 1, "expected_grade": "", "created": "2021-11-23T18:03:01Z"}, {"professor": "Ilchul Yoon", "course": "CMSC389N", "review": "Reasons to take CMSC389N:\r\n- Introduction to the frontend world\r\n\r\n- Yoon is a very nice person\r\n\r\n- Yoon and his course staff are super responsive on Piazza and email\r\n\r\nReasons to not take CMSC389N:\r\n- Lectures are basically Yoon trying to rush through an endless number of examples that are more complicated and lengthier than what they need to be. \r\n\r\n- Oftentimes, the goal of the class isn't solely your learning. Yoon allows cheatsheets on exams, and when we encountered a hard question/ example, he simply suggested that we should put an example of the case on our cheatsheets. \r\n\r\n- A countless number of times, you will find yourself memorizing code without knowing what exactly the functionality of the code is. As CS students at UMD, we all know that an effective developer must read the documentation. However, I am not paying tuition to just read the documentation\r\n\r\n- Yoon spends countless hours going over syntax and corners of Javascript and then ends up rushing through Express, MongoDB, and React which are mostly the things that people actually want to take away from the class.  \r\n\r\n- Yoon sometimes doesn't communicate points clearly and I found myself trying to decrypt his approach\r\n\r\n- Project descriptions are unclear most of the times\r\n\r\n- Exams are really lengthy and you often have to move on if you don't know the answer right away", "rating": 2, "expected_grade": "", "created": "2021-12-03T22:52:58Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "He's clearly knowledgeable, but the class structuring is abysmal, and there are questions on exams that he does not prepare you for. \r\n\r\nThere is also this project that is not that hard and boils down to busy work. \r\n\r\nOverall, I'd say what I learned what pretty useless if I end up remembering it at all, and I would recommend you take a different course if you're trying to fill out your area 1 requirement.", "rating": 1, "expected_grade": "C", "created": "2021-12-09T18:57:44Z"}, {"professor": "Ilchul Yoon", "course": "CMSC389N", "review": "I have to agree with the other review on 12/03/2021. Yoon is cool but the exams were unnecessarily difficult while the projects took less than a few hours to complete. The last few weeks cover mongo, react, express etc but it felt like the first month alone was on HTML. \r\n\r\nAlso I was hoping for a php section but it wasn't included despite the course name being \"php and javascript\"", "rating": 1, "expected_grade": "", "created": "2021-12-16T14:57:51Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "Pros:\r\n- Dr. Yoon is very nice person\r\n- Will answer your question in class... probably because only 10 other people came to class\r\n- The 1 programming had better documentation and public tests than most other projects I have seen in CMSC upper levels\r\nCons:\r\n- The class is based around curving. It's more stressful than it has to be\r\n- Exams and quizzes are stupid long; you will not finish\r\n- Exams are only tangentially related to practice problems and homeworks\r\n- Lectures are hard to follow and go by too fast. Dr. Yoon has a hard time of gauging when the class doesn't understands a concept he is explaining and will abruptly move on\r\n- Asking questions about the homework on Piazza is met with vague answers\r\n\r\nWill you die if you take this class? No.\r\nWill it be more difficult than it has to be? Yes. \r\n\r\n\r\n\r\n\r\n", "rating": 2, "expected_grade": "", "created": "2021-12-18T19:59:14Z"}, {"professor": "Ilchul Yoon", "course": "CMSC389N", "review": "The projects are easy, the exams are pointless because they do not focus on the essential skills of web development, mostly nit picking little details of javascript", "rating": 1, "expected_grade": "B+", "created": "2021-12-25T00:57:08Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "You do not need to attend his lectures. If you read the book you'll probably be fine. MAKE SURE TO WRITE SOMETHING REASONABLE DOWN FOR EVERY QUESTION ON HIS EXAMS. They are pretty generous with partial credit and will reward you for having some understanding of the material. Lectures were alright but I think the book was more useful. Class avg was like a 62 so just try to get around the average and you'll be fine.", "rating": 3, "expected_grade": "B+", "created": "2021-12-25T09:30:15Z"}, {"professor": "Ilchul Yoon", "course": null, "review": "Yoon's class is really keeping me on my toes. I am struggling and I find myself coding everyday. Although I do not very much like this, I have to say it is beneficial for me. Assignment , Projects, Quizzes are exam are arranged in such a way that you have to review material every day of the week(at least weekdays) . So if you want a challenge, take yoon's class..It is gonna be difficult more than it has to be though", "rating": 5, "expected_grade": "", "created": "2022-03-04T10:44:54Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "One of the worst instructors in the CS department and the university, avoid it!", "rating": 1, "expected_grade": "", "created": "2022-03-28T23:55:48Z"}, {"professor": "Ilchul Yoon", "course": "CMSC389N", "review": "Why the low rating?\r\n\r\nClass content is pretty interesting if your into web design. The slides in class and relevant documentation is really all you need to succeed in this class since all of the topics are are well established. So naturally I didn't attend lecture. \r\n\r\nThe projects are pretty easy if not repetitive. \r\n\r\nI do have a small problem with the tests in this class. They rely way to heavy on memorizing css properties, which i think is pretty useless when i can just have a list of css properties open while i code. \r\n\r\nAlso we didn't have React covered by class projects, but ended up being a big part of the final exam. which was pretty annoying since i had no experience with React. He did give a pretty solid curve though so no harm really done with those lost points.", "rating": 5, "expected_grade": "B+", "created": "2022-04-04T21:49:18Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "For a starter course for Computer Science major this Yoon makes this course extremely difficult. I took a bunch of other java coding courses before taking cmsc131 and even then I am struggling. His coding project assignments and labs are fairly easy and you have more than enough time to complete them, but when it comes to quizzes and exams be prepared to fail miserably. I don't remember our class getting more than 70 on average in any of his quizzes or exams. His exams and quizzes are heavy with writing a code on paper and you have no time to finish them. Right now the class average is a failing (even with projects and labs boosting the grades), and exams are not getting any easier. He talks that his course is for people that didn't know how to code before while making exams and quizzes more difficult than they should be like he is mocking you. His practices exams he gives you are also much easier than the exam itself giving you false hope.", "rating": 1, "expected_grade": "", "created": "2022-04-05T19:27:14Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "Took cmsc131 from him, at the start of the semester he told the class that this course is for people who had no prior experience in coding. I had 2 almost years of coding experience therefore projects were easy for me but  I struggled in his exams. His exams make no sense at all. He gives 2 to 3 handwriting code questions with the difficulty level of interview questions for a job and expects us to finish it in 50 min with lots of tricky multiply choices questions additional to that. He teaches nothing and expects us to learn from coding ourselves. He curves the class but having the stress is not worth it. I can't believe how stressful his course was. If you want to feel shitty and question whether to major in computer science take him otherwise AVOID him.", "rating": 1, "expected_grade": "C", "created": "2022-05-05T19:28:55Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "I don't know how to even feel about this class, Yoon is a really nice professor but his exams and quizzes are extremely hard. The averages for both the quizzes and the exams are extremely low. He loves to put tricky questions in his exams or quizzes which I extremely hate. For around the second half of the semester I had to basically teach myself or look up concepts that he taught because he overcomplicates them as a professor. He does post lectures + slides online though, and the TAs go through practice exams/problems in review sessions. A lot of the lectures are all over the place, but feel free to ask him questions during/after lecture and he'll kindly do so, he's a nice guy. ", "rating": 3, "expected_grade": "B+", "created": "2022-05-08T19:34:53Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "Yoon’s a great guy and very down-to-earth, but his lectures aren’t rly the best.  If you don’t already have a background in coding, I can understand how this course can be especially difficult (even if it’s supposed to be an intro level course).  If that’s the case, actually going to discussion and office hours can help tremendously bc Yoon or the TAs will look at your code.  ", "rating": 4, "expected_grade": "A", "created": "2022-05-22T00:44:39Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "Yoon was, quite frankly, not a good professor. For some reason, his 131 curriculum is different than that of the other 131 profs. He begins with Processing, which is basically visual Java and you will never encounter it again afterwards if you complete this class. It was more than halfway into the semester when we finally started doing Object Oriented Programming in Java, whereas with other 131 profs you start Java on day 1. Yoon's quizzes and exams are ridiculously hard for no reason: the multiple choice are usually random programming trivia from class and the coding questions are often curveballs. Pulling up GradeServer, our exam averages were as follows: E1: 68. E2: 59. E3: 61. Final Exam: 56. Such low averages on exams are indicative of one thing: lackluster teaching. There were a few good things worth mentioning throughout the class though. Yoon was quite flexible if you had extenuating circumstances and couldn't get a project in on time, or if some error happened in submissions. Additionally, because the class average was so low at the end of the semester, cutoffs were adjusted and some may argue they were generous (although I would say they were not overly generous, but necessary). I passed with a B+, having a 74 in the class. Try taking any other 131 professor if possible.", "rating": 2, "expected_grade": "B+", "created": "2022-05-23T22:46:55Z"}, {"professor": "Ilchul Yoon", "course": "CMSC131", "review": "This is coming from a guy who knows multiple programming languages and had taken prior programming classes before. Yoon is a nice guy but his exams were very difficult(considering this is would be the first cs course some people take). If this is your first programming class and you have Yoon, be prepared to study thoroughly for the exams.", "rating": 3, "expected_grade": "A", "created": "2022-09-07T18:56:19.556000Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "bro pick anybody, not him. When he explains things in class, its really bad. Like id look up YouTube videos on almost every concept. His lectures were really bad and he just doesn't qualify as an effective professor. His exams are a lot more different than other professors, and he doesn't put as much effort into his course as other professors do. If you have the opportunity to pick someone else, do it.", "rating": 1, "expected_grade": "B+", "created": "2022-09-29T03:33:38.010388Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "If you don't consider yourself to be an insanely masterful programmer, then there's not a lot of hope for you with this professor. You quickly realize that going to lecture can actually be detrimental at some times because self studying can get you far further in the course than Yoon can. Prepare to rely on YouTube videos, because trust me when I say there's not a lot you can get from his lectures. He's a nice guy, it's just that I don't really think he's a good professor for a beginner level class that some people take as their first semester in college. Quizzes are unreasonable and difficult, exams aren't too bad but not ideal, and he randomly started taking attendance for discussion halfway through the semester. If you're planning to register with this professor, my best advice is to go with literally anyone else.", "rating": 1, "expected_grade": "C", "created": "2022-11-11T05:47:08.792052Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Yoon is a great programmer, horrible communicator. He himself can do everything in this class, but you're expected to be at that same level. He started taking attendance for discussions, overlapped assignments, and typos across all of his assignments and quizzes. Made 216 absurdly harder than it needs to be, I had programmed in C/C++ for 1.5 years at another school but was not ready for this.", "rating": 1, "expected_grade": "C+", "created": "2022-11-15T22:37:27.509914Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Do not go to lecture. He is so badly out of touch with everyone and resorts to obsolete teaching and grading methods to try and make up for having no idea what the average student feels about his course. He is incapable of explaining basic topics in an easy to understand manner. Quizzes and exams test on random bullshit, just be exceedingly familiar with memory and understand the basic mechanics of programming in assembly/C. \r\n\r\nDO NOT TAKE THIS PROFESSOR. I understand that getting the non-yoon professor block is tough. It aint impossible to survive this course, but it unnecessarily, annoyingly hard. \r\nLike others here, I have a lot of experience in many languages, and he is god awful at explaining even basic linux/C concepts. On the 216 website there is a big PDF of notes on all topics this class will cover, and that will be your holy bible for this class because damn, a few hundred KB pdf is a far better teacher than yoon will ever be. I stopped coming to lecture after the second class.\r\nYour quiz/exam grade may suck, so be prepared to spend a lot of time on the projects/excercises, you NEED to nail them. If theres an exercise due a few days after the quiz, stuff on that exercise is fair game on the quiz, which is really stupid, so DO EXERCISES BEFORE THE QUIZ.", "rating": 1, "expected_grade": "C", "created": "2022-11-22T16:30:42.170277Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Yoon was a very confusing lecturer. I could almost never understand lectures and would have to teach myself everything for the projects and exercises, which was doubled the time I had to spend on the already fast-paced and intensive course. I'm aware that this course is supposed to be hard, but I truly believe that Yoon made it much more difficult for me. It was a really horrible and stressful experience; I would recommend taking a different professor.", "rating": 1, "expected_grade": "C", "created": "2022-11-30T12:55:19.100585Z"}, {"professor": "Ilchul Yoon", "course": "CMSC106", "review": "I love Yoon. Best lecturer I've had. He's great at structuring the course and explains things thoroughly. He's also just very personable. I wish he was my dad. Our projects were very manageable, we have like 5 total, 11pm due times, and you have to do the minimums for every project to pass the course. He encourages students to start them early, and it just made for a healthy homework schedule, if that makes sense. He posts review worksheets for exams, lecture slides, and example programs which have all been helpful. I'd say the quizzes are the harder part of the class, but none of them get too crazy. \r\n\r\nOther details... it was a smaller class, mostly math majors, most of us beginners. The lab section isn't as awesome since TA's teach that part, but they do fine. Also, he usually waits until the end of the semester to curve. But yeah, Yoon's a stellar dude.", "rating": 5, "expected_grade": "A-", "created": "2022-11-30T15:02:50.787207Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Meh. He was a great person, he's really funny! But his teaching is kind of lack-luster so minimally I had to self-study a lot of the material with no prior C experience (tbh if you did well in CMSC131-132 with Java, C isn't too much harder so don't stress too much). The quizzes were quite long for the time provided and often had D averages. I'd say the last quiz was fair no doubt, but the other 3 were kind of ehhh. Project wise, they can be quite difficult! Start early, but you'll really grasp the concepts after you do them. The exercises are normally related to the following project and the quiz, so make sure you understand them and try to do them before the quiz if feasible!", "rating": 3, "expected_grade": "B", "created": "2022-12-14T03:57:07.419855Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Prof. Yoon is a really, really great guy.\r\n\r\nHowever, he lectures are confusing. If you want to go to office hours, good luck. You'll probably need to wait for at least a few hours before you get help from a TA. The class is just very disorganized and you get your grades back super late, even a week before finals. 216 literally gave me so much anxiety and I really can't say that I learned much either.", "rating": 2, "expected_grade": "", "created": "2022-12-14T04:06:31.488458Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Absolutely treacherous. Avoid at all costs. At no point in the semester was I taught anything in a way that was coherent or immediately made sense. I had to rely on past knowledge and other resources to learn the material. In fact, I probably learned more from Herve's review sessions before the exams than I did in any lecture. Also, the quizzes and exams are unnecessarily tough. This class was structured and taught so poorly that it was comedic. As for the final, I think that the review material provided did a great job at instilling a false sense of confidence just for the final to the most nefarious and difficult exam of the year. As a person, Yoon seems to have kind intentions and a good sense of humor, but I absolutely could not recommend even my worst enemy take his course.", "rating": 1, "expected_grade": "C", "created": "2022-12-15T00:15:06.048079Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "You know, reading a bunch of these reviews, there is one thing you should notice. Any reviews above 2 stars are for really really basic classes like 106 or 131. \r\n\r\nCMSC2xx or above class? Run. Do your damned best to not get this background noise making, high-on-a-horse, out of touch, straight from the late 80s wreck of a \"professor\". The first thing you need to know about him is his lecture is straight up USELESS. He will go on extremely long, remotely related tangents that will not be on the quiz/exam. Then, after having wasted an hour of your time you paid for, he will realize he went on a tangent and then lightly breathe over important concepts that he will squeeze questions that had content you didn't realize were covered because he spent 2 sentences talking about the topic total. Or, he will bring extremely irrelevant concepts into something basic and make it incomprehensible. Or, he will jump back and forth between different parts of something he is explaining so you won't make heads or tails of it. It's also important to note that if you have an exercise or project due a few days after an upcoming assessment, stuff from that assignment is fair game for the assessment.  Anyway, he got so butthurt that no one was coming to discussion/lecture that he assigns graded \"nothing\" assignments during discussions so you are forced to go to discussions. \r\n\r\nNow, about quizzes and tests: It's really BS. Because Yoon has such a bad grasp on what he thinks you can do, the quizzes range from RNG to straight-up unfair. Coding assignments on these quizzes are sometimes on the same tier and difficulty of assignments you usually have a whole week to complete. Questions usually cover things that are too easy to things that you would never ever consider in any applied use. \r\n\r\nWill this class make you a better programmer? Skill-wise, meh. Knowledge-wise, yes. 216 is a class with an excellent curriculum, this is coming from someone with a lot of experience in Linux and enterprise programming. Yoon just manages to make this very important class in your CS career absolutely painful and unnecessarily annoying. Learn what you can. If you have to take this useless professor for it, I really hope you have a better choice, but it's possible to survive.", "rating": 1, "expected_grade": "C", "created": "2022-12-15T00:43:13.843351Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Yoon is a caring professor but is bad at explaining topics. He is very monotone and has harsh exams. For this semester, I have needed to go to private tutoring sessions and learn all the concepts for this class through anyone else but Yoon. If I could take this class again, it would not be with him.", "rating": 1, "expected_grade": "B", "created": "2022-12-16T00:08:44.456484Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "THE GOAT!!! Yoon is better than Fawzi, Justin, Nelson, and Jose combined!! Strongly encourage taking this professor :) Exams are fair and he hosts a lot of study review sessions for the quizzes (the quizzes are short). He gives a lot of time for the projects and exercises and is very lenient (I didn't do two of them).", "rating": 5, "expected_grade": "A+", "created": "2022-12-16T00:11:16.977672Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Pros:\r\n- Yoon is a genuine guy\r\n- Lots of TAs for office hours\r\n- He will answer questions in class \r\n\r\nCons:\r\n- Difficult to take notes and understand concepts because he rambles too much and speeds through slides\r\n- Exams are difficult (Averages below C)\r\n- Office hours have too many people in them (Average wait time is 1.5 hours)\r\n- Interpreting wording on quizzes is incredibly difficult to interpret (Quiz average consistently below D)", "rating": 1, "expected_grade": "B", "created": "2022-12-16T23:51:50.806920Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Pros:\r\n- Incredibly extremely knowledgeable about the subject, very clear that this is what he's good at.\r\n- Projects and exercises are designed in a way that forces you to learn. Very helpful for learning subjects that are tested on exams.\r\n- Exams are typically fair (with exceptions, explained later), both content-wise and time-wise. This includes the final.\r\n\r\nCons:\r\n- Lectures will leave you confused, bored, and with a realization that he just covered enough information for a week of most other classes in just one lecture by BLAZING through insanely content-dense slides, skipping a decent amount of them that will end up being testable\r\n- The downside of exams: they are only fair if you review every slide of every slideshow and have notes on all of them. This class will require you to go back after every single lecture and take notes on the entire slideshow that he barely went over in class, because it is all testable material. This is one of the only reasons I passed the class, and I highly recommend you do the same if you have the unfortunate luck to end up with him as a prof.\r\n- Going off the previous point, this class will require 8+ credit hours worth of work. Every project is assigned back-to-back, with exercises (essentially mini-projects that are also submitted to the submit server) assigned with overlapping deadlines to the projects. This class will essentially train you to have the mindset \"If I have free time, I work on the project\" for the entire semester. A fair number of students start giving up near the end, just doing the bare-minimum to pass the projects. I chose to put in an unnecessary amount of work to this class to complete them, and it forced me to skip most extracurriculars and free time activities that I enjoyed. Pick your poison I guess. Also students complained about this aspect of the class, and Yoon's response was essentially \"this class is challenging, deal with it\".\r\n- The quizzes. were. the. WORST. The averages were horrendous because for some reason, he has the inability to understand how to create a reasonable assignment for a 15-minute quiz. Most of the time will be spent reading his page-long small text explanations for the code writing question at the end, and by the time you've figured out what you actually have to accomplish, there's 5 minutes left. This was incredibly surprising considering there was never a time crunch for exams, but I guess his exam writing skills don't translate over to the quizzes. \r\n- As a principle, I despise professors that require students to show up. We're paying to be here, it should be on us to go to class. I skipped discussions because my TA was incredibly useless, typically mumbling to himself the entire time as if he's never interacted with another human being in his entire life. Near the end of the semester, Yoon decided to grade (as put by another review on here) \"nothing\" assignments at every discussion. Typically, it was a small worksheet that would take about 15 minutes that would cause us to leave incredibly early anyways. Complete waste of me and every other students' time that would have been better spent working on the projects. \r\n\r\nOverall, avoid him. Definitely a passable class, just be prepared to put in WAY more time into the projects, exercises, and studying than you're used to from 131 and 132. The only reason he gets 2 stars instead of 1 for me is a) he's completely oblivious to the way his course design tortures students outside of class and b) the exams are pretty fair. Best advice: review all the slides and take notes outside of class, and START PROJECTS EARLY. I don't mean just early, like the literal hour they are assigned. You will typically end up having a time crunch with the deadline if you don't, especially near the end, and you absolutely need the project grades to boost your overall grade in the class.", "rating": 2, "expected_grade": "B", "created": "2022-12-17T15:18:31.255200Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Yoon's CMSC216 is the first CS class at UMD that I've felt lost in. A lot of things were more difficult than they needed to be, which gives off a very \"weed out class\" vibe. Yoon's accent makes lectures hard to understand, and he usually goes into minute details of programming which can make it extremely hard to pay attention during class. However, lectures are recorded, and they are watchable when you pause every once in a while to really understand what he's saying. The quizzes and exams' tested materials are mentioned in lectures or at least referred to, but they're often lost in a mountain of additional info that never got mentioned again or seemed very insignificant. The first quiz was a disastrous time crunch, but he hasn't made the same mistake again in my opinion. Office hours were always full, and attendance was suddenly graded halfway through the semester. Attendance grading was very superficial and felt more like an annoyance.  All in all, I wouldn't recommend Yoon as a 216 professor. But, if you really have to take him, I'd recommend looking at Ekesh's 216 notes, lecture code examples, having a study group, making sure you finish the projects on time by yourself and watching lecture recordings if needed.", "rating": 2, "expected_grade": "A", "created": "2022-12-18T02:59:39.430244Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Terrible teacher. He should’ve never  taught 216. I feel ripped off from this semester thanks to this atrocious “professor”", "rating": 1, "expected_grade": "", "created": "2022-12-19T22:58:48.618893Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Yoon is a good person, but I can see how he is not particularly liked as a professor by many students.  It's kind of difficult to follow along during lectures and his way of teaching is definitely disengaging.  HOWEVER, I don't agree with all of the hate he receives, and as long as you make sure to start projects early (omg this is SO important) and stay up-to-date with the lecture material, you'll be fine.  If you want to prepare for this course, you should understand topics like programming in C, Assembly, memory management (huge), processes & shell, etc.  \r\n\r\nAlso do NOT rely on office hours to help you for your projects, there WILL be a waitlist for at least an hour before TAs even get to glance at your code.  The entire thing is a circus if you are dependent on it.", "rating": 3, "expected_grade": "B+", "created": "2022-12-20T13:51:29.367438Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "That 5-star review is so sus. \r\n\r\nFirst of all, there is not a single person on campus who will say that Yoon is better than even Herve, let alone Nelson or Justin. \r\n\r\nSecond, the quizzes may have been 15 minutes long, but that doesn't mean there was 15 minutes' worth of content on there. No, those quizzes needed at least 25 minutes, and they were always tricky for no reason. \r\n\r\nThird, he gave us zero time for our projects and exercises. We had due dates one after the other, nonstop. We would have a project due date, followed by a quiz the next day, followed by an exercise due date. And this happened multiple times throughout the semester. Keep in mind that all of us taking this course were also most likely taking 250 and linear algebra or stat. Yoon thinks that we live and breathe 216. \r\n\r\nLastly, he is very much not lenient. We had a due date for one of the projects the day after Diwali. We all know that a good chunk of computer science students consists of people who celebrate this festival. Students were on piazza begging for just a one-day extension for the project, and his TAs were so rude with their responses. Yoon didn't even bother to acknowledge any of these pleas. He probably expected his students would prioritize a CS project over their religion.\r\n\r\nApart from all of this, there's also the fact that he's a terrible lecturer. He used the tiny ESJ whiteboards in a giant lecture hall on multiple occasions. I was sitting in the middle and I could barely see what he was writing. I could work past that if I at least understood what he was trying to say, but the man cannot get a point across. He has a whole storyline but he can never get to the point - he just hovers around it. That's the best way I can describe his teaching style.\r\n\r\nFinally, there are office hours. This isn't a Yoon thing, but I'm just preparing anyone who's signing up for this class for what they're about to go through. You have to wait for hours in the office hours lines, only to get ten minutes of help. It's not worth it at all. I would recommend attending discussion sections and just asking your questions there. It's much easier to get a hold of the TA then.\r\n\r\nTo conclude: Take ANYONE other than Yoon.", "rating": 1, "expected_grade": "A-", "created": "2022-12-22T05:35:09.219270Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "An absolute disaster of a class. Organization was terrible, quizzes were impossible, and exams covered edge cases. Never take unless you need to. He is a nice man however and very responsive to questions.", "rating": 1, "expected_grade": "C", "created": "2022-12-23T01:29:59.238929Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "I didn't pay attention to a single lecture. I put that I'm expecting a B- but it could honestly be a B+. I'm also writing this a week after the final and there are still several grades including the final that are still in the process of being graded. This is a common theme throughout the entire class because it takes over a month to grade everything including but not limited to projects, quizzes, tests, and exercises. This meant that studying for the final, two quizzes weren't graded for me to look at and review. Herve got their final grades yesterday meanwhile Yoon hasn't graded the last three projects and final. This class is already hard to begin with, and this professor makes it considerably harder.", "rating": 2, "expected_grade": "B-", "created": "2022-12-24T01:33:29.324497Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Keep in mind for this review I literally didn't go to a single lecture but I tried my best to understand his videos because it was easier for me to pause, go back and digest, google search along the way. However, being in class for this lecture seems very useless. I'm Korean and I have 0 clue what he's saying so I cant imagine how it is for other students. It's literally not the accent its the things he's saying that makes no sense. Common sense seems to elude this man because he used a small whiteboard to draw a memory map on in the iribe lecture hall. The course work seems very heavy at times with little to no time to take breaks in between assignments. Start assignments the day they are assigned because otherwise you will not have access to office hours because the lines can be 2+ hours long. The exams were relatively fair, but the quizzes were RNG jokes for the most part that you can't really expect to get good scores on. However, doing the projects before the quizzes could help but its kinda hard to do that because you have like 2-3 days before. Overall its manageable but you can expect to learn everything from TA or on your own.", "rating": 2, "expected_grade": "B", "created": "2022-12-24T08:09:29.055685Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "okay man. theres a 3 star review below this one that doesnt understand why yoon gets all the hate. let me spell it out for you.\r\n\r\nclaim: yoon is a terrible lecturer.\r\nyes? you know what that means? you have to spend extra time outside of class to learn what he is incapable of explaining\r\n\r\nclaim: just start the projects early so youre not dying at the deadlines\r\neveryone works at a different pace and 216 is not the only class you will take in the semester. there is absolutely no justification for the pace of the work. seriously, who assigns projects on NEW UNITS, BACK TO BACK? like i just mentioned, you already have to teach yourself the entire class, and now you have almost no breathing room to do projects.\r\n\r\nclaim: just dont rely on office hours \r\nwhat, because yoon cant teach and its absolute RNG if your TA cant teach either? \r\n\r\nclaim: just stay up to date with the lecture material\r\nsee below.\r\n\r\nclaim: just understand [class topics]\r\nshut up man. you know who was supposed to teach us that? yoon. did he? no. \r\n\r\nyour review summarized: just work hard and the class is fine\r\ndude, people have lives. a 4 credit class should not have the workload of a 6-8 credit class. duh if you had 278 years to take this class its fine, dumbass\r\n\r\n5 star review somewhere below this one:\r\nstop trolling.", "rating": 1, "expected_grade": "C-", "created": "2022-12-26T16:49:21.238884Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "The level of disorganization and pettiness is deliberate. Avoid at all costs.", "rating": 1, "expected_grade": "C", "created": "2022-12-27T23:03:10.121535Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "One of the most disorganized, artificially difficult, and just terrible classes I have ever taken with a professor. This review is hard to write because he is a sweet man and does want to help you, it just seems like he does everything in his power to make you fail when you aren't 1-1 with him. This class made me breakdown multiple times over the semester due to his ridiculous project and exercise deadlines, his nearly impossible quizzes, and his brutal exams. His final is not bad though, you just CANNOT TRUST the guide he gives you for it. Study as many edge cases as possible and get ready to completely forget that office hours exists, since they are always packed with 30+ people. The TAs are nice, albeit absolutely exhausted from Yoon's constant barrage of work that requires grading. Due to this, we took out final on 12/14 and then I finally got my grade in Testudo today (12/28). Please do not take this man for 216. I know what you are thinking, that you are different and can survive off of documentation and willpower. That may work for 131/132, but not for Yoons class. We were given a hefty curve at the end which only seemed to barely help.", "rating": 1, "expected_grade": "C", "created": "2022-12-28T16:06:56.401765Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Inconsiderate of the fact that students are likely taking other classes outside of his.\r\nAs a result we had a lot of deadlines in a short period of time, which made it impossible to get help from the TAs since they were overloaded all the time.", "rating": 2, "expected_grade": "C+", "created": "2022-12-30T18:46:24.510078Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "honestly, run or learn how to self teach. it’s very difficult to keep up during lectures unless studying ahead of time and it’s very easily to fall behind so there isn’t much time to read ahead. the course is designed to have a lot of projects and other work that take up a lot of time, and there isn’t much you can do about it. unfortunately, since the lectures weren’t great, there was a lot of time also allocated to self learning the material. the exams and quizzes were sometimes fair and you can’t really change the course curriculum or pace but i wish the lecture style was better", "rating": 2, "expected_grade": "A-", "created": "2023-01-02T08:59:11.584710Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "How to survive 216 with Yoon (extensive):\r\n\r\nI'm going to begin by stating why I am rating with 3 stars. I'm giving him 3 stars because he is a genuinely nice teacher who wants to help you (especially if you go to his office hours). I also noticed that progressively through the semester, he made his incredibly difficult quizzes slightly easier, learning from student's complaints. Quiz 1 and 2 were incredibly difficult, but the last few quizzes were arguably easier than the other professor's quizzes and were a bit fairer. He started off writing some content on an incredibly small white board, but listened to student complaints and shifted to projecting onto the large screen. His practice questions were also pretty good practice for his exams, despite what some people might say below. You just have to study ALL practice tests, not just one, to have the best chances. At the end of the day, he is a caring professor so I'll give him that. BUT, his lectures lack a lot and it is very hard to follow him sometimes. You have to be prepared to put in a lot of extra work and try your hardest in this class. It has to be your top priority if you want to get an A or B. That being said, here are some tips for this class: \r\n\r\n1. Always try to start studying for quizzes and exams A WEEK before (Every quiz and exam MC or Short Answer may have tiny details that will be found from the large amount of slides that are posted on Elms). You NEED to go back to each and every slide and try your best to understand and remember what it said on each slide. You will not get away with two days of studying unless you absorb every lecture well, which is not likely to happen.\r\n2. CODING EXAMPLES and PROJECTS. The coding examples that are done during lecture or labs are insanely helpful and amazing practice for coding questions on quizzes and exams. Some coding examples or project codes are very close to what you will see on this examinations. If you practice the codes from your projects/exercises and lecture examples, you will do fairly well in coding questions. \r\n3. Go through every year of Practice exams provided. Before midterms we were given practice exams from multiple years. Focus most of your energy on the coding practice for this exams, but short answer and MC are great too because if you are lucky, they may reuse some former questions. \r\n4. START PROJECTS ON THE SECOND OR THIRD DAY (or first day if you really want). We are college students and sometimes we have better/more important things to do than starting projects and finishing them quickly. But, some of the projects released for this class have very difficult public tests and even harder release tests. The good thing is that they enforced an early deadline for the first two public tests for each project and usually if you passed the first two tests, you might pass almost all the other tests. Using this early deadline to your advantage is crucial because if you pass all public tests at the first deadline, you will have more time for release tests and office hour help. DON'T make the mistake of starting release tests very close to the final deadline because you won't get much help from the TA's who will have their office hour schedule filled up from other students. \r\n5. Rewatch Yoon's lecture videos after reading his lecture slides. This was a big one for me since I learn better by reading content and then listening. Yoon's lectures are very hard to follow in person (for many people) and I often zone out in his classes, absorbing nothing. This is what causes many people do perform poorly in this class. They don't go back and rewatch the lectures which can actually be great supplements to the lecture slides (which I'm guessing is most people's only resource for content studying). Now, I'll admit that I did not rewatch every single lecture because I did not have time, but for concepts you are very confused in, I recommend it because Yoon does have some good info in lecture if you actually pay attention or look back. \r\n6. BE PREPARED TO SELF-TEACH AND HAVE DISCIPLINE: You need dedication in this class and you need to actually care about it to do decent in the class. You need to set schedules for yourself to code up the projects and you need to try to make some attempts to attend discussions because some can be very helpful. During the Assembly and Processes unit of 216, it was mandatory to attend discussion. Many students were not happy about that but I think it fared well for them in the end. Those concepts would be incredibly difficult to understand by just reading the lecture slides and I'm sure many students would have failed those portions on the Final if they were not forced to attend discussion. In my honest opinion, discussion was very helpful during the last couple months when they made it mandatory (it was a bit \"useless\" earlier which is why many skipped).\r\n\r\n\r\nAll in all, if you care about this class and prioritize it, you can most definitely get at least a B (especially with the curve at the end).", "rating": 3, "expected_grade": "A", "created": "2023-01-18T20:32:46.830298Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Don't take this professor at all. terrible. only take as a last resort. basically, ur grade depends on the curves and all u can do is pray and hope you pass or you dont", "rating": 1, "expected_grade": "", "created": "2023-01-22T02:59:02.578107Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Not an awful person. Is a bad teacher, unfair exams and quizzes designed to not be finished. This guy's only on the registration sheets to ruin your GPA if you have a late registration date.", "rating": 1, "expected_grade": "C-", "created": "2023-01-26T19:50:57.276466Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "The exams were fair but the quizzes were not. Crammed a 30 min quiz into 15 minutes. By the time you read the instructions, you only had 5 mins to to think and write.", "rating": 2, "expected_grade": "A-", "created": "2023-01-27T01:53:34.961677Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "A nice person overall but not the greatest professor. The lectures are quite confusing. The projects are difficult. The quizzes are the most horrible. The exams are nerve-wracking. The class has great TAs so that was how I survived.", "rating": 2, "expected_grade": "C+", "created": "2023-02-20T00:46:07.376628Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Yoon's lectures are chaotic and disorganized. No, its not his job to be entertaining, but saying \"I hope you can survive [my class]\" is not a great sign. I was not on top of my work because of having a hard time with life, so I am sure plenty of students better than I can succeed in Yoon's 216 course - I was just not able to at the time. Also, my TA was pretty clueless. I cannot recommend Larry enough for 216. glhf", "rating": 1, "expected_grade": "W", "created": "2023-04-29T20:41:27.198151Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "He doesn't deserve all the hate he gets from the students. If you actually listen to what he says in class, the projects aren't terrible, and his examples provide a strong basis for projects and exams. However, his lecture slides aren't the best, and you have to rely on your own self-studying from time to time. ChatGPT is very useful side-by-side with lecture slides if you are self-studying.", "rating": 3, "expected_grade": "", "created": "2023-05-10T20:10:14.976401Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "This guy is GOATED!!! He explains concepts very clearly during lectures. Because of that, I legitimately turned off my brain for every quiz, project, and exam and aced everything. SUPER EASY!!!! MAKE SURE YOU TAKE IT WITH YOON!!!!!", "rating": 5, "expected_grade": "A+", "created": "2023-05-12T16:09:21.667590Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Yooooooon. The goat himself. In all honesty, he probably was as bad as everyone has been saying but I don’t know since I took him this semester. \r\n\r\nThe best part of yoon is that he is a genuine nice guy who isn’t trying to make his class tough. Maybe he changed his project/exercise schedule because it was honestly pretty fair. From what I heard from friends taking Herman, we actually had less work this semester.\r\n\r\nYoon has probably realized that his class is too hard. The dreaded quizzes are no longer in his curriculum. While it’s true that the test average is usually around a 60, yoon curved the grade at the end of the semester. Make sure you get all the project points you can because the padding will help tremendously. We also had a 4% extra credit project after cutoffs and curve so the grade distribution is probably significantly better this semester.", "rating": 4, "expected_grade": "A", "created": "2023-05-17T07:43:05.105746Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Terrible teacher please avoid at all costs, the projects are easy but the exams are the worst I've ever taken in university. He will give you 5 hand written coding problems and will nitpick points for missing one line of code. The exams are worth 60% of your grade and the coding questions make up 70% of that. Also the study guides aren't like the exams at all, he will purposely put irrelevant questions to throw you off. His lectures are pointless to go to and have relatively no useful information relating to the exams worth 60% of your grade. \r\n\r\nHE IS ONLY ON YOUR SIGN UP SHEETS IF YOU HAVE LATE REGISTRATION. WAIT A SEMESTER OR TAKE ANY OTHER PROFESSOR ITS NOT WORTH THE HEADACHE AND THE STRESS OF HIS EXAMS", "rating": 1, "expected_grade": "D", "created": "2023-05-23T02:55:13.401685Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Okay, here's the thing. Yoon is probably one of the sweetest people in the CS department. I agree his exams are hard, but they are made hard by design. He wants you to have a deep understanding of the material of the class. There is a reason we cover much less material than the other professors teaching the class. Like, if we are studying pointers, he wants you to understand what are the weird limitations of the pointers. This was a very common theme, where you had very application-based questions, rather than theory. \r\n\r\nThe best way to do well in Yoon's class is to take initiative. Now, the initiative does not mean just turning up to lectures and discussions, but a whole lot more than that. You have to get your hands dirty in the material, wayyyyy before the exam. In fact, what helped me was office hours. The TA and Yoon's office hours were fairly empty, and I made it a point to go to them, not just for projects, but for understanding the concepts. The most important thing, however, YOU HAVE TO LEARN TO ASK QUESTIONS. Why does this work? What is the basis for this claim? What happens if I change this? Things like this are very important, and you have to learn how to ask things like this, and then go to the TAs and Yoon if you cannot figure it out. \r\n\r\nIf you start comparing whose the better prof for 216, i would say it depends on your personality. I had larry for 132, and absolutely hated his style off the class did not suit me, and I ended up getting a B. Where Yoon's style was right up my alley. (style does not mean teaching style, but rather the style of the class in general)\r\n\r\nThe only reason I have given hima 4 star instead of a 5, is because his lectures are hella boring. To the extend that you don't wanna go to them and, there is little to no practice material for a majority of the course, so you have to go in blind in the exams.", "rating": 4, "expected_grade": "A", "created": "2023-05-27T19:11:55.087369Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Okay, here's the thing. Yoon is probably one of the sweetest people in the CS department. I agree his exams are hard, but they are made hard by design. He wants you to have a deep understanding of the material of the class. There is a reason we cover much less material than the other professors teaching the class. Like, if we are studying pointers, he wants you to understand what are the weird limitations of the pointers. This was a very common theme, where you had very application-based questions, rather than theory. \r\n\r\nThe best way to do well in Yoon's class is to take initiative. Now, the initiative does not mean just turning up to lectures and discussions, but a whole lot more than that. You have to get your hands dirty in the material, wayyyyy before the exam. In fact, what helped me was office hours. The TA and Yoon's office hours were fairly empty, and I made it a point to go to them, not just for projects, but for understanding the concepts. The most important thing, however, YOU HAVE TO LEARN TO ASK QUESTIONS. Why does this work? What is the basis for this claim? What happens if I change this? Things like this are very important, and you have to learn how to ask things like this, and then go to the TAs and Yoon if you cannot figure it out. \r\n\r\nIf you start comparing whose the better prof for 216, I would say it depends on your personality. I had Larry for 132 and absolutely hated his style. The class did not suit me, and I ended up getting a B. Whereas Yoon's style was right up my alley. (style does not mean teaching style, but rather the style of the class in general)\r\n\r\nThe only reason I have given him a 4 star instead of a 5, is because his lectures are hella boring. To the extend that you don't wanna go to them and, there is little to no practice material for a majority of the course, so you have to go in blind in the exams.", "rating": 4, "expected_grade": "A", "created": "2023-05-28T09:57:36.983459Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "please don't add this to your schedule its only there to waste your time and wreck you on exams \r\n\r\nhe will give you practice exams that have no correlation towards actual exams studying them will throw you off even more. His lectures are useless to watch and attend often not starting recordings and having a thick accent, while teaching you information that doesn't correlate towards relevant information.", "rating": 1, "expected_grade": "D", "created": "2023-07-11T10:03:28.916309Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Yoon is a rough teacher. He is a very nice guy and I do like him generally but he will absolutely destroy you on exams. He does not test you on useful or fair knowledge but on petty content that does not relate to important concepts. I found him to be confusing and difficult to understand overall, would highly recommend another professor or waiting a semester if needed.", "rating": 1, "expected_grade": "C", "created": "2023-08-17T16:23:36.443184Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Easiest Professor I've taken. You do not need to show up to class and makes projects very easy. Tests are open note and can ask TA for help. Great guy!!! TAKE YOON!!", "rating": 5, "expected_grade": "A+", "created": "2023-08-30T15:42:49.610771Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Just for clarification the review below mine is sarcastic. Tests are not open note and are very challenging", "rating": 3, "expected_grade": "", "created": "2023-11-19T04:07:05.953129Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Teaches as if you have already learned the content which is like ok for C because its similar to Java but not great. When we got to assembly, I was totally lost. He has this expectation that everyone likes to figure out c on their own for fun or something because a lot of times he will just be like \"this might cause problems. You should figure out how on your own\". Instead of assigning weekly projects like we had in 131 and 132 we will go weeks without having anything and then you will have one thats insanely hard. When an exam comes up you have to put aside everything for over a week to even get a semi decent grade because you have written programs that covered maybe half of the topics on the exam and he gives out Nelson's practice exams(which apparently average like a 90 when his exams have like a 60 average).\r\n\r\nI will say that if you do manage to pay attention in lecture he does sort of tell you like \"I might ask you a trick question on this\" so like I guess you can kinda tell what hes putting on exams. However, I would say that I have above average time management skills and I pay attention in lecture and I still am struggling.", "rating": 1, "expected_grade": "B+", "created": "2023-11-22T19:25:10.127944Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "He's a nice guy but a bad/boring lecturer and makes even worse tests. The multiple-choice/short answer section is essentially all trick questions just testing you on edge cases most of which you would never expect to know, and you can't even figure out how to study for. Exam averages are consistently in the low to mid 60s, which no matter how far in advance, or how much you study it just feels like it always amounts to a barely passing grade. Yoon gives Nelson's past exams as practice exams which does not even come close to accurately replicating the difficulty of the one's Yoon writes. Coding assignments are alright, some of the projects are stupidly long and difficult, and some of the exercises can be knocked out in a few hours, so it somewhat balances out. Overall, this class is definitely a struggle, obviously no one is going to voluntarily take this man if other options are available but if you are stuck with him, please know it is not the end of the world, it is very doable however you must come to terms with the fact that your gpa is just going to take a hit.", "rating": 1, "expected_grade": "B", "created": "2023-12-05T15:06:13.908192Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Exams are hard,\r\nhe gave us the hardest project right before finals and is assigning another one during finals,\r\nwe also have no practice exams for the final,\r\nif you want a good idea of how you are doing in the class and a grasp of the material i wouldn't recommend yoon", "rating": 1, "expected_grade": "", "created": "2023-12-07T12:04:11.833589Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Pretty boring lectures, but Patrick the TA is the goat. It’s pretty easy to make silly mistakes on Yoon’s tests, so practicing writing code by hand can help.", "rating": 3, "expected_grade": "A-", "created": "2023-12-12T06:22:45.213035Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "I couldn't take the final because I lost my ID", "rating": 1, "expected_grade": "D-", "created": "2023-12-13T03:36:44.187931Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "I want to preface this by saying that Professor Yoon cares about the students and cares that students understand what he's saying in lecture. He's also very smart and qualified to be a CS professor. However:\r\n\r\n- He does not explain concepts well in lecture. He's overqualified for his job and makes assumptions about what we already know, so most of my time spent in lecture is spent playing catch up instead of following along with what he is actually trying to teach. That said GO TO LECTURE and GO TO DISCUSSION. It sucks, I know, but if you can do your best to try to follow along you will be miles ahead of everyone else.\r\n- He speaks with a thick accent and uses a grammatical structure (Korean) that impedes understanding. Without trying to sound racist, he just speaks in a very confusing way.\r\n- Exams are very long - difficult, but time will be your biggest issue. Considering the test average for my class is 62, you should focus on completing every problem rather than making sure every problem is correct, so you can get saved by some partial credit. Most of my friends have left full pages blank on exams.\r\n- Take the projects seriously. If you care about being a good programmer that is literally all that is important. Don't cheat on them, or if you do at least make sure you understand what you are copying. Without this I guarantee you will fail tests.\r\n- TAs take upwards of a month to grade tests and projects. On this day of writing (12/14) there are projects from 11/16 and lab activities from 11/15 that are still ungraded. Our second midterm took a full 4 weeks to get back.\r\n- Try to build a relationship with him by asking him questions after class or going to his office hours. I was able to do that and got a late assignment excused simply by asking. \r\n- For the first 2 midterms, review EVERY SINGLE example given in lab. He bases a lot of his questions of these exact examples.\r\n\r\nIf you are registering for Spring 2024: try to take Kaufman. If not, don't believe all the horror stories you hear about Yoon. He's a good guy at the end of the day, and you can try to establish a good relationship with him by speaking to him after class. That said this will be the hardest class you will probably take in the CS department and is infamously known for having one of the lowest average GPAs.", "rating": 2, "expected_grade": "B+", "created": "2023-12-14T22:46:26.184916Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Before you judge based on my expected grade, just know that I was not that good of a student so keep that in mind.\r\n\r\nYoon is a caring person, but Yoon's lectures can be hit or miss I'd say depending on how interested you are on each lecture's topic. The beginning since it is simple C things, it is not so bad, but once you get to the harder things like assembly, that is where it really gets difficult as it was not very clear of an explanation on how things work. I mainly just used youtube for my understanding of Assembly, which I honestly still don't get too well, but that is also because I am not really interested in Assembly (and a lot of people probably aren't either so don't feel down if you don't understand Assembly well) and I did not study much about it. His projects can be difficult so try to start early (which I did not). If you can, after each lecture write some code about what you learned and maybe watch some youtube videos about it for more clarification, this will compound over time and you will succeed. I just followed the lecture slides along with the codes and messed around with the code by changing some syntax or writing it on my own. Also as soon as you can, start drawing memory maps for all the code from the lecture slides, this really helped me how things work.\r\n\r\nThe exams are difficult as they are harder than what you learn from class, many questions are there to essentially test your experience with writing C and knowing things like Linux commands and the syntax of C will definitely help you in exams. \r\n\r\nOverall I think if you are able to go to lectures and discussions, and put maybe 1 to 2 hours a day both studying and doing the projects and you will be fine or at least pass.", "rating": 4, "expected_grade": "D+", "created": "2023-12-15T05:14:16.050678Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Lectures:\r\n1. He records and posts lectures on elms, most people don't come to class and watch those on 1.5x (lectures are pretty slow in person)\r\n2. The slides don't cover everything -- there's a lot of edge cases you need to know for the exams, and you will need to test these out yourself\r\n3. GO TO DISCUSSION -- you learn new things in discussion that you need to know. They are also recorded. I learned more in discussion than in lecture.\r\n\r\nExams:\r\n1. Some questions on the exams are very edge-case based, which is frustrating \r\n2. They are all extremely long -- you can't spend too much time on one question, or you will be short on time\r\n\r\nProjects/exercises:\r\n1. There will be exercises and projects. If you know the material and understand the layout, you will be fine.\r\n2. Go to office hours -- the TAs help a lot\r\n3. There weren't many projects at the start of the semester, but out last exercise was due after the last day of classes. \r\n\r\nThe course felt disorganized -- from the schedule for the projects to some of the discussion days, it felt like the professor was planning things a day before we heard about them. He is very passionate about C and you can tell that he likes teaching it -- he wants you to understand the material and answers questions fully, however I would not recommend taking this class with him.", "rating": 2, "expected_grade": "A", "created": "2023-12-21T01:44:02.868162Z"}, {"professor": "Ilchul Yoon", "course": "CMSC411", "review": "This may be the worst course I've taken at UMD. The material is artificially made 20x more confusing than it is (and it's already pretty confusing) by Dr. Yoon's disorganized, scattered lecture style. I never knew how topics were connected or how they related to each other or how they fit into the bigger picture of the course. We were given maybe 1-2 examples of problems to solve for each topic (if that), but most of the exams were problem solving variations of topics we had not seen examples for. We were similarly expected to solve homeworks entirely on our own with no peer help, when we had never seen examples of those problems before in lecture or otherwise. And this would be fine if the problems were straightforward, but he usually throws in a little curveball that completely changes the entire approach to the question. \r\n\r\nAnd then, on top of all that, he teases us by saying the homework problems and exam problems will seem \"so simple\" when we see the solutions. It was infuriating every time. \r\n\r\nYou will likely pass the course if you take it, because he curves. But you will waste a whole 4xx level on material that was so poorly conveyed that you'll forget it all in a month. Avoid if you can.", "rating": 1, "expected_grade": "B+", "created": "2023-12-22T21:19:29.389678Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Ended the course with an A-.\r\nLectures & lectures slides in my opinion are top tier. I never went to any lectures but watched the recordings (he goes wayy too fast to keep up with the content live). Projects and exercises are doable, but extremely time intensive. Heard that Yoon's projects are better than Larry Herman's. Ended up submitting one project late. Discussions are basically mandatory to attend, you have a lab worksheet to do almost every lab. Yoon or one of the TA's responded within a day on two on Piazza, which was awesome. Midterms & Quiz, this is where Yoon is cut-throat. Midterm1 mean was 66%, Midterm2 66% FinalExam 58% Quiz1 75%. Note the median is probably a good bit higher, as the mean is affected by outliers. At the end of the semester the Median: 77 Upper Quartile: 85 Lower Quartile: 68. I was in the upper quartile and ended up with an A-. Based on my approximations the curve was more than 2.62% but less than 6.62%. \r\nReflection: I also don't like how toxic curve based classes can be as you are competing against your peers for that curve. Make a good group of friends to avoid this. But considering this is a weed out class, Yoon did a great job doing so while being fair. Would definetely retake Yoon over Herman. If Nelson's teaching it, he's probably the best though.", "rating": 5, "expected_grade": "A-", "created": "2023-12-24T15:33:53.564459Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "I think Yoon is more possible than a lot of the reviews seem to say, but it is still pretty rough overall. In short, I think the main thing you have to do in this class is invest a lot of time and DO NOT PROCRASTINATE. This goes for not only projects but just understanding what Yoon goes over in class. This is honestly a lot easier said than done, as Yoon's lectures are really hard to understand often. However, not making sure you understand the material will likely just force you to catch up during later lectures or projects, and in my experience just made the class much harder\r\n\r\nProjects and exercises are honestly (somewhat) fair but they take many, many hours (don't do them last minute). While yes, the MCQ for tests is kinda rough, I honestly think the free response isn't too bad given it's much easier to get partial credit; however, I think in order to FRQ you really need to get acquainted with your labs and the examples given in class. I often threw on many MCQ questions, but free response helped pad my grade. \r\n\r\nFinally, there are some point buffers that made the class (mildly) more bearable, mainly in the graded lab work that was introduced in the middle of the semester. I'm not sure if Yoon had this in previous semesters, but it gave a 15+% buffer of free points that really helped improve grades. \r\n\r\nI think this class overall isn't totally unfair if you can put a lot of time in (besides the test MCQs), but you really need to be prepared to spend hours upon hours each week.", "rating": 3, "expected_grade": "A", "created": "2023-12-25T04:26:45.511983Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "He is a great lecturer and he also records his lectures. I do agree that his exams could be on the more difficult side but he doesn't test on anything that he hasn't taught. It's just very detailed based on where a lot of the MC questions are specific. Besides this, I think Yoon is a great professor. He really does care for his students and answers your questions in depth. I would also utilize his office hours as he's extremely helpful.", "rating": 4, "expected_grade": "A", "created": "2023-12-30T02:29:32.521822Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "One of the worst cmsc professors ever. His practice exams and the format are not the same as the actual exam. He was not helpful to students who are concerned about their grade. He just demoralize you instead of saying you can do it. This happened to me when we just completed 1 month. I regret that I didn’t check his reviews before I registered for his class. For sure,  I wouldn’t take him.", "rating": 1, "expected_grade": "", "created": "2024-01-05T23:54:03.518359Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "He's a good teacher, and I enjoyed his lectures but some of the project deadlines were a bit tight and overlapping. You'll make a lot of silly mistakes on the test so make sure to be careful.", "rating": 3, "expected_grade": "B+", "created": "2024-01-14T20:57:40.251109Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "I've never had a more stressful experience. He is very knowledgeable. Curve was about 3% (89 was an A). The curve for a C was much more generous. If you average high seventies to 80 your chilling.", "rating": 2, "expected_grade": "A", "created": "2024-01-24T22:13:57.646874Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Greatest professor of all time. I really enjoy C and systems level programming thanks to this well organized and well taught class with fair exams and easy projects.", "rating": 5, "expected_grade": "C", "created": "2024-02-20T21:00:02.279668Z"}, {"professor": "Ilchul Yoon", "course": "CMSC216", "review": "Impossible to hate Yoon because he's too nice in person. Absolute monster with everything else tho. Asked the most obscure, in-depth questions about some inbuilt functions on the first exam. He will make you good at finding edge cases because apparently that is all he tests on the exam. Only reason anybody takes him is because there's no other option. \r\nIt could have been a lot easier if the course was better timed and the projects were released a decent amount of time before exams for practice.\r\nEven the practice exams were mostly from Nelson's previous exams which were way easier than Yoon's.\r\n\r\nIf you are stuck with him, all the best and godspeed.", "rating": 1, "expected_grade": "A", "created": "2024-02-20T21:01:52.873501Z"}, {"professor": "Ilchul Yoon", "course": "CMSC132", "review": "Asked the most obscure, in-depth questions about some inbuilt functions on the first exam.", "rating": 1, "expected_grade": "B", "created": "2024-03-01T15:39:23.578488Z"}], "name": "Ilchul Yoon", "slug": "yoon_ilchul"}