{"courses": ["WMST250", "WMST400", "LGBT200", "WGSS488C", "WMST618", "WGSS319U", "WGSS428D", "LGBT200", "WGSS368", "WGSS378", "LGBT200", "WGSS200", "WGSS250", "WGSS250", "WGSS368", "WGSS378", "WGSS428D", "WGSS487", "WGSS290", "WGSS250", "WGSS487", "WGSS378", "WGSS250", "WGSS487", "WGSS250", "WGSS301", "WGSS487", "WGSS488D"], "average_rating": 4.7143, "type": "professor", "reviews": [{"professor": "Jaime Madden", "course": "LGBT200", "review": "LGBT 200 had a lot of writing assignments, such as two \"Daily Question\" assignments due a week, where we had to reflect on the assigned reading material of that day. There were also 3 essays assigned throughout the semester that needed to be a minimum of 3 pages; along with a few other projects.\r\n\r\nOverall, if you don't mind writing frequently, this class will be a piece of cake and an easy A. Sometimes weekly writing assignments, such as the \"Daily Questions,\" can be annoying and an inconvenience, but they aren't necessarily difficult to complete. Also, Dr. Madden was sweet and answered emails quickly. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-21T19:38:57Z"}, {"professor": "Jaime Madden", "course": "LGBT200", "review": "Dr. Madden is probably the most professional professor I have worked with. \r\n-I have taken classes with \"organized\" professors before, but Dr. Madden has installed her own home page into the ELMS ticker with working links and shortcuts to assignments. \r\n-She features guest speakers and encourages ways you can get involved and attend historical events around the university\r\n-This is an intro class, with a lot of different backgrounds, so she has the somber job of introducing people to their first exposure to some pieces of writing/media about hard-core discrimination, and pieces with radical voices. She'll ask you to reflect on these, but she handles everything with seriousness and respect. \r\n-Dr. Madden handles class emergencies very well\r\n-Her teaching style is engaging, and her assignments are not too demanding.\r\n\r\nIdk, I couldn't really ask more from a class and with a lot of experience taking STEM classes here, this class was a gem. ", "rating": 5, "expected_grade": "", "created": "2022-03-11T02:39:37Z"}, {"professor": "Jaime Madden", "course": "LGBT200", "review": "Dr. Madden is an incredibly respectful and kind professor. Very careful and deliberate with her words and instruction, she makes sure to create an environment that is accepting of everyone and acknowledges everyone's experiences. She encourages class discussion and invites students to voice their opinions and experiences to contribute to the discussion, while guiding the overall progression of the class. She is very methodical and organized in her instruction, and is one of the most structured professors I've had. There are frequent daily questions, which are not too bad to complete (about a paragraph each). I found that she is a very lenient and easy grader, and accommodates situations as they arise. The class is not too demanding or difficult, but does require frequent readings (for those that may be unaccustomed to that). There are frequent videos and films that are also assigned, which helps add variety. There was a class emergency at one point, and she engaged and handled the incident expertly and with a profound kindness. Overall, she is incredibly thoughtful and a great professor to teach this intro class. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-19T16:55:02Z"}, {"professor": "Jaime Madden", "course": "LGBT200", "review": "Professor Madden was one of the best instructors I've had. I took LGBT200 as an gened requirement and pretty much hope all of my geneds are structured like her class was. She's very sweet and organized. There's small assignments due before each class and a few essays as well but they were not too hard. She does keep track of attendance. Discussion is a big part of class but I really enjoyed how that went. There's a good amount of reading involved for the assignments. Overall I really liked her class and would definitely take another class of hers again.", "rating": 5, "expected_grade": "A", "created": "2022-11-10T20:43:31.723434Z"}, {"professor": "Jaime Madden", "course": null, "review": "Sweet, respectful and kind! Dr. Madden makes me feel very seen and understood in her class. She offers many opportunities for participation credit that do not involve speaking in class, which is good for if you are a shy student. However, even though I am a rather shy student myself, Dr. Madden's class is the only class I feel fully comfortable participating in during discussions. She really ensures that her classroom is a safe space and makes sure that students are understanding the material. It is easy to keep up with the work and get a good grade as long as you are trying, and Dr. Madden is a lenient grader. She is also very very organized, which is SO helpful for someone like me who always gets overwhelmed at big Canvas pages. Her Canvas Pages are always organizes into separate weeks so you know exactly what you need to focus on. Would love to take more classes with her.", "rating": 5, "expected_grade": "A", "created": "2022-12-08T23:28:22.545374Z"}, {"professor": "Jaime Madden", "course": "LGBT200", "review": "Professor Madden was very nice and understanding. You can tell she knows what she is talking about and is passionate about it. The only criticism i have is that she only had one grade in even as late as finals week. The assignments are all fairly easy, but no feedback is provided promptly. Attendance is pretty crucial as well because participation is 200 points. Still a good class to take but not if you need immediate feed back and grading.", "rating": 3, "expected_grade": "", "created": "2023-05-18T17:06:31.930065Z"}, {"professor": "Jaime Madden", "course": "WGSS250", "review": "Professor Madden is a good professor overall. Her classes are quite interesting and engaging. The course assignments involve a diverse range of activities (short written responses every week, 3 essays, 2 groups assignments, and a gallery visit), but she explains them thoroughly, ensuring students understand the expectations and requirements. She is responsive to studen's requests and feedback, so don't hesitate to reach out with any questions. It's worth noting that she adheres strictly to due dates and deadlines. Overall, I would recommend her to fulfill the DSHU gen-ed credit.", "rating": 5, "expected_grade": "A-", "created": "2024-01-11T14:58:56.722879Z"}], "name": "Jaime Madden", "slug": "madden_jaime"}