{"courses": ["HLTH775", "HLTH774", "HLTH140", "HLTH391", "HLTH140H", "HLTH391H", "HLTH688", "HLTH898", "SPHL610", "SPHL399", "HLTH140", "HLTH391", "HLTH391H", "HLTH609", "SPHL399", "HLTH140", "HLTH140H", "HLTH391", "HLTH391", "HLTH391H", "SPHL399", "SPHL610", "HLTH140", "HLTH688", "HLTH898", "HLTH140", "HLTH140", "HLTH140H", "HLTH140", "HLTH140", "HLTH140H", "HLTH391", "HLTH391H", "HLTH140", "HLTH140H", "HLTH391", "HLTH391H", "HLTH140", "HLTH140H", "HLTH391", "HLTH391H"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "James Butler", "course": "HLTH140", "review": "The most amazing professor I've had. Super chill and easy.", "rating": 5, "expected_grade": "A+", "created": "2020-08-09T00:25:49Z"}, {"professor": "James Butler", "course": "HLTH391", "review": "Dr.Butler is truly one of the best professors I have ever had. He is very considerate about the circumstances in this pandemic & cares about all of his students", "rating": 5, "expected_grade": "", "created": "2020-12-08T17:43:53Z"}, {"professor": "James Butler", "course": "HLTH140", "review": "Great professor, very interesting class. Easy work and tests are not hard. One of my favorite classes, and I felt like I learned things I could use throughout life. Definitely take his class.", "rating": 5, "expected_grade": "A", "created": "2022-04-28T00:46:22Z"}, {"professor": "James Butler", "course": "HLTH140", "review": "Professor Butler is wonderful! His lectures are informative, and he often includes real examples from his own life and career as a public health professional. The one downside is that he talks very quickly during lectures, making it difficult to take notes. Professor Butler posts his slides but leaves out information in an effort to make students come to lecture. \r\n\r\n HLTH140 is a great intro course to take if you're interested in healthcare. The assignments are easy, mostly 1-2 page reflection papers. You don't need to buy the textbook for this class; I never used it once. Take notes and you'll do well on the exams (which are all multiple choice)!", "rating": 5, "expected_grade": "A-", "created": "2022-08-05T21:33:14Z"}, {"professor": "James Butler", "course": "HLTH140", "review": "Dr. Butler is the best professor I have had at UMD so far! He is so nice and helpful. He really wants his students to do well so his quizzes and exams are extremely straight forward. If you go to class you will get an A+. He does sometimes randomly do discussions grades so you have to be in class, but as long as you go every week then you are almost guaranteed an A.", "rating": 5, "expected_grade": "A+", "created": "2022-11-30T19:33:57.912800Z"}, {"professor": "James Butler", "course": "HLTH140", "review": "Dr. Butler is the absolute best!!! He is the reason I switched my major to community health. Super kind and caring. Go to his office hours and don't miss a lecture.", "rating": 5, "expected_grade": "A+", "created": "2022-12-17T19:00:21.966915Z"}, {"professor": "James Butler", "course": "HLTH140", "review": "Dr. Butler is an absolute beast! He is the nicest guy and one of the best professors I have had here at maryland. I love him. The class is very straightforward. There are 3 tests which are online and open note and as long as you show up to every class and write down the notes from the board you should be fine. I loved this class and love Dr. Butler. Take this class if you can!", "rating": 5, "expected_grade": "A+", "created": "2023-01-05T20:41:51.389674Z"}, {"professor": "James Butler", "course": "HLTH140", "review": "Professor Butler is extremely nice and easygoing and is willing to help you in any capacity, whether it be class related or personal. I think he's super engaging and the lectures are enjoyable. The class is super easy, consisting of 3 exams that are open-note with questions that come directly from the notes. There is a service-learning experience at the end of the semester and a corresponding reflection, but it's pretty easy. There are also surprise attendance checks in the form of case studies, so just make sure to come to class and you'll be fine.", "rating": 5, "expected_grade": "A+", "created": "2023-05-01T22:06:40.300499Z"}, {"professor": "James Butler", "course": "HLTH140", "review": "Dr. Butler was great. His lectures were interesting (must note there are some lectures you need to attend for in \"class activities\"). The class consisted on 3 exams which is all open note, so it was fairly easy. He posts the class slides online so it's helpful if you cannot attend a lecture. The TAs I had were very helpful too.", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T02:23:32.373242Z"}, {"professor": "James Butler", "course": "HLTH140", "review": "This class is one of the easiest I've ever taken here. Dr. Butler is a really nice guy, and he always has some interesting stories to tell during his lectures too. This class is basically your high school health class but if you took it in college. Only assignments are open note quizzes, 3 exams, 1 service learning project (which if you just show up to the assigned date and participate, you get full credit), a reflection paper (also extremely easy) and like 5-6 \"case study\" assignments which is basically just a sign in sheet that they hand out at random during the semester. If you're looking for an easy 3 credit filler class, this is the one to take.", "rating": 5, "expected_grade": "A+", "created": "2023-11-15T23:19:54.491003Z"}, {"professor": "James Butler", "course": "HLTH140", "review": "I personally found lectures boring. But I rate teachers based on how good they actually teach or how easy it is to get an A in there class.  The assignments are all easy, the quizzez, the exams, the writing assignments(there were 3 total and were short).\r\n\r\nFor the fall 2023 semester we had six big grades which basically were you had to come to class and sign in the sheet. Missing those would hurt your grade alot. Recommend if you don't come to class you have a friend who can help you out.", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T07:18:15.830939Z"}], "name": "James Butler", "slug": "butler_james"}