{"courses": ["AAST200", "AAST398F", "AAST498T", "AAST498V", "AAST443", "AMST328L", "AMST298C", "AMST498J", "GVPT368C", "AMST629N", "AMST450", "AMST290", "AAST310", "AMST310", "AAST443", "AMST498J", "GVPT368C", "AAST378", "AAST388", "HNUH238B", "AAST378", "AAST388", "AAST443", "GVPT368C", "HNUH238B", "AAST201", "AAST351", "AAST498W", "AAST378", "AAST388", "HNUH238B", "AAST378", "AAST388", "HNUH238B", "AAST378", "AAST388", "AAST443", "AMST498J", "GVPT368C"], "average_rating": 4.75, "type": "professor", "reviews": [{"professor": "Janelle Wong", "course": "AAST443", "review": "Very nice professor. Assignments are easy.", "rating": 5, "expected_grade": "A", "created": "2019-04-06T15:54:54Z"}, {"professor": "Janelle Wong", "course": "AMST290", "review": "Prof Wong was the best! She really changed the format of the class for online and it made it really informative while only having a few big assignments. There were no tests or papers just one assignment a week. If you are looking for an easy gen ed with a great teacher and interesting information take this class for sure!! Your TA grades most of the papers and my ta was super cool and always willing to meet and talk about grades.", "rating": 5, "expected_grade": "A", "created": "2021-05-05T14:15:42Z"}, {"professor": "Janelle Wong", "course": "HNUH238B", "review": "Professor Wong is a great teacher. She's very nice, enthusiastic, and understanding and she's willing to give you an extension if you need it.\r\nFor homework, she assigns readings on Perusall, which if you haven't used Perusall, it tracks how long you've spent reading the assignments, and you highlight text in the readings to make comments. Sometimes the readings may seem like a lot but you don't actually have to read all of it -- as long as you've read most of it and submitted three comments/annotations, she will give you credit. They are pretty manageable, and very informative. Her powerpoints she presents in class for her lessons are understandable and helpful.", "rating": 5, "expected_grade": "", "created": "2023-11-21T06:25:47.212748Z"}, {"professor": "Janelle Wong", "course": "HNUH238B", "review": "One of my favorite professors. Very nice and super knowledgeable, would highly reccomend.", "rating": 5, "expected_grade": "A", "created": "2023-11-28T18:56:00.409222Z"}, {"professor": "Janelle Wong", "course": "HNUH238B", "review": "Easy honors class. Only homework is readinsg on perusall. Occasionally have some assignments but they arent to hard", "rating": 4, "expected_grade": "A", "created": "2023-12-01T21:58:11.524703Z"}, {"professor": "Janelle Wong", "course": "HNUH238B", "review": "Very sweet professor and easy honors class. The only assignments are Perusall readings, which are kind of annoying but manageable. Professor Wong is really engaging and truly taught me a lot.", "rating": 4, "expected_grade": "A+", "created": "2023-12-06T14:50:04.728439Z"}, {"professor": "Janelle Wong", "course": "HNUH238B", "review": "She is very nice and teaches the class the way it should be taught. She gives Perusall reading assignments twice a week but other than that there is little to no work. Overall, it's a pretty easy class and very interesting. Whether you're taking it for gen eds, honors credit, or just because you are interested, I would recommend.", "rating": 5, "expected_grade": "A", "created": "2023-12-10T19:21:35.897894Z"}, {"professor": "Janelle Wong", "course": "HNUH238B", "review": "Professor Wong is truly an exceptional professor that is passionate about what she teaches and cares for her students. HNUH238B was an easy yet  engaging class because of her, and the things I learned changed my worldview. She's very receptive to student feedback and will help you with whatever you need in her class, so long as you just ask. Her classes were mostly lecture-based, and the assignments were either short writing projects or Perusall. Perusall is a bit of a pain to deal with for commenting, but it was only due twice a week and was very manageable.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T15:58:54.485235Z"}], "name": "Janelle Wong", "slug": "wong_janelle"}