{"courses": ["KNES451", "KNES457", "KNES152N", "KNES152O", "KNES497", "KNES246", "KNES350", "KNES350H", "KNES457", "KNES497", "SPHL399", "KNES350", "KNES350H", "KNES457", "KNES497", "KNES246", "KNES457", "SPHL399", "KNES498G", "KNES350", "KNES350H", "KNES457", "KNES497", "KNES498G", "KNES246", "KNES457", "KNES350", "KNES457", "KNES498G"], "average_rating": 2.3333, "type": "professor", "reviews": [{"professor": "Jay Goldstein", "course": "KNES246", "review": "Contrary to popular belief, KNES246 is NOT an easy \"A,\" nor is it an easy class. The description of the class that you will see on Testudo is not at all reflective of the course itself. While I think that Prof. Goldstein is a very nice person with positive intentions, he assigns way too much work for a class that should be easy. On paper, the class looks like a lot of fun, and it could be — you go to the gymnasium and demonstrate skills to practice coaching sometimes and participate in some fun activities about sports. But in reality, you'll find yourself waking up for an 8 a.m. class three times a week so that you can do a lot of annoying busy work and an extraordinary amount of homework — plenty of which are online modules that you have to pay for. ", "rating": 3, "expected_grade": "", "created": "2020-06-01T20:14:20Z"}, {"professor": "Jay Goldstein", "course": "KNES457", "review": "Thought this would be a fun and easy-ish class. It wasn't. Professor is nice, but grades VERY harshly on EVERYTHING. I have never gotten bad grades consistently on group assignments and in this class, I have gotten 3 D's in a row on different assignments which is super upsetting and shocking to me. Other groups have talked about how low their grades were too. One assignment was literally worth 5 points and he gave a 1/5 to almost every group. This class went from fun to dreadful very quick. Reconsider taking it with him, or taking it at all. ", "rating": 2, "expected_grade": "", "created": "2021-11-08T21:11:27Z"}, {"professor": "Jay Goldstein", "course": "KNES350", "review": "From what I've heard KNES350 is suppose to be an easy A, however I would not recommend this professor and take the other professor (forgot the name), he grades harshly on everything, makes the class a lot harder with so many weekly busy work assignments. Makes the final exam a competition and the final barely boosts your grade at the end if your boarderline. Honestly his voice is really annoying too. I never felt the need to go to class b/c it was a waste of my time. We had a lot of group work and somehow we put our full effort and somehow barely get a B. Don't take this professor I hated him! Save yourself from the effort and time.", "rating": 1, "expected_grade": "B+", "created": "2022-12-13T06:40:33.966940Z"}, {"professor": "Jay Goldstein", "course": "KNES350", "review": "Dr. Jay is an ok professor, but the way he organizes the class makes the class itself suck. Dr. Jay is easy to contact, understanding, and helpful as a professor. The reason why I am rating this class poorly is solely based on the way he teaches. The classroom style is flipped, so you won't have any lectures during class, but rather you watch pre-recorded videos and take quizzes online. Class itself is comprised of group work and group quizzes. So a major flaw to this class is that if you get a bad group, you either have to do lots of work on top of your individual assignments, or have your grades suffer. The workload can be alot, depending on how much effort you put into the online portion. If you want to learn sports psychology and are willing to put an unproportional amount of work, this class is for you. If you want an easy A or relax, this class is not for you.", "rating": 2, "expected_grade": "A-", "created": "2022-12-23T00:26:27.484782Z"}, {"professor": "Jay Goldstein", "course": "KNES350", "review": "I loved Dr. Goldstein! I took him in Fall 2022 and had a great experience. The entire class is group work besides the weekly online quizzes. The classroom is flipped so in class, you do the group assignments and at home you watch lectures. I found the class to be extremely straightforward and easy to follow. If your group wins in your league, you do not have to take the final which is great. It all comes down to your group (they are randomized), so if you get a bad group or even one bad person in the group, LET HIM KNOW! He is very understanding and will work with you so you can succeed. 10/10 recommend.", "rating": 5, "expected_grade": "A-", "created": "2023-03-27T18:52:52.917843Z"}, {"professor": "Jay Goldstein", "course": "KNES246", "review": "I thought this was going to be an east gen ed but it was the opposite. there us so much work for this class and he grades very harshly. I also did not have a great experience with him as one of the only girls in the class and he made that known and singled me out for a lot of things (saying I do not know anything about sports) which is very ridiculous. I do not recommend this class what so ever and honestly would avoid taking him for any class.", "rating": 1, "expected_grade": "B+", "created": "2023-05-09T15:16:50.903886Z"}], "name": "Jay Goldstein", "slug": "goldstein_jay"}