{"courses": ["AAST200", "AAST355", "AAST498G", "AMST328W", "AAST200", "AAST298G", "AAST388", "AAST498G", "AMST298C", "AAST355", "AAST200", "AAST355", "AAST388", "AAST498G", "AMST328W", "AAST233", "AAST298G", "AAST388", "AAST498G", "ENGL233", "WGSS498I", "AAST200", "AAST355", "AAST388", "AAST422", "AMST298C", "AMST328W", "WGSS498I"], "average_rating": 4.75, "type": "professor", "reviews": [{"professor": "Jennifer Cho", "course": "AAST498G", "review": "Reviewing Dr. Cho before Spring schedules get picked to convince people to take her!\r\n\r\nShe's an great professor as she cares a lot about her students and doesn't expect too much out of us when reading difficult texts. The class format includes Perusall readings (1-2 readings, three comments per reading) every Tuesday and Thursday, one group project on a class-related topic (seems easily doable but I haven't done mine yet), a reflection paper (for credit grade), a critical response paper, and a contribution to a class zine (honestly looks really fun). Our class time consists of small group discussions and just class discussions about the readings. Our assignments are paced well throughout the course and I don't feel overwhelmed with the readings. However, please only take this class if you're willing to talk in class. People barely talk in our class and in a group of 20 students, it gets awkward and just becomes a waste of our time. Dr. Cho definitely encourages any conversation.\r\n\r\nThe only complaints about Dr. Cho's teaching I have is that sometimes I feel like her questions about the reading are harder to answer/don't really lead to a discussion. I also have a harder time understanding the readings sometimes so with more sophisticated questions, it's harder to feel confident in an answer. I also wish we covered more current events? I understand this class has to include theory and history, but I really enjoyed our recent readings on MRAsians. Overall, I am happy taking this class!", "rating": 4, "expected_grade": "A", "created": "2023-10-10T19:25:54.748343Z"}, {"professor": "Jennifer Cho", "course": "AAST200", "review": "absolutely love dr.cho! you can def tell she's passionate about what she teaches and really wants to get to know her students. it sometimes gets awkward in class when she asks questions and no one answers so def only take the class if you don't mind speaking up from time to time. format of the class is assigned readings and then she lectures on them and has videos/other readings to support. def read before coming to class and take good notes on the readings. class has no final just a final project which is straightforward. she has reading check ins spread out hence why I say take good notes on the readings because they are open note. a lot of extra credit opportunities (currently have over 100% rn). a big project is a group presentation on one of the chapters you need to read which are spread out over the semester but very easy to do. \r\n\r\noverall i love her and the class, it's something i am passionate about. def recommend taking her and speaking up in class as it makes her happy and doesn't make the class dry.", "rating": 5, "expected_grade": "A+", "created": "2023-11-17T15:45:52.627086Z"}, {"professor": "Jennifer Cho", "course": "AAST200", "review": "Fantastic professor, extremely passionate and receptive to student concerns/interests. The course covers a variety of relevant topics to the Asian American community from history to contemporary issues. I personally have learned so much from this class and the course structure does not burden a STEM heavy schedule. Attending class and participating in class is important but activities are engaging and not tedious. Please be willing to speak up in class if you take it! As someone else mentioned the class is only impactful if you can connect it into your own life.", "rating": 5, "expected_grade": "A", "created": "2023-12-06T04:08:01.837429Z"}, {"professor": "Jennifer Cho", "course": "AAST298G", "review": "THE FUCKING GOAT!!!!!!! Amazing professor, cares a lot about her students. She's not a difficult professor and cares about learning more than grades! Would definitely recommend taking her and her courses, but please speak up in class!! This course was super super fun as a food enjoyer. If you enjoy yapping, there are weekly blog posts in this class where you can yap about literally anything related to the class- not just what we're learning at the moment. The class is not difficult and burdening. Classes are really fun and enjoyable to go to. I actually woke up to come.", "rating": 5, "expected_grade": "A+", "created": "2024-03-04T20:43:33.535844Z"}], "name": "Jennifer Cho", "slug": "cho_jennifer"}