{"courses": ["WMST250", "WMST298D", "WMST428J", "AASP498J", "WMST300", "SPHL601", "SPHL602", "SPHL603", "AASP498G", "WMST319D", "WMST368", "WGSS290", "WGSS319D", "WGSS368", "ARHU230", "WGSS230", "WGSS290", "WGSS290", "WGSS319D", "WGSS368", "ARHU230", "WGSS230", "WGSS290", "WGSS378", "LGBT200", "WGSS290", "WGSS368", "WGSS378", "WGSS280", "WGSS290", "WGSS319D", "WGSS290", "WGSS319D"], "average_rating": 4.4, "type": "professor", "reviews": [{"professor": "Jessica Mathiason", "course": "WGSS290", "review": "Loved this class and really recommend Dr. Mathiason. She's really great at teaching the material and the in-class discussion was really interesting and engaging. For WGSS290, all three exams were online and had no time limit. The rest of the grades for the class were essays, the group project, debate, and class participation. There were daily readings which were pretty hefty (like 15-30 pages), and the assignments definitely required effort. \r\n\r\nIf you find the class description interesting, take the class, you will not regret it. If not, imo it's a lot more work for just 3 credits and the gened. ", "rating": 5, "expected_grade": "A", "created": "2021-12-25T21:06:39Z"}, {"professor": "Jessica Mathiason", "course": "WGSS290", "review": "She grades really harshly and doesn't follow any kind of course material. Very passionate about the material so you can offend her/class easily. It can be a lot of work because you find the topic to do the projects on. The readings are long and difficult to understand but not necessary to participate in the discussion. The class participation can be a little unfair so don't skip the class. ", "rating": 3, "expected_grade": "", "created": "2022-04-26T19:38:36Z"}, {"professor": "Jessica Mathiason", "course": "WGSS290", "review": "Dr. Mathiason is an excellent professor with a passion for the material that she teaches. This course is discussion-based, and includes a lot of interesting material that can help you to challenge your perceptions of the world. The work is easy if you pay attention, though. One thing to keep in mind is that the reading can be a little difficult and verbose if you're not used to certain topics in philosophy, as much of the assignments rely on applying Foucault in some way.", "rating": 5, "expected_grade": "A", "created": "2022-06-14T20:06:58Z"}, {"professor": "Jessica Mathiason", "course": "WGSS319D", "review": "Dr. Mathiason’s class was easily my favorite this semester. It was discussion based and the readings could be dense sometimes, but as long as you participate, you will do great.", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T02:14:40.452693Z"}, {"professor": "Jessica Mathiason", "course": "WGSS290", "review": "great course all that, dr. grades way too harsh for most students who are NOT WGSS majors, has usually no rubric so point breakdowns are completely up to her discretion as she grades, and very few assignments that make up your grade. worthwhile course though for a gen-ed that counts for 3 categories", "rating": 3, "expected_grade": "A-", "created": "2023-05-11T19:41:03.187441Z"}, {"professor": "Jessica Mathiason", "course": "WGSS290", "review": "The class itself is pretty easy but she grades really harsh so it is not an easy A. The content was really interesting and I learned a lot. This class is very liberal. Make sure to skim over the readings before class so you have something to talk about when you participate. Aim to participate at least once every class. START ON THE GROUP PROJECTS EARLY. She gives you only like two weeks to finish em so just get it out of the way. Follow the directions on the quiz. Use a google doc to take notes so you can easily ctrl-f during a quiz. The work load is pretty low. She gives lots of feedback on your work. She's a nice person and easy to talk to. I went to her to talk about personal stuff.", "rating": 3, "expected_grade": "B+", "created": "2023-05-15T00:40:44.311656Z"}, {"professor": "Jessica Mathiason", "course": "ARHU230", "review": "The class is split into 3 parts: traditional medical cultures and history, bioethics, and contemporary cultures and frameworks. Readings are dense but you should read them because she asks questions about them during class. Projects are fairly straightforward and flexible, should be easy to get a good grade if you write well. Honestly the defining course of the health, humanities, and medicine minor, highly recommend Prof Mathiason for this!", "rating": 5, "expected_grade": "", "created": "2023-06-14T00:53:11.490072Z"}, {"professor": "Jessica Mathiason", "course": "LGBT200", "review": "Great course and love Dr. Mathiason! I learned more in this class than I did in any other class. It was very engaging and I would recommend taking it if you're interested in this subject and need an easy gened.", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T16:05:39.681156Z"}, {"professor": "Jessica Mathiason", "course": "WGSS290", "review": "Dr. Mathiason is a very enjoyable professor and person in general. The material is very relevant, and she does a great job portraying other perspectives and challenging closed mindsets! The main assignments consist of three quizzes, an essay for the midterm, and a couple of group projects. Alongside weekly readings, this workload is very manageable. She provides helpful feedback on all assignments and is very open about her expectations for each assignment. Do not be afraid to participate or ask for clarification, as she definitely cares about her students and the material she teaches!", "rating": 5, "expected_grade": "A", "created": "2023-12-13T15:51:18.547255Z"}, {"professor": "Jessica Mathiason", "course": "WGSS290", "review": "I learned so so much in this class! I had no idea what this class was about and signed up for it last minute because it had many geneds. It was super eye opening and everyone in my class was so passionate about the topic which really kept me interested. Highly highly recommend. Lots of great discussions and important topics. Dr. Mathiason is a great professor with a lot of knowledge and opinions on the topic.\r\n\r\nPros: 3 Open note, untimed quizzes (a few short answer and a short essay), posted slides (no need to take notes), attendance isn't mandatory, small class so discussion based, Dr. Mathiason is very approachable and passionate(she learned everyone's names which was really sweet), there are some extra credit opportunities, most people in my class got A's or B's i believe\r\n\r\nCons: Very long readings (I'm talking 30 pages per class :/) the readings aren't super necessary, but they help you participate and are pretty interesting usually, the projects/paper give you a lot of freedom which can be good or bad, grading on the paper was a little tough, group project and debate were pretty difficult for me, some topics may be triggering for some people??\r\n\r\nAdvice: Listen and participate when you can! Start thinking of ideas for the group project early. This is definitely not an easy class even though there are not many assignments. You can ask for an extension also. Great for 3 GenEds!!!", "rating": 5, "expected_grade": "A", "created": "2023-12-16T21:57:50.231402Z"}], "name": "Jessica Mathiason", "slug": "mathiason"}