{"courses": ["ARHU318B", "ARHU319", "ENGL101", "ENGL272", "ENGL101S", "ENGL101A", "ARHU318C", "ENGL101H", "ENGL391", "ENGL398R", "ENGL398V", "ENGL393", "ARHU275", "ENGL275", "ENGL398R", "ENGL398V", "ARHU275", "ENGL275", "ENGL398V", "ENGL391", "ENGL398V", "CMLT277", "ENGL398V"], "average_rating": 4.2, "type": "professor", "reviews": [{"professor": "Jesse Brooks", "course": "ENGL101A", "review": "He did not like students using laptops in class, even though our syllabus mentioned us being allowed to use them in the first place. \r\n\r\nIt’s a good idea to come to class and participate, if you don’t show up having read whatever he’s assigned then you may have a difficult time in class. \r\n\r\nHe’s not a bad person, in fact he’s a good guy deep down, although there are times where he may come off as arrogant.\r\n\r\nThe class itself was structured around discussions of what was assigned prior, if you come prepared then you’ll have an easy time. Brooks is a super liberal person and teaches that way, which helps bring the content of the class to relevant news of our current issues. ", "rating": 3, "expected_grade": "A-", "created": "2017-12-14T04:50:54Z"}, {"professor": "Jesse Brooks", "course": "ENGL398V", "review": "I took this class in Fall 2021\r\n\r\nPros:\r\n+ Class is mostly pretty chill when an essay isn't immediately due. Classes mostly consist of discussing readings, but since there are no grades that rely on having you read the readings you don't really have to do the readings.\r\n+ Prof, all in all, is pretty chill. Even if you miss assignments, just talk to him and you can normally reach an arrangement\r\n+ Also I guess he's changed a lot from December 2017, he allowed us to have laptops in class\r\n\r\nCons:\r\n- Essays are very anecdote-based, if you're used to writing research papers, get ready for some whiplash", "rating": 5, "expected_grade": "A", "created": "2021-12-24T19:03:25Z"}, {"professor": "Jesse Brooks", "course": "ENGL398V", "review": "I loved him! I feel like my writing improved so much in this course, he focuses on straying from regular cut-and-dry rubrics (which was hard for me), but really helps with writing and expressing ideas/communicating in general. Really loved the content of this course, if you're looking for a professional writing course to take, I'd highly recommend 398V (especially with Jesse). Great course and great professor! Never talks down the class and really tries to relate and build connections with everyone (not in a cheesy way). ", "rating": 5, "expected_grade": "A", "created": "2022-02-14T23:37:19Z"}, {"professor": "Jesse Brooks", "course": "ENGL393", "review": "Jesse is amazing. He's chill, calm, humorous, pleasant, and one of the coolest dudes I've seen. Not just a professor but someone you could legitimately have a good time hanging out with. I cannot recommend him more highly. He also grades VERY fairly, where if you meet the requirements you'll get s good grade. He grades your work objectively. \r\n\r\nOnly drawback was grading took a long time but I can't fault him since he has many classes he's teaching at once.", "rating": 5, "expected_grade": "A", "created": "2023-05-05T12:13:54.812836Z"}, {"professor": "Jesse Brooks", "course": "ENGL398V", "review": "He's a nice guy and all, and I'm sure his creative writing classes are great, but specifically for this class (ENGL398V) I am extremely disappointed in what he teaches us. This was advertised as a professional writing class, writing about the environment, but we aren't really doing any writing to prepare us for respective professional fields, unless you're maybe doing journalism or advocacy work where creative writing comes in handy. You can tell he really doesn't want to be teaching this and only really has us do creative writing assignments, so if you want to get something out of this class that will help prepare you for writing in an actual career, this prof/class is definitely not what you want to be taking.", "rating": 3, "expected_grade": "", "created": "2023-12-06T05:50:39.033267Z"}], "name": "Jesse Brooks", "slug": "brooks_jesse"}