{"courses": ["ENGL393"], "average_rating": 1.0, "type": "professor", "reviews": [{"professor": "Joan Mooney", "course": "ENGL393", "review": "DO NOT TAKE HER. I cannot stress this enough. Drop english completely and take it next following semester if you have to. This women is insane. I received a B+ on an in-class writing assignment, where we had to write a set of instructions for people who have never used a shower before, because I did not write \"warning: shower may be slippery!\" She did not have an issue with anything else in my paper...that was her only comment.\n\r\nYou may be thinking \"oh pshh, I did well in AP English in high school, I'm not worried.\" I got As in AP english and a 780 on my SATs. This woman does not believe in giving out As. When asked what it takes to get an A, she will tell you that you need to go above and beyond what she puts in the rubrics. Too bad the rubrics are incredibly vague and very unhelpful. You can lose a letter grade for not including something that she never told you to include. \n\r\nIf you do end up taking her, whenever you go to office hours to ask for help, write down everything that she says. I once went in and she told me not to worry about the page length. I lost points on the final assignment because my page length was off. She forgets everything that she tells you.\n\r\nThe final semester project is not a group project in her class Albeit, it is a shorter project than you have to do in other classes...but it is just as much work. \n\r\nFOR THE LOVE OF GOD, DO NOT TAKE HER CLASS. She gives out way too much work and you will get lower grades than you deserve. ", "rating": 1, "expected_grade": "B", "created": "2013-05-13T17:52:00Z"}, {"professor": "Joan Mooney", "course": "ENGL393", "review": "\r\nAvoid this  instructor at all costs. She literally has NO teaching qualifications, and the major part of her career consists of writing articles for the auto industry.  There are many assignments, including 2 presentations, 3 memos, an individual final project, and lots of little assignments in between. Oh and you have to attend every class because she keeps track of attendance and participation (10% of you final grade).  Expect harsh grading, she will knock you a 1-2 letter grades down for \"poor formatting\" on an IN-CLASS writing assignment, despite having excellent content. Comments on returned assignments are not helpful, leading you to make the same mistakes again. Sometimes she just tells you to visit the writing center, instead of providing useful advice on how to improve your writing. \r\nAs you can see by her stats, Mooney believes that everyone should get a B, and doesn't explain how to get an A.  With no teaching ability whatsoever, she stands at the front of the class and informs you of upcoming assignments for 50 minutes. Once in a while, there is assigned reading, in-class writing assignments, or poorly explained grammar exercises. For some reason, she gives out a ton of paperwork in addition to posting assignments on elms. Towards the end of the semester, there are a LOT of due dates one after another, so it becomes very difficult to keep up with the work.  More than half of your grade is determined in the last ~4 weeks, with 3 drafts for your final project, an oral presentation and 2 memos.\r\nOverall, this class was way too much work. And I definitely have not improved my writing skills at all.", "rating": 1, "expected_grade": "B+", "created": "2012-05-22T22:22:00Z"}, {"professor": "Joan Mooney", "course": "ENGL393", "review": "Avoid this professor. You will be doing more work in this professional writing course than in the other ones for the same grade. This class has a lot of busywork.  It is very monotonous. Do yourself a favor and find another professor so that you can focus on the classes that actually matter.", "rating": 1, "expected_grade": "B", "created": "2022-05-02T21:58:44Z"}, {"professor": "Joan Mooney", "course": "ENGL393", "review": "I would not recommend taking this class if this is your instructor. You will be completing a lot of unnecessary work in a fast-paced manner and it is incredibly hard to keep up, especially during the last three weeks of class. In addition to the final project, you must complete multiple drafts beforehand that will significantly impact the grade you receive on the final project if the drafts are not completed in the way that she wants. The rubrics for these drafts are not very clear, and the only thing that really helped me were the examples that she provided of final drafts that were completed by previous students. Not to mention, she takes points off of assignments for absurd reasons even if you do follow exactly what is written in the incredibly vague rubrics that she provides, if you can even call it that. The lectures do not feel meaningful at all. You'll likely spend 50 minutes of your time listening to what assignments are due that week, which is something that is quite clearly stated on the syllabus. Please do yourself a favor and find another professor for this class, otherwise you will without a doubt be stressed in trying to keep up with the assignments while completing them in the manner that she wants. It is not worth it.", "rating": 1, "expected_grade": "B-", "created": "2022-12-12T01:30:55.515812Z"}], "name": "Joan Mooney", "slug": "mooney"}