{"courses": ["ECON201", "ECON330", "ECON601", "ECON709", "ECON808", "ECON698", "ECON201", "ECON709", "ECON201", "ECON601", "ECON709", "ECON709", "ECON698", "ECON698", "ECON201", "ECON601", "ECON709", "ECON709", "ECON201", "ECON601", "ECON709"], "average_rating": 4.1778, "type": "professor", "reviews": [{"professor": "John Shea", "course": "ECON201", "review": "If you have to take this class, take it with Shea! You can tell that he is very intellectual and really knows what he is talking about which is so important. His exams are straight from his lectures, which are full of information. It can be tough, but the best advice I can give is to audio record the lectures and listen to them later.\r\nWhat is the best about Professor Shea is that when it comes down to it, he's a really understanding guy. If you need extra assistance, he will do anything to help you. If you are sick or have something that interferes with deadlines for legitimate reason, he will be understanding completely. He also curves really well. Getting an A in this class is totally doable.", "rating": 5, "expected_grade": "", "created": "2014-12-17T15:12:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Overall, ECON201 is not such a boring topic. It's pretty interesting. But Shea takes a fairly good topic and makes it probably the most boring class you'll take at Maryland. \n\r\nThat's not to say he doesn't know what he's talking about. When you do find yourself paying attention, you'll see he knows his stuff. It's actually very impressive. However, the way he goes about presenting the information you need to know is abysmal and dry.\n\r\nHe really doesn't go by the textbook at all (I haven't opened it once all year and my final is next week.) Having said that, it means you have to go to class and take really good notes because the exams do come straight from what he writes down, which is a plus I guess. Although, none of the in-class notes are electronic (no powerpoints, nothing on ELMS besides practice exams or problem set answers), so when you inevitably tune him out, you're going to fall behind. He will only write on the chalkboard, which can be brutal when you can't read the handwriting/tune out for a few minutes and fall behind.\n\r\nAs for the class, he's solid as a grader, and this is why I gave him a 3 star rating. Two exams, a final, and problem sets. The problem sets are very easy to get full points on, which translates to 15% of your final grade. The exams, while they can be tough, are very similar to his old exams and are curved, which is really nice.\n\r\nIf you can bear to pay attention twice a week for an hour and fifteen minutes, it shouldn't be too bad and you can do very well. But that can be very, very difficult to do.", "rating": 3, "expected_grade": "A-", "created": "2014-12-08T19:06:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Great professor. Extremely intellectual, very obvious that he legitimately earned his graduate degree(s). Do not buy the book, he will write down everything you need to know in class on the board. This in mind, go to lecture since lecture notes are your only source of information (or at least get them from someone else). Must know not only main ideas and key points, but also details and specific facts. The economic history he goes over in class is not just for fun; he puts many questions on exams about it. The only way to succeed in this class is to read over your lecture notes and know them front to back because the exam questions are way too detail-oriented for a \"general concept\" understanding. If you have questions that your friends cannot answer, email him or go to office hours (don't do office hours the week before the exam, since his office is packed with people and he gets extremely peevish, like any normal person would). ", "rating": 5, "expected_grade": "A+", "created": "2012-09-23T00:12:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "DO NOT TAKE THIS PROFESSOR! ECON201 is not a terrible class but do not take it with Shea... take it with Sarna! He never ends the class on time and his tests are so hard. Class ends at 315 but on a good day youll get out at 316. He started teaching us the first day of class!!!! He sucks get Sarna!!!!!!!!!!!!!!!!!!!!!!!!!!!! ", "rating": 2, "expected_grade": "A", "created": "2012-05-17T23:49:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Overall opinion: that man knows his stuff by heart. I respect him for being able to lecture and write on the chalkboard for an hour and 15 min straight. (He will go until the very last minute, and sometimes will go over.)Be ready for solidly and furiously writing for the entire class.\n\r\nHe tends to be redundant in his lectures (A good thing, because he likes to emphasize important points). He goes over points in a somewhat logical manner  and tries to tie them in to current events. He'll even crack the occasional joke or two. \n\r\nTips to do really well:\r\n1) Sometimes his notes on the board aren't very organized. I would take the time to rewrite, or type (which I did) your notes. \r\n2) Do not simply memorize, but understand the logic behind it. He usually explains the logic verbally, so try to listen as you're writing. I was never a verbal learner, so I kind of found it difficult to follow him when he talked. *This is more important for the new material he teaches for the final.*\r\n3) Highlight/mark up important dates. There are always 2-3 questions on the exams that ask for those dates. It hurts if you miss those, since each exam is 30 questions. (Final is 40)\r\n4) Do all your homework. Don't be lazy. It's an easy 100% because it's graded for effort. And they help you study for the exams. He does drop the lowest score out of all of them.\r\n5)The format of his practice exams are very similar to the actual midterms. The questions aren't, because his lectures slightly differ from year to year. But it's a great study tool, because you can see what concepts are behind each question.\r\n6)Don't rely on the curve too much. But by god, I love the curves for this class. He does it by aiming for his target distribution of grades.\r\nNote: I don't think students can fail this class... unless they put in 0 effort. Effort will be rewarded accordingly. \n\r\nEasy to pull off a B, and an A is definitely not out of reach. If you have a curved/projected B after both midterms, do well on the final, and that A can be reached.\n", "rating": 4, "expected_grade": "A", "created": "2012-01-22T05:00:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Shea is by far one of the best professors I have had on campus. His lectures are very thorough and he is willing to go over any material a student is confused on whether it be in lecture or during his office hours. He also relates the material to today's economy so you have a better understanding of whats going on. His exams are difficult, but if you study for them you will be fine. My best suggestion is to learn the concepts and processes instead of just memorizing formulas. Shea designs his tests to make sure you know the entire process instead of just definitions. I'd also write down any dates he writes on the board because those show up on the exams. I managed to get a 29/30 on the first exam, a 26/30 on the second, a 34/40 on the final and a 15/15 on the problem sets (graded on completion). This totaled to a 90.58 which curved to an A+. I think the cut off for an A was an 81. This class is definitely easy to pass if you put the effort into it.  ", "rating": 5, "expected_grade": "A", "created": "2012-01-08T18:22:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "This class is pretty terrible. The material is very basic and not very challenging, however Shea cannot teach and/or explain macroeconomics for his life. He teaches to his students as if they already know the material/definitions and does not help them acquire a proper understanding. He applies a very broad advisory curve to the midterms and then does not necessarily follow through with this scale. Shea does nothing to help out his students. There is no reason for such a steep advisory curve in a basic economics class. Additionally, do not buy the book as it is very expensive and does not assist you in the course (you will use it) . Try to avoid ECON201 with Shea at all costs, as taking the course with any other professor would result in a better understanding of the topic. By the way, he let's you out of class 3 minutes late every lecture. Enjoy", "rating": 1, "expected_grade": "C+", "created": "2011-12-21T23:50:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Shea is one of the best lecturers at the University.  He does right a lot each lecture, but he is very thorough.  The textbook is not needed at all to get an A in the course. The course is also curved significantly.", "rating": 5, "expected_grade": "A", "created": "2011-12-16T19:58:00Z"}, {"professor": "John Shea", "course": "ECON330", "review": "This is one of the easier ECON classes, to me. Pro Shea is SO thorough (to the point of redundancy) in his notes, it is impossible not to do well if you just study what he rights. Also, he plans his lectures in a very linear way, so I personally think that it's easy to understand what he's talking about.\r\nThat being said, I took like 6+ pages of notes every class, which was 2.5 hours once a week. So he really goes HAM when it comes to writing on the board. If you miss one class, you are screwed. I mean, you can get the notes from other people, but you wont actually be there when he explains what he's writing.\n\r\nThe tests are heavily weighted but they are curved. I believe my 74 on the first exam was turned into a B+, so that was good. I haven't taken the final yet but I expect to get a B in this class because of his advisory curves.\n\r\nTo be honest, this class is easier to excel in than ECON200 or 201. The material is more about concepts than arithmetic, and only a portion of the class focused on those dreaded supply/demand curves. ", "rating": 5, "expected_grade": "B", "created": "2011-12-15T22:30:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "This class is not too bad if you go to class and take notes. It is really easy to get a B since he curves every exam. There is homework due once a week which is written. It is not too hard but you are graded for completion not correctness so thats a nice boost. Exams are very similar to the practice exams which he posts.", "rating": 4, "expected_grade": "B", "created": "2011-12-07T15:34:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Great Professor. Very knowledgeable, and explains concepts thoroughly. This is a challenging course, but completely worth it. Pay attention in lecture, study lecture notes, problem sets, and past exams and you'll be fine. You will learn a lot of valuable material because Professor Shea is the man.", "rating": 5, "expected_grade": "A", "created": "2011-12-02T18:46:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "This was a great professer.  Only a midterm and a final and 10 homework problem sets.they are easy  Exams were difficult.your grade was basically decided by 60 questions for the year.  Although i have learned more in this class than any other class at md.  He is a true professional", "rating": 5, "expected_grade": "B+", "created": "2010-10-20T10:22:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "This class is not fun. Shea starts his lecture and does not stop talking until the minute the class is over. He writes everything on the board, which is helpful. However, it is nearly impossible to follow what he is saying while scrambling to copy what he writes down. I wrote four to five pages of notes every lecture. You must attend class to get notes because he does not test you on what is in the book.\n\r\nThe problem sets helped a lot in the midterm and the final, so study those! However, I felt that he just gave us the problems and expected us to know how to do them (when it was clear that we did not.)\n\r\nThe midterm and the final are really, really hard exams. The best way to prepare for these is to go over your problem sets and the questions from his practice exams. Thankfully, there is a HUGE curve at the end. I ended with an 81% and got an A, so I'm happy. \n\r\nDon't buy the book - its unnecessary and a waste of money unless you know that you will not be able to come to a lot of classes. I really wouldn't advise skipping lectures because it is so easy to fall behind!\n", "rating": 3, "expected_grade": "A", "created": "2010-05-23T11:28:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "An amazing professor! I wasn't fond of Econ 200, but Professor Shea made this class very very enjoyable. He has a great sense of humor, writes very clear notes, and provides very good detailed explanations of key concepts during class, so you are never confused. It's unbelievable the amount of information I gained by the end. He is also very nice, and willing to help students out with any of their concerns throughout the semester. \n\r\nThe tests are tricky. They are all multiple choice, and about half the test consists of questions that are on the challenging side. However, the curve is pretty generous, so if you go to class, take good notes and pay attention to everything he says (memorizing the dates and Presidents is super important), and get a full grade on your homework, you have a very high chance of getting an A. When I took the class, a 79 got you an A. ", "rating": 5, "expected_grade": "A", "created": "2010-05-23T10:36:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "One of the best professor I've had! Shea's really adept at instilling the materials in his students. He stresses and rewords key points over and over again and breaks things down into digestible parts. I always come out of lecture fully understanding every single concept covered in lecture! \n\r\nNo need to buy the textbook. Study from his notes and sit in the front row, as the chalkboard could be hard to read from the back. \n\r\nThere're a dozen problem sets (we had 9, each comprises 3-6 problems. They're graded for effort.) In addition, there're two mid-terms and one final. Just remember to review the old mid-terms and finals and you'll be all set. \n\r\nBottom line: A great great professor! Just take good notes and try to follow closely in class, and you're almost guaranteed an A! ", "rating": 5, "expected_grade": "B+", "created": "2009-12-25T18:36:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "the stuff you learn in this class is actually applicable to real life. very good teacher, i definetly recommend shea if you have to take econ201, tests are tricky but really not that bad. literally memorizing ahttp://www.ourumd.com/books/ll of his notes is the key to an A.", "rating": 4, "expected_grade": "A", "created": "2009-06-15T16:56:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Prof Shea is extremely impressive. He can teach an entire lecture by looking at notes at most twice. Make sure you take notes because everything from the test comes from the notes, making it no need to buy the book. Granted this is basic macro and something hard to make interesting but he manages to make it less painful. Mixes in history that you must know for the tests. Tests are difficult but the curve works things out (~80% is an A).", "rating": 5, "expected_grade": "A", "created": "2009-06-02T01:33:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "This guy is one of the BEST professors at UMD.  I can honestly say he inspired me to really pursue economics, something I was only mildly interested in before having him as a professor. He explains things SO well in layman terms, covers the material in just the right amount of detail: in other words, not too detailed but not too general either.  He lectures purely from his head and writes everything on the board while speaking it, making the class and the information so easy to follow.  He is super organized, super clear, and it is apparent that he understands economics like the back of his hand.\n\r\nYou don't need to buy the textbook.  Just go to EVERY class (you CANNOT miss one), pay attention! (a lot of people would come to class and read the Diamondback or play computer games on their laptops), and actually THINK about what he's saying while you're writing it down (in other words, don't just mindlessly take notes).  \r\nShea makes the class really interesting by applying what we're learning to current events, and occasionaly he'll crack a surprisingly funny joke. I just hope that I get to take another econ class with him later on.  ", "rating": 5, "expected_grade": "", "created": "2009-05-27T18:23:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "In my opinion, ECON sucks. It's hard and it takes me awhile to understand concepts.\n\r\nBUT, I have to admit Shea made me understand better. In lectures, I actually understood what he was teaching. The class is based on notes so you have to go to lectures but you don't have to buy a textbook. \r\nShea's tests are hard so you should study. You should also complete the problem sets they will help your grade at the end of the semester.\r\nOverall hard class, but HUGE curve at the end. I definitely recommend Shea if you have the chance and need this requirement.  ", "rating": 5, "expected_grade": "A", "created": "2009-05-21T13:05:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Shea is an awesome teacher.  He could go a whole lecture without looking at his notes.  He is also very interesting and very helpful with questions.  You will have to write a lot, but it is worth it.  Also, there is no powerpoint so you have to go to class.  It is not smart to just copy someone else's notes as it is much easier to learn by going to class.  Discussion is only if you need extra help.  Tests are hard, but there is a curve.  If you are an ECON major, definitely take his class.  If not, still take his class.", "rating": 5, "expected_grade": "A", "created": "2008-07-22T20:45:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "He knows his stuff, but unfortunately he writes all his notes on the chalkboard so you have to go to lecture. \r\nDon't buy the book, it's useless. \r\nHe doesn't use Aplia, instead he has easy homework assignments that are graded for effort. \r\nThe tests are really hard so you have to study. Especially the random history questions. ", "rating": 4, "expected_grade": "A", "created": "2008-07-22T15:41:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "This professor writes an entire lecture on the chalkboard without using his notes. That's pretty darn impressive. By the way, don't skip class because the material on the exams are base on notes and they are not posted online. \n\r\nDo not be intimidated by this class. There is a lenient grade curve. The final grade was 80% for an A. Do not over analyze the notes, just grasp the main concept i.e. AS/AD graphs, Keynesian model, classical model. \n\r\nThere will be a substantial amount of memorization of formulas. The key is to use mnemonic devices or break big formulas into smaller formulas. \n\r\nOh yeah, the discussions are pointless and are just reiterations of the week's material. You might as well take the time yourself to review the notes. Don't go unless you want to collect homework assignments. ", "rating": 4, "expected_grade": "A", "created": "2008-06-05T11:30:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "He is a great lecturer with very thorough notes. I walk out of his class completely understanding what he  lectured about. BUT... when I look at his exams, its like I've never gone to class. SO SO HARD. Thankfully his homeworks are based on completion and you can even do it during class, and sometimes he would go over some problems of the homework while we are doing the homework b/c its due at the end of the class. Also, the curve is good. As a student that took intermediate Macro, this is a good beginner macro course. The history that he spends a min on is actually necessary. At first, I didnt see the point, but now I get that we had to know it. ", "rating": 3, "expected_grade": "", "created": "2008-03-28T20:32:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "I liked Shea because there was no aplia... there we're handed in problem sets that were relatively easy and were graded very leniently.  Econ is going to suck no matter who you have so I guess Shea is okay.  Dont bother with the book.  You will need to go to class or get notes if you miss class.  And the curve is pretty sweet.", "rating": 2, "expected_grade": "", "created": "2007-11-17T16:23:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "I had Prof. Shea for Econ201 and he was one of the best teachers I've ever had. He is very smart and clear in presenting the material. You must attend the (huge) lecture because the material on the test comes straight from Prof. Shea's lectures. He never required that we read from the textbook but I found it useful as a supplement sometimes; if you're trying to save money, you can get by without it probably. He made a lot of connections between theory and historical anecdote (as well as current politics/economics), which made the material much more interesting. Highly recommended for econ majors.", "rating": 5, "expected_grade": "", "created": "2007-11-16T14:13:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Hard to learn material. Does not use the book at all (don't bother buying it). Exams are based on class notes only, which he writes on the chalkboard and are not available online. Uses long drawn out examples that don't seem relevant to the material. Focuses alot on history and dates. \r\nOverall not that hard though because of a huge curve at the end of the semester but I didnt learn anything.", "rating": 2, "expected_grade": "", "created": "2007-10-23T17:08:00Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Does a good job for a class as boring as Macroeconomics. Lectures aren't mandatory but still go because what he says is helpful for the notes. Homeworks are easy for effort but class is graded mostly on exams and they can be tough. Overall good guy to take for macroeconomics.", "rating": 4, "expected_grade": "B", "created": "2019-12-10T19:27:10Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Shea really knows what he is talking about. I strongly suggest going to class, you'll learn more that way and have a better understanding of the material you need to know. He has a generous curve but his exams are extremely difficult. There were a few issues this semester when it came to testing because of covid and him not having a set format for tests. I never understood why his tests were THAT difficult, made me feel like I never actually learned anything. ", "rating": 4, "expected_grade": "", "created": "2020-12-19T23:16:26Z"}, {"professor": "John Shea", "course": "ECON201", "review": "You can tell Shea is very knowledgeable and his lectures are filled with information. I didn't think the exams weren't that bad just make sure you attend all of his lectures and do the practice exams. I honestly learned a lot in the class and I definitely recommend him. There's a generous curve and the homeworks are easy As so you have to do well on the exams. ", "rating": 5, "expected_grade": "A", "created": "2021-01-12T19:11:36Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Most of what I learned in this class was reading off the slides and being 3-4 slides ahead from live lectures because I couldn't write the notes at the same speed Dr. Shea taught. But the small instances I would stop taking notes and listen to Shea explain concepts, he seemed pretty thorough and I found the topics interesting but I don't know how interesting it would be people that don't care for econ (I also took econ in high school). I never read the textbook, and his tests are only based on slides, but I would recommend writing at least a couple slides before lecture so that you can listen rather than scramble to write notes. Personally, I felt his test curves and grading were pretty generous, and an A is definitely not out of reach. ", "rating": 4, "expected_grade": "A+", "created": "2021-01-28T21:28:53Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Awesome professor! I took it online, and the exams were open-note, but even if they weren't this would be a really well-taught and fair class. He's a little quick so you won't have a lot of down time during the lectures but if you write fast you can keep up. (I'm usually a slow writer but I realized pretty quickly with this class it's either sloppy notes or missing a lot of stuff). The lectures are really info-heavy though, so get ready to start learning on the FIRST DAY and for a 75-minute information dump every class. Some say the exams are tough but I personally thought they accurately reflected the rigor of the class, and the curve is more than generous. He covers everything you need in class, the weekly problem sets are graded on effort (but are really helpful anyway) and the review sessions and practice exams are spot-on. If you pay attention, take notes, and do the practice exams, an A is totally doable. The textbook is free but not mandatory. I personally never read a word of it and still pulled an A on the exams. \r\nProfessor Shea is a really solid choice for this class. He explains everything clearly and thoroughly and prepares you well for the exams. I also found the material interesting because it's so easy to apply it to the real world, and it's nice to understand how these things work (unemployment, inflation, business cycles, etc). Definitely take Professor Shea, you won't regret it!", "rating": 5, "expected_grade": "A", "created": "2021-04-19T18:50:42Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Prof Shea teaches pretty traditionally in the sense that this class is extremely lecture heavy. If you're not a good note taker or struggle to pay attention during long lectures, you might struggle in his class. Every week there were two 1 hour 15 min classes where he lectures from a long PowerPoint presentation that's posted on ELMS (he would often go overtime too so be mindful of that) and then a problem set that was graded on completion due at the end of the week. Lectures can be pretty dry and monotonous at times but Shea is very thorough and clear at explaining the material. The textbook was free and optional but I never read it and honestly you don't need to read it to understand the material. Just make sure that you're good at taking quick notes during lecture (pretty much anything he says in lecture, including historical background and examples are fair game for exams) and you know how to do every problem on the HW and you'll do fine. Tests are not too difficult as long as you study and he grades them on a curve. If you pay attention and take good notes during lecture, this class is not difficult to get an A in.", "rating": 4, "expected_grade": "A", "created": "2021-04-20T16:37:16Z"}, {"professor": "John Shea", "course": "ECON201", "review": "I loved having professor Shea. I think he presents the information in maybe not the most intriguing way but I dont think it can much more interesting with this content, he tries to integrate some real life implications. He is the most fair teacher ive had and just an all around good person. I would 100% take a class with him again. I have really bad testing anxiety and school anxiety and with this course I always felt like i was in control of my grade. ", "rating": 5, "expected_grade": "A", "created": "2022-01-18T02:08:56Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Professor Shea is the most caring, knowledgeable, and passionate professor. He is always willing to reexplain concepts and his tests are very fair and reflect the material and weekly problem sets. Nothing should be a surprise. If you do the work and keep up, you should not have trouble getting at least a B. If you get the opportunity to take Professor Shea, DO IT. ", "rating": 5, "expected_grade": "A", "created": "2022-04-09T06:18:39Z"}, {"professor": "John Shea", "course": "ECON201", "review": "The most kind, funny, intelligent, thorough, and knowledgeable professor. I feel so lucky to have been taught by him. He can explain math, history very well as it relates to economics. ", "rating": 5, "expected_grade": "", "created": "2022-04-11T17:05:47Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Made a class I was really nervous to take genuinely engaging and informative. I felt like I actually learned a LOT. Tests are more than fair. Really glad I took this class with Prof. Shea!", "rating": 5, "expected_grade": "", "created": "2022-05-15T00:07:40Z"}, {"professor": "John Shea", "course": "ECON201", "review": "I love Professor Shea! He’s incredibly caring, knowledgeable, and thorough. Nothing on exams should be a surprise because they’re worded exactly like the practice exams and problem sets. I thought the exams were very reasonable and reflected the course. Plus there’s a great curve. You can tell he loves what he teaches and he’s brilliant. One of the best at UMD. TAKE HIM!", "rating": 5, "expected_grade": "", "created": "2022-05-16T17:30:20Z"}, {"professor": "John Shea", "course": "ECON201", "review": "The best. Take him.", "rating": 5, "expected_grade": "", "created": "2022-05-16T17:31:09Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Dr. Shea is a super nice professor and sets you up for success. The content can be challenging but the tests were very fair and there is a generous curve. Entire grade is based off of two midterms, a final, and weekly problem sets graded for completion. Only reason I didn't give 5 stars was because the lectures were pretty dry. Take ECON201 with him!!!", "rating": 4, "expected_grade": "A", "created": "2022-05-20T18:28:47Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Really great professor. His knowledge and passion for Econ is clear in the way he gives his lectures. The material is pretty dry most of the time, but easy to learn. Grading is also super fair, we had problem sets every week graded for completion and two midterms + a final. You get to make a double-sided formula sheet for both midterms and two double sided formula sheets for the final. There are also discussion boards on ELMS for all of the chapters where you can post questions for him to answer, which is super helpful for the exams. The curve at the end of class is also very, very generous. Highly recommend taking Prof. Shea!", "rating": 5, "expected_grade": "A", "created": "2022-05-22T02:10:24Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Only reason I don't give him 5 stars is because the lectures are on the dry side. That being said, he really sets you up for success and clearly explains relevant concepts. Make sure to study practice exams and you will do well. ", "rating": 4, "expected_grade": "A", "created": "2022-05-25T19:10:41Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Go to lecture and you can't do worse then a B-. Exams are like 15-20 m/c and a couple short answers, but the practice exams and TA review sessions make them not that bad. Also a big curve. Buddy of mine got a C with like under a 50% in the course.", "rating": 4, "expected_grade": "B", "created": "2022-11-22T19:04:31.301558Z"}, {"professor": "John Shea", "course": "ECON601", "review": "Kind face, but mean, typical hypocrite, not able to think clearly out of sterotype", "rating": 1, "expected_grade": "A-", "created": "2023-05-15T01:37:53.202770Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Exams are really fair and have cheat sheets he makes for you, homeworks are graded for completion. Not a fan of Shea, he's not very interesting to listen to lecture. He also covers some weird topics of macroeconomics that other professors don't cover, but nothing is that difficult. Just lots of math and real world stuff. You don't ever have to go to class to pass it for this one, so if you have to take it, don't stress. Also, would appreciate if he left his political opinions out of lectures, entirely irrelevant to his particular content.", "rating": 3, "expected_grade": "A", "created": "2023-12-13T06:33:47.841951Z"}, {"professor": "John Shea", "course": "ECON201", "review": "Such a good professor. His lectures were pretty interesting and not too complicated. His homework grades were based on completion. The best part about the class was that the exams were extremely similar to the practice exams and you get to bring a formula sheet that you can put whatever you want on. As long as you make a good cheat sheet and do some of the practice exams you have more than enough materials to do well in the course.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T22:45:00.379161Z"}], "name": "John Shea", "slug": "shea_john"}