{"courses": ["ITAL411", "ITAL473", "ITAL478C", "ITAL478D", "ITAL421", "ITAL471", "ITAL478F", "ITAL351", "ITAL204", "ITAL241", "HONR218K", "ITAL478R", "SLLC299P", "ITAL215", "ITAL207", "ITAL499R", "WMST298K", "ITAL103", "PSYC603", "PSYC660", "PSYC661", "ITAL203", "ITAL411", "ITAL478D", "ITAL478P", "ITAL499P", "ITAL103", "ITAL478I", "ITAL499I", "ITAL441", "ITAL103", "ITAL411", "ITAL478D", "ITAL103", "ITAL441", "ITAL478I"], "average_rating": 4.3333, "type": "professor", "reviews": [{"professor": "Joseph Falvo", "course": "ITAL204", "review": "204 is basically a review of 103 and 203, but the parts that get confusing are when you learn the exceptions to the rules you always followed before. If you never do any other work for the class, which is very possible because he gives very little homework that is actually due, keep up with the new vocab. The quizzes and tests always have a couple sections on vocab and it's an easy way to get points. Whereas after 3 semesters of learning the same verb tenses, you either know them or you don't. He tries to call on everyone in class once a day, so if you pay enough attention to be able to answer correctly when he calls on you, you can do other stuff the rest of the time. 204 is when I get my homework for other classes done.", "rating": 4, "expected_grade": "B", "created": "2010-12-05T13:03:00Z"}, {"professor": "Joseph Falvo", "course": "ITAL204", "review": "He is a very nice teacher and doesnt talk too fast to understand. However his lessons are just a routine reading straight from the book and doing exercises, relatively boring.\n\r\nHe is very friendly with the students and easily approachable, though not always helpful. Hes about five minutes late for class every day but still lets us out on time which is nice. A relatively easy class, with a very boring lesson plan", "rating": 3, "expected_grade": "", "created": "2010-11-17T18:51:00Z"}, {"professor": "Joseph Falvo", "course": "ITAL473", "review": "Very good class. Very good teacher. He knows what he's talking about, he's very nice to everyone in the class, he's understanding, and the material is enjoyable as well. While Ital471 was way better due to the films, I recommend anyone to take this class and take Falvo for any class they can.", "rating": 5, "expected_grade": "B", "created": "2009-12-04T04:35:00Z"}, {"professor": "Joseph Falvo", "course": "ITAL204", "review": "I'm an Italian Language minor, so this class was pretty easy for me, considering it was a complete review of everything we learned in 103 and 203. He assigns readings and exercises, but doesn't check them, so I personally did little to no work in the class. I give the other people credit who actually did the work, especially the ones who struggled through the class, simply because it just didn't come that easy to them or some other reason.\n\r\nThat being said, Falvo is an awesome professor. He usually comes to class 5 minutes late (on average), doesn't speak a mile a minute so he's easy to understand. A couple days during class we would bring in cookies and stuff and make espresso in class.\n\r\nOverall, a great guy and a great professor. Get to know him personally, and you'll have an indispensable reference.", "rating": 4, "expected_grade": "", "created": "2009-02-25T16:29:00Z"}, {"professor": "Joseph Falvo", "course": "ITAL103", "review": "Just a truly awesome professor and human. Is passionate about his country and wants to share it. He is very flexible about the grades he gives and caters to his students. All around a great guy. ", "rating": 5, "expected_grade": "A", "created": "2020-05-06T22:01:22Z"}, {"professor": "Joseph Falvo", "course": "ITAL103", "review": "Professor Falvo is a great guy and very funny. His lectures are interesting if you're really into learning Italian, if not, then he is not the professor for you. Every class he will call on every student to answer the questions in the textbook in Italian, which is nerve wracking at first, but speaking a foreign language and messing up is the most efficient way to learn it. He is very lenient with late assignments. He does speak Italian kind of fast, but he will repeat himself slower if he knows you didn't understand him. Overall, Professor Falvo is a great guy and instructor, and I would've taken him for ITAL203 if it would have fit in my schedule.", "rating": 5, "expected_grade": "B+", "created": "2022-01-19T03:29:03Z"}], "name": "Joseph Falvo", "slug": "falvo"}