{"courses": ["ENST281", "ENST100", "ENST472", "ENST499Y", "ENST410", "ENST689J", "ENST499W", "ENST389", "ENST486", "ENST499", "ENST389", "ENST472", "ENST486", "ENST499Y", "ENST281", "ENST360", "ENST389", "ENST472", "ENST486", "ENST499Y", "ENST100", "ENST389", "ENST472", "ENST486", "ENST499O", "ENST499Y", "ENST389", "ENST499", "ENST281", "ENST360", "ENST389", "ENST472", "ENST486", "ENST499Y", "ENST389", "ENST472", "ENST486", "ENST499O", "ENST499Y", "ENST281", "ENST389", "ENST472", "ENST486", "ENST499Y"], "average_rating": 2.3333, "type": "professor", "reviews": [{"professor": "Jose-Luis Izursa", "course": "ENST281", "review": "He didn't really teach, and he wasn't amazing at making the information pertinent to the class. One class, we had a guest bring us around campus to show us some green stuff, and we asked him if he used CAD in his career. Nope.", "rating": 3, "expected_grade": "A", "created": "2017-12-30T20:38:33Z"}, {"professor": "Jose-Luis Izursa", "course": "ENST281", "review": "I personally love Dr. Izursa outside of the classroom, but he's not the greatest professor. He takes a long time to grade assignments and gave us very little time to work on our final project which was very stressful. This course should be 4 credits, I have no idea why it is only 2 considering the amount of homework we had each week. With that being said, Dr. Izursa is super kind and very friendly. I have enjoyed talking to him throughout the semester. AutoCad is also an incredibly important skill to know, so I would recommend this class for people who want to beef up their resume skills. Just be prepared for some hardships.", "rating": 3, "expected_grade": "A-", "created": "2023-12-11T17:32:55.511068Z"}, {"professor": "Jose-Luis Izursa", "course": "ENST472", "review": "The WORST professor I have ever had in a university. Wasted an entire month of my time saying he'd write me a letter of recommendation (which I had to write myself and send him) and only told me a week before my application deadline that he \"can still write it, but would have to adjust it and it would hurt me more than help me\". He gave us creative liberty to work on our capstone, but ended up making decisions himself without even notifying us then expecting us to deal with the decisions that he made. Hardly provided us with any of the materials we requested. Had unrealistic expectations of us and treated certain students differently than others. He is not very pleasant when dealing with students and had been badmouthing us to other students and professors on campus. Finally he was very demanding and when students kept saying no to voluntary events post-semester he kept trying to force them.", "rating": 1, "expected_grade": "B+", "created": "2024-02-27T05:40:20.610841Z"}], "name": "Jose-Luis Izursa", "slug": "izursa"}