{"courses": ["ENGL101", "ENGL101A", "ENGL101C", "ENGL391", "ENGL101S", "CINE280", "CMLT280", "ENGL101C", "ENGL101H", "ENGL101C", "ENGL101S"], "average_rating": 4.5714, "type": "professor", "reviews": [{"professor": "Joshua Weiss", "course": "ENGL101", "review": "Joshua Weiss is an excellent teacher and seriously cared about his students improvement. Take his ENGL101 class for fair grading and excellent support. ", "rating": 5, "expected_grade": "A-", "created": "2018-01-23T20:25:13Z"}, {"professor": "Joshua Weiss", "course": "ENGL101", "review": "Dr. Weiss is a fantastic professor! Not only does he readily engage with his students, but it is clear that he cared about all of us. He is also funny and his class is fun to attend. I didn't think I needed English 101 but he taught me that I can't just phone in my essays anymore. I cannot recommend him enough. ", "rating": 5, "expected_grade": "A", "created": "2021-06-16T22:00:39Z"}, {"professor": "Joshua Weiss", "course": "ENGL101", "review": "Dr. Weiss is an excellent person- he is very engaging and fun to talk to! I enjoyed all my conversations with him and it was obvious that he cared about his students. However, I felt like he graded on the harsher side (I would say I am a mediocre writer however I write well enough to scrape by with an A in a lot of other courses). If you want an A you either need to be an above average writer or willing to spend A LOT of time towards the course. I had an extremely heavy course load this semester and could not spend hours upon hours pouring through and improving my papers. He is always willing to help and improve writing, however this class is not an \"easy\" A. If you are looking to improve writing definitely take this professor! However, if you do not have a lot of time to spare or are not passionate about writing I do not recommend taking this professor.", "rating": 4, "expected_grade": "", "created": "2022-05-14T19:04:19Z"}, {"professor": "Joshua Weiss", "course": "ENGL101", "review": "Dr. Weiss is a good professor. He is open and honest with his students, which makes for a good classroom environment. He really does care about his students!! The coursework can be overwhelming, but make sure to balance your time wisely. He is always willing to help improve writing and leaves good feedback, but his class is not an \"easy A\". ", "rating": 5, "expected_grade": "A", "created": "2022-05-19T02:37:06Z"}, {"professor": "Joshua Weiss", "course": "ENGL101S", "review": "Dr. Weiss is a very passionate and engaging professor. He genuinely cares about his students improving on their writing skills and how engaged we are with our writing topics. That being said this is a very demanding class and he has high expectations for all of his assignments. He is a pretty tough grader so an A in this class won't be easy but he is willing to help you work for it. The comments he leaves on papers are hit or miss in terms of helping you improve and some of his comments are copy and pastes from other assignments. Overall this is a good class to improve your writing but it will be demanding in terms of work and grading.", "rating": 4, "expected_grade": "A-", "created": "2022-05-19T20:02:39Z"}, {"professor": "Joshua Weiss", "course": "ENGL101C", "review": "Dr.Weiss is a great guy and he's very passionate about his topics. He is pretty laid back but you shouldn't really take advantage of that because i'm pretty sure he secretly keeps track of people who are late to class or like doesn't show up. He is very welcoming but also manages to give you harsh but good criticism. He is not for the weak!!!! BUT, he is very accommodating and will give you extensions if you just ASK. I got a B+ in every single assignment but class participation and the last project got me an overall A- in that class (WHICH I'M HAPPY WITH).", "rating": 5, "expected_grade": "A-", "created": "2022-12-01T14:25:00.954917Z"}, {"professor": "Joshua Weiss", "course": "ENGL101", "review": "Really good guy he does care and gives good feedback but he is not for the weak. You really have to work for a good grade in his class. He will give extensions if you ask and he is very flexible. Only take him if you are willing to put in the work and a lot of it. It is really hard to impress him, and he doesn't give out many A's.", "rating": 4, "expected_grade": "B+", "created": "2023-05-09T19:02:37.107210Z"}], "name": "Joshua Weiss", "slug": "weiss"}