{"courses": ["ARTT110", "ARTT418B", "ARTT418H", "ARTT110", "ARTT418B", "ARTT418H", "ARTT110", "ARTT418B", "ARTT418H", "ARTT110", "ARTT418B", "ARTT418H", "ARTT110", "ARTT418B", "ARTT418H", "ARTT110", "ARTT418B", "ARTT418H", "ARTT110", "ARTT418B", "ARTT418H"], "average_rating": 3.6, "type": "professor", "reviews": [{"professor": "Jowita Wyszomirska", "course": "ARTT110", "review": "She's a pretty good professor; you mostly spend the class working on different drawings, while she circulates around the room and gives individual feedback. I found the grading to be pretty easy and fair; I enjoyed her class!", "rating": 4, "expected_grade": "A", "created": "2019-12-27T16:21:44Z"}, {"professor": "Jowita Wyszomirska", "course": "ARTT110", "review": "Professor Wyszomirska was great in person. Her feedback in class was helpful and helped me grow my knowledge in the different drawing styles. The portfolios you create throughout the semester really matter and can impact your grade, so remember to save all your work until the end. She gives at home assignments to do which can be tricky since we are not at home and in a small dorm. When she would grade at home assignments, her feedback was not the best and very vague. I wish she would explain how to improve our at home art work better. Our final was to do research on an artist and write about them and some of their art; it was not too hard. ", "rating": 4, "expected_grade": "A-", "created": "2022-01-18T18:05:24Z"}, {"professor": "Jowita Wyszomirska", "course": "ARTT110", "review": "Very nice professor, she is very passionate about her work and offers great advice. Grading is VERY fair no matter your skill level, as long as you try your best. Attendance in class is mandatory and NECESSARY. You will be drawing in makeup work if you miss class and probably fail the class. Outside homework is time-consuming but definitely manageable if you stay on top of your work.", "rating": 4, "expected_grade": "A+", "created": "2023-05-02T02:16:13.320179Z"}, {"professor": "Jowita Wyszomirska", "course": "ARTT110", "review": "Very nice professor and actually offers good feedback. Skill level doesn't matter; honestly, it feels like she works with you no matter your level of interest in art. Home project feedback was somewhat vague and attendance is mandatory. Long class so somedays feel longer than others, but after a while when you're just drawing for 2 hours with music playing you don't really notice.", "rating": 4, "expected_grade": "A+", "created": "2023-06-21T06:02:09.020544Z"}, {"professor": "Jowita Wyszomirska", "course": "ARTT110", "review": "Professor Jowita is very kind and gives constructive criticism. I liked the way she organized her class. My main problem with this class is that it is 2.5 hours long twice a week, and you'll feel it. I think the pacing of her class is far too slow and we spend weeks working on a very simple abstract artwork. The days that she was out and her TA subbed in were honestly far better than the days she led class. The teaching style of the TA was to challenge us and try to work at it while Professor Jowita was much more about the basics. A day I remember vividly is when she had us draw a very simple table for an entire class period of 2.5 hours and I was done within 20 minutes. If you have any background experience in drawing, a different professor might be better for you.", "rating": 2, "expected_grade": "A-", "created": "2023-11-09T02:15:57.193377Z"}], "name": "Jowita Wyszomirska", "slug": "wyszomirska"}