{"courses": ["SPAN363", "SPAN798Q", "SPAN450", "SPAN303", "SPAN798D", "SPAN408K", "SPAN408A", "SPAN798J", "SPAN408E", "SPAN798T", "SPAN798Y", "SPAN448F", "SPAN408B", "SPAN798F", "SPAN408Q", "SPAN361", "SPAN408M", "SPAN798O", "SPAN798R", "SPAN363", "SPAN448Q", "SPAN363", "SPAN798E", "SPAN303", "SPAN363", "SPAN363", "SPAN798K", "SPAN363", "SPAN448U"], "average_rating": 4.3333, "type": "professor", "reviews": [{"professor": "Juan Carlos Quintero-Herencia", "course": "SPAN362", "review": "Prof. Quintero's one of the most engaging professors I've ever had. He is (or at least seems) really enthusiastic about the \"themes\" that underlie the class, and creates an excellent narrative to unite them. \r\nHe's really intense, and may seem a bit intimidating at first, but he really just wants to make sure you get something out of the class. He truly cares about his students' progress, and will go out of his way to give you feedback.", "rating": 5, "expected_grade": "", "created": "2008-07-01T23:05:00Z"}, {"professor": "Juan Carlos Quintero-Herencia", "course": "SPAN363", "review": "JCQH is an easy grader, but he doesn't go far in depth enough into materials nor did he really 'push' any of his students. ", "rating": 4, "expected_grade": "A", "created": "2018-01-02T01:41:21Z"}, {"professor": "Juan Carlos Quintero-Herencia", "course": "SPAN363", "review": "Prof. Quintero-Herencia is incredibly enthusiastic about the content of this course, and makes some pretty profound connections to very broad themes. Unfortunately this will often lead to him going off on huge tangents that can seem rather irrelevant to the course content. He is indeed a very lenient grader, and I definitely got a much higher grade in the class than what I deserved for the work that I put in. The class is not organized all too well, however. It takes him a long time to get grades up on ELMS, and a whole 50% of the final course grade comes from assignments that you turn in after the last day of class, leading to a lot of uncertainty in your grade until it's all said and done.", "rating": 4, "expected_grade": "P", "created": "2021-06-26T14:50:55Z"}], "name": "Juan Carlos Quintero-Herencia", "slug": "quintero-herencia"}