{"courses": ["ENGL391", "ENGL398N", "ENGL101S", "ENGL393H"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Kara Pleasants", "course": "ENGL101S", "review": "She is wonderful, do not take my grade as a deterrent. I just stopped doing work - but she tried SO hard to help. She will give any extension, no questions asked, and promotes a very fun class environment. She clearly cares and is so willing to help if you accept it.", "rating": 5, "expected_grade": "F", "created": "2023-12-04T20:51:08.468141Z"}, {"professor": "Kara Pleasants", "course": "ENGL101S", "review": "Professor Pleasants is genuinely the sweetest woman ever. She really wants everyone to succeed and is extremely flexible with deadlines. If you have the opportunity to take a class with her I 110% recommend it.", "rating": 5, "expected_grade": "A", "created": "2023-12-05T02:36:53.862922Z"}, {"professor": "Kara Pleasants", "course": "ENGL394", "review": "I took ENGL394 this fall and would 100% recommend Professor Pleasants. She is very structured and organized, and her lectures and assignments reflect that. Even though this is an asynchronous course, I always felt like I stayed on top of my work because she would send out weekly announcements detailing the schedule we should follow. She is a fair grader, but you definitely need to allot time to do assignments, especially the business proposal.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T00:43:37.036007Z"}, {"professor": "Kara Pleasants", "course": "ENGL394", "review": "Amazing professor, she expects quality work but gives great feedback and is flexible with deadlines.", "rating": 5, "expected_grade": "A", "created": "2023-12-12T04:16:46.259784Z"}, {"professor": "Kara Pleasants", "course": "ENGL101S", "review": "Prof Pleasants is genuinely the sweetest woman ever and is so flexible with her deadlines. Her feedback is always great too and she grades pretty leniently. If you have the opportunity to take a class with I 10/10 recommend!!!!", "rating": 5, "expected_grade": "A", "created": "2023-12-14T03:31:05.098492Z"}, {"professor": "Kara Pleasants", "course": "ENGL101S", "review": "I honestly loved Professor Pleasants. She's genuinely a sweet person and has a clear passion for English. My only qualm is that she sometimes doesn't give feedback on drafts until very late. However, her feedback is always very helpful and she's always willing to stay behind to answer your questions. She usually doesn't say no to giving out extensions which is always helpful. Overall, I definitely recommend taking English with her.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T18:32:44.471961Z"}, {"professor": "Kara Pleasants", "course": null, "review": "Professor Pleasants is great! She's quite quirky and fun and has a deep love for what she teaches. However, she can be slightly delayed in her feedback on essays(to the point of feedback being given same day as essay is due) and personally she relies slightly too much on our peer reviews for us to gain guidance from. But overall, she's flexible in deadlines and is more than willing to stay after class to make sure you understand the assignment and that you feel comfortable completing it. If she could offer any help (besides writing it for you) she'd be the one to do it. When you weigh the positive and the negative, the positive surely overpower so I'd give the class a go.", "rating": 5, "expected_grade": "A", "created": "2024-01-19T04:49:40.073246Z"}], "name": "Kara Pleasants", "slug": "pleasants"}