{"courses": ["ENGL101", "ENGL398C", "ENGL391", "ENGL398C", "ENGL297", "ENGL398C", "ENGL391", "ENGL398B", "ENGL398C", "ENGL391", "ENGL398C", "ENGL398C", "ENGL398C"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Kathleen Orr", "course": "ENGL101", "review": "Amazing teacher! She has improved my writing tremendously and is also energetic and nice. 1", "rating": 5, "expected_grade": "A+", "created": "2021-11-30T03:33:58Z"}, {"professor": "Kathleen Orr", "course": "ENGL398C", "review": "Doc is great and cares so deeply for her class and students. I had her in her first semester at UMD and she was a bit disorganized but when it was brought to her attention, she did her best to correct it. After taking her class, I realized how much my writing had improved. She'll say it in class but use the writing center; it was really helpful. She grades by the rubric so follow it very carefully. If you have any problems, just talk to her because she will work to help you as best she can. She did such a great job at making sure her class was an inclusive environment and made sure everyone felt comfortable with each other. I made a lot of friends in the class and we all became acquaintances at the very least. She is a very lively person and helped wake me up for my 9:30 section (which not a lot of professors can do).", "rating": 5, "expected_grade": "A+", "created": "2021-12-08T19:41:27Z"}, {"professor": "Kathleen Orr", "course": null, "review": "badass woman she does martial arts \r\n", "rating": 5, "expected_grade": "", "created": "2022-05-06T20:54:28Z"}, {"professor": "Kathleen Orr", "course": "ENGL101", "review": "Most understanding and caring teacher I've had at UMD. Take her if you can", "rating": 5, "expected_grade": "", "created": "2022-05-21T14:51:23Z"}, {"professor": "Kathleen Orr", "course": "ENGL398C", "review": "Her class was very easy to follow. She was a great professor- very understanding and wants everyone to be comfortable in class. Required attendance, and if you didn't attend she (or the TA) will email you to make sure you were okay. Her class wasn't difficult, just pay attention and do the work early so you can ask questions if needed. I recommend to take her if you can!", "rating": 5, "expected_grade": "A", "created": "2023-05-17T19:46:27.047827Z"}], "name": "Kathleen Orr", "slug": "orr_kathleen"}