{"courses": ["UNIV100", "COMM107", "PLCY388D", "PLCY380", "BSOS388B", "PLCY380", "PLCY380", "PLCY380", "PLCY380", "PLCY380", "PLCY380"], "average_rating": 2.2, "type": "professor", "reviews": [{"professor": "Katlin Gray", "course": "BSOS388B", "review": "I would probably avoid this professor, practically nobody in this class has been able to get an A despite the historical data of the class making it seem like it is a fairly easy course. Many of the large assignments in the course have had highest scores in the class of B+ and if you make the slightest error you will get an A- or B+. The course is a decent amount of work as well because of the number of readings required. I've received contradictory feedback like \"use your own words\" but also being told that direct citations are necessary within the same paragraph and as a result getting an A-/B+ on a project that the feedback was very positive on. Overall not a terrible professor but I wouldn't take her again just because she is very critical and it's probably not worth the stress/frustration.\r\n\r\nAlso one of those professors that claim to be open-minded etc but gives readings that are blatantly extremely biased.", "rating": 2, "expected_grade": "A-", "created": "2021-12-06T01:06:42Z"}, {"professor": "Katlin Gray", "course": "BSOS388B", "review": "If you do not need to take this class, simply don't. I took this course as an elective and had to work my ass off, leaving my other (more important) classes on standby. Workload is incredibly high and material is graded in an elementary manner (A, B, C) and some assignments either taking a 100% or 0% (with the kicker being that its not based on completion). Rubrics are not specific by any means and yet she demands specificity in your work, Even if the work you produce is good, she will nit pick little things about it to remind you that you are inferior compared to her. Jokes aside, she is a harsh grader. She can also be a SJW sometimes in terms of the biased readings she gives out to the class. Most of the readings actually don't offer much value to your comprehension in the class or the topic of social change. While she is a nice person, I think she has completely lost the meaning of what actually is social change: she is so hung up on making her students parrot the words she is saying, she forgets that to educate someone on the nature of social change it should be an open, stress-free environment where everyone can participate without having to be graded.", "rating": 2, "expected_grade": "A", "created": "2021-12-27T12:59:30Z"}, {"professor": "Katlin Gray", "course": "PLCY380", "review": "I've never had a class more meaningless while simultaneously having the most excessive workload I've ever seen. Not only can this class often feel like a complete waste of time but the amount of time wasted doing busy work is absurd. I truly have never regretted taking a class more. STAY AWAY.", "rating": 1, "expected_grade": "A-", "created": "2023-03-15T19:02:56.368070Z"}, {"professor": "Katlin Gray", "course": "PLCY388D", "review": "Professor Gray is the most thoughtful, caring professor that I have had. The level of detail and thought that she gives to the course and to all of her students is unmatched across the board. There is no one that I have met that thinks so sincerely about the course content and delivery as Professor Gray and I promise it goes a really long way. Professor Gray is constantly adjusting the class to ensure that it is best received by students and gives so much thought to student feedback. While her class does require time and dedication, she gives back so much to her students. The work that she gives us is work because she cares – she cares about our education, our advancements in social change, us as students, and us as people. I consider myself so lucky to have been a student in her class and appreciate all of the time and dedication that she has given students. I could go on and on about how great I think Professor Gray is and how much I have learned from her. Also, as a student, I know how important grades are and I can promise that her grading is the most thoughtful I have ever received from a professor. She is not a “picky/harsh grader”, but is someone that really does care about her students and their education. She will challenge you in the best way possible to advance your own understanding of social change and how to grow not just in the classroom, but as a person. She understands how much grades matter to students, and takes that into careful consideration when helping her students grow. Being a student in her class has changed how I approach learning in every way and I am so grateful for it.", "rating": 5, "expected_grade": "A", "created": "2023-05-29T22:29:37.303766Z"}, {"professor": "Katlin Gray", "course": "PLCY380", "review": "The class is a lot of unnecessary work. A lot of the outside of class assignments can be reviewed in class. There is no need to read three different full length articles and watch 10 videos to do a simple discussion in class. I don't feel like I am being taught, I just feel like I need to keep up but I am not learning. Prof Gray expects us to absorb all the content but doesn't actually contribute anything meaningful in class. She mostly asks students their opinions and agrees or disagrees. The TAs do more work going around. And her assignments are very rigid. I understand having a system but so far nothing has been graded so I don't know what to expect for future assignments. Overall, I just don't learn in class which is where I should be learning. It's a waste of my time but is unfortunately required attendance.", "rating": 1, "expected_grade": "", "created": "2024-02-20T01:26:13.340628Z"}], "name": "Katlin Gray", "slug": "gray_katlin"}