{"courses": ["FIRE167", "FIRE120", "FIRE267", "PHSC497", "MIEH300", "PHSC440", "SPHL399", "PHSC430", "PHSC388A", "MIEH300", "PHSC388A", "PHSC497", "SPHL399", "MIEH300", "PHSC430", "PHSC440", "PHSC497", "MIEH300", "PHSC440", "SPHL399", "PHSC430", "MIEH300", "PHSC430", "PHSC497", "MIEH300", "PHSC430", "PHSC440", "PHSC450", "PHSC450", "PHSC497", "PHSC450", "PHSC497"], "average_rating": 3.625, "type": "professor", "reviews": [{"professor": "Kendall Bustad", "course": "MIEH300", "review": "Dr. Bustad is approachable and laid back. She HAS to teach MIEH300 but also teaches a nutrition course and a public health in the city course. ", "rating": 4, "expected_grade": "", "created": "2021-02-01T16:12:28Z"}, {"professor": "Kendall Bustad", "course": "MIEH300", "review": "I really enjoy Dr. Bustad's class. The lectures are easy to follow along and encourages questions during class! Weekly quizzes and exams are pretty easy as long as you review the lecture slides! Lab is pretty simple and you will get them done in under an hour!", "rating": 5, "expected_grade": "A+", "created": "2022-08-29T17:18:34.169201Z"}, {"professor": "Kendall Bustad", "course": "MIEH300", "review": "Enrolled in her course during the pandemic when classes were entirely virtual. The online lectures were highly unengaging, monotonous, and not well executed. This made it difficult to follow.", "rating": 2, "expected_grade": "", "created": "2022-08-30T23:14:42.733802Z"}, {"professor": "Kendall Bustad", "course": "PHSC497", "review": "I have several friends taking PHSC497, and the course grades are entirely inconsistent. My friend in a different teacher's section said that the average grades on their assignments tends to be around 85-90 percent, in our class the average grades on assignments is like a 70 percent. Professor Bustad is an impossible grader, and her standards are impossible to keep up with. This may be the worst professor to take for this class. This shouldn't be tanking student's GPAs right before they graduate....", "rating": 1, "expected_grade": "B-", "created": "2022-10-26T18:28:49.531508Z"}, {"professor": "Kendall Bustad", "course": "PHSC440", "review": "I've had Dr. Bustad for MIEH300 and PHSC440! Her course style is very easy to follow. She does a lecture, 1 quiz, and 1 assignment. As long as you take notes from her power points you will do good in the class. Dr.Bustad sometimes doesn't post her slides or will post partial slides because students choose not to come to class (esp for MIEH300). Its best to go to class in order to get all the notes! Overall, would recommend PHSC440. It's asynchronous, a small time commitment, and super easy to do!", "rating": 5, "expected_grade": "A", "created": "2022-12-06T16:51:14.692512Z"}, {"professor": "Kendall Bustad", "course": "PHSC440", "review": "Way too high of standards for a class like this. Doesn't allow for any type of late work. Had a family emergency and got a 0/10 for missing the deadline which made an A not possible for me. Quiz questions seem to be intentionally worded to be trick questions.", "rating": 2, "expected_grade": "A-", "created": "2023-04-17T01:10:19.067807Z"}, {"professor": "Kendall Bustad", "course": "PHSC440", "review": "Great professor and easy class!! There was one small quiz (auto-graded, timed, 5 multiple choice questions) and one assignment each week. One class a week was for a lecture and the other class was for a collaborative activity, so you needed to come to class on the activity days but it was easy!(and you should go to lecture days for info in the quizzes) The midterm and final were both 2 application questions on a canvas open-note quiz that was not hard. Dr. Bustad clearly cared about your learning and made the class interesting, and the information is interesting too! She seems to grade pretty easily so the only thing that could really dock your grade would be getting quiz questions wrong which are mainly from the notes from lecture. She has clear expectations- if you submit stuff late or don't have an excused absence that is on you, but she seems to be willing to hear students out if talked to in advance. Easiest public health options course I've taken and definitely recommend it!", "rating": 5, "expected_grade": "A+", "created": "2023-05-20T00:34:53.589949Z"}, {"professor": "Kendall Bustad", "course": "PHSC450", "review": "Phsc450 is honestly not a hard class! A lot of the grade weight is the weekly lecture and section assignments, and as long as you turn them in on time (and answer the questions) you get all the points. This is one of the first times this class is being taught, so I don't know if they will change it up, but the final is a group poster presentation and she cut out the final paper so we didn't have to do it. I was lucky and had a good group in the discussion which gave me a good experience with the class. There were lecture discussion assignments for a grade on Wednesdays, so like no one was in class on Mondays, but I still went and found it helpful. That being said, the content of the class is just public health stuff you have heard before for the first half of the semester, and then it switches to an intervention focus in the second half. The first midterm was really easy, info straight from the notes and multiple choice. The second midterm was harder, free response, and i don't think there was enough time but it seemed to be graded pretty easy. You are given time in the discussions to do the weekly section assignments, and they were almost all working together with your group, but it was nice they were due right before your next discussion in case you needed more time. I found this class pretty easy and did not spend much time weekly on it. If you turn in all the things for this class and give at least some effort, you should get an A! Dr. Bustad is also a great professor, people might say she has some uptight expectations, but they are pretty realistic and she is willing to work with issues if you bring them to her in a reasonable time!", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T22:45:18.733329Z"}], "name": "Kendall Bustad", "slug": "bustad"}