{"courses": ["ENGL395", "ENGL394", "ENGL398V", "ENGL398C", "ENGL290", "ENGL395", "ENGL398C", "ENGL395", "ENGL398C", "ENGL398N"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Kevin Wisniewski", "course": "ENGL398V", "review": "By far the best professor I've every had. He really understands his students and is very empathetic to the amount of work they put in for other courses. He assigns deadlines based on when he feels everyone in class is ready and is more than willing to push that deadline back if students are having difficulty. ", "rating": 5, "expected_grade": "A+", "created": "2019-04-10T16:14:34Z"}, {"professor": "Kevin Wisniewski", "course": "ENGL395", "review": "Great Teacher! I always looked forward to this class. He is super understanding are genuinely cares about everyone.", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T23:35:45.644897Z"}, {"professor": "Kevin Wisniewski", "course": "ENGL395", "review": "Literally so understanding and truly wants the best for you! He would cancel classes on days that were meant for peer review or if it wasn't needed. He didn't like to make us do busy work. Had a blast in this class.", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T23:38:39.726140Z"}, {"professor": "Kevin Wisniewski", "course": "ENGL395", "review": "Best professor I've had at UMD. Super understanding for busy midterms weeks and would push assignments and cancel classes for students to study. Being someone that hates writing, he made assignments in such a way that it was fun to write. Take him.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T02:20:51.404882Z"}, {"professor": "Kevin Wisniewski", "course": "ENGL290", "review": "Amazing professor and genuinely one of the nicest people I've ever met. The assignments in the class were very fun and we were given a lot of creative freedom which was nice. Professor Wisniewski was so understanding and kind and I enjoyed this class so much! Would definitely recommend taking a class with him :)", "rating": 5, "expected_grade": "A", "created": "2023-12-10T04:19:09.680969Z"}, {"professor": "Kevin Wisniewski", "course": "ENGL290", "review": "i wasn't expecting much from this course, but he's honestly a good professor who you can tell cares about what he talks about. very empathetic towards his students. the structure of this class changes each semester but it wasn't so bad. there was an overlap in two major projects that made one week harder but I doubt that was on purpose. there were lengthy readings though and depending on the subject they're a nightmare to get through. i'd recommend this class still.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T05:49:43.610045Z"}, {"professor": "Kevin Wisniewski", "course": "ENGL290", "review": "Professor Wisniewski is truly one of the most caring professors on the UMD campus. He understands the stress most college students go through and really makes an effort to brighten everyone's day. Although his syllabus may seem intimidating, I promise his class is not only fun, but also thought-provoking. Professor Wisniewski has a great sense of humor, as well as a strong understanding of modern pop culture. The workload is very manageable, and the in-class discussions are always entertaining. Highly recommend!!", "rating": 5, "expected_grade": "A", "created": "2024-01-22T19:30:18.460966Z"}, {"professor": "Kevin Wisniewski", "course": "ENGL395", "review": "incredible professor, cares about students, doesn't care about deadlines. class is fun and he makes the experience enjoyable. Easy grader and he really gives people good feedback. one of the best profs at umd.", "rating": 5, "expected_grade": "A+", "created": "2024-01-29T20:11:09.573281Z"}], "name": "Kevin Wisniewski", "slug": "wisniewski"}