{"courses": ["BSCI222", "CPSP218L", "BSCI222", "BSCI150", "BSCI222", "BSCI222", "BSCI222", "BSCI222", "BSCI222", "BSCI151", "BSCI222", "BSCI151", "BSCI222"], "average_rating": 2.6944, "type": "professor", "reviews": [{"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "I think Dr P. deserves  5 stars but i'm gonna give her a 4 because she doesn't curve. Her lectures are fairly easy to understand and having the panapto videos as backup is really a life saver. I'll advice everyone to watch her panaptos thoroughly- her questions are only ever from what she talks about in class which is great. The exam review that the  TA's make is also really helpful.\r\nI'll advice everyone to start studying a week before the exam. \r\nGo through the panaptos and take notes then go over the notes. Her exams can be kinda tricky, especially the multiple choice section, where she asks really detailed questions- You know those times where you read and you skim a section where you're like this probably won't come up on the exam. Yeah, it will come up. ", "rating": 4, "expected_grade": "A-", "created": "2019-11-26T15:50:25Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Paczolt is really nice and does just about everything she can to help you out.\r\nShe posts her lecture slides, lecture summaries, lecture videos, pages to read in the book and problem sets, review videos made by her TAs, and old exams and their answer keys, so you can decide how you want to study. Office hours are also really great for getting your questions answered, and her TAs are absolutely amazing.\r\nHer exams are tough but fair - Paczolt likes to focus on the concepts instead of specific details, so you won't really have to memorize too much. But her short answer questions will really test if you know the material well enough to apply it to a setting you may not be familiar with.\r\nThe gene lab assignments in discussion are easy points, Canvas quizzes are rather straightforward, there is quite a bit of extra credit, and her final exam reuses questions from the midterms that are rewritten differently so it's easier to study for. That said, there is no curve.\r\nIn short, she gives you everything you need for an A, so if you put your time into this class you'll get it.", "rating": 5, "expected_grade": "", "created": "2019-12-18T02:34:13Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Paczolt gives you all the materials you need to succeed (this is for online). She gives you a clear schedule and what you need to do. She also gives you previous exams which are crucial(!!!) because they are very similar to the new ones, however, she barely mentions she has that resource out and I felt like it was underutilized.\r\n\r\nI really appreciated this; however, her exams are very weird..her multiple choice gives more time than necessary but some questions ask obscure concepts she barely mentions in lecture but doesn't have on slides. Additionally, her topic videos are just so very long and IMO boring but that's just personal and not why I gave her 3 stars.\r\n\r\nI think compared to the other BSCI222 teachers, Dr. P would probably be my least recommended out of them. She makes work and assignments from anything (so many assignments), and I think I spent the most effort in this class than any other class I have taken (including chem231/241). She also has a predetermined grade cutoffs and DOESN'T CURVE, and doesn't round either (90% is an A-, 89.999999 is a B+). This causes her to have a lower grade distribution than other professors, so I also wouldn't recommend her for this reason.", "rating": 3, "expected_grade": "A-", "created": "2020-12-13T17:43:06Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Horrible lecture, she's all over the place, exams are extremely difficult and there is no curve, maybe 5 points extra credit but not sure how that helps when the average is a 60. Wish someone would have told me this before taking her. ", "rating": 2, "expected_grade": "", "created": "2021-11-18T02:44:50Z"}, {"professor": "Kimberly Paczolt", "course": null, "review": "a lot of information to memorize because she expects you to know everything she says on the exam. if you don't mention keywords you will get the entire question wrong. good luck ", "rating": 3, "expected_grade": "", "created": "2021-12-02T21:03:57Z"}, {"professor": "Kimberly Paczolt", "course": null, "review": "this class dropped my gpa so good luck", "rating": 2, "expected_grade": "", "created": "2021-12-17T19:13:14Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Exams are worded too specific, averages for exams were never good, no curve, good luck", "rating": 1, "expected_grade": "C-", "created": "2021-12-18T22:18:44Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "This is a horrible professor. Although she gives you a lot of material needed to do well, the questions on the exams are not related to what she tells you study. So you need to review everything for the exams. She gives no curve despite her exam averages being in the low 60's. 34 people dropped the class after the second exam if that helps put it into perspective", "rating": 1, "expected_grade": "", "created": "2022-05-03T18:17:20Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Lecture: She's very nice, but the Exam wording is VERY specific. She doesn't curve the test at all. She does post old exams for practice, USE THEM so you can get used to her wording and types of questions. Also, do not use the PowerPoints to study, but instead, use the outlines she posts because they are much clearer. She goes crazy fast in class, but she posts the lectures. \r\n\r\nDiscussion: Not hard, but tedious and painfully long (esp review days). Attendance is mandatory and most TAs do check. ", "rating": 2, "expected_grade": "B-", "created": "2022-05-16T21:01:05Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Exams are extremely specific and often have details that were quickly mentioned in lecture; no curve with low exam averages; lectures are hard to focus in, and she just reads from the slides", "rating": 2, "expected_grade": "", "created": "2022-05-17T12:40:26Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "The teacher is good but the class is hard. I am giving her 4 stars because the final was surprisingly hard when she knew a lot of people had already struggled on the other exams. That being said, she did pretty explicitly outline the format and content of the final beforehand. I will say I think this teacher prepared me very well for biology classes after this that require genetics knowledge like general virology.", "rating": 4, "expected_grade": "A", "created": "2022-06-03T18:24:21Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Passionate, helpful, and kind are not words I would use to describe Dr. Paczolt. Dr. Paczolt believes in assigning a lot of work for very little credit, that takes up hours of your time. The TA teaches this entire class, and the discussion is a waste of time and is extra BS work that has no correlation to the material taught in class. Every exam we had was on the same day as the chemistry department. When you go to office hours and ask questions you feel like a moron. The exams. 6-7 pages with 4-5 questions on each page and must be completed in 50 mins. There is not a lot of partial credit given. If you could not get the other professor, I would honestly wait till the next semester.", "rating": 1, "expected_grade": "", "created": "2022-11-30T21:20:14.879968Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI150", "review": "There were a few long papers but they were fairly manageable and we had more than enough time to get them done. If you have taken any other bio courses, a lot of the content in this course will be a simplified review. A lot of extra credit is also offered on the exams which was really nice. I personally really loved Dr. Paczolt as a professor. It was obvious that she is passionate about what she was lecturing on and the lecture content was engaging and fun. She is also very receptive to questions and will offer further resources if you are interested in the content and want to go more in depth.", "rating": 5, "expected_grade": "A", "created": "2022-12-07T18:28:16.027887Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI150", "review": "In my opinion, this professor wasn't that great at explaining overall concepts. There are 3 teachers who are supposed to be teaching the BSCI 150 class but it looks like a lot of the work falls on her most times. Some of the questions on the exam can be pretty murky in their answer and kind of confusing to understand. If you study for them passively you can get at least an 70-80 on them. The exams were a mixture of multiple choice and short answer. The exams also come with extra credit at the end.  There is a lab in this class, which is possibly the worst part of this class. A lot of the work is tedious and can be extremely confusing if you have never really worked in a lab before.\r\n\r\nConclusion; Some of the content in this class was interesting but some topics were either not explained well or were just boring. If you like biology go ahead and take this class if you don't I would suggest you look elsewhere.", "rating": 3, "expected_grade": "A", "created": "2022-12-09T18:52:15.192450Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI150", "review": "I personally did not like Dr. Paczolt as a professor. BSCI150 is a class for non-STEM majors, and I felt like she made it more like a class for STEM majors. Some of the lecture quizzes were so hard, even though I took thorough notes in the lecture. The lab this semester was lowkey a mess, as there are NEW PROFESSORS! I seriously think the grade average in this class will drop after the Fall 2022 semester. She made the assignments a lot harder than they had to be. I studied for so long on the material and still found it confusing. She also isn't always helpful when asking her about things you do not understand\r\n\r\nPersonally, if you need a science with a lab and you are not a STEM-major I would take BSCI103. I think it would have been so much easier than this class was. For a gen-ed for most of us, if not all, Paczolt made it so much harder than it should have been!\r\n\r\nAlso, an 8 page paper is given around the middle/end of the semester, which was a lot of work when every other class has a lot too.", "rating": 2, "expected_grade": "A-", "created": "2022-12-12T23:32:02.933257Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Dr. Paczolt does get kind of a bad rep, but I think that's just because when comparing her to the other genetics professors she is just known to be harder. Her class isn't curved, but she did offer a lot of opportunities for extra credit throughout the semester and even on the final exam. We had three exams and each also had about 4 extra credit points possible which was nice. The exam averages tended to be in the high 60s (MC and short answer) and the final average was in the mid-70s (all MC). You do have to put in a decent amount of studying time to be able to learn, understand, and memorize all of the material that will be on the test, so I'd recommend starting about a week in advance. For the short answer questions on the exams, you basically either know it or you don't which can get difficult. The wording on some of her multiple-choice questions can get confusing, so I definitely recommend taking the practice exams she posts to try to get used to it.\r\n\r\nThe weekly 2-hour discussions are mandatory, but for the two weeks of discussion that lead up to each exam, you have dedicated exam review time where the TA goes over the important topics that will be covered on the exam in a PowerPoint. In the other weeks of discussion, you do something called GeneLab where you research a gene related to some kind of condition, which is a little tedious because it takes some time, but it's not that hard and it has a lot of easy points. Because discussions are two hours, it can feel extremely long sometimes which sucks, but it's not the worst thing ever.\r\n\r\nHer lectures can get a little bit boring because it's mainly her talking about the lecture slides, but she does post recordings on ELMS if you miss one or miss something important she says. One thing that would get a little frustrating is that sometimes she'll say important things but not have them on the slides, so it would feel like I'm trying to transcribe everything she's saying. Because of this, I recommend studying from the topic outlines she posts on ELMS rather than using the lecture slides because the outlines have things more written out than her slides do.\r\n\r\nShe has topic quizzes on ELMS due about every week about each topic you learn in lecture, and they can get a little difficult sometimes but she gives a lot of time to take them. Her other grades include practice exams graded for completion (which are easy points if you do them and submit them on time), study plans (also easy points), tutorial quizzes about topics, and two homework assignments for each exam (which you go over in discussion).\r\n\r\nWith all that being said, you do have to put a decent amount of time and effort into this class, but I definitely feel like I learned a lot that can be carried into my future classes.", "rating": 4, "expected_grade": "A+", "created": "2022-12-16T20:31:48.115219Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI150", "review": "First of all, she just doesn't explain things well. Her slides are so confusing and she just can't explain the concepts well without stuttering and rephrasing the same sentences that isn't even answering the question.  Second of all, she is kinda rude to student. She expects you to know things so if you ask her question, she gave you the \"how can you not know this\" look. Overall 150 class is fine but she made it really hard. She said she would never trick students but LOTS OF THE LECTURE QUIZ QUESTIONS PLUS FINALS QUESTIONS ARE TRICK QUESTIONS.", "rating": 1, "expected_grade": "A", "created": "2022-12-18T22:08:15.690998Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI150", "review": "makes things confusing, i personally don't like her lecture style and her exams are unfair.", "rating": 2, "expected_grade": "B", "created": "2022-12-25T23:05:35.201574Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "What a horrible, horrible, professor. Not only that, a very bad TA leader. She belittes her TA with almost every single thing they say. If we all came together and revealed the types of emails she sends to her TAs everyone would be shocked. Not only that, she can't teach. Don't take her. St Leger or Straney are great professors.", "rating": 1, "expected_grade": "", "created": "2023-03-06T18:08:54.923646Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Her canvas is organized horribly, it's impossible to tell which assignments are due when. She covers way more information in lectures than is normal and expects it to all be memorized by the exam. And when I say cover, I mean cover because she does not teach, she reads off the slides. Take another professor if you can. I regret taking this class so much.", "rating": 1, "expected_grade": "", "created": "2023-04-17T16:50:54.951867Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Honestly, I liked Dr. Paczolt even though she definitely gets a bad rep. The class is really heavy with information, so I would recommend re-watching lectures (she records them) so you don't miss anything. She gives lots of small assignments to prepare for exams and bring your grade up, and discussion/lab is really helpful. She's a really nice person, I think people just get overwhelmed with the amount of content in this course.", "rating": 4, "expected_grade": "A", "created": "2023-04-26T01:43:06.473462Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Please please do not take a class with Paczolt ever if you can avoid it. Ask your advisor to take the class another semester if it means you can have another teacher. She loads so much content into lectures and does not explain it very well. Her exams are very very difficult (I think they are unfair considering the level she teaches at in lectures) and many questions are meant to trick you. She is condescending and not compassionate. This class made me want to drop out of college multiple times.", "rating": 1, "expected_grade": "C-", "created": "2023-04-26T23:30:57.698515Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Genetics is a tough course, it is very content-dense, and going into it I was very nervous (I'm a freshman and had a very bad registration time and ended up going with Paczolt since that was all that was open) entering this class as the reviews for Paczolt were very negative. However, I honestly feel like it's more because the class itself is hard, as I've found Paczolt to be a fairly good professor, especially in comparison to ones from other departments. Her exams are hard, but she gives you all the resources you need to succeed: AN EXTREMELY ORGANIZED ELMS PAGE, an amazing GSS leader (I never miss a worksheet), 222torials help to explain typically confusing topics, she gives practice exams that are not only easy points but EXACT exam style, discussions are completely exam review the two weeks leading up to exams, each module is filled with supplemental materials, module objectives are filled with the key topics of each unit AND SHE RECORDS EVERY LECTURE!!!!! She not only gives out easy points through practice exams, extra credit sections in exams, and study guides, which are graded on completion, but she has offered the opportunity to earn back up to ten points on two of our exams with lower averages than expected and our final is completely multiple choice questions filled with rewritten previous exam questions AND WITH EXTRA CREDIT!!! She may not be great at answering questions during lectures, but she has been very helpful every time I've gone to office hours and I honestly believe she just gets a bad rep. The amount of content covered in genetics is overwhelming, but if you study hard and utilize the resources available you can and will succeed :)", "rating": 4, "expected_grade": "A-", "created": "2023-05-05T03:27:44.314105Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "If you can't memorize over 90 slides of information for one unit, this class is not for you. Her lectures are full of information she expects you to memorize for each exam, and sometimes that's not even helpful because she includes trick questions. This class requires so much studying and even with that, her exam averages are in the low 60s without a curve. Take any other professor if possible.", "rating": 1, "expected_grade": "B", "created": "2023-05-11T02:39:45.478401Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "I think Paczolt gets a bad rep because the course has A LOT of material. Not necessarily her fault for it being material packed. She lectures OK and answers questions pretty frequently. Grade scale is very upfront so there is no confusion about grades. Her tests definitely take time to study for but are fair, and once you take the first one you know what she looks for when grading. She also gives decent extra credit in her exams, as well as after if the average was low. Her final is all multiple choice because of the amount of content. Going to GSS/doing GSS worksheets are great ways to study. Discussion is stupid but it helps pad your grade. Overall a decent professor and definitely doesn't deserve the bad rep.", "rating": 4, "expected_grade": "", "created": "2023-05-15T21:10:17.915517Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "the only way I survived her class was by watching her recorded lecture at home because she can be fast in person and it is really hard to keep up. If you are taking 222 with her make sure you do not have any other hard classes because this class will take 70% of your attention throughout the week and there are so many things you have to do in one week. there is always something to do every day for this class. one thing you need to know about this class is that when you take the exams make sure you are detailed as possible because if you do not use the exact word they need to use, you will get it wrong because they are very harsh graders. you need to study a lot for the exam and make sure you know everything that is going on because they will ask you questions about everything. The only good thing about this class was how her finals included questions from past exams.", "rating": 3, "expected_grade": "B", "created": "2023-05-18T20:43:13.287966Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Great Professor. A lot of people underestimate how hard the class is and tend to blame the professor on them not working hard. 10/10 would take again. She records lectures and has extra credit which is also really nice.", "rating": 5, "expected_grade": "A+", "created": "2023-09-22T15:30:19.855313Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Great teacher.", "rating": 5, "expected_grade": "A", "created": "2023-09-25T00:02:46.017203Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Terrible. Absolutely terrible. DO NOT take her if you don’t have to. Yes, the content is a lot and can be confusing but she does not make it any easier. Her lectures are just dumps and she will not help you if you are going through a personal situation. WORST CLASS IVE TAKEN AT UMD.", "rating": 1, "expected_grade": "B-", "created": "2023-10-31T21:55:00.748493Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "a lot of material... a lot. exams are very dense with a lot of short answer, and i would recommend just watching the recorded lecture on your own time rather than coming to class (if youre like me and cant pay attention to live lectures) the topic quizzes are actually kind of difficult and are graded on correctness, not completion. the midterm averages have been in the high 60's low 70's. i dont like going to discussion but the exam review is helpful\r\nyou need to basically copy everything she SAYS verbatim. not just what is on the slide. if she mentions some detail that seems irrelevant, it is probably not irrelevant and it will be a question on a quiz or test. when i say write everything down im NOT PLAYING!!!! but thats what i did. its very tedious but I did well on all the midterms so far. its a lot of work and studying. dont take another difficult class at the same time if you can help it\r\npeople say she is rude, i will not lie when i say the way she speaks can sound condescending. but i dont think its on purpose...? it almost just feels like how she speaks naturally. i dont think she is EVIL... but ive heard she works her TAs to the bone so i dont know. to me its almost like a weed out class. i think she makes a lot of questions difficult and tricky on purpose so that only people who study hard or are smart do well\r\nshe does give extra credit though. there is some on every exam, and she may or may not give more depending on how the class is doing", "rating": 3, "expected_grade": "", "created": "2023-12-04T23:10:20.773813Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI150", "review": "Professor Paczolt is not a good professor. She honestly does not contribute much to the class. When she gives lectures they are very unorganized and confusing. She isn't good at giving lectures and has a horrible attitude towards her students. Do not take BSCI 151 or 150 thinking it is an easy course that fulfills gen eds the coursework is much harder than it used to be. The exams are no longer open notes and are written on paper. The term papers are easy but are extremely time-consuming. I recommend avoiding this class if you are a STEM major that already has a large work load.", "rating": 1, "expected_grade": "B", "created": "2023-12-06T16:13:46.298614Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Honestly, the course isn't too bad, it's what you expect out of a 4-credit BSCI course. Paczolt is bad in my eyes, I only gave her a 2 because the class was somewhat manageable. She comes off as very passive-aggressive with her responses and it's so annoying to the point I feel like I can't even ask a simple question in the class without being made feel stupid. She records her lectures so trust you don't have to show up to class for other than the exams and discussion periods. The exams I would say are quite hard, the easiest by far was the second exam. If you can take this class with a better professor (better ratings) I would say, go for it. If not just be ready to study hard and memorize a whole bunch of content.", "rating": 2, "expected_grade": "B", "created": "2023-12-08T02:03:33.391899Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "Horrifically bad professor with no real sense of course planning or empathy for the student side. I never usually review courses or professors but made an account just to warn other students against taking her if you can. \r\n\r\nShe jams 15 topics worth of content into a semester which can really only fit 12-13 based on the assignment load and pace she lectures at. Her course planning is so bad that for example now, on a Friday before exam week (our final exam is next Thursday and last day of classes is this upcoming Monday) she still has to finish Topics 14 and introduce/finish Topic 15 which will make up half of the final. \r\n\r\nThe assignment load is another point to mention, she assigns so many assignments that many times I find myself having to sit through finishing them for the week so I can have my schedule clear to actually study the material. Homework quizzes, online tutorials and quizzes, lengthy and niche “GeneLab” assignments which culminate in a presentation for the semester’s work, topic quizzes, study plans, practice exams, and on and on. Not to mention the mandatory 2 hour discussions every week to just load even more onto you. Her perspective of what her course is like as a student is nonexistent and she is so solipsistic I don’t think she even cares. Maybe in her mind she doesn’t view the student-teacher relationship as being a two way street where both have to meet in the middle but one where the students have no other obligations in life but her class and will robotically complete everything mandated of them.\r\n\r\nI think in her mind she thinks all of these babysitting/busywork assignments serve a function but for most students it is counterproductive and just serve as more opportunities to lose points throughout the semester. Not to mention how harsh and pedantic her grading on assignments are but she is so stubborn she won’t even listen to your take because her word is gospel. \r\n\r\nHer exams are another point which I could dedicate an entire post to because they are so specific, misleading, and unfair. She asks open ended free response questions which require specific answers down to the exact term.  Her past exam was so bad she even had to give an extra credit quiz today to try to remediate that but still lacks any reflection for why that may be and blames the Thanksgiving break for it (lol).\r\n\r\nTo top it all off she’s a very rude person who will be annoyed that a puny undergraduate like you came into her office hours asking to clear up an exam question missed or to ask for clarification about the course or due dates. \r\n\r\nAvoid her if you can, if not then try not to take any other hard classes in the same semester. It’s really past the point where the University needs to audit the quality of the courses some of these Professors are out here teaching but UMD is UMD so *shrug*. Good luck if you take her. \r\n\r\nAnd don’t trust the good reviews on here for her, she probably wrote them herself.", "rating": 1, "expected_grade": "B", "created": "2023-12-08T22:09:44.795921Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "I do not think Paczolt herself is as bad as people say she is... She can sound condescending, but I feel like it's not even on purpose? She can definitely be rude to those asking questions during lecture, whether she realizes it or not. It's not really her fault that there is so much material, although I don't like how we will still be learning material the week of the exam (I guess it can't be helped). I never went to office hours though, so I can't say that much about who she is as a person. But… I feel like there are definitely worse professors in terms of manners and how they treat students.\r\n\r\nIf you are like me and can't pay attention during in-person lecture, she records everything on ponopto, and you should just watch those videos instead. This course has a lot of content and complicated concepts, so you shouldn't take any difficult courses along with this one if you can help it. She likes to include weird trick questions in her topic quizzes which is annoying... her exams are multiple choice and a bunch of free response. You can skip one free response question, but you need to answer each question relatively quickly. Exam averages were in the high 60's, low 70's. No curve. There is some extra credit on every exam, and if there was a low exam average she might give out more. The free response is tricky, you need to include certain key words/phrases to get points but it's not explicitly stated what those phrases are. The exams are based on what she says during lecture - I got a good grade because I basically copied down every word she said and studied it (which is why the lecture recordings are so helpful). If she mentions a small detail you think is irrelevant, it will probably be a question on the next exam. Discussion includes two weeks of exam review for every exam, which honestly is very helpful. The final is cumulative but is made up of slightly altered versions of the questions from the midterms, so it is easier to study for it. It is also all multiple choice. Most assignments are graded based on correctness - homework, quizzes, genelab, etc., and I found the topic quizzes and homework questions tricky at times (I literally never got full points on a homework assignment even though it isn't timed lol). Study plans and practice exams are graded on completion though!", "rating": 3, "expected_grade": "A", "created": "2023-12-15T21:13:46.420164Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "BSCI222 is an information-packed class and it can be hard to keep up with the content. However, Dr. Paczolt gives you plenty of resources for you to be able to succeed. She posts her lecture recordings, has very helpful topic outlines, posts a practice exam before every midterm, is great at answering questions in class or during office hours, and keeps up with discussion board questions. She even holds an extra office hour before exams. Some other reviews referred to her lectures as an information dump, but that's just because there is so much content to cover that Dr. Paczolt has to keep to a strict schedule to finish everything before the semester ends. I actually liked her lecture style; she spoke clearly and was very thorough in explaining the content. Her lecture recordings are especially helpful for catching the details you may have missed the first time around. \r\n\r\nThe coursework was not too overwhelming; she assigned a topic quiz to be completed after each topic (4 topics per midterm), and 2 homework assignments and a practice exam due before each midterm. There was also an occasional short MathBench or 222torial Quiz due. The practice exam was graded on completion, but all others were on accuracy, and every one of these assignments was take-home and online. All of these assignments are useful in preparing for her exam as they showcase the types of questions included in her exams. Her exam grading is fair and she gives out plenty of extra credit to boost your grade. I've heard from my classmates that time can be tight on the midterms, but I feel like if you know the content well, they are completely doable within the timeframe. Her final is all multiple-choice and easier than the midterms, so time shouldn't be an issue there.\r\n\r\nDiscussion sessions could be split into Gene Labs and Exam Review and they are all mandatory. The Gene Labs were interesting and allowed you to see the applications of the content learned in lecture, but weren't particularly helpful for learning the content itself. The exam review sessions were a great way to prepare for exams though.\r\n\r\nHow I studied: Before each topic quiz, I would rewatch the lecture recordings for that topic at double speed. For the homework assignments, I would go through it once closed-note, then go through it again open-note and mark down what I got wrong before submitting. I always checked my practice exam against the practice exam keys and marked down what I got wrong. Before midterms/finals, I would read over the topic outlines and review the quizzes/homeworks covered in that exam. The topic outlines are extremely helpful when preparing for the exams. Flashcards would also be useful since there are a lot of terms to remember. Other helpful resources would be GSS and the discussion review slides.  On average, I'd say I spent 2-3 hours per week on coursework and 10 hours per midterm studying.", "rating": 5, "expected_grade": "A+", "created": "2023-12-16T03:18:06.322294Z"}, {"professor": "Kimberly Paczolt", "course": "BSCI222", "review": "All the reviews here are horribly unfair. If you put in an adequate amount of work, you will be fine. The class is expectedly dense, but that is the nature of Genetics as a topic, and less so indicative of the professor itself. She provides enough material to be successful, and the exams are very fair. Study hard!! The exam format is not bad, and there is no essay writing or anything like that. She always provides bonuses on her exams as well, which sometimes are just free points. Discussion is a little unrelated, but overall not hard either. Study her words carefully, make flashcards, and you will be fine.", "rating": 5, "expected_grade": "A", "created": "2024-03-08T20:47:23.969280Z"}], "name": "Kimberly Paczolt", "slug": "paczolt"}