{"courses": ["ENGL101", "ENGL101A", "ENGL211", "ENGL278T", "ENGL255", "ENGL395", "ENGL393", "ENGL395", "ENGL395", "ENGL395", "ENGL395", "ENGL395", "ENGL395"], "average_rating": 4.6, "type": "professor", "reviews": [{"professor": "Kisa Lape", "course": "ENGL393", "review": "good", "rating": 5, "expected_grade": "", "created": "2022-04-18T23:42:18Z"}, {"professor": "Kisa Lape", "course": "ENGL395", "review": "She was such an amazing professor and really cared about her students. She has given students extensions if they needed them and was willing to meet with you if you needed extra help. I highly recommend taking her!", "rating": 5, "expected_grade": "A", "created": "2023-02-01T17:24:24.112767Z"}, {"professor": "Kisa Lape", "course": "ENGL393", "review": "Super understanding, kind and accessible.", "rating": 5, "expected_grade": "A", "created": "2023-04-27T01:03:05.246537Z"}, {"professor": "Kisa Lape", "course": "ENGL395", "review": "She is sooooo sweet and super understanding of the hard classes a student has outside of ENGL395! She gave frequent extensions and opportunities to make up work. A lot of the assignments were busy work though, and I felt like I was wasting my time by doing the assignments/attending her lecture.", "rating": 4, "expected_grade": "A", "created": "2023-11-20T20:25:15.338367Z"}, {"professor": "Kisa Lape", "course": "ENGL395", "review": "Prof Kisa is so nice and she was always willing to give extra time on assignments. She also frequently moved back assignment due dates for us during the semester. That being said, I found engl395 kind of difficult and annoying because I don't think I will use a lot of the stuff we did, and a lot of it was busy work. I would recommend looking at engl390 or some other engl39_ because this was honestly a lot of work, but I don't think it was Prof Kisa's fault. Our large assignments included an Eportfolio, research review article, grant proposal, and public health campaign. You do a rough draft and peer review for each large assignment, and the first half of the semester has a lot of discussion posts that were useless in my opinion. She never gives anyone 100%, but in my experience doesn't grade too hard. Her canvas page is honestly somewhat difficult to navigate and she's pretty unorganized. There would be different directions for the same assignment in different places, and it was difficult to know where to find some stuff on canvas. She takes FOREVER to grade. You will not know your grade until the end of finals, but as you can see in the grade distribution she gives a lot of As. For me, the work slowed down after the research review article because we were in groups for the grant proposal and public health campaign, which is nice since everyone is dealing with their science classes, but this class felt like so much work in the beginning. Overall, prof Kisa is a kind professor who wants you to succeed and is always willing to help, but the class is really annoying.", "rating": 4, "expected_grade": "A", "created": "2023-12-17T23:21:04.148819Z"}], "name": "Kisa Lape", "slug": "lape"}