{"courses": ["ENGL101", "ENGL101H", "ENGL101S", "HHUM205", "ENGL101S", "ENGL101S", "ENGL272", "ENGL353", "ENGL101S", "ENGL469M", "ENGL101S", "ENGL101S", "ENGL353"], "average_rating": 4.2222, "type": "professor", "reviews": [{"professor": "Lara Payne", "course": "ENGL101S", "review": "One of my favourite professors so far! She always initiated interesting (though sometimes off topic) conversations with the class about current events or the English readings. For the essays she would give clear instructions and could answer any question you had about the topic or material. Deadlines that were reasonable in my opinion and we would often have workshops to peer review with other students. Prof Payne graded fairly and I'm overall pleased with how the class went. I wasn't even required to take an AW, but I'm glad I did because this was very informative and enjoyable with her as a professor.", "rating": 5, "expected_grade": "A", "created": "2019-11-20T13:22:13Z"}, {"professor": "Lara Payne", "course": "HHUM205", "review": "Loved how she incorporated current events and personal stuff into class meetings. She kept things lively and always found a way to connect our readings to something relevant. We didn't have many assignments, however, so it was a little difficult not knowing what my grade was until much later in the semester.", "rating": 5, "expected_grade": "A+", "created": "2021-01-12T07:54:09Z"}, {"professor": "Lara Payne", "course": "HHUM205", "review": "Lara is great, she's super nice and loves to talk. She ran this class just like a book club, and helped create a really relaxed vibe where we just talk. Some days we would spend 5 minutes or so just doing creative writing. The reading load was quite heavy; we read 5 books completely, and partially read several others. Outside of reading though, there are very few assignments. Most weeks, there was a discussion board we had to post to. We also had to do a book report on any middle grade or YA book, with someone presenting at the start of each class. The final project was very open with a lot of options for the format, and it could relate to any aspect of the class. \r\nYou could really tell Lara loves teaching this class, and it was definitely an enjoyable break from the stress of every other class, so I strongly recommend it.", "rating": 5, "expected_grade": "A+", "created": "2021-12-18T17:55:56Z"}, {"professor": "Lara Payne", "course": "ENGL101S", "review": "She is really great, wants everyone to do well", "rating": 5, "expected_grade": "A+", "created": "2022-04-07T17:26:33Z"}, {"professor": "Lara Payne", "course": "ENGL101", "review": "Lara is a nice professor, but her personality and method of teaching would get a little annoying sometimes. She would try to be woke, but then make a comment (usually directed towards a student) that could be rude or unnecessary. Also, a lot of the time class felt like a waste of time because we wouldn't actually do anything substantial, just have discussions with a partner that she would usually interrupt every two minutes. I appreciated how she tried to make the workload easier on us by cutting short unnecessary parts of assignments in order to pull higher quality work out of us, which I think worked. Also, if you are in person she requires you to print out every paper you submit, which is extremely inconvenient for a college student living on campus most of the time. Overall, the class wasn't that bad and I was able to get through, but I would not take it again. ", "rating": 3, "expected_grade": "A", "created": "2022-04-28T18:09:40Z"}, {"professor": "Lara Payne", "course": "ENGL101S", "review": "This teacher was rude, unhelpful, and the worst. I did not learn anything valuable, and I have previously taken English 101 at a community college where I learned so much more and the class was much better. She never responded to my emails or concerns. She is late to class every day and walks in with some crazy excuse. She spends most of class talking about herself, then goes over examples of assignments from previous years, and tells students to gather in groups and do peer review with no guidelines. Every class felt like a waste of time. She needs to get a therapist. She also was rude and insulting. She made fun of my friends appearance once and then laughed it off. She is a bad professor and needs to get her life together.", "rating": 1, "expected_grade": "A-", "created": "2022-05-05T17:53:12Z"}, {"professor": "Lara Payne", "course": "ENGL101S", "review": "She is very understanding when it comes to work load and often extends the deadline. She does not give out 100s, but she will not fail you. Although her work is not entirely easy, it is doable. Much of the class is just talking about different writing techniques and peer editing each other's papers. The class is centered around a big position paper at the end of the semester. At the beginning of the semester, she would remind us on deadlines since she acknowledged that we were still struggling to transition from high school to college. Although I do not enjoy English, she made it tolerable because she understood that we had other classes to deal with. She truly cares about her students and wants them to succeed. She'll remember your topics and gives great feedback and suggestions.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T05:15:28.853207Z"}, {"professor": "Lara Payne", "course": "ENGL101", "review": "Best professor ever. Very lenient and extended the due dates as the class requested. She is very understanding and if you try and show her that you put in effort you will get a good grade. Overall, very good experience, take this class with her.", "rating": 5, "expected_grade": "A", "created": "2023-11-29T00:47:09.978052Z"}, {"professor": "Lara Payne", "course": "ENGL469M", "review": "Professor Payne is a lovely professor! I had her for a poetry class - our class discussions were very relaxed and freeform, but they all felt productive because she's so knowledgable and passionate about the subject! She's an easy grader who cares most of all that you show up and put visible effort into your work. Take her if you want a relaxed, easy, and fairly interesting class.", "rating": 4, "expected_grade": "A+", "created": "2023-11-30T05:27:02.088096Z"}], "name": "Lara Payne", "slug": "payne_lara"}