{"courses": ["ENGL101", "ENGL471", "AASP298L", "ENGL234", "ENGL472", "ENGL101X", "ENGL393", "AASP478K", "AASP478N", "ENGL348B", "ENGL368D", "ENGL393X", "ENGL101X", "CMLT235", "ENGL101X", "ENGL101X", "ENGL391", "ENGL391", "ENGL101X", "ENGL101X"], "average_rating": 4.5, "type": "professor", "reviews": [{"professor": "Laura Williams", "course": "ENGL101X", "review": "The best professor you could have. She was easy in grading and flexible on deadlines. She made the class as easy as it could be. ", "rating": 5, "expected_grade": "B+", "created": "2020-12-08T19:46:12Z"}, {"professor": "Laura Williams", "course": "ENGL101X", "review": "Really flexible teacher with regard to deadlines. You can submit up to 3-4 hours after a deadline and you'll be fine. Although, ENGL101X is a tough course Dr. Williams does her best to help you. I would advise you to go to her office hours to see what is expected in the assignments. Make sure to read her rubric carefully. The average grade in my class with consistent work is about a B+.", "rating": 4, "expected_grade": "B", "created": "2022-12-08T21:36:16.605219Z"}, {"professor": "Laura Williams", "course": "ENGL101X", "review": "Great teacher who actually wants you to succeed in her class. The class is challenging and requires a lot of consistent work but if you ask for help she will not hesitate to guide you through something you don't fully understand. Professor wants you to learn rather than just get a passing grade and she will take the time to teach you.\r\nFlexible deadlines with the possibility of extension (for good reasons) were another great part of her course.", "rating": 5, "expected_grade": "A", "created": "2023-08-28T10:55:23.146108Z"}, {"professor": "Laura Williams", "course": "ENGL101X", "review": "She's a cool professor, but I wasn't too crazy about how she grades stuff. It's kinda tough, and you really gotta put in the work to do well in her class. On the bright side, she's chill about deadlines and gives us a 24-hour grace period for all assignments (except the final), no questions asked. I submitted a few assignments late and I still got full credit.", "rating": 4, "expected_grade": "B+", "created": "2023-12-14T02:39:56.911332Z"}, {"professor": "Laura Williams", "course": "ENGL101X", "review": "I can tell that this class was one of the best classes I took at UMD, and I believe that this is because of Dr. Williams. She teaches the material from the bottom of her heart, she wants all her students to learn and do good in the course. There are five major assignments, and in each one of them, Dr. Williams spends enough time explaining what she expects us to do. \r\nShe grades all assignments fairly and provides constructive feedback. \r\nShe gives us drafting time before submitting each assignment in which we can write our first draft and ask her any questions about it. \r\nHer office hours are very helpful. \r\nShe understands that we have other courses, and she gives extensions if we need. \r\nAll what I can say is that I myself was so afraid of this course, since I am an international student, and English is not my first language, but now I am glad that I took this course with Dr. Williams. I struggled many times, but she was the main reason behind developing and improving my writing. So, if you have to take this course, just take Dr. Williams without any hesitation.\r\n\r\nAs for the workload, it is heavy. This class requires a decent time, like 8-10 hours a week. There are discussion boards, drafts, in-class activities, peer reviews, reflections, and of course the major assignments. But all of them are helpful, and I guarantee you will see an improvement in your writing by the end of the semester. Just do your work, no more, no less.", "rating": 5, "expected_grade": "A", "created": "2023-12-27T00:04:49.185831Z"}, {"professor": "Laura Williams", "course": "ENGL101", "review": "Dr. Williams is a nice teacher, she helps me alot and not very strict to the deadline. But it's hard to get a good grade in her class, I almost spend more time on this class then my professional class, so if you just want to take a gened, go take somebody else. anyway I give her a four star because she is nice.", "rating": 4, "expected_grade": "", "created": "2024-03-27T02:00:43.344438Z"}], "name": "Laura Williams", "slug": "williams_laura"}