{"courses": ["MUET200", "MUSC215", "MUSC215", "MUSC215", "MUSC215", "MUSC215", "MUSC215", "MUSC215"], "average_rating": 3.9583, "type": "professor", "reviews": [{"professor": "Laura Schnitker", "course": "MUSC215", "review": "Very good professor. Really tries to make lectures interesting. Only issue was papers that she assigned but would still definitely recommend for a good elective class.", "rating": 5, "expected_grade": "A-", "created": "2019-12-10T19:15:55Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "Dr. Schnitker is a very nice, understanding, and helpful teacher. Her lectures go by fast, but are interesting to know and learn. Weekly readings/videos are brief and interesting. There are weekly quizzes based off the readings/videos, but she sends an announcement every week as to what to look for when reading/watching that will be relevant for the quizzes. There are 2 major papers and 2 exams, but all are very fair and straighforward as long as you put in the work.\r\n\r\nShe is very accommodating if you have an issue, so if you talk to her and explain the situation, she will help you. ", "rating": 5, "expected_grade": "A", "created": "2020-05-26T22:27:46Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "One of the best professors and classes at Maryland! If you're interested in music history, take this class. The material and lectures are engaging.", "rating": 5, "expected_grade": "A", "created": "2020-09-13T12:12:00Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "I took this class online. I had no interactions with the professor because her Lectures were-pre-recorded and most of the grading was done by the TA’s. Her TA’s are TERRIBLE. They grade papers harshly and barely communicate with you when you need help with clarifying directions. As an online class...I wouldn’t take it. It seems like an easy A but its not. There’s two papers that will either make or break your grade. Two exams that if you pass barely increases your grade but if you do bad, will drastically decrease your grade. There’s a quiz and weekly discussion per week.", "rating": 4, "expected_grade": "B-", "created": "2020-12-20T21:01:05Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "Schnitker is a decent professor and the lectures are pretty interesting, but I would only take it if you know you already enjoy the topic. This class was so much more work than it was worth. Literally only got good grades on the 2 papers because I spent an insane amount of time on them. They legitimately seem to think that everyone in the class is a music major or wants to research ethnomusicology with how harshly they grade. The exams were open note, but you definitely need to watch the lectures and take good notes for that to actually help.", "rating": 3, "expected_grade": "A", "created": "2021-01-12T04:17:00Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "I barely interacted with Schnitker because I took this course online, however, this class is so frustrating to take as a non-music major. I took this course to fill a gen ed requirement but it has literally ended up being my worst grade. You'll only get decent grades on the papers if you spend hours on them, and even if you do super well on the exams, it barely helps your grade. The TAs are the WORST, they grade you so harshly- I was excited to take this class at first and learn about the course material but over time it just became more frustrating and annoying more than anything else.", "rating": 3, "expected_grade": "C", "created": "2021-04-19T19:00:41Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "She's so nice. This class was a bit much for a gen ed. The two papers are worth a lot, and they take some time to write. On one hand, this class is nice because you only have to put real effort in for a few weeks here and there. I think it would be a lot more frustrating to take in person than it was to take online. Not the easiest gened, but by far not the worst. As far as a professor goes, Dr. Schnitker is grear. Very considerate and approachable. One thing that bothered me is that the A/A- cutoff in the syllabus was a 94. ", "rating": 4, "expected_grade": "A+", "created": "2021-05-20T00:39:32Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "She is a wonderful lecturer. I don't understand the reviews on here. Her TA's were great, and discussions were fun to go to. While the essays were definitely a bit much for a GenEd, they were only tedious, not hard. Great class, interesting topics.", "rating": 5, "expected_grade": "A+", "created": "2021-12-14T23:56:41Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "Engaging professor, fun class. Very minimal effort required most weeks, the only real work I needed to do was for the two papers and reviewing for each exam. If you have decent-to-solid essay-writing skills and are capable of following a rubric, you will do fine on papers. The time I spent on them was reasonable and I found them pretty straightforward. Some found grading to be slightly harsh but I thought my TA was more than fair. Favorite class I've taken at UMD so far. Would absolutely recommend!", "rating": 5, "expected_grade": "A+", "created": "2022-04-21T16:27:23Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "she is very passionate about her teaching. She is super engaging. She makes the class very very fun.\r\n\r\nthe class itself has a few papers and short quizzes each week that she basically gives us the answers for. I highly recommend", "rating": 5, "expected_grade": "", "created": "2022-05-11T19:40:56Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "The lectures are very fun and engaging but for the course (MUSC215), it is very demanding to be a GenEd. You have to attend a live performance and write a paper on it. In the whole semester, you write two papers and have quizzes every week along with a mid term and final.", "rating": 2, "expected_grade": "B-", "created": "2022-12-05T21:57:26.539479Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "Very organized and intentional about her teaching which is very much appreciated. Content is interesting if you like music. This course has weekly quizzes given in discussion based on a short article or video, a midterm and final exam, and two papers. I found that everything was very manageable/easy/fairly graded.", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T13:47:25.966411Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "Dr. Schnitker was amazing. She is straightforward, well-spoken, prepared, flexible, and aware of her students’ needs. The workload for this course was much lighter than I’d anticipated; most weeks, the time I spent on this course was <20 minutes outside of class. \r\nDiscussions were fun, my TA was absolutely amazing, and the papers were straightforward. Thoroughly covering everything in the rubrics for the papers was the key.\r\nThe exams were super basic. Write down everything Dr. Schnitker says in class (especially the things the pauses before saying, or repeats multiple times), then fill out the study guide based on those notes. Do this, and you’ll be golden.", "rating": 5, "expected_grade": "A+", "created": "2022-12-29T04:54:54.590200Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "Very good lecturer was engaging. This was my only class that I reliably showed up to and wanted to go to. Topics in the class are really interesting. She's a great professor highly recommend", "rating": 5, "expected_grade": "A-", "created": "2023-01-04T01:31:26.041718Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "Although the professor is great and passionate about her class, this GenEd is way too demanding. There were two papers, the first was 3 full pages and the second was 6 full pages. WAY TOO MUCH. We had two exams and I got a D on both of them. I spent over 5 hours studying for the second exam and still got a bad grade. MUSC215 was my lowest grade out of all my classes this semester. This GenEd is way too much, especially for non-music majors.", "rating": 2, "expected_grade": "B-", "created": "2023-01-22T00:29:44.940887Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "Lecture was interesting because of both the material and the professor, and the weekly workload for this class was no more than 15 minutes. The only substantial work was 2 papers (neither was that bad) and the exams, which were easy to study for if you took notes in class.", "rating": 5, "expected_grade": "A", "created": "2023-05-02T18:54:35.590882Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "I really liked this class. Dr. Schnitker was entertaining and she definitely wants you to actually learn something from her class. She had lots of examples of songs about the topic of the lecture for the day, and the \"quizzes\" were literally just 5 multiple choice questions once a week, and they were really easy. \"Studying\" for them just required you to watch a video or read a short article and know the answers to the questions she put for them. Took at MOST 30 minutes. I will say that it's not an \"easy A\" because of the two exams and 2 papers, but as long as you try, you should be fine. Grading on the papers can be a little harsh, but it probably depends on your TA.", "rating": 5, "expected_grade": "A-", "created": "2023-05-08T23:35:02.756024Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "Cool GenEd but way too demanding. There are 2 papers in this class worth 100pts each, 2 exams worth 50pts each, along with weekly quizzes, and participation grade based on weekly discussion. The first paper is a music video analysis and the 2nd is an analysis of a performance that you go to. These are graded pretty harshly depending on how obsessed your TA is. My only reason for 2 stars is because the material was pretty cool and the professor made it easy to comprehend. With that being said i thought it was much easier to get an A in Calc 1 than this class.", "rating": 2, "expected_grade": "B+", "created": "2023-05-17T17:44:24.944033Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "THE ABSOLUTE WORST. The worst professor and ineffective TAs that honestly don't know what they are talking about in terms of grading. AVOID THIS CLASS AT ALL COSTS. It is far too much work for an elective, and you will crumble trying to hyper-analyze all that she/the TAs are looking for. I even showed the assignments, my work, and her grades to another college music professor and she couldn't believe the grades I received. Again, in case you missed my point.. DO NOT TAKE THIS CLASS UNDER ANY CIRCUMSTANCES.", "rating": 1, "expected_grade": "B+", "created": "2023-07-05T21:09:37.034524Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "Absolutely ridiculous content for a GenEd at this level. Horrible TAs who deliver grades late, and with no explanation. 0/5 stars if I could. Do not recommend at all.", "rating": 1, "expected_grade": "B+", "created": "2023-07-07T16:49:21.367512Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "I loved this professor so much! i will say as a GenEd it is a bit of a workload, but I honestly enjoyed the work and did not find it annoying or that bad. you had to write 2 papers, one on a music video of your choosing and one on a concert you attended. there was more that went into it but i overall enjoyed the prompts a lot and wrote about what i liked. the lectures are not mandatory and she does not take attendance, but i enjoyed the class so much that i actually went to the lectures, she kept them fun and engaging and she was really funny. the exams are not open note but theyre fairly easy. there are also small reading quizzes during discussion each week but she gives you the questions that will be on them to study. definitely my favorite or one of my favorite professors ive had, def recommend her class!", "rating": 5, "expected_grade": "A-", "created": "2023-11-28T16:46:51.083400Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "I am a STEM student, and taking this class I found it to be a nice breather between more intense courses. This course is like a history and music class mixed, so if you don't like learning some history - this class is not for you. Dr. Schnittker has so many interesting stories about all of these genres, and the class is engaging. She will tell you exactly what you need to study for the exams, and even makes a playlist for the audio-related questions. You do have discussion once a week where you take a 5 point quiz, but some of them are open note! I think we had 11-12 total and more than half were open note. Overall, I enjoyed this class because I found the content interesting and the course load not too bad (2 papers - double spaced, 2 exams - including the final, weekly 5 point quizzes).", "rating": 4, "expected_grade": "A-", "created": "2023-12-17T20:51:52.291609Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "This class was fantastic and I actually learned so much. The workload is completely normal for a 200-level class and not bad at all, I'm not really sure what other people here are talking about. An A is totally doable if you just follow the rubrics - she's very clear on what she expects from the exams and essays. Dr. Schnitker is so intelligent and clearly loves what she teaches, she was absolutely wonderful. She's super passionate and the lectures are honestly really interesting. Doesn't take attendance but the course was so much fun that I went anyway! My TA sessions were kind of a drag but I think it just depends on the vibe of your class. Absolutely recommend if you like music even a little bit.", "rating": 5, "expected_grade": "A", "created": "2023-12-27T05:11:58.165719Z"}, {"professor": "Laura Schnitker", "course": "MUSC215", "review": "The class itself was fun, one of the few lectures I actually enjoyed. The amount of work and effort however was not as fun. Weekly quizzes, 2 essays, and a midterm and final. The first essay was super unclear of what couldnt be used and I ended up having to redo it with an automatic 30 points taken off even though on the rubric it would only subtract 20. The exams require you to memorize songs with the artists as well as MC questions. They werent too hard as long as you studied for it I ended up getting a 90 in the class despite doing bad on an essay and midterm.", "rating": 4, "expected_grade": "A-", "created": "2024-02-21T09:27:40.966243Z"}], "name": "Laura Schnitker", "slug": "schnitker"}