{"courses": ["HEIP241", "HEIP240", "BMGT289A", "BUSO712", "BMGT461M", "BMGT461", "BMGT461M", "BMGT289A", "BMGT461", "BMGT461M", "BMGT468R", "BUSO712", "CHSE338K", "ENES338K", "BMGT461", "BMGT461M", "BUSI758N", "BUSO712", "ENES338K", "CHSE338K", "BMGT461", "BMGT468R", "ENES138", "ENES498R", "BMGT461", "BMGT461M", "ENES138", "BMGT461", "BMGT468R", "ENES498R"], "average_rating": 1.9167, "type": "professor", "reviews": [{"professor": "Le-Marie Thompson", "course": "BMGT289A", "review": "This is a uniquely styled course, and a lot of students felt uncomfortable in it. It is an I-series about social enterprises; therefore, it makes sense that the teaching approach is unusual. However, a lot of the students did not understand it and got quickly frustrated and disrespectful. Professor White was unable to retain respect from the students and failed to provide unique knowledge on the subject. Almost every class there was a different and interesting social entrepreneur. There was a lot of group projects. However, Professor Thompson did not lecture much or provide much thought-provoking insight. The grading was incredibly easy and this class has no stress, as long as you accept it is unorthodox.", "rating": 3, "expected_grade": "A", "created": "2018-01-02T00:13:14Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT289A", "review": "An A is easy enough to get, but it's a lot more work than other Gen-Eds. Ms. Thompson doesn't put any length minimums on papers, but instead puts a maximum page length.  She's clearly passionate about social entrepreneurship, but sometimes it felt like a workshop rather than a class. Expect a weekly writing and a ton of group projects/presentations. Lectures aren't mandatory. She does bring in a lot of guest speakers (probably one every week) from various businesses in DC, so the class is a good way to network. ", "rating": 3, "expected_grade": "A", "created": "2018-05-03T22:52:09Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT289A", "review": "This class is fairly easy if you put in the work. The assignments are all posted on canvas at the beginning of the semester so you know exactly what is due. However, the instructions are vague for many assignments. Like others have said, this was the only class in which I encountered a maximum page count for papers. In a way, it helped me to write straight to the point without any fluff at the expense of in depth analysis (a catch-22 since you need to explain your reasoning but have limited space to do so). Otherwise, there is a semester long group project. Your performance on this will depend entirely on the quality of your group and your chosen topic. Be sure to delegate tasks. Thompson also invites entrepreneurs from around DC to come present, which I found to be insightful. Overall, just do your work (ahead of deadlines if you can), and you will be fine. ", "rating": 3, "expected_grade": "A", "created": "2020-01-25T02:11:32Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT461", "review": "Professor Thompson is one of the least organized professors I've ever had. She has her TAs do all of the grading and her syllabus and course schedule are copied from a different Professor. Her ELMS page makes no sense and the grading system in this course is IMPOSSIBLE to follow. You essentially have no idea how you're doing the entire time and then you're graded based on how well others do. \r\n\r\nHer assignments are extremely confusing (the rubric almost never matches up with the assignment description) so it is so tricky to follow. And when you ask her a question in class, she seems like she has no idea what is going on. If you can avoid this class, AVOID IT! It is way too unconventional and I am not learning anything more than I would watching an episode of Shark Tank. If you have to take this course for the minor, do everything you can to have a different Professor. Seriously the worst class I've taken at UMD. ", "rating": 1, "expected_grade": "", "created": "2022-04-07T17:18:13Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT461", "review": "She teaches an interesting course in entrepreneurship yet completely ruins it by putting so many unnecessary assignments with descriptions and rubrics that don't align. The goal of the class is to make the most money with your entrepreneurial venture yet you have to make presentations each week and do readings, taking time away from making sales. All of our ventures are in predetermined and it's very hard to come up with something within days and try and make money with it in 10 weeks. Overall, avoid taking this class with her!", "rating": 2, "expected_grade": "B+", "created": "2022-05-11T16:37:23Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT289A", "review": "DO NOT TAKE THIS CLASS (with Thompson). It's a major time waste for a class that is completely not needed for you. Spent approximately 5-10 hours a week with my group trying to figure out how to do our outrageous group assignments that ask way too much of us with such little guidance. She also is completely unorganized with her elms and all of the assignments. This genuinely has been the first class in college that I have found to be ridiculous and very stressful.\r\nShe gives harsh feedback and expects you to really create an entire and uniformly correct business model with your group with zero flaws while providing zero help or guidance on how to do it. \r\nStill think i'm gonna finish with an A, but not worth it, stay away from this class with her specifically.", "rating": 1, "expected_grade": "A", "created": "2022-11-07T22:03:34.545600Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT289A", "review": "For the love of any god you hold dear do not take this class. This was the biggest waste of time that was doing quite literally the most with bulk work and made me want to tear my brain of my skull. Professor Thompson does not accommodate at all to completely valid circumstances, like having group mates who do not contribute at all to your projects. This class is extremely group based so if you don't get a good group, or dont get same number of group mates as other groups, enjoy doubling your workload for an already massive amount of assignments. If you have Thompson, drop the class and do yourself a favor.", "rating": 1, "expected_grade": "A", "created": "2022-12-24T22:10:41.649878Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT289A", "review": "this class was the cause of most of my stress. since the class is almost entirely group based, a bad group or with less than 5 people will screw you over. Thompson is very passionate and she brought pretty cool guest speakers and gave us opportunity to really grow our ideas if we wanted to and network, but most of the class was really taking it for a gen ed and it was way too much work. weekly written group project proposals (~5 pages), weekly personal reflection essay, and other assignments here and there. the instructions on many were vague and most assignments are weighted 1-5 pts so even losing 1 pt made a difference.", "rating": 2, "expected_grade": "A", "created": "2023-05-04T21:00:22.648776Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT461", "review": "Lots of useless assignments, rubrics don't match assignment descriptions, professor never provides an accurate answer if you ask her a question. Overall horrible class I recommend to stay away from it if you can. You'd be better off geadornesuddy :/", "rating": 1, "expected_grade": "B", "created": "2023-05-06T03:23:52.017261Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT461", "review": "She is a terrible professor. Seriously take my review seriously I saw these reviews and took this class anyways. It is WAY more work than you anticipate. If you want an A expect to work 10-15 hours a week on this class. You not only are responsible for mind numbing stupid assignments that take too much time. You have to quite literally run a business from scratch with no help or assistance. You basically are told sink or swim and if you sink thats your problem. I only got an A in this class because I worked my ass off. Do NOT take this class if you can", "rating": 1, "expected_grade": "A", "created": "2023-05-10T15:57:28.749071Z"}, {"professor": "Le-Marie Thompson", "course": "ENES338K", "review": "Took her for ENES138, the one-credit engineering inclusion and equity class. There were only a few graded assignments -- three two-page \"journals\" and a final paper. The grading on these assignments was strict for a one-credit elective, but as long as you connect course concepts into your writing, the class will be an easy A. The content itself could be boring at times, but I definitely learned some interesting things about engineering ethics, the professors, and the classmates!", "rating": 4, "expected_grade": "A", "created": "2024-01-15T21:46:06.430684Z"}, {"professor": "Le-Marie Thompson", "course": "ENES138", "review": "Avoid her and this course at all costs. I enrolled in this just to quicky satisfy a DVCC requirement (it's only half a semester long), and I am struggling to get full points on any of the open-ended journal assignments. She grades extremely critically and her feedback solely consists of asking you to \"dive deeper\" and other extremely abstract advice.  Even though it's only half a semester long, be prepared for this course to be extremely annoying. Le-Marie Thompson sucks, hope to never run into her again while I'm a student here.", "rating": 1, "expected_grade": "A-", "created": "2024-03-12T19:30:00.916151Z"}], "name": "Le-Marie Thompson", "slug": "thompson_le-marie"}