{"courses": ["CHEM131", "CHEM132", "CHEM132C", "CHEM132S", "CHEM135", "CHEM177", "CHEM231", "CHEM131S", "CHEM241", "CHEM242", "CHEM232", "CHEM132V", "CHEM134", "CHEM231", "CHEM231", "CHEM231", "CHEM231", "CHEM232", "CHEM231", "CHEM241", "CHEM131", "CHEM231", "CHEM131", "CHEM231"], "average_rating": 3.6064, "type": "professor", "reviews": [{"professor": "Lenea Stocker", "course": "CHEM131", "review": "Amazing professor. She's super nice, teaches material well, and cares about her students. Go to office hours and look at past exams and you'll be set. Also DO HER PROBLEM SETS!!!!", "rating": 5, "expected_grade": "A", "created": "2018-08-14T18:52:03Z"}, {"professor": "Lenea Stocker", "course": "CHEM131", "review": "Love her! One of the best chem teachers I have ever had. Chem is hard so the class is still difficult but she makes it bearable", "rating": 5, "expected_grade": "A", "created": "2018-11-20T17:09:59Z"}, {"professor": "Lenea Stocker", "course": null, "review": "Good professor.", "rating": 3, "expected_grade": "", "created": "2019-01-28T00:04:54Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Fantastic at teaching, I'm just bad at Orgo. She's a great professor, and has interesting ways at explaining complex subjects. There's not too much out-of-class work, so long as you understand what's going on. Her tests are Time Dependent, as in; You WILL run out of time. The Final wasn't time restricted, however, so less stress there.", "rating": 5, "expected_grade": "C-", "created": "2019-05-18T02:46:20Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "If you can, you should take her class. She's a bit old-school since she generally hates technology (and she sends everything out by email, as opposed to uploading things to ELMS), but she's a fantastic lecturer and has a nice personality. The class is all memorization (even though she claims otherwise), which can be time-consuming. The only thing I disliked as the use of clicker questions, as I would have preferred quizzes or simply no in-class assignments at all. Her TA's are pretty good too, and the grading is very fair. Although I would have liked an A in the class, I can admit I did not study the reactions well enough to deserve it.", "rating": 4, "expected_grade": "A-", "created": "2019-12-19T07:05:02Z"}, {"professor": "Lenea Stocker", "course": null, "review": "Stocker does cover less material than the other orgo professors, which helps if you're just looking to pass. But you're going to have to go to office hours frequently to ask her for exam answers, which she didn't post online during this semester. That meant there were 20-30 students in her online office hours at a time asking for exam answers, when time could have been same by distributing the keys. Now, Orgo is a hard class, and you'll have to put a lot of effort into it regardless. But I just didn't have a great experience in her class.", "rating": 3, "expected_grade": "A", "created": "2020-05-21T23:35:58Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Dr. Stocker is great at teaching and is super nice. The best way to do well in this class is to keep up with the material and not let yourself fall behind. There's a lot of content in this class, but if you go through it slowly, it's much more manageable. ", "rating": 5, "expected_grade": "A", "created": "2020-06-08T21:27:12Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Pros: Genuinely covers less material. Lectures are not hard to follow. Will help you in office hours.\r\nCons: Refuses to post practice exams, you have to go to her office and take pictures of them. Doesn't post exam solutions, you have to go to her office hours for those. What is the point of practice exams without answers? Her office hours tend to be crowded so it's hard to ask questions. Doesn't follow the book - she is practically the only official source in her class.\r\n\r\nOverall a good professor if you just want to get by. Getting an A will be a lot harder due to lack of professorial support.", "rating": 3, "expected_grade": "", "created": "2020-08-11T01:23:06Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Great lecturer and makes class engaging. When we moved online her video lectures were super thorough and helpful. You have to keep up to the material and study everyday to do well, especially if you're not an O chem person. A lot of people in this class were the super smart people so there was not much of a curve. Take Dixon if you want a bigger curve and have a friend in Stocker send you her video lectures. ", "rating": 5, "expected_grade": "", "created": "2020-08-16T03:25:12Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Dr. Stocker seems like a great person, but this class just wasn't it. Maybe it was the fact that it was online, or maybe just this course in general, but this class sucked. The tests were horrible, and that was pretty much all that was graded. There was no partial credit, and they were harder than anything we saw in lecture or in problem sets.", "rating": 2, "expected_grade": "B", "created": "2020-11-19T02:29:59Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "-10/10 made me cry many times ", "rating": 1, "expected_grade": "", "created": "2020-12-03T02:21:59Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Though I understand during this pandemic things are tough and circumstances are hard she has not adjusted to the online environment and being understanding to her students by any means. She has 800 students, which should have never happened, but access to resources is unavailable, she explicitly states to not email her concerning questions.  Her tests are extremely hard and she gives us a time limit where answering all the questions is essentially unachievable. She does not release the answers to her practice exams, which I get, there are numerous professors that do that, however, her practice exams are nothing like the ones we take. She will make corrections to the test and change the numbers of a question within the last 20 minutes and will only notify through email, so good luck making the corrections. She has redone her tests but not given us the resources to study for them. GSS sessions all have over 50 students in them and aren't effective in helping everyone's situations, in fact, the last GSS session I went to had 169 students. This being said her lectures are not bad, she covers examples and material and is fairly thorough.", "rating": 2, "expected_grade": "C-", "created": "2020-12-03T03:00:33Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "While her lecture videos are easily understandable and clearly explain concepts, her exams are infinitely more difficult. It seems like she is more concerned about making sure that cheaters won't be able to succeed that she hurts honest students too. All the exams have been impossible to finish due to lack of time. It seems like if you don't intrinsically know the answer to all the problems and actually have to think them through, it is impossible to finish within the 50 minutes given for the exam.\r\nIt is also extremely hard to contact her as all her classes are asynchronous and her office hours can fall during some of your other classes.", "rating": 1, "expected_grade": "D", "created": "2020-12-05T18:39:41Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "People love to hate on her because the course is difficult but really that should be expected for any chem class. She puts a lot of emphasis on speed so I advise practicing problems sets with a time limit so you get used to rushing through problems and picking out important information. Go into exams with a plan for what order to complete problems to get as many points as you can, you will run out of time so plan for that. GO TO OFFICE HOURS. She gives more exam level questions at office hours. Even if you don't have a question just go and listen and learn. She's not typically available via email which can be frustrating since she has limited office hours. In that regard I suggest relying on the GSS sessions or your TA. \r\n\r\nOverall not the greatest teacher but if you put in the work it is possible to do well in the class. ", "rating": 3, "expected_grade": "A-", "created": "2020-12-08T16:40:57Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "EVIL. Created a cheating trap that could easily be triggered by miscounting a carbon or remembering a formula commonly used in the homework. she accused 152 students of cheating on exam 2 in fall 2020, causing a ton of stress for students right around the time of final exams.", "rating": 1, "expected_grade": "B", "created": "2020-12-12T17:12:52Z"}, {"professor": "Lenea Stocker", "course": "CHEM132", "review": "Pros: One of the easier STEM labs you'll take. I'm not saying it's easy, but in comparison to other poop courses, it is. The exams are manageable and fair if you study and review your notes.\r\nCons: A lot of work. ", "rating": 4, "expected_grade": "A-", "created": "2020-12-15T19:09:02Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "She's very nice and very straightforward in lectures, which were usually not hard to follow. Always emphasizes the most important material making it easier to study for exams. The exams were definitely tough but fair, and she always gives a generous curve. She's also lenient with make-up exams when necessary.", "rating": 5, "expected_grade": "", "created": "2020-12-20T18:06:13Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Had her for fall 2020. Goes way too far to catch cheaters and is very happy to make accusations. No trust between her and students, and created a terrible environment. Only reason she gets two stars and not one is because she is an average at best lecturer.", "rating": 2, "expected_grade": "B", "created": "2021-01-06T02:54:47Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "*class was fully online due to covid*\r\nThis class was a mess, and you're probably seeing a lot of conflicting reviews, so i'm going to do my best to explain everything.\r\nTl;dr- Dr. Stocker was dealt a bad hand by the university, but the way she handled the circumstances made it actively worse for her students this semester.\r\nThe circumstances: 800+ students, 4 TAs, 1 professor. Dr. Stocker got stuck teaching every single one of the 21 sections of chem 135 offered fall 2020. As a result, it was nearly impossible to get individual help from her or the TAs, leaving many students to turn (unsuccessfully) to GSS. Dr. Stocker also all but banned students from emailing her directly, which seems harsh at first, but after reading so many stupid questions in the groupmes from people who were just oblivious to the syllabus or her emails, seems fair. Also as a result of all the sections, Dr. Stocker released lectures MWF (even for people who signed up for TuTh sections, but it was pre recorded, so whatever), and the TAs moved their discussion times.\r\nTeaching style: The lectures themselves were pretty good. All were pre recorded and uploaded to panopto, and she tended to stick within the 50 minute time frame. They could be a bit boring at times, and a bit heavy on organic chemistry (she wants to be an orgo teacher, and it shows), but overall better than what you'd expect considering the rest of the class. The discussions were lowkey useless, and I started skipping pretty early on. Dr. Stocker also released practice sets for every topic. DO THEM!!!\r\nGrading: The chem department likes to give impossible tests and then a crazy curve, and Stocker is no exception. My 82% turned into an A. Unfortunately, info about the curve is very poorly communicated. She doesn't release estimates of final grade cutoffs. After each exam, she releases 2 sample grade cutoffs. One tells you an estimated letter grade of the exam you just took, based on points. These give students the illusion of hope, since exam grades tend to have means around 50-60%, but since only the overall grade is curved, these are functionally useless. The other set of grade cutoffs tells you your estimated letter grade in the class as of that exam. For some reason, she makes you manually add up points on just some assignments, instead of just using the percentages that elms auto generates. It's just annoying.\r\nExams: Since Stocker had 800 students, she couldn't manually grade exams. Instead, she used the quiz feature on elms to give exams that were all multiple choice/drop down/check all/etc. Anything that could auto grade. This meant you got your grade instantly, but there was no partial credit. All exams were on an insane time crunch designed to make the averages low. Exams were given at 7 PM EST, regardless of section, unless you had another class at that time. She didn't proctor the exams (too many students for zoom), which led to more creative (read: annoying) ways to catch cheating.\r\nThe cheating allegations: THIS IS WHAT BROKE THE CLASS!!! Exam 2 had 2 bait questions, where she gave a real chemical name, but changed the formula. This was designed to catch students googling answers. Unfortunately, a tiny mistake on the math and/or a miscount could get you the same answer as google. Every student who got the google answer was reported to OSC for cheating, and their cases were still being processed even after finals. All in all, 152 students got accused of cheating. ONE HUNDRED AND FIFTY TWO now facing an XF. WTF\r\n", "rating": 2, "expected_grade": "A", "created": "2021-01-06T02:57:15Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Had her for CHEM135 online, fall 2020. As many others have said, this class was a mess. It's not her fault that they gave her every section, forcing the lectures to be asynchronous, but it is her fault that the class was extremely disorganized, the tests were impossible, and she was very unsympathetic to the difficult nature of this semester. I choose to give her the benefit of the doubt that she's a good person who was overwhelmed by an insane amount of responsibility, but I can't recommend taking her class.", "rating": 1, "expected_grade": "B", "created": "2021-01-12T03:02:28Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Dr. Stocker is a good lecturer and helps when you ask questions. Office hours are helpful to go to. As for her teaching style, there are not really resources you can use outside her class since she just picks her own topic order. \r\nI gave her 4 stars because I think future classes with her will be better off (where she does not have 800 students). As a professor, she explains concepts well and gives practice problems that reflect the test. You need to work on the problem sets she sends out they are one of the best ways to prepare for tests. \r\nThere were a lot of issues for Fall 2020 that made the class more difficult as a lot of other reviews say but Chem135 is also designed to be a rough class. \r\n", "rating": 4, "expected_grade": "B", "created": "2021-01-19T05:01:24Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "For fall 2020 I took this. The first thing I'd say was she is a fantastic lecturer, honestly one of the best I've seen. She explains concepts very well and teaches everything you need to know, I didn't look in the textbook a single time. I just watched the lectures and did the practice worksheets, and I felt like I understood all the material.\r\n\r\nMy main problem with the class was the organization. Every discussion session was moved from whatever you signed up with, ie my section discussion was suppose to be on Wednesday, but they decided to hold it on Monday. The lectures were all just posted videos as well, but that didn't bother me too much.\r\n\r\nThe exams were difficult, but if you knew the material you'd do well after the generous curve, AVERAGE test score was around a 60%. They were made short on time purposely but open book so that if you had to go looking for every answer, you'd run out of time quickly.", "rating": 4, "expected_grade": "B", "created": "2021-01-20T00:46:10Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Dr. Stocker is a very good lecturer and her class material was very good given the circumstances. But those exams and the weight of said exams were utter B.S. Those exams were universally struggled upon, with averages being around 55% overall.", "rating": 2, "expected_grade": "C-", "created": "2021-01-28T00:16:50Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "CHEM135 Fall 2020. Professor Stocker did a really good job teaching this class and I know that a lot of students are salty bc it was an open-note class, but the exams were pretty much fine if you actually paid attention, took notes, and studied. She was a good lecturer and the concepts were really well taught, plus she does a lot of practice problems.", "rating": 5, "expected_grade": "A", "created": "2021-01-28T22:47:11Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Great professor, another perspective on her cheating \"trap\"- it wasn't really a trap. There were questions that have a chemical name, and where you can google the name to get the formula for the chemical. There was no chance that you could get the answer that you can find on google, as the correct answer with the different constants that she provided you with. And with almost 20% of the class getting caught, it's pretty clear that it wasn't \"by chance\" that they all made the same error and magically got the googled answer. Her lectures, though asynchronous, were well made, and released usually well ahead of time so we can get started on the lectures early. They were clear, provided many examples, and organized. Her exams on the other hand was definitely a bit more difficult, however your grade is relative to the other people in the class. If everyone were to get around a 20/100 on the test, around 25% or whatever % of students would get an A in the class. If everyone were to get around a 95/100, the same 25% would get an A. I personally did not get an A in the class because I honestly did not put as much effort into the class as I would have liked, but the majority of these people here (as seen in the groupme), are complaining about their grades even though they put minimal effort in the class. (didn't proofread, may have grammar mistakes)", "rating": 5, "expected_grade": "B", "created": "2021-02-06T01:39:32Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "I took this in fall 2020, it was alright at best. I can only say it was alright in hindsight because all the curves landed me an A. My biggest piece of advice is to keep up with the lectures as they're uploaded, do not put them off in any capacity if at all possible. As for the content of the lectures? She's great at explaining concepts, but none of that matters when you take her exams. She is good at explaining things, that does NOT mean she is a good professor. A good professor would prepare you for the exam content. Instead, stocker talks about organic chemistry for 15 minutes of the lecture, and the actual thing being tested for the other 10. Did a lot of people cheat? Yes, undeniably. Was Stockers method of baiting cheaters annoying? Yes, undeniably.\r\nAvoid her if at all possible, if not, just try your best, most students struggle in this class.", "rating": 2, "expected_grade": "A", "created": "2021-02-16T04:33:19Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "This class was the worst. Stocker's lectures were hard to understand and often did not give her students the full picture of what she was trying to explain. Some of the content she covered in her class was not meant for an entry-level chemistry class, which only made the class more stressful. On top of all that, her problem sets were nowhere near as challenging as the exam questions were. The exams were strenuous and ridiculously complicated, as she often made the questions multiple parts and did not provide enough time to adequately complete all the problems. She also tried to set trap problems to catch people who were cheating on her test, and ended up falsely accusing a lot of people of cheating. Unless you absolutely have to take this class, I would recommend getting a tutor or attending as many GSS sessions as possible, because just attending lectures alone will not be enough to pass. ", "rating": 1, "expected_grade": "", "created": "2021-03-04T20:58:57Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Dr. Stocker was a really great lecturer. I had her fall 2020, and all of our lectures were asynchronous but very helpful. She also provided lots of examples and opportunities to practice the material which lined up fairly well with exam material. Her midterms were brutal, with averages of about 60%, but the final was actually really easy. The curve is super nice, so it's easier to snag an A than you might expect. You do need to put in the work to get an A though. Again, her midterms are brutal.", "rating": 5, "expected_grade": "A", "created": "2021-03-24T01:14:05Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Lenea had an attitude from the start. She shuts down students and instills a sense of fear into them. The class was very uncomfortable, to say. She definitely has her intentions. Also, exams are NUTS and extremely difficult.", "rating": 2, "expected_grade": "B-", "created": "2021-04-02T03:35:01Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Dr. Stocker is a really great professor. She does a really good job at explaining concepts clearly and her exams are difficult but not impossible, CHEM135 is just a lot of material so there's a lot to memorize and understand. She also gives a lot of really good material to study for the exam; many worksheets and practice exams. If you put the work in to understand the concepts and study before the exam, you can get an A, but 135 is a weed out class for engineers and covers a lot b/c it's the only chem class a lot of engineers have to take, it's not her fault there's so much to teach.", "rating": 5, "expected_grade": "A", "created": "2021-04-20T18:42:02Z"}, {"professor": "Lenea Stocker", "course": "CHEM134", "review": "-Her class was completely asynchronous (because of her child). \r\n-So learning a HUGE load of material was hard. Although at first the amount of work seems okay, it is a lot more and very much difficult for a 1 credit course. \r\n-The quizzes too were either above average hard or just straight up hard. She does give a curve I believe so wouldn't completely say this is her downfall. \r\n-Also, she only had 1 office hours. This was also annoying as it was during my calc discussion class so could never ask for help on the new material she taught.\r\n-She has a strict work/exam policy. She apparently reported  a bunch of people last semester for cheating so be aware she takes it serious and like will accuse you if she thinks even a sliver that you cheated.\r\n-She seems nice (literally talked to her once) and will go over stuff you don't understand in office hours \r\n\r\nIf you only took CHEM131 last semester and now have to take 134, I'm sorry. Probably should've taken 135 even though I haven't heard great things about that class either. But she's okay, definitely not a top professor but just okay", "rating": 3, "expected_grade": "A", "created": "2021-04-29T20:57:19Z"}, {"professor": "Lenea Stocker", "course": "CHEM132V", "review": "-lab videos were confusing and inaccurate\r\n-pre quizzes didn't match material\r\n-didn't respond to emails and when she did respond, she was condescending \r\n-didn't prep the TAs\r\n-no study session or practice questions for final (setting us up to fail) \r\n-way too much work for 1 credit class\r\n-paranoid of cheating (took it out on current students) ", "rating": 1, "expected_grade": "", "created": "2021-05-11T03:05:37Z"}, {"professor": "Lenea Stocker", "course": "CHEM132V", "review": "Asynchronous class.\r\nPROFESSOR:\r\nTo be honest, not even sure what her involvement with the class was. TAs graded everything. Lab videos were recorded last year by another professor.  I'm not even sure what her voice sounds like. Is incredibly strict and encourages TAs to be quick to take points. Seems completely unconcerned with whether or not you learn anything in her class.\r\n\r\nLABS:\r\nTook anywhere from 5-10 hours per week to complete and the prelabs took 2 hours. So 7-12 hours total per week on labs despite this being a 1 credit course. Also it might as well have been written in another language because of how mind-numbingly confusing it was. The lab book had multiple scientific errors in every experiment and was incredibly tedious. I had no clue what I was supposed to be learning and basically just winged every single question. So I was hopelessly confused when submitting the labs but was just glad that it was finally over for that brief moment. For one lab, they just had us write out dozens of chemical equations for a few hours. Also the lab videos had tons of mistakes, like for one experiment they just spill chemicals all over, completely confounding the results. They don't tell you why your explanations were wrong so learning is minimized.\r\n\r\nEXAM:\r\nThere is only one exam (the final) and she does not give partial credit. She did not provide us with any material to use to study for it and did not even get 2 of our labs back to us before we took the exam. ", "rating": 1, "expected_grade": "", "created": "2021-05-18T18:49:06Z"}, {"professor": "Lenea Stocker", "course": "CHEM132V", "review": "I have never interacted with the professor, but she did have hundreds and hundreds of students, so I think that's fair. The course was completely asynchronous, and the background videos, pre-lab videos, and lab videos were all done by TAs or another professor. \r\n\r\nCons\r\n- TAs (your first point of contact) do not respond quickly or at all sometimes to the discussion board for student's questions. So, email your TA directly\r\nA different TA graded-Every every week, your lab, so some weeks they might be more stringent with points, and other weeks questions that should've been marked wrong weren't??\r\n- Not given a review guide for the final (which is the only exam in this class)\r\n- 2 of the 11 labs that the final was based on were not returned in time for the exam, so you didn't really know if you understood those concepts before you were tested on them \r\n- You're kind of on your own for this course cause it virtual, so you don't have classmates to reach out to, the TAs are slow, and there was only one time for office hours a week, so if you have another class at that time, you're screwed \r\n- The prelab and labs were very time-intensive for a 1 credit class\r\n\r\nPros\r\n- Most of the labs were not that hard, but they just took up a lot of time\r\n- She dropped your lowest experiment grade (prelab and lab together)\r\n- Good curve (but it depends on your class average)\r\n\r\n\r\n", "rating": 2, "expected_grade": "A", "created": "2021-05-28T01:27:12Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "I LOVE Dr. Stocker. She is such an amazing professor and makes organic chemistry much more manageable to learn. She is very charismatic and genuinely likes helping students (meaning: go to her office hours!!). Compared to other Orgo I professors, she actually is far less technical and legitimately doesn't expect students to know as much material. This makes things a lot easier; you still learn a LOT of content, but it's less than other professors will teach (especially Dixon). Her lectures are definitely fast-paced, but that's just the nature of orgo. I would recommend writing down every single thing she says during lecture. Like, everything. It's really helpful when you go back through your notes and you have her comments written down, because sometimes just looking at the stuff she wrote down doesn't fully explain every concept. She will mention a lot of really helpful details/tips and tricks. She likes to try and explain concepts, especially the more difficult ones, in multiple ways to try and accommodate for the fact that every student is going to understand things a little differently. If you don't understand something from lecture, just go to her office hours, she will help. Her office hours tend to get a bit crowded, especially close to exams, but that's not really her fault, just come to office hours prepared with your questions (or you can sit in them just to listen to other people's questions, I know some people did that).\r\n\r\nHer exams are also pretty fair. They're not easy exams by any means, but they don't ask questions beyond what we learn in class. The midterms are designed to have a time-crunch, which can be tough. She also posts practice exams for every midterm on ELMS, which I would definitely check out. Her exams are typically formatted the same way every semester, so they're a good way of seeing what kinds of questions to expect. She doesn't post keys for them though, you have to go to office hours and ask about specific questions. She also has MANY problem sets on ELMS, and those have answer keys. I would absolutely recommend going through those, both as supplemental work alongside lectures and as exam review. They have several examples of problems for every concept you learn in that class. \r\n\r\nThere are also a handful of homework worksheets in the class, which are the only grades aside from the exams. The homework really won't budge your grade that much, but they're useful for practicing content. The grade for the homeworks is split in two, with turning in a homework answer sheet for 3 points and a quiz that pulls random questions from the homework worksheet that is 12 points. In total, each homework assignment is worth 15 points. Turning in the (completed) answer sheet gets you an automatic 3 points (that part is just graded on completion) and the quiz is graded on accuracy. If you are confused on any homework, I'd go to office hours or ask your TA. I also think it's really helpful to find a group of friends in that class, it definitely helped me a lot this last semester (Fall 2021).\r\n\r\nStocker's lectures are straightforward and fast. Sometimes, her organization does get a little confusing. She won't always be clear on exactly what she is teaching and how it connects to a previous concept. This never really impacted the quality of her lectures too much, but she usually posted her lecture slides and had a lecture schedule on ELMS, which would help with organization. Even though orgo is hard, I really enjoyed her class. She is a great professor and made lectures enjoyable (she's pretty funny, and uses her cats/sons as analogies ALL the time lol). The curve is always nice in this class and the key to doing well is getting above average on each exam. I was very scared of orgo (I'm not good at chemistry), but orgo involved very, very little math and is almost entirely conceptual. The content is not too challenging, it's just a matter of keeping up with the pace of the class. I would recommend memorizing functional groups and pKas VERY early. Also, making flashcards or a comprehensive list of all of the reaction mechanisms as you go is super useful. This class is more memorization than Stocker will claim, but as long as you start memorizing/self-assessing early, then you will be set. \r\n\r\nOverall, I would 1,000% recommend Dr. Stocker. She's one of the best professors I've had.", "rating": 5, "expected_grade": "", "created": "2021-12-20T21:47:34Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Although I suspect she may be better then the rest of the professors, I did not enjoy this class and it mentally drained me to tears. She goes way too fast, expects us to know exactly what she's talking about the second she teaches. I don't know if its any different for the 1hr 15 min classes, but she rushed through all our 50min sessions and kept teaching and writing on her ipad until exactly 12:50 as if we were able to retain the complex stuff she tried to switch to at the end of class. She can be very hype and energetic about orgo, but her jokes aren't funny. The final is not timed so you may have less stress, but its still hard. Do not wait until the last minute tot study and if you can, take this at a time where you dont have to take other classes that are heavy workloads/ heavy memorization. My class generally was doing well so there wasn't much of a curve. You will have to calculate your own grades throughout the semester because she doesn't update them. Make sure you have at least a 50% or better if you want to be in the curve. And PLEASE drop the course by the deadline once you feel like you've lost it or don't know what you're doing because they purposely will try to screw you over by making the \"drop with a W\" BEFORE the second exam. So even if you have hope and don't want to give up, you're screwed regardless. That's what the chem department does. Good luck, ", "rating": 2, "expected_grade": "D", "created": "2021-12-23T19:59:34Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "TAKE STOCKER. love the way she teaches!!! the curve saved me big time. orgo is about knowing more information than the rest of the students, just score better than average on the tests and you will be fine.", "rating": 5, "expected_grade": "B+", "created": "2021-12-26T21:20:58Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Take Stocker fr from what i've heard she is the best teacher and I liked her for orgo a lot. Her curve gave me a B- in the class and my highest test grade was a 67%. I didn't give her 5 stars cause orgo is terrible.", "rating": 4, "expected_grade": "B-", "created": "2022-01-26T02:41:43Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Considering how hard orgo can be, Stocker makes it as painless as possible. She can go pretty fast in lecture, but I personally didn't struggle too much with keeping up. I feel like she simplifies the material more than other professors, and she even joked about how the other professors tend to make things harder than her. If you take advantage of all the resources/practice sets she gives and don't cheat on the HWs and exams (she can be very strict about cheating), you should be okay. ", "rating": 5, "expected_grade": "A", "created": "2022-03-02T00:39:19Z"}, {"professor": "Lenea Stocker", "course": null, "review": "Dr. Stocker is the best organic chemistry professor at UMD. She is kind, cares about her students, and is always willing to have open office hours to answer questions. Yes, her exams are challenging, however if you study using her problem sets and practice exams, they are doable. Her lectures are well-structured and she doesn't test you on anything she didn't teach. I loved taking orgo with her, I would high recommend Dr. Stocker!", "rating": 5, "expected_grade": "", "created": "2022-04-22T15:22:44Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Found her tests extremely fair. I'm aware that many people find her lecture style rather fast, but I feel that she went over all the content in a very coherent manner, that was easy to understand. Her homeworks weren't too bad, as she would post a MCQ quiz that would atleast give you a good opportunity to guess. Although she expects you to remember things like pKa, IR, NMR ranges, it gave for a lot of easy points on tests as long as you reviewed the numbers for them. Overall, would definitely recommend you take Stocker if given the opportunity as her tests are fair, and theres a number of practise questions and old exams on Canvas(but she doesn't give you the answer). ", "rating": 5, "expected_grade": "A", "created": "2022-05-07T01:02:29Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Like I mentioned in ratemyprof, The biggest regret I have in this class is not fostering as much of a personal connection with her as I could have. On the plus side, she let me help choose the final exam's meme for the front page! But in terms of her class here are a few bullet points. \r\n\r\n- Go to lecture. This semester I missed one lecture and I fell behind for a few days, but because I had someone record it for me and send the notes I was fine for the exam. All of the material you are tested on is in lecture. if you don't understand something in lecture, simply raise your hand and ask. she doesn't shame you, she doesn't act like youre a burden. she will simply try her best to answer your question and confirm that she answered it well. If for some reason you still don't understand the topic, go to her many office hours and read the supporting material in the textbook. If you understand the material in class, don't bother with the textbook whatsoever. \r\n\r\n- Grading: Stocker uses the class average to set cutoffs for grade estimates. I have yet to see final grade estimates, but I'm sure she will be very fair. Her goal is not to make a low average!!! in fact she congratulates the class for achieving high averages. You can expect her to be very fair and reasonable with grade cutoffs, and they are almost always somewhat curved but only to represent an even distribution of grades. I am in-between an A- and a B+, but I'm not stressed. I feel that the grade I am getting is due to my studying and not due to Stocker's grading criteria. In sum, try your best and you will be proud of your grade. \r\n\r\n- Lecture style: Stocker is the ABSOLUTE BEST LECTURER I have ever seen. She emphasizes similar reactions rather than grouping of the same category of reactions, which helps a lot in learning similar mechanisms. She doesn't rush you. If the class is behind on a topic for an exam, she won't rush to pack it in, she'll simply take it out of the exam. this rarely happened for us. \r\n\r\n- Exam style: Expect a certain level of cumulative topics, but she won't surprise you with something that isn't important for your current material. For example, pKa's, you will learn, are extremely important for every topic in organic chemistry 1, and you can expect to see her have 3pts per exam at least dedicated to pKa's. you can expect roughly 1/4 of the exam to be easy questions, 2/4 mid-range questions that challenge you but are certainly possible, and 1/4 challenging / high point-value questions. these fractions are based off of points towards your exam grade. I earned a B+, B+, and A- on the three exams and have yet to take the final. I did average in general chemistry 1, so please don't get too scared about Orgo with Stocker. \r\n\r\nI was going to make a pro's and con's list for Dr. Stocker but decided to do a bullet list of all of the good things you should know. The only bad thing I saw about the class was that it's HUGE, and people tend to talk a little loud in her class so I would sit in the front if I were you. There is nothing bad I can even think of with Stocker. She has a low rating because she found out a lot of people were cheating a few years before this review and did what was in her job description as a lecturer and reported them. Seriously don't cheat guys. It may seem like it will help you but I mean this when I say that your'e risking far more than what you could possibly ever gain from cheating. You can also get an A without cheating!!! \r\n\r\nto wrap up this already long review, I wanted to just stronglyyyy urge you to take stocker even if you have to rearrange your schedule completely. You will NOT regret it and maybe if you do, you can meet her kids who are almost as sweet and fun as she is. Best of luck in orgo! don't get intimidated by it, just work hard and you'll be fine. And most importantly: TAKE DR. STOCKER!!!!", "rating": 5, "expected_grade": "A-", "created": "2022-05-10T15:19:34Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "I really enjoyed the material in orgo but Dr Stocker was not a good teacher. She is very knowledgeable and the materials etc provided are helpful, but her lectures are so hard to follow. She doesn't teach at all, instead seems to assume that her students automatically know what she's talking about. She speeds through lectures, introduces really complex concepts with less than 5 minutes left in class, is pretty inflexible with remote lectures unless you explicitly have covid, and will make your life incredibly stressful if you are sick and miss a midterm. She jokes about how strict she is but she is not joking lol. She doesn't email back after 4pm, and is not particularly helpful once she does. I think this is universal for orgo, but she only gives a week's notice for exams, meaning her averages are really low. ", "rating": 2, "expected_grade": "", "created": "2022-05-13T23:10:42Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Dr. Stocker is a good orgo professor. She teaches the material well but be prepared to study hard outside of class as just going to lecture won't be enough to understand orgo. Be cautious as she fills up fast and because most people know to take her, all the premed and honors students will fill up the class and for my section the averages were extremely high because of this. The averages for my section were usually around a 70 which is extremely high for orgo considering the other section she taught had averages in the 50's and at highest low 60's. This may just be an issue with my section as I haven't heard of averages this high from present and past students. Although the semester hasn't ended and we don't know the cutoffs for the final, the cutoffs for an A before was an 87 which is barely a curve. I am averaging around a B/B- in the class which would likely be at least an A- in any other orgo class except for this one. While this was an annoying issue in my class and prevented many students from getting the grade they wanted I will still say she is a good professor. Her exams are pretty fair if you take all the old exams as they are the same format. She is also very open to asking questions and is very helpful during office hours. Overall, I would recommend Dr. Stocker but be cautious about the grade distributions. ", "rating": 4, "expected_grade": "B+", "created": "2022-05-15T15:15:52Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Stocker is the BEST orgo professor you can have. She's an absolute sweetheart who glows when she teaches organic chemistry. It's great seeing someone passionate about the topic teach it. She also uses a lot of animal references to help with understanding and a meme on every single exam. I can happily say I adore her. As others said, my biggest regret is probably not being able to form a bond with her earlier on. In terms of the lecture, Stocker tended to speed through information and you were essentially REQUIRED to go to class. No zoom option, no lecture recordings, slides with almost 0 information being posted. GO TO CLASS or find friends who will give you their notes. Even with that, she's still an incredible professor.\r\nNow into the schmeat of orgo....\r\nOrgo at first seems incredibly terrifying, especially with the amount of memorization required to understand a lot of it.  Stocker provides a lot of practice work and old exams to get you through that so you can recognize what she uses. She doesn't post the answer keys for old exams, but it encourages everyone to work together or to go to office hours for it. She does have homework as well, which is honestly harder than the exams but students always tend to work together through zoom calls prior to when it's due. She drops the lowest one (which was below a 50 for me) but still keeps the points from them in the final grade. \r\nHer exams themselves are very similar to the old exams, however, there always seems to be that ONE trick question. My biggest mistake was taking the first exam thinking I didn't need to study that much. YOU DO NEED TO STUDY FOR ORGO. I scored (with the grade ranges she posted) a low C for the first exam, high Bs for the second two, and a pretty low B for the final. I can absolutely blame myself for the first exam because I didn't really worry about it too much. I mainly thought I could just ride the curve for orgo, but my class tended to have 65s and up as their averages for exams, which is higher than usual for Stocker and made it impossible for me to just ride the curve.\r\nIf you're struggling, I highly suggest watching Leah4Sci on youtube for help! She helped me get through the reactions part of the class. ", "rating": 4, "expected_grade": "B", "created": "2022-05-18T00:55:24Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Very good lecturer and fair exams. She gives you past exams but not the answer keys. Plus, if you have questions over HW and go to office hours, she doesn't give clear responses since she doesn't want to outright give you the answer. From a professor standpoint, I understand why she does this but, as a student, it can be really annoying. It can also be difficult to properly ask her questions during office hours since they are always packed and it can just be students goofing around with her which is frustrating if you just want help. But overall, I don't regret taking her because her enthusiasm made the class really enjoyable! As the other review said, be cautious though because her curves are insanely high compared to other professors. This is a good indicator that she teaches well but it really screws you over with the curve. I definitely had to put a lot of work into the class to get the grade I got but I'm glad I took her.", "rating": 4, "expected_grade": "A", "created": "2022-05-20T04:42:17Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "I really enjoyed the content of this Orgo, more so than Gen Chem because the class was very cumulative in the sense that you would continuously use what you had learned in the previous unit. This made the class a lot easier. In terms of professors though, take Dr. Stocker. My roommate had Koppel and barely ever received partial credit on exams, while Stocker's TA was very lenient on partial credit and grading in general. She is the best Orgo 1 professor by far and a really great lecturer, probably one of the best lecturers I've had at UMD. She does handwrite her lectures though and doesn't post them, so make sure to go to lecture and get an iPad or some kind of tablet. I never went to her office hours but I've heard they were helpful, they just fill up really fast. \r\n\r\nHer class also fills up fast, and because people know to take her a lot of pre-meds and honors students are in her class, which can make the averages a lot higher. My section had this issue, where our average was around a 70 for each exam. This is really high for an Orgo class. For context, the other section (Tues/Thurs) had averages around the 60s/50s. Each class is curved individually, which screwed over a lot of people in my section since they had pretty high test scores for Orgo, but our class didn't have a huge curve, so the grade you got on exams was pretty close to the grade you got in the class. Despite this, I would still take Stocker because Koppel and Friedman are way worse. In order to succeed on exams, I recommend starting studying a week before. Do the problem sets and then ALL of the practice exams- her exams are pretty similar to the practice.", "rating": 5, "expected_grade": "A", "created": "2022-05-23T19:06:12Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "better lecturer than koppel (she's dogshit) but harder tests. If you're the type of person who's able to self-study take koppel cause the curve is larger in that class. Bc all the smart kids take stocker and they all decided to take my section for some reason (mon weds fri) there was little to no curve. ", "rating": 3, "expected_grade": "A+", "created": "2022-07-15T13:36:26Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "i took Dr. Stocker in the summer. Honestly, if you're worried about orgo or you're retaking it like i did, take it ALONE in the summer if you can. Dr. Stocker was super helpful during office hours and she made lectures easy to understand. taking her practice exams and doing the practice sheets are a must to pass; memorization by itself doesn't really work for this class.", "rating": 5, "expected_grade": "B+", "created": "2022-08-31T00:07:21.033405Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "It’s orgo so its going to take up alot of time. Period. Stocker does a good job providing homeworks that are exam level questions, but they can take a lot of time(never do them the night before, try doing what you can after every lecture). She also tells you common mistakes students make so pay attention to those and write that down. Also write down any questions you have and clarify them ASAP in her office hours or after class she’s happy to help, don’t email her. Discussion isn’t mandatory, but its mandatory if you want to pass. The class is curved, not exams.", "rating": 5, "expected_grade": "A", "created": "2022-12-16T02:44:16.959948Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "I hated orgo throughout, but I ended with a good grade so I gave her 4 stars. I got an 82, 71, and 77 on the midterms and then an 86 on the final, so I was above the curve on each exam. I ended with an A- which was a pleasant surprise. I probably could have pulled an A if I didn't start studying two days in advance for each exam.\r\nTips: The problem sets are everything, they help so much! You should be able to get every problem correct before the exams. I never went to GSS but I heard it was super helpful. Form a study group with people you can help and who can help you and start studying hardcore at least 4 days before each exam. GSS exam review was helpful too. Take good notes in class because she does not post them and try not to skip class. You have to put in effort and time for this class and you will do above average, which is all you need to get a B. The B cuttoff is usually reallllly low compared to other classes.\r\nI found Stocker to be a little unforgiving to students who deserved some slack but at least she is consistent. She's probably better than the others.", "rating": 4, "expected_grade": "A-", "created": "2022-12-20T20:51:40.120514Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Amazing teacher. I feel like I wouldnt of gotten the grade I got if I took someone else. I struggled with gen chem really bad and I can confidently say orgo is much easier and funner than gen chem. Once you understand things it becomes fun. Im kind of sad because at first I just wanted to pass this class with a C because I am bad with chem. But when I have been doing above average on every single exam and I scored really high on the final I thought to myself I should of been shooting higher than a C. I really didnt think I would get a B+. To pass this class you need to practice problems after every class session.  If you think you got it, you dont. Stocker has a lot of practice problems that were helpful. She doesnt teach off of a book and we dont have homework on online websites. The other 2 orgo teacher had homework on online websites which looked hard. One thing I hate is how packed her office hours were and sometimes she would talk with the GSS about some random nonsense instead of helping us with our questions. And she did this in the middle of me asking a question which I thought was rude... But that would be the only downside. I would recommend this teacher! If you are above average on every single assignment you are guaranteed a B+ or higher no doubt about it.", "rating": 4, "expected_grade": "B+", "created": "2022-12-20T20:54:57.305006Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Dr Stocker is a really amazing professor. To be clear: orgo will still be difficult even with her as a professor, and it mainly just requires doing lots of practice questions and previous exams. Office hours are super helpful because there is often a group of students there that you can workshop the homeworks with (which usually took me 2ish days to complete) and stocker makes herself super accessible for questions, although she doesn't always answer them very straightforward since she doesn't want to answer the homework questions for you. She explains things very clearly in lecture and, although its easy to feel lost because of the complexity, I often found I would understand what she was saying after trying a few practice questions. She provides LOTS of resources for practice. She uploads problem sets for each topic (with the answer keys) and lots of previous exams. Super kind and a great professor overall.", "rating": 5, "expected_grade": "A", "created": "2022-12-22T06:47:39.361245Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "I'd like to start this by saying orgo is a tough class no matter who you take it with. It will not be a walk in the park but Stocker does her best to make things relevant for us and really does want us to succeed. She holds office hours all the time for questions and it's also a great time to work with other students that show up. She's super nice and a great teacher considering how difficult the subject matter is.", "rating": 4, "expected_grade": "", "created": "2022-12-23T20:51:35.127947Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "If you put in the work (which is a must!), the grade you want to get is very achievable since her tests are straight-forward and predictable. Really liked how the class was structured. As a professor, Dr Stocker seems to be in love with her profession! She can definitely help if you reach out, but that is on your end.", "rating": 5, "expected_grade": "A", "created": "2022-12-28T04:16:01.483319Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "TAKE HER FOR ORGO!!! if you go to class, pay attention, and study examples a lot you will do well.", "rating": 5, "expected_grade": "B+", "created": "2023-01-07T21:20:53.917979Z"}, {"professor": "Lenea Stocker", "course": "CHEM131", "review": "If you need a reference: My ending grade was a 44% and that translated to a C-(TuTh section) Good luck guys. If you do all her examples on canvas and memorize the material, you can do it! I somehow did. Overall, she is a good lecturer but goes fast and doesn't record.", "rating": 3, "expected_grade": "C-", "created": "2023-01-20T21:55:35.786237Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Dr Stocker is probably the least forgiving professor you can have. The only benefit of having her is the tons of practice questions she gives. Other than that, she is fairly condescending to her students in the office hours and never even answers their questions. She talks about her personal life in office hours and will not get to your question. Basically, if you have a question, expect to be there for over 2 hours. Also if people do well in her class, she makes the next exam much harder because she wants to tank the average as much as possible. On exam weeks, she always teaches stuff the week of as well. So if you’re Tu/Thur and your exam is on Thursday, expect to be learning up until Tuesday. The most annoying part is when she assigns a homework in the middle of the week and teaches it on a Wednesday/Thursday and makes it due Monday. There’s no office hours on Friday so expect to be learning it yourself. People definitely overhype her as a professor. I would say the only benefit are her practice questions but that’s it. Her teaching is not that great and you’ll probably need a tutor to figure it out", "rating": 1, "expected_grade": "", "created": "2023-05-05T12:58:44.567699Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "this was definitely a difficult class. that being said, dr. stocker is a really good lecturer and was able to explain everything in an easy way. she doesn't do achieve assignments like the other professors that teach orgo 1, so the practice is all self motivated. take advantage of her office hours and do the practice worksheets!", "rating": 4, "expected_grade": "B-", "created": "2023-05-09T15:19:34.956587Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Dr. Stocker is by far and away the best orgo 1 professor. It was clear in orgo 1 lab that Stocker's students had some of the best theory knowledge. She teaches very straight-forward and focuses on exactly what needs to be studied for exams. She will quite literally point out what to focus on, what not to memorize, what is the most important concept to understand for the exams, etc. She has extremely helpful problem sets on every single concept that she teaches as well as practice exams posted on her modules page. Her TA-led discussions are also very helpful, and while they are not mandatory, the review in it helped me well. Stocker also does not care what discussion you attend as long as the seats are not filled, so the leniency is great here. If you sign up for a MWF lecture, try and get a Tuesday discussion since that is the day where the TA goes over a previous semester's exam during exam week (since her exams are always on Wednesdays). The only downside is that she does not record her lectures, so it is hard to catch up if you miss any lectures. Orgo is hard either way no matter the professor, but Dr. Stocker is absolutely the best possible option.", "rating": 5, "expected_grade": "A", "created": "2023-05-09T18:42:46.409972Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "If you have to take this class, 100% take it with Dr. Stocker if you can. She is an amazing lecturer and the class isn't awful if you put the work in. Her exams are very straightforward and predictable and overall not too difficult. There's only 5 homeworks, she drops your lowest, and grades them both on completion and accuracy (3 pts for turning in an answer sheet and a quiz on ELMS with 6 random questions from the HW). She gives you past exams so you really get to see how she formats her exams and what she emphasizes. My main recommendations would be to go to her office hours frequently and study early and often. Sitting at the table and going over homeworks and past exams with other students in her office was super helpful, I definitely would not have done so well without doing this. Going to her OH is also really good for forming a relationship with her, which I think is really important in doing well in the class and getting recommendations, etc. Overall, this class isn't easy and requires a lot of work (attending lectures and discussion and doing a LOT of outside practice with her problem sets), but Dr. Stocker made this class actually enjoyable.", "rating": 5, "expected_grade": "A", "created": "2023-05-12T21:40:09.054727Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "One of the best professors I've ever had. Made a difficult class interesting and engaging, and it ended up being one of my favorite classes this semester. Orgo demands a lot of work regardless of the professor, but she makes the class interesting and accessible. She is incredibly patient, and very clearly cares about her students' success. TAKE HER FOR THIS CLASS!!", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T19:49:41.199227Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "I got a c- with a final grade of 52%. I'm writing this for grade reference because she typically never talks about her grades. for context, I got a 71 on my first exam which translates into a B and it's above grade average. I got a 30 and 42 for the second and third exams and those are below average and below a c. for my finals I got a 52/150 and which is below average and a c. this curve really saved me from failing and also my first exam really helped me too. I recommend studying very well for every exam, just do her old exams and go to GSS and free tutoring! Also please do make friends in this class. I'm an introvert myself and I'm bad at talking to people but I ended up knowing a lot of new people throughout the semester. If you did badly on the first exam like below a C immediately drop the class! but if you feel like you can do better on the next exams then continue the class. stocker is a good professor but she's very face paced. I didn't go to her class twice and I missed a lot of materials. You can do well in this class if you just put your mind and time into it. I also recommend studying hard for the first exam because it was sooo easy.", "rating": 3, "expected_grade": "C-", "created": "2023-05-17T14:08:42.132550Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Idk reading all these reviews was so misleading. This semester was probably the worst and taking orgo made my year so much worse. Stockers teach at a fast pace and many students in my class were honor students. No additional resources to help you understand a concept but rather just recommends you to buy/rent a book. I think the TA made the class worse, I went to a discussion and it was unhelpful. I also tried tutoring and gss. Idk I feel like I'm not good at orgo but I 100% tried my best and now I have to endure another semester of this awful class.", "rating": 1, "expected_grade": "W", "created": "2023-05-18T05:02:21.407321Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "This class is hard, no way around it. But if you stick with it and do chem every single day of the semester you'll probably do fine. Don't feed into the hype of orgo being hard. Yes it's hard, but it's not unmanageable and you can absolutely do it. The curve will be thick (I had a 68 and it curved to a b) so don't worry so much. \r\nA note: \r\nIf you have hw coming up and haven't covered the material she'll push the hw back", "rating": 4, "expected_grade": "B", "created": "2023-05-18T16:13:55.229772Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Interesting but tough class. You genuinely do have to pour some time into studying in order to do well on Stocker's exams. Honestly, Stocker is a little overrated because I didn't find her teaching method that extraordinary as opposed to what previous students always talked about. She often rushes through lessons, and teaches one problem for every single concept/reaction we need to know. Your grade is basically determined by the 3 midterms, 1 final, and small homework points. I would really consider the grade data for this professor in comparison to other professors, and which semester you're taking orgo. Generally, during the spring, all the honors kids will take orgo, making the average much higher than your standard chem class. I was mainly worried about beating the curve every time I took an exam because mostly everyone will do well. All that aside, I was mostly frustrated with how unavailable she is during her office hours/availability times. She is constantly surrounded by past students who she spends time talking to, despite there being 8 students in the office waiting to ask her a question. Overall, I enjoyed learning orgo, and Stocker didn't make the experience any worse nor better for me.", "rating": 4, "expected_grade": "A", "created": "2023-05-19T02:19:03.204213Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "First and foremost, Dr. Stocker is a very nice person. You can tell that she genuinely cares about her students and wants them to do well. With that said, I do have a few gripes with her class.\r\nOrganic chemistry is very difficult. That is what it is. She tries her absolute best and does very well with explaining concepts. But, all of the class examples and the worksheets on canvas are so surface level. They hardly help you with the exams, so you’ll need to go to GSS and read the textbook for more. \r\nYou absolutely need to study every single topic and every single mechanism as you learn them. Do not wait. Don’t even let yourself get a week behind. Organic chemistry is good in that it builds off of itself so you don’t need to study a ton for the final, but it’s also horrible in that you need to master every subject as you learn it or you’ll get left behind.\r\nIt is extremely hard to tell where you’ll end up in terms of grades. I was in the MWF section and I got a low B, mid C, and mid E, and then a D on the final, and I somehow ended up with a B. The exam averages were in the high Ds and low Bs. Tu/Thu gets a higher curve because grades are basically always lower than MWF.\r\nThere are things that you have to memorize, whether Dr. Stocker wants to admit it or not, soooo accept that from the beginning and use flash cards or something so that you don’t get behind.\r\nGood luck!", "rating": 3, "expected_grade": "B", "created": "2023-05-22T23:36:07.778429Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Best orgo prof at umd. Her lectures were always clear and informative. Very sweet and clearly passionate about orgo as well. I went to every lecture and paid close attention so I didnt have to study too much outside of class for the A. Would definitely recommend over any other prof!", "rating": 5, "expected_grade": "A", "created": "2023-05-23T23:43:00.219633Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "This class was very fast paced, which was pretty overwhelming. She does great with posting previous exams and practice content related to the material she's covering. However, if you don't do good on the first exam and don't see yourself improving, it would be wise to drop the class. I would recommend going to the tutor services that UMD provides and practicing daily. If you can join her office hours, you should. Her office hours occurred when I had a class unfortunately. Do not wait until a week or 2 before an exam to start studying. Dr. Stocker is seen as very compassionate when teaching chemistry, however, she does rush over material.", "rating": 2, "expected_grade": "", "created": "2023-05-26T20:42:35.388710Z"}, {"professor": "Lenea Stocker", "course": "CHEM241", "review": "I got A with a ending grade of 82% highly reccomend stocker Tuesday/Thursday", "rating": 5, "expected_grade": "A", "created": "2023-05-27T01:38:58.570605Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "One of the best lecturers ever! Tests are completely fair and with the overall experience of the class, it was great. It was easy to learn all the concepts due to her good teaching style and she sometimes had lectures dedicated to doing problems where she would walk around and help everyone. Not only was it easy to learn in this class, but she had so many office hours where she helps and actually cares about explaining it well and making sure you understand everything. I definitely recommend going! She is very generous with partial credit on tests. Overall easily deserves 5 stars, would give 6 if I could. Great person all around too.", "rating": 5, "expected_grade": "A+", "created": "2023-05-27T23:22:06.578415Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Writing for both CHEM241 and CHEM231, I have had a great experience with Dr. Stocker as she is a great lecturer and as long as you go to class and write everything down, you are set with what you need to know. Understand that orgo is HARD and DIFFERENT from what you may have learned before (like learning a language) and you may need to practice a lot more as these classes are the fundamental base for future classes. Utilize all your available resources (practice sets, previous exams, GSS, office hours) to your advantage and make sure you understand the mechanisms and why they are happening. Try to make friends with people to form study groups and help each other doing the past exams that don't have answer keys. Go to discussion, usually the TA's review the material and it can be really helpful to reinforce what you have learned and ask questions when you're confused. Review the homework answer key and really try to understand why you didn't get it right.\r\n\r\nBecause tests are the main portion of your grade (90%) I'll write some tips that helped me a lot when studying for them. I would first  scan my notebook (make sure you label when exam 1, 2, and 3 start/end) to see if I there is something I don't recognize. If I find a reaction I don't recognize, I rewrite it and try to write out the mechanism and repeat until I can do it without looking back to my notebook. Once I'm decently familiar with the material I do a past exam (without a key) with a 50 min timer. The material on the exam I didn't know how to do, I would do the practice set for them. I also spend time trying to figure out if my answers were correct using my notebook. I repeat doing past exams and checking with my notebook until I can do most of it. I like to leave the exam with the answer key at the very end because by then I should be confident enough to do well on that exam and confirm my answers. Also if you don't go to GSS normally, I would highly recommend you at the very least go to GSS exam review sessions as it's essentially just doing a past exam with an answer key. Be aware that the test formatting for Dr. Stocker is almost the same every time, so the past exams will give you an idea how the current exam will look like. It will ALWAYS have PKA, concept/thought questions, mechanism (after the first exam), and reactions. In orgo 2 it will always have NMR as well. This will give you a good idea on what you need to prepare for.", "rating": 5, "expected_grade": "A+", "created": "2023-06-30T01:02:59.146035Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Amazing professor and human being! Made organic chemistry interesting and understandable. Yes it is a hard class that is bound to require lots of individual dedication and effort but Stocker did her absolute best to make sure every student could understand the material. She is super approachable and her office hours were extremely useful. She also provides problem sets which were amazing! I definitely recommend setting aside a little time each day to study so you don’t have to cram and actually learn to understand the mechanisms.", "rating": 5, "expected_grade": "A+", "created": "2023-07-31T21:50:39.476030Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Absolutely love her! She's an amazing professor and explains difficult topics so well. She's also pretty humorous and loves cats so of course I love her. Orgo is hard, don't get me wrong. It's like learning a new language. But Stocker guides you through it in a way that's helpful and less daunting. I got an A+ raw score - my biggest pieces of advice: 1) form a study group! i had a few friends in orgo and we got together often to do homework and study. it was genuinely fun and made orgo so much more approachable. 2) practice practice practice. Stocker has a lot of practice exams up and I would go through them multiple times. 3) dont cram - always be studying and practicing. 4) don't be afraid of office hours! dr. stocker is super welcoming and willing to help you understand. (this last one is optional but use an iPad if you have one it is SO much more efficient with orgo)\r\nall in all, 10/10 recommend stocker. she's probably the best professor you could have for orgo.", "rating": 5, "expected_grade": "A+", "created": "2023-09-15T18:09:02.419517Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "I don't know why everyone recommended I take Dr. Stocker for orgo 1. Her teaching style was just not for me and I was completely lost the entire semester. She goes way too fast, expects you to already know basic concepts, and doesn't explain everything in depth. This was the first class I failed and have to retake.", "rating": 1, "expected_grade": "F", "created": "2023-11-02T02:13:37.821885Z"}, {"professor": "Lenea Stocker", "course": "CHEM131", "review": "she's extremely approachable and explains chem with the best analogies. she makes chem super digestible and provides plenty of practice problems, worksheets, and practice exams. i'd recommend doing every problem set or worksheet available to you because that helped me breeze through the class and ace every exam. the exams also match up well with the content she's taught, so you won't have surprises or anything on the exams. she's also such a sweet and lovely person in general. she doesn't record lectures, so attending class is definitely mandatory for an A, but stocker will guide you through everything else. her curve is also extremely fair (i think the cutoff is around a 50, but it can range based on the class's performance, and the cutoff grade is curved to a passing grade aka a C).", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T16:46:12.422208Z"}, {"professor": "Lenea Stocker", "course": "CHEM241", "review": "I had her for both orgo 1 and 2 and I am expecting an A/A+ in orgo 2 after getting an A+ in orgo 1. She is a great lecturer who can explain stuff and get you to actually understand it. Her tests are very fair and she has lots of past exams (no answer keys tho :( ) on ELMS. Use all of the problem sets, discussion worksheets, GSS worksheets, ANYTHING that she posts on ELMS that can help you to study. Something to consider though is that she goes really fast in lecture (perfect speed for me but not for everyone). Also, I think that the Thanksgiving break being extended and her getting COVID messed up her flow when it came to teaching because after all that happened, everything felt a lot more disorganized. She can sometimes use class time explaining a mechanism only to say \"this mechanism will not be on the exam\" which is a little annoying, but if you really like chemistry that's great for you. Overall, really great lecturer and I really understand orgo after taking her!.", "rating": 4, "expected_grade": "A+", "created": "2023-12-05T21:51:48.532445Z"}, {"professor": "Lenea Stocker", "course": "CHEM241", "review": "She goes way too fast. I was lost many times during lecture. She skips through multiple things when teaching something for the first time and expects us to learn it on our own later. Exams are very difficult and are very much in depth which is ironic since the way she explains concepts are vague.", "rating": 1, "expected_grade": "C", "created": "2023-12-12T00:09:21.783252Z"}, {"professor": "Lenea Stocker", "course": "CHEM241", "review": "Stocker is a great lecturer and is great at showing mechanisms (except for when she skips over a bunch of the steps). She expects people to ask questions but breezes through concepts at a speed that makes you not even know what to ask. Her exams are foolishly difficult as they don't represent the one example of a concept she went over in class. You will have to teach yourself after studying her past exams. The TA sometimes posts a document with reactions all summarized, which helped to an immense degree. Without them, Stocker's scattered and information lacking notes would take ages to summarize on your own. As a bioengineer, I don't usually memorize concepts for my classes; we have to understand how to use them. Stocker insists that Orgo II is the same... it is not. This class is pure memorization. Sure, you have to understand how a proton transfer works or some mechanism patterns, but in the grand scheme, this is just a game of how long you prepare in advance to brute force memorize everything. The HW in her Orgo I class was harder than this class - it was fine in Orgo II. Her teaching style is just not for me and I felt dread when it was announced that she would be taking Davis's spot this semester. I got a B+ in Orgo I and my greatest complaint was Stocker's personality. It is irritating. I am not one of your \"kids\" and I am not your friend. Sorry to be rude but a year of her saying \"WHAT'S MY FAVORITE RULE CLASS??? OCTET RULE RULESSS! ENOLS TAUTOMERIZE!!! AHAHAHAHAHA\" has burned my soul into a dark patch of ash. \r\nAnyways, she is a good person but her style of teaching was shit imo. If you don't have friends taking this class with you, it will be harder - but ig that's for everything.", "rating": 2, "expected_grade": "", "created": "2023-12-13T05:35:17.299232Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "I honestly do not understand why everyone loves her. I had her for both orgo 1 and 2 and both times she goes at an incredibly fast pace, doesn't properly cover the information, and then tests on concepts that have never even been spoken about in class. She gives practice problems but they do not even come close to the level of difficulty you will see on the exam. The HWs are ridiculous and she only gives 3-4 days to complete them and often will teach new material that is needed for the HW the day it is due. Everyone I know who had a different orgo professor says that there are things Stocker covered that they had never even heard of and that their professors gave simpler tests and more effective learning skills as well as the HWs. Overall, unless you're gonna be one of the people always in her office trying to become besties with her, find another teacher.", "rating": 1, "expected_grade": "C-", "created": "2023-12-15T15:53:35.995718Z"}, {"professor": "Lenea Stocker", "course": "CHEM241", "review": "Lenea is an alright professor with a horrible attitude about teaching and a lack of respect for her students. Her only redeeming quality is that she makes this class very easy, much easier than the other professors. However, she actively encourages you to never email her, which is disregarding a huge part of her job. She has such a condescending attitude towards students and is very disrespectful. She also refuses to share notes with students if they are sick or miss class for excused absences which makes no sense. Take her for the easy A but not because she is a good professor or a good person.", "rating": 2, "expected_grade": "A", "created": "2023-12-15T17:56:39.748545Z"}, {"professor": "Lenea Stocker", "course": "CHEM131", "review": "I am not sure if Chemistry is for me because this class was a STRUGGLE. Dr. Stocker posted exams but not the answer key which were little help to me.  I felt like she went too slow on topics that were simple and too fast on topics that were very foreign.", "rating": 3, "expected_grade": "C-", "created": "2023-12-15T21:25:30.629020Z"}, {"professor": "Lenea Stocker", "course": "CHEM131", "review": "Best professor for Chemistry hands down. One of the nicest and approachable people as well. She truly cares for her students and loves seeing more students come to office hours. She prepares you well for all the exams as she has handouts and practice exams from the past. GO TO HER LECTURE! GO TO HER LECTURE AND GO TO HER LECTURE! I understand the idea of skipping class and all that but she doesn't record plus the concepts are much easier explained in person and she gives clear examples and problems that don't follow the lecture slides at all. Trust me you will thank yourself in the long run if you go to her lecture and try to go to her office hours at least once a week. To be honest discussion wasn't really helpful for me because my TA at the time wasn't great. But for Orgo 1 no way should anyone be skipping discussion.  GOOD LUCK!", "rating": 5, "expected_grade": "A-", "created": "2023-12-16T12:41:33.649651Z"}, {"professor": "Lenea Stocker", "course": "CHEM131", "review": "Dr. Stocker is good at explaining concepts and seems genuinely invested in our success, but I felt like she went through the material unnecessarily slowly. This was good for cementing concepts in our heads, but I did not have the focus to keep watching her do examples of the same things over and over again. That being said, I can see why she is one of the most liked chemistry professors and it is definitely possible to succeed in her class.\r\n\r\nExams are fair and graded with a curve. Dr. Stocker gives you access to multiple past exams to study with, but only provides the key for one of them. (There is no past exam for the final, unfortunately.) But the exam material was similar to the past exams, and additional worksheets and GSS problems are available for more practice. Homework is ten questions per week, doable in about an hour and definitely worth the time to practice what you learn in class.", "rating": 4, "expected_grade": "A", "created": "2023-12-16T18:22:54.124243Z"}, {"professor": "Lenea Stocker", "course": "CHEM131", "review": "Gen Chem as a class has some of the hardest content I've ever been taught, but Dr. Stocker made it bearable. The tests are really hard but the averages are really low so the curve is pretty generous, and I'd say her teaching style is at a very good pace (maybe just a tad too slow sometimes) and taught very thoroughly. Whenever I didn't understand a topic The Organic Chemistry Tutor always had a video on it that I would just watch and that helped so much. Dr. Stocker also provides enough practice problems and practice tests, so she does her best for everyone to thrive. The only thing I didn't like is that the grading system is relative, in that only the top percentage get A's, the middle get B's, etc. This means that you can average a 90 but still get curved down to an 85, which I don't really like.", "rating": 4, "expected_grade": "A", "created": "2023-12-18T02:23:10.252483Z"}, {"professor": "Lenea Stocker", "course": "CHEM241", "review": "Stocker's more lenient on her curve cutoffs than what she says them to be. I wouldn't stress out too much if you're on the cusp of a grade because chances are she will curve you up. Decent lecturer, but I also agree with other reviews that she's a bit overrated. Went to several of her office hours and spent at least 30 minutes before getting 1-2 of my questions answered just because there were lots of other students there and she would spend time talking to previous students about stuff besides orgo.", "rating": 3, "expected_grade": "A", "created": "2023-12-19T17:38:49.800418Z"}, {"professor": "Lenea Stocker", "course": "CHEM231", "review": "Dr. Stocker made OChem 1 so straightforward and interesting! Practice exams were good representations of material on the exam", "rating": 5, "expected_grade": "A", "created": "2023-12-20T23:17:11.345938Z"}, {"professor": "Lenea Stocker", "course": "CHEM241", "review": "She's probably the better of options in regards to learning orgo, but it's hard to sit above the class curve since a lot of people do well. Take her if you want to learn orgo, take another professor if you'd prefer an easier shot at earning an A. I will also add in that Stocker tends to be more strict when defining her curves to the class, but might be a bit more generous than she lets on at the end of the semester when dealing out grades. Learn your reactions well and not the night before; it's safe to say that orgo2 carries a LOT more reactions than orgo 1, so really start studying earlier and pay attention to tricks on her exams.", "rating": 4, "expected_grade": "A", "created": "2023-12-22T18:03:13.937247Z"}, {"professor": "Lenea Stocker", "course": "CHEM131", "review": "Dr. Stocker is a very typical lecture-style professor where there will be zero in-class interaction and no personal touch. She much prefers teaching Orgo, however, she still knows her stuff very well for Gen Chem. She moves very fast through lectures, often ending the class with a half-complete equation set. If you do not come to lectures and take thorough notes you will not be successful. She only posts slides without any of her work from class so if you miss a class you're practically on your own. The exams were fair and I found discussion to not be necessary. Cutoff to pass her class with a C- usually hangs around a 50%.", "rating": 3, "expected_grade": "C-", "created": "2024-01-03T21:28:29.110702Z"}, {"professor": "Lenea Stocker", "course": "CHEM131", "review": "Can be a fast teacher at times but she teaches very well and I understood the vast majority of the material. Tests were difficult but fair and the final was a bit easier than expected. Will be taking Orgo 1 with her next semester.", "rating": 4, "expected_grade": "B", "created": "2024-01-04T01:57:23.736631Z"}, {"professor": "Lenea Stocker", "course": "CHEM131", "review": "CHEM131 with Dr Stocker was not that bad of a class.  I liked the way she explained concepts and provided ways to solve problems and ways to remember certain things.  Only thing I didn't like is that she doesn't record lectures.  She posts the slides but not the notes online so if you want the notes you have to go to class or get them from someone else.  But going to class is helpful since exam problems are similar to ones she goes over in class.  \r\n \r\nGrading structure is 3 midterms (100pts each), final (200pts), and 11 HW (10x10pts she drops the lowest).  Not bad at all just have to study for exams since they make up most of the grade.  Curve is also generous, I had an 86 raw score and ended up with an A.  I recommend Dr Stocker for CHEM131!", "rating": 5, "expected_grade": "A", "created": "2024-01-16T20:58:22.731508Z"}, {"professor": "Lenea Stocker", "course": "CHEM131", "review": "Dr. Stocker was a great gen chem 1 professor!! She teaches everything in a way that's really easy to understand and will go through any questions you have during her office hours. Workload is super bearable, only 10 homework problems that usually don't take up too much time. Tests are hard, but averages are usually pretty low so there's a pretty big curve. She also posts 3-4 past exams (only one has an answer key though) that are pretty similar to the actual test that are great to study from. I had a great experience in her class, taking her again for orgo next semester!", "rating": 5, "expected_grade": "A", "created": "2024-01-21T03:53:12.145596Z"}, {"professor": "Lenea Stocker", "course": "CHEM131", "review": "She was very knowledgeable and as a orgo teacher did a good job of preparing us for that. She was pretty organized as well, however her style of notetaking didn't work as well for me because I was so busy keeping up with what she was writing I couldn't pay as much attention as I needed for chem.", "rating": 4, "expected_grade": "B-", "created": "2024-02-05T19:46:25.423129Z"}, {"professor": "Lenea Stocker", "course": "CHEM241", "review": "Dr. Stocker is far and away the best professor Ive had at UMD. Her practice tests are the exact same format as the actual exams, and as long as you attend each class and take notes, you will be just fine. She does not post notes, but do the practice problems/exams and attend her OH for help bc she's always there. Made one of the hardest classes easy and enjoyable, take her if possible.", "rating": 5, "expected_grade": "A+", "created": "2024-03-07T21:23:38.790691Z"}], "name": "Lenea Stocker", "slug": "stocker_lenea"}