{"courses": ["EDCI620", "EDCI622", "EDCI322A", "EDCI322B", "EDCI426", "EDCI322", "EDPS301", "EDPS210", "TLPL360", "TLPL470", "TLPL362", "TLPL250", "SPHL601", "SPHL602", "SPHL603", "TLPL250", "TLPL250", "TLPL470", "TLPL250", "TLPL360", "TLPL362", "TLPL250", "TLPL470", "TLPL250", "TLPL360", "TLPL362", "TLPL250", "TLPL470"], "average_rating": 4.6, "type": "professor", "reviews": [{"professor": "Lisa Eaker", "course": "TLPL250", "review": "I think ill get an A in this class but she is honselty one of the best professors ever! She's very understanding and gives virtually no homework. Additionally there seem to only be 2 quizzes and a final paper which you gather information for all semester. Class is mostly discussion based but there are no participation points or anything like that. This class seems to be an easy A, and Dr Lisa makes it easy!", "rating": 5, "expected_grade": "", "created": "2021-10-29T20:59:20Z"}, {"professor": "Lisa Eaker", "course": "TLPL470", "review": "Dr. Eaker is awesome. She is so down to earth and really cares about the students. We always had really in depth discussions, and a lot of new information was taught. She was always really fast to replying to my emails, and was a really fair grader with a lot of helpful feedback. I wish I could have her again.", "rating": 5, "expected_grade": "A+", "created": "2022-01-06T18:02:42Z"}, {"professor": "Lisa Eaker", "course": "TLPL250", "review": "I'm an education major... and I thought this class was pretty boring.  There was a lot of information thrown to you at once each lecture and there was breakout rooms which I didn't enjoy.  Your grade for the class is based off of three 10Q quizzes and one group presentation.  They were open note so just make sure you take good notes and you should do well.  She loves when people participate but I wasn't really about that, she never made people speak though or call people out by name which was nice.", "rating": 3, "expected_grade": "A", "created": "2022-04-14T19:49:19Z"}, {"professor": "Lisa Eaker", "course": "TLPL360", "review": "Professor Eaker is so sweet and engaging with her students. This course was extremely easy and she set you up for success. I am a History and Secondary Education double major, so this class was very interesting to me. This class was set up with 2 quizzes, which are online and open note; a group presentation; a final interview and analysis; and participation. Dr. Eaker is a fair grader and wants the best for everyone. She is clearly very passionate about the topics given and wants to make sure her students know the complexity and severity of issues. Several class periods were asynchronous, and the ones that were in person were very fun and allowed us to show our interests outside of content as well. \r\n\r\nOverall this course is very easy and fun if you are looking to go into the education field or looking more into the history of education as a whole.", "rating": 5, "expected_grade": "A", "created": "2022-05-24T15:06:31Z"}, {"professor": "Lisa Eaker", "course": "TLPL360", "review": "Professor Eaker is such a kind, knowledgable, and understanding person. She is very friendly and approachable and always tries every class to engage her students in warm ways. The class is not too difficult and is very interesting (coming from an education major). I don't know how interesting this class would be to someone who is not passionate about education and teaching, however if you are an education major this class with Prof Eaker is highly recommended by me because it is both a GPA booster and personally enjoyable.", "rating": 5, "expected_grade": "A+", "created": "2023-04-11T02:32:45.443397Z"}], "name": "Lisa Eaker", "slug": "eaker_lisa"}