{"courses": ["INAG110", "INAG110", "INAG110", "INAG110", "INAG132", "INAG110", "INAG110", "INAG110"], "average_rating": 4.0882, "type": "professor", "reviews": [{"professor": "Lori Sefton", "course": "INAG110", "review": "Genuinely nice teacher. Class is easy, small, and engaging. Everyone feels like they have a personal relationship with this professor. It is a fun class and an easy A. You give 4 speeches and take a midterm and a final. The textbook readings are simple, I just listen to the audio version from a PDF file. The midterm average was an A too. Definitely a nice relief from the giant lecture halls. She also provides great feedback on your speeches and helps you structure them well. ", "rating": 5, "expected_grade": "A+", "created": "2021-10-25T14:37:31Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Very kind and helpful professor. The class consists of 4 major speech presentations, a midterm, and a final. The class itself is small and you get to know everyone well which is nice. There is a minimal amount of homework, the main homework comes from reading basic chapters, and at times completing reflections. The class is very beneficial and fairly easy. I would definitely recommend this professor to everyone. ", "rating": 5, "expected_grade": "A", "created": "2021-11-30T21:42:19Z"}, {"professor": "Lori Sefton", "course": null, "review": "Great teacher, very harsh grader. ", "rating": 4, "expected_grade": "", "created": "2021-12-01T21:17:09Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Extremely easy class. As long as you attend class and go to office hrs while writing your speeches you will get a A. She's fairly lineant with grading speeches and focuses more on the structure of it. \r\n", "rating": 5, "expected_grade": "A+", "created": "2022-01-15T17:14:09Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Extremely straightforward class. As long as you attend class and office hours prior to the speeches you get an A. The speeches are graded fairly leniently. The midterm and final are extremely easy and can be studied for in a day. ", "rating": 5, "expected_grade": "A+", "created": "2022-01-15T17:16:22Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "The final and the midterm were all multiple choice and as long as you read the textbook, you’ll do great. You’ll do fine even if you didn’t read honestly. Dr. Sefton makes class interesting and engaging. Just make sure to practice the speech beforehand and you’ll do great, the speeches are graded pretty leniently. This was honestly my favorite class during my first semester. Oh another thing, make sure you follow directions when creating your outlines ", "rating": 5, "expected_grade": "A+", "created": "2022-01-24T22:24:51Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "This professor is the WORST. If you’re looking for a class that is less intense and less demanding, I would not even consider this. She is super strict, doesn’t accept late work no matter the circumstance. She is also difficult to work with as a teacher. She doesn’t seem to have many students’ best interest because she would rather fail you. She also doesn’t recognize students’ efforts and if you did an assignment wrong you will get a 0, and she will not allow you to redo it. Basically, you cannot make mistakes in her class because she will just give you a zero and not look back. She is rude to her students and comes off very strong and not friendly.", "rating": 1, "expected_grade": "", "created": "2022-02-03T04:49:28Z"}, {"professor": "Lori Sefton", "course": null, "review": "Don’t take", "rating": 3, "expected_grade": "", "created": "2022-02-27T07:04:10Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Very harsh grader for no reason. Very strict about the ways she wants her assignments. Expects way too much for a dumb gen ed. Take any other inag professor. ", "rating": 1, "expected_grade": "", "created": "2022-03-05T22:33:47Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "She's very nitpicky in her grading and will look for any opportunity to give you a lower grade. She is not someone that's willing to work with you, preferring to just straight up give you a 0 if you are late. You have to write outlines prior to each speech, and she notes any small details to just subtract points from your grade. The speeches themselves aren't the worst as she isn't too harsh on the grading, but otherwise, she's very hard to impress. To ensure you get an A, I'd suggest you take another professor if possible. \r\n\r\nJust so you know how seriously she takes communication, she has a bachelor's, master's, and Ph.D. all in communications. ", "rating": 2, "expected_grade": "", "created": "2022-04-03T22:15:36Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Had her for INAG110 last semester and found it very straightforward. Very engaging in each class lecture and makes you work in groups with other srudents. By the end of the semester, it is likely you will know everyone's names (especially as it is a smaller class). While she can be somewhat of a harsh grader (especially once you reach a 90), an A or B is still obtainable with some effort. Would recommend taking it with her!", "rating": 5, "expected_grade": "A", "created": "2022-04-28T18:29:35Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Don't take this class. She's a harsh grader and is so knit-picky in the way she grades her assignments. ", "rating": 1, "expected_grade": "", "created": "2022-05-03T20:02:34Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "One of the harshest graders I have ever had in my life, all for what was supposed to be an easy gen ed class. She goes through every effort to try to make your grade.\r\n\r\nOh and another thing, we had these exams during the semester that contained questions about the most obscure things about communication that were most definitely not covered in class, even though they may have been in the textbook, they were in the side diagrams and small footnotes. The tests are 50 multiple choice questions and are not easy in the slightest unless you studied for a week beforehand. \r\n\r\nLastly, she made us do a final business presentation and ON TOP OF THAT, take a final exam. Literally just stupid and I've talked with my friends and they said their teacher never did that.\r\n\r\nIf you can take any other professor for the class, do it. If she is the only professor left for INAG, just take COMM, it is NOT WORTH dealing with this demon for a semester.", "rating": 1, "expected_grade": "B", "created": "2022-05-11T20:09:36Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Look Lori's a nice person and is willing to help you but not the best in terms of teaching. She is a very harsh grader and will take off points for many little things with your speeches. She is very uncompromising in terms of how assignments are done and its either her way or no way. She does not accept late assignments whatsoever even if it is a minute after the deadline unless you have a University approved excuse. And just about INAG110 in general, there is a midterm and a final and a lot of the information just seems useless. If you can I would take COMM107 instead as to my knowledge there is no midterm or final or try and find another INAG professor. ", "rating": 3, "expected_grade": "", "created": "2022-05-17T19:38:53Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "listen, lori is a strict grader, however, she makes it very clear and communicates exactly what she wants. she posts rubrics for each speech and gives great feedback. her feedback is not meant to criticize you, it's meant to help you become a better communicator. its honestly impressive that she can notice and comment on small details in such short amounts of time when you're giving your speech. she genuinely wants you to do well and tries to get to know each student. she is also a great lecturer and her slides are always online and very clear. there is a midterm and a final which are both 50 mc, but lori does in class review and posts study guides and its really easy. her energy during class is always so excited and it shows how much she loves teaching. just show up to class and pay attention.", "rating": 5, "expected_grade": "A", "created": "2022-12-10T01:15:51.143536Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Dr. Sefton is a great lecturer, she knows what she is talking about. She genuinely wants her students to do well and tries to get to know everyone making it a great learning environment. She makes it very clear on what she expects on speeches and provides specific clear feedback to help you improve. There is a midterm and final exam but it is all multiple choice and very easy since she does in-class review and provides study guides. This class focuses on application of content through worksheets and just talking it out with classmates. Homework is assigned maybe once every two weeks and is like three questions from the textbook. I would not recommend skipping class all the time since she does have classwork usually for a few points. Overall, her class is very engaging and always goes by fast. She is definitely someone you can talk to.", "rating": 5, "expected_grade": "A", "created": "2022-12-10T01:16:22.850579Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Dr. Sefton was a great teacher and knows what she is doing when it comes to public speaking. 60% of our grade was based on our speeches and although she was a tough grader she gave great feedback and acknowledges when you improve. She also genuinely cares about her students and was very reachable. The workload was very manageable and she provides lots of classwork to help improve your grades. You definitely have to work for your grade which was a little annoying considering this was just a gen-ed but I learned a lot so it was worth it in my opinion!", "rating": 5, "expected_grade": "A+", "created": "2022-12-21T03:13:55.806995Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Dr. Sefton is very nice and supports all students through all problems they might have. 60% of the grade comes from 4 key speeches which you have to prepare on your own however, the speeches are not much longer than 5 minutes and you can go to office hours with and outline and she will help find everything wrong with it and help you improve it. this pretty much guarantees you don't get a bad grade on the content of the speech. the presentation alone is not worth much. She is strict with her rules but will always tell you what the rules/rubrics and expectations are far in advance, (they also aren't that hard). Unfortunately, she does teach the class like it is a middle school class and gives out a worksheet almost every single class but the homework is limited to 2 short assignments per week if any at all.\r\nEssentially, just attend class and take your outlines to office hours to review for an easy grade.", "rating": 5, "expected_grade": "A+", "created": "2023-04-03T14:53:58.117204Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Great teacher! You definitely learn a lot in class, which is very helpful for making slides and crafting speeches for other courses. 60% of your grade is speeches (4). Her rubrics show EXACTLY what she is looking for- so go to office hours! She is very helpful and will tell you what exactly what you need to fix to boost your chance of getting a good grade. Midterm is 5%, final is 10%. All you need to know if vocabulary and how to apply it.", "rating": 5, "expected_grade": "A+", "created": "2023-05-15T15:22:03.499513Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Really engaging professor. Take advantage of going to office hours-- she will help you write out your outline and tell you exactly what you need to do to pretty much get an A. Her rubrics are VERY clear, and tell you exactly how to get the grade you want. Very nice and approachable, and I recommend taking her.", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T14:31:22.982393Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Take this class with literally anyone else. You will probably have better luck with a TBA comm professor.", "rating": 2, "expected_grade": "A-", "created": "2023-11-09T02:17:39.605719Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "She's amazing! She tries to make the class engaging, gave out a lot of good tips for speaking, and helped me with interview tips. She is pretty nitpicky with her grading on speech days, but she is a very good person and you can always go to office hours to discuss speech grades. Honestly would HIGHLY recommend this professor.", "rating": 5, "expected_grade": "A-", "created": "2023-11-30T03:41:09.974067Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Dr. Sefton is very passionate about what she teaches and makes every class engaging. The material we learn is useful in the future and outside of the class, I've used the steps for writing/giving a good speech in other classes already. She is very approachable, welcoming, and easy to talk to, and makes the class a comfortable environment in a class that can be nerve-wracking normally. Her rubrics and assignments are extremely clear and she goes over exactly what she's looking for, and gives reminders of assignments several times every class period to make sure that everyone knows about them. We also had a lesson that had to do with psychology, and I found it really interesting and a nice change from just practicing writing/giving speeches. She is also very available for office hours, I would highly recommend her.", "rating": 5, "expected_grade": "", "created": "2023-12-05T21:32:25.064201Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Dr. Sefton is extremely approachable and knowledgable about communications. She makes class engaging and gets to know students on an individual level. She isn't very lenient about grading but her rubrics are super straightforward. I really liked her!", "rating": 5, "expected_grade": "A", "created": "2023-12-07T17:22:58.171547Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "At the beginning of the year, I did not expect to like Dr. Sefton at all but I ended up loving her. Yes, she is a hard grader and overall doesn't mess around (no phones in class, no headphones, etc. etc.) but you can tell she cares about her students. Yes, speeches are hard and scary but that's something you'd get with any communication class. Also, this class sounded like a lot less work than some of my friends' communication classes so keep that in mind. Outside of the time I spent writing speeches (which was only once and a while), I spent virtually NO time doing homework in this class. We had readings but I never read any of them and it never mattered. The best way I can describe Dr. Sefton is comparing her to a stern mom, tough love but makes you respect her and succeed in the course.", "rating": 5, "expected_grade": "A", "created": "2023-12-07T21:31:39.791895Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "In my opinion, she is an exceptional professor who consistently offers assistance whenever required. There have been various instances where her guidance during office hours proved invaluable in clearing up all of my uncertainties and worries. Despite coming across reviews criticizing her grading style as overly strict, I must respectfully disagree. Based on my experience with her class, she is a fair grader.", "rating": 5, "expected_grade": "A", "created": "2023-12-08T15:14:11.604933Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Please, please take this class with Dr. Sefton! She is very, very passionate about what she does and makes the class incredibly engaging. I did not ever utilize her office hours, but I heard from fellow classmates that she was very helpful and essentially made sure that they couldn't do anything OTHER than get an A on their speeches. \r\nYour grade in the class will depend mostly on four key speeches, which grow in point value as the semester goes on. If you follow the rubric and get help if you need it, you will do well. She is a tough grader, but not completely unfeeling—ask for help and you will get it. Take advantage of her office hours, and don't be afraid to talk to her in general! I thoroughly enjoyed this class. \r\nShe is NOT lenient with assignments turned in after the 24hr grace period without communicating with her prior, which makes sense, but just be aware of that. Don't be afraid to email her to let her know what's going on, either. She is as accommodating as possible and will do what she can to make your life easy. She's great!", "rating": 5, "expected_grade": "A", "created": "2023-12-10T00:59:14.216781Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "One of my favorite professors ever. She is genuinely so kind and friendly. For all your speeches if you write your outline before the due date, you can email her and she will provide feedback that pretty much ensures you get 100% on the structure part of the speech rubric. There were textbook readings we were supposed to read before class but there was no need for you to read them since there were no tests or quizzes on the textbook and she would repeat the same stuff in her lecture that day. There were 4 recorded assignments throughout the semester that were very easy and didn't take too long, and other than that the only work for her class was preparing for the speeches. I didn't find her to be a tough grader and if she noticed the majority of people missed some component of the speech she would not take points off anyone for it and instead called it an error of her teaching. She randomly partners you up with people in class which might seem scary but made you more comfortable with everyone in the class and made speaking in front of them far less intimidating.", "rating": 5, "expected_grade": "A+", "created": "2023-12-13T02:45:21.904255Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "If you're someone who thrives under very specific direction you will love Dr. Sefton. She lays out expectations very clearly: structure for your speech outlines, notecards, speech structure, even body language.  You can practically know what you'll get on a speech or assignment before even doing it if you just follow the rubric and especially if you go to office hours (she's very willing to help). However because the directions are so specific there is not much room for error with her grading. There are assigned textbook readings but tbh you do not need to read any of them, she covers the topics fully in class. Definitely recommend, I feel like I will actually be using a lot of the things she taught in my future presentations", "rating": 5, "expected_grade": "A+", "created": "2023-12-14T14:24:50.483182Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "She's a pretty standard professor, not hard to do well in the class if you put in the time. Class was basically mandatory as there were small assignments every class. There were four major speeches in which you could basically talk about whatever you wanted (not hard), but her grading could be a bit harsh considering. Topics covered in class were interesting enough and useful in a communications setting. Overall she was fine.", "rating": 3, "expected_grade": "A", "created": "2023-12-15T02:40:27.101145Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Take another comm professor at the end of the day, regardless if they're rude or not as long as u get that A. Honestly shes is a very sweet professor and I've learned a lot going to her class but shes is very nitpicky about minor details and it adds up in the end. I ended up getting a B+ and was on the edge of an A and she refused to round up. Her class is very dependent on attendance and speeches, so if your not good at presenting or refuse to show up to class... womp womp", "rating": 3, "expected_grade": "B+", "created": "2023-12-20T00:48:01.158312Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Going into this class I was expecting to not do well. I was really bad at public speaking and I just took the class to fulfil the general education requirement. The class was certainly a challenge if you don't have a lot of public speaking experience. However, the challenge is completely manageable because there are no surprises. For each speech the professor goes over exactly what is expected of you and as long as you do what your asked you will get a good grade. The class schedule is generally easier than COMM107. However, the last presentation is quite a step up in difficulty from the rest of them. If you're bad at public speaking (like me) the class will require a good amount of prep work before each speech. I know this might all sounds bad but I promise that the class is more than fair. Dr. Sefton is an incredible professor. She is so supportive and understanding.  If you need help with any of the speeches or have any questions she will always help at her office hours. She lets students restart their speeches if they messed up and tries her best to make sure everyone understands that its ok to make mistakes. The learning environment was so supportive, even from the classmates. It felt like we were all a team that was suffering through the pain of public speaking together. This class and Dr. Sefton helped me grow so much as a public speaker. This is why I would recommend this class to anyone. With a little bit of effort you will easily pass this class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T18:40:07.548641Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Dr. Sefton was a really enjoyable professor. There were 4 speeches that made up the majority of your grade. Each were a a little longer than the last but nothing difficult. You can choose what to talk about. She goes over everything needed to get a good grade and explains each part thoroughly. She always offers extra help and responds quickly. There are some recorded assignments but none are difficult. There are many readings assigned but they aren't necessary to do as she goes over each chapter during lectures. In class she lectures about the chapter each week and has you do some small 5 point assignments that do add up but aren't worth much of the grade. The fourth speech is done in the last weeks of class. The final is a recorded submission. Overall, Dr. Sefton is a great professor and wants to help you succeed. Her class gives you valuable skills you are guaranteed to use in the future and I would recommend taking INAG110 with her.", "rating": 5, "expected_grade": "A", "created": "2024-01-18T21:26:38.544769Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Awesome professor! She cares a lot about students and is always available to help with anything you need. As long as you go to class you'll be fine, the only homework is writing speeches for the most part.", "rating": 5, "expected_grade": "A", "created": "2024-01-19T17:47:19.078874Z"}], "name": "Lori Sefton", "slug": "sefton"}