{"courses": ["CMSC320", "CMSC351", "CMSC320", "CMSC351", "CMSC106", "CMSC320", "DATA320", "CMSC250", "CMSC351", "CMSC106", "CMSC320", "DATA320"], "average_rating": 2.8837, "type": "professor", "reviews": [{"professor": "Maksym Morawski", "course": "CMSC320", "review": "DO NOT take this class with Maksym Moraswki. His lectures is interesting but has nothing to do with our project/exam. His project description does not match how he grade it.", "rating": 1, "expected_grade": "B-", "created": "2022-10-17T20:55:12.884947Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Love how the rate my prof ratings are so much better. https://www.ratemyprofessors.com/professor?tid=1822434. \r\nExam wasn't that bad as long as you listen to what he says in class. He doesn't always teach everything in lectures, a lot of self learning is expected of you as well; however, he always points out the topics you have to self learn. It is very clear and probably like an hour of learning outside of class a week.", "rating": 5, "expected_grade": "A", "created": "2022-10-19T19:38:30.116079Z"}, {"professor": "Maksym Morawski", "course": null, "review": "Avoid him. He rewrote the whole class and made all contents unrelated to the projects and exams. His lectures are not useful at all.", "rating": 1, "expected_grade": "", "created": "2022-10-26T19:19:21.864130Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "He doesn't know how to teach. He deleted all lecture slides from the previous semester which are rather clear and useful, and teach classes without slides. He also canceled a bunch of classes without trying to make up.", "rating": 1, "expected_grade": "", "created": "2022-10-26T19:23:52.079928Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Classroom lectures, while interesting, aren't relevant at all to what's actually on the exam, and concepts that are briefly glossed over in class show up as a full-fledged exam question. Nothing in class is really relevant to the knowledge needed to complete the projects past the first couple of lectures.", "rating": 1, "expected_grade": "C+", "created": "2022-10-27T19:51:36.707432Z"}, {"professor": "Maksym Morawski", "course": null, "review": "Cool guy, awful professor. He's always extremely unorganized and unprepared so he just rambles during lecture about things that aren't related to the projects. Additionally, he regularly entertains useless questions that have nothing to do with the class, leading him to go on all sorts of tangents and impromptu comedy bits. He still doesn't understand how to use ELMS, Gradescope, or his class webpage, so from a student's perspective, that makes it really difficult to remember when and where to submit an assignment or take a quiz. Don't take his classes.", "rating": 1, "expected_grade": "", "created": "2022-11-02T19:58:43.949397Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I learned nothing from his class.", "rating": 1, "expected_grade": "B", "created": "2022-11-02T20:31:40.656533Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Horrible professor contingent on making your life as confusing and miserable as possible. First exam was a complete crapshoot, so bad in fact that there was not even a GradeScope timer. Genuinely ignore the 5 star review. I ended up with above a 100% on the exam after this curve to compensate how horrible the exam was (removed 10 points from a 42 exam) and I'm telling you he's horrible. Quite horrible.", "rating": 1, "expected_grade": "A-", "created": "2022-11-07T02:32:08.936343Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Great guy, very funny, clearly has experience with what he is teaching. While the first midterm we had did have some more vague questions, it was graded very fair with a curve and numerous questions converted to extra credit. Lectures don't always line-up exactly with projects/exams but are interesting in useful in overall terms for data science. Would guarantee most of the reviews on here that are negative are people who aren't putting in effort/starting projects last minute, etc. Would highly recommend for anyone interested in data science and would advise to take most of these negative reviews with a grain of salt/open mind", "rating": 5, "expected_grade": "A", "created": "2022-11-07T04:02:41.205259Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max is a really nice guy and on the first day of class got me excited about the course by telling some very interesting stories about his time in the industry. This was the first time in a CS class that I had been excited to learn or thought to myself, “wow that sounds like something I want to do when I graduate.”\r\n\r\nThat is why I’m extra disappointed by this class. I suspect that all the Max does to prepare for each day is make a general list of things he wants to talk about and the occasional very plain PowerPoint which he doesn’t stick to. What happens in class is that he simply rambles about said topics without any semblance of structure. There are no key points even if he is using a visual aid. Max will often hand write notes but this is pretty spotty and no one would be able to understand the full picture if they were to try to go back and look at the notes. It is often as if his lectures are simply a conversation between him and people sitting in the front row which quickly breaks down the flow of class and creates too many tangents. It also reveals how unprepared he is when people ask questions and he realizes he should have planned to address that but that it had slipped his mind. This is only a small summary of the issues in this class. Projects are way too hard in comparison for how casually he teaches and test questions seem to be first drafts without any revision. Unless you have the time or personality that would allow you to live in his office hours, don’t expect to get much from Max because his lectures are very difficult to learn from.", "rating": 1, "expected_grade": "C", "created": "2022-11-07T21:29:23.929820Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "easy class, only con is you have to take it with Max. Fun if you want to hear a tech bro boast about his salary every lecture", "rating": 1, "expected_grade": "A", "created": "2022-11-08T01:52:54.784023Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "This review is after Maks addressed what has happened in the class and the midterm recently, which is why you are going to wonder why all the 1 star reviews.\r\nI do agree that he isn't the greatest lecturer, and that a lot of topics that he very lightly brushed on the exam came in full force in the midterm, however I am posting this after he gave an EXTREMELY generous curve and on top of that he admitted that a lot of the questions that seemed out of scope of the class or  that were badly written, well that was actually the case, and he made it up within the curve that he gave us.\r\n\r\nIt's his first time teaching this course, not sure if actually it's his first time lecturing huge sections, and actually. I was frustrated too with his lectures but I can see why he wants us to learn all of this and he is trying to re-make the class. It's to get us to think data-wise and not just be code monkeys who just do python,sql, and stuff to whatever we are told to do for the projects. He is a caring and great guy and I have never seen instructors be so caring to the point of admitting their own mistakes and taking student input in order to improve.\r\n\r\nThere could be more in depth examples and case scenarios for the next exams theory/stat/math wise, and perhaps include a bit of the project stuff in class, but he is great and trying his best at getting us to get the most out of this course.", "rating": 5, "expected_grade": "A", "created": "2022-11-08T03:49:53.714517Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "The way that CMSC320 is being taught in the fall 2022 is a disaster. \r\nThe class was known as a easy CMSC elective class. But it is not this semester. Morawski is a cool, fun guy. Maybe caring according to my friends, but he is far away from good professor this semester. \r\nHe has a few little lecture slides at the beginning of the semester, but no more after he decided to remake the class. We get speaker notes sometimes, but it is only converging the topics he went over. Furthermore, the lectures he gave doesn't teach us how to do our projects and exams well. We basically need to learn how to do the project on our own - it is much workload that I was expecting for CMSC320. It is probably the workload similar to CMSC216. BTW I start projects early so I can ask TA for help, but they are still time consuming and suffering because you have to find out what are expecting (the project description doesn't always tell you where you graded on) and teach yourselves (since you didn't really learn how to do the project yourself)\r\nAlso, I do agree that he is trying to make \"us to think data-wise and not just be code monkeys\". But we need to think data-wise AND how to code.  \r\nMany of the exams questions went far away from the scope of the class. And some are bad written. The projects we did (and cmsc320 is project heavy class) probably worth 6 points in the 42 points exam (which is 32 after he gave curve). Also there is no timer on the gradescope when we took the exam so we will realize \"we had to time ourselves!\" after you read the exam starts 3-5 mins. \r\nHe might improve next semester (Spring 2023) based on the feedback he got this semester, but honestly, if you have choice, try to wait a semester to see how it went . At this point, I will say he is definitely 1/5 at CMSC320. If you have to, I will suggest to treat this class not as elective CMSC class that is kinda easy as the previous reviews have, treat it as a CMSC216 class that will took your lots efforts to get A.", "rating": 1, "expected_grade": "W", "created": "2022-11-09T20:00:45.605784Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I really enjoy his class. He makes the material fun and engaging, and added a lot of real world applications to our lessons.\r\n\r\nThis is his first semester teaching it, and so it's a bit bumpy because of the transition to new material, but he's been doing his best to make it smooth and respond to student feedback", "rating": 5, "expected_grade": "A+", "created": "2022-11-09T20:22:37.155109Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Really gracious curve and very responsive to feedback. Really interesting class.", "rating": 5, "expected_grade": "A", "created": "2022-11-09T20:25:20.819542Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "The main issue is poor organization in lecture. Does not provide clear explanations of each topic nor specific examples. Hand written notes are his passing thoughts rather than coherent, structured notes. I often leave class feeling as if I learned nothing. I struggle to take notes because of lack of structure in lectures. Exam was not very relevant to what was covered in lecture, but he is working on this for the next one! Lectures are not really related to the projects.\r\n\r\nDespite all this, Max is a funny and really cool dude. I enjoy talking to him and hearing his thoughts and stories. It's obvious he's working to improve. I appreciate he has industry experience, which he ties to what we're learning!\r\n\r\nMy recommendations for improvement: \r\n- Organize lectures with clear explanations of each data science technique, use cases, and relevant examples. \r\n- Create more organized hand written notes that can serve as a reference. \r\n- Review key concepts necessary for projects and exams.\r\n- Keep sharing cool stories and industry insights!", "rating": 2, "expected_grade": "A", "created": "2022-11-10T00:27:45.065723Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Everyone who gave him a 5 star review doesn't understand that just by curving an exam by 30% makes you a better professor. His lectures are still uninteresting, he goes on niche tangents with 3 kids in the class that make lecture an unbearable nightmare where you don't learn anything. I'm willing to bet that the 3 people who gave him those 5 star reviews are the same people who sit front of the class asking him questions to get him to go on random tangents for 90 minutes.", "rating": 1, "expected_grade": "A", "created": "2022-11-10T00:57:54.400526Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Really nice guy passionate about data science. Not a good teacher. If you want to self-teach yourself all of the content in this course then take Maks. His lectures are hard to follow as they involve at least 3 tangents minimum. He is not organized and it is very unclear on how much we need to know about mentioned topics. This makes studying almost impossible. I only did well on the first exam due to prior knowledge and google. I would recommend taking this class with someone else and make your life easier.", "rating": 1, "expected_grade": "A+", "created": "2022-11-10T23:46:14.584872Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Take it with someone else if you actually want to learn something. He's a nice guy, but doesn't really teach anything substantial that's useful for the projects and exams. He talks about various topics at a very surface level but doesn't go into any of the details. The first exam was just STAT 400 questions and student-made questions from Piazza. Also the things we were tested on he didn't really go into much detail in in lecture. Only thing that I have found valuable from this class so far are the projects created by previous professors for the course.", "rating": 1, "expected_grade": "A", "created": "2022-11-12T00:24:42.136849Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Professor Max is a super down to earth dude. I personally really enjoy his class and he makes lectures fun. \r\n\r\nThe way he is teaching CMSC320 is unusual but it comes from a person who has worked in the field, which holds a lot of value in my eyes. \r\n\r\nProjects: not easy but he is reusing projects from other semesters so I don’t understand why people are complaining. A lot of project work is fully self taught, which isn’t unusual for CS courses. The project grading is lenient and Max is super easy to talk to if you have any issues. If you don’t want to self learn then you are going to have a lot of trouble in various CS courses, it’s just how it is unfortunately \r\n\r\nExam 1: This exam was online so we had access to Google and any notes we had taken. The average was around 65% but Max is giving us a generous curve and again, none of this is unusual for a CMSC course, it’s only really bad if the professor isn’t fair with curving based on the averages, which is not the case here. There were technical difficulties but Max accommodated for that and helped anyone that had issues. Also, the vast majority of the grade comes from projects so this isn’t even a big deal\r\n\r\nLectures: Max talks about the fundamental topics briefly and doesn’t go into too much detail. Again, most of the code you will learn is self taught and contained in the projects, lecture is for high level explanations of the different topics of the course. Max also shares stories about projects he had to do in industry and problem solving techniques he used to get his solutions. All very practical and useful information. if you’re a geek that doesn’t care about real life and want to stuff your face in a text book and fully learn everything in depth, this gem of a lecturer isn’t for you. \r\n\r\nOverall thoughts: I personally think this class is a breath of fresh air amongst the sea of boring and difficult computer science courses. Max actually makes me want to come to lecture as opposed to feeling like I have to. I love having professors that are easy to talk to and feel more down to earth. This is definitely one of the rare instances of a professor that understands that students have a life outside of their course and is willing to accommodate for real excuses. \r\n\r\nOther ratings: I honestly feel like Max is getting a lot of unfair reviews. This is his first semester teaching the course and he is demonstrating a clear willingness to learn and improve as a professor. There are lots of complaints about the unorganized lecture styles, which is a fair criticism that I’m sure he will address in the future, but also bs criticism about an exam that isn’t worth very much of our grade and projects that he didn’t even write? These are literally reused projects from other semesters so if that’s the complaint then you have a problem with the class, not Max. There seems to be two sides to this. If you want to hear real life experiences and get advice about how to make it in the industry, then you’ll like Max. If you’re looking for a professor that solely focuses on teaching the class material, then Max is not for you.\r\n\r\nConclusion: He a little confused but he got the spirit", "rating": 5, "expected_grade": "B", "created": "2022-11-12T11:32:52.662848Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Great professor that is a little unorganized but makes up for it with real life industry work experience. Max shares his work stories about projects he did and how he did them, which is a lot more valuable to me then just coursework\r\n\r\nMax is a breath of fresh air in the sea of super boring work heavy CMSC courses, love the dude\r\n\r\nThis is his first semester teaching the course and he is very gracious with curves and listens to student concerns. Super down to earth dude. Some technical difficulties in the class but he’s working on them \r\n\r\nOverall: he a little confused be he got the spirit", "rating": 5, "expected_grade": "B", "created": "2022-11-12T20:55:01.032636Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Has a super fun personality. Unfortunately, this personality also involves him being incredibly hand-wavy for just about every topic, making it impossible to do the projects or the exams without literally learning all of the details and processes (which are deemed uncool) yourself. This is made more difficult by the fact that he's thrown out all of the previous relatively well-structured course material, replacing it with his free-form, tangent-filled lectures, with no useful slides or notes posted. \r\n\r\nLogistics is a nightmare. Completely unreliable and disorganized. Difficult to get in touch with and has yet to timely follow through (if at all) on a single assurance he's made all semester when you do. Hasn't bothered to figure out the most basic software used for the course, making things even worse for students in every way (exams, projects, recordings, notes, slides).\r\n\r\nEven if we end up with an insane curve to make up for his incompetence (which seems to be the case from the first exam), we've been taught little in a potentially fascinating course and have been enormously stressed and frustrated.", "rating": 1, "expected_grade": "B+", "created": "2022-11-13T07:50:29.054960Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Horrible teacher. He fails at not only teaching but also responding to relevant questions. His lectures are more about his personal life than it is about data science, and I feel like I wasted a lot of time by even attending the lectures. The fact that he had to curve an exam by >30% in a class that's not even meant to be difficult speaks volumes. As much as I'd like to say he's a good person but bad professor, I'm afraid to say an irresponsible professor is not exactly the best person.\r\n\r\nIf you're reading this, kindly teach relevant information. As much as some members of the class enjoy your tangents, I (and many others) came here to learn and nothing else. Please teach in a practical and planned manner. I loathe those who are fortunate enough to not value over 90 minutes of time.\r\n\r\nTo reiterate, if you are reading this: Students come here to learn data science. You are obviously a talented and tested individual, and clearly possess the capability of teaching. I can only assume you think we don't take this course seriously, and therefore neither should you.", "rating": 1, "expected_grade": "A", "created": "2022-11-13T08:14:53.062387Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Absolutely horrid professor and class. If you take this class get prepared to teach yourself all the material related to any assignment or quiz. He has no comprehension of what it's like to be a student in his class where he handwaves every topic briefly with no reinforcement and then assigns us projects where it is NOT RELATED AT ALL to what he is teaching. He is more concerned with his job at EBay than he is with actually being a good professor and to compensate for this just showers the class in extra credit (which does not make him a better professor). Overall, horrible professor. If you enjoy learning any actual material don't take a class with him. You will regret it.", "rating": 1, "expected_grade": "W", "created": "2022-11-14T19:04:47.952638Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "READ! This semester was his first time teaching and he caused a blunder with the midterm, which wasn't even that bad in my opinion. That's the only reason a bunch of nutcases spammed him with 1-star reviews. Anyway, he curved very reasonably and is set on not repeating his mistake. Aside from this, he consistently enlightens us about the Data Science industry and teaches us useful concepts relevant to the industry. His lectures are fun to go to! Additionally, he listens. He's always asking for feedback and genuinely feels bad for the mistakes he has caused. You study for exams (both online) by following a well-written study guide he provides. Regarding projects, they are also fun and you learn applicable Data Science skills. There's no final exam, but instead, a final project where you can make what you want to while fulfilling certain requirements. Max is super lenient with your ideas and is super easy to talk to. If you're uneasy because of his reviews, just go talk to him and decide for yourself.", "rating": 5, "expected_grade": "A+", "created": "2022-11-15T03:19:02.930628Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Honestly, ignore the 1-star reviews. He has a 5 star on ratemyprofessor out of 30 ratings. It's from UMBC and it's the same Max, I checked his LinkedIn. I can guarantee the 1-star reviewers are all nerds.\r\n\r\nMax is hilarious, makes lectures fun, and teaches valuable course material. People are mad because \"what he says in lecture doesn't help us with the projects\", yea, it doesn't. That is a common occurrence for higher-level CMSC courses. I guess none of those reviewers have gotten past CMSC351/CMSC330 yet.  Projects involve using code to extract text from websites, organizing it, and making graphs/visualizations out of the data to make a point. Do people actually expect Max to stand there for 90 minutes every lecture teaching us how to code in pandas? He showed us the basics then everything else builds on that. Making a pretty visualization is something google helps you with. I do think Max should provide us with documents with code examples relevant to the projects outside of lecture, which is something he currently does not do, otherwise I don't mind his teaching.\r\n\r\nMax also uses his experience from working in the field to teach us and explain what is and is not relevant. I love knowing what topics are actually used in the field because I want to work in data science. Knowing what to expect means I can focus on certain topics more and do better on interviews. Everyone that is roasting Max for talking about his work in the field is an absolute donut that just wants to be spoon-fed code instead of learning topics at a high level and figuring out the code on their own. \r\n\r\nMax is also a very considerate and reasonable instructor that understands that students have a life outside of his class and is willing to accommodate for special circumstances. Very down to earth and likable dude", "rating": 5, "expected_grade": "B+", "created": "2022-11-19T05:07:36.690991Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Yeah anyone who gave him a 5 is a complete lunatic. I'll admit he has promise but for now he is currently teaching one of the worst run CS courses in the entire department. Nice guy, would love to get a beer with him some time but the course is so disorganized to the point where it makes learning horrible. He was adamant on changing the slides in the beginning of the year because they \"weren't good\" and now instead teaches off whatever tangents his brain works off of. I can't imagine how Jose feels as he recently revamped the course just to have it ruined by Max. Maybe once he sorts this all out he'll be better, but for now he deserves the 1, ignore anyone who gave him a 5.", "rating": 1, "expected_grade": "B", "created": "2022-11-22T02:46:29.761981Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "A pretty unorganized course to be honest, but it's his first semester teaching so it's to be expected. Only problem with this course is that there isn't enough code examples in class and the slides/notes are unorganized if there are any at all. Other than that, he's a cool guy and completely understanding/willing to take feedback. The 1-star reviewers are all crybaby's and think everything they need to know for this class needs to be spoon-fed to them like a little child. People even tried to take advantage of his kindness claiming the stat questions on the midterm shouldn't count because STAT400 isn't a prerequisite for this class. Well... if you made it through CMSC250 and can't solve a simple Bayes Equation question then I really don't know what to tell you.", "rating": 3, "expected_grade": "A", "created": "2022-11-22T19:06:49.950793Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Sucks. If you want to learn anything avoid him.", "rating": 1, "expected_grade": "A", "created": "2022-11-22T21:27:54.232804Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "terrible professor. picture this: jose, a very good and well respected professor, teaches this class the previous semester, takes his time to redo the course material, makes all these projects and slides, proper organized class. then max comes along, deletes all the slides, keeps the projects because he is too lazy to create new ones (he literally wont stop talking about how he has never even seen the projects) and whos lectures consist of word vomiting material he only has surface level knowledge on, then has exams that are designed to be googled on. he has amassed a weird bunch of groupies who will shill for whatever he says (hence all the 5 stars who sound like they were written by the same person). Do not take any class with this man", "rating": 1, "expected_grade": "A", "created": "2022-11-25T02:32:13.295092Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "The worst course I have ever taken! Attending lectures is a total waste of time because you cannot learn anything. You need to teach yourself everything when doing projects and reviewing for exams, and when you are taking the exam you need to google almost everything. If you want to pay a lot of tuition and gain the ability to be a self-learner, take this course with Max. Although Max is a nice professor, who likes talking about his success in the industry, this course is so unorganized and that is because he removed all the good slides from the previous semesters and wants to teach this course in his own way. \r\nThe first exam was a nightmare.  The exam was not related to his lecture and we had no idea about what kinds of problems would be in the exam. He curved a lot to make up for that, but it still can't change the fact that we did not learn ANYTHING.", "rating": 1, "expected_grade": "", "created": "2022-11-26T18:58:21.429087Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "AVOID. Not only learn nothing, but also take your time complete projects that are completely unrelated to the course content. Be prepared to spend hours understand the project and google.", "rating": 1, "expected_grade": "", "created": "2022-11-27T05:48:13.099438Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Ill break it down for everyone as best as I can.\r\nCons: \r\n- No lecture slides\r\n- He has lecture notes he wrote, but only sometimes do they get posted\r\n- The first midterm was a mess. He put a huge curve on it to make up for it though. \r\n- Not many code examples\r\nPros: \r\n- Relatable nerdy guy with stories from the industry (he is not a professional professor, he is data scientist with an insanly good resume) \r\n- Willing to do better as a professor, the first exam was a mess, the second one was not. If someone did bad on the second exam it was probably because they did nothing all semester. \r\n- Gives warm-up questions at the start of lectures which he describes as interview problems \r\n\r\nAll in all, he is not the worst professor. The projects are related to the materials despite what some other peoples reviews are saying. The exam questions were related to the lectures, despite what some other reviews are saying. Do the projects require a lot of Googling? Yes, they do. There were not too many code examples given in the course but the documentation surronding what you are doing is actually really good. So, having to Google it, is not like shooting yourself in the foot. \r\n\r\nI'd say 4/5. There is room for improvement, but it could of been way worse. \r\n\r\nI found it was best to skip the in-person lecture as watching the recording of the lecture made taking notes easier as the lectures are actually him just talking to you and not reading off a slide show. So if you cannot take notes based on speech in a quick manner like myself, watch the recordings.", "rating": 4, "expected_grade": "A-", "created": "2022-12-06T16:27:47.068295Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "oh you thought 351 was the CS weed out class? think again and welcome to 320 with max", "rating": 1, "expected_grade": "B", "created": "2022-12-10T02:18:39.793055Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "did an oopsie woopsie with the first midterm, curved it to make up for it\r\n\r\nprojects are heavy on googling but its not terrible/pretty obvious what to do from the descriptions\r\n\r\nsecond midterm was better written than the first, still relatively low average but imo questions were very googleable (which he hints as a solution for exam problems)", "rating": 5, "expected_grade": "A+", "created": "2022-12-11T07:04:57.576521Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "This was genuinely one of my favorite courses at UMD. The lectures were a useful overview of tools available to data scientists, and the projects were realistic representations of what it's like to work with data. Max is a really fun lecturer and I highly recommend stopping by his OH to chat / get life advice. It's really unfortunate that so many people gave him bad ratings after the first midterm - he's a super reasonable guy and adjusted the rest of the course after receiving feedback and I don't think anyone can claim that he made the course unfair. Anyways, highly highly recommend taking him for 320!", "rating": 5, "expected_grade": "A", "created": "2022-12-12T20:50:06.648292Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "This was genuinely one of my favorite courses at UMD. The lectures were a useful overview of tools available to data scientists, and the projects were realistic representations of what it's like to work with data. Max is a really fun lecturer and I highly recommend stopping by his OH to chat / get life advice. It's really unfortunate that so many people gave him bad ratings after the first midterm - he's a super reasonable guy and adjusted the rest of the course after receiving feedback and I don't think anyone can claim that he made the course unfair. Anyways, highly highly recommend taking him for 320!", "rating": 5, "expected_grade": "A", "created": "2022-12-12T20:50:06.672912Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "This was genuinely one of my favorite courses at UMD. The lectures were a useful overview of tools available to data scientists, and the projects were realistic representations of what it's like to work with data. Max is a really fun lecturer and I highly recommend stopping by his OH to chat / get life advice. It's really unfortunate that so many people gave him bad ratings after the first midterm - he's a super reasonable guy and adjusted the rest of the course after receiving feedback and I don't think anyone can claim that he made the course unfair. Anyways, highly highly recommend taking him for 320!", "rating": 5, "expected_grade": "A", "created": "2022-12-12T20:52:05.154705Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max gave very interesting lectures and is a great presenter and I feel like I learned a lot in the course. He has a lot of experience in the field so he makes sure to focus on the things that people will need to be successful in their careers. He also gave lectures on important skills that aren't taught in Computer Science like ethics and how to talk to people. He makes the class feel like a safe space for everyone and is very accommodating.\r\n\r\nHis first test was very disorganized but he gave lots of extra credit to make up for it and worked things out with people who had problems on top of that. The second test was a lot better and he still let people talk him into extra credit for certain questions. The final project is one that will look good to employers and replaces any final test. There are 4 projects in the class that can take a bit of time to complete if you don't understand the tools but once you know how to use the them the projects don't take long at all. Overall, I highly recommend taking this class with him.", "rating": 5, "expected_grade": "A+", "created": "2022-12-12T22:24:52.487608Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Maks is a fun lecturer, as a data scientist who had worked in the industry he shared a lot of interesting stories relating to his experience with past jobs. However the class itself is disorganized, you have to rely heavily on the notes you take during class as he doesn't consistently have official class notes, and the exams didn't have any official practice questions other than student-made ones posted on Piazza. The projects rely heavily on your ability to google the right things as there's not much in the lectures dedicated on teaching students how to use Python other than a few mentions of some random Python methods here and there.\r\nAs this is his first semester teaching here he is willing to improve, he does listen to students' feedback. His second exam was much more fair and comprehensive compared to his first exam.", "rating": 4, "expected_grade": "B+", "created": "2022-12-13T18:51:14.984925Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "So here's the thing - I don't think the 1-star grades are fair. Maks first and foremost is a genuinely nice person - this goes a long way. The only real issue with the class is the material covered in class is pretty orthogonal to the exams from what I understand\r\n\r\n320 also has a reputation of being a very chill class so the departure from this I think makes a lot the ratings (unfairly in some sense) lower - he's a new professor and I truly think he wants everyone to do well.\r\nAlso just wanted to point out that the claim in an earlier review that the class material not corresponding with the tests/projects is common in upper level classes is completely wrong. I've taken 6 or 7 (I can't remember) 400 level CS courses - this has never been the case. \r\n\r\nI generally agree with the review left on 12/06/22", "rating": 3, "expected_grade": "A+", "created": "2022-12-13T22:55:04.638493Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "This class started off very disorganized, as Max restructured the entire course curriculum. He taught what he thought was useful, and gave lots of stories about his time in industry and was clearly very experienced in the field. The big knock was that exam 1 was poorly structured, and even though I didn't agree and thought it was fine, he gave such a big curve that my 77% became a 110%. Projects were admittedly unrelated to most course content, but there was an emphasis on trying to learn how to Google, and they were easily manageable. Overall, nice professor and good class.", "rating": 4, "expected_grade": "A", "created": "2022-12-13T23:02:18.554460Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "This is Max's first semester and I definitely think he will improve as a professor, however I feel like I did not get as much out of this class as I had hoped. He doesn't really have any lecture notes, so sometimes it is hard to follow and know what is and isn't important in lecture. The only exam practice that is given are practice problems created by other students in the class, which is nice practice but gives you no direction about what you actually need to know for exams. He does curve exams pretty generously. He rarely answers Piazza posts, which can be pretty frustrating especially when questions that are asked days before projects are due are never answered. I feel like what we learn in class isn't super helpful with the projects, and I usually spend more time googling than I do coding. It's not too difficult to do well in this class, but unfortunately I don't feel like I have learned a ton. Outside of teaching, Max is a very nice guy and I can tell he genuinely wants everyone to do well in his class, and I think his classes will definitely get better after he gets more practice as a professor.", "rating": 3, "expected_grade": "A", "created": "2022-12-16T20:25:21.122730Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Every lecture was kinda scuffed but content was interesting and lot of topics were covered. Max is the chillest lecturer I've had. Definitely has GOAT potential. I'd give it 2 more semesters.", "rating": 4, "expected_grade": "A", "created": "2022-12-17T05:50:02.159875Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Good lectures. Reasonable grading.", "rating": 5, "expected_grade": "", "created": "2022-12-22T04:05:59.529907Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "He definitely cares about his students and makes the effort to answer questions and improve our understanding of whatever he's lecturing. That being said, here are some general points about his class:\r\n- He redid the CMSC320 curriculum in the beginning of the semester, but relevant lecture slides/notes and recordings sometimes weren't posted until weeks later \r\n- Projects and class material didn't really line up \r\n- The first exam had a really low average which led Maks to curve our grades (by a LOT). Second exam went by much better. We also had an opportunity for extra credit for each exam (posting an exam question on Piazza).\r\n- No real practice exams or questions (outside of the questions posted for extra credit)\r\n- He has prior knowledge working as a Data Scientist for places like Google and Ebay and tells us about his experiences there\r\n- Grading is kind of slow -- 2/4 of the mini-projects still aren't graded (and one was turned in around a month ago)\r\n- Googling is an important skill to have\r\n- Maks is open to feedback, willing to improve, answers questions, will offer advice and ways to improve, and cares about his students\r\n\r\nThis was his first semester here though, and I definitely see things with him improving next semester.", "rating": 4, "expected_grade": "A-", "created": "2022-12-22T15:19:41.929995Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Will be good in 2-3 semesters. But for now he remains disorganized and uncoordinated with the material he teaches in lecture and what he expects from projects and exams.\r\n\r\nVery reasonable guy however and generous curve was given for any mistakes. Once he figures out things I imagine he’ll be a great addition to the department.", "rating": 3, "expected_grade": "", "created": "2022-12-24T18:23:47.184737Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Disorganized course admittedly. However, he's a really nice guy and has definitely been trying his best. The biggest thing is that he's always willing to make up for things he's made mistakes with. He curved generously when the exams went (on average) poorly. I did abysmally on the first exam (failed it even after a 15% curve), because the class is harder with Max than it seems to have been with some other professors. The final project was interesting and topic selection was lenient (although grades took a while). I ended up with needing about 0.01% to get an A- and I emailed Max asking if he would round me up. He graciously rounded me all the way to an A (approximately a 3-4% bump iirc). \r\n\r\nUltimately, you shouldn't *not* take a class because it's with Max. Even if you feel like you don't know what's going on during the class, your grade will reflect your understanding as relative to your peers. Give him a shot, sit in the front of the class, and you'll like him.", "rating": 5, "expected_grade": "A", "created": "2023-01-06T16:29:59.332532Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "The class was a mess. Lectures kept getting sidetracked. We were never prepared for exams. Exams had weird grading. Grades took forever to come out.", "rating": 1, "expected_grade": "A+", "created": "2023-01-14T04:20:51.709592Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Overhated. He is a nice professor, and chances are if you ask him after lecture, he will accommodate you best he can. Exams could be somewhat challenging, so I recommend you find study groups and follow his study guides he releases. Like any CS course, most of my learning is from Googling and stackoverflow, so I can't really hate on him. He was lenient in the projects being turned in (we had an extra day for like 3 of them). I am sure he will get accustomed to everything in the Spring.", "rating": 4, "expected_grade": "A", "created": "2023-02-02T02:31:28.028598Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I had him in the previous semester. Great guy, cares about his students. He makes class very engaging and tries his best to make sure students understand the material. Some issues did come up, but this was his first time teaching, some mistakes are expected. He also made sure that his mistakes didn't screw over students giving VERY generous curves on exams when they did happen (many of the negative reviews came immediately after the exam, before he announced the curve). For a normal exam with no mistakes, they can be pretty difficult but he also curves it up to an average of 75%. Overall I'd recommend this professor, I genuinely enjoyed his class and he's good at teaching imho. Giving 4 stars for the the mistakes, but I have no doubt that he could get 5 easily. Definitely one of the best CS professors at UMD. For reference, I'd personally put him next to Nelson and Jose Cauldron in ranking.", "rating": 4, "expected_grade": "A-", "created": "2023-02-09T20:56:10.343456Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Took the course in Fall 2022. He was very generous with the curve but I didn't feel like I learned much from his lectures. However, the projects were pretty fun and useful for getting some experience with data science. You can do something meaningful for the final project and add that to your resume as well.", "rating": 3, "expected_grade": "A", "created": "2023-02-16T22:14:53.967904Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "While we were spending hours working on Kruskal's homework, he didn't prepare for any single lecture. Everything was up to Kruskal so far, hopefully I can pass this class.", "rating": 1, "expected_grade": "P", "created": "2023-02-27T02:35:40.728309Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Makysm is specialized in data science not algorithms and especially not coteaching with kruskal. He struggles in trying to teach Kruskal's Concepts. He rambles in lectures with his Ipad trying to figure out Kruskal's content. No hate amazing lecturer for data science just not 351", "rating": 1, "expected_grade": "A", "created": "2023-05-08T18:39:22.753018Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Maksym did a fantastic job with this course and made it the least stressful it could've been, given he had to coteach it with Kruskal. He genuinely cares a lot about his students, which shows in his effort! His teaching style is also really entertaining.\r\nAs Maksym gets more experience at UMD, I think he will easily become known as one of the best professors in the computer science department.", "rating": 5, "expected_grade": "A", "created": "2023-05-10T13:53:04.974549Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max taught this course in his own way this semester and it worked out really well. Definitely didn't feel disorganized like people were saying about previous semesters and I feel like I learned a ton. Great professor with a lot of potential!", "rating": 5, "expected_grade": "A", "created": "2023-05-10T13:57:34.993069Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Incredibly nice and caring man. Like incredibly nice and caring! Class is terribly organized because he himself seems a little disorganized but mainly because he cotaught 351 with Kruskal, whose class is always a mess. His lectures are pretty disorganized but if you pay attention to what he says he gives very very very helpful advice, but you have to listen to what he is saying. There weren't any slides which sucks. Averages on the Kruskal written exams were like in the mid to low 60s, but gave strong curves obviously. Great man, improving professor with lots of potential. CMSC 351 is made unnecessarily difficult when its Kruskals course. Not his fault for the class being bad.", "rating": 4, "expected_grade": "", "created": "2023-05-11T03:20:07.567333Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "i've never had a teacher more open to feedback and thoughts than him. honestly the class kinda sucked but he clearly cares about the students and what their opinions are on everything going on. he always seems to try and do his best to figure out how to make us feel better and have a good experience in class (even tho again, class sucked but like hes a nice fella). it's a good enough reason alone to take him just cuz of how nice he is. he also curves very generously because of how aware he is that this class kinda sucks. \r\nhis lectures felt pretty all over the place. he's a very engaging speaker and tries to make the class interactive so you wont be bored and your brain will be moving during it but most people i know and i primarily learned from kruskal's videos rather than maks' class just because of how messy it'd be sometimes. he'd get terms/content wrong and correct himself a lecture later, change up variables, explain things incorrectly, etc. it's probably just cuz he just started teaching here tho, he'll probably have  a much better grasp of the content and how to teach it by like a semester or two. it definitely felt like he didn't rehearse or think much abt how to convey new information, but again, he'll probably be good with time.  \r\nhonestly more of a 3.5/5 stars with my specific experience in this course but he'll def be like a 4 or 5 in a few semesters. i rounded up since he's jus a nice guy lol some people on here are too mean. pretty sure he reads these too", "rating": 4, "expected_grade": "", "created": "2023-05-11T05:00:56.351623Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "very generous with curves but unbelievably corny", "rating": 4, "expected_grade": "A", "created": "2023-05-15T15:42:23.366056Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "The reviews are all correct. Nice guy but just may be the worst professor of all time. Cancels class essentially when he feels like, has no guidelines for things, and just made the course and overall unpleasant experience with Kruskal.", "rating": 1, "expected_grade": "B", "created": "2023-05-17T04:39:30.212509Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "I've spoken to several TAs and Max wanted to teach the course using Justin's notes but was forced by the university to teach it with Kruskal (which as we all know, did NOT go well). His lectures didn't prepare us for Kruskal's midterms or homeworks, but then again, Kruskal is really specific in what he wants (I still do not understand why we had to know how to calculate the exact number of comparisons for each algorithm) and I doubt anyone can really teach 351 at the level Dr Kruskal does. It also takes WAY too long to get a homework back (they've actually got 320 TAs grading 351). Overall though, I think Max tried really hard, and he's giving us a generous curve, and he's still new. Give him time. I believe in him.", "rating": 5, "expected_grade": "", "created": "2023-05-17T14:05:42.601727Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Co-taught with kruskal, so I'll ignore many of the issues that come with his content\r\n\r\nPros:\r\n- Super caring about students. He recognized that Kruskal runs a brutal class, and heavily curved and gave us hints for exams to make up for it\r\n- He cares heavily about his assignments and their grades accurately reflecting the knowledge of his students. Since Kruskal's content doesn't do that, he put a lot of effort into making sure nobody failed the class unless they were extremely under the average. He went as far as to curve the average for the entire class up to an A at the end.\r\n\r\nCons:\r\n- Severe lack of knowledge of the subject. Everything I learned came from Kruskal's recorded lectures\r\n- Very disorganized. Didn't prepare for lectures, and basically tried to learn the content along with us\r\n\r\nDefinitely has potential to be an excellent professor when he makes his own content and lectures about stuff he knows about. Unfortunately, this semester was neither. I'm giving him a 4/5 for his extreme willingness to de-Kruskal the class by any means necessary.", "rating": 4, "expected_grade": "A", "created": "2023-05-17T16:29:24.318955Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "I wanna cut Maks some slack. It was his first semester co-teaching 351 with Dr. Kruskal.\r\nOverall, it seemed that he didn't have much control over the course structure/material since it was his first time teaching. All decisions were ultimately up to Dr. Kruskal. \r\nI don't know the extent that Maks had over the HWs and Exams that were given to us. They all felt as though they were made by Dr. Kruskal.\r\nThe HWs and exams were insanely challenging. Averages for both midterms seemed to be around ~60%.\r\n\r\nDuring lectures he taught us based on Dr. Kruskal's recorded lectures from previous semesters. Maks' lectures were very high-level though, so I still had to watch Dr.Kruskals lecture videos to know the full extent of the material and all the deeper math theory behind specific algorithms.\r\n\r\nHopefully, I can make it through this course with a passing grade. As of right now, right after our final, nobody can tell what their grades will be.\r\nMaks has potential to be great though! He genuinely cares about his students and relates to us. So he understands the struggles and stress everybody went through this semester. I'm excited to see how he ends up structuring his course for semesters to come. He has the same teaching knowledge as Dr. Kruskal now, so he might be continuing the same curriculum but in his own revised way. Which I can say is definitely useful and important to know! I can definintely say I'm coming out of this course knowing the deeper math fundamentals behind algorithms. So take it with him if you want to learn a lot!", "rating": 4, "expected_grade": "P", "created": "2023-05-17T21:22:22.779626Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Honestly, I think people are a bit hard on him here. Yes, he's a new teacher and has a lot of fine-tuning to do, but he does listen to student feedback and tries to accommodate student needs as much as possible if you just talk to him. For this course especially, it's easy to tell that he did not have much control over the course since he was co-teaching with kruskal, so a lot of the course's clumsiness can be attributed to that. But he's a much-needed breath of sympathetic fresh air in the CS department, and it's clear he cares a lot about the well-being of his students. He has everything he needs to become a great professor, just give the lad some time. And while he's still figuring things out he's never blamed his students for any resulting grade discrepancies and reassesses accordingly. I really don't think there's much more you can ask for, especially for his first semester teaching the course and having to coteach w kruskal.", "rating": 4, "expected_grade": "", "created": "2023-05-18T16:16:32.087983Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Trash, Trash, don't take it. He has some crazy cultists who sit at the front of the class every time, and the other students don't come to class all time. The exam is hard, don't take this course if you are not the crazy cultists.", "rating": 1, "expected_grade": "", "created": "2023-05-19T01:04:09.052401Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "You are better off learning on your own then learning from his class. This makes sense because Max really wants his class to be geared towards practical industry skills, but it just translates to a bad class experience. The exams are very open ended, sometimes weirdly or vaguely worded, and generally just harder then they should be. The class material only really prepares you for the exams if his exact way of teaching works for you, and for most people it doesn't. Everything else in the class is graded very generously though. That being said, I would recommend taking this class with someone else if possible.", "rating": 2, "expected_grade": "", "created": "2023-05-22T19:04:40.791948Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max is definitely not your standard CS professor, but do yourself a favor and take him anyways. You’ll leave this class feeling like you have a better understanding of what data science actually is, rather than a random assortment of knowledge that you have to regurgitate on exams to get an A(which is what a lot of CS classes are). On top of that, I’m almost certain he’s the nicest person in this department. He’s very understanding of the fact that we’re all stressed out college students, so he’s chill with deadlines as long as you reach out to him. He’s also a huge nerd and is incredibly funny. I found myself laughing constantly throughout his lectures(go to lecture, they’re fun). Also, go to his office hours or set up a meeting with him. This man has a lot of experience in industry, he’s well connected, and he’s a very approachable guy who wants to help everyone be the best version of themselves. You’re missing out if you don’t talk to him.\r\nHe’s not perfect. He sometimes makes promises he doesn’t keep, he doesn’t really have practice questions for exams, and it often seems like he put the lecture together the night before and hoped for the best. BUT he made up for everything and was willing to change his course policy any time we had an issue with something. \r\nTLDR: take him if you want a friendly professor who cares about you and wants you to be a competent person in industry. Don’t take him if you want a super structured, math-heavy course.", "rating": 4, "expected_grade": "A", "created": "2023-05-22T23:24:13.375303Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "He’s the goat. I love what he did with the class", "rating": 5, "expected_grade": "A", "created": "2023-05-25T22:09:59.199883Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "An interesting, caring, and potentially great professor. This was his first semester teaching CMSC351, and he was co-teaching with Kruskal; so the semester was, as expected, brutal. However, he did genuinely try his best to accommodate the students.\r\nPros:\r\n- Incredibly welcoming and lovely person: if you want advice, talk to someone openly, or review lecture contents, then come to his office. \r\n- Engaging and interactive: the lectures became more interesting (but it was a bit time-consuming, so he might not go over everything he needed to teach and told us to watch Kruskal's lectures)\r\n- Understanding: Max curves the final grade generously, especially if you show efforts, such as coming to office hours for help consistently or showing up to class and participating in lectures, then he will most likely bump up your missing 1%.\r\nCons:\r\n- Disorganized. Most of the contents I learned from this class were from Kruskal's videos and online resources. I hope Max could become more familiar with the topics over the summer and incorporate a structured approach to teaching in the future. For example, Max, if you're reading this, it would be helpful to have slides containing important notes for the class. While it's great to work through examples during the lecture, including them in the slides would save time (color-coded and animated). It would be ideal if the slides could be shared before or after the lecture.\r\n- Exams. Just terrifying. Well, it's not Max's fault because Kruskal wrote them, but my midterms haunted me. \r\n- Grading. It was really slow this semester due to the complications with the TAs; but it will improve, hopefully.\r\nAdvices:\r\n- If Kruskal is going to write the exams for Max's classes, then study the homework religiously. There were practice exams, but not really helpful. You should still do it for extra practices, but mostly focus on the homework of all the topics that would appear on the exam. \r\n- Go to office hours. The schedule needs improvement, but it's helpful.\r\n- Study group. Yep! Teach each other and review together.", "rating": 5, "expected_grade": "B", "created": "2023-05-25T23:43:08.634085Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Honestly it's kinda hard for me to fairly review Max given the class was co-taught with Kruskal but I'm doing it regardless to help people who may consider taking him.\r\n\r\nMax is very genuine, caring and makes lectures engaging but his knowledge was shaky (for 351 at least).  His curves are also very generous so if you're interested in getting a good grade, having a nice professor, and don't want lectures to be boring you may like him. If you want to learn at a very deep level and don't mind sacrificing a good grade, Kruskal is for you. The class in general was very unorganized but both Max and Kruskal have that sort of history but unlike Kruskal, Max is new and seeking to improve. \r\n\r\nDown the line I can definitely see Max being one of the more favored professors but I think he is just having a rough start since he is still new. Ideally I would want to give a 5 star but the class was just so poorly run I cannot despite it might being Kruskal's fault.", "rating": 4, "expected_grade": "C-", "created": "2023-05-26T01:40:04.817074Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Honestly, this is the worst class I've ever taken. Max co-taught with Kruskal so it was a given that the content would be insanely hard and the class would be ridiculously disorganized. Max is a great guy though and he really cares about his students, and despite the mess that the class was, he really tried his best to help everybody succeed. Under this co-teaching situation, it was a disaster, but under different circumstances I'm sure he will be really good.", "rating": 5, "expected_grade": "B", "created": "2023-05-26T02:01:51.533084Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Exams were very hard but this professor is awesome.", "rating": 5, "expected_grade": "B", "created": "2023-05-26T02:33:07.224771Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Nice guy that cares about his students and wants you to succeed. Seemed he was blind sighted by having to co-teach with Kruskal and wasn't prepared so lectures felt like that, very unprepared. He made up for it with a generous curve which was nice, a whole letter grade higher than Kruskals curve. 351 is a hard class, especially with Kruskal's material and exams but Max made that experience pleasant such that I don't think many people had to worry about failing. Unpopular opinion, Kruskal's content isn't bad nor are his lectures terrible but his exams are extremely difficult but that wasn't in Max's control really. Final average was a 52.5 percent.", "rating": 4, "expected_grade": "A-", "created": "2023-05-26T04:48:54.233000Z"}, {"professor": "Maksym Morawski", "course": null, "review": "+ Great teaching style\r\n+ Engaging\r\n+ Great with communication to students\r\n\r\n- Wasn’t prepared for lectures at times: Literally started watching another professors lecture video during his lecture to try to understand material\r\n- Lied about the curve he would give this class for 2-3 months \r\n- Takes a while to respond to emails", "rating": 2, "expected_grade": "", "created": "2023-05-26T12:57:43.160222Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Absolutely would not recommend class with him. His projects were fine and fair, but lectures and exams were horrible. The class was so unorganized, exams were horribly made and had very low averages. There were a lot of people who got 50s and also people who got 100s on the second exam which clearly shows it was a horribly made exam. The second midterm was also right before classes ended making the final seem pointless. His lectures are bad but instead of improving them, he tells you to watch videos and read articles if you want to learn the material. His review sheets that he makes during class are scarily organized and a majority of the stuff he said was gonna be on the exam was not there, making it hard to trust the review sheets at all. Overall, would not recommend this class with him.", "rating": 1, "expected_grade": "", "created": "2023-05-26T16:00:32.217733Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Definitely not deserving of a 5-star because of his lack of organization and preparedness for lectures, but he definitely does try his best to make the class less painful with Kruskal. Honestly, if it wasn't for the fact that he co-taught with Kruskal, I'm pretty sure things would've been much smoother than they were this semester, but co-teaching with Kruskal obviously wasn't his own choice", "rating": 3, "expected_grade": "B", "created": "2023-05-26T20:36:53.246486Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "The class was messy because of the co-teaching and he even acknowledged how disorganized and difficult the class was but he really cares for how his students performed and was open to change like recording lectures and posting notes online", "rating": 5, "expected_grade": "", "created": "2023-05-27T14:53:19.991017Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "351 with Max was a beautiful disaster. \r\n\r\nFirst, the review of the class: Max co-taught with Kruskal since this was his first semester teaching 351. As a result, we got all of Kruskal’s exams and homework assignments which are notoriously difficult. Max did not have control over what was being taught and the difficulty of assessments since Kruskal was in charge, and as a result, he sometimes stumbled over content (it’s hard to keep up with a mad scientist). It honestly seems like Kruskal and Max hate each other (understandably so) since there was a lot of miscommunication throughout the semester. To pass this class, this is what I did: I showed up to Max’s lecture with the expectation of getting a simplified overview. I did have to supplement the content to keep up: Kruskal has pre-recorded videos that go into the content in depth, and I binge watched those videos and reviewed the homework’s a few days before the exams. The exams feel similar to the homework assignments, but at the same time they are different, so it felt like a big wildcard, and I found it better to just YOLO the exams than to stress about them. My mantra: take inspiration from the homework assignments and express your creativity on the exams. I had no idea what I was doing on any of the exams, but try to grab the “easy” points and think on your feet. \r\n\r\nMax as a lecturer: he’s naturally charismatic and has a geeky sense of humor. I feel like he genuinely wants the class to pass. Even though at times Max was confused, at least he was enthusiastic while being confused? He would drop hints about the exam topics during the review which was helpful to dial in on, and his encouragement to keep us going while we were all flopping was helpful. At the end of the semester, his cutoffs were a lot more generous than Kruskal’s. For example, Kruskal’s version of an A- was an 80.5% while Max’s version of an A- was 69%. \r\n\r\nTLDR: if Max ever teaches 351 with Kruskal again, take it with Max and hang on for dear life.", "rating": 5, "expected_grade": "A-", "created": "2023-05-28T18:30:51.198350Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Max is a great person, but maybe not the best professor when it comes to co-teaching with Kruskal. This is after-all because Kruskal is Kruskal. This was not worth the hours of stress that this class put me through (especially the final) because the exam structure itself was impossible (Kruskal said the average should be around 65%) and the major delay in grades. This saying this course is mainly a rant against the way Kruskal structured it, Max didn't have much say over the structure or content. He gave us a large curve, but this also was probably the worst class I've taken with the CS department (but its because of Kruskal not Max). In conclusion, Kruskal is the villain and Max was forced to join the dark side.", "rating": 3, "expected_grade": "B-", "created": "2023-05-29T01:05:15.660070Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Maksym's 351 was co-taught with Kruskal, and this whole class was basically run as Kruskal's class with Kruskal's homeworks and exams. Max was forced to co-teach with Kruskal, in which Max was not very happy with as far as I know, because Max had little to no control over the material. Kruskal and Max were both discontent at each other, because Max didn't want to follow what Kruskal does.\r\n\r\nI think Kruskal's material is fine. His homeworks are definitely hard, but if you go to the TA's or especially Kruskal's office hours, they will explain what the problems mean. And that's really it, Kruskal's problems are all about understanding of the material. What this problem wants us to do, what this algorithm does, why this algorithm behaves such a way, what this problem accomplishes, and why this problem is relevant, etc. If you really understand that, then Kruskal's 351 homeworks and exams will come off pretty easy. As for the notorious last \"coding interview\" problem on the exams, if you can do Leetcode medium without difficulty, you will do well :). But jokes aside, these \"interview\" questions get a lot of hate because there's really no way to prepare or study for these questions, but like I said, if you understand what this problem is trying to accomplish, then they should come off pretty easy. It's all about critical thinking, testing you whether you can come up with an efficient solution, and you will get partial credit even when you write a brute force solution. Kruskal doesn't want you to write 50-100 line of code that does complex stuff, the solutions to his coding problems are always simple pseudocode. Kruskal may be very disorganized and just not good at administering class, but he is seriously one of the most knowledgeable people in the faculty, and you will learn a lot when you go to Kruskal's office hours. He's been teaching and researching algorithm and theory for decades, and it shows.\r\n\r\nNow, onto Max. Like I said, Max wanted to go with Justin's material to teach his class, so him being forced to follow Kruskal's material was probably stressful for him. I'll give him credit for trying his best. He's definitely someone who wants his students to pass the class, although that is not evident in his teaching, but in the curve. He gave a lot more substantial curve than Kruskal's even when Kruskal's curve was pretty large, which was about one letter grade difference, although the pass/fail cutoff was comparable for both of them. Does Max teach well? Well, that's another matter.\r\n\r\nI think the problem with Max is that he severely lacks knowledge on the material. It's not that Kruskal's material is different from Justin's or whatever, he just doesn't know the subject well enough to lecture it. I'm sure Max is very competent when it comes to an actual practice as an engineer given his career, but I think his teaching is very shallow, although he has potential to improve. I definitely think Max wants to become the next Justin, someone who is approachable to his students, explains the concepts well, and have the majority of his students get an A. The thing is, I barely learned anything from Max's lectures. Pretty much the entire knowledge I learned came from Kruskal's recorded lectures and his office hours. The difference in the level of quality in answers you get from Kruskal's office hours and Max's office hours is pretty significant. I definitely think that Max will improve a lot, but I can't say that I learned a lot from him.\r\n\r\nDespite the co-teaching, there is a pretty huge difference in the philosophy of teaching 351 between Kruskal and Max. Kruskal emphasizes in thinking about the problems and how to solve them creatively. The problems may be challenging, but you gain so much once you solve them. The way Max seemingly wanted to run this class is like a standard class, where you just take notes and you can do well on the exam just from the rote memorization. The difference in the philosophy of the subject is probably why Max and Kruskal were so unhappy with each other. I personally think that critical thinking and understanding is much more crucial rather than simple regurgitation when it comes to algorithm and theory. This is probably why I learned a lot more from Kruskal and give him more credit than Max. But I think Max has a lot of potential and I definitely do see Max as a good lecturer in a few years.\r\n\r\nOne thing I will note about 351 is that it is very poorly structured and Max did his best for his first semester teaching it. It's not about exams taking 80%+ of the course but really more about the content of 351. 351 is too much math and analysis heavy, and I do wish the class teach more interesting stuff like dynamic programming instead of spending too much time on sorting algorithms, constructive induction, and NP etc. The way Kruskal structured 351 is pretty unique and arguably odd compared to algorithm classes at other CS schools, so I can definitely feel Max's frustration in having to be forced to teach that way only. But then again, the whole CS curriculum at UMD needs some fixing.", "rating": 3, "expected_grade": "A+", "created": "2023-05-29T09:35:11.381315Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Absolutely would not recommend class with him. His projects were fair and doable, but lectures and exams were horrible. The class was so unorganized, exams were horribly made and had very low averages. The second midterm was also right before classes ended making the final seem pointless. He seemed to acknowledge what was wrong or that the results were bad but then just kind of moved on.  His lectures are bad but instead of improving them, he tells you to watch videos and read articles. His review sheets that he makes during class are scarily organized and a majority of the stuff he said was gonna be on the exam was not there, making it hard to trust the review sheets at all. Overall, would not recommend this class with him.", "rating": 1, "expected_grade": "", "created": "2023-05-30T21:59:19.620510Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "My only complaint is that the class is a bit disorganized. Other than that, I think he did an amazing job teaching the class. If you have a genuine interest in the content covered, you will do great.", "rating": 5, "expected_grade": "A+", "created": "2023-05-31T02:12:44.881721Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "Bro is so cool. Only lecture I attend.", "rating": 5, "expected_grade": "A", "created": "2023-09-05T15:54:21.556755Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "So I had Max for 320 last semester. I wrote a Piazza post 3/4 of the way through the semester, discussing the lack of organization, lack of resources, and how the exams were just bad. Majority of the class agreed to that post and he said he would address the feedback. He mentioned he would have dropped the final exam, but he didn't want to change the syllabus. He also did mention he would also drop the final for the following semester, especially since it would be redundant along with a final project. From what I hear, he did not do so. I would avoid Max and wait for a professor who can support students through the learning process rather than throwing the kitchen sink at them and seeing what sticks.", "rating": 1, "expected_grade": "", "created": "2023-09-07T14:17:44.552220Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "The communication in this class is extremely sporadic and homeworks were not nearly graded in time to review for exams; he frequently made mistakes during lectures and overall seemed unprepared for class.", "rating": 1, "expected_grade": "A-", "created": "2023-11-08T19:06:39.968780Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max is nice but can be a bit arrogant and often makes mistakes in class. His slides are minimal, and he's proud of it, refusing to change them. Although he suggested Dr. Fardina's slides as those are really detailed. I wouldn't recommend taking his course.", "rating": 1, "expected_grade": "A", "created": "2023-11-28T21:47:51.808090Z"}, {"professor": "Maksym Morawski", "course": "CMSC106", "review": "Maks is really nice and it's obvious that he is on our side, and knows how difficult the course is. His lectures are good and he posts the material afterwards which is helpful, however since the class is naturally difficult and hard to keep up with you should make sure you practice a lot on your own time to ensure you do good. The projects get progressively harder, so make sure you dont underestimate how long they take.", "rating": 4, "expected_grade": "B", "created": "2023-12-02T20:07:29.477256Z"}, {"professor": "Maksym Morawski", "course": null, "review": "Only lecture I never missed. Expect to get smoked on the exams, as they are unique in that they are very open ended. Often times there will be several different valid answers to a question, so do your best to deeply understand the topics. \r\nSlides are often bare. Provides recordings if you ask him. Most approachable professor I have had.", "rating": 4, "expected_grade": "B+", "created": "2023-12-05T20:30:24.130921Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "Although this was Max's first semester teaching CMSC250, I can't recommend him in good conscience. Lectures are highly disorganized. He frequently shows up with mistakes in his prepared materials and makes several errors in most proofs that he attempts in class. The first midterm was ridiculously long and ended up with a 70-average and he only provided a curve after many students wrote several paragraph long requests via Piazza. Grading is a nightmare. We have a weekly problem set (which I believe are written by the TAs) which are often filled with unclear questions and/or typos. These problem sets take the instructors weeks, and sometimes months, to grade. On both midterms, we were tested on concepts that we had never actually been graded on yet since we were still waiting to get our submissions back. I fear this may be the case on our upcoming final exam too. He's also bad at replying to emails in a timely manner. Also, I don't think he gives good instructions to TAs since their responses on Piazza are very short, abrupt, and sometimes teeter on rude.", "rating": 1, "expected_grade": "A", "created": "2023-12-09T19:07:49.306920Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Easily my favorite professor I've had at umd, and made me want to go into data science. The class is a bit disorganized, but exams and homework are pretty fair. Max has the only lecture that I actually looked forward to attending, he has so much knowledge to share about the actual industry (he's worked at google, ebay, etc), he's super chill and understanding of students, and a super entertaining dude. Can't speak for any of his other classes but 100% recommend taking 320 with him, class has been pretty easy. Definitely goat potential", "rating": 5, "expected_grade": "A-", "created": "2023-12-11T23:12:04.925087Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Lowkey I love Max. I understand the criticisms, but if you go to class, pay attention, and just try your best on exams its really really easy to get an A. Just take a look at his grade distribution. He really prioritizes students learning, which sometimes comes across as not caring about grades. Just have faith and wait for the curve.", "rating": 5, "expected_grade": "A", "created": "2023-12-12T18:48:01.620298Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max is a nice guy with decent career advice and industry knowledge and that's about it when it comes to his teaching. While his projects were insanely easy, they in no way prepared you for his exams. He expects people to have a deep understanding of the content but doesn't realize that to get to that point of deep understanding you need quality practice material and assignments that build up your knowledge. The lectures are incredibly surface level and showing up to class is a big waste of time, I found it hard to separate the word vomit/tangents from the important content. I didn't feel like I learned much in this class besides how to Google. Overall, I would recommend taking a different professor.", "rating": 1, "expected_grade": "A-", "created": "2023-12-14T06:27:25.194132Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "Honestly, Max is not too bad as a professor. I have to admit that he wasn't my first choice for 250 because Kline was rated better, but I had to take him because of course conflicts. \r\nTake him. It's a easy course. Most of it is common sense. Sure, you'll be introduced to new stuff, but with Max it was pretty easy as a course. I saw my friends struggle with Telli and Kline, but I studied for about 7 hrs before each of Max's exams(including the final) and I did pretty well on all of them. Homeworks are graded extensively and we have discussion worksheets that are graded which I didn't love but overall he's fine.\r\n\r\nRocky start, but he's been learning to teach better and get more organized (in the first few classes he didn't even get the name of the course right) but now he makes powerpoints and goes over everything; it's good enough honestly. Make sure to read Justin's notes which are online because his whole structure was based on it. Good luck!", "rating": 4, "expected_grade": "A", "created": "2023-12-14T23:20:32.056176Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "Max is understanding and approachable, but I don't know if I would suggest taking one of his classes (or at least this class) based on his teaching style. Throughout the semester lectures were disorganized (got a little bit better towards the end, but still weren't great), and he would sometimes leave gaps in the steps of a problem/not do some problems since they were \"too annoying\" (but we would have to know how to do them). This semester, the class weights were 40% homework, 10% lab worksheets, 30% midterms (2 midterms), and 20% final. The homework problems were difficult, but you were able to get most done on your own (you have at least a week to do each of them) and if you had any questions about any of the problems you could go to office hours and the TAs would help you understand them better. The worksheets were every Wednesday and they were done in discussion (some TAs would go over how to do the problems, but mine didn't) and they were graded on completion. The midterms were fine for the most part, but on both midterms, there was a problem where very few people got them completely right (e.g only 5-10% of people got full credit for them) so your exam grade basically dropped a letter grade just from that one problem (on the first midterm that problem ended up getting dropped, but it was a special circumstance). Max also taught using Justin's notes (so you could have chosen to not attend lectures). \r\n\r\nI feel like the class would have been a lot better if Max learned the material ahead of time and planned the course in a way that would work for him (instead of using Justin's notes, there are pros and cons to not using Justin's notes though). I felt like he was learning the material/what he was teaching the day of or the night before the lecture because he often made mistakes when explaining/doing the problems in the lecture. I also felt like the class was being run by the TAs and Max (and this isn't necessarily a bad thing), but it felt like the TAs would tell him often what to do and what not to do.\r\n\r\nI was going to give Max a higher rating, but the following reasons are why I didn't. The final was more challenging than the midterms and I would almost go as far as saying that some of the problems on the final were as hard as the homework problems. I also felt like there was a problem on the final that was just straight-up, not possible (maybe it's a skill issue, but it didn't seem possible to do based on what the question was asking). This leads me to another issue that I have with the class. Almost all homework assignments/review sheets that we had in the class had typos which is frustrating (since some problems are either impossible/completely different even with a slight change in wording). I will say that most typos were noticed and fixed quickly, but I don't think it should happen that often (this is a red flag for me because if typos happen that often are they reading/doing the problems beforehand?).\r\n\r\nMax is a 10/10 person, but a 3/10 teacher in my opinion.", "rating": 2, "expected_grade": "A-", "created": "2023-12-16T01:24:29.071328Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Class is just a mess. Grading takes forever (Homework due late October still is not back yet) and Prof. Morawski doesn't seem to really care about that. Our final project was released extremely late and last homework was also released really late. Barely any communication about this. The last homework was released so late that we were basically expected to work on it over Thanksgiving break, when it was originally supposed to be due 2 weeks before break. None of the homework is that hard (IMO at least) but it's just annoying that you continuously have to check up to see if the professor has even released the homeworks when he's already behind schedule. \r\n\r\nProf. Morawski also is just bad at teaching, plain and simple. Lectures seemed more like a stand up routine to him. As other reviewers said, the slides have minimal info, and equations are often wrong. There's no clear definitions for anything, you'll have to look elsewhere. Everything is taught in an example/high level way but you are expected to understand and replicate at a low detailed level. For example, with hypothesis tests, you will not find detailed definitions in the slides that include everything he wants you to know. You have to google these things or use the other prof's slides. This is kind of insane to me as Prof. Morawski has taught this class MULTIPLE times before. And, you can tell that he thinks his teaching style is superior to other professors, which is frankly hilarious as he also goes on about how he thinks he didn't explain things well or how the exams he wrote/gave us are bad exams.\r\n\r\nHomeworks and projects always needed numerous corrections-- again, kind of ridiculous for a professor who has taught this class before. Good luck starting the homework early, because he will probably change multiple things in the first few days of homework release. \r\n\r\nExams had questions where you were supposed to use your \"real world brain\" and think outside the box. What does this actually mean? Trick questions and ones that are long/confusingly worded for no reason. We had some tricky questions on things that he *explicitly* did not teach us previously due to cancelling class multiple times or having the other prof teach us for a class. I understand that he had to cancel class for personal issues, but I didn't think it was fair to have tough questions on concepts that he himself did not teach us.\r\n\r\nAnyway, all of the below reviews are very accurate as to how you will feel about Prof. Morawksi. You will either be mildly irritated at his lack of organization and general lecture style, or you will become part of his fan club. No in between. You will not feel neutral about him.", "rating": 1, "expected_grade": "A-", "created": "2023-12-16T20:15:56.602513Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "While Max himself is a great person, very funny professor, and super engaging, I'm not sure many people in the class enjoyed his teaching style and I'd recommend not taking him for CMSC250. Most of his lectures were incredibly unorganized, and his notes were never uploaded on time. He posted Justin's notes which helped a lot more than his own notes, so I guess that helped. There was very unclear communication between students and TAs about grades on homework and discussions, and most grades were entered after the exams that covered them. Fortunately I figured out most of the content on my own, but Max's lectures didn't really help much at all. I would try to take another professor if you could.", "rating": 2, "expected_grade": "A", "created": "2023-12-18T02:32:54.689059Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Guys a G. Hilarious. He ACTUALLY WANTS US TO LEARN THE MATERIAL. He doesn't want the education to continue the way it is, where students can just cram for an exam and then forget about it. This leads to harder exams. Get over it. If you wanna take the easy way out take another major. If you go to class and PAY ATTENTION he shares useful information and knowledgeable insight to his experiences in the industry. My only complaint is his slides are pretty bad, but luckily he's coteaching with Fardina who has pretty excellent slides so as I study for the final I will be going off her slides. They are just more detailed. He should improve his slides because with just his slides it hard to know whats going on. If you care about learning and are interested in Data Science take Max. Its really entertaining due to Max being the way he is and pretty interesting content compared to some of the boring an useless CS classes I've taken here.", "rating": 4, "expected_grade": "B+", "created": "2023-12-18T05:44:20.347182Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max's lectures are fairly unorganized, and he oftentimes goes off-topic. He is more engaging than the average CMSC professor.", "rating": 2, "expected_grade": "A-", "created": "2023-12-19T05:01:43.935665Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I thought this was the first time he was teaching this course (F23) so I was willing to excuse disorganization. Seeing as he's already done this before, this semester was inexcusable. If there is another professor available, take 320 with them. The class final project was somewhat of an afterthought and was just a 15% of your grade homework tacked on the end of the semester. It was Doctor Fardina's first time teaching the course, yet she put together a much better experience over the semester (specifically the last two exams: much higher average score on midterm 2 and allowed a formula sheet on the final/was very clear about what topics to review).", "rating": 1, "expected_grade": "B", "created": "2023-12-19T18:40:50.195141Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "TLDR: low-medium workload. Avoid him if you just want to get through 250 as painlessly as possible, take him if you don't mind dealing with a bit of BS for a fun and memorable professor. \r\nOne common thread you'll see throughout Max's reviews is that the class is pretty disorganized, that held pretty true this semester too. He frequently made simple mistakes during lectures, had practice problems that were wrong or incomplete, and on occasion something on a homework or exam pops out way harder than it was supposed to. Grading speed was also a big issue, although the homeworks were much harder than the rest of the class/exams. I can see if you just want a straightforward professor who posts all their notes nice and neat, is consistent with teaching, and is generally predictable why you would not like Max. If, however, you commit to going to class and can deal with a little BS, you'll find him a very memorable professor who had the class bursting in applause for anything from getting basic arithmetic right to designating an entire exam problem extra credit. I genuinely enjoyed my time in the lecture, even through all the hiccups. If that's something you can see yourself doing, give him a try.", "rating": 5, "expected_grade": "", "created": "2023-12-19T20:36:31.588882Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "he's VERY funny, but his slides are minimal and the tests were HARD.", "rating": 3, "expected_grade": "B", "created": "2023-12-20T01:05:38.170362Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "Nice guy, but can't teach and bad final. There was legit a problem on the final that was not doable.", "rating": 1, "expected_grade": "A-", "created": "2023-12-21T05:27:39.013344Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "I guess it was his first time teaching but he's horrible during lectures, made so many mistakes, and is very unprepared. Towards the end of the semester good luck reaching out to him as well, he disappears on you and responds to like one piazza post every blue moon. Understandable because it gets busy but we students have questions and concerns. TA times were also posted but they come as they please. I guess if you're willing to self-teach yourself the grade distribution is pretty good.", "rating": 1, "expected_grade": "", "created": "2023-12-22T08:00:37.979205Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Runs an incredibly practical and applied data science class, which is super useful and unlike most other courses at umd (especially if you want to be an actual data scientist, you'll learn tons of things to put on your resume). This is my second course with Max, and the disorganization has definitely improved, but is still pretty bad. Regardless, it's clear that he LOVES this class, and he's incredibly knowledgeable on the subject (has industry experience at Google and some startups). Would definitely recommend if you can put up with the long wait time for grades to come in, and the generally disorganized course structure.", "rating": 4, "expected_grade": "A", "created": "2023-12-22T16:35:20.998825Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "Max is pretty mediocre, but an entertaining guy and his class isn't difficult. His lectures are somewhat poorly structured and he frequently makes mistakes while lecturing. Occasionally he'll admit he's not well-versed in what he's teaching at the moment. He often changes course policies at the whims of the TAs, which can be frustrating as students never know exactly what to expect. Overall the class isn't run very well. \r\n\r\nMoving on to his positives, he gives out weekly homework which is great practice material but not too difficult. There are lots of helpful third-party resources given to students so it's hard to get lost or fall behind. The midterm exams were both fair and easy, and the first one was curved up significantly. The final was long and difficult but had a heavy curve, I personally got above a 100 after the curve. \r\n\r\nMax is fine. Take him if there aren't better options available. 250 isn't a hard class, but with Max you'll have to put in most of the effort yourself to succeed. I think he has room to improve into a good prof if he puts more effort into class organization and consistency.", "rating": 2, "expected_grade": "A", "created": "2023-12-22T22:36:51.727084Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Nice guy but going to his class is useless because you can just get all the information needed from Fardinas slides and online. He writes nothing on his slides and doesn't post his recorded lectures unless you ask. The coding assignments weren't bad but to get full points you have to do more than what the directions are asking. He grades kinda easy and there are multiple opportunities to get extra credit. HIs exams are not formula or math-heavy.", "rating": 3, "expected_grade": "B+", "created": "2023-12-23T15:46:27.838843Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Overall, I think Max made data science my favorite course that I've taken here at UMD. There are still truths to some complaints here, but the positives are still far greater than the negatives and the way it's taught is so unique so I think people should still take this class with Max (or at least go to his 320 lectures when they happen, since they're quite interesting, humorous, and thought provoking).\r\nFirst, the cons: Yes, the class was quite disorganized, we had an assignment due in October that wasn't graded until the last day of finals. Some problems were unclear or needed us to search up information on our own (but this research was very simple and not really an issue). He is unprepared sometimes; he mentioned some lectures went way faster than expected, or will forget to put something very important on slides, and also stopped posting recordings for lectures which made it a bit hard to study for exams. Additionally, he isn't the best at math, so he'll sometimes make mistakes on some slides or formulas, but in practice we hardly used formulas so this hardly disrupted the flow of the class. In terms of grades, the other section for Fall 2023 (with Fardina) was basically a guaranteed A (the average on Max's exams was about 77%, Fardina's average on exams was about 92%) so honestly, if grade is the [only] thing you care about, maybe you should take it with Fardina based on the stats.\r\nBut Max's section and thoughts have many positives: The overall grade for the regular assignments and final project (which were worth 55% of the class) was at 95% so no one really risked failing the class, and most of these took just around 2-4 hours to complete since there are lots of guides to do what was asked. Where Max really shines is in his lectures: they were the most consistently engaging ones that I've been through at the university, always getting people to ask questions, cracking jokes and being relatable on what being in CS is like. The way he teaches the course isn't just learning data science in how to design & execute an experiment, because he also notes where it's relevant and useful (he mentions how Goodhart's law is seen in practice through grade inflation, I wonder where this could be present...), what the industry currently uses in practice (how does Netflix or Amazon actually recommend things), and bringing his own industry experience to elaborate on what we would do working in data science. Additionally, he also goes on some important side tangents about other important topics, like critically thinking about what grades are, career advice and thinking about interviews, how to ingest ethics in practice, and other considerations in life that many other professors don't touch (he informally holds a group of people that learn more on these general life skills). In the end, the class is such a unique, refreshing, and positive experience that I'd advise everyone that can take 320 to take Max's section when he teaches it.", "rating": 5, "expected_grade": "A", "created": "2023-12-23T17:24:34.998525Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I would not recommend him for this class at all. I had quite a bit of experience going into this class and as other reviews mention, it TRULY is disastrously organised. His slides were too minimal, and he would/could not explain concepts clearly (which he acknowledged) and then we'd be tested on minute details about those very concepts! His \"review guides\" would tell us we'd be tested on some topic, and that topic would never show up on the exam! He actually prides himself on his \"quirks\" but it's super annoying because it's too specific and not relevant. His office hours are also always filled with the same people chatting away so it's hard to ask him questions. I had him for 351 and I thought this course would be better but it's about the same. I don't think I learnt anything from him in either course.\r\n\r\nHe'll tell you cool stories about his time in the industry and that will usually be enough to distract you from the real problem that he doesn't know the content well enough to teach it. NEVER TAKE ANY CLASS WITH HIM!", "rating": 1, "expected_grade": "B+", "created": "2023-12-24T02:12:21.423126Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Possibly on the same level as Kruskal, and that tells you something.", "rating": 1, "expected_grade": "C", "created": "2023-12-24T04:17:53.483805Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I had Max for 320 this semester (Fall 2023) and 351 last semester (Spring 2023), and all I can say is that he is a great lecturer that genuinely cares about his students and wants them to succeed when they go to the industry. Many students complain that his slides are not comprehensive and that we need to google most concepts to better prepare for exams. However, I would argue that this reflects exactly what data scientists (and most CS related jobs) are doing in the industry. You are just required to have a basic understanding of class concepts, so googling stuff and learning the basics isn't really that bad. Max's style of teaching prepares the students to better navigate real-world challenges and to not be always \"spoon-fed\" with information.\r\n\r\nRegarding the coursework, Max's exams are essentially about two things: Demonstrating basic understanding and extending the class ideas to real-world situations. I didn't study a lot for exam 1 and the final, and I got an A in both of them. If you hope that you will get an A by memorizing concepts and not actually understanding how the algorithms work and the math behind them (in a general/basic level), do not take the class with Max.  However, I must mention that Max sometimes messes up exams, where the average would be 70% or less. Though, you can always get partial credit and extra credit in all of his exams and assignments. Also, you can always email Max about anything, including bumping up your grade to the next cutoff if you think you deserve it! In general, Max's classes are easy, and you will do just fine if you attend lectures and demonstrate basic understanding in exams.", "rating": 5, "expected_grade": "A", "created": "2023-12-24T23:48:40.957700Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I felt extremely disappointed at the end of this course! It seems like Max always has fans who think he is cool, and obviously, his lectures were nice. But the exams were EXTREMELY difficult! The average of Mid 02 was extremely low, and he was absent for some classes ( he is was sick though). He promised to curve that exam and ended up curving NOTHING! Before that, he openly admitted to us that it was unfair, and it felt like everyone was depending on it. Extremely disappointed, as the overall average for Fardina's section was so much higher than ours, and as heard from that section, she was very considerate to the students' needs. Everyone talked about how cool he is, but no one says the reality - how disorganized and less affectionate he could be.", "rating": 3, "expected_grade": "A-", "created": "2023-12-26T05:36:19.817781Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "He is trying his best to reach Kruskal level. Do NOT take him as your professor. Anyone else would be better. He just gets worse and worse each semester (based on what I’ve read). Not a very understanding professor.", "rating": 1, "expected_grade": "C", "created": "2023-12-26T19:34:29.323514Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "My opinion:\r\nHe is not that bad as some of the 1-star reviews state, and also not as good as some of the 5-star reviews. He taught the class in a way that was different from what one would expect. The subjects taught in class are very simplified, so students are encouraged to do outside research on what you learn in class. The projects were really fun for me as for some of them we were free do implement them how we wanted to. On the other hand, the exams were quite difficult and required us to expand on what we have learned in class to a large extent.", "rating": 3, "expected_grade": "B+", "created": "2023-12-28T15:07:39.386039Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "Don't get me wrong - he's a really nice and chill professor and takes his feedback into consideration. But, he is SO DISORGANIZED and that makes his lectures difficult to follow. He also seems unprepared coming during lecture and makes a handful of mistakes throughout. He came in once claiming how he had \"looked at these problems beforehand\" and \"knows how to solve them\" but as soon as he got stuck on one, he just skipped it with an \"ah whatever\" mentality. Also, his TAs (this semester) had a lot of attitude.....\r\n\r\nOverall, it's not the end of the world if you get him as a professor, but just know that you'll have to put in a lot of effort.", "rating": 3, "expected_grade": "A-", "created": "2023-12-28T16:07:51.791882Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "The class with Max is generally straightforward, especially the programming assignments; the homework on SQL and Pandas borders on trivial, and the later assignments simply require using some Python libraries and can be completed with the help of a wealth of online tutorials. A couple assignments involve writing a report, and while they can be graded rather subjectively, it's simple enough to manage a decent grade on them with a few hours work. Our final project was released quite late, and thus was reasonably easy and minimal in time required.\r\n\r\nThe exams are designed to be open ended and make you display true conceptual understanding, as opposed to simply regurgitating material from the slides; it's not clear how effective this model was, as the averages on the first midterm were very high but were below a C for the second. Regardless, all the exams are doable if you really think about what Max is asking you to answer (rather than assuming what he is asking based on how a normal CS exam might go).\r\n\r\nMax is prone to going on tangents while lecturing, keeping track of his idiosyncrasies can be annoying when trying to submit work that meets his standards, and his slides are wholly unhelpful; in spite of all of that, if you follow along in class and spend a few hours studying for the exams you'll be fine. I ended up enjoying Max's teaching style as a whole, even if it could sometimes be strange or frustrating. Recommend.", "rating": 4, "expected_grade": "A", "created": "2023-12-31T08:33:25.172195Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "Nice and supportive professor. Often asks for feedback and does listen to his students. This semester wasn't his best since this is his first time teaching and he had some health problems. But I believe he does have a lot of potential and will improve. Also, I would say he needs to do better at working with his TAs instead of letting them make the homeworks and discussion worksheets.", "rating": 4, "expected_grade": "A", "created": "2024-01-04T02:25:12.917289Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "Max was an overall good professor. The start of the semester was incredibly rough as it was his first sem teaching the course and there was a lot of ambiguity as far as assignments went and what was expected of us in terms of proof structure and the detail to which we had to explain arguments. However, as the semester went on Max was very adamant about listening to feedback and implemented many of the suggestions we asked for, including extra credit and more detailed instructions for assignments. Overall he's a good professor who genuinely cares about his students and will listen to their suggestions.", "rating": 4, "expected_grade": "A-", "created": "2024-01-19T17:26:26.572946Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "He is a quirky guy who has his funny moments but at the end of the day, is a terrible instructor and comes off as incredibly arrogant and annoying. Yes, his lectures are engaging, but for all the wrong reasons. He rambles on about his work and personal experiences but ends up teaching very little substance as a result. He takes pride in his slides for being minimal, which isn't a problem by itself. But when you combine minimal slides containing useless information and formatting and an instructor who rambles on about pointless topics the whole lecture, then it becomes a problem. \r\n\r\nExams are not fair. He tells us that to do well on exams we need to have a deep level of understanding of the material and to think outside of the box, which again, isn't a problem by itself. But he never gives us practice material to achieve that, as the homeworks are super straightforward and generally unrelated in concepts to exams, and doesn't teach properly enough to expect that from us. This is evident from our exam 2 average, which was 69 percent. Comparing that to Fardina's class (the instructor he was co-teaching with), which was 86 percent, it becomes comically unfair. He also never curved because of that exam even though he said he would. He said he instead \"compensated\" by making the final a bit easier, which is funny because our final exam average was still low at 82 percent compared to Fardina's 96 percent. \r\n\r\nAt least CMSC320 isn't too difficult conceptually, with much higher weightage on homework, and less on exams, allowing many students, including me, to barely manage to get a good grade. I just feel really bad for people who were stuck with him for CMSC250 and/or will be for CMSC351, because those are objectively two of the most conceptually difficult CS classes students will take, with high weightage on exams, and Max will do everything to make it even harder for you.", "rating": 1, "expected_grade": "A", "created": "2024-01-20T07:20:29.712400Z"}, {"professor": "Maksym Morawski", "course": "CMSC106", "review": "not a bad professor, very cool and chill but his teaching style was a mess. lectures were just slide shows and sometimes hard to follow all the information given to beginners without practice. listened to student feedback throughout the semester and was flexible with exam dates. exams weren't hard but definitely need to study for them if you don't feel mastered at the topics. not the worst class, but it was very messy and unorganized, the TAs definitely made the class better to follow.", "rating": 3, "expected_grade": "A+", "created": "2024-01-23T16:54:36.895213Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "no way bro grades subjectively", "rating": 2, "expected_grade": "B", "created": "2024-02-06T21:20:26.210698Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "This is the first Professor and class where I felt exams weren't just based on memorizing information. The first exam taught me more in an hour than all of the other professor's notes all semester.\r\n\r\nI really like these exams since they set us up to develop problem solving skills in the context of coding/jobs and it's definitely worth it if it costs us a couple points. The only issue I have with this is if the curve is based on both professor's classes, since one class had easier exams.\r\n\r\nApart from that Professor Morawski is very good at designing a course meant to actually teach you the concepts and the thought process rather than just regurgitating information that is hand-fed to you.", "rating": 5, "expected_grade": "", "created": "2024-02-16T22:09:27.587787Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Maksym is funny, but he is a mess of a professor. He's disorganized, chaotic, and EXTREMELY egotistical. Even if he messes up, don't expect an apology from him! I feel bad that everyone is comparing him to Justin but Justin's on a whole different league. Justin kids hit the lottery frfr.", "rating": 1, "expected_grade": "", "created": "2024-02-19T23:21:47.300777Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I second what the person below me said", "rating": 1, "expected_grade": "A-", "created": "2024-02-21T03:59:20.397520Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "literally a younger version of kruskal. funny and chill, but as the review below says, arrogant and annoying. also very messy and unreliable. bro yaps way too much and tbh i've been going to the TA's to learn the stuff.", "rating": 1, "expected_grade": "", "created": "2024-02-23T23:39:59.905118Z"}, {"professor": "Maksym Morawski", "course": "CMSC250", "review": "Max is goated, super down to Earth, very fun guy. He's a lot more human than most professors, and is much more likely to add curves and change class circumstances based off of feedback. He is also much more of a normal person than most professors, so while he might make some mistakes in lectures, he also teaches in a way that makes the content much easier to understand.", "rating": 4, "expected_grade": "A+", "created": "2024-02-26T03:29:28.672121Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Horrible teacher never take him. Bro tells us to attend different professors lectures, read their notes, and then study their practice materials but has the audacity to make his own exams when he's not capable of teaching the course. He should let the big boys like Justin handle the real work next time like making the exams.", "rating": 1, "expected_grade": "A", "created": "2024-02-26T21:48:32.236771Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "He isn't the worst professor in the CS department, but he's close. He has told us multiple times in lectures to review other professors notes, slides, or practice problems because he isn't able to explain or define the topics clearly himself. His exams are made to be tricky and he puts leetcode style questions throughout, making the exam obnoxiously difficult for no good reason. He is a funny and good guy personally, but is very disorganized and hard to follow during lectures. I would advise taking another professor for 351 if possible.", "rating": 1, "expected_grade": "C+", "created": "2024-03-13T16:47:29.388019Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "Max has many issues which keep him from being worth taking at all. His first issue is that he is basically a glorified substitute teacher for the better professor who is Justin Wyss-Gallifent. All Max does is rehash his notes in a worse and confusing manor. He also takes the homeworks directly from Justin, so you begin to wonder what he actually does. Then when the exams come around you find out this is the only reason he wants to teach. He likes to make his exams as difficult and unorthodox as possible. He will put questions that were not remotely covered in class as he teaches the material from Justin's notes word for word and then tests us on questions he personally likes. The other problem is he puts very little effort into it as he just generates the questions using LeetCode then lets his TA's attempt to convince him out of giving some of the terrible questions that are generated. My main issue is that there is no textbook or notes provided from Max to learn how to do these weirder questions that he asks on the exam. Maybe for example if he made his own homework instead of just giving us Justin's, then we would be better prepared for his exams. Due to this 'co-teaching', which is basically copy and paste from Justin, we are prepared for Justin's exams and not Max's exams in the slightest. I would strongly advise against taking him for any class.", "rating": 1, "expected_grade": "", "created": "2024-03-14T17:25:33.327424Z"}, {"professor": "Maksym Morawski", "course": "CMSC351", "review": "I'd give this guy 0 stars if I could. His exams are insanely hard for no reason. He expects you to memorize every little minute thing that would never be useful in real life and his lectures suck. At least for cmsc351, he is teaching exactly the same content as another professor (Justin)... just worse and his exams are considerably more difficult. In the past for other classes he's tried to raise the grade requirement for the letter grades (as in an A- would be a 91 instead of a 90 and a 90 would be a B, a B- would be an 88 minimum instead of 87, etc.) and the only reason he didn't was because his TAs all organized against him doing it. He made an exam that had like 20 potential questions and his questions were so bad that the TAs ruled out 15 of them for being overly confusing and impossible to understand. He literally advises all of his students to go to the other professor's lectures and \"jokes\" about how bad of a lecturer he is. He's god awful, I genuinely cannot understate it. This man has singlehandedly caused me an insane amount of stress this semester. DO NOT TAKE HIM.", "rating": 1, "expected_grade": "", "created": "2024-03-29T03:59:37.927257Z"}], "name": "Maksym Morawski", "slug": "morawski_maksym"}