{"courses": ["LING240", "LING321", "LING200", "LING330", "LING698T", "LING499C", "LING888", "LING499C", "LING200", "LING321", "LING499C", "LING698T", "LING888", "LING240", "LING321", "LING499C", "LING200", "LING240", "LING321", "LING499C", "LING698T", "LING888", "LING200", "LING330", "LING499C", "LING689T", "LING200", "LING240", "LING321", "LING499C", "LING698T", "LING888"], "average_rating": 3.7391, "type": "professor", "reviews": [{"professor": "Margaret Antonisse", "course": "LING200", "review": "Dr. Antonisse is a pretty good teacher. She covers a LOT of information throughout the semester, so attending class is necessary if you want to do well. There are a decent number of assignments, but it's really difficult to work ahead. She doesn't really post stuff on ELMS when she says she will, and even if she does, a revised assignment will be posted the next day. This class is frustrating if you have a heavy courseload from your other classes", "rating": 4, "expected_grade": "A", "created": "2014-12-04T15:23:00Z"}, {"professor": "Margaret Antonisse", "course": "LING200", "review": "Dr. Antonisse is a thorough professor. She knows her stuff and mostly expands on what is in the book. She is a bit of a stickler though, so make sure to not miss any assignments.\n\r\nThe weekly prep work is sort of annoying. And for the most part you can get full points for them, but only if you have a TA who grades it that way. I had one who took points off for things. A very informative class, just make sure to keep on track with things and meet with the TA if you get lost. ", "rating": 4, "expected_grade": "C", "created": "2014-05-21T19:48:00Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "Dr. Antonisse is a decent lecturer, but sometimes explains straightforward concepts in a more complicated way than necessary (she's reasonably accessible for out-of-class clarification). Regardless, the content of 240 is awesome- the concepts are interesting, useful, and helpful in understanding modern human communication. Prof could be better, TAs were average, but the class is great.", "rating": 4, "expected_grade": "A", "created": "2012-08-08T12:22:00Z"}, {"professor": "Margaret Antonisse", "course": "LING321", "review": "The other reviews on here are pretty accurate; I'm mostly posting because I had Dr. Antonisse for a different class. My only real complaint is that the criteria for the final presentation were a bit unclear. If you take LING321, make sure you speak up in class, because a lot of the time the questions she asks tend to go dead otherwise.", "rating": 4, "expected_grade": "A+", "created": "2012-03-21T17:09:00Z"}, {"professor": "Margaret Antonisse", "course": "LING200", "review": "The class wasn't bad but Dr. Antonisse isn't a great professor. She accuses students of not doing the homework if they ask a question in class and tends to belittle students with her answers. Though she is helpful when you ask her one on one, she tends assume the entire class is trying to pull something on her and makes resources unavailable except through the TAs office hours.  ", "rating": 3, "expected_grade": "B+", "created": "2011-12-10T01:26:00Z"}, {"professor": "Margaret Antonisse", "course": "LING200", "review": "Dr. Antonisse is a fantastic professor and great at relaying the information to students. She does take the course a little too seriously though.\n\r\nThere are two simple quizzes, a midterm, and a final.\n\r\nEach week there is a discussion preparation that is basically a 100 if you do it.\n\r\nThere are 6 homeworks, 2 of which are basically papers and a bit ridiculous. The other homeworks are just linguistics problems and are very easy.\n\r\nIf you do work in this class and pay attention, you will do well.\n\r\nIt's a very interesting class, and I am glad I took it.", "rating": 5, "expected_grade": "B", "created": "2010-11-23T13:23:00Z"}, {"professor": "Margaret Antonisse", "course": "LING200", "review": "Dr. Antonisse is a great professor.  She is very straightforward and makes the material very easy to understand.  Always personable and helpful.  Really interesting class if you are interested in learning more about language.  ", "rating": 5, "expected_grade": "A", "created": "2010-01-26T15:01:00Z"}, {"professor": "Margaret Antonisse", "course": "LING200", "review": "\r\nGreat professor! She's very helpful and approachable. I plan on taking more linguistics courses with her. Everything in the class in extremely doable, so it's no problem getting an A. LING200 is really good to get a SB core out of the way. ", "rating": 5, "expected_grade": "A+", "created": "2009-12-20T16:53:00Z"}, {"professor": "Margaret Antonisse", "course": "LING200", "review": "Not a bad course, but I'm not sure I would have taken it if it weren't a requirement.  It's not too hard, and TAs are always open for office hours, and I recommend using them.  Dr. Antonisse is nice enough, but is not really going to cut you any breaks.  Could definitely be worse, though.", "rating": 4, "expected_grade": "B", "created": "2008-12-19T20:09:00Z"}, {"professor": "Margaret Antonisse", "course": "LING200", "review": "She is an excellent professor with great examples and is willing to help one-on-one, even with a lecture of 200 people!  She is incredibly helpful, and breaks everything down into easy to understand units.  This class is easy but truly stimulating.  A good non lab science and, as long as you do the work, an easy A.", "rating": 5, "expected_grade": "A", "created": "2007-10-31T10:22:00Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "I’ve had Dr. Antonisse for several classes now. She’s fantastic. Very friendly, very good at explaining things overall, though occasionally she can be a little unclear. The only other issue is that she occasionally has trouble getting a slightly confused class back on track. But overall Dr. Antonisse is one of the best profs I’ve had at UMD.", "rating": 4, "expected_grade": "A-", "created": "2017-11-19T22:28:58Z"}, {"professor": "Margaret Antonisse", "course": null, "review": "Very good professor. She's very organized and very professional but friendly at the same time. The material isn't too hard and the preps each week help you prepare for the exams. The homework can be tedious, however. ", "rating": 5, "expected_grade": "A", "created": "2018-11-09T01:08:01Z"}, {"professor": "Margaret Antonisse", "course": "LING200", "review": "Dr. Antonisse was a responsive professor and gave thorough lectures and course materials even during the online fall 2020 semester. She was responsive to student concerns, especially from those that were having trouble in the course. If I wasn't graduating, I'd try take her again.", "rating": 5, "expected_grade": "A", "created": "2021-01-12T02:16:30Z"}, {"professor": "Margaret Antonisse", "course": "LING321", "review": "She's a good professor but I don't really like her style in zoom. There's sometimes pointless breakout rooms that don't really help the learning process.\r\nOther than that she knows a lot and cares a lot about her students.", "rating": 3, "expected_grade": "", "created": "2021-04-01T07:33:41Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "Dr. Antonisse is a great professor who cares about her students and wants you to do well. She carved out time before and after each class to answer questions and chat. Online classes were sometimes rough with technical difficulties and she usually went over time by at least a few minutes. Not a huge deal, but worth considering if you have a class directly after. Attendance was marked with clicker quizzes (marked for participation, not accuracy). Homework and other assignments didn't take too much time. Exams were fair and not too difficult. A great, interesting class with a good professor.", "rating": 5, "expected_grade": "A", "created": "2021-05-19T13:55:53Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "Makes this courses harder than it should be. Treats it like we’ll all majors in linguistics. Would not recommend for any easy elective.", "rating": 1, "expected_grade": "", "created": "2022-04-13T01:29:22Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "Worst class / teacher ive ever had. Course work harder than any 400 level course at UMD ive taken. Seems like this woman has no life and expects us to have no life too besides her class, to learn about irrelevant phonetics. Very bad at technology as well.", "rating": 1, "expected_grade": "B+", "created": "2022-05-16T21:41:33Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "This is NOT an easy A class! Dr. Antonisse is a very nice prof and the material is pretty easy to understand but her exams are ridiculously hard and the TAs all grade inconsistently so random points are always taken off. Everything is weighted really heavily so once your grade drops it's really hard to bring up. ", "rating": 1, "expected_grade": "", "created": "2022-05-19T00:50:21Z"}, {"professor": "Margaret Antonisse", "course": "LING321", "review": "I had Dr. Antonisse for LING200, 240, and 321. I find her teaching style effective, and she clearly cares about her students and wants them to do as well as possible in her class.", "rating": 5, "expected_grade": "A", "created": "2022-12-21T22:23:09.021867Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "I'm going to give the most honest and comprehensive review I can give.\r\nFirst the good: Dr. Antonisse knows what she is teaching and is knowledgeable. A lot of topics are covered, so do keep track and don't miss a lesson or you'll definitely be behind. If you're passionate about the field of linguistics, she is definitely helpful. \r\n\r\nWhat I disliked:\r\n1- Homeworks and assignments are weighted HEAVILY. A slight drop in your score and your grade will go whoosh and it is VERY DIFFICULT to raise it again. A+ cutoff was 99%, even though the GPA is the same for an A as an A+, I just found it strange.\r\n2- This class is not an easy elective, especially if you have no prior knowledge of linguistics: DON'T take the course unless if you're really passionate about it and be prepared for it to be very abstract.\r\n3- Her demeanor with students: this fluctuates. When it comes to something besides questions about the course or material, she is nice and understanding. But to me, and for many of my classmates, her reaction when you ask a question can sometimes feel degrading and make you feel stupid.\r\n\r\nThis is my own experience, just my raw opinion without sugarcoating. I was honestly fooled by the 5-star reviews and I'm genuinely confused, maybe they got the professor name wrong, but this felt like a 400-level class and extremely stressful. But if you choose to take her, some might find her enjoyable and perhaps you might as well.", "rating": 1, "expected_grade": "B-", "created": "2023-05-20T02:50:16.131642Z"}, {"professor": "Margaret Antonisse", "course": "LING200", "review": "Dr. Antonisse is great! The course is not an \"easy A\", you need to stay up to date with the work, but the work is interesting and adds to the course. I never felt like I was doing \"busy work\". The workload is super manageable!", "rating": 5, "expected_grade": "A-", "created": "2023-12-06T18:44:48.606107Z"}, {"professor": "Margaret Antonisse", "course": "LING200", "review": "Hard class and hard professor. lectures are not engaging. when asking a question she cuts you off before you can finish and she just makes you sound stupid. also if you go into office hours she just isn't much help at all.", "rating": 2, "expected_grade": "C+", "created": "2023-12-13T23:38:35.325456Z"}, {"professor": "Margaret Antonisse", "course": "LING200", "review": "Disclaimer: I am a very logically thinking CS major minoring in Linguistics. \r\nDr. Antonisse was great. She's been doing this for a while and knows her stuff. Takes everything really slow, class was extremely easy for me and homework served as a nice chill break from other heavy coursework. Exams were super fair, discussions were good, content was interesting and well-paced. Workloads weren't bad, one assignment per week that takes about an hour. Uses clickers in class but most of the time, you get full credit for clicker questions regardless of what you pick; it's just for participation. She was very responsive and helpful for any confusion, encouraged participation in class, had a good personality and pedagogy. I would take her again. She admittedly does have a little trouble handling wrong answers in class, like a lot of \"welllllll not exactly\" and I see how that could come off as demeaning but I personally didn't take it that way. The TAs were grad students in Linguistics and were really helpful. \r\nNow, I will say that this class is not really a \"history\" class and is somewhere between a humanities class and a math class. Most of the semester is spent on the technical side of linguistics, looking at how sounds and words and sentences are internally structured and forming these systematic rules for language. For me, being used to this type of thinking in CS, it was fine. But I can see how it would be hard for some people who may not be as used to such technical coursework.\r\nI will also say that this class probably is a little too much for a GenEd and there are easier GenEds for DSHS. I enjoyed it because I am interested in linguistics, but for someone not interested in linguistics this probably wouldn't be fun.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T06:09:02.138147Z"}], "name": "Margaret Antonisse", "slug": "antonisse"}