{"courses": ["ENGL391", "ENGL393", "ENGL398R", "ENGL391", "ENGL391", "ENGL398A", "ENGL391", "ENGL391", "ENGL398A", "ENGL398A"], "average_rating": 3.0, "type": "professor", "reviews": [{"professor": "Mark Fitzgerald", "course": "ENGL393", "review": "Taken over a winter semester.\r\n\r\nThere were three core assignments (100pts) all split over the duration of the semester, with small (1-10pt) tasks thrown in. He's a super light grader; If you submitted something, you got a passing grade on it.\r\n\r\nThere were plenty of sections, and a lot of work for him to grade, yet he managed to provide real feedback on papers and writing discussions within ~1-2 days (even over the weekend). Fast response to emails as well. Overall, really a great guy, I would 100% take him again in a heartbeat. ", "rating": 5, "expected_grade": "A", "created": "2021-01-19T19:26:57Z"}, {"professor": "Mark Fitzgerald", "course": "ENGL391", "review": "Avoid this professor if you can! Firstly he takes forever to grade, I would often be waiting 2 weeks or more for feedback on assignments. Secondly, he does not tell you why he takes certain points off, he just does under the guise of a \"flexible rubric\". Thirdly, this course has insane amounts of work, compared to other FSPW classes my friends are taking. Fourthly, the content of the course is absolutely awful in general, it's just reading about a bunch of spoiled rich people prance about the world living rich people fantasies, and is completely insufferable to read about constantly. DO NOT TAKE THIS ENGL391 WITH HIM.", "rating": 1, "expected_grade": "B", "created": "2022-04-20T03:49:07Z"}, {"professor": "Mark Fitzgerald", "course": "ENGL391", "review": "This professor talks so slow it makes me want to put him on 2x speed in real life. He appears to wing every class and does not actually have a formal plan. He gives students undescriptive rubrics and expects them to succeed. Does not offer one on one help with your writing and will not work with students on personal improvement. ", "rating": 3, "expected_grade": "A-", "created": "2022-05-13T20:52:07Z"}, {"professor": "Mark Fitzgerald", "course": "ENGL391", "review": "There was little to no formal direction with each assignment, so many of them consisted of guessing what he was looking for. He would not work one-on-one with students, and his feedback on papers was cryptic and usually boiled down to buzzwords. He sometimes lashed out at students during lectures for asking questions. This course was intended to be a general/argumentative writing course, and he changed the topic to travel writing without any indication of this during course registration. I would not recommend risking it with this professor.", "rating": 1, "expected_grade": "A", "created": "2022-10-09T03:35:40.615524Z"}, {"professor": "Mark Fitzgerald", "course": "ENGL398A", "review": "If you're artsy and don't want to take a professional writing course that's stale, take this class. His lectures are definitely easy to be distracted from and class is skippable at times. All you have to do is 3 major assignments, write 2 paragraphs about a reading passage every week and do a few peer reviews that require low effort. You get enough time to turn in assignments and he's flexible in terms of turning in assignments late and extending work. \r\n\r\nClass discussions are nice discussions about art that you can follow and contribute to and I can say my writing has improved from this course.", "rating": 5, "expected_grade": "A+", "created": "2023-01-03T01:53:59.392569Z"}], "name": "Mark Fitzgerald", "slug": "fitzgerald"}