{"courses": ["HIST307", "HIST418A", "HIST375", "HIST607", "HIST106", "HIST798B", "JWST345", "JWST429A", "JWST648B", "JWST344", "JWST141", "JWST648", "HIST408C", "JWST409Y", "JWST699", "HIST329F", "JWST319V", "JWST619", "HIST408Y", "JWST409G", "HIST339B", "JWST319F", "HIST418F", "HIST339B", "HIST375", "JWST319F", "JWST344", "HIST307", "HIST408K", "JWST345", "JWST409K", "HIST106", "HIST329F", "JWST141", "JWST319V", "HIST408Y", "HIST608C", "JWST409G", "HIST106", "HIST329R", "JWST141", "JWST319X"], "average_rating": 2.6, "type": "professor", "reviews": [{"professor": "Marsha Rozenblit", "course": "HIST307", "review": "I do not recommend this teacher. She goes on rants and gives you too much information to ever learn for a written essay exam and then tests you on random things. She grades so harshly its impossible to pass.", "rating": 1, "expected_grade": "", "created": "2019-05-08T18:39:45Z"}, {"professor": "Marsha Rozenblit", "course": "JWST141", "review": "I wish I could write a positive review for Professor Rozenblit. Unfortunately, JWST141 is not an introductory level class and nor is it worth the effort. I attended close to every lecture, took thoughtful notes, and submitted assignments on time. In a separate course in the same semester, I earned A's and B's on papers. In Marsha's class, I was lucky to get a C, and with four assignment's throughout the semester, that does not leave much room for improvement. I took the class as an elective, hoping to expand my Jewish learning and to embrace Jewish history in America. Instead, I received my lowest grade in my undergraduate career. And this is coming from someone who has taken intro Biology and Chemistry.", "rating": 1, "expected_grade": "", "created": "2021-03-04T16:16:18Z"}, {"professor": "Marsha Rozenblit", "course": "JWST141", "review": "Professor Rozenblit is a traditional lecturer. This may be a bit of an adjustment to first-year students, but if one takes good notes and asks thoughtful questions in class, they will succeed. She is very knowledgeable about her field and presents the information in an organized way, usually giving an overview of every lecture's content before delving in. She assigns readings that more reinforce what she teaches, as the meat of the content is in her lectures. To succeed on exams, a lot of prep and memorization of details is necessary, but it's an easy A if the time is spent.", "rating": 5, "expected_grade": "A+", "created": "2021-09-12T14:31:12Z"}, {"professor": "Marsha Rozenblit", "course": "JWST345", "review": "I was worried about how much information this course was going to cover. Rozenblit started with a unit on the history of antisemitism that provided really important context for how the Holocaust came about. After the midterm, the information was not needed on the final, which was really nice. She doesn't assume you know any background of the Holocaust (so if you're coming in with nothing, you'll be fine), but she also keeps the information complex enough that if you've already been educated on the Holocaust, you won't feel like you're wasting your time. The class was a lot of work for exams, but her lectures were organized well and the readings were not too intense. She does assign these papers that take a lot of work, but if you ask her for help or guidance, she'll have your back. ", "rating": 5, "expected_grade": "A", "created": "2021-09-12T14:35:02Z"}, {"professor": "Marsha Rozenblit", "course": "JWST141", "review": "JWST 141 is just not it if your looking for an easy elective course. This class pretty much only has four grades that you have to spend a lot of time on so you don’t screw your final grade. I’ve taken other history classes and I’ve done really well in and gotten A’s but taking this class I’ve gotten C+ at best. She nitpicks everything and requires you to be incredibly specific with examples from her lectures which have too much information at times and are incredibly monotonous. ", "rating": 1, "expected_grade": "", "created": "2021-12-16T15:54:39Z"}, {"professor": "Marsha Rozenblit", "course": "HIST106", "review": "I know Dr. Rozenblit is a really sweet lady and cares a lot about her students, but do not take this class. It is way too hard for a gen ed / elective, so please do yourself a favor and take another history class. There are four assignments for the entire semester, and she can be a very tough grader, not necessarily with just the history aspects of your paper but also English conventions, too. Also, her exams are entirely essays - no multiple choice / true false / fill in the blank / etc. ", "rating": 3, "expected_grade": "A", "created": "2021-12-26T16:53:58Z"}, {"professor": "Marsha Rozenblit", "course": "JWST345", "review": "Please save urself and don’t take this class she is literally so mean belittles students makes you feel like everything you know/what you’re saying is wrong. She expects too much for an elective class and her tests r impossible she wants stuff straight from lectures. Also gives so much shit about missing class it’s not normal even for religious reasons. Her lectures are HORRIBLE I cannot stress enough do not take this class", "rating": 1, "expected_grade": "D", "created": "2022-05-12T13:58:50Z"}, {"professor": "Marsha Rozenblit", "course": "HIST307", "review": "I see a lot of negative reviews about Professor Rozenblit but I believe those are overdone. She expects a lot out of her students but if you attend lectures, take notes, you will do well. She's very no nonsense but cares about her students and I found her teaching style refreshing. She is passionate about the subject. If you put in some effort, you will leave her class with a much more informed outlook on the Holocaust.", "rating": 4, "expected_grade": "B", "created": "2023-05-18T15:08:36.886453Z"}, {"professor": "Marsha Rozenblit", "course": "HIST106", "review": "Personally, I loved this class. I feel like the information is very valuable and interesting. Each class is a lecture, so be prepared to sit for a long time. My friend and I always take bathroom breaks halfway through LOL. Rozenblit is a very good professor. I know she doesn't have great reviews, but I loved learning from her. Highly recommend talking to her after class and getting to know her a little so she has motivation to give you a good grade in class. The grade consists of a midterm (25%), 5-page paper (25%),Response paper (15%), final (30%), and class participation (5%). I will say that she is on the harsher side of a grader, but I really didn't mind. In short, if you don't mind putting in a little more work than anticipated for a 100-level class, I would highly recommend this course if the subject matter is interesting to you.", "rating": 4, "expected_grade": "B+", "created": "2023-12-01T16:25:58.040796Z"}, {"professor": "Marsha Rozenblit", "course": "JWST141", "review": "Do not take this class if you want an easy A. It only has 4 assignments and they are all somewhat difficult for this being a 100-level class. Take something else.", "rating": 1, "expected_grade": "C", "created": "2023-12-13T22:30:07.860856Z"}], "name": "Marsha Rozenblit", "slug": "rozenblit"}