{"courses": ["PHYS161", "PHYS102", "PHYS121", "PHYS261", "PHYS271", "PHYS270", "PHYS260", "PHYS476", "PHYS131", "PHYS141", "PHYS132", "PHYS261", "PHYS271", "PHYS420", "PHYS102", "PHYS131", "PHYS261", "PHYS271", "PHYS132", "PHYS261", "PHYS271", "PHYS420", "PHYS121", "PHYS141", "PHYS161", "PHYS121", "PHYS141", "PHYS161", "PHYS102", "PHYS131", "PHYS132", "PHYS132", "PHYS261", "PHYS271", "PHYS102", "PHYS132"], "average_rating": 3.1, "type": "professor", "reviews": [{"professor": "Matt Severson", "course": "PHYS102", "review": "The class wasn't really hard but you can tell he's the type of guy that knows so much about his subject area that he doesn't realize what is common knowledge or easy to understand and what isn't. He also wasn't always that nice when people asked questions but I think that might be because he's a little awkward. He tries to be chill and relatable which is at least kinda nice and he would bring out his guitar and give demonstrations when we were talking about music theory which was cool. I wouldn't purposely take another class of his but he's not bad just kinda average. (I also don't really like physics and had never taken phsyics before)", "rating": 3, "expected_grade": "A", "created": "2020-11-10T20:57:50Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "He was an easy going professor but I don't think I learned anything in his class. He seemed like he really understood physics but because he was trying to teach using another professor's course material he often seemed really unprepared for class. He was not very approachable when asking questions and usually was a little mean to the person asking. I got an A in the course but I literally do not know any more physics than I did going to into the course. ", "rating": 3, "expected_grade": "A", "created": "2020-12-27T04:12:58Z"}, {"professor": "Matt Severson", "course": "PHYS271", "review": "PHYS271 is a continuation of PHYS261. Your grade is comprised of pre-labs, labs, and a final exam. The course overall is an easy A as long as you do the pre-labs and read the lab manual before each lab. Be aware though that the labs for PHYS271 are longer than the labs for PHYS261 and more in depth. The final exam review was extremely helpful and problems from it appear on the final exam.", "rating": 5, "expected_grade": "A", "created": "2021-01-05T23:31:27Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "Matt was super chill and the class was interesting. The material was straightforward and the final ppt was fun to do. ", "rating": 5, "expected_grade": "", "created": "2021-01-19T16:22:52Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "Dr.Severson was a great professor. I will admit that there were instances where I completely did not understand what he was teaching and sometimes he even confused himself. He uses another professor's material to teach which explains why it confused him at times, but did a decent job at explaining it. His grade cutoffs are fair and his exams are pretty difficult. I had a very hard time studying for the exams but managed to do well on other assignments like quizzes and homework. The lab is very annoying and the TA's are unhelpful, Dr.Severson has even admitted this. He responds to emails quickly and listens to all concerns that any of his students may have.", "rating": 4, "expected_grade": "A", "created": "2021-05-24T13:31:03Z"}, {"professor": "Matt Severson", "course": "PHYS132", "review": "Dr.Severson is a great professor. His teaching style isn't the best but he still manages to explain things clear enough. There are some instances were he would get confused since he is using another professor's teaching material. My biggest concern with his class was that since it was online when I took it, there were a lot of people cheating on his exams and it showed on the averages. We had 2 midterms and the average on each of them was ~80% which is very high considering the difficulty of the exams. While this was not entirely Dr. Severson's fault, this could have been prevented if he had muted the exams after it was completed. When I took the class, he had it where you had the whole weekend to take the exam with about 75 minutes to complete it once you start it. When you finished the exam, it would tell you what you got wrong and the correct answers to the questions. This allowed some people in our class to cheat artificially raising the average and almost lowering the curve/cutoff.", "rating": 4, "expected_grade": "A", "created": "2021-05-24T13:41:41Z"}, {"professor": "Matt Severson", "course": "PHYS271", "review": "You barely really interact with Dr. Severson at all. He handles the logistics of the online pre-labs and the final exam. If you email him with a question that is already addressed in the syllabus or a previous announcement, he might call you lame.", "rating": 4, "expected_grade": "A+", "created": "2021-06-26T14:37:41Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "Honestly, if you want to learn physics, take any other professor. For credibility - I am a pre-med student with a near 4.0 gpa. Dr. Severson has failed to teach his students effectively at all. He is incredibly unorganized, continually moving homework, exam and quiz due dates. I am under the impression he does not write his own material. It is impossible to prepare for the course. I took AP Physics in high school and was capable of understanding all of it and succeeding. This class has been a fraction of what I can remember from high school but I somehow unable to learn any of it with his horrible teaching. He has no power over the class. People constantly talk over him. This is due to the fact he has shown his students no respect and therefore shouldn't expect to get it back.... I am not cold hearted, nor have I ever written a review on PlanetTerp before... this class is just so awful. Every recitation students stare blankly at the screen as we haven't been taught how to do anything. The homeworks are far beyond anything learned in class. Can't recommend not taking this guy enough. I am halfway through this course and don't have much hope - nor do I have any idea what my grade could be at the moment as he doesn't input any grades. I hope he does better in the following weeks. ", "rating": 1, "expected_grade": "", "created": "2021-10-28T22:49:53Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "Do not recommend this professor for anyone taking physics for the first time. Some of the material is intuitive, but he doesn't teach it like it is. Many times he takes the more complicated route to explain it than is necessary. Also, he is terribly disorganized and likes to push back dates of exams. The homework assigned is astronomically difficult because it does not always line up with what is being taught in class, so you just have to figure it out on your own, since he releases textbook chapters sequentially depending on how much you get through in class. I took one physics class in high school and it has helped a little, but this class isn't worth the time you put in. ", "rating": 2, "expected_grade": "", "created": "2021-11-08T03:51:50Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "I agree with the person below (10/28/2021) and I'm coming from similar credibility, but I honestly give him a pass this semester due to family issues. He's a nice guy and I actually think he's a decent lecturer, people just need to stfu during class. That being said, the class is still disorganized (quiz and HW due dates not predictable) and is based on another professor's material.\r\n\r\nHomework sucks. It is often only loosely related to material from class, and requires unnecessary digging around and reading between the lines to sometimes understand what to do. It usually isn't super long though.\r\nRecitation currently sucks because there seems to be a disconnect between him and the TAs; the recitation content is often one or two weeks ahead of lecture, so you have no idea what's going on and the TAs don't seem to know that. They don't know where we are in lecture or even when our exams are. It's possible this will change though.\r\nLab sucks but what's new. The experiments themselves are actually interesting but analyses and lab reports are a pain.\r\n\r\nIt's true it's hard to prepare for exams or homework. It's not a straightforward physics class, there is a lot of time spent explaining concepts in-depth. Basically, they know we're premeds who don't actually care about in-depth physics so they build the class around trying to get us to learn how to think about physics instead of learning 50 million equations.\r\n\r\nClass isn't great, could obviously be better (will hopefully be better in the future), but if you take him you're not 100% doomed, just takes extra time.", "rating": 3, "expected_grade": "", "created": "2021-11-09T07:45:20Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "Nice guy but my god is this class awful. If you can take another physics. Genuinely have no clue what my grade will be in this class and the exams have made me reconsider pre-med. Survived orgo and all the other bs weed out classes just to get to physics and feel completely lost. The class is like 80% intuition and is overly complicated so it just really screws you over. I thought I would be fine because I loved physics in high school but I was wrong. We're almost done with the semester and I am genuinely panicking. ", "rating": 2, "expected_grade": "", "created": "2021-11-14T13:49:27Z"}, {"professor": "Matt Severson", "course": null, "review": "Great guy but wooooo this class sucks. I genuinely show up to class every day and walk out knowing less about physics than when I walked in. We're almost at the end of the semester and I genuinely do not know where I stand at all. I'm on the verge of dropping pre-med completely.... mind you I went back to back Anatomy, Anatomy 2, Genetics, Microbiology, Chem 1, Chem 2, Orgo 1, Orgo 2 etc, and never considered dropping. This is quite honestly awful. The exams are ridiculous and so is the hw. Every day I feel more and more lost. This class is truly useless and is a weird mix of theory, biology and rip-off physics. I do not recommend it. Just go with Buerhle, he sucks too, but at least his curve is better.  ", "rating": 2, "expected_grade": "", "created": "2021-12-08T18:34:41Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "not a great teacher. he knows what he's talking about but he complicates the topics. he's also pretty rude to students if they ask a question which is super weird of him. the only saving grace in this course was one of the TA's who would go over the homeworks and host review sessions. without her, I would be failing this class. don't take this class if you're looking for an easy natural science lab. ", "rating": 2, "expected_grade": "B-", "created": "2021-12-11T20:07:04Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "Not a great class. Mostly learning about sounds waves, frequency, and production but also a lot of memorization involved (especially about the different parts and characteristics of many instruments towards the end of the semester). There were 6 homework assignments, a lot of them I needed help with so definitely use the TA office hours for help. 3 exams, not cumulative, but a good bit of studying and memorization is involved. 1 final group project on an instrument of your choice. Honestly didn't feel like I learned a lot and there are definitely better options if you need to take a gen ed science.", "rating": 2, "expected_grade": "B", "created": "2021-12-16T14:33:45Z"}, {"professor": "Matt Severson", "course": "PHYS261", "review": "Severson did a really solid job setting up 261. Every lab is done entirely through Excel and LoggerPro, with instructions on Expert TA. Prelabs are also on Expert TA, and you do get penalized for incorrect attempts. \r\nHe gives you an Excel template for each lab which is very straightforward, there's just a lot of copying and pasting and typing out complex formulas, but nothing challenging. The instructions for each lab are easy to follow so there's no issue getting out early. After the first 5 labs, there's a makeup week for anyone who missed one of those labs, but if you didn't miss any you get the week off. There's another makeup week after labs 6-9, too. After that, the next week is a review for the final, and the week after that is the final, which takes place before the usual finals week. The final is not bad at all, and he gives you a bunch of practice questions (though not the answers to them), a couple of which were on the actual exam. The final was originally going to be in person, but he moved it online and mentioned that he'll probably keep it online in the future.\r\nOne thing to note about 261, though, is that it may be the physics 2 lab, but the majority of the labs are on physics 1 concepts, like momentum, centripetal motion, and pendulums.  Only the last two labs were on physics 2 concepts, waves and the ideal gas law.", "rating": 5, "expected_grade": "A", "created": "2021-12-18T19:33:03Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "Honestly I don't even know where to begin. The structure of this lecture, discussion, and lab is something that I have never seen before in my 5 semesters at UMD. To begin, there is no syllabus for the course. There were supposed 10 homeworks, 10 quizzes, 2 exams, 4 labs and a final. Half of our quizzes were never even posted, the homeworks are incredibly difficult and never align with what we are \"learning\" in class. As other people have said, the due dates were constantly changing throughout the semester. The TAs hardly know what is going on during lecture which makes discussion and lab 10x more difficult (as they assume we know more than we do). The labs have no real rubric or structure, however you will receive poor grades on them if you do not follow exactly what they want (even though you don't know what that is until after your grade is posted). I can confidently say that I didn't learn a single concept in this course, somehow something as simple as gravitational force was made almost impossible to comprehend. Nothing in this class is straightforward and I really don't recommend it at all. If you can avoid PHYS131, do it. ", "rating": 1, "expected_grade": "", "created": "2021-12-21T04:45:48Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "He’s a great and funny lecturer but honest to god the material is horribly presented at times. If this will provide some hope, I got a D average on all his exams (including the final) but came out with an A. Honestly was shocked when I checked my grade, but it’s a Christmas miracle. Just try to aim a bit above or around the exam average and you’ll be fine. When you flunk an exam during this class, it will be a shitty blow to your grade temporarily but once everything else comes in at the end of the semester that bitch will go up. He also curves. Focus on doing well on the HW, work hard in lab, and keep up with TopHat. Your other efforts can balance out your horrible exam grades lol. Came out learning some physics so that’s a plus too.", "rating": 4, "expected_grade": "A", "created": "2021-12-25T15:23:19Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "Very easy class. I was able to get an A- by sleeping through most of the lectures. Just make sure you get all the participation points. There's also no final exam. ", "rating": 4, "expected_grade": "A-", "created": "2021-12-27T01:52:57Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "Physics is hard for a lot of people. It is even harder for a teacher to teach it in a way students can understand. My experience with Severson was positive. While the lectures can be a bit dull at moments, it is not that hard to succeed in this class. I've heard stories of my friends in this class bombing exams repeatedly and still ending up with an A. Do the work, practice problems, and go to discussion and you will get an A. Overall, not too hard of a class and good teacher!", "rating": 5, "expected_grade": "A", "created": "2022-01-13T18:29:37Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "I liked him as a person. He was a decent lecturer and seemed to care about the content. The material itself was fairly easy, with just a couple of homeworks and three exams that were all equally weighted (with no cumulative final).", "rating": 4, "expected_grade": "A", "created": "2022-02-18T20:49:08Z"}, {"professor": "Matt Severson", "course": "PHYS132", "review": "He curves which is a blessing but this class is just rough. I have no clue what I'm gonna get in this class and I have never been so lost in my life. I plan on dropping pre-med after this semester, this class was the last straw and it made me realize just how exhausted I am. I can't wait till the semester is over. Take 121 if you can. ", "rating": 2, "expected_grade": "", "created": "2022-04-26T01:55:00Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "Class structure:\r\nIncredibly disorganized. Due dates constantly changing. One assignment is due, then the date is shifted, then it is no longer due. You already did it? Too bad. Am I in a physics class or a Kafkaesque fever dream?\r\n\r\nTeaching style:\r\nGoes through pre-written PowerPoint slides that make no sense even when he tries to explain things. He is not a good communicator so he dislikes teaching, which makes class a giant waste of time.\r\n\r\nFeedback style:\r\nShockingly nasty. Says things like \"it's not my job to teach you xyz...\" \"I guess you weren't paying attention during class...\" \"Any lack of success is your own doing.\"\r\n\r\nOffice hours:\r\nOne of my classmates said he showed up to office hours and Severson said he was busy \"come again next week\". Excuse me? Office hours is when you make yourself available to your students. \r\n\r\nLab:\r\n3 hours of blind confusion where you learn nothing about physics. It is just about decoding the instructions and then messing around on excel. They aren't even his labs but he doesn't care enough to change them. \r\n\r\nDifficulty:\r\nIt was an easy class if you ignore him and just learn from online resources.\r\n\r\nOverall: \r\nHe is an unfortunate reminder that not all teachers care about their students. He would just prefer to rant, ramble, and blame his students rather than take responsibility for the quality of his own course. ", "rating": 1, "expected_grade": "", "created": "2022-07-07T17:37:18Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "I took him last year for 131 and 132 and honestly he's not bad. The class itself will make you cry and throw up if you care not feeling lost. However, you're good if you're fine with being lost most of the time. The material honestly just sucks bio+physics is a horrible combo. BUT you will do well in the course. Failed all the exams but did well on hw, reading and labs and did well overall. The curve is a blessing honestly. Severson is a chill dude and honestly I found him very funny. The echo in the lecture room and lighting sucks though and makes you want to sleep so I would recommend just listening to the recordings or reading the slides and self-teaching.", "rating": 4, "expected_grade": "A", "created": "2022-09-02T02:38:20.043582Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "HE SUCKS. Never take this class with this professor ever. His TAs grade papers wrong and are inconsistent with point distribution. Matt gives no help when you go to him to complain about grading. He gives you sass and attitude. He markets himself as a nice professor till you go to him and he’s a total asshole.", "rating": 1, "expected_grade": "B-", "created": "2022-10-25T14:56:23.025059Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "Dry, disorganized, low exam averages, fat curve, but I wish was organized to teach effectively.", "rating": 2, "expected_grade": "A", "created": "2022-11-11T06:08:49.054271Z"}, {"professor": "Matt Severson", "course": "PHYS261", "review": "I never actually met him, since this was just the lab section of Physics 260, but the labs were alright. Not too hard, but nitpicky with the grading. I liked that the final exam was online. Don't worry.", "rating": 3, "expected_grade": "A", "created": "2022-12-01T01:17:09.968153Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "The class was basically a music theory course and focused way more on music than it should've. He was a little snippy at office hours and the TA's didn't show up to their office hours or help in any case, so you kind of had to teach yourself for the class", "rating": 3, "expected_grade": "A", "created": "2022-12-12T03:37:22.601640Z"}, {"professor": "Matt Severson", "course": "PHYS261", "review": "Never seen him in my life but my TA was the best. The class is taught completely by TA's, so it can be a hit or miss depending on your TA.", "rating": 4, "expected_grade": "A+", "created": "2022-12-19T17:37:28.938916Z"}, {"professor": "Matt Severson", "course": "PHYS261", "review": "I had him for the lab period, but pretty much no one actually interacted in person since the TAs run the labs. I give this 5-star review because one, the lab was well run and my lab partner and I always finished within a reasonable time frame and the excel sheets were very well made. And two, someone posted a profanity-ridden ELMs post about the review HW having deductions (it was actually worth no points), and the professor responded with a brief explanation of the no points thing and ended it with \"lol\" full stop. Giga chad move IMO, A++ professor.", "rating": 5, "expected_grade": "A", "created": "2022-12-20T23:24:50.013111Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "This class is HORRIBLE. I am a HESP major and it is required but it is mostly about instruments and music. Severson has graded almost nothing  and we took the final two weeks ago. I have no clue what my grade is and I went to office hours to ask about my grade and he had no excuse just said he’s behind on grading. Ridiculous class to do badly in.", "rating": 2, "expected_grade": "B", "created": "2022-12-22T01:08:59.350197Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "If you want to learn physics, do not take this class but if you want to pass easily without much effort then absolutely take physics131 with Severson. Dry but kinda funny guy, difficult exams, but a decent curve. Labs and lectures are absolutely useless but youtube videos are helpful for the content. Don't stress to much over this class.", "rating": 3, "expected_grade": "A-", "created": "2022-12-23T21:00:14.683406Z"}, {"professor": "Matt Severson", "course": "PHYS131", "review": "First off, I hope you don't have Ninad as a TA. Second, the professor was very dry and I couldn't tell if he actually cared about teaching. Everyone said the lectures are useles so I stopped coming to class. The key to get at least a B is to do good on the homework and lab reports. Tophat is used the entire course and the curve is amazing. I heavily bombed every exam (including the final) and still got out with a B. Also, didn't learn a single thing.", "rating": 2, "expected_grade": "B", "created": "2022-12-29T02:34:53.427546Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "In terms of the professor: He's a pretty decent lecturer. He would sometimes take some time to draw out diagrams on the chalkboards during lectures to explain certain concepts. It helps show dynamically how things change. The grading for assignments was very slow; at least a third of the assignments weren't graded until after the final. Since the course is also about music, he would bring his own instruments to the class sometimes to explain some of the concepts as well, which was helpful since I had zero knowledge about anything musical.\r\n\r\nIn terms of the course: The course was originally labelled as The Physics of Sound and Music, but it's currently labelled as The Physics of Music. So, the course is about both sound itself and music/instruments; but, the course is more heavily focused on the instrumental aspect. There were several TurningPoint participation grades that happened randomly throughout the lectures; so, we never really knew when they would happen. But, they were graded on completion rather than correctness. There were 3 exams total, including the final. The exams were pseudo-cumulative, in that you weren't tested directly on past material, but some of the later concepts were built off of previous concepts. There were 6 homework assignments that were online on ELMS. They were usually a mix of multiple choice, fill-in-the-blanks, and short answers. Some of the stuff on the homework were either never explained in lecture or weren't explained at all, which made it hard to get a good grade on some of the homework. There is a final group project that is given in the middle of the semester and due by the last day of classes. My semester's consisted of doing a presentation on a instrument of your group's choice (e.g., history, physics, etc.). However, it was a recorded presentation instead of having to present it in front of the lecture hall. After the project, there's also a participation point where you watch other groups' recorded presentations and comment something like a discussion post. There is math involved throughout the course given that it's a Physics class. It's mostly simple math except for a few concepts here and there. Lecture \"notes\" are provided/uploaded onto ELMS, which are the lecture slides that he uses in class; they're provided right before class starts.", "rating": 4, "expected_grade": "A", "created": "2023-01-24T22:13:37.028027Z"}, {"professor": "Matt Severson", "course": "PHYS161", "review": "Lectures could be a bit dull at some times, but the things he would go over were important and would help you understand what was actually happening. He does take off for wrong answers on homework, which can be annoying at times but oh well. Exams were incredibly straightforward. The questions were extremely similar to ones went over in class. Attending lectures is the best way to make sure you get a good grade.", "rating": 5, "expected_grade": "A", "created": "2023-07-07T20:44:40.772096Z"}, {"professor": "Matt Severson", "course": "PHYS132", "review": "Exams are really easy if you study the practice problems and practice exam. Lectures are a bit hard to understand because it gets really boring but, he records them. The curve + opportunities to get a good grade in this class make it very easy to do well. Just do all the hw assignments and tophat questions.", "rating": 5, "expected_grade": "A", "created": "2023-11-01T01:18:03.280352Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "Professor Severson is an okay professor. His lectures can definitely get boring at times, but all the information you need are on the slides for the exam. He has random clicker questions sprinkled throughout his lectures that count as participation/attendance, but usually the dates are posted on Canvas beforehand in the assignment. He's a bit slow with grading as well. Overall, you'll probably be doing a good amount of self-study outside of class to solidify your understanding of the concepts for the exam. There are homework assignments but usually you can see the answers after your first attempt (unlimited attempts and unlimited time), although for the last couple of homeworks that wasn't the case. Not a terrible class, but one I'm definitely glad to be done with.", "rating": 4, "expected_grade": "A+", "created": "2023-12-06T22:45:14.754384Z"}, {"professor": "Matt Severson", "course": "PHYS132", "review": "Cool guy but it's pretty obvious that he hates teaching this course. The best way to get to know him is to go to his office hours. He's a bit impatient and won't sugarcoat things when he explains concepts, but he knows what he's talking about. If you ask the right questions he can be very helpful. I personally highly recommend going to the TA office hours whenever you get the chance. They'll be more willing to hold your hand for a lot of these more complicated concepts and explain things in more intuitive ways (which I personally needed and I know a lot of students appreciated). While this course has a very generous curve and the assignments are a great buffer, the content itself can be very complicated depending on how well you want to understand it. Don't just brush off the content because it'll haunt you on the MCAT.", "rating": 4, "expected_grade": "A", "created": "2023-12-24T00:50:47.389053Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "Took this class as my GenEd science with lab and it is a decent choice for the GenEd credit but sometimes is a lot of work. The professor would always push back exams and assignments at the last minute because he was behind in lectures. His lecture slides are outdated (from the Fall of 2021) and he rambles on about irrelevant information that had no relevance to the exams. He was also very unapproachable from my experience, from office hours when his door is almost shut with the lights off to emails that are not professional and are very little help. He also did not follow the rule of grading final exams within 48 hours and that was probably because we still had 2 homework assignments ungraded. Overall, the workload was not much. You had unlimited homework attempts, 3 exams, a project, and attendance questions. But the class is boring and the professor is not the greatest.", "rating": 3, "expected_grade": "A", "created": "2023-12-27T19:36:55.513843Z"}, {"professor": "Matt Severson", "course": "PHYS261", "review": "Hated this useless class but easy A. Final was nothing like the practice.", "rating": 1, "expected_grade": "A", "created": "2024-02-09T19:58:55.249758Z"}, {"professor": "Matt Severson", "course": "PHYS271", "review": "ABSOLUTELY HATE THIS CLASS. USELESS AND A WASTE OF TIME. NOTHING TAUGHT IN THE LAB WILL BE RELEVANT IN THE REAL WORLD. I DON'T CARE IF IT IS AN EASY A. I STILL HAD TO PAY A TRUCKLOAD OF MONEY FOR A STUPID XPERT TA ASSIGNMENT WHICH WAS SETUP WITH MINIMAL EFFORT. JUST A MONEY GRABBING SCHEME!", "rating": 1, "expected_grade": "", "created": "2024-02-18T01:31:44.062872Z"}], "name": "Matt Severson", "slug": "severson_matt"}