{"courses": ["JWST262", "JWST225", "JWST289J", "JWST409D", "JWST409B", "JWST324", "ENGL262", "HEBR298A", "JWST260", "RELS219A", "HIST219I", "HIST321", "RELS289J", "JWST619B", "JWST648L", "JWST600", "ANTH305", "JWST468C", "JWST699", "ARTH489J", "HIST408Q", "JWST409F", "JWST619", "PSYC603", "PSYC660", "PSYC661", "HEBR298B", "JWST274", "RELS274", "RELS225", "ARTH305", "CLAS305", "ENGL262", "HEBR298B", "JWST262", "JWST274", "JWST319Y", "RELS274", "HIST219I", "HIST321", "JWST225", "JWST324", "RELS225", "ENGL262", "HEBR298B", "JWST262", "JWST274", "RELS274", "JWST499A", "HIST219I", "HIST321", "JWST225", "JWST324", "JWST419G", "JWST499B", "JWST499G", "RELS225", "HIST219I", "JWST225", "JWST274", "JWST499A", "RELS225", "RELS274"], "average_rating": 4.8889, "type": "professor", "reviews": [{"professor": "Matthew Suriano", "course": "JWST225", "review": "Prof. Suriano made this class interesting and fun at the same time, while still teaching us a lot. I didn't feel like I needed the textbooks very often, but I enjoyed coming to class every day and learning, which is rare for a gen-ed.", "rating": 5, "expected_grade": "A", "created": "2020-05-31T17:13:32Z"}, {"professor": "Matthew Suriano", "course": "JWST289J", "review": "Prof. Suriano is a very knowledgeable teacher on the topic. If you are interested in comparative religion and the history of jerusalem, this class is perfect for you. I took this class online in the fall 2020. there are weekly quizzes that are very easy and you can have the reading up next to you. the discussion is annoying but isnt that long so it isnt that bad but you have to show up to get attendance points. The midterm and final are both so easy as long as you take notes and watch the lectures. the averages were a 94 and 95. the final paper is annoying so I suggest meeting with the TA because they are the one grading it and not the professor if you have questions. Overall, a good class!", "rating": 4, "expected_grade": "A", "created": "2020-12-31T17:00:12Z"}, {"professor": "Matthew Suriano", "course": "JWST289J", "review": "I took JWST289J online in Fall 2020. Dr. Suriano is a genuinely good person who cares about his students and is really excited for them to learn the material. The asynchronous nature of the class made it a bit impersonal, but you could tell he was sad about this too and really wants a personal connection with his students. There was not too much work, but the paper did take a good chunk of time to write. Overall, I highly recommend taking any classes taught by Dr. Suriano!", "rating": 5, "expected_grade": "A+", "created": "2021-01-12T03:16:11Z"}, {"professor": "Matthew Suriano", "course": "JWST324", "review": "Professor Suriano is an excellent professor. He is very respected in his field, and the lectures highlight his breadth of knowledge. Suriano is very friendly and accommodating to his students. The class is only based on a few assignments, quizzes, and exams, but all are fair and not too much work. Only complaint I have about this specific course was that it was crosslisted as a history course, despite not really being about history but moreso about archaeology (Professor Suriano's field, not history). Despite not expecting the course to be structured like that, Professor Suriano has great lectures and made me interested in the material despite that. Highly recommend taking any of his courses if you're remotely interested in the subject(s).", "rating": 5, "expected_grade": "", "created": "2021-04-22T22:19:45Z"}, {"professor": "Matthew Suriano", "course": "JWST262", "review": "Suriano never disappoints. He loves seeing and talking to students and I can tell he is very passionate about his profession. He is very fair with grading and is willing to work with you and answer all questions. The only complaint about this class was the massive amount of materials we had to learn. Since it was in person, I felt rushed but he made sure to slow down and explain things. Since there was a lot of materials, the good thing was that he had reasonable expectations from us so he would tell us exactly what he was looking for in essays or exams.", "rating": 5, "expected_grade": "A", "created": "2021-12-23T04:53:02Z"}, {"professor": "Matthew Suriano", "course": "ENGL262", "review": "He is so awesome, he loves what he does and you can tell.  He wants everyone to do well.", "rating": 5, "expected_grade": "A+", "created": "2022-04-07T17:24:44Z"}, {"professor": "Matthew Suriano", "course": "ENGL262", "review": "Prof Suriano is extremely knowledgeable on the subject and you will learn so much from the class. The class is very lecture heavy and assigns a lot of readings, but there aren't many grades and the exams are easy. Overall, this is a pretty easy and enjoyable class if you're interested in the subject.", "rating": 5, "expected_grade": "A", "created": "2022-12-27T00:48:04.088230Z"}, {"professor": "Matthew Suriano", "course": "RELS274", "review": "Prof. Suriano is great. He's nice, an engaging lecturer, provides great resources to students for review and reference, and his class is structured well. There's a weekly mandatory discussion class online, which is laid back and informative. He has weekly quizzes, an open-note final and midterm, and a final paper. The class is easy, but that doesn't mean it's not informative. Take him if you're looking for an interesting gen-ed!", "rating": 5, "expected_grade": "A", "created": "2023-12-21T01:33:19.978755Z"}, {"professor": "Matthew Suriano", "course": "JWST289J", "review": "Great Professor who is passionate and cares about his students. The amount of work is pretty expected for a gen ed course, a couple quizzes, discussion attendance, 2 exams, and a big paper. If you spread out the work it's really not that bad and the readings are actually kinda interesting. You don't need any prior knowledge to take the class but you do come out of this class with a greater understanding of religion and sacred space.", "rating": 5, "expected_grade": "A", "created": "2024-02-20T18:48:55.335451Z"}], "name": "Matthew Suriano", "slug": "suriano"}