{"courses": ["STAT100", "STAT464", "STAT470", "SPHL601", "SPHL602", "SPHL603", "SPHL610", "STAT100", "STAT470", "STAT100", "STAT470", "STAT100", "STAT470", "MATH107", "TLPL692", "STAT470", "STAT100", "STAT470", "DATA100", "DATA100", "STAT100", "STAT470", "DATA100", "STAT100", "STAT470"], "average_rating": 4.3672, "type": "professor", "reviews": [{"professor": "Matthew Griffin", "course": "STAT100", "review": "he's a very good professor who cares a lot for his students and tries his hardest to remember the names of students and passes out candies in class, although he gives out an assignment every lecture, they are extremely beneficial to do since it helps you understand the concepts better and are similar to the questions on the exam. I highly recommend this teacher for stat100", "rating": 5, "expected_grade": "A", "created": "2019-01-24T04:11:44Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "He is one of the few professor's who I felt really cared about his students. He made the effort to learn everyone's names very early on in the semester. He also truly wants his students to succeed. A majority of this course is classwork and problem sets, and he goes out of his way to help students and to ensure that you understand the material. If you attend lecture and complete all of the assignments, you'll do well in the class. I 100% recommend taking him if you get the chance, he is one of the best math professor's at UMD! ", "rating": 5, "expected_grade": "", "created": "2019-12-15T15:10:22Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "The best professor ever. I wouldn't recommend that you take any other professor for STAT100. His test averages are always very high. I'm terrible at math but got over 100% as my final grade (because he offers many opportunities for extra credit). He holds study sessions before each test and I recommend attending Catherine Curtis' review sessions because she makes her own study guides based off of the tests. Griffin is much easier than Mazzulo. ", "rating": 5, "expected_grade": "A+", "created": "2019-12-18T20:23:54Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "Grades generously and is a good teacher", "rating": 5, "expected_grade": "A-", "created": "2020-05-16T19:03:24Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "I had Griffin for STAT 100 online and have to say that he has not been a good instructor. When you're lucky, he responds to you within one week and then basically only tells you to talk to your TA. I understand that he has a lot of students, but he has not made an effort to communicate at all. Plus, all of his online lectures are asychronous, so I have yet to see his face or hear his voice - two months into the semester. The Acrobatiq textbook is extremely hard to understand so the PowerPoints he puts up help in learning the material, but it would be a lot easier if he did actual live zoom lectures. So I have to say that I'm quite dissatisfied with him. If you're better at math than me he might be ok, but for people that are as terrible at math as myself you'll be sorely disappointed at the (lack of) effort he puts in to helping you understand the material.", "rating": 1, "expected_grade": "", "created": "2020-11-11T20:17:23Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "We are in a global pandemic and this guy think his class is more important. DO NOT TAKE.", "rating": 1, "expected_grade": "B", "created": "2020-11-12T05:07:31Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Im sure this class would have been WAYYY better in person. I do think lecture videos would have been more effective for this class, but he allows multiple attempts on EVERY assignment except exams. There is tons of extra credit. He could have been more lenient on mistakes due to technology failures. This is a class where the answers are either right or wrong, there no room for rounding errors. Overall, is a decent professor. I would recommend it to people that enjoy async classes. ", "rating": 5, "expected_grade": "A", "created": "2020-12-03T17:10:51Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "People whined about his class a lot in the GroupMe and complained about his seemingly lackadaisical teaching. This is an asynchronous course with synchronous Zoom classes. He responds to emails fairly quickly if you need him (as long as you put your course name/section number in your subject). He grades nearly EVERYTHING for completion on Acrobatiq (besides the quizzes, which you have THREE attempts on). He explicitly states what he wants and expects out of us on his syllabus, ELMs announcements, and assignments. He offers so much extra credit, he even said in an announcement that doing all the EC work would have boosted your grade <4% overall. You get multiple attempts on everything you take besides tests and weekly problem sets (yet he offered us an optional problem set for extra credit). AMP's host about ~5 study sessions prior to our tests. Compared to what the math department offers as \"professors\", Griffin does an exceptional job at offering resources for you to get a good grade while also learning the material. This has been THE easiest math course I have taken at UMD, yet first-semester freshmen want to complain because they are expected to do work outside of our once a week, one-hour discussion.", "rating": 5, "expected_grade": "A+", "created": "2020-12-03T17:11:22Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "A lot of people complained about the amount of work he expected from us in GroupMe (similar to another review), but honestly, I think he spoonfeeds us almost. Everything is open note, and his lecture slides go directly along with class activities for the day. He drops the lowest 2/3 grades for each category, so as long as you keep up with everything, there's honestly no reason for anyone to fail. IDK how he is in person, but I think that he's honestly one of the best professors at UMD. The fact that his asynchronous lecture slides helped so much with explaining concepts to someone who had never taken stats before shows that he's really an amazing professor. He also gives a lot of extra credit, so there are ample opportunities to raise your grade, up to a 4% increase. I think he could have been more lenient with technology issues, however, he did his very best to accommodate to the pandemic. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-19T14:40:29Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "To start, Professor Griffin was a very nice guy and the material of the class was fairly easy, but I do NOT reccomend this class at all. The lectures were insanely boring, but this is totally understandable for a math class. However, my TA was super unhelpful and unreliable, and was once 30 minutes late to class with no apologies or explanations. When I had Covid and reached out to both my TA and Professor Griffin, I received no response from either of them and all of my assignments for that week were marked as missing and my grade suffered as a result. This class involves coding, and while it is easy there is absolutely no need for coding to be involved in an introductory class. He never responded to any of my emails throughout the entire semester! Overall, I struggled through this class and was only able to receive support from the student helpers. If you are looking for a communicative and reliable professor, DO NOT take this class. ", "rating": 2, "expected_grade": "B-", "created": "2021-05-25T00:58:03Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "The thing making this class difficult is the professor behind it, treating the introductory stat class as though it were a 300 or 400 level class. All the work feels like busywork, his lectures are just reading off the slides, which in-turn are just whatever the textbook says down to the graph. This would lead you to think that you could just skip lecture then, wrong. Lecture has mandatory attendance check-ins at the beginning and end of class, I assume because he is aware people would just leave if given the chance. Further, he also takes forever to grade and give feedback, which is often needed as later assignments greatly benefit from knowing what you did right or wrong.", "rating": 1, "expected_grade": "A-", "created": "2021-10-15T15:41:57Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Professor Griffin is EXTREMELY thorough with pretty much everything he says or writes. This is nice because there is plenty of communication, but it does get quite annoying. He does a good job of giving students every possible way to learn stats, but this course is a lot of work. He teaches R, but it really seems like it was thrown in last minute. It seems more like busy work than anything and the weekly R assignments are very repetitive and annoying. Also, my TA was absolutely useless. But, in the end, I feel like he was a good teacher and I learned a lot. ", "rating": 4, "expected_grade": "B", "created": "2021-10-15T18:33:18Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "I love Griffin! He is so sweet to me and always accommodates me. I highly recommend going to office hours and getting to know him better since the class is so huge. Highly recommend this class as well, it is very easy but you still learn a lot. ", "rating": 5, "expected_grade": "A", "created": "2021-10-22T14:21:31Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "This class is insanley boring, and Griffin is not a good lecturer. However, the course is very easy and you don’t even need to pay attention that much to do well in his class. Griffin also provides a lot of assistance for studyibg for his tests and he is a very pleasant person when he’s 1 on 1.", "rating": 3, "expected_grade": "A", "created": "2021-12-09T14:38:28Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "I did exceptional in his exams because of the AMP review sessions. He is rude and literally says he doesn't answer stupid emails. So. two of my emails were stupid because he never responded to them.. He calls students out all the time in lecture and lecture is mandatory for his class activities. Classroom is so loud because so many students talk and don't respect him. Maybe if he was nicer students will pay attention and be respectful. So glad this class is over with. My TA also never emailed me back so class was just great. I learned more from acropbatiq and the AMPS. ", "rating": 1, "expected_grade": "A+", "created": "2021-12-17T22:20:43Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Professor Griffin is the best! This was my first class and coming from a small high school the idea of a large lecture terrified me. After the first class on August 30th, I went up and introduced myself and from then on he knew my name in the 200+ lecture hall. Something I would recommend would be to sit in the front of the class as well as go to office hours. He is super helpful. Before the exams (about a week before) he gives review guides with lots of problems on them along with a detailed answer key. It is super helpful in preparing for the exams. If you study and understand the material you should do fine on the tests. I was super scared but studied a lot and went through the problems many times as well as went to the AMP study sessions the day before the exams and did fine on the exams. I signed up for stat 100 because it was a required class for my major and I cannot recommend Professor Griffin enough, he truly made a huge impact on me. I am writing this after this class and I received an A+. ", "rating": 5, "expected_grade": "A+", "created": "2022-01-20T03:41:18Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "I actually feel like he cares about his students and I’m learning alot from his class. Yes, lectures are basically mandatory but he puts effort into the lectures and actually wants his students to understand. One of the best teachers I’ve had and I’m a senior and not even a stat major.", "rating": 5, "expected_grade": "", "created": "2022-02-27T02:45:43Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Griffin is a solid choice for stat100. If you can get over his sometimes snark remarks and micromanaging behavior he's fine. All of the work is pretty easy as long as you pay even a little bit of attention in class. He gives a lot of extra credit and there are so many things you are graded on in class. There were coding problem sets but they aren't that hard, he basically gives you the answers on how to do them. Although attendance is graded and mandatory, the class isn't that bad and is a pretty easy A if you actually do your work. If you don't do your work and come to class don't expect to get an A. ", "rating": 4, "expected_grade": "A", "created": "2022-04-04T17:12:29Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "DO NOT take this guy if you have the choice. Yes the class is easy but lecture is mandatory but he just reads off the slides and doesn't explain things very well. His slides are also entire blocks of text. He can and will spend an entire lecture session in order to explain how to do easy concepts such as mean, median and mode. The website that you do homework on teaches better than him. He will also stop class if he hears a single person talking and call them out. It's like high school but worse. Easy A in terms of material and tests but if you have the choice between him and another professor, take the other professor!", "rating": 2, "expected_grade": "A", "created": "2022-04-07T17:45:42Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "He is extremely strict about attendance and often gives out graded assignments in the first few minutes of class - make sure you can be on time every day! He posts his lecture slides on ELMS and updates them with examples after class, which is super helpful for homework and studying. It feels like he spends a bit too much time stressing attendance and class procedures - he talks about them for like five minutes every class, which is a lot for a 50 minute lecture. If you complete your work in a timely manner, keep up with the readings (for the most part, I know I didn't stay on top of it all the time), and try to participate in lecture like twice a week, he'll like you and you'll be fine. In a 300 person lecture hall when no one wants to be there, any bit of effort will be appreciated. ", "rating": 4, "expected_grade": "A+", "created": "2022-04-12T16:28:24Z"}, {"professor": "Matthew Griffin", "course": null, "review": "Prof Griffin makes stat 100 way harder than it has to be. Lecture attendance is mandatory and he makes lecture assignments due in class so if you miss your grade goes down. Also, you have to code in this class which is ridiculous and he doesn't give you any help with that while the other prof for stat gives you all the answers. He is also just really bad at teaching stat it could be so much more simple.  ", "rating": 1, "expected_grade": "", "created": "2022-04-27T16:18:14Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "This class is actually so easy. Just show up to class on time and if you go to your discussion sections the coding part will NOT be a struggle. tbh I did not look at the acrobatic readings since the first week of class because he does a good job explaining material in class. I love the class and the Griffin and the people who say don't take him are people who don't show up to lectures ", "rating": 5, "expected_grade": "A", "created": "2022-05-08T00:39:34Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "I think people are too hard on Mr. Griffin.  He can be strict about attendance but he is really pleasant to talk to one on one.  The AMPs in my class were very nice and helpful and I definitely preferred learning through Acrobatiq rather than some old, boring textbook.  The math content is definitely easy and the coding part is basically done for us through the tutorials.  The workload is not heavy and the grading is fair.", "rating": 5, "expected_grade": "A", "created": "2022-05-11T01:50:02Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Annoying in class, but really sweet in person. AMPs were absolutely atrocious this semester but besides the point, straightforward class honestly learned more on my own than from him but he gives you every resource you need to succeed. ", "rating": 3, "expected_grade": "A", "created": "2022-05-15T04:40:39Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Obviously its important to remember that different people have different experiences, but I belief that some of the bad reveiws professor Griffin recieves are not warrented. First off, it is true that he takes attendence for his 300 person lecture, which can be very annoying. However, that in itself counts for 3.75 throughout the whole semester which is a tiny amount and makes no impact on your final grade. However, any worksheets or class activities that are done in class cannot be made up if you miss class without an excused absense so my main message is --> Go to class!\r\n\r\nI believe that the people who have the worst time with Griffin is the ones who came at the beginning of the semester but then didn't show up at the end. Therefore, they didn't complete some class activities and didn't learn the material well as might not have done so well on the exams. In class, Griffin gives you all the resources you need (his practice exams usually mirror his regular exams), he gives out tons of extra credit, and the class is not too much work.\r\n\r\nYes you will need to code in R language for this class but as a non-stem major, I found this to be very doable. For each problem set that Griffin gives out, he gives you a tutorial for how you can complete it, and if you follow the tutorial exactly, you will be just fine. Through 9 problem sets, I only missed 1 point just by following the tutorials. Also, on class activities, he gives you 3 attempts so getting a 10/10 each time is easy to do and those 10/10 will add up to help your grade.\r\n\r\nHe can be a stickler for attendence and for talking in class, but I do recommend Griffin. He is a nice guy and you will definitely have a pretty easy time learning statistics from him.", "rating": 5, "expected_grade": "A+", "created": "2022-05-20T04:38:37Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "This class is relatively easy, but you MUST attend lecture and do the class activities (graded within the first 5-7 minutes of class) to keep up with the course content. Griffin provides excellent resources for exams and assignments, but lectures are dreadfully boring. Acrobatiq assignments are also quite useless, in my opinion, but since the quizzes are graded, you have to pay some amount of attention when doing them - it sucked that we had to purchase the code though. The problem sets were also not very helpful in terms of learning material because it was just copying the tutorial pages with different numbers. Frankly, I don't even remember much of the coding from R from that class. \r\n\r\nHowever, taking Griffin for STAT100 will adequately prepare you for the final. The class activities can be a pain, but I cannot stress enough on how much they help you success in the class. ", "rating": 3, "expected_grade": "A-", "created": "2022-05-20T23:34:34Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "I don't understand the low star reviews complaining about things that were clearly outlined in the beginning of the semester. Yes lecture is mandatory. Yes you have in class assignments that are graded (but he drops the lowest few scores at the end), Yes he will make remarks about students talking too much and noise level (in a lecture of 200 students, how can he not?). Yes he will harp on students who continuously disregard the directions CLEARLY explained in the beginning of the semester and on the syllabus if they send repeated emails asking when X assignment is due or if their absence is excused because they have a cold. He's a straight forward professor who gives a ton of extra credit and additional opportunities to make up for low scores. If you attend lecture, pay attention in class, and stay on top of the assigned readings, this is a manageable class. Attendance in discussion is not mandatory (and most rarely go because the problem sets are literally done step by step for you in the tutorials) but he does give you extra credit based on how frequently you attended them. Content isn't hard either - again just attend lecture and do the readings. Acrobatiq is your best friend in this course. Practice exams he gives out for the midterms and final look exactly like the actual exams just with different numbers. Stay on top of everything and you will be fine. He's also open and willing to help/clarify with any questions if you go to his office hours. ", "rating": 5, "expected_grade": "A", "created": "2022-05-22T17:08:31Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "One of the worst teachers I have ever had, almost never teaches anything of relevance to the tests in class. He spends nearly 10-20 minutes per class! Monday Wednesday and Friday, going over the course syllabus instead of anything useful or interesting. The class is easy if you do the practice tests but good luck keeping your sanity in the mandatory attendance lectures.", "rating": 1, "expected_grade": "A", "created": "2022-11-30T17:28:16.884491Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "Great professor, everything is clear, easy, and extra credit is given. Very straightforward class and wants all his students to succeed.", "rating": 5, "expected_grade": "A+", "created": "2022-12-05T19:06:06.125951Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Literally, a free A. Lectures are straightforward and apply to the class activities and are very similar to test questions. People complain and the reviews are low due to mandatory attendance. If you don't like the policy, just don't take the class but have fun with another professor because this is literally a guaranteed A with him.", "rating": 5, "expected_grade": "A+", "created": "2022-12-05T19:07:10.259474Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "I do not understand the issues related with Griffin. If you attend lectures and discussions this class is pretty straightforward and easy. Help with the work can all be found in the lecture slides, and the practice tests are very similar to the actual tests.", "rating": 5, "expected_grade": "A", "created": "2022-12-06T03:28:02.775071Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "I don’t get all the hate the man gets. It’s just people who dont show up to class that have problems with him. Just show up and you’ll be fine. As far as his lectures, they can get boring at times but he does a good job at explaining the concepts very well. He tends to go over stuff multiple times which can get boring but he just wants everyone to understand. The Acrobatiq assignments were pretty useless IMO but they were graded so oh well. His practice test are almost identical to the real thing. As long as you can complete the practice test and problems, you’ll do fine on the exams.", "rating": 4, "expected_grade": "A", "created": "2022-12-09T00:25:33.824044Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Professor Griffin is a nice guy if you are respectful and go to class. Although lectures are mandatory and attendance is taken, he offers so many extra credit opportunities that will inflate your grade a ton. The practice exams he posts are JUST like the exams. He does sometimes ramble and get frustrated with students, but it's usually for a good reason (talking/not paying attention).", "rating": 4, "expected_grade": "A", "created": "2022-12-09T16:33:00.664710Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "Prof. Griffin is incredible. He put a strong emphasis on participation and attendance. This emphasis may have annoyed some students at first, but I feel strongly it's largely responsible for my success in this class. He's accommodating for those students who struggle with formal assessments, offering extra credit opportunities several times per week. He also brings a contagiously positive attitude to every class session, which has given me a legitimate interest in a subject I was previously unaware of. He visibly cares about his students more than any other professor I've had in my five years at UMD.", "rating": 5, "expected_grade": "A+", "created": "2022-12-10T03:51:01.882987Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Best professor and he truly cares and wants you to succeed. Yes attendance is taken but show up and put in the work and you will do fine in the class. There are AMP's there to help you and they have office hours so there are multiple opportunities to ask for help outside of class MWF", "rating": 5, "expected_grade": "A+", "created": "2022-12-10T21:28:37.092985Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Professor Griffin is a good professor and the class is extremely easy. However, attendance is mandatory and taken each class. There are also assigned seats in this class. On the other end though, there are countless assignments to build your grade up.", "rating": 4, "expected_grade": "A+", "created": "2022-12-13T02:59:02.475691Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Professor Griffin was a super easy professor. He does grade based on your attendance as it’s mandatory. His lectures can be pretty boring and he tends to get caught off guard by telling students to stop talking, but he does want all of his students to succeed. Before each exam he gives a lot of practice problems AND previous semesters exams. There are also AMPs that help out each class and host study sessions. You also have to complete the online textbook problems which is kinda annoying sometimes but just stay on top of it because it’s literally a grade booster. Prof. Griffin also gives soooooooo many extra credit opportunities like on the daily worksheets, if you raise your hand in class, if you write your answer on the white boards, and etc. If you need to take STAT for your major DEFINITELY take STAT100 with Griffin.", "rating": 5, "expected_grade": "A", "created": "2022-12-13T23:59:45.003757Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "I honestly don't know why he doesn't have at least 4.5 stars. This class was so easy and it is because Griffin prepares you SOOO well for exams. We have class activities that helped me a lot in remembering the content because we are literally practicing what is going to be on the exam. In addition, he gives us a lot of practice problems and exams from the previous semesters that are IDENTICAL to the exams he gave out this semester. He also gives out A LOTTT of extra credit opportunities during class which is so nice. The only \"meh\" thing about him is that he is monotone so it's pretty hard to pay attention. I also found reading the acrobatic pages to be extremely useless tbh. I would definitely recommend this professor because he actually cares about his students and wants them to succeed. Also, attendance is required and he takes attendance as a part of your grade so make sure you attend! It's worth it!", "rating": 5, "expected_grade": "A+", "created": "2022-12-15T22:21:09.722197Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "Class is very straightforward, although the material is a bit difficult, with this professor he makes his own formula sheet which literally states the DEFINITION and the equation for each term, which makes it so easy to match with the test. DEFINTELY RECOMMEND!", "rating": 5, "expected_grade": "A", "created": "2022-12-16T19:24:54.836402Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "Not quite sure why his reviews are this low, but he is hands down the best stat professor I have had in my tenure as a stat major. His class is not easy don't get me wrong, but he has plenty of extra credit opportunities, class activities, and problem sets that will literally help you get the practice you need for the test. He only has 1 midterm and a final, and uses previous questions from the practice in the real exams. Would recommend this professor for any classes he offers. 10/10", "rating": 5, "expected_grade": "", "created": "2022-12-16T19:26:23.598670Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "This dude is a legend, he straight up pulled up the world cup during one of our lectures. The guy is very chill, his lectures are organized, and exams are fair. He really wants his students to succeed and provides a great atmosphere every class.", "rating": 5, "expected_grade": "A", "created": "2022-12-16T19:27:56.006621Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Professor Griffin was a great professor for this course. He gave multiple extra credit opportunities throughout the semester and lecture, although boring at times, was mostly just listening to him teach and then doing a graded class activity. My only knock is that he was really annoying about attendance. We had assigned seats and attendance was taken multiple times in a 50 minute period. Also the practice exams he gives are very similar to the exams, which was very nice!", "rating": 4, "expected_grade": "A+", "created": "2022-12-21T02:56:52.865356Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Giving Mr. Griffin 5 stars bc he deserves it. Great and supportive teacher who is committed to the success of his students.", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T01:20:45.631660Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "All the bad reviews are from people who are upset that they are required to go to lecture, which I don't understand bc you're in college for that very reason. Seriously, it is an easy class, where you don't even have to pay attention to do well. Exams are exactly like the practice. My only issue is that he takes the class way too seriously sometimes when it comes to talking or seating but its really not that bad.", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T01:38:30.097721Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "Great professor", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T18:56:08.641825Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "So many opportunities for extra credit, class is straightforward and there should be no reason to not get an A in this class", "rating": 5, "expected_grade": "A", "created": "2022-12-22T18:56:30.403495Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "10/10 Professor, all the bad reviews are just trolls that do not like going to lecture for the grade, if you would rather have your midterm be 40% of the grade rather than have 10% count as free points for coming to lecture, I guess that's for you then. The professor makes this class an easy a, the exams are exactly the same as the practice, and there is tons of extra credit opportunities to boost your grade,", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T18:57:26.472644Z"}, {"professor": "Matthew Griffin", "course": "SPHL601", "review": "Great professor coming from a graduate student.", "rating": 5, "expected_grade": "A", "created": "2022-12-22T18:57:40.544337Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "Like the other reviews mention, great professor, lecture is required to go to, but it isn't a big deal like the other reviews said cause this class is mostly challenging material that he makes easy to understand in class. There is only one midterm and a final exam, which are easy as long as you do the practice", "rating": 5, "expected_grade": "A-", "created": "2022-12-22T18:58:42.754736Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Easy class, the reviews from the previous people tell it all.", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T18:59:04.911681Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Great professor, truly the definition of a fair and chill statistics professor at uMD.", "rating": 5, "expected_grade": "A", "created": "2022-12-22T18:59:22.359496Z"}, {"professor": "Matthew Griffin", "course": "TLTC399", "review": "Was an AMP for his STAT100 course, and I will say, it is a guaranteed A+ as long as you attend the lectures, grade papers, and host discussions/officehours/study sessions. He is really communicative and professional to his AMPs, and even has beginning of the year and end of year dinners with us. Definetly recommend becoming an AMP for him as each semester you do it, it is 3 credits and graded for a free GPA boost.", "rating": 5, "expected_grade": "A+", "created": "2022-12-23T03:08:22.277937Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "FYI: this review also gives tips on how to succeed in the class\r\n\r\nHe does \"read off the slides\" (like some people are complaining) but he very clearly explains the concepts.  He had us do these practice questions in class (on paper), which were very helpful and you get them back with feedback - they are graded but don't worry about that.  Plus, the practice problems and the practice exams he posts on elms/canvas for exams are exactly what is on the exam.  Often he uses the same exact questions and just changes the values of the given numbers.  \r\n\r\nHe is strict about attendance and expectations, but reasonably so and if you show up to class you have nothing to worry about.  There was one time where I had a really bad thing happen earlier in the semester and I wanted an extension for an R assignment.  I talked to him during his office hours and he gave me a reasonable extension despite it going against his policy.  \r\n\r\nI did not get an A in class only because I didn't do the Acrobatiq (the online textbook) quizzes and towards the end I didn't hand in the R assignments - don't make the same mistakes.  You get three attempts for the quizzes (in Acrobatiq and elms/canvas) and the best score is taken.  The code is given to you for the R assignments, all you have to do is change certain details (because the code you are given is an example using different data and varibales) - but you are given instructions that tell you exactly how to do so.  Also with the R assignments, the three with the worst grades are dropped and not are included with your final grade for the class.  (Tip: don't let perfectionism stop you from handing in things, try your best, get the assignment/quiz over with, hand what you have in, move on.)\r\n\r\nThis was my second time taking the class, the first time I took it with Mazzulo and I failed, partially because I was a mess freshman year and because her teaching style did not match with my learning style.  She is nice and flexible but is nowhere are structured/organized as Griffin and he gives you so many more resources and opportunities to learn and review the material.  Also, she barely provided any help for the R assignments (from what I remember).  If you are a neurodivergent student who needs accountability and structure (like me), I recommend Griffin.  From my experience he seems very ND friendly, but make sure you are communicative.  He is a little intimidating at first but if you give him a chance he is an excellent professor and a very cool & nice person.  By far my favorite professor so far.  Feel free to message me on insta if you have any questions or concerns: @_laura_levine_", "rating": 5, "expected_grade": "B+", "created": "2022-12-25T01:44:58.254933Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Griffin is literally everything I want in a professor. I think what I liked most about STAT100 with him is the fact that literally NOTHING will catch you off guard in the class (as long as you attend lecture every day and do the reading somewhat consistently). Everything is familiar and he will address and review things multiple times before evaluating your performance on it in Class Activities. AP Stats was the hardest class I ever took in high school, and Professor Griffin's class was such a breeze. FANTASTIC", "rating": 5, "expected_grade": "A+", "created": "2023-01-03T20:45:15.482785Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "In terms of the professor: He's an alright lecturer. What I found most annoying is that he would often stop in the middle of class to tell the students who are talking to stop talking, which is a good thing usually; but when it's done almost every lecture and sometimes for multiple minutes, it takes away from time that we could be using for the actual lecture. He either summarises what's on the lecture slides or reads off of them and usually doesn't expand on them that much since there isn't much to expand on. Almost everything that was on the lecture slides were already learned from the book, so lectures can get really boring since they seem repetitive, but this style somewhat effective since it's basically a review. Aside from that, he does provide a lot of examples about concepts, extra credit opportunities, and practice problems during class.\r\n\r\nIn terms of the course: It's extremely easy if you attend all lectures and do all the readings. The lectures are basically a review of the readings and a chance for practicing the material. There are 2 midterms and a cumulative final. Formula sheets are provided for you, and they're closed-everything (no notes, no books, etc.). The midterms are designed to take up 30 minutes because we usually start a couple minutes into class. There are assignments that are graded from the online interactive textbook. Everything from the book except for the quizzes were graded on completion. There is quite a bit of coding. Almost every discussion is another R coding assignment, which are called \"problem sets\". Most of them could be done in class if you have a background in coding, even the slightest bit. The assignments are provided with tutorials that walk you through the coding. You have to know the concepts from lecture before knowing how to alter the code in order to complete the problem set. Your section's TA use the discussion period to walk you through the tutorial as a class, explain what you need to do in the problem set itself, and then leave the rest of the discussion to work on the problem set and ask for help if you need it. There were two sections assigned for one classroom at the same time for my section; so, it was a bit hard to follow along when both TAs were talking to their own sections and were usually on different parts of the tutorial.", "rating": 4, "expected_grade": "A", "created": "2023-01-24T22:32:47.542306Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "GOAT", "rating": 5, "expected_grade": "A+", "created": "2023-01-31T00:50:24.034544Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "Beast, love this man", "rating": 5, "expected_grade": "A", "created": "2023-01-31T00:50:32.637589Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Couldn't ask for a better STAT100 professor. Prof. Griffin is no nonsense and kind of annoying about attendance, but he's doing everything is his power to give you an A. Lectures are clear, pretty much every graded assignment including exams are easy, and tons of EC opportunities. TAs are great, Griffin is great, take the class.", "rating": 5, "expected_grade": "A+", "created": "2023-02-01T22:50:30.236374Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "This man is obsessed with attendance. 60% of lecture is taken up by him complaining about the students who don't come to class, to the students who have come to class. Also, he makes a stink about needing a doctors note if you have covid. Also also, he is not ADA friendly- he will make you come to his office hours to \"explain\" your accommodation (which is illegal).", "rating": 2, "expected_grade": "C+", "created": "2023-02-20T19:25:54.110945Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Overall he's a good teacher in my opinion. He made the course a little easier and you can tell he cares about your grade based on how much extra credit he gives out. The only thing I don't like about him is he can be a little too strict. It might be that he has sensitive ears but I swear he can hear a phone vibrating from 50 feet away. He also doesn't respond to emails that often which is a bit annoying. I would say however, that it is difficult to fail his class.", "rating": 4, "expected_grade": "A+", "created": "2023-03-01T20:26:50.118739Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "This class is laughably easy if you attend every lecture like he says to in the syllabus. He does do lecture checks and attendance is mandatory, your grade WILL drop if you skip class often. However, between his lecture style and Acrobatiq, the material was very easy to understand. I got above 96 on both midterms and the final. Use previous exams provided to you on ELMS to study for the exams and you will find the questions are very similar in the way they are structured. Professor Griffin was great, he is strict about attendance and having a quiet class but he also has a lecture hall of 200 people to teach, so it makes sense. He comes to the review sessions the TA's hold in order to answer question and he does take note of those students who are actually asking for help in order to improve. He gives a lot of extra credit opportunities and it does add up significantly to your grade. He provides a lot of resources and does activities that are relevant to bigger assignments and tests. He usually provides a previous fall and spring exam version for each exam, as well as practice problems he put together separately for you to test yourself on, and the TA's are phenomenal as they make themselves available and put out practice problems before exams as well.", "rating": 5, "expected_grade": "A+", "created": "2023-03-01T21:25:24.570928Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "If you like an organized professor that has an agenda saying what hw/tests u need to do, you will like this guy. He is extremely organized, submits in elms the agenda every single week on the sunday before. Only think is he's a nut about attendance, so make sure to attend class. loads of extra credit opportunities, honestly take the class! don't skip class kids", "rating": 4, "expected_grade": "B-", "created": "2023-03-05T22:36:29.689166Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Honestly, class was not super engaging and I did not really feel like I had to pay attention (sorry professor). However, getting a grade was easy and assignments were fine", "rating": 4, "expected_grade": "A+", "created": "2023-03-09T16:57:54.153292Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "His STAT100 class is quite easy if you follow his slides. He also provides lots of extra credit throughout the course, which is easy to get and helpful for your grade. As a teacher, I don't think he is the best. He spends 20/50 mins. of class talking about attendance and how important it is to show up... to the kids who come to class. You must present proof for all absences, even when it is things involving serious matters that aren't doctors (the note can be difficult to acquire). He's sassy to his students, definitely likes some more than others, and to his group of students that are but aren't TAs, he gets annoyed very easily. Those same TA but not TA kids don't know much about what they're doing, making discussions incredibly difficult to follow. Not only that, but attendance is extremely important in this class for discussion too (even on the days when we just do absolutely nothing for the whole class, like a work day). To survive this class, it is recommended you make friends here. If you stay nice to him, he will be nice, but just provide a doctor's note, or else it won't be believed.", "rating": 2, "expected_grade": "A-", "created": "2023-04-11T15:07:27.561438Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Review below must be someone who is clearly skipping class and a bad student. This professor does care about attendance, but just go to class... this class is pretty interesting has extra credit and is a FREE A IF YOU LITERALLY PUT IN EFFORT TO PAY ATTENTION. EXAMS ARE IDENTICAL TO PRACTICE.", "rating": 5, "expected_grade": "A", "created": "2023-04-22T19:16:31.952537Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Don't know why people give this professor a bad review, you get an A or A+ and say 2 stars because of attendance? Common man this class is so easy its just paying attention and the exams are the same as practice", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T04:05:37.553399Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "Exams are pretty easy and professor is very chill", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T04:05:54.321248Z"}, {"professor": "Matthew Griffin", "course": "STAT464", "review": "If I had to take one math class in college for my GenEd I figured STAT would be the most bearable. This is the only math class since elementary school that I have enjoyed. Griffin is engaging, posts slides, freely gives out extra credit for class participation, and gives at least 1 extra credit opportunity proceeding every exam. AMPs will have frequent study hours where they will give homework help and will do reviews before all exams. If you attend office hours he will be very helpful and even give you the answers if you are struggling. Professor Griffin is a teacher that cares deeply about his students and their success.", "rating": 5, "expected_grade": "A+", "created": "2023-04-26T02:19:47.067873Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Do not feel threatened by this class. It is a lot easier than it looks. Griffin is a great guy if you get on this good side. Don't bother emailing him because he probably won't answer, but I did not find myself needing to email him the whole semester. You do have to attend every class but it is not that bad. You get extra credit for practicing in class. Read the acrobatic readings before class so you can confirm your understanding during class. Do not fall behind in the readings; that is the worst thing. The AMPs are awesome because they are also students, so they're usually chill and helpful. Griffin is a good and throughout teacher, i do not feel like he leaves material untaught, so pay attention.", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T14:37:39.132310Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "I am normally terrible at math but this class was so easy and actually pretty entertaining too. Professor Griffin is really good about explaining information and giving you A LOT of extra credit opportunities, so I feel like you would have to try to get a bad grade. There were 2 midterms which were really easy, and one final. Attendance for his class is mandatory because he gives worksheets and assigns points for attendance, but honestly the lectures go by so quick and the added points are very much worth it. The homework seems lengthy but technically you don't have to do the readings, just the little module quizzes (which you have 3 attempts on) and most of them are graded for completion; in addition to that, you typically have up until he grades them to turn it in, so if you miss a due date it's not that serious. You also will have a weekly problem set for discussion but you use R-studio for it and he provides you with documents that have the exact steps and instructions, so you will probably finish and submit in that discussion session. Overall, if you are debating taking this class TAKE IT and take it with professor Griffin, you will not regret. EASY A!!!", "rating": 5, "expected_grade": "A+", "created": "2023-05-09T15:01:44.287560Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Discussions and class are a total waste of time and unbearably boring, I just stopped going to avoid wasting gas. Easy class though, just know basic statistics.", "rating": 1, "expected_grade": "B", "created": "2023-05-09T23:45:30.100916Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Well organized and easy to communicate with. He is very understanding of late assignments and not showing up to class but you need to let him know in advance and have a valid reason. His teaching style was great and he taught well. If you read the slides, do the work, and pay attention in class you will get the grade you want. Also, he has peer mentors who lead study sessions which I highly suggest.", "rating": 5, "expected_grade": "A", "created": "2023-05-21T04:04:17.354803Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "So much of the time he spent teaching was to complain about all the students who didn't regularly attend class. I believe that if students want to skip the class they paid for they should have the freedom to do so, but it is obvious Griffin doesn't share the same sentiment. Most of the grading is arranged so that if you do not regularly show up to lectures and discussions, it would be difficult for you to get an A in the course. He is okay in teaching, mostly he just reads off the slides and gives out quizzes. He also NEVER responds to emails, even when you do the exact format that he requires. Overall, he is annoying but it is an easy A if you are comfortable in attending all/most of the classes and lectures.", "rating": 3, "expected_grade": "A+", "created": "2023-05-21T21:55:12.009595Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Go to class, discussions, and at least attempt to do the work. The class was pretty straightforward to me having taken other stat courses, yet it's an elementary stat course so you'll be fine even if you've never seen any of the material before. Attendance is annoying and so is Acrobatic, but I promise if you do well on exams you won't have to worry about those things anyway.", "rating": 4, "expected_grade": "A", "created": "2023-05-21T23:04:00.148279Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "STAT100 was required for me as a humanities major and I was pretty sure I was going to flunk out. However, this was not the case at all because Griffin provides so many resources to make sure that you succeed. He is definitely weird about some things (assigned seats and attendance in his 400 person lecture) and he definitely has favorite students, but his class is easy to pass and you will actually learn something. Go to class (and discussion because the TA will give homework answers), do the assignments, and ask the AMPs for help if you're struggling and you will be sure to pass.", "rating": 4, "expected_grade": "A", "created": "2023-05-24T02:17:53.050327Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Free A boring teacher, was a waste of time going to lectures. I would choose anyone else, maybe someone who doesn't move at an elementary level pace.", "rating": 1, "expected_grade": "A+", "created": "2023-05-26T07:31:57.325144Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "BEST STAT PROF. JUST DO THE WORK AND SHOW UP!", "rating": 5, "expected_grade": "A+", "created": "2023-05-27T00:56:54.804633Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "ended up with a 69.2... didnt want to round up.", "rating": 1, "expected_grade": "D", "created": "2023-05-31T14:03:12.542254Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Went thru health problems this semester and it wasnt a excuse to miss lectures?? one star.", "rating": 1, "expected_grade": "C", "created": "2023-05-31T14:03:53.374729Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "So easy that if you show up and breathe in this class you’ll get an A. He moves really slowly and pretty much the first half of the semester  is review of basic concepts like mean, median, and mode. He’s kind of annoying about attendance, but he’s a good teacher, so you’ll benefit from going. What’s really nice is that he provides plenty of review materials before tests, and holds a lot of review sessions. Most of the averages for his exams were in the nineties, so he really does do a good job of preparing us. I’d definitely take him again!", "rating": 5, "expected_grade": "A+", "created": "2023-07-21T15:19:56.130737Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Great professor, so many trolls in this page, yes you ended up with a 69.2 when you round it , it goes down to a 69 doofus. Easy A, how do you get less than an A in a stat100 class. Exams are identical to practice, worksheets are literally the same as the slides covered in class.", "rating": 5, "expected_grade": "A", "created": "2023-07-26T06:12:57.569238Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Truly cares about education. Tests are fair, homework is easy, put in the effort and you will get an A.", "rating": 5, "expected_grade": "A+", "created": "2023-07-26T06:17:39.285902Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "I think his average student gpa is all you need to know. This class was a breeze and he taught it so well. No curveballs on exams and everything was same as practice", "rating": 5, "expected_grade": "A+", "created": "2023-08-04T04:58:50.059114Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Great professor. Tests are identical to practice, homework is easy and on chegg. Anyone who complains about attendance or this class being hard, absolutely smooth brain", "rating": 5, "expected_grade": "A+", "created": "2023-08-04T04:59:32.808520Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Everyone who complains this class is hard must be a little bit dumb. Free A, if you pay attention and are not an NPC, this is the easiest A you will get in any math course", "rating": 5, "expected_grade": "A+", "created": "2023-08-18T20:54:36.543156Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Best professor, passionate and truly cares. Practice exams are the SAME AS THE ACTUAL EXAM, SO TAKE THIS COURSE", "rating": 5, "expected_grade": "A", "created": "2023-08-18T20:55:02.702223Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "Great professor. He prepares a cheat sheet that you can use on each exam. Furthermore, his tests are pretty similar to his practice exams and he always gives the solution to the practice exams, helping you study. this class also has 20+ extra credit points", "rating": 5, "expected_grade": "A", "created": "2023-08-19T04:03:43.238069Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "Makes this class seem super easy. Great professor.", "rating": 5, "expected_grade": "A+", "created": "2023-08-19T04:03:56.021742Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Look at his grade distribution for this class. It will tell you everything about this course, it is super easy. The exams are identical to the practice exams, the problem sets are literally changed up questions of the tutorials he gives you under canvas files. The classwork is super easy. People complain about attendance, but it really helps you because you pay attention and learn a lot from this class which makes it easy for you later throughout the class.", "rating": 5, "expected_grade": "A+", "created": "2023-08-22T04:45:29.011160Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "Do not take it with Natalia , trust me, it is MILES harder then this professor. I failed it with Natalia and this professor I'm telling you is an easy A. He gives you a formula sheet of all the formulas used in the class and questions are pulled from the practice exams. Also there is opportunities to get 20+ extra credit points in this class throughout the semester.", "rating": 5, "expected_grade": "A+", "created": "2023-08-22T04:57:24.412532Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "THE ABSOLUTE GREATEST STATISTICS PROFESSOR AT UMD. HE IS REALLY CHILL AND THE CLASS IS SO EASY", "rating": 5, "expected_grade": "A", "created": "2023-08-22T04:57:51.917454Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Exams are identical to practice. There is a formula sheet too. Classwork + homework super easy. Take this class for an A", "rating": 5, "expected_grade": "A", "created": "2023-08-22T04:58:39.382719Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "If you are worried about the bad reviews for this class. Turns out they probably are bad students. I took a gander at most of the good reviews and its pretty much what I was going to write. Just take this course, its quite easy.", "rating": 5, "expected_grade": "A", "created": "2023-08-22T04:59:27.016571Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "A little bit confused as to why people say they hate attendance, maybe that's just the lower level stat class. I think it actually is very beneficial that there is attendance since the class is pretty challenging without coming. However, when you are in class it is pretty easy and the teacher is very good.", "rating": 5, "expected_grade": "A+", "created": "2023-08-24T18:51:47.770429Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Professor Griffin will come off as strict and mean in the beginning but he does try to learn names and get to know you more personally especially if you come to office hours he is the sweetest person ever and will practically give you the answers and explain them more clearly than in lecture. Attendance is mandatory for everything so go because that helps with your grade and extra credit points are offered in almost every class. Midterm 1 is easy if you attend lectures and study sessions but midterm 2 is a bit more challenging but not impossible. The same thing, attend lectures, discussions, and study sessions and you can guarantee yourself a good grade because the practice exams are the same as the real exam. There are online and paper class activities so attend lectures otherwise you bring your grade down for no reason. Problem sets are almost every week and you learn how to use R. I struggled with this because I am not a STEM major but after a few, you can understand it a bit more as long as you follow along in the discussion. All the TA's and AMPs are really good and super nice and there was a few times I had to leave early from class and they still let me complete the class activities, just tell them in as much advance notice as possible. Professor Griffin is also really flexible if he knows you, so I cannot stress this enough, go to office hours even if it's just to introduce yourself or ask a simple question. If you show you care, he shows he does as well. Overall, I was worried about taking STAT because I am not good at anything math or STEM-related and I am taking this class as a requirement but without a doubt I would take this class with him again if needed", "rating": 5, "expected_grade": "A", "created": "2023-11-24T13:08:34.416488Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "LOVE THIS CLASS AND THIS PROF! I took stat my last semester of high school so I had a little bit of background knowledge going into the course. Prof G makes it so so easy to succeed in his class. He has office hours twice a week, guided study sessions twice a week, offers up to 20 points of extra credit, and is just a great professor. I highly recommend going to office hours, even if you don't think you need it, because it allows him to put a face to a name and he's more likely to call on you in class for extra credit. I went to office hours all the time (and I consider myself to be a great math student) and it helped me so much. Attendance is mandatory for lectures, but I didn't mind that part since I go to all my lectures anyway lol. I cannot recommend this class and this professor enough.", "rating": 5, "expected_grade": "A+", "created": "2023-12-01T16:35:27.505552Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Makes the class extremely easy and impossible to fail. All of the exams are exactly like the work in class and on review sheets.", "rating": 5, "expected_grade": "A+", "created": "2023-12-04T18:21:46.721991Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "This class is beyond easy. He gives out extra credit almost every lecture. As long as you show up to lecture (because he counts attendance) you will do absolutely fine. He is very nice and truly just wants his students to learn. I would recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T02:54:28.560049Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "I took AP Stat senior year of high school, and this class is 10x easier and so easy to do well in. The way Professor Griffin organizes the content makes it extremely easy to understand, even if you aren't typically good at math. He is very strict on attendance and you will lose points if you don't go, but it is worth it because it is, again, so easy to do well. Griffin offers extra credit opportunities practically every lecture session, and allows you to work with those around you on every in class assignment. As the semester goes on, if you are sick or have to miss class for an excused reason he is very accommodating and willing to help. He also makes an effort to get to know as many students and their names as possible, which is impressive with so many students. He does not go very fast with teaching content, making it easy to fully comprehend the information. Also, he gives out real exams from past semesters before every exam as practice and they are practically identical to the actual exam. He wants you to succeed and gives so many resources to do so.", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T03:38:07.355779Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Prof G is the best! He may come off as a bit strict but he really just wants you to do your best. He really emphasizes attendance and you have to go to every lecture and discussion but in lecture you get extra credit points just for raising your hand and answering a question even if someone already said the answer you can say the same thing as them and u get an extra credit point. He gives study objectives, study guides and past tests for tests. Make sure you go to office hours he goes over questions and tells u what to look for on the test and he makes the effort to learn your name and get to know you.", "rating": 5, "expected_grade": "A", "created": "2023-12-05T20:27:14.071214Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Wants students to succeed. Gives a lot of extra credit opportunities. Tests are exactly like the practice tests. Only bad thing is attendance. It is mandatory but if you show up you'll be fine.", "rating": 4, "expected_grade": "A", "created": "2023-12-06T03:58:11.698016Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "He’s a pretty great professor but is lowkey leading the Sassy Man Apocalypse. Attendance 4 days/week is mandatory which sucks, HOWEVER, he genuinely designs this class for everyone to succeed. He gives tons of easy opportunities for extra credit and makes the class pretty impossible to fail if you just go to most of the lectures. Exam are easy and identical to practice problems, I would have an A+ if I went to class consistently so if you’re like me and <3 skipping, keep that in mind before taking this class xoxo", "rating": 4, "expected_grade": "A-", "created": "2023-12-06T17:32:10.117996Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "The class math in the class is easy and the Griffin gives lots of extra credit. His lectures can be a bit boring and monotonous, so I would recommend watching the videos in the textbook before the lecture so you know what he will go over.", "rating": 4, "expected_grade": "A+", "created": "2023-12-07T03:01:30.854982Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Easy A.", "rating": 5, "expected_grade": "A", "created": "2023-12-08T15:27:20.240711Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "This class was made so easy. So so many opportunities for extra credit, you just have to take them. Attendance is really important so try not to miss anything. His formula sheets give you everything you need. All of the practice exams that he gives you are almost identical to the actual exam so make sure you do those before. The GSS were really helpful and lowkey fun to go to. Professor Griffin loves to scream about how important staying off of your phone and focusing. No hoods. Dont come in late. Dont leave early. The person next to you doesnt know what they are talking about. I guarantee that he will most likely spend the first 5-10 minutes saying those things at the beginning of every class. Other than that this was a fine easy class.", "rating": 4, "expected_grade": "A+", "created": "2023-12-08T16:25:21.676669Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Class is very light and he makes it near impossible to not get a passing grade with the amount of extra credit assignments. The tests are very easy and match what is done during the class.", "rating": 5, "expected_grade": "A", "created": "2023-12-09T22:49:42.511796Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "LOVE HIM HAHAHA", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T16:31:49.791997Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Professor Griffin is really nice and his class is an easy A. You have to show up to lecture and discussion sections but you will absolutely succeed if you do. Content is straightforward, but there are so many study sessions offered if you need help. Plenty or opportunity for extra credit.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T16:32:58.250837Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Professor Griffin is the best STAT professor you could ask for. I haven't used the textbook outside of assignments this semester, because he already does a great job of lecturing and giving you practice problems that mimic the exams. Practice tests are the same format as the midterms and finals and he gives you every opportunity to get extra credit. He comes off as strict about attendance, but it is a very fair policy and he's super understanding if anything happens.", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T16:34:57.020723Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "So many extra credit opportunities and past exams are identical. I got 100s on both midterms simply by doing the past exams a couple of times. Problem sets were a bit annoying but there were tutorials that were pretty much the same which really helped. Lecture and discussion are mandatory which wasn't an issue for me but if you're one to skip a lot don't take him. He also made it very known that attendance is mandatory from day 1 and pretty much every review says the same so I don't really know why so many take him just to end up complaining. Professor Griffin is amazing and truly cares about his students and wants everyone to succeed. He makes sure that there are plenty of resources for us to do well on the exams so if you don't do well on the exam you have no one to blame but yourself.", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T17:28:05.781030Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Makes STAT100 extremely easy to understand. I thought it would be a really hard class, but not at all. So many extra credit opportunities. The only thing is he's really strict about attendance, but it's not a problem if you just go to lectures and discussions. I'm glad I took STAT100 with this professor.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T19:16:14.018904Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "This class is super easy. Griffin gives a lot of extra credit, holds a bunch of study sessions for exams, and the practice exams are literally identical to the actual exams. Attendance for lecture and discussion is required but its not as bad as it seems. The TA's are also really helpful. It's pretty hard to fail this class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T19:35:33.250080Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Professor Griffin makes this class easy to pass and all his exams are based on the practice questions. He also adds 20 extra credit points which are easy to acquire if you answer questions in class. HOWEVER, not showing up to class will lower your grade even though for the first 10 minutes he goes over the same syllabus slides every class. You will get frowned upon for showing up a minute late. When emailing for missing a class he does not respond and two always need proof of why you are missing class. This was annoying as when you wake up with a fever the last thing you want to do is walk in the cold to the health center just for a note to be excused. Showing up to discussions is also mandatory and all you do in that class is work for an hour and 15 min which you could easily do from home.", "rating": 3, "expected_grade": "A", "created": "2023-12-11T20:04:42.557417Z"}, {"professor": "Matthew Griffin", "course": "STAT464", "review": "The class is fair and easy if you pay attention in class and attend regularly. TA's and AMP's are very helpful, and so is Professor Griffin. Don't expect to be a lazy student and get an A, but if you actually put in the work (which is not too hard for this 100 level math course), this class can be very rewarding.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T20:23:48.824711Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Great Professor! Makes it extremely easy to understand the concepts.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T22:09:41.919962Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Extremely nice if you go to his office hours, always wants you to succeed.", "rating": 5, "expected_grade": "A-", "created": "2023-12-13T01:06:26.698404Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "I was nervous about taking a class with this professor since some of the ratings were negative, but honestly his teaching style is great. Yes he does repeat announcements A LOT and have specific rules, but he provides so many opportunities for in class practice and even more for extra help outside of class.  Not to mention he provides extra credit points literally every single class. The practice exams that he posts before every test are formatted exactly like the tests. He basically gives you all of the information you need to pass this course. If you attend lecture and put in the effort, it won't be hard to get an A in this class.", "rating": 5, "expected_grade": "", "created": "2023-12-14T22:16:15.777256Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Stat 100 is a manageable course; the workload is not bad at all and you know far in advance when the tests and work are due. It is easy to self-study in this course, especially with past midterms and final exams which he posts before exams. I went into this taking AP Stat in HS, and it was mostly the same. Now,  Professor Griffin. This guy has to be one of the sassiest people I know. He spends an average of 10-15 minutes each lecture talking about protocol for attendance, and how to correctly write him an email, and honestly, it is a waste of time. He makes attendance mandatory for lectures, which yes, lecture is important, but sometimes things come up. His lectures are also such a bore: monotone voice and boring slides. Like if he wants us to show up to lecture, maybe make them more engaging. All in all, this is a pretty easy class, especially if you already have some stat knowledge, but maybe don't choose Professor Griffin if you do not like sassy men who care a lot about attendance and how to contact him.", "rating": 3, "expected_grade": "A-", "created": "2023-12-15T17:17:57.200588Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "He’s great and helpful", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T15:52:34.797489Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "He makes a lot of efforts to help our exams.", "rating": 5, "expected_grade": "", "created": "2023-12-18T06:09:30.810134Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "this professor is amazing. He makes the class extremely easy because he actually prepares you for the midterms and the final. Attendance is required but this forces you to learn and pay attention. He gives a lot of extra credit so definitely take advantage!!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T15:29:59.406430Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "He is a great professor. His lectures are right to the point, and he encourages students to follow along with his slides as he presents. He takes on a very direct approach to teaching the class: he takes attendance seriously, follows his presentations to the tee, and offers tons of chances for extra credit. As long as you follow all of his very clear directions, you'll do really well in the class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T02:00:08.347523Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "The best STAT professor you can get at UMD. He gives so much extra credit and his practice tests are almost identical to his real ones. Would recommend this professor to get your math requirement out of the way.", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T16:48:04.362517Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Take this class with Professor Griffin. He can be stringent on rules in the classroom and could come off as strict at the beginning but he genuinely cares about your learning and wants you to succeed in this class. The class has attendance points and has basically a daily activity which is graded. The class activity is very easy if you pay attention in the lecture. You will have a weekly problem set to do on R Studio but they are easy and if you go to your discussion section, the TA basically gives you the answers and how to do them. The problem set tutorial which is posted on ELMS also basically tells you how to do every question. The exams are very fair in this class and the problems are basically the same questions from the practice problems and the problems done in class but with different numbers, there are no surprises on the test. He also gives out extra credit like candy, if you go to class you can easily secure extra credit on exams, class activities, and problem sets. Take this class with Professor Griffin!", "rating": 5, "expected_grade": "A", "created": "2023-12-21T03:03:06.513679Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "good guy. SO MUCH extra credit all semester. Insanely free A", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T23:31:14.421294Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Griffin is a really great professor. He does have some nitpicky rules (no hoodies, assigned seating (that you pick btw), attendance for big lecture, etc) but they’re not bad after the first couple weeks. When he teaches he tells you what practice questions are similar to the ones on the exams, and the past exams you get to practice with are actually like the exams!!! Practice those twice and you’re good, they aren’t hard! Two midterms and the final. No quizzes, just online canvas assignments and worksheets. Mathlab homework was very little and you could really complete it whenever. Go to discussion and read the Problem Set Tutorials!!! before starting the actual Problem Sets because it is very close, if not exactly, what they want you to do. He also offers an insane amount of extra credit!!! Take him! He really sets up the class for success", "rating": 5, "expected_grade": "A+", "created": "2023-12-30T19:01:57.925139Z"}, {"professor": "Matthew Griffin", "course": "STAT470", "review": "He is the king of my heart. He takes the time to get to know all the student names, gives so much extra credit, and does a million examples. The actual content of the class can be confusing, but if you pay attention in class and read the examples from the textbooks, it's not bad. The only downside to having Griffin is he takes attendance every class and you could lose a big chunk of your grade if you never show up.", "rating": 5, "expected_grade": "A+", "created": "2024-01-16T22:18:34.769407Z"}, {"professor": "Matthew Griffin", "course": "STAT100", "review": "Taking him right now and I have never felt this confident about a midterm coming up next week!!", "rating": 5, "expected_grade": "A+", "created": "2024-02-28T23:58:08.688771Z"}], "name": "Matthew Griffin", "slug": "griffin_matthew"}