{"courses": ["COMM107", "COMM200", "COMM324", "BUSO705", "COMM107B", "COMM469G", "COMM107B", "BUMK762", "COMM107B", "BUSO705", "BUMK764", "COMM107B", "BUSO705", "COMM107B", "BUMK758G", "COMM686", "COMM107B", "BUMK758G", "COMM107B", "COMM686"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Melissa Lucas", "course": "COMM107B", "review": "Dr. Lucas is down to earth and teaches you exactly how to succeed in her class. If you put in the effort, there is no way to end the semester below an A. I Love her and the class, highly recommended. ", "rating": 5, "expected_grade": "A", "created": "2021-12-16T16:37:36Z"}, {"professor": "Melissa Lucas", "course": "COMM107B", "review": "Dr. Lucas is a very easygoing teacher and is also open to changing dates as long as the class asks. Almost everyone in the class has an A and as long as you put in a little bit of effort you should do well.", "rating": 5, "expected_grade": "A", "created": "2022-12-06T21:29:46.193436Z"}, {"professor": "Melissa Lucas", "course": "COMM107B", "review": "I love Dr. Lucas! She is so understanding and accommodating for her students, and she almost always lets you out early. She is a great teacher who gives really helpful feedback. I feel like she has actually helped me improve as a presenter. As long as she sees that you are putting in effort, you will get an A. Dr. Lucas is a great professor and I definitely recommend her!", "rating": 5, "expected_grade": "A", "created": "2022-12-12T14:19:57.775253Z"}, {"professor": "Melissa Lucas", "course": "COMM107", "review": "Dr. Lucas is super sweet, and a very understanding professor. She often let us out 30 minutes early in class. There are only three main presentations throughout the class, and a weekly quiz that can be completed in a few minutes. The workload in the class is honestly minimal, which is good for a gen-ed. As long as you prepare your speeches and follow the rubric she posts for her presentation requirements, you will get an A. The class is great for anyone to take, as it helped me greatly with public speaking. Awesome professor, would definitely take again!", "rating": 5, "expected_grade": "A", "created": "2023-05-07T14:25:30.544152Z"}], "name": "Melissa Lucas", "slug": "lucas_melissa"}