{"courses": ["ENES466", "ENES461", "ENES670", "ENES140", "ENES460", "ENES462", "ENES140", "ENES210", "ENES670", "ENES670", "ENES210", "ENES140", "ENES210", "ENES673", "ENES210", "ENES466", "ENES673", "ENES140", "ENES210", "ENES673"], "average_rating": 4.3333, "type": "professor", "reviews": [{"professor": "Michael Pratt", "course": "ENES140", "review": "This class is usually an online class but I had to take it in person since I was in FC. It is a complete waste of time to show up to class since all the material is online.\r\n\r\nThe final group presentation sucks. I had lazy group members and did all the work bc I really wanted an A. Any analysis I did with my \"group\" was terrible. The other assignments are cake though. Don't slack on those quizzes as I did; aim for perfects so you don't have to worry much of your group analyses and presentation.", "rating": 4, "expected_grade": "A", "created": "2018-12-19T22:44:40Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "The FC version is by far an easy A class, and you don't have to always show up to class, though sometimes he would assign attendance activities. You have to communicate well with your groupmates and spread out the work evenly. Almost everything after the first unit is group-based, so make sure your teammates know what they're responsible for and when you expect them to finish it. Everything is really easy in the class, but it's based on luck whether you're assigned to a compatible group.", "rating": 5, "expected_grade": "A-", "created": "2019-03-17T00:32:01Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "You have to show up when final projects are being presented at the end of the semester, however, you don't before that. Prof Pratt is kind, the class is huge, recccomend.  ", "rating": 5, "expected_grade": "", "created": "2021-12-09T21:43:39Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "There is a textbook for this class and some self based quizzes (meaning no right or wrong answers) for each chapter. Prof Pratt goes through the textbook in his slides during class so you don't really have to show up to class until the end of the semester during the final projects. A majority of your grade depends on the project so make sure you pick a good group but the project is relatively easy. Also, use the review slides in the modules when you take the weekly quizzes. Good class for someone who needs easy credits and Prof Pratt has a lot of good network connections if you ask him about internships. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-27T18:47:24Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Course is really easy, Mr. Pratt knows what he's talking about.", "rating": 4, "expected_grade": "A", "created": "2022-02-02T03:03:21Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Easiest A+ ever. It's actually interesting too, and Mr. Pratt knows his stuff- definitely recommend this course for an elective.", "rating": 5, "expected_grade": "A+", "created": "2022-10-21T18:09:56.038615Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Course is easy. Mr. Pratt is good at teaching what needs to be taught and giving good personal anecdotes about his life. He let us out of class almost everyday after 40 ish minutes. The one big assignment you have is the group project for the final which you have the whole semester to work on. Definitely and easy A. Weekly quizzes but easy if you do the reading or have the book with you while doing it. Would definitely recommend taking this class", "rating": 5, "expected_grade": "A", "created": "2022-11-27T16:43:59.711211Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Course is super easy, as expected. The course is taught on an online textbook that costs $35, with some self-evaluations (no studying needed, likert scale questions). The quizzes posted on canvas sometimes have things that aren't covered in the book, as far as I could tell, but are overall pretty easy. You don't have to actually show up to class for a while, until you need groups for the group project.\r\n\r\nPratt just isn't a good lecturer though. He often prods for definitions of specific terms until he gets the one he's expecting, which can get tiring. He also can get pretty \"rambly/make it up as you go\" sometimes, since there isn't a ton of content to cover, but about half way through he usually lets out.\r\n\r\nThere's also times where he comes off pretty self-righteous. As an example, when someone was calmly walking out during class, Pratt repeatedly asked him \"am I boring you?\" multiple times, to which the student replied that he had a meeting. Pratt then said \"that's how you make a bad impression on your professor.\"", "rating": 3, "expected_grade": "A", "created": "2022-12-02T07:37:00.226514Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Course is easy. I was like .7 away from an A at the end of the semester and he said no to giving me extra credit or anything to help. That's the only bad thing I have to say- other than that he's a great person and his class is worth taking", "rating": 4, "expected_grade": "A-", "created": "2022-12-08T21:21:29.701821Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Course was easy other than the final project which is a solid amount of work but you have plenty of time to do it.  After talking to friends in the asynch version I think this is definitely a better option.  Professor Pratt keeps things interesting with personal stories and although he sometimes rambles he definitely knows what he is talking about.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T04:56:16.786433Z"}, {"professor": "Michael Pratt", "course": "ENES210", "review": "I know absolutely nothing about business or engineering and this course was SO easy. His lectures are ok but lectures are mainly time for you and your team to submit a weekly assignment and you can leave after that. BE CAREFUL tho and do not leave class before you’ve been there for like 25-30ish minutes because he will give you a zero or knock some points off. The final project was pretty easy as you work on bits of it all semester. It’s a 4k word paper but it’s split between 6 people and it’s so easy so don’t let that scare you away from this course. If you need it for your gen eds I literally could not recommend this course more as it’s a GPA booster!", "rating": 5, "expected_grade": "A+", "created": "2022-12-14T00:11:14.399758Z"}, {"professor": "Michael Pratt", "course": "ENES210", "review": "Pay for the book and get a free A, don't learn anything, class is an easy GPA boost. The class is a 5, pratt is a 1. He doesn't know anything(granted it's ENES210 you don't learn anything), but he strives to be unhelpful and eogs off kids who don't care.  Take your free A+ and interact with him as little as possible", "rating": 3, "expected_grade": "A+", "created": "2023-05-11T00:16:40.367303Z"}, {"professor": "Michael Pratt", "course": "ENES210", "review": "He's an old guy who goes up and talks for about 20 minutes. Free A", "rating": 5, "expected_grade": "A", "created": "2023-12-11T19:25:29.471287Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Take this class. If you're reading this review, consider yourself lucky. Take. this. class.", "rating": 5, "expected_grade": "A+", "created": "2024-01-07T20:46:59.683266Z"}, {"professor": "Michael Pratt", "course": "ENES210", "review": "Mr. Pratt is constantly grumpy and condescending to his students. Sure, free A and and free gen-eds, but these reviews are supposed to be about the person and only secondarily about the class, and in my experience, Mr. Pratt is not a great person.", "rating": 2, "expected_grade": "", "created": "2024-02-29T02:11:25.201194Z"}], "name": "Michael Pratt", "slug": "pratt"}