{"courses": ["ENGL398B", "BMGT468U", "ENGL393", "ENGL398B", "ENGL398B", "ENGL398B", "ENGL398B", "ENGL398B"], "average_rating": 4.4286, "type": "professor", "reviews": [{"professor": "Mrim Boutla", "course": "ENGL393", "review": "Don't take Boutla for ENGL393. She thinks the class is an Entrepreneurship course. In the past, she has taught ENGL398B (Writing for Social Entrepreneurship) and she is too lazy to adapt the course or materials, so she teaches ENGL393 as if it were that class. I'm not learning the topic I signed up for and it's very frustrating. She is not a very strict grader, but there are definitely easier options out there for this class.", "rating": 1, "expected_grade": "A", "created": "2019-03-26T00:46:36Z"}, {"professor": "Mrim Boutla", "course": "ENGL393", "review": "Great Professor. Expect to put in moderate work, but the skills you will learn in this class are immense.", "rating": 5, "expected_grade": "A", "created": "2020-01-06T17:39:21Z"}, {"professor": "Mrim Boutla", "course": "ENGL393", "review": "Great teacher, super knowledgeable, and the class helped immensely", "rating": 5, "expected_grade": "", "created": "2020-05-23T15:11:29Z"}, {"professor": "Mrim Boutla", "course": "ENGL393", "review": "A STEM perspective on Boutla's 393 class:\r\n\r\nDr Boutla does not teach this class like other professors. The review on this page from 2019 is pretty on-the-mark by claiming that her class is basically just an entrepreneurship writing course. That's not a bad thing. Allow me to elucidate.\r\n\r\nI took tech writing with Dr Boutla in Fall 2019. My peers in aerospace engineering are taking 393 now (Spring 2020) with other professors, so I have a decent data set to compare with.\r\n\r\nWith most instructors, English 393 is a horrible class. The papers are long, tedious, pointless, joyless trash that will leave you more confused and agitated than anything, and the biggest assignments always seem to line up with the parts of the semester when you should be studying for exams for your major courses. I've had multiple peers miss several days of exam study to write pointless dreck like \"annotated bibliographies\" and impossibly detailed peer reviews. All to have the teacher give them a middling grade with copy-pasted feedback.\r\n\r\nDr Boutla does none of that. She approaches the class from a goal-oriented perspective, challenging students to consider the professional path they most wish to pursue and tailoring their assignments to that end. She gives a handful of reasonable assignments throughout the semester and grades fairly. It is easy to get full credit on every assignment as long as you meet the posted requirements. My class had to do the following:\r\n\r\n- Resume and cover letter (write, and rewrite based on instructor feedback)\r\n- Industry paper (Write about the field and companies you intend to work for, focusing on a key industry issue)\r\n- Slide deck/Presentation (Prepare a powerpoint based on your industry paper, present it, and answer questions from your peers)\r\n- Some in-class participation exercises\r\n\r\nThese are all reasonable assignments that mostly teach useful skills. Dr Boutla's lectures are laced with premium professional advice whether you're interested in grad school or employment post-grad. She's a neuroscientist and professional career coach which makes her highly qualified to discuss the course content, and I believe she's genuinely invested in her students' success. Also, she's just a very nice person.\r\n\r\nI strongly recommend Dr Boutla's section. I would even go as far as recommending shuffling your schedule around to get into it if necessary/possible. The horror stories from your peers in traditional 393 sections should be enough to prove you made the right choice.", "rating": 5, "expected_grade": "A+", "created": "2021-03-28T23:04:17Z"}, {"professor": "Mrim Boutla", "course": "ENGL393", "review": "Dr. Boutla is the only professor i've felt the need to write a review for in my three years i've been at the University of Maryland. Being Mech E, i really didn't care about taking ENGL393 at all but Dr. Boutla made me enjoy going to class. She realized that most of my class were stem majors and tailored a lot of the lectures to have stem-based writing samples, making the assignments much easier to understand. Dr. Boutla cares for her students and genuinely cares about teaching you. She doesn't grade hard and as long as you put in noticeable effort you'll get an A. She gives in-depth feedback on every assignment you do, and allows you to resubmit them for re-grading. Overall, phenomenal professor.", "rating": 5, "expected_grade": "A+", "created": "2021-06-17T13:56:44Z"}, {"professor": "Mrim Boutla", "course": "ENGL398B", "review": "Wonderful Professor. While the class itself may not be the most interesting. She is clear about assignments and how to do them. She is clear about the grading criteria. Additionally she will actually let you improve your grade if you improve your work by taking her comments and recommendations and resubmitting your assignments to be regraded. Just do what you’re supposed to for each assignment and the final paper will be super easy to write. All of the smaller assignments throughout the semester are a piece of the final paper. She is helpful in answering questions. Do show up though and don’t leave early. While she is understanding that things can come up, it became a trend in my class and it was clear she was frustrated once it was happening regularly with multiple students.", "rating": 5, "expected_grade": "A+", "created": "2022-12-17T19:07:06.440210Z"}, {"professor": "Mrim Boutla", "course": "ENGL398B", "review": "Mrim Boutla is one of the most understanding and nice professors I have had in college yet. She treats all her students with respect, while still teaching a very interesting class. If you are going to take this class, HAVE HER AS YOUR PROFESSOR!", "rating": 5, "expected_grade": "", "created": "2023-04-19T22:40:10.438853Z"}], "name": "Mrim Boutla", "slug": "boutla"}