{"courses": ["ENGL101", "CMLT270", "WMST275", "PERS371", "CMLT275", "WGSS275", "CMLT275", "WGSS275", "CMLT277", "CMLT277"], "average_rating": 2.1429, "type": "professor", "reviews": [{"professor": "Nahid Ahmadian", "course": "ENGL101", "review": "Really sweet professor, but the class itself has many issues. Assigns readings that we then read again in class and discuss (redundant), class is boring. Asks unnecessary questions about the readings, that have nothing to do at all. She also has many grammatical errors and spellings in her own work when this is an English class (you would not expect a math professor to mess up 2+2), and class is somewhat unstructured. She grades pretty well and is a very sweet person to talk to but not as a professor. ", "rating": 2, "expected_grade": "B+", "created": "2019-10-23T19:35:59Z"}, {"professor": "Nahid Ahmadian", "course": "CMLT275", "review": "Least favorite professor I have ever had. She didn't just play favorites, she treated students who she felt didn't work hard enough disrespectfully. I have never been so frustrated by an individual in my life. She grades purely off of emotions. As someone who got an A- in English 101, I know that I am not a terrible writer. Was I the best writer in the class no, but my writing was better than some of the grades I received. This class made me feel like less of a feminist. Some of the stories and novels she forced us to read were absurd. I hope to never have a class with her again and if I do I will be switching out. ", "rating": 1, "expected_grade": "B", "created": "2019-12-19T21:33:25Z"}, {"professor": "Nahid Ahmadian", "course": "CMLT275", "review": "She is the worst professor I have ever had. She plays favorites and gets mad that her class is not #1 priority. Recommend to never take her. Very biased on her thoughts and didn't even let her students meet with her for the final presentation and paper outside of class. She was often unprepared and made us read erotic poetry, short stories and novels. I showed my mom the book we had to read and she was applaud that a professor would assign such a reading to her students. 0/10 would take the class again. ", "rating": 1, "expected_grade": "B-", "created": "2020-01-13T02:33:55Z"}, {"professor": "Nahid Ahmadian", "course": "ENGL101", "review": "I loved her. She's super sweet and a pretty generous grader. We had 2 or 3 in class activities daily that would she would always grade for completion. She was very accommodating when people had to miss class. She wasn't the best at communicating due dates far enough in advance like I was used to from high school, but overall she's a really good person and I enjoyed her class.", "rating": 4, "expected_grade": "A", "created": "2022-12-08T19:37:00.978120Z"}, {"professor": "Nahid Ahmadian", "course": "ENGL101", "review": "i dont understand the bad reviews for this prof. her assignments are rly easy, in class activities are graded for completion. reasonable grading. accommodating to peoples needs. doesnt rly announce due dates in advance tho which is annoying but whatever. 6 mini projects that are about a topic you get to pick. no exams. do the work and get an A+", "rating": 4, "expected_grade": "A+", "created": "2022-12-13T01:07:06.736702Z"}, {"professor": "Nahid Ahmadian", "course": "ENGL101", "review": "This teacher ruined my life. Grades way harder than any other english101 teacher and assignment word counts are way longer. Any other English's teacher is better. You would learn more about english if you read green eggs and ham.", "rating": 1, "expected_grade": "B+", "created": "2023-12-18T03:20:32.046333Z"}, {"professor": "Nahid Ahmadian", "course": "ENGL101", "review": "Professor Ahmadian is a kind, gentle, and thoughtful woman. However, not a great professor. For one, she wasn't great at explaining assignments leaving us to have to figure it out among ourselves, using the syllabus, and often just guessing on what we're supposed to write (she's not a super tough grader so this turned out okay for most). Furthermore, she never left actual feedback on any of the assignments I turned in, making it really difficult for me to know what to improve. As for her lectures, her style of lecturing is really un-engaging, often reading straight from the slides. When she asks the class questions, they're often really confusion questions searching for a specific response and any response that differs from that is just wrong. Lastly, she definitely picks favorites. All in all, ENGL101 is just a class you have to get through so she didn't really impact my experience too much but I would go with a different professor if I could choose again.", "rating": 2, "expected_grade": "A", "created": "2024-01-25T19:28:13.528685Z"}], "name": "Nahid Ahmadian", "slug": "ahmadian"}