{"courses": ["PLCY201", "PLCY201", "PLCY201", "PLCY201", "PLCY201", "PLCY201", "PLCY201", "PLCY201"], "average_rating": 3.5, "type": "professor", "reviews": [{"professor": "Nancy Lineman", "course": "PLCY201", "review": "Kind and Knowledgable professor but grades very harshly on minor things like typos and formatting errors. Class is only out of 100, Expect a discussion post every week that is worth 5 points, and a few papers that are worth 20-30 points each, and one final project where you have to get in contact with a government official.", "rating": 4, "expected_grade": "B-", "created": "2023-01-11T19:27:20.218706Z"}, {"professor": "Nancy Lineman", "course": "PLCY201", "review": "rather intimidating but gets nicer as the semester goes on. final project is a little heavy in terms of workload but still doable.", "rating": 3, "expected_grade": "", "created": "2023-11-08T21:07:05.053065Z"}, {"professor": "Nancy Lineman", "course": "PLCY201", "review": "Pros:\r\nResponds to emails, especially if they're about clarification an assignment, very quickly. Ask questions about assignment formats even if you think they're stupid, formatting is a lot of the grade!\r\nAdds sample formats for basically every assignment which makes figuring out what to write fairly easy\r\nReally interesting guest speakers! They're most of the class, honestly, which is good since it was one of the highlights of the class\r\nGood at leading discussions and leading people through thinking things through\r\nNo exams!\r\n\r\nCons:\r\nKind of intense about her class. Expects you to put a lot of effort in and isn't always fair about it. She gave us a lot of \"shame lectures\" where she would spend class time lecturing us about how we needed to do better and work harder, which got irritating fast since she was spending time doing that instead of teaching\r\nBad grammar is penalized very heavily. Get someone to read through your essays and throw them through grammarly, you lose a lot of points for grammar\r\nThe course is only out of 100 points (we had a leadership essay, 6 discussion questions worth 5 pts each, and the final is an essay worth 30 points and a presentation worth 20), and the smallest assignment is worth 5 percent of your grade, so stuff goes bad fast\r\nLots of writing, pretty much every assignment is a good chunk of writing, don't take the class if you aren't good with that\r\nKind of mean sometimes? Nothing too intense but sometimes I got a little freaked out\r\n\r\ntl;dr: interesting guest speakers and she knows a lot about public policy, but she's also really intense about certain things relating to her class (especially grammar and formatting) Expect a lot of writing", "rating": 3, "expected_grade": "A", "created": "2023-11-24T18:43:25.778292Z"}, {"professor": "Nancy Lineman", "course": "PLCY201", "review": "Interesting class with a lot of very cool guest speakers, but a very heavy workload. Expect to be doing a lot of writing, as well as listening to podcasts and audiobooks (it's possible to find transcripts/texts, but definitely not a great class if you're hard of hearing and/or don't have 30+ hours to dedicate to listening to audiobooks). \r\nThe guest speakers were definitely the highlights of the class. Expect there to be more of a focus on people's independent experiences solving policy issues in the real world rather than any sort of \"textbook\" learning about the legal aspects of policy/its history/etc.\r\nShe's a little bit intense, but incredibly well-connected. Also very good at chasing down people if they don't answer your emails for the final project. She's also very willing to write letters of recommendation if you ask her, which is great if you're looking for internships.\r\n\r\nCons:\r\nSpelling/grammar. Oh boy it is Rough. She penalizes incredibly heavily (0.5-1% per issue, depending on the project), and on the discussion posts, you'll get a 0/5 if you have any errors at all. Getting people to proofread your work is an absolute must for this class (and absolutely don't rely on grammarly/other AI, it'll let you down). \r\nThe class is only 100 points, so mistakes add up real quick. If writing isn't your strong suit or you don't want to dedicate a significant amount of time to checking your work, I wouldn't recommend this class. \r\nLots of \"shame\" lectures about grades or people messing up assignments, I wasn't a fan.\r\n\r\nBasically, if you're prepared to put in the work, it's a great class. If you want something with an easy A, this is not the class for you.", "rating": 4, "expected_grade": "A+", "created": "2024-01-01T14:32:40.749681Z"}], "name": "Nancy Lineman", "slug": "lineman"}