{"courses": ["CMLT275", "WGSS275", "ENGL395", "ENGL101X", "ENGL293", "ENGL392", "ENGL101A", "ENGL395"], "average_rating": 1.6667, "type": "professor", "reviews": [{"professor": "Nasim DarouieHaghighi", "course": "ENGL101X", "review": "Does not know how to teach. One of the least intelligent and least confident professors I have ever met. Often makes ridiculous comments in the class and does not explain her intention behind them. Honestly, should just drop teaching English.", "rating": 1, "expected_grade": "A-", "created": "2022-09-29T22:01:51.246735Z"}, {"professor": "Nasim DarouieHaghighi", "course": "ENGL101", "review": "Does not know how to use Canvas. Files required to complete assignments are locked and assignments are not dated. Harsher grader than the other ENGL101 professors. Takes attendance on a google doc (only posted once in announcements). She is nice but not a very good professor.", "rating": 1, "expected_grade": "B+", "created": "2022-10-20T15:10:47.672096Z"}, {"professor": "Nasim DarouieHaghighi", "course": "ENGL101X", "review": "She seems fine but i don't know why grades so harshly sometimes.", "rating": 1, "expected_grade": "A", "created": "2022-12-05T16:35:12.155798Z"}, {"professor": "Nasim DarouieHaghighi", "course": "ENGL101A", "review": "easy grader, but strange teaching approach and often makes the class feel awkward by her lack of confidence and strange comments. i hope i never have to take a class taught by her again, and strongly advise against signing up for any class she teaches.", "rating": 1, "expected_grade": "B+", "created": "2023-12-01T18:39:34.626551Z"}, {"professor": "Nasim DarouieHaghighi", "course": "ENGL101A", "review": "She was a super easy grader and always gave A's for my assignments and papers. She only posted major assignment due dates on Canvas so you would have to look on the syllabus for when discussion boards were due which was annoying. Her classes were so boring and attendance wasn't taken so it wasn't necessary to go at all. She seemed like she never knew what she was doing and never really explained assignments. If you get her it wont be awful, but definitely don't choose to take her.", "rating": 3, "expected_grade": "A", "created": "2023-12-15T21:31:25.314664Z"}, {"professor": "Nasim DarouieHaghighi", "course": "ENGL101", "review": "These other comments made me laugh lol. The issue with this class was it was useless to even go, class was just a bunch of odd and unnecessary assignments and she was pretty awkward. I stopped going after September but I would send her my drafts for feedback, which was all I really needed. Either she's a super chill grader or maybe I am ok at english, but I got 100s on every single midterm paper. She responds quick over email too and would always answer my questions. My class personally had no participation assignments or attendance so it didn't matter if you went, she doesn't post lectures but I never needed it anyways. Ended the class with a 99%", "rating": 3, "expected_grade": "A+", "created": "2023-12-17T01:36:50.603826Z"}], "name": "Nasim DarouieHaghighi", "slug": "darouiehaghighi"}