{"courses": ["CPSP227", "ENEE200", "CPSS225", "CPSP249E", "CPET240", "CPSP369E", "CPSS220", "IDEA258A", "CPSS100", "CPSS101", "EDSP652", "CPSP349T", "ENEE200", "ENES214", "ENES216", "CPSS100", "CPSS220", "ENEE200", "CPSS101", "CPSS340", "ENEE200", "ENEE200", "CPSS100", "ENEE200", "ENES440", "CPSS101", "CPSS220", "ENEE200", "CPSS100", "ENEE200"], "average_rating": 2.6842, "type": "professor", "reviews": [{"professor": "Nicole Mogul", "course": "ENEE200", "review": "ENEE200 isn't really a class to worry that much about in general, but it was very enjoyable wunder Nicole's instruction. She creates a great atmosphere every lecture, and it's a nice change of pace from all of the equations and circuits that we have to deal with in every other major requirement course. Interesting lectures, including a lot of video content, and a lot of thought-provoking conversatio about Ethics in Engineering. Great class!\n\nShort essay due every week (Friday night for my class), but they're pretty simple to do. There is a bit of reading to do for the class, but that's just characteristic of ENEE200. Nicole pushed her final to the last day of class so that there wasn't a final during finals week, so that was nice. She also handed out candy the class before halloween, which was also nice.", "rating": 5, "expected_grade": "A", "created": "2015-11-13T08:06:00Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Nicole is great. Initially I thought having engineers taking an ethics class was kind of ridiculous, but after taking her class I have to say that if anyone was going to make the class worthwhile it's her. She creates an excellent atmosphere in the classroom that encourages people to participate and think in a new way. She is passionate about the material, and that passion translates to everyone else in the class. The class is not very much work and her expectations are totally reasonable. I'm really glad that I took this class with Dr. Mogul and I hope that more people get the opportunity to take this class with her.", "rating": 5, "expected_grade": "A", "created": "2014-12-03T21:09:00Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Fine lady honestly. Funny at times. Long and boring lectures. Lots of assignments although no final exam but a long paper. Tries to do fun things but don't turn out to be so. Reading each week and assignment each Friday (hated this assignment). Stupid skit at the end of the semester which is pointless and stupid for an ethics class imo. ", "rating": 4, "expected_grade": "A-", "created": "2018-12-13T18:55:03Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Dr. Mogul is an extremely unintelligent woman, who tries to be relatable but comes off as ingenuine. While it may seem that she has the best intentions, it is clear that the entire coursework is BS. I would take the course if you want an easy Gen Ed and are an engineering major, but there are plenty of better and easier Gen Ed classes to take. Honestly, this class is a lot of writing and extremely easy, but it was a struggle to take her seriously during lectures, especially when she cuts of students answers mid-sentence, embarrassingly directs her anger at the Assistant Dean of the Engineering IT Staff for her technology not working, and for her ridiculously useless assignments. All this class has taught me about ethics is stuff I already know. ", "rating": 2, "expected_grade": "A+", "created": "2019-05-10T21:30:26Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Definitely one of the more interesting classes that the ENEE department offers. The UTFs are all pretty good and getting a good grade isn't hard if you put effort into your writing. Dr. Mogul was flexible when we moved online and was receptive to students if they needed extra time on an assignment. Her instructions for assignments can be confusing at times, so small warning.", "rating": 5, "expected_grade": "A+", "created": "2020-05-19T17:46:10Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Dr. Mogul made us do several somewhat irritating activities, in which we had to walk around our house or go outside (in the\r\nmiddle of winter) to listen to sounds, smell random items, and draw random objects. The last time I did this much smelling and drawing, I was in Elementary School. Professor Mogul definitely had good intentions with these activities, but most of the time came across as childish and inconvenient.  I also did not like that the details of the CEC paper were not revealed until a few days before the first draft had to be complete. ", "rating": 1, "expected_grade": "", "created": "2021-02-09T05:30:11Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": " I did not appreciate being required to pay over $30 for the digital coursepack, which contained only two articles that easily could have been uploaded to Elms. This felt like a complete waste of money. I also just believe that there was a lot of unnecessary material in this course. A lot of activities we did felt more like ice breakers that didn't have a clear connection to ethics.", "rating": 2, "expected_grade": "", "created": "2021-02-09T05:34:37Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "DO NOT TAKE HER CLASS especially do not take the winter or summer session. Stupid activities in class and read a lot, Almost tons of boring reading materials and also the reports that 1-1.5 single spaced long(everyday). If u r not engineering students, don't take her class; if yes, take the regular sessions or another prof. GRADES are fine tho.", "rating": 1, "expected_grade": "A+", "created": "2021-02-09T05:36:51Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "She's super nice and I found the class pretty interesting. There's a lot of writing for an engineering class. She made us do all sorts of activities moving around and doing stuff, some were fun and some were random.", "rating": 5, "expected_grade": "", "created": "2021-05-21T17:47:52Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "tldr, WORST PROFESSOR AND WORST CLASS I’VE EVER HAD.\r\n\r\nI’m my three years of taking classes at UMD, this class and this professor are by far the most unenjoyable, unproductive, and irritating course I’ve had the displeasure of taking. ENEE200 is a waste of time and a big one at that. You are assigned 2+ readings/videos a week that simultaneously say nothing interesting and talk down to you. The authors are either nobodies, overrated academia stars, or both. You are also assigned 2 to 3 writing assignments a week, sometimes due the same day that they are assigned (so good luck if you had any other plans Thursday night cause that assignment needs to get done). Expect to put in 2-3 hours+ a week of your own time into this time waster that just leaves you irritated after completing the assignments filled with condescending questions that you have to answer. If being “woke” was a major, this would be a core requirement.\r\n\r\nClass time itself is a mess. Lectures and discussions are mandatory (of course). You learn nothing and are instead divided into groups to discuss whatever ridiculous question is posted on the board, while the professor walks around and somehow contributes a negative amount to your group when she comes to speak with you. Discussions are somehow even more pointless, we’re asked to do these ridiculous activities like copying the actions your partner does, or writing down what your anthropomorphized phone you’ll say to you. Discussion activities are humiliating and degrading. We’re in college not kindergarten for God’s sake!\r\n\r\nOnly plus side is that as long as you turn in assignments and attend lecture and discussion, you will get an A. But I urge you to take a class that’s actually interesting, or at least any professor that isn’t Mogul, who is the least interesting, most shallow, and most unintelligent person I’ve run into during my time at UMD. Is it really an easy A if you need to put in 6+ hours a week into it, if you count lecture, discussion, and impromptu assignments? I think that the only reason Mogul is still around is that the material she’s pushing the -20 IQ slogans that academia has come to love in recent years. Avoid her and this class at all costs.", "rating": 1, "expected_grade": "A", "created": "2021-10-14T19:14:35Z"}, {"professor": "Nicole Mogul", "course": "CPSS100", "review": "Dr. Mogul is probably the worst professor I have yet to encounter at this university. The only thing you will gain out of her teaching is a despise for her character and mannerisms. I would elaborate on why her method of teaching is so poor but it is already perfectly described by some of the other 1-2 star reviews in this list.\r\n\r\nIt is clear that the university only hired her as a means to fulfill some quota.", "rating": 1, "expected_grade": "A+", "created": "2021-12-07T18:19:36Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Honestly these reviews are a bit much, and I would disregard them. I had Mogul for Fall 2021 semester. Anyone who couldn't digest the material or her method of teaching really needs to look inwards at themselves instead of pointing fingers at the professor. Mogul spends so much time preparing for lectures and really cares about her students. You can tell this class is her passion and and the effort she puts into this is also admirable. You have to take this class anyways probably so go with her, she's really nice. Easy A, too.", "rating": 5, "expected_grade": "A", "created": "2021-12-17T03:07:14Z"}, {"professor": "Nicole Mogul", "course": "CPSS220", "review": "These reviews make her seem like a terrible person but that is simply not the case. She genuinely cares about her students and is very nice/funny. She likes to bring people out of their comfort zone and super into mindfulness. She ran this class with a thing called the Grading Contract. Which essentially says, you will get an A if you make an attempt at every assignment. Very easy A class, in class she always does some fun or quirky activities, which is nice cause i feel like those tend to be very rare in college classes. Sometimes the assignments felt really dumb or like busy work but I honestly didn't need to spend too much time in the class cause i knew i was gonna get an A with the contract. She also does care about the content of the course. Overall not a bad course to fulfill the Practicum with.", "rating": 4, "expected_grade": "A", "created": "2021-12-24T21:27:52Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "This professor assigns an absolutely absurd amount of work. As an Electrical/Computer engineer, I already have other difficult classes conceptually, this class is immensely time-consuming and the professor does not seem to understand that it is a 3 credit course. Out of all my classes right now, on ELMS I have 6 assignments due in the next week and 5 of them are for this class.", "rating": 1, "expected_grade": "A", "created": "2022-04-12T18:12:26Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Trash professor. Makes us do stupid abstract unrelated skits in discussion sections that have little to no relations to the course topics. Forces us to do a land declaration in the first class and say how we stole the land we live in from Native Americans. Made a very poorly supported and unprofessional brochoure that serves as a basis for discussion topics. My TA gave her some feedbacks from my section containing some concerns regarding the workload, she dismissed it instantly.", "rating": 1, "expected_grade": "A-", "created": "2022-11-21T02:43:31.101685Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "I agree with other users that the work load is a little bit too much and lectures/assignments can be little boring. But she's a great professor and a great human being. She genuinely puts in a lot of effort into the class. My TA was super chill and gave us extensions when we needed it. You will unfortunately meet people in the class who lack the emotional maturity to fully appreciate what is being taught and the importance of it. Their fragile egos cause them to point fingers at the teacher instead of taking a step back and let some of the ideas sink in. All in all it should be an easy A as long as you put in the time to do the work and participate.", "rating": 4, "expected_grade": "", "created": "2023-01-30T01:13:23.679305Z"}, {"professor": "Nicole Mogul", "course": "CPSS340", "review": "If you are choosing a scholars program, do not choose STS. Nicole is a very ~annoying~ professor. Most of the assignments and activities you do are not at all related to the course, and feel like things you would do in elementary school. With that being said though, the work is very easy, and for 340 she uses contract grading, so basically as long as you turn in the work and go to class you will get an A. BUT, you will have to do her pointless improv and skit activities so do with that what you will.", "rating": 2, "expected_grade": "A", "created": "2023-04-17T20:43:42.437563Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "this professor gives an absolutely ridiculous amount of work. this class is not supposed to consume 5 hours a week and i shouldnt have to sit at my desk for an hour to try and figure out what the actual assignment is. i dont care if she spends time preparing her lectures she should realize that this is a technical elective and 100% of her students have actual meaningful work they need to get done and this just gets in the way.", "rating": 1, "expected_grade": "A", "created": "2023-11-30T04:50:01.622109Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "She’s a miserable person and it genuinely feels like she came from teaching elementary school as she doesn’t know how to talk to college students. She’ll condescend you for nothing and make you feel inferior for disagreeing with her. Avoid at all costs.", "rating": 1, "expected_grade": "", "created": "2023-12-21T18:31:45.111286Z"}], "name": "Nicole Mogul", "slug": "mogul"}