{"courses": ["ENGL329F", "ENGL468C", "ENGL245", "ENGL329G", "ENGL468E", "HHUM106", "FILM301", "SLLC698F", "ENGL329Q", "ENGL759A", "ENGL329K", "ENGL428X", "ENGL702", "FILM412", "FILM245", "FILM459E", "CMLT788F", "FILM369Q", "FILM346", "CMLT702", "ENGL143", "ENGL329M", "ENGL329W", "FILM311", "FILM359W", "ENGL602", "SLLC468F", "ENGL143C", "CINE319G", "CINE301", "ENGL143C", "ENGL143", "CINE245", "ENGL143C", "ENGL245", "ENGL143", "CINE319G", "ENGL143", "ENGL329M", "CINE245", "CINE469M", "CMLT679B", "ENGL245", "ENGL759E"], "average_rating": 4.8333, "type": "professor", "reviews": [{"professor": "Oliver Gaycken", "course": "ENGL143", "review": "Great professor! Professor Gaycken always asks us how we are doing especially because he understands that online learning is tough. He does assign readings and videos to watch but it is nothing you cannot handle. Almost every single class was a discussion. He is also very understanding that students have other classes to worry about as well. ", "rating": 5, "expected_grade": "A+", "created": "2020-12-07T17:05:42Z"}, {"professor": "Oliver Gaycken", "course": "FILM412", "review": "Took during Summer 2021. Learned a lot from his class and the work was very very manageable for summer schedules. ", "rating": 5, "expected_grade": "A", "created": "2021-11-02T02:09:47Z"}, {"professor": "Oliver Gaycken", "course": "ENGL143C", "review": "I would highly recommend this course and specifically professor. He is very chill and cares about the students. Half of the time he would show up late and end the class early because he knows we have other classes which are more important. No exams the whole class is discussions and a semester long project which isn't hard at all. Overall I would recommend if looking for easy course.", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T19:52:58.044241Z"}, {"professor": "Oliver Gaycken", "course": "ENGL143C", "review": "Best carillon class to take super laid-back professor who is super nice and is understanding. Class is always cut short and the grades come from once a week discussions which are easy and the other half from a project. Easy class.", "rating": 5, "expected_grade": "A", "created": "2023-12-06T19:55:05.329931Z"}, {"professor": "Oliver Gaycken", "course": "CINE245", "review": "Really knows his stuff, a lot of textbook reading assigned but you usually can just skim or get information from lecture, all you really have to do is at least watch the assigned movie every week, take some notes at lecture, and most definitely come to discussion (attendance/participation is graded but honestly I barely participated and got an A for it--this probably depends on your TA though). Also he often started class a few minutes late while people trailed in, and a major plus: the exams are open note. The essays were okay (one was 1-2 pages, the other was 3)--short but analytical. There's a fun group assignment where you make a short story using different kinds of camera shots, basically a short film in a series of photos.\r\n\r\nOverall: Not too much graded homework and open note exams (1 on paper, 1 online midterm, 1 online final)", "rating": 4, "expected_grade": "A", "created": "2023-12-19T23:53:50.884262Z"}, {"professor": "Oliver Gaycken", "course": "CINE245", "review": "This professor is awesome! He has so much insight and so much to share about cinematography. I can feel his passion through his teaching. I really enjoyed this intro class and am now thinking about minoring in film. Very understanding and pushed back a few due dates/dropped the final essay for us. Grades consist of discussion participation, a midterm, an essay, the final exam, and like one or two minor projects.", "rating": 5, "expected_grade": "A", "created": "2024-01-12T15:51:23.315802Z"}], "name": "Oliver Gaycken", "slug": "gaycken"}