{"courses": ["ENGL398R", "ENGL391", "ENGL393", "ENGL398R", "ENGL398R", "ENGL398R", "ENGL398R", "ENGL398R", "ENGL398R"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Pamela Gerhardt", "course": "ENGL391", "review": "Great teacher. Fun, interesting, and very well taught class. Would highly recommend her for professional writing", "rating": 5, "expected_grade": "A-", "created": "2015-08-21T19:34:00Z"}, {"professor": "Pamela Gerhardt", "course": "ENGL391", "review": "I took it over the summer, and my writing has never improved so much in so little time. she is kind and smart, so take it with her!", "rating": 5, "expected_grade": "A", "created": "2013-04-22T17:30:00Z"}, {"professor": "Pamela Gerhardt", "course": "ENGL398R", "review": "This is the best professional writing class you can take! Everyone writes a 5 page nonfiction narrative - meaning a story about something that happened to you - and then we workshop them in class. You get to read people's crazy stories, like one guy who proposed after 5 months. It's fun and you learn stuff you will need to know in any business - like how to write about yourself, give a presentation, a memo, a resume, etc. If you have to take Junior English, take it with Gerhardt!", "rating": 5, "expected_grade": "A", "created": "2010-05-13T10:52:00Z"}, {"professor": "Pamela Gerhardt", "course": "ENGL398R", "review": "Really fun class, for sure the best of all the professional writing options. The entire class was just mini completion assignments, a 500-word essay, a five-page essay, and this portfolio thing. Spread out so the workload is really manageable, actually interesting and engaging. ", "rating": 5, "expected_grade": "A", "created": "2022-04-27T00:04:39Z"}, {"professor": "Pamela Gerhardt", "course": "ENGL393", "review": "Took her summer course this year, it's really engaging and she's very nice, she gives valuable feedback and she doesn't grade harshly, I would recommend taking this course with her.", "rating": 5, "expected_grade": "A+", "created": "2023-07-03T01:58:36.600337Z"}], "name": "Pamela Gerhardt", "slug": "gerhardt"}