{"courses": ["HESI217", "HESI217", "HESI217", "HESI217", "LEAD217", "HESI217", "LEAD315", "LEAD217", "LEAD217", "LEAD315"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Pamela Scott", "course": "HESI217", "review": "Very nice and easy grader. There are reading reflections every week which are annoying, but they're pretty easy. She's super chill and the slides can be interesting. Class has a lot of discussion and you are graded on participation. There are no quizzes even though the syllabus said so. A few projects and 1 paper but all pretty easy.", "rating": 5, "expected_grade": "A", "created": "2023-04-12T04:11:56.992170Z"}, {"professor": "Pamela Scott", "course": "HESI217", "review": "super chill instructor and class. grades super easy and limited amount of work. she's super understanding and good with extending deadlines.", "rating": 5, "expected_grade": "A+", "created": "2023-04-18T21:55:59.942936Z"}, {"professor": "Pamela Scott", "course": "LEAD315", "review": "The best instructor. She is so understanding and easy to talk to. She doesn't assign to much homework and actually takes feedback into consideration", "rating": 5, "expected_grade": "A", "created": "2023-10-25T19:31:26.314743Z"}, {"professor": "Pamela Scott", "course": "LEAD217", "review": "LOVE PAM!!! Please take this class, she is not only super sweet and understanding about extending deadlines if needed, but she also makes the reading reflections each week easy. No exams which is so nice, and the final project was a breeze as well. Easy grader and you can tell she cares about her students.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T00:42:26.519462Z"}, {"professor": "Pamela Scott", "course": "LEAD315", "review": "Very nice professor. However, attendance is a huge part of grade. Very discussion based, limited outside work", "rating": 5, "expected_grade": "A-", "created": "2023-12-27T21:42:50.816221Z"}, {"professor": "Pamela Scott", "course": "LEAD217", "review": "Pam is the best! Incredibly kind and understanding. Will extend deadlines if necessary. Not too much homework. Class with her is super fun and stress-free (and I still learned a lot from this course). Would recommend.", "rating": 5, "expected_grade": "A", "created": "2024-03-25T20:15:49.419757Z"}], "name": "Pamela Scott", "slug": "scott_pamela"}