{"courses": ["ENST389", "ENST443", "ENST479", "ENST373", "ENST472", "ENST499Q", "ENST643", "MEES698J", "BSCI373", "ENST689B", "ENST689N", "ENST689", "ENST499B", "ENST472", "ENST689", "ENST472", "ENST689", "ENST472", "ENST689", "ENST472", "ENST689", "ENST472", "ENST689", "ENST472", "ENST689"], "average_rating": 4.3333, "type": "professor", "reviews": [{"professor": "Patrick Kangas", "course": "BSCI373", "review": "Favorite professor I've had in College. He really likes what he does. I learned a ton in this class. I only took the final, which did involve a lot of studying but it paid off. However, I would recommend taking the two optional mid-terms. It gives more cushion on your grade. ", "rating": 5, "expected_grade": "A", "created": "2015-01-29T14:47:00Z"}, {"professor": "Patrick Kangas", "course": "BSCI373", "review": "Please do not take this course unless you really have to or you are interested in the material. I am a bio major (not interested in ecology) and this was a tough class for me. What you think this class will be about...is probably not what you think. It is not simply learning about the different species of the chesapeake/evolution/ecology. You should also be interested in environmental engineering and good at math calculations. You must be able to understand and produce what are known as energy circuit diagrams...I had no clue how to do this even after the course and kind of lucked out by memorizing every one he put in lecture...without really understanding how to produce one. It is not easy...but the differential equations that come along with them are not too bad to understand.\n\r\nThere are 3 possible grades in the class. 2 midterms and a final. You don't have to take either midterm...it's a little game he likes to play. The final you must take. If I were you, I'd take one of the midterms, whichever material you feel most comfortable with and the final. \n\r\nTests: MC, T/F, reproducing graphs, calculations, matching. The matching is probably the worst part, because he allows for multiple answers. This is quite difficult when you have a list of 70 species and have to categorize them by various subjects...points are easily taken off if you do not know everything about each species. So basically his tests are not easy...but you can succeed if you study very hard!\n\r\nI got an A in this class...but I'm probably one of not many who did. He doesn't curve this class...it doesn't matter how many As are in the distribution...there is no curve. So do well on all exams.\n\r\nHint: GO TO LECTURE. Record him and write down EVERYTHING he says. Lectures consist of all pictures, not much text...so if you miss lecture, it will be hard for you to understand the lectures. DO the homeworks. I repeat: GO TO LECTURE. He takes in consideration people who put a lot of effort and this may or may not help your grade as far as I know!", "rating": 3, "expected_grade": "A", "created": "2013-01-14T15:21:00Z"}, {"professor": "Patrick Kangas", "course": "ENST373", "review": "Really cool professor, his teaching style: only three grades, 2 optional midterm exams (you can show up take the test and decide if you want to turn it in or not) and one final exam.  The final was based largely on the first two tests.  The hardest part of the class is trying to figure out what he's going to test you on.", "rating": 5, "expected_grade": "", "created": "2009-11-12T14:35:00Z"}], "name": "Patrick Kangas", "slug": "kangas"}