{"courses": ["ISRL448D", "ISRL289I", "ISRL359A", "HONR338A", "HIST428V", "HIST329Z", "ISRL618E", "ISRL618F", "ISRL329D", "HIST329D", "JWST619", "JWST699", "JWST386", "ISRL349D", "HIST328F", "HIST376", "ISRL342", "ISRL349E", "ISRL283", "ISRL289I", "ISRL350", "HIST376", "ISRL342", "ISRL350", "HIST328F", "ISRL283", "ISRL349D", "GVPT368I", "HIST376", "ISRL342", "ISRL350", "GVPT368I", "HIST328F", "ISRL342", "ISRL349D"], "average_rating": 3.1667, "type": "professor", "reviews": [{"professor": "Paul Scham", "course": null, "review": "Professor Scham is very helpful in terms of sending out emails with a lot of detailed information and links on them. The lectures are not very helpful in my view, as he speaks extremely slowly and the powerpoints don't have a lot of good information to copy down, but there was one or two pop quizzes, so you should go anyways. Discussion is very helpful, though. \n\r\nThere was a lot of writing in this class, and it was back loaded towards the end of things, but there were also extra credit opportunities, so it wasn't all bad. ", "rating": 4, "expected_grade": "A", "created": "2016-01-04T15:19:00Z"}, {"professor": "Paul Scham", "course": null, "review": "Professor Scham is a very smart dude, but his lectures were not the strong part of the course. If you were lucky like me, you will get Andrew Chadwick as your TA. Andrew is what made the class worth it in the end. Scham can crack a solid joke here and there, and its important to understand that while you can do much better than this class, you can also do much worse", "rating": 3, "expected_grade": "A-", "created": "2014-12-12T14:57:00Z"}, {"professor": "Paul Scham", "course": null, "review": "Dr. Scham is the head of the Israel Studies department. He in tenured, a very smart man, and comes laden with high awards and credentials. \r\nUnfortunately, Dr. Scham has some sort of medical malady that prevents him from being an affective or dynamic lecturer. He speaks very slowly and with a bit of a stutter. Class time was often painful, and highly soporific.\r\nHe teaches a lot of the Israel Studies courses, and it is easy to do well if you do the readings and prepare for the exams and papers as you would in any other class. However, be warned: there is a lot of academic reading that is often verbose and difficult to understand.\r\nHe offered a lot of extra credit for this class which really brought up a lot of people's grades. He also is more than willing to meet in his office to go over things. \r\nHe is a nice guy, but often gets frustrated if people seem uninterested or don't participate in class. Is you read, understand the material, participate, and ask questions, he will like you and grade you favorably. \n\r\nBottom line, he's not great. So don't rush to take him. But if you need to take an ISRL course and it seems mildly interesting, it wouldn't be the worse thing to take him. ", "rating": 3, "expected_grade": "A", "created": "2010-12-23T21:19:00Z"}, {"professor": "Paul Scham", "course": "ISRL289I", "review": "Not a very effective lecturer, but he is very nice and he wants his students to learn above all. Keep up with the readings, take advantage of the extra credit, and speak up in class. He will like that, and doing the extra credit can really help alleviate some pressure when finals comes around.\r\nThere is a fair amount of writing, but Professor Scham prefers quality over quantity. If you don't fall behind or procrastinate, and you're a semi-decent writer, you should have no problem with it.", "rating": 4, "expected_grade": "A", "created": "2020-12-20T04:18:06Z"}, {"professor": "Paul Scham", "course": "ISRL289I", "review": "He isn't a effective lecturer, which makes the class very boring and uninteresting. Although if you do the readings, participate, and ask questions you'll be fine. \r\nBe aware that his pop quizzes are based off many of the readings of the past two weeks. This class is stressful, and as a freshman myself; I would kindly say not to take this guy if you want a general education that can get out of your way. Although there were like 4 total, I screwed up on one quiz. Which was pretty bad for my reputation. This isn't an easy A class, this is a class that needs effort to be put in.", "rating": 2, "expected_grade": "B-", "created": "2021-11-15T01:34:44Z"}, {"professor": "Paul Scham", "course": "ISRL342", "review": "Hes very knowledgeable, but has some sort of medical condition that makes it difficult for him to be an good lecturer. The class itself is very interesting. It is very reading heavy, so be prepared to read a lot and discuss them in class. ", "rating": 3, "expected_grade": "A", "created": "2021-12-13T22:28:44Z"}], "name": "Paul Scham", "slug": "scham"}