{"courses": ["CMSC250", "CMSC250", "CMSC250", "CMSC250", "CMSC330", "CMSC250"], "average_rating": 3.0132, "type": "professor", "reviews": [{"professor": "Paul Kline", "course": "CMSC250", "review": "It's important to keep in mind that Paul's first semester teaching CMSC250 was for a class shared with Cliff Bakalian, so his class inherited much of the same, notorious issues that Cliff is known for (frequent grading discrepancies, disorganized structure, delayed feedback on submitted work, inconsistent expectations, etc.).\r\n\r\nHowever, Paul lectures are solid and always conveniently recorded online. He will provide generous accommodations to students who need them, and engages with the class on a frequent basis. I can see him becoming a solid lecturer for CMSC250 once he has full charge of his own class.", "rating": 3, "expected_grade": "B", "created": "2022-11-30T18:49:26.982648Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "It's obvious that Paul enjoys the material he teaches in a nerdy way. He made great efforts throughout the semester to engage us with discrete math and generally explained concepts very well. The exams and quizzes in this class were also generally very fair, closely matching the course content and what we had seen before in homework questions. However, mostly due to the fact that this course was co-taught with Cliff Bakalian, there were still some structural issues. My main problem was that the instructors didn't reference any textbook throughout the course - this probably fine for any other 100- or 200-level CMSC class, but in a largely proof-based math course it meant that the sole authorities for clarifying concepts were the slides (often with typos or with information omitted because they were good slides for *presentation* but not for reference) and the provided style guide (updated throughout the semester but not consistently). It would have been nice to have more consistent resources to refer to throughout the course instead of having to reference Stack Exchange or Proof Wiki for some homework questions that were not adequately given context in lecture.", "rating": 4, "expected_grade": "A+", "created": "2022-12-10T16:41:02.235397Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Great professor, not a very good course.\r\nDiscrete Structures is a challenging course. In my honest opinion, Paul does a decent job at teaching the material. He is a nice guy who is interested in the things that he's teaching. He also knew that a part of an exam was hard, so he did a supplement assignment to the exam on the part that was hard.\r\nOne of my concerns is that (like others have said) he co-teaches and is not in full control of his content. He is also a first-time 250 teacher (which is why I'm more lenient on his rating). Also, his slides are not as interesting as what I've seen with Cliff. Sometimes I get lost and I don't know where we left off.\r\nOverall, I hope that this semester will help him see the waters of teaching so that in the future, he will be one of the best lecturers.", "rating": 4, "expected_grade": "", "created": "2022-12-14T03:47:37.096937Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Kind of a nerdy, chill guy. Good lecturer, moves his class at a reasonable pace. Homework is challenging, but they're designed to be that way because they have significantly harder questions than you will ever see on an exam or quiz. There are 4 online quizzes during the semester designed to take 2 hours each, which is a bit excessive but they're typically doable. Exams are very fair, there was one section on exam 1 that most people did horrendously on and he offered a makeup assignment to get points back. Final exam was also very fair. He currently co-teaches with Cliff so the class is definitely a bit disorganized, but show up to lectures and discussions and this is a very doable class.", "rating": 4, "expected_grade": "A-", "created": "2022-12-17T15:26:29.772122Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Paul is a solid lecturer and was very fair throughout the entire course. I'm not going to dock him stars here for the organizational problems that cliff's class has because I mainly attribute those problems to Cliff.", "rating": 5, "expected_grade": "B+", "created": "2022-12-19T22:49:09.879499Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "As a side note, Kline first co-taught this course with Cliff Bakalian, who has his own set of issues, so I'll cut him some slack.\r\n\r\nAs a lecturer, Kline is great. It's clear that he's very enthusiastic about teaching the course material. HIs style is teaching by example, which is really beneficial for a class that is oriented around proofs and intuition.\r\n\r\nIn terms of the structure of the course, there are some issues. The homework was pretty awful and—for students who tend to have a slow start adjusting to course material—overwhelming. It didn't help that the grading of homework was incredibly delayed either. Additionally, out of the three exams that we had (including the final), only ONE practice exam was posted (and based on the grade distributions for each exam, the one with the practice exam is the one people did the best on). Regardless, several of these issues can be attributed to being a new lecturer at UMD and not having complete authority of his course, so I think he'll be a better option for incoming CS students in the future.", "rating": 4, "expected_grade": "A-", "created": "2022-12-21T06:26:19.394071Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "For Professor Kline's first semester here teaching, he did an outstanding job.  He is extremely helpful in office hours and so are his TA's but I was rarely able to attend since my focus was on linear algebra(MATH240) and CMSC132.  On of my biggest issues with the course was that there was a lack of practice material that was available online to prepare for much of the harder concepts in the course like induction or combinatorics.  Start the homework early as you have a week to complete it.  Youtube and Justin's Notes for CMSC 250 are your best friends to do well in the course.  There are only two midterms so not performing well will drop you significantly.  That first exam is not a joke as I did not prepare with enough time in hand and did very poorly.  He is a very nice guy that wants his students to succeed and have no doubt he will be a top professor at UMD.", "rating": 4, "expected_grade": "C-", "created": "2023-01-23T17:30:04.404279Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Great lecturer, teaches well and is enthusiastic about the material. My only complaint with the class is that some of the exams, particularly questions on probability, were worded poorly. Still not going to dock a star because I think Paul is aware of this and working on it.", "rating": 5, "expected_grade": "A", "created": "2023-01-25T14:34:16.729475Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Had him for the first semester he taught. Did a really great job. His lectures were always clear, I would actually be enjoying the content because I was able to understand it instead spending the whole lecture confused and trying to figure things out. He had some really good TAs too that made it even better. I thought I would struggle going into the class based on the reviews for 250 I've seen before but It surprisingly went better than I thought. \r\nHe was really down to earth and understood everything from the perspective of the students. 10/10 would do it again.", "rating": 5, "expected_grade": "A-", "created": "2023-03-29T19:07:52.821945Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Great lecturer and did a good job making the content of 250 seem really simple. There were times where what he was saying contradicted how the TAs were grading, but he was new and it never was that big of a problem. Great professor and cares", "rating": 5, "expected_grade": "B+", "created": "2023-04-18T17:42:40.022265Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "great professor but the TAs gotta chill on the hw", "rating": 4, "expected_grade": "A-", "created": "2023-04-25T16:54:39.023709Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "The class is very frustrating. Paul Kline is a good lecturer and a nice guy, but the TA's are incompetent. They seriously cannot do their job. They don't even know half the course. When we got to the section on Combinatorics, half the TA's said \"go to a different section, because I have no idea how to do this stuff\". It baffles me how they even got to be TA's. One of the TA's slept through his discussion time and sent out an announcement saying \"oops sry guys i forgot to set an alarm\". I get that we're all college students, but that's your job. Worst of it all, is that all the quizzes, and homeworks, and style guide isn't written by Kline himself. It's written by the pompous ***wipe Elias, the head TA who actually runs the whole show. You will lose so many points on homeworks because of \"style issues\". If you follow the style Kline uses in class, the TA's will take off points due to bad style, if the homeworks ever get graded (it took till the end of the semester to get the last half of the homeworks graded). It's honestly not that hard to get an A in the class, the TA's just don't know how to do their job.", "rating": 2, "expected_grade": "A", "created": "2023-05-16T16:14:02.396354Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Kline is a super solid prof for lecturing. He is enthusiastic, his lectures are easy to follow, and he makes the material reasonably easy to grasp; HOWEVER, the TAs are immensely frustrating. The grading on the homeworks is wildly inconsistent. You could follow the style Kline uses in lecture pretty much directly and still manage to get points off for style. There are also hundreds of regrades for each homework because the TAs just grade things incorrectly, and to top it all off it takes forever to get grades back. It is not fun to deal with at all. Also Elias, the head TA, has a stick so far up there it might as well be a second spine. The good news is though the latex extra credit can offset this. Overall it's not hard to get an A but it is tedious to fight for your grade.", "rating": 3, "expected_grade": "A", "created": "2023-05-16T16:14:40.344471Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Note that I took 250 with Kline in Fall 2022 when he co taught with Cliff. Great professor overall, really nice, and good lecturer that tries to engage with students. The weekly hw's were alright (although this seems to be different in the more recent semester), we had extra credit for each hw for doing it in Latex. There were some issues with the TAs teaching a different notation than Kline, but it was not a big issue as both notations are accepted on hw and exams. Exams were also fair and straightforward.", "rating": 4, "expected_grade": "A-", "created": "2023-05-20T21:09:09.142928Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Solid guy I'd say, some of his TAs go a little crazy on the homework but it got better by the end of the year. He teaches concepts really well, posts his slides and records lectures. Has a piazza which is helpful and all homeworks/exams are uploaded to gradescope to you can easily get regrade requests. He has style differences from his TAs which came to bite us on our third exam but its nothing to terrible. His exams are super fair/easy and his TAs often release hella practice material. Teaching is his side gig, he works at a software company but is a really good teacher. Also he is the biggest nerd known to man, 4.0s straight throughout high school and colleges, but in a cool way. I'd", "rating": 5, "expected_grade": "A", "created": "2023-05-21T16:48:41.356622Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "250 is a hard class and it's hard to comprehend the topics and ways of thinking regardless of how good the professor is. However, I have to say that Paul was an excellent instructor. His lectures were very engaging and he explained the difficult concepts in ways where it was really easy to understand, focusing on developing the ways of thinking rather than just memorizing methods and formulas. Although he himself was not very reachable outside of class besides office hours, he had a team of TAs that were very reachable for help. With that being said, the TAs were RUTHLESS sometimes with their homework and quiz assignments, expecting high understandings of number theory, proofs, and combinatorics that I didn't possess nor did the majority of students. We would learn the basics and be slapped with a problem that called for hugely advanced applications of the concepts that we shouldn't have been expected to do. Exams were pretty free, but the final was a little much, and almost everyone took the full 2 hours. But all of the problems associated with this class are at the fault of the TAs, and Paul himself was a fantastic lecturer and clearly knew what he was talking about.", "rating": 4, "expected_grade": "A", "created": "2023-05-22T00:23:04.744859Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Amazing professor. Super helpful and approachable. I wish I could take more courses with him in the future, but I think he only teaches 250 since he teaches part-time. HW is a little tough in the middle of the course but if you go to TA office hours you will be fine. Great guy.", "rating": 5, "expected_grade": "A", "created": "2023-05-24T15:14:52.180275Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "This is going to be a long and complex-ish review so skip to the bottom for a basic tl;dr\r\n\r\nTHE GOOD:\r\nKline himself I think is a good professor. His lectures are very casual and are usually decent, albeit they do have mistakes in them quite often which he does catch in class. Not a huge detriment but it does make it slightly annoying. He records all his lectures as well which is again, very helpful. \r\n\r\nKline also is one of the profs who does not weigh tests heavily as part of your 250 grades. Your quizzes and homework can be a huge grade booster in that regard which can be helpful.\r\nHis exams are also noticeably on the easier side I feel. The grade averages for my semester were around ~90%+ for Exam 1 (INSANE!) ~80% for Exam 2 and 3, and the final (with the final being slightly lower than 80% in the high 70s)\r\n\r\nWhile these are good averages, they aren't crazy, but I'd imagine the majority of the class passes with a higher grade due to the homework and quiz having higher weights. Additionally, all the extra credit in the course probably adds up to 3%+ (There is extra credit on some tests which is hard, and homework extra credit which I will get to later)\r\n\r\nTHE BAD:\r\nOh boy, where to begin? Kline is virtually nonexistent outside of lectures. He outsources everything to the TAs. They make the homework, the quizzes, answer all the Piazza posts, grade everything. This can lead to some issues.\r\n\r\nThe \"Style-Guide\" is a style reference that we are supposed to use when doing all our homework and quizzes. Unfortunately, because this is a TA resource, at times it is disconnected from what Kline teaches. On more than one occasion (INCLUDING AN EXAM!!!) the style that Kline wished us to use did not match the style guide from the TAs. While this usually ends up not harming your grade directly, it can make the questions much more confusing and unnecessarily hard.\r\n\r\nAdditionally, due to this disconnect, there are SO MANY occasions where quiz or homework questions are flat out DROPPED because they either had style mismatches or other issues that made them not be graded and gave everyone a 100% for them. One quiz we took had 3 questions, and 2/3 were dropped. While this is good for the student as they get free points, it is highly annoying and clearly a sign of a disorganized class. It can also feel discouraging to put in effort on homework only for it to not matter once the question is dropped.\r\n\r\nNow onto the major point of contention: THE HOMEWORKS\r\nThe TAs write all the homework and they subscribe to the policy of \"Hard Homework\" preps you for the exam. And by Hard I mean that the homework are a MAGNITUDE harder and can get downright crazy. The infamous HW4 had an average completion time of over 10 hours for the majority of the course. Some homework got to 14 pages long. It's bad. The TAs eventually chilled near the end of the semester after all the complaints, so perhaps my dear future terp you will have it easier. Just be warned though, it can get bad! OH or internet searching on proofwiki and other things is downright required sometimes for some of the more insane proofs.\r\n\r\nTo compensate there is a flat 8% bonus extra credit if you use LaTex for your homework. This adds up to about 2.5% extra credit for your entire course grade which is very nice and the sole saving grace of turning your homework averages high. \r\n\r\n\r\nTl;DR\r\nTHE SUMMARY:\r\nKline is a decent prof who outsources his work to the TAs. It is easy to get a good grade in this class due to easy exams and frequent extra credit, but the workload for this class can be high due to difficult homework. If you are ok with spending a lot of time in this course but an easier course grade-wise, take Kline.", "rating": 4, "expected_grade": "B", "created": "2023-05-26T05:32:45.242011Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Great and down to earth guy. Class had many logistical issues especially surrounding the quizzes/exams and some of the homework, but Paul was quick enough to rectify those issues. Homeworks were absolutely difficult initially (expect to spend over 10 hrs/week). But the TAs (especially Elias, Lily, Nav, Zoya) were the real MVPs of this semester by hosting 3+ hour study sessions before the midterms, creating hella practice material for the final, and more. Class is not easy at all, so expect to put a lot of work into it.", "rating": 5, "expected_grade": "B+", "created": "2023-05-28T21:05:52.203865Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Took in Spring 2023. Kline is a good lecturer that makes concepts easy to understand. I appreciate how he frequently reviews topics from previous lectures before building on top of it in the current lecture. His head TA Elias was a bit crazy this semester and gave extremely difficult homework at first. After many complaints on piazza, the homework became easier towards the end of the semester. Kline is difficult to reach like many others in the CS department so most of your contact will be with TAs through piazza. There are chances for extra credit on homework if you use latex; you get 8 points extra on 100 point homeworks so these can certainly add up considering we had 10 homeworks throughout the semester. I ended with an A+ even though I did poorly on one of the 3 midterms. To succeed in this class I would recommend finding a good study group and working on problems together and starting homeworks early.", "rating": 4, "expected_grade": "A+", "created": "2023-05-29T15:59:26.187048Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Great Professor, enjoyed taking the course.", "rating": 4, "expected_grade": "B+", "created": "2023-06-15T21:31:28.663705Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Overall great teacher. Very nerdy and passionate about the subject and he explains the topics well. Easy to talk to if you have any questions. The homeworks are challenging but you have a week to do them, and afterward the quizzes and test seem relatively easier. Be sure to utilize the TAs for help.", "rating": 4, "expected_grade": "B+", "created": "2023-06-25T18:14:56.276670Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "First off, Kline seems like a nice guy. He isn't rude and takes time to answer people's questions in class. He's chill. But man, his class blows. Incredibly disorganized, insanely frustrating, and such a chore. \r\n\r\nFirst off, the class organization just sucks. Kline does not communicate with his students on Piazza, his TAs do. Kline does not make the exams, his TAs do. Kline does not put the grades in online, his TAs do. He kinda just shows up for lecture; that's all he does. He couldn't even put in our midterm grades on time because he hadn't made any of the assignments on ELMS. I got bombarded with 20 Canvas notifications of him creating the assignments and putting grades in on a random Saturday. That is ridiculous and unprofessional, in my opinion.\r\n\r\nHis homeworks are ridiculously hard - in the class Piazza, literally every student had this complaint, and the TAs responded with that's how Kline wants it to be. I don't learn from the homeworks, they only make me more frustrated and unmotivated to learn the material. And if you don't have partners (you can have up to two partners), you will be doing 20 hours of homework a week. It's utterly insane. \r\n\r\nI actually get more out of Justin's notes online from his CMSC250 class than Kline's slides. His slides are filled with messy proofs and unclear explanations of what the hell he's trying to teach. I don't think he's very clear in his explanations.\r\n\r\nOn our first exam, various questions were either wrong or worded wrong, causing many students to completely waste their time answering an unsolvable problem. It was such a messy disaster of an exam. In all my exams that I've taken as a student here, I've never had an exam that disorganized. Maybe it's because his TAs write his exams and not him? Once again, what does he even do?\r\n\r\nI would not recommend this professor to anyone. If you want a teacher that is organized, knows what they're doing, and assigns fair assignments, do not take this guy. I'm giving him two stars and not one because at least he's a chill person, he records lectures, and makes slides available online. But yeah I'm never taking this guy again", "rating": 2, "expected_grade": "C+", "created": "2023-11-01T00:49:17.031814Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Very chill and helpful. His lectures are pretty good, but slides are hard to follow if you aren't watching his lecture online or in person. I can easily imagine other students suffering if they aren't used to things like number theory.\r\nIt seems like he offloads everything onto his TAs. \r\nWe get the grades back pretty much the week after submission, but they aren't posted onto ELMS. I guess that's a little inconvenient because we have to manually calculate our final score, but nice to see the feedback come in quickly. A few of the TAs grade pretty harshly and give no partial credit, but if I submit a request that changes a bit. \r\nHomeworks are long and challenging, but they make me feel confident when it's time for quizzes or exams. I wish they were a little bit shorter though. \r\nThe first exam did have a typo, but it was corrected in exam pretty soon. Other than that, Kline is pretty organized and predictable. Everything is uploaded at the right time, and his google calendar is accessible has everything down. \r\nAlso shoutout to some of the TAs like Elias and Zoya. They sometimes offer Q&A sessions or extra practice problems.", "rating": 4, "expected_grade": "B+", "created": "2023-11-03T23:41:07.555096Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "These previous reviews must be trolling because this class is the worst I'm taking this semester. He has weekly homeworks, biweekly quizzes and 3 midterms. First of all, this dudes homeworks will have you tripping, because they are insanely hard. You're allowed to have a group, but even then be prepared for a ton of work only to end up with a subpar grade. If you don't have a group be prepared for 15 hours of work. His quizzes are fine, but his midterms will range from easy to insane. His first midterm was okay-ish, the second one was a complete disaster. The difficulty has no consistency, and he didn't even show up to proctor the exam. He also is barely involved in the class, it's basically run by the TA's, he's not involved on the Piazza and random policies like mandatory discussion will popup out of nowhere. \r\nHis slides are complete garbage. They make absolutely 0 sense and you will end up more confused. It's crazy how he'll take easy concepts you can learn from Justin's notes in 10 minutes and turn them into a headache while doing them in class during his lecture.", "rating": 1, "expected_grade": "W", "created": "2023-11-04T02:37:07.169646Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Not a terrible teacher but def be prepared to teach yourself.", "rating": 3, "expected_grade": "C", "created": "2023-11-08T03:06:33.889301Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "This is a mid semester review for students who intend to take him for the spring 2024 semester. First off like the other reviews say, the homework's are incredibly difficult and require roughly 12+ hours a week to finish which is almost impossible sometimes if you are busy with other classes and you probably won't get full credit either because the TAs grade very roughly. Kline said the reason for the tough homework is to gain a better understanding of the concepts and prepare you for the exams, however I feel that the homework being as difficult as it is does not help me learn at all.  His lectures are fine, not the best or worst professor I have had and he records all of them and posts resources like slides on Canvas. Outside of the lectures, he is not very involved. The TAs make and grade the homework, exams, and do most of the extra stuff such as responding to Piazza posts, making discussion worksheets, and doing regrade requests. The quizzes we have almost biweekly are very easy compared to the homework and exams which is nice. Overall the class feels very disorganized, the expectations are very vague for a lot of the proofs and the exams are wildly inconsistent in terms of difficulty, where some problems are very easy and others very difficult. The exams also seem to have a lot of errors/clarity issues in them. The class is not impossible but the disorganization, difficultly of the homework, and lack of clarity make the class very difficult to learn in, expect to put in a LOT of work and I would recommend finding an outside source online to help you learn if you want to do well in this class.", "rating": 2, "expected_grade": "C+", "created": "2023-11-08T23:20:13.901419Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "So prior to taking 250, I was not too worried about the class, my friends who took it before with Justin said the class isn't that difficult, and I saw Paul's reviews and was pretty satisfied. Oh boy was I soooo wrong about what my 250 experience would be like! This class has got to be the most overkill class I have ever taken so far. We have homeworks every single week, except the occasional midterm week, which are more or less the most painful questions you will have to answer. Paul will teach you the concept in the most basic form in class, and expects you to be able to do an extremeley complex proof on that concept. You would think since he was having us do really difficult homeworks that his tests would be on the easier side, oh man you would be so wrong. His tests, while definitely having better questions than the homework, are also quite difficult for the time given. I believe the second midterm average was around 64. As a lecturer he is also not very interesting. It is such a struggle to sit through his 1 hr 15 min lecture, when it's just him quickly showing proofs on a slideshow. Oh yeah that's another complaint, he moves through his slides way too fast, you can barely finish the sentence or definition written. He does post his slideshows and recordings, but having to sit through that is not the best experience. Because I am working extremeley hard, I think I can manage to get a B, but I would highly suggest taking another teacher for 250. I get that this is a weed-out class but this is just rediculous.", "rating": 1, "expected_grade": "B", "created": "2023-11-12T19:55:02.188816Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "This class is certainly one of the hardest classes you will have to take, especially with Kline as your professor. First off, the weekly homeworks can be ridiculous in difficulty, which requires you to spend 10+ hours a week doing 8 problems. Combine this with your other classes and the workload is unbearable. The lecture slides that are posted can sometimes be incomprehensible, and therefore useless for review. The quizzes are fairly easy for the most part, which \"makes up\" for the unbelievable difficulty of the 2nd midterm. What is the point of assigning homeworks and quizzes if the exam is going to be 20x more difficult than what we've been practicing? Under no circumstance should the average for an exam be a failing grade. It seems that past students have reaped the benefits of Kline handing out easy exams and giving extra credit for using Latex for the homeworks. Unfortunately, it seems that Kline has substantially increased the difficulty of the class.", "rating": 1, "expected_grade": "C-", "created": "2023-11-13T22:44:36.321024Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Kline had a 4 before this semester and he's only gone down. This is a perfect example of why you should not rely completely on planet terp reviews. Extremely hard homeworks, unfair exams, class is basically run by the TA's. If you fall even the slighest bit behind the class will turn into a nightmare. This class is already a weedout, and Kline's mismanagement makes it borderline unbearable. If you are struggling in CS and are signing up for 250, take Max or Teli. I'm only giving 2 stars because Kline is a chill guy, but his class is terrible.", "rating": 2, "expected_grade": "", "created": "2023-11-13T23:39:59.031731Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "TLDR:\r\nKline has very high grade averages on all assignments\r\nHomework's are hard but google is allowed and encouraged on them (half the answers are already online)\r\nLowest HW and Quiz dropped if you bomb it or forget to do it.\r\nQuizzes are simple and straightforward (I would argue easy)\r\nExams are a little more complicated but still pretty simple.\r\n4/5 only cause some homeworks are VERY hard.\r\n\r\nThese reviews are absolute insanity. The people who are saying the exams are hard are the anomalies. The mean of the first exam (fall 2023) was an 87% with a median of 89. I skipped every discussion and did well on both exams so far. Lectures are recorded so missing those would be fine too if I didn't ask so many questions. \r\n\r\nThe weekly homeworks are hard to do by yourself, but luckily you don't need to do it by yourself. You can collaborate with others and if no one else is willing to help you, go online for the answers as it is OPEN INTERNET. The lowest mean on these was an 82 (and the 2nd lowest was an 87) The lowest median on these was a 86 (with the 2nd lowest of 91).\r\n\r\nThe biweekly quizzes are very easy and open internet as well. They are also online so it isn't that hard to finish in time. The lowest mean was a 86 (with a 2nd lowest of 92) and the lowest median was a 90.5 (with a 2nd lowest of 96). \r\n\r\nThe exams I studied not one bit for and got an A on both so far. We haven't seen the mean or median for the 2nd exam yet but I can't imagine it be that much lower.\r\n\r\nAlso lowest quiz and homework grade are dropped so that's pretty nice too.\r\n\r\n\r\nAssignment type by difficulty is probably:\r\nHomeworks > Exams > Quizzes from most difficult to least. \r\n\r\nAlso regarding the \"strict grading\", my friend completely misunderstood what a question on the exam asked, wrote a proof for his understanding, and got full points. Bro didn't even answer the question and lost not 1 point.", "rating": 4, "expected_grade": "A-", "created": "2023-11-17T02:45:55.541653Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Kline had a 4.3 star rating before this semester, but now its a 3.5 as of writing this. He gives long, difficult, confusing homeworks every single week that usually take me 2 day of grinding to get right (except weeks with exams). His quizzes are open book and online, and are about 60% as hard as the homeworks so they aren't too bad. But the exams 💀\r\n\r\nThis class has three exams and a final. The first exam had an average of 85%, then he had a mid life crisis and the second exam average was a 64%, as of writing this, not sure if there is a curve or not, or if the upcoming exams will be easier to make up for it.\r\n\r\nHe is a good lecturer, but sometimes he explains things in an overcomplicated way. Like his 75 minute lectures, you watch a 30 minute video online and understand it better. He is a nice and chill guy, but the class is just too much.", "rating": 3, "expected_grade": "B", "created": "2023-11-17T15:55:30.385003Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "hard hws. some tas dont even know how to do the hws. lecture content is ez then exam content hard. records but is sometimes late. doesnt make hw or exam just tas.", "rating": 1, "expected_grade": "", "created": "2023-11-18T23:27:32.934036Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "I had high expectations coming in but the class has really taken a nosedive it seems since last semester. The first couple of weeks were fine, but once we got into proofs, its as if the homework difficulty increased exponentially. As others have stated the class is basically run by the TAs, and they make the homeworks. Plan to dedicate at least 20 hours if you are working on it individually. The idea is that difficult homeworks = easy time on exams, but that wasn't the case at all. Homeworks would be on unrelated and obscure topics, leaving you with a bad understanding of the fundamentals. At least the quizzes were really easy, but exams have not been good so far. The first was alright, the second was so difficult - barely anybody had finished by the end because the exam was wayyy too long. This, combined with the overall disorganization of the class, really puts me off of taking Kline again. He is a nice person and seems chill but there aren't many other redeeming aspects of this class.", "rating": 2, "expected_grade": "B+", "created": "2023-11-20T16:54:43.639200Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Paul is a great lecturer but the class is a bit disorganized. The \"rules\" have changed multiple times over the semester. He changes how quizzes and homeworks are submitted pretty regularly. Every two weeks it seems like the format of discussion changes - at one point it was optional lecture review, then it was optional worksheets, then it was required groupwork, then it was extra credit worksheets(you have to go both monday and wednesday to get the extra credit) with little warning. I woke up one morning to a message in the groupme saying that I had an assignment due that morning at 8am and that attendance at discussion that day was required(I am in the 8am discussion). While some of the later changes were in response to a lot of backlash from students, it was still very disorienting. \r\n\r\nIn general, the homeworks are challenging and graded harshly but you get a full week to do them(technically more because you get a \"free\" two day extension) and you can work on them in a group. Personally, I have found that doing the homework helps me learn the content and I haven't really had to study for either exam. You also get biweekly two hour take home quizzes but they usually take under an hour and for me have been grade boosters.\r\n\r\nOverall, if you can take 250 with Justin I would definitely do that but it's not the end of the world if you end up in Paul's class.", "rating": 4, "expected_grade": "A-", "created": "2023-11-22T19:13:49.340553Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Oh wow, where to even begin. This class is perhaps the worst, most disorganized class I have ever taken. First of all, let me begin by saying Kline is a very nice guy who is quite understandable. BUT... He is practically nonexistent outside of class. You will never be able to contact him about anything so your best way of getting to him is during class or by method of his TAs. Now, his TA's are absolutely atrocious. They have no idea what they're doing and confused all the time. And the head TA (Elias) is probably the most unfair person when it comes to creating homeworks and exams (Yes, Kline has the TA's make the exams and doesn't do anything himself). The course structure just seems disorganized. Although the quizzes are okay, pretty easy in my opinion, they are not a very significant portion of your grade and they do not really help when it comes to exam preperation. Now, onto the worst part about his class, the homeworks. Elias makes the most cruel homeworks known to mankind. Expect to spend over 20 hours a week just doing homework for this class. The idea for homeworks should be to help you for the exam, however, his homeworks make me very confused and make it more likely for me to screw up basic concepts. In conclusion, I do not know why Kline is rated so high, as in fact, he is the worst professor for this course by far, and you will be FAR better off taking any other professor.  (His ratings when I took the course where a 4.3 and now they're a 3.4)\r\n\r\nTLDR: DO NOT TAKE KLINE. Trust me you will thank me later.", "rating": 1, "expected_grade": "A-", "created": "2023-11-27T06:23:04.261147Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Homework is way too demanding\r\n\r\nQuizzes are online and easy \r\n\r\nExams are very fair in comparison to homework \r\n\r\nLectures are disorganized but he records all of them\r\n\r\nI've never gone to a discussion and I only go to lectures for exams. One of the worst classes I have taken due to the homework.", "rating": 2, "expected_grade": "B-", "created": "2023-11-30T02:57:10.916915Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "homework's are terrible, they're overly complicated and nuanced for no reason and take 10+ hours to complete each week. kline himself is a fine lecturer, he has all lecture recorded but slides are very confusing and he tends to speed through them. Kline outsources everything to the TAs which makes the course very frustrating and unorganized. by far the worst class i'm taking this semester", "rating": 1, "expected_grade": "", "created": "2023-11-30T04:13:58.857498Z"}, {"professor": "Paul Kline", "course": null, "review": "Great at explaining concepts during lectures and records all of them as well. \r\nQuite unorganized and does not respond to student emails. Delegates most non teaching tasks to TAs.\r\nExams and quizzes are very fair. \r\nHowever, the homework sets are quite long and generally unrelated to the exams and quizzes. \r\nNot a terrible option for a teacher.", "rating": 3, "expected_grade": "C", "created": "2023-11-30T16:17:36.854525Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "It seems like Exam 2 was a blunder, but Kline really clutched up and gave a free 90%+ Exam 3. Take his class y'all 🙏🙏", "rating": 5, "expected_grade": "A-", "created": "2023-12-02T03:51:28.103019Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "As others have said, Kline is a pretty good lecturer but this course is no joke and at times I think it was more difficult than it really needed to be. The weekly homeworks were very challenging and required you to make big leaps from what was covered in lecture. The head TA started posting hint documents partway through the semester but they were still difficult. Even when working with other people and putting many hours of work in I still got Cs on a few of the homeworks. \r\nExams I feel were not terrible. Exam 2 was by far the hardest of the three, but they generally were pretty reasonable and were graded very generously. It seemed like Kline had the TAs doing most of the work making homeworks, quizzes, and exams. Overall I would say Kline was decent but you might be able to do better elsewhere.", "rating": 3, "expected_grade": "A-", "created": "2023-12-02T16:57:18.415409Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "This class is really disorganized and unecessarily difficult. As a lecturer he isn't very interesting and he also doesn't do anything outside of lecturing, and outsources the HWs to the TAs, who for some reason thinks giving overly complicated problems will set us up for success, when they themselves realized that people were having a lot of trouble with fundamental concepts. Also so many of the answer keys to the discussion docs that are given to us are incorrect, so there is not much practice, with problems of similar difficulty, to test problems available to us. Yes the 3rd midterm was quite easy, but I won't understand how one singular midterm being easy should give a professor 5 stars, when everything else was a mess. I would highly urge you to take anyone else but Kline whenever he teaches CMSC250.", "rating": 1, "expected_grade": "B-", "created": "2023-12-03T06:53:12.940282Z"}, {"professor": "Paul Kline", "course": null, "review": "TLDR: Homeworks are way too hard and lengthy, grading is very slow, but otherwise it's fine.\r\n\r\nKline himself is a solid lecturer, I definitely learned a lot from him. He also posts slides and lecture recordings which is very helpful. Unfortunately, being a professor is his part time (I think) so TAs deal with anything outside of the lectures (office hours, Piazza, emails, etc). The quizzes are biweekly, online, and open note which is nice and basically free points. The exams are fair.\r\n\r\nThe primary problem with the course is the homework. We're assigned 6-8 problems with several parts each that usually get progressively harder. My group takes several hours a week just to complete the homework since it's graded for accuracy. Grading any assignment also takes weeks, but that's probably because there aren't a lot of TAs.", "rating": 3, "expected_grade": "A", "created": "2023-12-05T02:37:57.729855Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Kline is a decent lecturer, not outstanding but not bad by any means, and he also records his lectures. Quizzes are easy and exams are pretty fair. The course is super disorganized though since Kline doesn't actually do anything besides lecture, his TAs basically run the course. Homeworks are unnecessarily complicated for the content they're based on and were frustrating despite the topics and concepts themselves not being that difficult to understand. I found MATH310 to be easier than Kline's 250, even though 310 is basically just 250 but more rigorous and abstract, only because the 250 homeworks were significantly less straightforward. Homeworks and quizzes also don't get graded for weeks or months at a time which is even more annoying. If you have to take him, it won't be the end of the world, but I would avoid if possible.", "rating": 3, "expected_grade": "A", "created": "2023-12-06T22:37:49.359738Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "He's a great lecturer and cool guy but you probably think he's the worst guy ever after reading some of the recent reviews. The homeworks is hard and lengthy yet not a single review mentioned how Paul provided hints to the homework and shortened them each week. In addition people complain about the latex extra credit being gone but he gave extra credit for attending discussion. In addition people are throwing around the 64% second midterm average which was not true at all that was said by a TA before everything was graded. In addition the first and third midterms were really easy the average being way higher than the second midterm which seemed to be more of a fumble than anything. He gives take home quizzes that are really easy and serve as a grade booster. In general he's a professor that you can get a good grade with by doing the work. Yes the homeworks were hard and are super lengthy but the class was rewarding through free extra credit in discussions. These one star ratings are a joke and to act like after a semester of lecturers never learned anything from the class is a joke. He is a solid choice to learn all the material from and get a good grade.", "rating": 4, "expected_grade": "A-", "created": "2023-12-07T21:00:18.511728Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "cool guy, fair tests, hw's are a little tedious but enough extra credit given, quizzes are open notes idk why yall buggin. the guy got me real interested in discrete math ngl. only slight issue is sumbission for assignments was tad bit annoying when they switched around from elms to gradescope and vice versa", "rating": 5, "expected_grade": "A", "created": "2023-12-10T08:16:10.224489Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Overall, this class was incredibly challenging for no reason and really wasn't engaging in the slightest. For lectures, Kline was very boring and hard to follow. Discussions were not helpful and despite going, didn't really help me much on homework and exams. I would highly suggest (if possible) not taking this course, and if you do, at least find another professor who is possible to pay attention to several times a week.", "rating": 1, "expected_grade": "B", "created": "2023-12-10T22:24:00.802121Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "i literally dont understand a single word this man says in class", "rating": 1, "expected_grade": "", "created": "2023-12-12T02:12:10.263312Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "He's a solid choice, if you have the time to work really hard and sit in OH every week. I'm serious about that.\r\nPROS:\r\n- decent lecturer, spends just enough time on each topic\r\n- his exams are actually pretty great overall, decent question difficulty and topic coverage\r\n- he recorded each lecture and had it on panopto bless\r\n- he put tables of some of the things we needed to use on our exams so we didn't need to memorize\r\n\r\nCONS:\r\n- his slides are sofa king useless, guys-- SO useless. Don't rely on them.\r\n- the TAs like making the HW physically painful to do-- takes HOURS out of your week and graded really harshly\r\n\r\nOTHER:\r\n- I needed to reschedule my final and had to get his approval and he responded to my email on that day but according to other people who have contacted him/tried to find him said he goes poof outside of the lecture hall. So, take the two contradictory tales as you will.\r\n- HW takes FOREVER to get back but I heard it's worse in other sections.\r\n\r\nTLDR:\r\nHe's a solid choice, all things considered. If you take him, take this advice too:\r\n- This is a class you should take notes in, rewatch the lectures if necessary but his slides aren't gonna help and you're gonna need more info than Justin's Notes has. (they're still helpful though so give em a look)\r\n- The moment you find yourself struggling with a question on your HW, ask a TA during OH or discussion. It will save you so much time, and you're more likely to get full credit on your answer.\r\n- if you don't have neat handwriting or a touchscreen device, learn some basic LateX. If you do, get an app that lets you write on pdfs. This is coming from someone who had to handwrite 15 pages of homework for a single week. Don't be like me.", "rating": 3, "expected_grade": "", "created": "2023-12-15T05:05:39.121753Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "So, as many other reviews have accurately depicted, this professor is extremely disorganized and hard to work with in a sense. It is 100% true that the TAs do everything ranging from the HWs, Quizzes, and even the Exams where one TA, Elias, does the whole thing. What's so funny to me is that Elias is the one that specifically makes the HWs and sometimes the professor and most of the time, other TAs will get confused from the question and not know how to properly solve a question. Besides that, I'd say Paul himself is a good lecturer but I feel like he needs to take better initiative and not mention in class half the time that \"it makes grading easier for the TAs.\" That is one thing I hated the most, which was saying that statement, and sometimes he'd say it so often that we'd laugh in class because of how often it was mentioned. On top of this, as others have stated, the quizzes are truly easy as it is open-note, and the HWs, despite their difficulty, can be easy if you have a group and split the problems among yourselves. With the exams, I'd say Exam 1 was the easiest, by far, Exam 2 was relatively difficult because it has proofs with T/F questions that can easily trip you up with properties regarding surjectivity, injectivity, etc... and Exam 3, was a step in the right direction in terms of difficulty, which I'd say was a more fair exam. Lastly, the Final exam was also really fair, and if you had last semester's final exam, it may have been a little easier.", "rating": 2, "expected_grade": "B", "created": "2023-12-16T17:24:04.648725Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "He seems like a nice guy, but he's not really involved outside of lecture time. His TAs write the homeworks (which are way too hard without a partner), answer Piazzas, and write the exams. Shoutout to Kanav for being a great TA. Elias was the head TA and he's a good teacher but he writes pretty hard homeworks and exams. I wouldn't say don't take Kline, but just wish for a good TA.", "rating": 3, "expected_grade": "", "created": "2023-12-17T19:56:53.971392Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Paul was a fine lecturer and made the material easy to understand, but the course design was very unorganized. Most of it was run by the TAs, and even after finals we still have homeworks left ungraded. Paul himself is fine, but be prepared if you do decide to enroll in his class.", "rating": 4, "expected_grade": "A-", "created": "2023-12-18T09:02:09.284078Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Only Paul could make a course like 250 so unnecessarily hard and stressful. The content and course itself is not very difficult but he did everything in his power to make it terrible. Grade wise, you will probably do fine in this class, but boy was it a rollercoaster. Paul is the most unorganized and hands off professor I have ever had. Turns out his head TA does everything and I mean everything. Paul does very little except show up for lecture twice a week. Lectures themselves were very slow and boring and a lot of the time he would waste time explaining or doing things that were not important. The lecture slides are terrible, a lot of the time slides were missing or out of order or hard to find. Probably do not have to mention this since so many did before me but the homeworks are awful and while some quizzes were easy, some of them were terrible. Exam 2 was the worst written, most unfair exam I have ever taken. While the other two exams and the final were perfectly reasonable, exam 2 was such a disaster that it made for a much more stressful semester than it ever should have been. The TAs were not great and discussion was pretty pointless. All of this nonsense that we had to deal with that didn't even have to do with the course material is why I absolutely do not recommend him. I am sure that many who took 250 in Fall 2023 will agree with all of the above and give him similar reviews. His average rating will surely go down and for good reason. Please avoid.", "rating": 1, "expected_grade": "B", "created": "2023-12-18T19:50:20.882045Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Paul is a really good lecturer. His lectures are very interesting and entertaining. The homeworks are very difficult and take a long time to do. Exams are fair-ish. Exam 2 was a bit on the low side but we were thrown a bone with exam 3. Final was easy. What really set me off was quiz 6. Quiz 6 was autograded and 2 of the questions had answers that answered a different question. There was never any statement about quiz 6 which I believe to be unfair.", "rating": 3, "expected_grade": "A-", "created": "2023-12-19T16:29:04.350003Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "TLDR: Paul's a good guy/teacher with some organization problems. \r\n\r\nPROS:\r\n- Incredibly fair and understanding person. If you have a problem/situation, he's more than willing to accommodate you. If you have a question, he'll go for hours 1 on 1 with you in office hours until you understand it. \r\n- Lectures were clear, cogent, and recorded (slides were posted too). Idk what other ppl are talking abt when it comes to his lecturing; he has genuine passion for the subject and that comes to life in his lecturing. Lectures are problem-oriented: he'll start with a problem and walk through the thought process for how to solve it, which is really useful come exam time.\r\n- Speaking of exams: everybody here is completely capping. Paul's exams were EZ: Exam 1: 89 median, Exam 2: 75 median, Exam 3: 94 median, Final: 84. Yes, exam 2 was a little tough, but the other exams more than made up for it. \r\n- The homework point is the one I really don't understand. The homeworks are substantial, and usually harder than the exams (which means you can walk into the exams and kill it bc you've literally done harder stuff). Tbh, not one took me more than 4-5 hours and I got either 97s or 100s on them. Most were a 2-3 hour job. If you go to office hours (shout-out to Rushil!!!) you'll be totally fine on them. (And in case you think I'm some kind of math genius, I am not. Calc II was hard; def harder than this). \r\n- Quizzes are literally free 100s. They'll just be repurposed lecture problems, and you have 2 hours to do it + its open internet. So all you have to do is pull up Paul's slides and you're good to go. \r\nCONS:\r\n- Grading. It's slow (kinda understandable given that there are 300+ students and it's a proof based course, but still) and the grading TAs can vary wildly. Some have absolutely no chill, so make sure to format your quantifiers and proof goals correctly bc they'll rip you to shreds over the small stuff. \r\n- Poorly worded questions: Towards the end of the semester, homeworks and quizzes starting being hosted on ELMS (I assume for the autograding since they were behind, see prev point). The problem was, they kept entering in the wrong answers or the wrong questions. I remember one problem asked about straights (in poker), but you had to somehow assume they meant straight flushes (very different answer!!). This happened to some extent earlier in the semester (homework questions were changed/reworded), but it got really bad at the end.\r\n- Some flip-flopping in discussion formats. It started being a mini-lecture, then it was a problem-solving sec, then it was checking other ppls proofs, then it was back to problem-solving but this time you could get extra credit. I mean, the extra credit was nice, but it was still kinda hectic finding out what we'd be doing in discussion via a canvas announcement the day of. \r\n\r\nI would normally give him 4-4.5 stars for the organization issues, but since he's getting dragged unfairly by these reviews, I'll give him a 5. Def take him if you get the chance!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T16:55:18.885064Z"}, {"professor": "Paul Kline", "course": null, "review": "Kline is probably the worst professor anyone can take for this course. Terrible Homeworks, Exams, and the Final Exam was an absolute nightmare. He's also the only 250 professor with 3 midterms rather than 2. Please take another professor.", "rating": 1, "expected_grade": "A-", "created": "2023-12-19T18:00:01.224226Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Strictly in terms of teaching, Paul does a pretty good job. His lectures aren't the most engaging, but I feel like he explains the topics well. His office hours are also incredibly helpful as he teaches well one on one. \r\n\r\nON AVERAGE, his tests were fair. The questions asked on the tests reflected the material of the lectures.\r\n\r\nThe quizzes were incredibly easy, especially since they were open note, open internet. \r\n\r\nThe homeworks, on the other hand, were incredibly difficult. The homeworks were weekly, and you were allowed to work in up to groups of 3. On average, each of the homeworks would take me 7-10 hours per week, and I was working with a partner. However, these difficult homeworks did prepare us well for the exams. In office hours, Paul is also willing to help you with the homeworks if you are stuck. \r\n\r\nIn terms of organization, the class is very unorganized. Policies about things like discussion attendance and homeworks deadlines were very scattered and kept on changing. While these didn't affect the actual material of the class, or the class too much on a large scale, it was still annoying to deal with this stuff. \r\n\r\nIf you are ok with a class being a little unorganized, but can keep up with the material well. then you should take Paul's 250 course.", "rating": 4, "expected_grade": "A-", "created": "2023-12-19T23:29:39.302710Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Great lecturer gets alot of hate honestly the homeworks are tough and there were some issues this semester but Paul sorted them out.\r\n\r\nThere is some misinformation going around about how the second exam average was a 64% that is wrong that was said by a TA before everything was graded the average was really a 73%. The first midterm average was a 88% roughly and the third midterm average was a 90%. The final was around a low 80% and all if not all the homeworks averages have been around a 80 to 90%. I'm throwing these numbers out to say that you might think Paul is the worst teacher ever reading these reviews yet he gives these \"hard\" homeworks that people get between an 80-90% on average. In terms of his teaching quality he's great at explaining things and records his lecture I think people underestimated his ability to teach complicated topics like induction or combinatorics.\r\n\r\nDiscussions were reworked many times but Paul finalized this format of covering practice problems relevant to the lecture material and went over problems that helped us with the homeworks. He did this at response to student feedback and even gave extra credit for simply attending discussion.\r\n\r\nIf you reach the end of this review the point is Paul is going to make you work a lot but his class is very rewarding with the averages reflecting this. Also there are 5 quizzes the semester that you take online for two hours that have a 90% average plus on every single one of them. He's not perfect but he's getting there he's been shortening the homeworks as time goes by so hopefully the issues people have with him will be gone soon and people will realize how much of a great teacher he is.", "rating": 4, "expected_grade": "A-", "created": "2023-12-20T02:34:59.693977Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "(Note: this review is from the perspective of a transfer full-time student who also works a couple of part-time jobs)\r\n\r\nThere are a lot of bad reviews or mixed reviews on Professor Kline that resulted from exam 2 but in my opinion I feel as though the class is worth taking with Paul.\r\n\r\nAt first every assignment including exam 1 was do-able and pretty simple material to follow except quiz 1 since it was the first quiz and you have nothing to prepare you for the following quizzes except that one. The structure of the class is really fair and allows for flexibility to get a passing grade. Lowest 1 quiz and 1 homework dropped, homeworks every week have a grace period of 2 days for full credit, extra credit was given just for showing up to discussion, & even recorded lectures. With all of this, it was good for me as a part time employee and student to be able to complete my work for full credit on days when I’d be at my job for majority of the week. I will say material and assignments get harder and tricker after exam 1 but that’s with any class in comp sci tbh. \r\n\r\nNow homeworks are very tedious and it’s best to start at the beginning of the week and you’re able to work with other students which is good. One reason I give this class a 4 instead of 5 star is because of TA grading. You can always of course do regrade requests but sometimes it felt like the smallest mistake could result in a lot of points being taken away. Same thing for certain exam questions.\r\n\r\nNow to be frank I am the type of student who just wants to get my credits and go. It’s hard managing jobs and school so I can take what I can get. I did well on exam one, poor on exam 2 and the final, and decent on exam 3 and still managed to get the credits due to maintaining my homeworks and doing good on my quizzes, as well as the gracious amount of extra credit opportunities. Being that everyone isn’t on the same boat as me, if you’re able to focus on school full time or have an excellent schedule and time management skills, this class will be good for you. I don’t have those and i still passed so honestly not as bad as everyone is making it because I’m sure most of them passed anyway. Good luck to those reading and don’t like the +/- system get to you!", "rating": 4, "expected_grade": "C-", "created": "2023-12-21T04:18:49.765806Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Kline has had historically good ratings over the last few semesters but they took a nosedive this semester, and I don't think this is reasonable.\r\n\r\nHomework is hard, but it's been like that since previous semesters. There's no new news there, you pretty much need to consult all available resources, work in groups (which is allowed) in order to complete it. Exams for the most part have been pretty fair. However, exam 2 was definitely unfair, and some of the material tested wasn't really taught properly. In addition, exam 2 had arguably the hardest content. However, overall, I think 2 other good/easy exams and a pretty fair final made up for this. (also, exam 2 average wasn't even that bad, it was a 74.5 median)\r\n\r\nQuizzes are online and pretty easy because they give you way more time than needed to do them. They end up being grade boosters. \r\n\r\nTLDR: If you put time into the homework then you will walk away with a good grade in this class.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T07:37:54.694299Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Kline is a kind, engaging lecturer that is clearly passionate about what he teaches. His nerdy sense of humor makes class more interesting, and he goes out of his way to thoroughly answer students’ questions and concerns during class.\r\n\r\nThe homework is difficult, but you are allowed to work in groups of 3, and they are open-internet. If you work in a group, start early, and go to office hours when stuck, the homework is still challenging but very manageable and prepares you extremely well for exams and quizzes.\r\n\r\nThe quizzes are easy and a good grade-booster, and the exams were all fair. The lowest quiz and homework grade were also dropped.\r\n\r\nI am taking off a star because the class does have organization issues, with Kline and the TAs giving conflicting guidance or policies on some homework problems. However, this got much better by the end of the semester.", "rating": 4, "expected_grade": "A", "created": "2023-12-21T13:28:37.612876Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Honestly, when entering this class, many people recommended taking Kline, stating that he was a better option and a good lecturer. However, that turned out to be a fat lie.\r\n\r\nLectures:\r\nStarting with lectures, he speaks too quickly, often skipping essential steps in a lesson and assuming students will understand or skipping because it's too much to explain for this lecture, and he does not feel like going in-depth. Even though he records them, these recordings are often released days after lectures. At times, students had to ask for them since he did not upload them promptly. Personally, after the first exam, I stopped regularly attending lectures and only came to talk with friends or because I had nothing else to do. Attending, other than for exams, was a huge waste of time if I was not going to get anything from it. His lecture style also focused on engaging only the front row of students, and there was always a correction or mistake made in his lecture slides, which was confusing in terms of formatting work.\r\n\r\nHomework:\r\nThe homework is probably the most difficult and time-consuming assignment in this class. Although it prepares you for the exams, the amount is ridiculous, considering we have other classes and work to balance alongside the homework. Moreover, they were weekly assignments, so most of your week was spent trying to figure out what the homework was even asking for. I feel as though there were also a lot of mistakes in the homework at times, and you would likely have to go to office hours to understand some problems since they often included extended problems we may not have talked about in class.\r\n\r\nExams/Quizzes:\r\nThe quizzes were not too bad. I would just say that at the beginning of the semester, we had quizzes on topics we had not gone in-depth into in the lecture or homework, which meant unless you did all the homework initially, the quiz might have been slightly more difficult. Overall, the exams were not too bad either as long as you understood the homework, quizzes, and discussion worksheets. The only thing that I disliked about the exams was how heavy they were with content, having multiple sections of multiple choice and more sections of free response. For the second exam, there were a lot of sections of questions and content, and not enough time to answer them, which led to the average being the lowest in the class because most people did not finish. Something else I found frustrating was the number of corrections made during the exams. You would think they have all this time to make the exam and go through them for any mistakes, but for every exam and even in the final, there was always some sort of correction to be made, which was very annoying in my opinion. Sometimes, they did not even announce the correction out loud; they just wrote it on the board and assumed you would look up.\r\n\r\nFinal Review:\r\nThe TAs in this class were never on the same page regarding what they were looking for when it came to assignments, so it was very disorganized. Kline is merely the professor, but the TAs run the class. Kline is not as accessible to contact outside of class apart from his office hours which are only about twice a week for 1-2 hours. I would say you're better off just using Justin's 250 notes, which is what I did. I barely even bothered to use Kline's slides after the second exam. All in all, a very disorganized class. I would not recommend taking this unless Kline is literally your last option.", "rating": 1, "expected_grade": "A-", "created": "2023-12-21T20:26:48.228689Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Okay lecturer. HW were pretty long and hard. A lot of things were offloaded to the TA and were disorganized. The TA graded quite leniently and the exam averages were quite high. Overall, not a hard course to pass or get a decent grade although you will encounter some disorganization and may have to put in the hours to get the HW done.", "rating": 3, "expected_grade": "A-", "created": "2023-12-21T22:08:34.110067Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "CMSC250 with Kline was worth it. Yes, the homeworks were really hard but you have an entire week to complete them, can work with a group of students, and the lowest is dropped. Not to mention, you could go to office hours if you were struggling. The TAs are, for the most part, incredibly helpful. If I could, I would give a 4.5 rating just because there was definitely some disorganization in terms of questions on quizzes or homeworks worded incorrectly, or the answer keys using completely different numbers from those on the actual quizzes/homeworks. Other than that, the exams were fair, the quizzes were very easy, and there were even opportunities for extra credit. Discrete math is not supposed to be easy, and I'm glad that the homeworks challenged us.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T23:02:12.740341Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "He's honestly pretty bad. Terrible Homeworks and Exams. And quizzes were unfair. He doesn't respond to emails either. If you have an option for Fawzi or Teli you will be far better off with either.", "rating": 1, "expected_grade": "A-", "created": "2023-12-22T04:08:40.788941Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "The class is disorganized, the TAs are not on the same page, and they assign an unreasonable amount of homework weekly. The head TA was particularly ineffective at their job. If Elias is still a TA, good luck. There are consistent mistakes in the class lectures, homework, and every exam. Despite promises of extra credit, it had no impact, and there were no grade curves or rounding up. If you were told otherwise, it's likely not true, so it's best not to rely on it. It's also challenging to get in contact with the professor. Save your time; DO NOT TAKE KLINE.", "rating": 1, "expected_grade": "B+", "created": "2023-12-23T14:20:24.890973Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Probably the most poorly organized class I have ever taken in my entire life. I will say the exams and quizzes (besides exam 2) were really fair, but the homework’s and the way that Kline covers induction are probably some of my worst moments at the university. If you have to take Paul, know that you’re getting a decent lecturer at best for the first 2 months, with literally no avenues of communication at all throughout the semester. I may have emailed him 4-5 times with no response to date, and the semester is over. There’s genuinely no point in going to lecture because he just ends up reading off the slides anyways, and he doesn’t give any ways to succeed in the class because he doesn’t even run the class, the TA’s do, who are really nice people except for the fact that they think 15-20 hour homework’s are feasible.", "rating": 1, "expected_grade": "B+", "created": "2023-12-23T18:46:57.300226Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Quite possibly the most disorganized class I have ever taken in college. Exams and quizzes were fair for the most part, but the homework alone is enough to stray anybody away from taking this class. Also, the TA's run the class, and Kline functions as almost a guest lecturer. You can not reach him, and the one time he made a quiz, he made it so ambiguous and confusing that he had to end up dropping it because only a few people were able to do well. All in all, take literally anybody else.", "rating": 1, "expected_grade": "B+", "created": "2023-12-24T21:45:41.091103Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "most reviews are pretty spot on, homework is insanely hard for no reason. It's actually not the biggest problem though because most times you work in a group anyways and Kline actually encourages this. He is a very good lecture and records them so you don't HAVE to come to class. Exams are a bit hard, but are doable. Not an easy A.", "rating": 4, "expected_grade": "A", "created": "2023-12-25T02:05:25.916539Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Insane how gassed up his reviews are. This class has been extremely unorganized and is COMPLETELY ran by the TAs. Kline has absolutely no involvement in the course aside from his one lecture twice a week, which are slides he made last year. To be fair, he is a decent lecturer, records lectures, and seems fairly passionate about his course. However, thats where the good ends.\r\n\r\n\r\nThe homework is unnecessarily hard. It is the hardest part of the course and IMPOSSIBLE to do alone. The TAs write it, and it is just way too hard. Unbelievably so. Hardest out of any other professor. Expect to spend upwards of 10 hours working on these ridiculous problems that obviously were not covered in class because Kline has 0 involvement with writing the homeworks. \r\n\r\nElias Prieto was the head TA for Kline’s 250, and while he is a nice person he absolutely should not have control over the course.\r\nThere was supposed to be extra credit for the course that should have bumped your course grade up significantly, by doing work in discussions and an extra quiz + homework. When people asked about how substantial this extra credit would be, they would ignore you or be completely vague about it. Ultimately, it would only end up being 0.05% of your grade. It’s basically like doing a single question on a homework. The class itself felt extremely disorganized and the professor did absolutely nothing to solve it.\r\n\r\nOh, and don’t bother emailing Kline about anything regarding your grade or sickness. He will absolutely not respond. \r\n\r\nI ended up with a 79.99% and while any real extra credit would have helped, of course when everyone asks for clarification about extra credit and final grades, absolutely none is given. \r\n\r\nJust save yourself and take literally anyone else. Most 250 profs are great, EXCEPT Kline.", "rating": 1, "expected_grade": "C+", "created": "2023-12-26T17:14:02.799475Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "He is a decent lecturer, but he is kinda boring to listen to. He explains what he wants from the students pretty well in terms of style, but the homeworks are very hard and take so long to grade. The TAs do a lot of the heavy lifting, but the exams are pretty fair based on what we learn in lecture, discussion sections, and from the homework.", "rating": 4, "expected_grade": "A", "created": "2023-12-28T01:00:05.220943Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "TL;DR: Kline is a solid lecturer, but the homeworks are unnecessarily difficult and he ends up having the TAs handle most non-teaching tasks.\r\nKline is definitely a strong lecturer. He covers concepts quickly but in a manner that's easy to understand and pauses for any questions you might have. All of his lectures are posted on Panopto so if you miss something or want to review you can easily access everything. Unfortunately, if you want to ask him any questions outside of class, you are almost out of luck. He teaches part time so almost anything outside of class is handled by TAs.\r\nQuizzes and exams are much easier than the homeworks. There were 5 easy quizzes (and the lowest one gets dropped!) that were all online and open-note, which was pretty nice. The exams were also pretty fair. I had a fairly easy time on all 3 exams, which surprised me given how difficult the homeworks were. \r\nGrading is quite slow, probably because there weren't many TAs this semester. Most homework assignments and quizzes took 3-4 weeks to get graded, with exams usually taking 1-2 weeks.\r\n\r\nOverall pretty good experience.", "rating": 3, "expected_grade": "A", "created": "2023-12-29T07:12:49.125136Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "oh boy\r\npros:\r\ngood lecturer and RECORDS HIS LECTURES thank god\r\nbiweekly quizzes are definitely doable\r\nfinal was fine and definitely felt fair\r\n\r\ncons:\r\nhomeworks can be long, start it early\r\nclass is just messy\r\nexams were a mess, first one they caught a major mistake like 45 min in, second one was bad and to make up for it he gave like a worksheet for the third one\r\ndiscussions went from nobody going to them to \"extra credit\" that did not actually count towards your final grade LOL\r\nhuge disconnect between him and TAs, at the beginning i would get so many points taken off from formatting even though I would check with the TAs in office hours beforehand, thank god he become more lax about it \r\n\r\nKline is a good lecturer but his class was a mess. I think this is his second year teaching 250, first year doing it by himself, so I would give him time to figure what he wants to do with it. currently, you will learn a lot but will have so much unnecessary stress", "rating": 2, "expected_grade": "A", "created": "2024-01-05T17:52:06.380082Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Don't expect any communication from him, if you try to email him about anything- administrative issues, sickness, or anything of the sort, just forget it. He will NOT respond. The TAs run the show, and are painfully vague about everything. Elias Prieto, the head TA, has promised us extra credit by doing work in discussions, only to be a pitiful 0.03%, and extra credit homeworks and quizzes (that were as hard as the general homeworks which many people have already talked about below). Point being, Kline literally does nothing in this class, and TAs getting paid minimum wage run the show, which lead to a multitude of problems. Absolutely do NOT take Kline.", "rating": 1, "expected_grade": "C+", "created": "2024-01-08T18:10:55.079587Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Kline is kind and approachable, but aside from making the slides for lectures, he doesn't do much. The TAs write the homework/exams/discussion section materials, decide on a healthy majority of class policies, and answer questions in office hours/on Piazza. Understandably the class became very disorganized and frustrating for many students because TAs created everything and kept changing various policies arbitrarily. Homework assignments are difficult, but the intention is that students work in groups and actively come to office hours for help. Exams are doable if studying off of discussion section materials and homework keys.", "rating": 3, "expected_grade": "A", "created": "2024-01-09T05:02:17.967583Z"}, {"professor": "Paul Kline", "course": "CMSC250", "review": "Kline is a nice guy and makes lectures interesting and engaging. But that's the extent of his pros. DO NOT TAKE HIM! The TAs write quizzes and homework, and both are annoying in their own ways. The quizzes often have extremely vaguely worded questions (which for a proofs/logic-based class can completely change how you answer). Homework is very challenging and tedious. They are usually 7 questions, each having 2 to 8 parts each. They stretch to topics not covered at all in lecture and are somewhat asinine. Additionally, grading is done very, very, very slowly. By the first exam, only 2 grades were released out of around 10 that would be covered on the exam. This meant you went into exams completely blind with no feedback, unsure if your methods and styling were correct. Because of everything above, students go to Piazza to ask questions (as emailing is useless) about vague problems or things they're confused about, but no one answers. TAs only answer about 50% of posts. Even when they do answer, it is very short and still unclear, and usually a long time after the question was posted (meaning the homework/quiz you asked about was already due).", "rating": 1, "expected_grade": "A", "created": "2024-03-06T03:38:43.518440Z"}], "name": "Paul Kline", "slug": "kline_paul"}