{"courses": ["CMSC122", "CMSC131", "CMSC132", "CMSC216", "CMSC389N", "CMSC389W", "MATH299M", "CMSC132", "CMSC122", "CMSC132", "CMSC131", "CMSC132", "CMSC132", "CMSC132", "CMSC122", "CMSC131", "CMSC131", "CMSC122", "CMSC131"], "average_rating": 3.6543, "type": "professor", "reviews": [{"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "What you would expect from a professor. He goes through the material relatively well, but fails to engage the class in any way. I was fortunate enough to have Nelson post his lectures for the class so I don't go to lectures anymore, but overall I feel the class is still manageable by just reading the power point slides posted online. \r\nCMSC132, in general:\r\nQuizzes can be annoying I recommend taking them seriously because they can really impact your grade if you don't do well.\r\nProjects: Projects were relatively easy I would just give yourself enough time to do them.\r\nMidterms: Overall, were generally fair but have very nitpicky questions in some cases, doing the practice midterms that are posted is more than sufficient study material. ", "rating": 3, "expected_grade": "A", "created": "2017-11-19T22:41:19Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Pedram is really good at balancing teaching concepts and explains the actual code that goes into the course. The only caveat I’d say about pedram is his discussion sections aren’t always relevant.", "rating": 4, "expected_grade": "B", "created": "2017-11-19T23:17:05Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Class wasn't too boring for an intro course. He tried his best to teach to the lowest common denominator, since it is an intro course. Grading is fair, didn't always know everything in lecture but he tried his best to answer what he could. ", "rating": 4, "expected_grade": "A+", "created": "2018-03-20T18:53:54Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "A good professor overall with answers to all your questions and willing to admit if he doesn't know the answer off the top of his head. Entertained every question a student threw at him, even if he had to defer to later in the class to answer it. Many felt his midterms were extremely difficult, but they're fair tests of your knowledge in the class. They're challenging, but they're not impossible if you study all the content and can write the code. For all the exams, Pedram said what the coding section would be on (of course not the specific question but the general topic) to make sure you knew going in. ", "rating": 5, "expected_grade": "A", "created": "2018-05-11T00:01:59Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "No Piazza forum to ask questions only TA hours. When I asked the TA why he doesn't set up a piazza forum, he quoted Pedram and said \"I'm too lazy.\" Average on the midterms were about a ~60%. Pedram has a very monotone voice and as a result is very boring. Projects were alright, start early and you should be straight. Going to TA hours on the day a project is due is like waiting in line at a yeezy shoe release. I wouldn't take him if I were you. ", "rating": 1, "expected_grade": "", "created": "2018-05-11T02:59:10Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "He knows his stuff but does not know how to test on knowledge. Midterm averages were pretty low, and about 15-20% of the class had to drop the class just because of those. He's definitely a nice guy, but the TAs weren't great, and the lack of TA office hours will leave you scrambling if you need help on a project. ", "rating": 2, "expected_grade": "B", "created": "2018-05-16T15:03:32Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Pedram is an excellent lecturer. Class is super well structured, and he considers when it might be more effective to show you example code, then slides, or the slides and then the example code. In general, though Nelson is the one posting Piazza updates, he is simply there in lecture, teaching like he always does.\r\n\r\nI've heard when he is not co-teaching with someone like Nelson, his exams are very difficult, so take that into consideration. He is also very boring. A good majority of my section stopped showing up to either lecture or discussion because of this.", "rating": 4, "expected_grade": "A-", "created": "2018-12-09T01:05:13Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC216", "review": "I had Pedram for 216 and for 132. I think Pedram is a great lecturer and does a good job of explaining concepts. He tries to spend most of his time going over live coding examples as opposed to just reading off of the slides. For 216, Pedram co-taught with Herman so we had Herman's exams and projects. If Pedram is co-teaching definintely take him. However, if Pedram is not co-teaching like he was for my 132 class, his exams are definitely way more difficult, but not impossible. I recommend him!", "rating": 5, "expected_grade": "A", "created": "2018-12-10T17:56:22Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC216", "review": "Very boring. Does not engage the class very well. His voice has a habit of putting half the class to sleep and his lectures do not keep your attention. He goes over concepts pretty well, and his diagrams/drawings in class are helpful at times. When he makes his own exams, he is very pedantic about specific concepts, which is guaranteed to trip up most  students, including those who have a strong grasp of computer science.", "rating": 3, "expected_grade": "A", "created": "2018-12-11T22:44:25Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Great, effective lecturer. He can be boring, but I think that can be overlooked when considering how well he can explain the concepts taught. However, I took this class when Nelson was co-teaching. I'm not sure how well he fares on his own", "rating": 4, "expected_grade": "A+", "created": "2018-12-24T04:54:44Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Very good lecturing. It helped that he was co-lecturing with nelson so I think the exams were easier.", "rating": 4, "expected_grade": "A-", "created": "2019-11-27T20:19:38Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC122", "review": "Terrible teacher. not engaging at all and regurgitates the slides. this was an intro class yet our exam averages were in the 50% range. do not take this unless you absolutely have to", "rating": 1, "expected_grade": "", "created": "2019-12-10T19:06:32Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "His lectures are fine, he sticks closely to the slides and may elaborate with examples. If you understand the slides there's no need to go to class. Pedram is great, super understanding and accommodating whenever I spoke to him. ", "rating": 5, "expected_grade": "A+", "created": "2019-12-19T21:37:49Z"}, {"professor": "Pedram Sadeghian", "course": null, "review": "Fine lecturer", "rating": 4, "expected_grade": "A", "created": "2020-05-03T16:52:37Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "He's pretty monotone when he talks, but he explains things well, and his projects are okay. The quizzes are brutal though.", "rating": 4, "expected_grade": "A", "created": "2020-11-14T17:28:05Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Clear and thorough lecturer. Modified the class (exams/quizzes) to fit online learning well. Nothing really to complain about. (Some people dislike his monotone lecturing style but I think it sounds fine at 2x speed)\r\n\r\nThe TAs really do most of the office hours, grading, synchronous teaching, but that's not a problem because CS TAs are mostly pretty cool.", "rating": 5, "expected_grade": "A+", "created": "2020-11-20T05:12:38Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Great lecturer, gave reasonable workload and challenging but rewarding and thought-provoking tests and projects.  Only small thing is that he didn't exactly go out of his way to show himself on camera or talk to students directly, but overall I can't blame him during a pandemic.  Never felt like his work was busy work and always gave us access to the slides and notes we needed.", "rating": 5, "expected_grade": "A+", "created": "2020-11-29T22:59:42Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Lecturing skills were overall okay. The format, however, was just going over what's next in the course until 50m is up. It felt a bit unorganized and the class felt dry as a whole.", "rating": 4, "expected_grade": "", "created": "2020-12-09T23:27:17Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Pedram's lectures are super boring and monotone, but he is a good professor who explains his concepts very clearly. Watching his lectures on a faster speed is essential. CMSC132 was organized super well online (lectures, slides, and code examples always uploaded), although discussions often felt like a mixed bag because we would often just go over random Java topics that we weren't tested on. Around halfway through the semester, the difficulty of the projects and quizzes/tests (especially quizzes/tests) did spike a lot. You did have 8 hours for every quizz/test, though which was very generous. The first half of the course is pretty laidback 131 review.", "rating": 4, "expected_grade": "A", "created": "2020-12-18T04:06:39Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Extremely difficult exams. ", "rating": 2, "expected_grade": "B", "created": "2020-12-18T18:30:28Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC122", "review": "His lectures are fine, but can be unbearably slow and monotone. Tests and quizzes were OK as long as you kept up with your lectures. He didn't really interact with students much, but the class was fully online so I can't say that I expected anything different. ", "rating": 4, "expected_grade": "B+", "created": "2020-12-21T19:04:56Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "I took this course in Fall 2019\r\n\r\nPros:\r\n+ Competent and informative lecturer. A lot of people say he's boring, but I honestly disagree, he makes extensive use of example code to ensure students understand what's going on.\r\n+ Projects are good applications of what you are learning.\r\n+ Tests are fair.", "rating": 5, "expected_grade": "A+", "created": "2020-12-22T01:17:19Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Had him for online semester. The lectures were pretty slow but he definitely knew what he was talking about. The exams were a bit tougher than usual but I do feel that they were fair. ", "rating": 4, "expected_grade": "A", "created": "2020-12-23T23:22:53Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "His exams are extremely difficult and take nearly 8 hours to complete. Although he may brush over exam concepts in lecture, he doesn’t provide any examples of how to actually use the concepts. If you do not have programming experience before college, good luck. ", "rating": 1, "expected_grade": "", "created": "2021-01-09T14:22:41Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC122", "review": "Lectures are on the boring side but the course was run will completely remote. The exams were mental difficulty because they were take home. The three midterms were supposed to take 1 hour but they took me 3-5 hours.", "rating": 4, "expected_grade": "A+", "created": "2021-01-11T22:21:59Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Exams were extremely hard, had to spend almost the entire day on them. He was a fine lecturer considering the asynchronous nature of the class.  ", "rating": 4, "expected_grade": "A+", "created": "2021-01-12T16:22:27Z"}, {"professor": "Pedram Sadeghian", "course": null, "review": "I don't know why everyone keeps giving him 4+ stars even though the consensus is that his exams are really hard? Unless you're a super coder (coded before) or this is your only hard class,  don't take this guy. His lectures a dry, his midterms are BRUTAL and he barely curves. Especially for online, he makes the exams 10x harder than previous years, which would be fine if he curved each exam or curved the class more than like 1%, which he doesn't", "rating": 2, "expected_grade": "", "created": "2021-01-12T20:51:52Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "He sounds like Ben Shapiro if you put his lectures on 1.5x speed but he is very hands off with the online format. You will pretty much only talk to the TAs and there is no live interaction at all with Pedram. His exams weren't that hard imo, but the projects were difficult not because they were hard to implement but because it was difficult to understand what needed to be implemented from the instructions. I've had bettter CS teachers and I've had worse. Decent.", "rating": 4, "expected_grade": "A+", "created": "2021-01-19T17:35:52Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Took this class Fall 2020. Pedram is a good lecturer. He might be a little boring, but he runs through plenty of examples and is very clear. The online exams are very fair, not very difficult but a little time-consuming. Start on them early and you can definitely finish in the allotted time. ", "rating": 4, "expected_grade": "A+", "created": "2021-05-11T22:40:19Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Pedram's lectures are slow but he explains things really well. His exams are super challenging though, and they cost me big time.\r\nI wish I had some prior knowledge of data structures before I took this class with Pedram because I quickly got overwhelmed by so much new material.\r\nIf you have some previous knowledge though, I don't think the class will be too bad for you.", "rating": 4, "expected_grade": "B", "created": "2021-05-23T13:57:48Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC122", "review": "His lectures can be a bit dry, and it's a little bit of a struggle to pay attention sometimes, but that's totally not his fault. He's a really informative lecturer and all the examples he does in class are great for helping to illustrate the concepts. The projects are pretty fun, and he gives plenty of time for you to work on them. The quizzes and tests are always on exactly what he says they will be -- no surprises there. If you study (do the worksheets he posts!) you'll be fine. The TAs were great, and Pedram says he's always pretty picky about who he lets TA his courses, so I trust that it would be the same in other semesters. This was the first coding class I've ever taken and it was my favorite this semester. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-06T02:06:52Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "I took 131 with no coding experience during Spring 21 sem. His class was extremely difficult for me because of the difference in content covered on exams vs in the lectures. Projects and exams took me all day and I struggled really hard with this class. You won't interact with him at all so be prepared to teach yourself and always attend discussion.", "rating": 1, "expected_grade": "A+", "created": "2021-12-06T20:41:11Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Took 131 with him (with zero coding experience) which was brutal, figured the online nature of it made it harder and gave him another short in person. It was pretty much just as brutal, his exams and quizzes are horribly written and super unclear. He gives practice exams but they are absolutely nothing like what the actual exam will be like. If you haven’t coded in highschool don’t even bother.", "rating": 1, "expected_grade": "C", "created": "2021-12-15T02:57:17Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Great guy, but I'll be the first to admit that his lectures are dry and his voice is very monotone. I think the difficulty and projects are fair. The TAs he has more than make up for any gaps due to Pedram, honestly the best TAs out of any class I've taken. Quizzes and tests were fair, I don't know what these people are talking about when they said the practice was nothing like the actual exam (obviously he has to change it up from the practice somehow). Only time where this was especially evident was studying for the final since there was legitimately no resources to help practice, but it's due to the CS department not Pedram specifically I believe. Overall, not the worst option, but for sure not the best for 132.", "rating": 3, "expected_grade": "A", "created": "2021-12-18T17:57:32Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Pedram was a good person to take CMSC132 with. He and the TAs worked hard to make the class a good experience, and it showed. There were a lot of projects, sure, but Pedram's lectures and positive attitude made the class more enjoyable. A little boring during some of the lectures, but still good.", "rating": 3, "expected_grade": "B", "created": "2022-01-23T00:07:55Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Had him Fall 2020.\r\nAs other reviews state, his lectures are incredibly dry, but informative. He drones on even at 2x speed. The class is structured well. Projects, exams, and grading are all pretty fair. The third exam was absolutely brutal though. Still, if you keep up with everything (and practice advanced recursion) you'll be fine. Didn't interact with students much if at all, I'm still not even sure what he looks like.\r\nA remarkably average, bland professor.", "rating": 3, "expected_grade": "B", "created": "2022-04-22T02:30:10Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Horrible. No help for students who are behind though attending all lectures. Terrible at responding to students with legitimate problems understanding and doesn't care for the improvement of students. No help from him. Terrible at conveying topics and concepts to students. TA office hours are your best bet at understanding anything. Teach yourself or suffer the consequences.", "rating": 1, "expected_grade": "", "created": "2022-04-25T23:54:16Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "He is ... ok! That is the best thing I can say in terms of lecturing. He is a very nice man, incredibly receptive to any questions and very flexible with extensions regarding religious holidays. He is a bit monotone but thats honestly fine. His TAs were good - when they actually showed up to office hours or discussion sections. The projects were fine with the exception of a few and the DS/A part of the course was a nice introduction to it. I recommend if you already have familiarity with programming and data structures, Fawzi would be better teaching you from the ground up if you wanted something more comprehensive. ", "rating": 4, "expected_grade": "", "created": "2022-05-02T19:33:47Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "TLDR: boring lectures, hard projects, but nice guy.\r\n\r\nIt me say that if you know what to expect he's not so bad however my first time with him was a bit of a headace.\r\n\r\nHe said his class is beginner friendly which i don't think is true.\r\n(I had a semester of computer science classes at a community college)\r\n\r\nUsing eclipse for the first time was a bit tricky. I wish he had spent more time explaining.\r\nHis projects were a bit on the hard side.\r\n\r\nI often found the descriptions long and vague. things have to be done in a certain way to test certain skills.\r\n\r\nHis exams were a fair although is online exams were just mini projects which were a pain.\r\n\r\nIf you understand the topics then the projects aren't so bad, if you don't you could spend several hours struggling.", "rating": 2, "expected_grade": "B", "created": "2022-05-09T01:27:07Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Is he the best lecturer out there? Probably not. But Pedram is an extremely effective lecturer who teaches very clearly if you put in the work required. Starting projects on time, studying properly will make this class very feasible. His exams are extremely fair and his prep/schedule helps you succeed a lot. He's also a great guy who truly cares about his students... happy to have had him for my intro CS course. ", "rating": 4, "expected_grade": "", "created": "2022-05-13T18:44:01Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Pedrams lectures are very boring, his project descriptions are extremely vague and hard to follow, and his exams are somewhat difficult. In addition, there was plenty of content on the final exam that he only mentioned briefly in class but never went in depth about. He isn't the worst choice, but definitely not great.", "rating": 2, "expected_grade": "B", "created": "2022-05-16T02:49:03Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Pedram's exams and quizzes are extremely fair. In particular, his TA's this semester were exceptional. Some advice: start the projects THE DAY THEY ARE ASSIGNED and JOIN A STUDY GROUP!! Overall I had a much better experience taking CMSC131 with him this spring than I had taking CMSC131 with Fawzi in the fall. ", "rating": 5, "expected_grade": "B-", "created": "2022-05-20T00:33:52Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "I really enjoyed having Pedram for 132 this semester. Lectures were really helpful and material was interesting. Projects weren't too difficult when started early, and quizzes felt honestly somewhat easy. However, I will note that this semester he co-taught 132 with Nelson, so I can't speak to his class when it's not cotaught. Very nice and approachable as well, would definitely recommend.", "rating": 5, "expected_grade": "A-", "created": "2022-05-21T18:58:41Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "I understand why he's rated the lowest compared to all the other professors, but he isn't too bad. If he's the only one available, you should be fine.", "rating": 3, "expected_grade": "C", "created": "2022-05-25T23:18:54Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "High quality lecturer, posts lecture videos to Panopto. He explains the important concepts in detail. He explains code visually using drawings, which made sense for me since I am a visual learner. \r\n\r\nExams are fair and are reflective of the material he emphasizes in both lecture and discussion. A few days before the exam he will give the topics and hints, write them down. If you can do the practice exams and worksheets, you should be fine. There are some tricks, but you can prepare for these by doing the practice material.", "rating": 5, "expected_grade": "A+", "created": "2022-07-11T15:41:17Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "I struggled a bit with 131 as it was my first time coding so I was nervous going into 132 knowing it would be more difficult and cover far more complex topics. I thought Pedram did a great job explaining it and his code examples helped me learn it pretty seamlessly. I had to put way more time into the projects but it paid off because they were instrumental in how well I was able to understand concepts. He was also very helpful in the Q&A sessions and reviewed all the important material that we needed to know for tests and projects. Very great option in my opinion. ", "rating": 5, "expected_grade": "B+", "created": "2022-08-07T19:15:34Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Pedram was an excellent lecturer. Slides are very organized, great code examples, good explainer, provides ample context for programming practices, concepts, principles etc. Posts lecture videos to Panopto, which are exactly like in-person lectures. Projects are very well constructed, and if you start them early and put effort into them, you'll enjoy and gain A LOT from them. Pedram's TAs this semester were also excellent, very helpful. Make use of Piazza; even if not asking questions, make sure to read it regularly to hear useful discussion and tips for the current project or upcoming exam.\r\n\r\nNot the most captivating lecturer, but certainly one of the best explainers.", "rating": 4, "expected_grade": "A-", "created": "2022-12-16T18:59:33.673427Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Had Pedram for 131 and 132, very solid experience. Exams are challenging but not unfair. Best way to prepare is to use the practice exams.", "rating": 5, "expected_grade": "A", "created": "2022-12-21T21:41:55.371895Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Pedram is not a good Java lecturer to say the least.  Besides Java having particularly poor design for some elements, his lectures in the first half of the course weren't all too useful: particularly regarding generics.  However, he's a pretty decent data structures lecturer.  He usually draws out the concepts in conjunction with reading the slides.  The provided material was top-notch, and some of the TAs' contributions made it even better.  The exams are challenging but not overwhelming (the vocab stuff can be pretty obscure sometimes, but that's to be expected).  I would recommend this professor, but not overwhelmingly.", "rating": 3, "expected_grade": "A", "created": "2022-12-23T03:45:38.493661Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Pedram’s lecturing style is good overall. He’s a bit of a slow talker, but he does an excellent job of drawing out visually how each data structure/algorithm works. He records every lecture and posts it on Panopto, so if you need to skip class you can just watch the recording. \r\n\r\nQuizzes and exams were fair. Pedram makes old assessments available as practice, which are definitely worthwhile to do. For exams, he also gives a summary of what’s going to be on it, which is helpful for targeting your study. Additionally, Pedram is a fan of remixing questions which have appeared earlier on quizzes/exams or elsewhere in the practice.\r\n\r\nProjects were my favorite part of the course. The project descriptions, public tests, and questions posted to Piazza are sufficient to get a full understanding of the project. As long as you complete them and do a decent job, they’re an easy A. It was doable but stressful for me to do most of the projects in the 48 hours before they’re due.\r\n\r\nHis TAs were uniformly of high quality and a great resource during office hours. Pedram himself is a little harder to reach: his office hours are by appointment only.", "rating": 4, "expected_grade": "A", "created": "2022-12-23T05:34:10.420169Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Pedram is a good professor and very accommodating too. But one thing that makes his class stand out the most compared to others are his TA's. His class has one of the best groups of TA's ive ever encountered. Matthew, Sandeep, Alec, Brian, Daniel, Jason, Alexis, Gabriel and Syed do an amazing job at assessing to students needs and helping them with what ever problem they encounter. Helping and educating them in the process too. Projects are reasonable, exams are fair, and the final was nothing out of the ordinary. Definitely a class you could get an A in if you put in the effort.", "rating": 4, "expected_grade": "", "created": "2022-12-24T04:46:34.866452Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Pedram is a great professor and was good for my first CS class here at UMD. He always recorded lectures so you could go back after or if you weren't in class. Was also super responsive to emails and agreed to meet with me early in the semester when I felt I wasn't doing as well as I could be. Exams were very fair and he gave good specifications beforehand so you knew which subjects to focus on. Everything was very well organized and well put together and the TA team for my semester was amazing.", "rating": 5, "expected_grade": "A", "created": "2022-12-26T18:46:37.308164Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Solid professor. Some of the practice exams don't reflect what the actual test has format wise but you get 3 years of practice for each test and quiz. Lectures make you want to fall asleep but solid at explaining and records all of his lectures. Just go to office hours for any project you're struggling with and they'll help you out.", "rating": 5, "expected_grade": "A+", "created": "2022-12-30T17:51:10.467366Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Does his job of making both CMSC131 and CMSC132 weed out classes.", "rating": 4, "expected_grade": "C+", "created": "2023-01-11T01:38:08.296706Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Horrible lectures. Does not care about his students and absolutely rude.", "rating": 1, "expected_grade": "B", "created": "2023-04-04T15:39:11.038704Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Pedram was pretty good for 131. Lectures are the cure to insomnia. Pedram has a very monotone voice and speaks very, very slow. However, when I managed to stay awake I found his lectures to be really helpful and informative.  As someone who has never programmed before his class, I can say that I was able to learn a lot from his lectures. I also liked that he recorded his lectures.\r\nI'm taking off a star because his exams were very hard for a 100 level class (averages in the low 60s), and he says that he doesn't curve. But if you want to challenge yourself with a professor who is a dry but effective lecturer, I would recommend Pedram.", "rating": 4, "expected_grade": "B+", "created": "2023-05-03T00:29:15.433337Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "I had Pedram for 131 and 132. He has the most monotone voice and he talks really slow. Sometimes he contradicts what he says. However, I recommend you watch every single lecture just to prepare especially for the final. I also recommend watching youtube videos on all of the topics he teaches. His projects were medium-hard. Just camp out at office hours and they will help you A LOT. You CANNOT memorize the practice exams. You HAVE to actually understand it because his exams are really open ended. It is vital that you understand the content and do a bunch of practice problems until you get them right. Pedram tries to redirect everything to a TA so sometimes contacting him is pointless unless its for grade issues.", "rating": 4, "expected_grade": "C-", "created": "2023-05-15T00:49:18.251923Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Okay, so Pedrem is a great guy. Here's a breakdown\r\nLecture: He records lectures (yay!) and he is very organized with his schedule, his tas are great! The discussions are good for a review to keep the memory fresh \r\n5 quizzes every two weeks or so: He posts practice worksheets so make sure you do them. it won't be exactly the same but will have the same logic. He tells you what the quizzes are on so you know what to study so make sure you study!\r\n9 Projects: Start early, no like seriously and these go for every cs class. Tip: Go early to office hours so you can have the ta's full attention and not have to fight for it with about 13 other people\r\n3 Exams: So his exams are okay. The averages for the three this semester were 65, 60, and 79 just to give you an idea. The tip I have for this is to work on your static methods and know how to manipulate a variable or array. One thing I LOVE about Peddie is that he gives us the format for what the exam will be and also practice problems which again is not the exact same as the exam but the same logic.  \r\nFinal (25% of your grade :( okay so I literally just took the final yesterday and do the freakin practice problems, crap them if you have to, it is the same logic. \r\nOverall if I had to compare him to the other cs teachers:\r\nPedram > Fawzi (fawzi does not record, and does not post relevant practice problems)\r\nNelson > Pedram (Nelson is known as the best and he usually has high exam averages)\r\nPedram == Elias", "rating": 5, "expected_grade": "B", "created": "2023-05-16T04:25:05.655684Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Okay, so Pedrem is a great guy. Here's a breakdown\r\nLecture: He records lectures (yay!) and he is very organized with his schedule, his tas are great! The discussions are good for a review to keep the memory fresh \r\n5 quizzes every two weeks or so: He posts practice worksheets so make sure you do them. it won't be exactly the same but will have the same logic. He tells you what the quizzes are on so you know what to study so make sure you study!\r\n9 Projects: Start early, no like seriously and these go for every cs class. Tip: Go early to office hours so you can have the ta's full attention and not have to fight for it with about 13 other people\r\n3 Exams: So his exams are okay. The averages for the three this semester were 65, 60, and 79 just to give you an idea. The tip I have for this is to work on your static methods and know how to manipulate a variable or array. One thing I LOVE about Peddie is that he gives us the format for what the exam will be and also practice problems which again is not the exact same as the exam but the same logic.  \r\nFinal (25% of your grade :( okay so I literally just took the final yesterday and do the freakin practice problems, crap them if you have to, it is the same logic. \r\nOverall if I had to compare him to the other cs teachers:\r\nPedram > Fawzi (fawzi does not record, and does not post relevant practice problems)\r\nNelson > Pedram (Nelson is known as the best and he usually has high exam averages)\r\nPedram == Elias", "rating": 5, "expected_grade": "B", "created": "2023-05-16T04:25:07.309403Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "This is a review from someone who has had to retake 131. I had Fawzi Emad for 131 the first time I took it and I got very sick so had a tough time catching up since fawzi does not record his lectures at all and doesn't have proper posted slideshows so had to retake 131. I realized that I had a much better time taking 131 with Pedram as he believes in the importance of recording lectures and posting the detailed slideshows. As a lecturer, I can say Fawzi does a better job in making lectures engaging, but it all doesn't really matter when you cannot really review notes afterwards. Pedram also has practice exams and practice quizzes from previous years which makes it much better to prepare for midterms. He also has three midterms, compared to Fawzi only having 2 midterms, so I would say it is preferable to have three less weighted midterms. This might be an unpopular opinion, but I felt Pedram's midterms were quite easy and fair, especially compared to Fawzi's. Pedram also only had quizzes every couple of weeks, compared to Fawzi having a quiz every week, on very random topics. Where Pedram falls against Fawzi is his projects and their god-awful descriptions. I was able to complete Fawzi's projects much easier and in faster time compared to Pedram's which were unclear many times. TAs can always help out on projects though. Personally, I would say if you had to choose between Fawzi and Pedram, choose Pedram.", "rating": 4, "expected_grade": "A", "created": "2023-05-19T19:04:45.496043Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Pedram did his job well. His lectures may be a little boring, but he gives you everything you need in the course to succeed as long as you put a little bit of effort in on your side. He also records his lectures so if you don't go for some reason, you are able to to watch online.", "rating": 5, "expected_grade": "A", "created": "2023-05-25T03:17:18.978534Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Please Pleaseee don't take this class!!!!\r\nIf you have no prior coding experience this class is going to be extremely difficult for you. The exams are like 10 pages and are very hard. Even the quizzes are hard and I remember one of the quizzes average was 5 out of 30!\r\nHe is also not caring and understanding at all so if you are a late arrival and you ask for an extension on your project he would just say NO and it takes almost two weeks to give you back the project grades so granting an extension isn't a big deal.\r\nSpeaking about projects, I remember everyone crying almost everyday the project was due because of how hard it was.\r\nIf all other professors and classes are full and you HAVE to take this class then be prepared to have a hard time. But if you can choose someone else please stay away from this one. \r\nPeople are waitlisting on other professors' classes and almost most of the seats for this class is open (You take the conclusion)\r\nI had a very very hard time last semester so I'm just telling you my experience and to mention all my other grades were A so I'm not a lazy student. \r\nI wish you the best of luck guys!", "rating": 1, "expected_grade": "", "created": "2023-07-21T16:41:20.283352Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "I would say that Pedram is very helpful when you ask him questions and he tries to make sure that you understand the lecture. I believe he does a good job reviewing the information, but his exams can be a bit difficult if you do not have any prior experience with CS. He does record his lectures so you can always go over the information again.", "rating": 5, "expected_grade": "A", "created": "2023-08-04T04:20:41.031698Z"}, {"professor": "Pedram Sadeghian", "course": null, "review": "hes not very interesting but hes not bad as a professor not as engaging as fawzi or bigger names", "rating": 4, "expected_grade": "", "created": "2023-08-30T21:14:48.975565Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Prof. Sadeghian (he will tell you that you can just call him Pedram) did a good job, given the mass class size for 131 and the amount of material and projects to get through in a couple months. Lecture material is relevant to the projects you’ll be doing and the exams are fair and not stressful to study for if you were paying attention and practicing what you learned by doing the projects. I won’t claim that he was the most engaging or interesting lecturer, and as you might expect for a gigantic class he’s not the easiest to reach either - his army of TAs fill that role.\r\n\r\nWhile there is a of work involved for this class (it is a CS gateway requirement, after all), and it may feel overwhelming if you have no prior Java experience, I do recommend this course and this professor. You will succeed with little to no issue if you: -start the projects THE DAY THEY’RE OUT so you have time to debug or get help if something -always attend discussion if possible; the info there is often relevant to your projects -take advantage of the TA office hours, and -don’t cheat. If you have a legitimate interest in computer science and programming, you’ll enjoy Pedram’s class.", "rating": 4, "expected_grade": "A", "created": "2023-09-19T16:13:42.400596Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC132", "review": "Easy but dry", "rating": 1, "expected_grade": "A+", "created": "2023-10-16T20:38:04.609152Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Not sure why people seem to give ol' Pedram so much shit. Very informative lectures that go into a lot of detail. If you actually like CS, you will likely find them interesting unless you find his droning voice problematic. IMO, this is a superficial problem, especially given lectures are recorded and can be viewed at 1.5 speed, and the actual content of what he says is valuable. Personally, I found projects, exams, and quizzes extremely easy, with the only issue being getting used to completing exams in a timely fashion. Nelson is definitely more \"entertaining\", and if you find that necessary to pay attention you should chose him, but remember that comes at the cost of constantly going on pointless tangents, and Nelson keeping the explanations more shallow with the use of amusing analogies in place of complete representations.", "rating": 5, "expected_grade": "A+", "created": "2023-11-02T02:11:18.923819Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Underrated professor. This semester, he cotaught 131 with Nelson, so they had the same material, projects, and exams. His lectures are monotone to the point where some students fell asleep. Initially, I found him boring, but as the semester went on, he grew on me. But if you can put his dryness past him and stay focused and alert in class, he is very good at explaining the material. He doesn't waste time and focuses on teaching the content. He also records his lectures. Pedram is generally friendly and very willing to help you during office hours. Pedram & Nelson provide plenty of practice exams from previous years and don't weigh too much. Projects were a good mix of easy and challenging. You're assigned a project during Thanksgiving or spring break, which sucks, and it's probably the most difficult one. \r\nTIP: PLEASE start your projects early and go to TA office hours when you're stuck or want to review material. Although Pedram said this class is geared toward students without coding experience, the class moves fast, and you will struggle if you procrastinate. It's more challenging for students without experience, but it's still very much doable if you do the work.", "rating": 4, "expected_grade": "A-", "created": "2023-12-05T21:36:57.211875Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Pedram is your average CS professor. His lectures are very informative, but incredibly slow. He wants everyone to learn and understand the topics, but  often seems somewhat disorganized or presents uninteresting examples. He would not be my first choice, but is not terrible by any means.", "rating": 3, "expected_grade": "A+", "created": "2023-12-08T17:04:11.271202Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "To all the people that have given him anything below 4 stars, y’all don’t know what you’re saying. The biggest “problem” I’ve seen about Pedram in the lower reviews is that he is monotone, dry, not exciting, etc. Sure, I watched a Nelson lecture, and he had jokes and said funny things in general, but Pedram is the better lecturer. As someone who has never done CS before this class, I feel like I genuinely understand everything he taught us. He explains things SO WELL, and in addition, he draws out what’s happening using memory maps (if you don’t know, they’re basically a tool that helps you visualize what’s happening behind the scenes in code) which helps you understand just so much better (from what I’ve seen, Nelson does not do that). I would come into that 50 minute lecture and feel like I was only in class for 15 min. It’s genuinely incredible how interesting the class was and how fast it moved. And back to the point about him being monotone, if you can’t find the lecture interesting because of that, maybe re evaluate if you should even be in CS. Any subject can be made exciting with a funny professor like Nelson, but if you don’t find the lectures interesting with a “boring” professor, the professor is not the problem. During lecture, he would give us a min or two to discuss with our neighbors and see if we understood, which was also an opportunity to go up to him and ask a question. I only ever came up to him once, and when I did, he was so excited to answer. He knows his stuff and is excited to answer your questions (but his TA’s exist for answering most questions, and the TA’s are good too). However if you do need to email him about excused absences, he’s very prompt. As for exams, I saw another review about how they’re 8-10 pages long, which is true. But the vast majority of the exam is space for you to write your code, and most of the time you don’t even need 1/2 that space, they just give it in case. If you paid attention in lecture and did well on the projects, you’ll do well on the exams. There’s also a resource we have in class called Piazza (essentially a CMSC131 online board) where you can post questions regarding topics and project clarifications. TA’s and other students can respond. You have everything you need to succeed in this class, now you just need to put in time.", "rating": 5, "expected_grade": "A", "created": "2023-12-09T02:36:37.883619Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Class is fairly straightforward, but Pedram will put you to sleep. Would recommend watching recorded lectures at 1.5 times speed, but he regularly forgets to post these. Quizzes and exams are very fair because previous tests are posted, and follow the same structure.", "rating": 3, "expected_grade": "A-", "created": "2023-12-09T02:38:22.187383Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "I had already had two years of experience in coding in Java before taking this class, so this class was easy for me. However, if you have no coding experience then CMSC131 in generally is going to be hard, but I think that Pedram is a great professor to take. He explains the topic so that even people who have never coded before can understand. He records every lecture so if you don't want to go to class you don't have too. Discussions are not required as they just go over the things you learned in lecture. I don't understand why Pedram has a mid rating, I think that he is better then Nelson and you should take him.", "rating": 5, "expected_grade": "A", "created": "2023-12-17T06:39:05.045893Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "He’s a horrendous teacher. Avoid him and Herman.", "rating": 1, "expected_grade": "D", "created": "2023-12-21T16:34:06.325899Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "He's ok at teaching but his lecture style almost puts me to sleep all the time. Not a hard class so it doesn't matter that much though.", "rating": 4, "expected_grade": "A+", "created": "2023-12-21T22:13:04.916256Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "I love my man Pedram he is super-goated, very informative and helpful 10/10", "rating": 5, "expected_grade": "A-", "created": "2023-12-23T05:25:39.159662Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Great professor. Tests weren't too bad and definitely easy to prepare for if you are willing to put in a bit of effort. He gives past exams and a list of test material to study off of. I would take him again in a heart beat.", "rating": 4, "expected_grade": "A+", "created": "2023-12-26T04:35:01.780055Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "The people complaining about Pedram need to understand the frustration of taking other CS professors, i.e. Fawzi Emad, Paul Kline, Larry Herman. As a lecturer yes he isn't exactly the most interesting, but he gives us SOOO much material to succeed. Pedram records lectures, posts slides, gives us practice exams from previous semesters and his exams are much easier. Him, nelson, and elias basically follow the exact same curriculum when teaching their classes. I really don't know why his rating is not over 4 stars when you have teachers like Fawzi, who do not care much about his students well being and doesn't give us any practice material or any material outside of lecture, who has over 4 stars. This review is coming from someone who has taken CMSC131 with both Pedram and Fawzi so I have been able too experience their different styles of teaching, and Pedram's is by far more forgiving and has more intention to get you to succeed, while also understanding the content.", "rating": 5, "expected_grade": "A", "created": "2024-01-06T01:10:46.956986Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Bland and definitely not as \"fun\" as Nelson but gets all the information out in a simple, non complicated way. Lectures are recorded and posted regularly so you don't really have to go to class. Projects are pretty straightforward and instructions/guidelines are thorough. Exams are pretty easy to study for, you're told everything that will be covered and practice exams are provided.", "rating": 4, "expected_grade": "A+", "created": "2024-01-19T00:51:42.640142Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "3.64/5 makes sense, largely influenced by being a drier lecturer than the other 131 options.\r\n\r\nPros:\r\n- uses spaced repetition style of teaching which is great if you pay attention\r\n- despite having 100s of students, remembered my name after having a fairly long conversation with me (personable)\r\n\r\nCon:\r\n- again, not an anecdotal teacher or a comedian. Effective, not entertaining.", "rating": 4, "expected_grade": "A", "created": "2024-01-25T17:34:53.827594Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Ignore the people saying he's not \"fun\". He is there to teach and that's what he does. Never went to his lectures, watched the recordings at 2x speed, and his content was super helpful. The exams are very fair, and there are no surprises on them. Definitely recommend.", "rating": 5, "expected_grade": "A+", "created": "2024-01-31T02:51:36.180685Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC131", "review": "Project instructions suck.", "rating": 1, "expected_grade": "", "created": "2024-02-24T22:19:40.879285Z"}], "name": "Pedram Sadeghian", "slug": "sadeghian"}