{"courses": ["CMSC818B", "CMSC414", "CMSC424", "CMSC818E", "CMSC798", "CMSC436", "CMSC424", "CMSC398B", "CMSC398G", "CMSC424", "CMSC818E", "CMSC412", "CMSC424"], "average_rating": 2.7241, "type": "professor", "reviews": [{"professor": "Peter Keleher", "course": "CMSC424", "review": "A lot of people say he's a douche or a jackass or w/e, so I was a bit worried when the class first started.  In my opinion there's nothing to worry about. Yes, there are times when he gets a little impatient with people, but to me it didn't seem any more extreme than any other professor. His responses on piazza were always curt, but I feel like most professors give super short/curt responses that could be seen as rude when it comes to written communication. \n\r\nAs far as teaching style, he's your average CS prof. Go to class, he pulls up slides and goes through them. He seemed to actually care whether or not students were understanding the material as he would stop and check often if people were keeping up. He would also encourage people  fairly often to ask questions. \n\r\nIn my case, it seemed like any of the few signs there may have been of him not enjoying teaching the class stemmed from the lack of class participation when he would encourage it (which was often) so he would be left talking at us, or there would be a dialogue between only him and a couple students. ", "rating": 3, "expected_grade": "B", "created": "2015-08-20T17:47:00Z"}, {"professor": "Peter Keleher", "course": "CMSC414", "review": "Summary: Very average professor.\n\r\nLecture:\r\nMostly off of power-points which he posts online. Going to class is optional, but questions on the quizzes will sometimes come from things he says during class that are not on the power-points. The actual material was usually very interesting, but there was so much material to cover most of the time we just brushed over topics without really learning how they worked. Taking CMSC456 before this class will give you a slight advantage (very slight).\n\r\nQuizzes:\r\nThere were 3 quizzes which were pretty hard. They are all short answer or diagram drawing. I felt the quizzes would emphasize a random subset of the material covered, so if you are weak on a certain topic and it shows up on the exam you are screwed. On the other hand it could not show up at all and you get lucky.\n\r\nProjects:\r\nThe projects were actually pretty fun as we got to carry out things like buffer overflows, dictionary attacks, and XSS attacks. They also more or less got easier as the semester went on. Languages used were C, Java, and Javascript. He provides resources and examples if you don't know Javascript, I taught myself everything I needed to know for the Javascript coding in less than an hour.\n\r\nFinal:\r\nIt was a little harder than the quizzes I thought. But it is only worth 12% of your grade, which was a weird concept as I am used to it being between 30% and 40%.\n\r\nGrading:\r\n5 projects 11% each\r\n3 quizzes 11% each\r\n1 final worth 12%\n\r\nOverall the material was interesting, but it seemed crammed. I think this would be a good first 400 level course as it gives you a nice overview so you can think about concentrations you would like to focus on in future courses. ", "rating": 3, "expected_grade": "", "created": "2013-12-21T23:15:00Z"}, {"professor": "Peter Keleher", "course": "CMSC216", "review": "Teaches reasonably on the current subjects but makes quizzes ridiculously difficult. Instead of putting the topics we've covered and practiced on the quizzes, he not only puts the most recent material but also the most abstract and picky questions.\r\nProjects were very difficult like any other teacher in 216.\r\nVery full of himself and difficult to approach. If you read all of the readings yourself and start the projects early, it's a manageable class.", "rating": 3, "expected_grade": "", "created": "2012-02-25T23:22:00Z"}, {"professor": "Peter Keleher", "course": null, "review": "Keleher is a knowledgeable professor, but does not seem enthusiastic about teaching students. He reads off slides and sometimes adds in comments.\n\r\nNot the most exciting teacher, and tough, but he gives plenty of practice exams. Sometimes these practice problems are even the actual problems on the exam.", "rating": 3, "expected_grade": "A+", "created": "2011-03-02T00:48:00Z"}, {"professor": "Peter Keleher", "course": null, "review": "He's an okay teacher. He's kind of your typical cs jackass, i asked for help on one project and he told me that it wasn't that difficult and he could do it in 25 minutes. If you bug him for help, he'll help you, just be prepared to feel like an idiot. His lecture slides aren't bad, and if you go to class you should be fine. But be prepared to work a lot. ", "rating": 3, "expected_grade": "C", "created": "2010-10-22T13:23:00Z"}, {"professor": "Peter Keleher", "course": null, "review": "He is an adequate professor. at times it seems that he doesn't try very much with the class though, taking most of the material that he is using to teach directly from the material prepared for the previous semester. It's nice however, that he skips over the specifics that you can look up on you own in order to cover more material.", "rating": 3, "expected_grade": "A", "created": "2010-05-17T22:18:00Z"}, {"professor": "Peter Keleher", "course": "CMSC818E", "review": "He's the most irresponsible professor I have ever seen. Honestly he puts on a project with little specification and ends up changing it over and over for the next week. The deadline is not extended of course so if you started working then sorry you wasted your time.\r\n\r\nAlso he doesn't even know the papers he is making you read so if you have any question then too bad; you won't get an answer.\r\n\r\nCourse was a waste of time I learned nothing.", "rating": 1, "expected_grade": "A", "created": "2019-12-19T19:29:19Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "This is a good class overall, especially in an online setting. The content is definitely relevant and need-to-know, and Keleher is a good and straightforward lecturer - doesn't meander or BS around at all. Some might consider him too curt but I honestly prefer that to a professor that's distracting or all over the place. \r\nSlides are good, although I wish he could post slides before lecture and also record them, but that's mainly to give us incentive to show up to class. \r\nProjects aren't too bad, we have a week to do each and each are worth a good chunk of the grade. Speaking of which, I'm glad that the grade distribution for this class is balanced, so that no one assignment / exam is worth an insane amount (looking at you 351). Exams and quizzes are also fair. \r\nOverall, I'd recommend taking this class with Pete if you can. ", "rating": 4, "expected_grade": "A", "created": "2021-04-01T19:49:31Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "Mediocre prof. Reads of the PowerPoint rather than teaching. Posts quizzes and makes them due before he actually teaches the material. Refuses to post lecture recordings. Projects aren't bad. Very vague on information relating to exams. Pushes students to participate.", "rating": 2, "expected_grade": "A-", "created": "2021-04-13T19:07:54Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "Other than this class being useless, Peter is an awful teacher.  He doesn't record lectures, reads off of slides, and seems to have no passion for teaching the material.  Avoid if you can.", "rating": 3, "expected_grade": "P", "created": "2021-04-28T21:57:16Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "Not a great experience. I took the course while it was online and it was harder for unnecessary reasons. Keleher refused to upload lecture recordings to us so we only had the book and slides. His reasoning being we should be reading the textbook in advance and come to class for clarification, but he never told us the chapters we should be reading. On top of that he was giving us quizzes on material he hadn't taught yet. He justified it by saying that he offered a total of 20 late days for assignments, but that point is kind of moot when you have a hard enough time preparing yourself", "rating": 2, "expected_grade": "P", "created": "2021-05-05T01:11:26Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "Mediocore professor. The lecture and slides are somehow vague and disorganized. But do cares about students' needs. ", "rating": 3, "expected_grade": "A", "created": "2021-05-10T11:53:04Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "I did well in his class but I basically self taught the entire curriculum. The textbook is your friend if you can't get anything from the lectures. He wouldn't upload lecture recordings which I found quite annoying, and spending so much extra time reading the textbook for quizzes on material we didn't even learn in class yet was also quite annoying. The late days, exams, and assignments were fair but the assignments sometimes had vague descriptions. Overall, if you want to take CMSC424 and you have to take it with Peter, do it. I wouldn't avoid him for the sake of avoiding him, but don't expect it to be the best class....", "rating": 2, "expected_grade": "A", "created": "2021-05-11T03:05:54Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "Worst professor I've had at umd. His lectures are boring and useless. He doesn't even upload them and refuses to send them to anyone even if they were sick (although he records them!). His quizzes are due at noon (before lecture) and the material on the quiz is taught after the quiz's deadline (in lecture). He doesn't care about his students and only answers piazza questions selectively. He does not respond to emails and does not make ANY sort of accommodations/exceptions to help his students. Even though I did well in the class, I genuinely believe that he wants students to fail and doesn't give a f**** about them. Do NOT take him for any class!", "rating": 1, "expected_grade": "A", "created": "2021-05-12T20:57:55Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "He's an average professor, but the class was pretty good overall. We had weekly quizzes and project assignments, and we had three exams (no final). The lectures were kinda boring, but the lecture slides were useful and a good resource for studying for exams. The most annoying thing about the class is that the quizzes were based on content that we didn't learn yet, which meant that we had to learn topics ourselves using the textbook. I still think overall the class and the coursework was pretty fair, and the class isn't any better or worse than other 400 level cs classes.", "rating": 3, "expected_grade": "A", "created": "2021-05-13T19:01:04Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "Do not take this professor. If he is the only one available, take the class next semester. Boring lectures, which he recorded but refused to share with anyone. His quizzes tested us on material that had not been taught yet. Also, he is the most difficult person to communicate with. He will only answer piazza posts if he feels like it and his answers will be at most a few words. You have a follow-up question to his 4-word answer? Good luck getting another response. In the syllabus, he says to email him if he does not respond on piazza. I sent him at least 4 emails this semester and he didn't respond to any of them. He really doesn't care about his students and he definitely wasn't there for them during this difficult online semester.", "rating": 1, "expected_grade": "B+", "created": "2021-05-16T21:48:50Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "I don't think Pete is as bad as some of the reviews below state. First, I will say yes, he is not responsive on Piazza, and him not releasing recorded lectures is annoying, along with his refusal to post the slides beforehand. Some quizzes were hard, and he could have released answers sooner to some. The query optimizing part of the class was needlessly difficult and not very useful.\r\nHowever, I thought his lectures were ok- I've definitely seen waaaay worse. His exams were quite easy, with high averages, and were a lot like the quizzes. No final, too, which is a big relief. Projects were also reasonable, and I appreciate that they were worth a lot of the grade. Considering that other classes like CMSC351 and CMSC451 place an undue grade emphasis like 2 exams, this is a major relief. He also gave a total of 20 late days across all assignments, no penalties, which is also great. The content is also very useful to learn, especially in the first half. Like a review below said, if you plan on taking CMSC424 and see Pete is teaching it, you should be fine with him.", "rating": 3, "expected_grade": "A+", "created": "2021-05-18T19:48:31Z"}, {"professor": "Peter Keleher", "course": "CMSC436", "review": "Lectures were very boring, but projects were pretty easy. We didn't really know what was going to be on the test. Not a hard class to get a good grade in however. ", "rating": 3, "expected_grade": "A", "created": "2021-12-01T15:35:33Z"}, {"professor": "Peter Keleher", "course": "CMSC436", "review": "I'm not sure what grade I'm expecting since this was written before the final and the final is worth 20% of our grade so I could end up with a C if I bomb it. The lectures are very boring and aren't recorded. The projects were easy; Only one of the projects took me a long time to do. This class shouldn't take too much of your time so taking it with another project heavy class should be ok. \r\n\r\nThe professor doesn't really listen to students' complaints. For example, someone asked the professor to record the lectures but he said \"no\" because he believed that people would stop coming to class and he also said recording through Panapto was difficult. Doesn't really make sense because only like maybe 20% of students come to class now and he doesn't record lectures so there isn't a difference. Project descriptions were pretty vague and TAs didn't seem to be much help. \r\n\r\nIn general, this class is more of a teach yourself type of a class. I still recommend taking it but maybe not with Keleher. ", "rating": 3, "expected_grade": "A-", "created": "2021-12-13T01:19:03Z"}, {"professor": "Peter Keleher", "course": "CMSC436", "review": "His lectures are pretty boring besides showing off a few demos. Did not want record the class and only posted slides. \r\nOverall, pretty easy class and projects are not too hard. ", "rating": 3, "expected_grade": "A-", "created": "2022-01-23T03:24:36Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "I took this course in Spring 2022\r\n\r\nPros:\r\n+ He really got his act together for the final, after one of the most disastrous midterms I have ever taken. He gave an exact topic breakdown of each question on the final to ensure you knew what was coming.\r\n+ All topics on the first midterm were taught and covered really well. \r\n+ The projects from this part of the course were also really manageable and conveyed the topics taught well.\r\n+ The first midterm as a whole was very fair and manageable\r\n+ Late day policy is extremely generous: 20 no penalty late days shared across all assignments\r\n\r\nCons:\r\n- Everything after the first midterm went to complete shit. Lectures suddenly became extremely dry, and it was hard to know what concepts to focus on and would become important later. Much less people stopped coming.\r\n- Topics in this part of the class were significantly more lower level and seemed to have less relevance to what you might be asked to do in real life\r\n- The second midterm went poorly as a result of this, with no one knowing how to answer the questions or having a good grasp on the topics\r\n- Projects in the later half of the course were exclusively instructor written but had almost no documentation. Since they were in Python, it was impossible to know what each function was asking for and was returning. This made coding the projects nigh impossible\r\n- Oftentimes, concepts were taught AFTER the weekly quiz corresponding to that topic was due, with the idea being you would use a late day. While the late day policy is generous, it contributed to an environment that encouraged hard quizzes, with the expectation that you would simply turn it in late after lecture", "rating": 3, "expected_grade": "B+", "created": "2022-05-21T21:13:39Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "Organization of the course was good, weekly quizzes covered content taught in the past two weeks or so, outlines for exam content were specific and exams were pretty similar to the provided sample exams and representative of the content taught/quizzes provided. I thought about 70-80% of the content in this class was pretty applicable to real life, the first 6 weeks focus on SQL and E/R diagrams/schema design. The rest of the course goes farther into indexes, query planning/optimization and more \"under the hood\" stuff about how databases work, which is still applicable although sometimes it felt we spent a lot of time studying one very protocol/algorithm that is only sometimes utilized in real life.\r\n\r\nAlso thought the projects in this class were fair. There's about one every week or two and they're fairly focused on one specific topic, meaning once you understand what you're doing they go by pretty quickly. \r\n\r\nThe reason for 3 stars is because mostly of the lectures/slides. There were more than a few times the slides were outdated and incorrect. The slides are also ambiguous and sometime difficult to understand/follow along. I also felt as if the lectures weren't very helpful, I still went to all of them but found myself needing to teach myself a lot of the content using the slides/textbook (the textbook is really good btw). The TAs are helpful and they had plenty of office hours, although the professor had no dedicated office hours. TAs/professor were pretty responsive on Piazza.\r\n\r\nOverall I'd recommend mostly for the usefulness of the content. From reading other reviews it sounds like this semester was a lot better than previous ones.", "rating": 3, "expected_grade": "A", "created": "2022-12-12T18:39:55.092227Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "I had an amazing experience in CMSC424 with Prof Keleher. I think many of the 1-2 star reviews judge Keleher a little too negatively. I liked this class and the way Keleher taught it.\r\n\r\nPros:\r\n1) Keleher actively responds to Piazza posts and answers student questions in office hours and is very understanding if you communicate with him proactively\r\n2) Weekly lecture quizzes had questions and solutions that helped prepare for the exams and final\r\n3) Assignments were well-explained  and not too difficult to implement\r\n4) He posted practice exams with problems, detailed answer keys, and topic lists to prepare\r\n5) He answered questions in lecture and recommends good resources and sections in the textbook\r\n6) TAs are responsive and had both online/in-person OH and responded to my Piazza questions quickly and private posts\r\n7) Cutoffs for the overall grades were pretty generous\r\n8) Well organized, good logistics and regular announcements on Piazza\r\n9) Topics covered in class are very applicable to real-life database engineering\r\n\r\nCons:\r\n1) Doesn’t record lectures which I found a little challenging at times as hearing his personal commentary would have helped supplement my understanding of the material\r\n\r\nOther than that, this was an excellent course that I learned a lot from and I would definitely recommend taking it with Keleher.", "rating": 5, "expected_grade": "B+", "created": "2022-12-17T18:32:48.165751Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "Very poor expirence overall. He read of lecture slides never goes into detail. His exam and quiz often have content not covered in lecture, it is difficult to find examples relating to questions. This projects are often confusing  and structures of objects are unclear. \r\nGiving him some credit he often gives extensions and review material. You'll spend alot of time teaching yourself. The textbook has a lot of good information but is often hard to follow. Not the worst professsor ever but generally avoid.", "rating": 2, "expected_grade": "C", "created": "2023-12-01T03:40:38.887830Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "Peter is a suitable lecturer. I do wish he would record his lectures or get a microphone (it was sometimes difficult to hear in class). The lectures were a deluge of information, most of which is not needed for an exam, but is probably useful if you really want to take all of this database stuff to heart. I found it difficult to know what was going to be tested before the exam. The content itself is tough following the latter half of the class, where it leaves the realm of using databases and enters the realm of hardware and how databases themselves work.\r\n\r\nA NOTE: This class is not just about using or setting up databases! A lot of the class is digging into the nitty gritty about how different parts of a database works. I definitely got in over my head on this one.", "rating": 3, "expected_grade": "B-", "created": "2023-12-05T20:07:44.588854Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "Despite the slides being mediocre and the 12 quizzes being a bit tedious, the class was low-stress. His exams are very easy and he gives tons of past material.  He is also responsive on piazza and answers questions during office hours, and projects are easy. He even tells you what is on the exam and what topics you can expect, so he's very generous in this aspect. The TAs on the other hand are a tossup though and most are not helpful. They also do not answer questions properly. Make sure you read the textbook to learn. There’s a lot to read but the material isn’t anything analytically intensive. It’s just textbook and conceptual memorization. I’d recommend him for sure.", "rating": 5, "expected_grade": "A+", "created": "2023-12-16T22:05:21.179809Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "He could be the worst professor in the entire CS department. Boring lectures, useless slides, and generally dishonest. He promised a curve for the class in the very first lecture and completely ignored it. He also reiterated that there would be a curve before taking the final, saying last semester's A- was about an 86 and that this semester would be similar. He then gave no partial credit on the final and the A- was a HARD 90 (89.9 does not go). Awful professor, communicator, and generally dishonest. AVOID HIS CLASS AT ALL COSTS", "rating": 1, "expected_grade": "B+", "created": "2023-12-20T18:42:10.664038Z"}, {"professor": "Peter Keleher", "course": "CMSC424", "review": "Very bad lecturer. He simply reads off slides and does not record lectures either. You will have to teach yourself the whole class. Assignments are not explained well and some are difficult to implement. Exams all had huge standard deviations. These exams and weekly quizzes have lots of material not covered in class, which you are expected to teach yourself from the textbook. Some of the material expected for you to learn is not even covered in the textbook and lots of the material in the textbook is very confusing.", "rating": 2, "expected_grade": "C", "created": "2023-12-24T03:48:51.531980Z"}, {"professor": "Peter Keleher", "course": "CMSC818E", "review": "Did you think the exams or other major assignments were fair?\r\nSomewhat, projects were fair, in the sense they were (for the most part) manageable. They were, however, very independent. We had to learn the tools and technologies on our own. We only had high level concept discussion of the project in class. This created difficulties with debugging the gRPC code and goroutine concurrent code since we had no experience/lecture on this and no office hours. \r\n---\r\nDid you think the professor had reasonable expectations of the students in the course overall?\r\nExpectations were somewhat reasonable. Come to class having read the paper and done a blog post. Start projects early and ask for help as needed. The RAFT consensus algorithm felt unreasonable. He linked the paper and asked us to implement it. There was minimal help or scaffolding for this one.\r\n---\r\nWere you a fan of the professor's teaching style?\r\nPete’s guiding philosophy is to learn by doing. 80% of the grade came from projects. There were 6 main projects plus part of the final was a project. The projects are in Go and use gRPC. \r\nDuring class, Pete read docs with key points of each paper. The lectures weren’t as helpful because they were not as structured and lacked examples and exercises to deepen understanding. It was too high level, especially having just read the paper. The last 4-5 weeks are student presentations of papers. \r\n---\r\nWas the workload appropriate for the number of credits?\r\nProjects were on the heavier side. First couple projects took 5-10 hours, but the last few took 10-20 hours (anti-entropy and RAFT consensus especially). When this was combined with reading two papers before each class also took 1-3 hours each week, the workload got quite heavy. I felt like I wasn’t doing justice to the papers I read… I wish there were fewer but more in depth papers.\r\n---\r\nWas this course a waste of time or was it beneficial in some way?\r\nI thought this course’s projects were beneficial. Projects are super relevant to distributed systems. Go and gRPC are marketable skills. I had the opportunity to present verbally for 20-25 minutes. \r\n---\r\nHow much support were you given throughout the semester (office hours, extra resources, etc.)?\r\nPete was responsive over email and Piazza. He would have terse replies. He was willing to download your code and help you locate the bug. \r\nOne time, I was stuck on a project and asked for office hours. He answered every other Piazza post except for my request for office hours. Minimal office hours.\r\n---\r\nTLDR: I think the projects of this class are worth it if you’re interested in distributed systems. They’re complex covering topics such as data chunking and blobstore, server client in gRPC, crypto signing and verification, anti-entropy, fault tolerance consensus, and transactions on a shared log. I will say the projects are largely unrelated to lecture, so you’ll have to do a lot of independent learning to complete them. The lectures are relevant to system design interviews if you take initiative to develop an intuition for the ideas. I often felt unsupported and wished there were TAs.", "rating": 3, "expected_grade": "A+", "created": "2024-03-07T15:27:14.472021Z"}], "name": "Peter Keleher", "slug": "keleher"}