{"courses": ["ENGL101", "ENGL101A", "ENGL101S", "ENGL272", "ENGL398N", "ENGL393", "ENGL101H", "ENGL393H", "ENGL395", "ENGL398A", "ARHU158V", "ENGL391", "ENGL321", "ENGL246", "ENGL398A", "ENGL257", "ENGL246", "ENGL321", "ENGL257", "ENGL398A"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Peter Witte", "course": "ENGL101", "review": "I took this class over summer session 2. He's a pretty easy grader and seemed like a cool guy.", "rating": 5, "expected_grade": "A", "created": "2020-08-23T21:36:26Z"}, {"professor": "Peter Witte", "course": "ENGL398A", "review": "I really enjoyed this class, probably because Peter was such a great professor. He's super understanding, outlines assignments in a really thorough and helpful way, and conducts peer review so that everyone gets both positive and constructive feedback. I definitely recommend taking this class, especially if you're an artist or enjoy interested in art.", "rating": 5, "expected_grade": "A", "created": "2020-12-02T00:03:14Z"}, {"professor": "Peter Witte", "course": "ARHU158V", "review": "He was very nice at all times. He was a bit clumsy but the course was extremely interesting and he was very encouraging and always had a lot of enthusiasm. The course did have a lot of essays however and two of them were back to back which was a bit annoying. But he was still a cool guy.", "rating": 5, "expected_grade": "A", "created": "2021-12-21T03:36:03Z"}, {"professor": "Peter Witte", "course": "ENGL391", "review": "Professor Witte is like that fun, chill dad everyone just likes. He teaches conversationally, encouraging you to speak (and write) your mind. The course is mostly made up of readings and weekly writing responses, which are about 1 page and again, allow you to say what you want without there being a right answer. And contrary to what Testudo says, the class is asynchronous one day a week and synchronous the other. The live in-person day is a casual class discussion that you’ll genuinely look forward to. Highly recommend Witte. An awesome guy and even better professor.", "rating": 5, "expected_grade": "", "created": "2022-12-08T19:28:57.154837Z"}, {"professor": "Peter Witte", "course": "ENGL257", "review": "Peter Witte is one of the best teachers/professor I've ever had! He is super caring, fun, and chill. His classes were always engaging and fun, never boring. If you have the opportunity to take one of his course, I definitely recommend! There is not much work, other than reading the books he assigns, which are always fun and interesting reads.", "rating": 5, "expected_grade": "A", "created": "2022-12-08T21:58:35.011928Z"}, {"professor": "Peter Witte", "course": "ENGL257", "review": "I adore Peter! He is so down to earth, conversational, and genuinely fun to talk to. ENGL257 felt like more of a book club than an actual class, and I really enjoyed the conversational structure of his class because I was able to read all the books on the syllabus freely without worrying about being quizzed on every small detail. I wish more English professors were like him! The structure of his class is amazing and helps you learn a lot and get a lot overall out of the class without worrying a ton about your grades, especially since there are no quizzes or exams, only essays (which he lets you peer review in class!) I would love to take an English class with him again.", "rating": 5, "expected_grade": "A", "created": "2022-12-08T23:31:48.805056Z"}], "name": "Peter Witte", "slug": "witte"}