{"courses": ["PHYS121", "PHYS375", "PHYS270", "PHYS171", "PHYS779A", "PHYS171H", "PHYS273", "PHYS273H", "PHYS115", "PHYS405", "PHYS172", "PHYS172", "PHYS405", "PHYS410", "PHYS758E", "PHYS172", "PHYS273", "PHYS273H", "PHYS410", "PHYS172", "PHYS273", "PHYS273H", "PHYS758E", "PHYS172", "PHYS273", "PHYS273H", "PHYS758E", "PHYS172", "PHYS273", "PHYS273H"], "average_rating": 3.8636, "type": "professor", "reviews": [{"professor": "Peter Shawhan", "course": "PHYS121", "review": "Beware, his homework is impossible. I would always go to the physics help classroom and spend 3 hours there with other students from this class. However his tests are not bad and he's a nice guy so if you know what he lectures on you will do fine on the tests. ", "rating": 3, "expected_grade": "B", "created": "2015-01-29T15:06:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS121", "review": "Professor Shawhan is a great teacher.  He doesn't do that many problems in class and the homework is difficult but in the end, that's how you learn.  I really came out of this course with a solid understanding of the basic concepts, which is key to doing well on the MCAT.  Take Shawhan!  An A is definitely doable as long as you can follow the textbook, which is pretty good.  He posts all of his notes online after class which is a really big plus.  ", "rating": 4, "expected_grade": "A", "created": "2013-03-02T08:22:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS121", "review": "Shawhan is one of the few professors I've had (in the three years I've been at UMD) that genuinely cares about his students; I would definitely take another class with him.\n\r\nI feel that most of the poor reviews he's gotten are from younger students who are just looking to get an easy A, and fulfill a physics requirement. \n\r\nWhile most of the material is complicated for someone with no exposure to physics, he realizes that 121 is for non-majors, and does everything in his power to make it as painless as possible:\n\r\nHe has a tablet computer which he uses to annotate his lecture slides before posting online, clicker questions are not graded for correctness (despite the fact that they are a large portion of the grade), and he allows for note sheets during exams. \n\r\nHis homeworks can be challenging, but that's the point of the homework; there is an abundance of resources to help with it; the homeworks are very straight forward. \n\r\nAnyone who thinks that Shawhan is not an excellent professor is in for an unpleasant surprise when they take any course beyond freshman level. ", "rating": 5, "expected_grade": "A", "created": "2012-05-16T19:45:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS410", "review": "I've had Prof. Shawhan for two different courses, PHYS171 and PHYS410, and I can say that he is one my most favorite professor I've had here at Maryland. Contrary to what others have said, his exams reflect the lectures/homework really well. I've never been surprised by one of his exams, but that doesn't mean they aren't difficult. He truly does challenge you to think, and not just mechanically produce an answer.\n\r\nHe posts all the notes, which are extremely good by the way, online. Always has tests reviews, weights heavily on homework (which is nice), and truly wants you to understand the material. I feel the people who criticize Prof. Shawhan is because they're bitter about receiving a bad grade in which they probably deserve.  ", "rating": 5, "expected_grade": "", "created": "2012-05-01T19:25:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS410", "review": "Professor Shawhan is pretty good at explaining concepts, has great lecture slides that he writes into a pdf program as he projects it during class, and is quite genuinely EXTREMELY nice.\n\r\nI almost gave a rating of a 4 simply because his lecturing style could still use a bit of work--entertaining student questions is usually good, but occasionally he lets a student go on too long or spends too much time on a small detail. Also, since what he writes into the program he later posts, he tries to be careful about his spelling/etc., which probably takes a minute or two cumulative out of every 50 minute lecture, but not exactly a big deal, so I decided it didn't merit a lower rating.", "rating": 5, "expected_grade": "", "created": "2012-04-20T23:08:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS121", "review": "I wish Dr. Shawhan was teaching 122 because I would take a class taught by him again in a heartbeat! He's a great professor who really does care about his students. While he focuses more on theory, he does go over actual equations in his lectures (as opposed to some professors). His homework is hard, but if you try it and then go to office hours, the TAs will help you. I don't think I ever got more than a point off on homework if I went to the TAs for help. Tests were definitely tricky, but very doable. His final was harder than the semester tests, or maybe just trickier. I got tripped up, and our class exam average was way below other test averages from the semester. He doesn't waste a lot of time on experiments, but when he pulls them out they're a nice way to break up the lecture. He gives clicker questions in lecture, but will give you exceptions if your clicker is broken for that day. He also carries extra clicker batteries with him to class.\n\r\nLabs can be graded a bit harshly. I felt that there wasn't a lot of guidance as to what they really wanted in a lab report. They felt like a waste of time, as did the discussions, which are actually \"tutorials\". ", "rating": 5, "expected_grade": "A-", "created": "2012-02-11T16:37:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS121", "review": "Dr. Shawhan utilizes technology really well and is always open to questions or review.  He assigns a lot of homework, but it keeps you on top of the material.  If you go to office hours, Dr. Shawhan or the TAs help a lot on homework or in general.  I never had physics before this class, but I put in the effort and learned a lot.  Overall, I really enjoyed his class. Tutorial and lab were pointless though.", "rating": 5, "expected_grade": "", "created": "2011-12-11T19:57:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS121", "review": "This class was one of the most stressful classes I've ever taken (that includes orgos I & II). Dr. Shawhan gives a lot of homework every week. While he says it should only take about 1.5hrs/assignment, my study group found that it took us about 4-5 on average. Be prepared to spend a lot of time on this course, and look to do practice problems outside of what he assigns. The test questions are not always things you've seen before. His lectures are heavy on theory, but all the test questions are application questions. In short, this class is a lot of work, and Dr. Shawhan doesn't necessarily make physics easy to learn. If it weren't for my fiance having a masters in aerospace engineering, I would be sunk in this course. ", "rating": 3, "expected_grade": "CB", "created": "2011-11-10T11:45:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS121", "review": "Professor Shawhan is a rare example of a professor who truly cares about his students. He is incredibly passionate about physics and provides you with all of the resources you need to do well. There is a lot of homework and sometimes the lab and tutorial can be pretty pointless, but all in all it is pretty helpful in learning the material. ", "rating": 4, "expected_grade": "", "created": "2011-10-26T18:45:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS121", "review": "It really pains me to have to give this man a bad review. He's honestly a really nice man. I just don't think he understands that this is an INTRO to physics course. This means that a lot of people hadn't seen this material before. He gave weekly homeworks that required at least 3-5 hours of work. And yes you would think that would help you on the exams. However, all of his exams were at least 3 times harder than the homework he gave out. People did so terribly on the exams that he allowed people to redo 2 problems (~8-10% points) so that his curve wasn't so that people who received less than 50% got a C. Each test was worth 10%, homework was worth 20% and clicker questions were worth 10%. That is the ONLY reason why people got B's in this class. Other things besides your exam grade factored in. If you have to take Shawhan, if you get A's on the labs and homeworks and go to every class (for the clicker) and get C's on the exams, you'll get a B for your final grade.\n\r\nLike I said, he's a really nice man. You could tell he was really passionate about physics because he got so excited up there. However, it's in a HUGE lecture hall and he insisted on taking up half of the class time doing experiments that NOONE except the first few rows could see. They often didn't work. \n\r\nIf you have the chance to take someone else, DO IT!", "rating": 2, "expected_grade": "B", "created": "2010-12-21T13:51:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS121", "review": "Sad to say, I agree with the other reviews. People who are just generally good at physics did well in the class. I hadn't seen physics in years so its safe to say it was new to me. He spends lectures going over proofs for the formulas, teaching concepts, and doing demonstrations. But when it came to exam time, it was all calculations of problems. The tests were so hard. He tried really hard to teach us and you can tell that he truly cares that you learn the material. He gave tons of practice problems to do before the exams but they didn't seem to help me at all. \r\nHe gives an A LOT of homework. BY FAR, the most work I have ever done for a class. The reason he's not a good lecturer is because he tries to say too much in such a short period of time. It's way too much to keep up with. It's almost impossible to take notes when he's talking so fast. \r\nIn my opinion, if you have to take Professor Shawhan, just make sure you have the ability to teach yourself from the book. And unless you are just inherently a genius, you shouldn't expect more than a B in this class. ", "rating": 2, "expected_grade": "B", "created": "2010-12-20T16:18:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS121", "review": "Dr. Shawhan is honestly one of the most engaging, enthusiastic, and passionate professors I have had at Maryland, as a junior, I have had a fair share of rotten ones.  He does awesome demonstrations, and explains concepts but also does examples (which always tend to show up on the exams).  The exams are short, 50 points, and he gives you the chance to \"re-do\" problems for more credit, this is his idea of the curve.  It's really not that bad, just find a group of friends to do homework with every week (since it's work like a quarter of your grade and is easy points).  Take good notes, don't bother using the textbook, the online homework and classnotes are perfect for studying.  Relax, and remember he wants to CHALLENGE you to THINK.  Unlike the other rotten Phys professors who ask you to memorize.  Yeah it may suck, but if you plan on succeeding in life, taking the MCAT, or any other test, you're gonna need to know HOW to do physics, not just to memorize an equation, and he teaches you that!  HIGHLY recommended.", "rating": 4, "expected_grade": "A-", "created": "2010-12-18T15:10:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS121", "review": "Professor Shawhan is probably one of the worst teachers I have had at UMD. He is a very nice person, but he cannot teach very well at all. He will teach a lot of concept based information in class, and give completely calculation based exams, without going over examples thoroughly. His tests are very difficult, and although he does curve, it does not help everyone out. If you have a background in physics, and are good at it, then he might be the one for you, but if you are new to the subject, I would avoid him, unless you are very good at teaching yourself out of the book (which still probably won't help you).\n", "rating": 1, "expected_grade": "", "created": "2010-12-07T00:08:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS121", "review": "I would definitely avoid taking Shawhan.  He is very nice guy but is one of the worst professors I've ever had.  I read the textbook, did the homeworks, attended a weekly GSS session, went to every lecture, studied extremely hard for every exam and never got above a C on any exam.  This is because the test questions are 100% unrelated to anything he ever gives you before the exam.  He spends too much class time going over demonstrations but not enough time explaining what the demo should be teaching us so that we can then apply it to physics problems.  His tests do not accurately display your knowledge of the material presented to you.  He does curve every exam but not enough to get you the grade you would like.  ", "rating": 1, "expected_grade": "B", "created": "2010-11-30T00:31:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS410", "review": "Shawhan is a professor that I would recommend avoiding, especially if you are hoping to get an A in the class. While he does curve, it is not the most generous curve. He assigns a LOT of homework, and it is rather difficult to do it since he doesn't do a very good job presenting the material. He is a really nice guy though, and he will often give extensions on assignments if you simply ask for it. This does not make up for the fact that he is awful at presenting material, assigns a lot of homework, and writes very difficult exams because he does not do a good job of assessing the difficulty of his assignments.", "rating": 1, "expected_grade": "", "created": "2010-05-19T20:51:00Z"}, {"professor": "Peter Shawhan", "course": "PHYS171H", "review": "Best lecturer I've ever experienced in both high school and college thus far. Get him if you can. I have no idea why he's rated so low.", "rating": 5, "expected_grade": "A", "created": "2018-12-31T08:09:51Z"}, {"professor": "Peter Shawhan", "course": "PHYS273", "review": "Prof. Shawhan was fantastic. He managed to navigate the switch to online classes relatively seamlessly, and I still feel like I learned a lot in the class and feel ready for next semester.", "rating": 5, "expected_grade": "A", "created": "2020-05-31T17:11:16Z"}, {"professor": "Peter Shawhan", "course": "PHYS273", "review": "Great Lecturer, very organized. Kind and understanding. ", "rating": 5, "expected_grade": "", "created": "2021-05-29T16:13:51Z"}, {"professor": "Peter Shawhan", "course": "PHYS410", "review": "I've had Shawhan for 273 and now 410; he is the nicest and most understanding physics professor I've met, and he made my life a lot less stressful. No lie, both of these classes were difficult and took a bit of time, but I'm pretty sure that'd be true regardless of professor. The great thing about Shawhan is that he will work with you and around your schedule to make things work. I was out sick for a week around midterms, when I came back he was really the only professor that was flexible about makeup times, letting me take the midterm 1.5 weeks later and turn in the homework a week late. I'd email him about missing class or something and he'd be actually concerned and wanting to help out; he genuinely cares about his students and wants to see them achieve.\r\nHe's very organized, records lectures and posts notes, and 410 followed pretty closely with the textbook which made it easier to learn and study outside of class. Homeworks are fair, a lot of practice so sometimes it's a bit tedious just having to do it. He does take attendance ~every other day, but it makes up only 4% of your grade I think. There isn't a lot to say about lectures, if you've made it this far you'll probably get the material (and 410 isn't as bad as other courses like 402); he's an average lecturer but goes through examples in class which is helpful. If it's an intro physics course I can understand the complaints about material going over the head. Overall good professor and love the guy, helped me a ton this semester and I won't forget it", "rating": 5, "expected_grade": "A", "created": "2022-11-01T20:08:16.643929Z"}, {"professor": "Peter Shawhan", "course": "PHYS410", "review": "Truly, one of the best professors I have had for a course. No complaints, no regrets, makes the class fun with all the demos and also really cares about the students learning. Take him for at any cost.", "rating": 5, "expected_grade": "", "created": "2023-05-12T23:57:51.687619Z"}, {"professor": "Peter Shawhan", "course": "PHYS410", "review": "One of the best professors the physics dept has. If you can take him for a course, don't think twice. He is very accommodative, the exams are perfect level of difficulty and he tries to cover all the relevant topics in the right order. He also has a very good distribution of grades.", "rating": 5, "expected_grade": "A", "created": "2023-06-15T20:48:01.853125Z"}, {"professor": "Peter Shawhan", "course": "PHYS273", "review": "If you can get this professor for any physics class at UMD, please take him. He is the probably one of the only professors at this dogshit school who actually cares about you and your well-being both in and out of class.\r\n\r\nPros: Replies to emails at a reasonable time, office hours are helpful, lectures are organized, tests are challenging but reasonable, homework is fine\r\n\r\nCons: N/A", "rating": 5, "expected_grade": "C-", "created": "2023-12-27T20:21:10.710552Z"}], "name": "Peter Shawhan", "slug": "shawhan"}