{"courses": ["HDCC209A", "ENGL101", "ENGL293", "ENGL294", "CMLT280", "HDCC209B", "HDCC209E", "FILM298D", "CINE245", "ENGL245", "HDCC209D", "ENGL245", "HDCC208B", "ENGL290", "HDCC208B", "ENGL256", "AMST260"], "average_rating": 4.0, "type": "professor", "reviews": [{"professor": "Porter Olsen", "course": null, "review": "Good teacher, easy material. Honestly the discussions in class most of them you are able to get through without ever reading the material. It is just common knowledge. However, he has a great personality and keeps you entertained throughout the class. I would recommend him to anyone needing to take an english class.", "rating": 4, "expected_grade": "A", "created": "2010-12-09T22:53:00Z"}, {"professor": "Porter Olsen", "course": "HDCC208B", "review": "Pretty good for a DCC class; although we didn't go over some forms of digital storytelling that I'd hoped we would, I still learned some interesting things. He does give legit (sometimes harsh) feedback when you're doing your project proposals, but that's because he genuinely wants your project to succeed and be interesting.", "rating": 4, "expected_grade": "A", "created": "2019-12-27T16:06:46Z"}, {"professor": "Porter Olsen", "course": "CINE245", "review": "This class was so boring and do not take him if you want your grades to be in quickly. It took him a month and a half to grade the midterm paper. I took this class thinking it would not be much work, but you have to watch a 2 hour movie every week and readings. There are also 2 papers with one of them being 8 pages and a midterm and final. ", "rating": 3, "expected_grade": "", "created": "2022-04-28T14:35:47Z"}, {"professor": "Porter Olsen", "course": "CINE245", "review": "Professor Olsen does care about the material and is knowledgeable, but his execution of explanations falls short sometimes. The class was pretty alright, but I think it could have been better. Definitely not just an easy gen-ed, he treats it like a real cinema/film course. He can be accommodating and willing to listen, but will ultimately be fair. He does grade a bit more harshly than you would imagine for a 2xx level class. He also does take a long time to grade", "rating": 3, "expected_grade": "", "created": "2022-05-14T21:50:47Z"}, {"professor": "Porter Olsen", "course": "CINE245", "review": "Very nice professor, but I don't feel like I learned much. The grading was fair, but the professor is simply not the best lecturer which was frustrating. Also, a lot of people didn't participate because he didn't facilitate participation. Often when someone would participate, he wouldn't say much, so the discussion started and ended with that one person. Exams were easy. He is very accommodating so that was nice. ", "rating": 3, "expected_grade": "", "created": "2022-05-21T15:02:16Z"}, {"professor": "Porter Olsen", "course": "ENGL101S", "review": "Wanted to give five stars especially because he listens and has meaningful discussions with  students. He also gives good feedback on written work.", "rating": 5, "expected_grade": "A", "created": "2022-12-28T04:10:29.656147Z"}, {"professor": "Porter Olsen", "course": "ENGL290", "review": "As long as you keep active in class and keep up with the required topics and reading, you'll actually glean a lot from the class discussions. We had some very insightful discussions about some topics in digital studies. Classwork is relatively straightforward and projects have tons of room for creative freedom.", "rating": 5, "expected_grade": "A+", "created": "2023-08-28T14:06:18.083626Z"}, {"professor": "Porter Olsen", "course": "ENGL101", "review": "Good professor! Always helping and wanting the students to succeed. Class was very simple and helped with understanding what he wanted out of the assignments", "rating": 5, "expected_grade": "A+", "created": "2024-01-23T16:39:06.124076Z"}], "name": "Porter Olsen", "slug": "olsen"}