{"courses": ["NFSC398", "NFSC688", "NFSC422", "NFSC423", "NFSC112", "NFSC633", "NFSC388", "NFSC679P", "NFSC898", "NFSC112", "NFSC388", "NFSC422", "NFSC398", "NFSC633", "NFSC898", "NFSC898", "NFSC112", "NFSC388", "NFSC422", "NFSC398", "NFSC633", "NFSC112", "NFSC388", "NFSC422"], "average_rating": 4.5, "type": "professor", "reviews": [{"professor": "Qin Wang", "course": "NFSC112", "review": "Super chill class, do the study guide slides and you'll get an A easily ", "rating": 5, "expected_grade": "A+", "created": "2021-12-31T18:34:38Z"}, {"professor": "Qin Wang", "course": "NFSC112", "review": "She's alright. Kinda boring since all she does is read from a PowerPoint in a monotone voice. Also, attendance is mandatory even though all powerpoints are available online. Other than that it's not that bad of class.", "rating": 3, "expected_grade": "B+", "created": "2022-12-11T04:16:47.292924Z"}, {"professor": "Qin Wang", "course": "NFSC112", "review": "Very chill class, meets once a week for \"discussion\", but the discussion sections are just presentations made by your classmates. They are mandatory though, and you have to take a quiz after every group presentation that was made by the group. As long as you get a 3/5, you earn full credit for that week. Lectures are asynchronous, and can get pretty confusing when it comes to the different terms and topics that she discusses. GO TO THE EXAM REVIEW SESSIONS, the TA basically lists what is going to be on the exams. There are 3 exams, one group presentation, one group paper, and 10 group assignments. The group work really depends on your group members, and my group was horrible, so I ended up having to do all of the work for the paper, presentation and assignments. Overall, not a bad gen-ed, but there really shouldn't be as much group work as there was.", "rating": 4, "expected_grade": "A", "created": "2022-12-12T01:18:56.307058Z"}, {"professor": "Qin Wang", "course": "NFSC112", "review": "super chill and easy class... lectures are online and only have to attend discussion which is once a week. Assignments in class are exams, homework (group assignment), group presentation and a term paper. Overall a really easy class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-28T23:14:00.298131Z"}, {"professor": "Qin Wang", "course": "NFSC112", "review": "she is a good lecturer, nfsc 112, is \"chill,\" but if you have ADHD or can't stay on top of your work, you will end up like I did and have 7 lecturers to go over the week before your exam...so just know yourself but the facts are cool and the work is easy", "rating": 5, "expected_grade": "A", "created": "2023-11-26T03:16:34.107511Z"}, {"professor": "Qin Wang", "course": "NFSC112", "review": "Easy class. The lectures are asynchronous but you should attend the discussion day for weekly group presentations followed by a short quiz. There is also a group term paper due at the end of the semester that is based off your group presentation but that should be easy if you have good group mates. Make sure to do the weekly homework accurately because they can hurt your grade if you don't follow directions", "rating": 5, "expected_grade": "A", "created": "2023-12-18T06:20:50.981656Z"}], "name": "Qin Wang", "slug": "wang_qin"}