{"courses": ["HONR269X", "PHYS165", "PHYS276", "PHYS171", "PHYS171H", "PHYS798D", "PHYS272", "PHYS272H", "PHYS275", "PHYS272", "PHYS272H", "PHYS272", "PHYS272H", "PHYS260"], "average_rating": 4.7273, "type": "professor", "reviews": [{"professor": "Rajarshi Roy", "course": null, "review": "I loved this seminar!!! Class discussions were thought-provoking and interesting. The workload is very light: a one-page paper is due each week, and there is a final research paper (and 10 minute presentation) on a topic of your choosing that relates to science and religion. Professor Roy is a wonderful teacher who makes class enjoyable by inviting various guest speakers (such as Nobel Laureate Bill Phillips) to come and speak about their views on science and religion. Would highly recommend this seminar!", "rating": 5, "expected_grade": "A+", "created": "2010-07-02T18:06:00Z"}, {"professor": "Rajarshi Roy", "course": null, "review": "this class was such an easy A....readings were assigned every week, but just to discuss during class and you can comment on someone elses comments so reading wasnt necessary....the one page papers due every week took me about a half hour to do and the presentation/paper at the end of the semester is on a topic of your choice and is not a big deal...\r\ngreat easy class!\r\nsuper nice very approachable professor!\r\ni highly recommend it!", "rating": 5, "expected_grade": "A", "created": "2010-03-23T20:00:00Z"}, {"professor": "Rajarshi Roy", "course": null, "review": "One of my favorite professors my freshman year.  Workload for HONR269X consisted of some reading (technically not checked or graded, but very good to at least not look awkward during discussions), and one short paper a week.  The paper always asked for a brief summary of the last reading/presentation while incorporating your own thoughts on the matter.  Professor Roy brings many guest speakers in to talk.  One pet peeve I ran into was that the word \"interesting\" was used all-around the room at least 6 times a day.", "rating": 4, "expected_grade": "", "created": "2009-12-01T11:53:00Z"}, {"professor": "Rajarshi Roy", "course": null, "review": "Great professor, really nice and approachable.  Class structure in a typical week was discussing assigned readings one day and listening to guest lecturers on the other day.  It was beneficial to at least skim the readings for each class because a lot of the class was discussion, but reading the material is definitely manageable.  The final was a paper/presentation on a topic of your choice.  Overall, a good class to take if you don't mind discussion and the subject matter itself.", "rating": 5, "expected_grade": "A", "created": "2009-04-19T23:26:00Z"}, {"professor": "Rajarshi Roy", "course": "PHYS171", "review": "His reviews can get a bit dry sometimes because he reads straight from the book and covers the easy material slowly but the difficult material quickly, but he's a very approachable and nice guy, and he always treats his students with respect.", "rating": 4, "expected_grade": "A", "created": "2019-05-31T00:50:50Z"}, {"professor": "Rajarshi Roy", "course": "PHYS171", "review": "Great & friendly, def recc talking in class bc he's nice and does fun demos", "rating": 5, "expected_grade": "A", "created": "2019-11-16T04:31:10Z"}, {"professor": "Rajarshi Roy", "course": "PHYS272", "review": "Excellent professor, and very kind too. He curved generously and accommodated students' needs.  Be sure to take the homework seriously as it featured heavily in the exams and was used in extra credit \"quizzes.\"", "rating": 5, "expected_grade": "", "created": "2022-01-13T21:42:37Z"}, {"professor": "Rajarshi Roy", "course": "PHYS272", "review": "Professor Raj is the best physics professor I've had YTD. He's a very kind guy, very accommodating, and does fun demonstrations during his lectures. If you just show up to class and do the homework (without putting in much more work), you can easily expect a B in 272. With regard to exams - he has a unique and refreshing take on them. He cares much more that you understand stuff conceptually than he does your ability to plug stuff in or recite formulas. Because of that, all of his exams, quizzes, etc. were open note/textbook/internet. Professor Raj would pick one question from your homework set and offer it as an extra credit quiz every Friday. I cannot stress how awesome of a professor he is.", "rating": 5, "expected_grade": "B+", "created": "2022-12-09T22:39:22.926002Z"}, {"professor": "Rajarshi Roy", "course": "PHYS272", "review": "The most pure human being I have ever met. He truly cares about students and even memorized all our names! His demonstrations are also very fun. The main downside of this class for me was that I pretty much had to teach myself everything. Dr. Roy didn’t do as much barebones teaching of the material, so there were definitely some gaps in learning. His TA was also pretty useless, so I actually ended up learning everything from the textbook, which Dr. Roy made sure was very accessible! Overall I’d recommend his class but be prepared to do some self-teaching.", "rating": 4, "expected_grade": "A", "created": "2022-12-20T20:49:24.151021Z"}, {"professor": "Rajarshi Roy", "course": "PHYS272H", "review": "I agree with everything the previous review said, so instead of reiterating that, I'll just talk about my experience in the Honors version of 272 for anyone who's curious.\r\n\r\nThe only thing that makes this different from the regular 272 class is that we have to research a specific topic related to E&M and eventually write a paper and do a presentation of what we found at the end of the semester. That's it! Every week the Honors group would meet together with Raj and our TA and we would simply share a small summary/report of our new findings that week. The schedule is very flexible and he canceled the meetings the week before a midterm so that we could study. It was a very fun experience where I learned a lot about what I like, and Raj was visibly very supportive of everyone, which was motivating. \r\n\r\nWhether you take Honors or not, Raj would be your best choice for any physics class. He is the kindest and most understanding professor I have ever had as of yet.", "rating": 5, "expected_grade": "B+", "created": "2022-12-20T21:50:45.424648Z"}, {"professor": "Rajarshi Roy", "course": "PHYS260", "review": "TAKE HIM!!! Best physics professor, super sweet and accommodating. His first two exams were open notes and open internet. If you go to his office hours he will spend the time to walk you through the content. I did find his lectures a little confusing and redundant so I mainly learned from the textbook but when he is teaching you can tell he is genuinely passionate about the subject. HIGHLY reccomend!", "rating": 5, "expected_grade": "A-", "created": "2024-04-01T17:46:43.778480Z"}], "name": "Rajarshi Roy", "slug": "roy_rajarshi"}