{"courses": ["ENGL398N", "ARHU158T", "ENGL398N", "ARHU158T", "ENGL398N", "ENGL398N", "ARHU158T", "ENGL398N", "ENGL398N", "ENGL297", "ENGL398N", "ENGL398N", "ENGL497"], "average_rating": 3.4545, "type": "professor", "reviews": [{"professor": "Rebecca Holden", "course": "ENGL398N", "review": "Professor Holden was a great professor I highly recommend her class! \n\r\nAlthough there are assignments due almost every class she returns assignments in a timely manner, with feedback and is always open for discussing work.", "rating": 4, "expected_grade": "B", "created": "2014-01-08T01:45:00Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "Do not take this class. She is a nice enough teacher but not when it comes to grading. She bombards you with so many writing assignments the entire semester that you are writing almost every class. She even takes attendance every class and takes points off for being late. This class took so much of my time. This class sucked.", "rating": 2, "expected_grade": "B", "created": "2013-12-08T22:28:00Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "This is an amazing course, and Professor Holden is an excellent professor. Yes, there is an assignment due nearly every time the class meets. But the assignments build on each other and it makes sense why they are part of the course. Holden is a clear speaker and speaks with purpose in class. I learned a lot of applicable information for future jobs.", "rating": 5, "expected_grade": "A-", "created": "2018-01-02T00:19:22Z"}, {"professor": "Rebecca Holden", "course": "ARHU158T", "review": "She was very nice and helpful. The class was interesting, but the course load was somewhat heavy at times. If you love science fiction, definitely take it. I personally don’t enjoy science fiction but I ended up liking this class. She grades pretty averagely, as long as you do everything on time, participate, and follow the rubrics you will be fine. ", "rating": 4, "expected_grade": "A-", "created": "2020-12-09T03:41:27Z"}, {"professor": "Rebecca Holden", "course": "ARHU158T", "review": "I loved her and she's a great prof, but also an EXTREMELY harsh grader.", "rating": 4, "expected_grade": "B+", "created": "2020-12-14T17:40:58Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "Gives way too much work for a gened", "rating": 3, "expected_grade": "A-", "created": "2021-03-09T23:20:34Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "She is a very nice professor and she is lenient with due dates due to COVID (Not sure how she will be in the future). Obviously, there is a lot of writing in this class but Holden gives ample time to complete the work in my opinion and lays out due dates that help you along the way to each final draft. Very helpful with questions and takes the time to work with each student if you need help.", "rating": 5, "expected_grade": "A", "created": "2022-05-17T15:00:11Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "it's only the third week of class and i already hate it here tbh. holden's a really nice professor but there's just SO MANY assignments, each with super long and complicated instructions that it makes it confusing for me and others with learning disabilities. i've come to dread having to do each assignment that's due almost everyday with inconsistent times. this honestly feels like a high school class but wayyy more work.", "rating": 2, "expected_grade": "", "created": "2023-02-09T04:50:24.640437Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "Don't take this class. It is so much work and she is a strict grader- way too strict for the amount of assignments we have. I am a senior and this class reminded me that some gen eds are just a collection of meaningless assignments. The assignments and their directions have such long instructions it's actually absurd and only serves to stress you out. Emails are way too long as well. I really don't recommend this class in the slightest, and I'm only on week 2. Every assignment that you're graded on is so meaningless it's honestly a little disrespectful...", "rating": 1, "expected_grade": "", "created": "2023-09-08T20:03:45.577921Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "Prof. Holden is a good professor teaching a tough class. She was very friendly and helpful throughout my time in 398N. She does assign a ton of work per week and makes sure you stick to the rubric like glue. If you’re not even the least bit interested in the nonprofit sector, find something different for your professional writing req. However this was not a bad course and if you get cracking on assignments as they’re released, follow the guidelines, and don’t procrastinate, you will be fine. I promise.", "rating": 4, "expected_grade": "A", "created": "2023-09-19T15:45:03.782062Z"}, {"professor": "Rebecca Holden", "course": "ARHU158T", "review": "Pros: Extremely nice, brings food/snacks a lot for us, always accepts assignment extensions as long as you tell her before it's due. If you're not feeling well, you can just go to class on zoom. She also hosts some movie nights where she brings dinner (the class votes on a movie). Overall she creates a welcoming environment, is easy to talk to for help, and is an easy-fair grader.\r\nCons: A lot of readings--these are accompanied by questions but they're not due until classes later, however you still have to read to at least be able to participate in the class discussion the following class. \r\nMore about assignments...\r\nEssays: They're pretty short 2-3 or 3-4 pages. One of them you got the choice to write a essay or a story + your reflection, or let AI make an essay + your reflection. She gives you enough time to complete them because you submit a draft and then do a peer review before it's due. The other essay is on a faculty interview you have to do on someone within ARHU.\r\nGroup Project: You have to lead a student-led discussion with a group\r\nFinal: You have to give a 10-12 minute presentation about a topic of your choosing related to sci-fi and class themes.\r\n\r\nMy last words, some of the assignments might be daunting but the class is really interesting and worth it even if you don't watch/read much sci-fi. The only con is the workload at times.", "rating": 4, "expected_grade": "A", "created": "2023-12-19T22:53:37.350458Z"}], "name": "Rebecca Holden", "slug": "holden_rebecca"}