{"courses": ["HIST289E", "HIST396", "HIST137", "HIST608A", "HONR218X", "HIST200", "HIST189C", "HONR258F", "HIST819N", "HIST408A", "EXST030", "HIST132", "HIST108A", "HIST132C", "HNUH218A", "HIST619C", "HIST219K", "HONR249B", "HIST399", "HNUH218A", "HIST200", "HIST137", "HIST137", "HIST137", "HIST132", "HIST108A", "HIST223", "HIST132", "HIST200", "HNUH218C"], "average_rating": 4.5, "type": "professor", "reviews": [{"professor": "Richard Bell", "course": "HIST396", "review": "Pros: Smart, well-read, accommodating\n\r\nCons: Tough grader, places far too much emphasis on participation, not afraid to showboat (which makes him kind of a pill)", "rating": 2, "expected_grade": "", "created": "2013-06-03T23:52:00Z"}, {"professor": "Richard Bell", "course": null, "review": "Professor Bell is absolutely the best. \n\r\nI needed a core history credit for what was my government major at the time, so I looked up random courses and took 289E solely on Bell's amazing reviews. I have no interest in the American Revolution or early American history in general. \n\r\nBut I am so glad I took that course. Professor Bell could make any course come alive, ANY COURSE, and that's what made 289E one of my favorite classes thus far. Professor Bell and I met a few times and he convinced me to become a history major, which I am today. I took his 156 course this semester. \n\r\nYeah, I have no interest in early American history and I've now taken 2 semesters in a row of it, that covers mostly the same time period. I'd take any class Professor Bell teaches. He gets to know every student's name (in a large lecture hall) and thinks highly of his students and their intellectual capabilities. \n\r\nCannot recommend him enough. ", "rating": 2, "expected_grade": "A", "created": "2011-11-23T15:30:00Z"}, {"professor": "Richard Bell", "course": null, "review": "One of the best teachers I've ever had. Lecture was fun to go to, as he was very funny and engaging. Routinely makes jokes at the expense of students (in a harmless way.) \n\r\nClass itself wasn't too bad. 2 essays, around 5-6 pages each. One on some readings; one involving you going to the Smithsonian (!) to look at some paintings and to write down things about them, and then relate them to the course. Exams were not easy, mainly because the pool of possible IDs was so large. \n\r\nDiscussion was key, participate at least twice a day for full credit. My TA was also good and always helpful (Allison), especially regarding the Smithsonian visit.\n\r\nIf you are looking for an easy A, I do not recommend this class. However, if you are looking to take a class with one of the best professors at Maryland, I highly recommend it.", "rating": 5, "expected_grade": "B", "created": "2011-05-20T10:06:00Z"}, {"professor": "Richard Bell", "course": null, "review": "Looks like I'm the first person to review him for this class. First off, he is a WONDERFUL teacher. His lectures are awesome and engaging. He tells a story every time, and the class material is actually very interesting (note class to left).\n\r\nHowever, I was taking this class as a core, and I would say definitely don't do that if you are looking for an easy A. He only gives out 3 big assignments (3 essays) but they are some of the hardest essays I have ever had to write. They require a lot of research, and a lot of time there is no clear answer to the question, and the TA's standards were not very clear.\n\r\nThe final exam is going to seem impossible (He'll give you a list of 80+ IDs to remember, a possible 8 essay questions, of which he'll pick 5 and 1, repectively), but in reality, it wasn't too bad.\n\r\nAdvice if you are going to take the class: Attending lecture isn't pertinent, but will help you remember things. Take very organized notes, I would recommend typing them, as when he gives you the list of IDs, you can just Control-F to find them for the final.\n\r\nHe has occasional guest speakers; some a re good, others not so much, but this is a new class so I expect it will get better in that regard.\n\r\nOverall, awesome teacher, hard essays, weird grading scale (grades on like a 9 point system instead of 10), seemingly impossible final but just take good notes during the semester and it won't be too bad.", "rating": 4, "expected_grade": "B", "created": "2011-05-17T17:47:00Z"}, {"professor": "Richard Bell", "course": null, "review": "Professor Bell is by far the best professor I've had at Maryland. As mentioned previously, his tests aren't easy but if you go to office hours and do the reading, it will help you a lot.Participation in discussion is key, as it counts as much or more than an exam or assignment.", "rating": 5, "expected_grade": "B+", "created": "2011-01-23T16:27:00Z"}, {"professor": "Richard Bell", "course": null, "review": "I loved Professor Bell. He's hysterical and really made history interesting for me. However, his tests are not easy. You really need to be prepared to spend a lot of time studying because sometimes he chooses really small and insignificant things for ID's and if you don't know them you're kinda screwed. You're grade will depend on your TA though, mine was great. This is not an easy class so be prepared to put in a solid amount of time studying, even though Bell is great.", "rating": 5, "expected_grade": "B+", "created": "2010-12-15T16:33:00Z"}, {"professor": "Richard Bell", "course": null, "review": "Professor Bell is the best professor I've had so far at UMD.  He is a phenomenal lecturer and made the material very interesting.  I also liked that he tried to emphasis social change and the impact of major events as opposed to the repetitive drone about early American wars that many American history teachers turn to.  The class had two papers, a midterm, and a final.  The work was challenging, but very manageable.  My only complaint is that there was a substantial amount of assigned reading for the class (mostly writings by historians or primary sources, but also a novel), although I was able to get away with skimming most of it.  I would definitely recommend taking this class with Professor Bell.", "rating": 5, "expected_grade": "A", "created": "2010-05-11T19:32:00Z"}, {"professor": "Richard Bell", "course": null, "review": "It's already been said, but Professor Bell was excellent for HIST156 and I'm really glad I took his class. The semester was based on two written assignments, a midterm, class participation, and a final. The papers weren't that bad, and for one of them we got to go to the Smithsonian in DC and look at American art which was actually pretty interesting. For the midterm and final we had to identify terms and write and essay, which wasn't too hard because we got study sheets for them. My TA was really cool too, which made discussion actually worth attending. I recommend this class to anyone who wants a fun a interesting semester. ", "rating": 5, "expected_grade": "A", "created": "2009-12-17T02:15:00Z"}, {"professor": "Richard Bell", "course": "HIST428N", "review": "Professor Bell is an excellent professor.  The reason I took this course is because I had him for Hist156 and like him a lot.  He is an excellent lecturer.  It is the only class where I pay full attention the entire lecture. You definitely need to take notes and do the readings because a lot of his grading is based on participation, but in general the readings are not to bad and they are different from what you typically have to read in history classes.  You will truly get a unique experience in this class and it is TOTALLY worth the work you put in.  (Plus he has a very nice british accent and a good sense of humor)", "rating": 5, "expected_grade": "A", "created": "2009-05-11T14:23:00Z"}, {"professor": "Richard Bell", "course": null, "review": "This was an excellent class. Professor Bell's lectures were interesting, informative and fun. The class made history more than an exercise in memorization. Professor regularly threw in interesting side notes, discussed art from the period, and even some relevant economics and sociology, among other things. He has high expectations -- there really is a lot of reading and the grading system does not leave much fudge room since there are so few assignments -- but he is more than fair and with a bit of effort there is no reason for anyone to do poorly. I definitely recommend his class. It's been one of my favorite classes yet.", "rating": 5, "expected_grade": "A+", "created": "2007-11-29T15:51:00Z"}, {"professor": "Richard Bell", "course": null, "review": "Professor Bell is an excellent professor -- he makes American history interesting because while we've all been studying American history since we were about 5, he looks at different aspects of American history instead of just the battles and George Washington. He's funny and is a really great lecturer. The two assignments (papers) he gave us were challenging but definitely doable -- and he's a really fair grader. There's a lot of reading but in my discussion you can get by with doing parts and skimming. The exams weren't hard either. Basically if you go to lecture and do some/most of the readings you will do well in the class.", "rating": 5, "expected_grade": "A", "created": "2007-11-20T21:38:00Z"}, {"professor": "Richard Bell", "course": "HIST200", "review": "Bell is awesome. The class atmosphere is fun and his lectures are interesting. He knows his stuff and is a great guy. The class though stinks. A lot of reading, two difficult essays and a big final. He is awesome though and almost makes the class worthwhile. If you like history, this is the class for you. If you want an easy A, this is not. ", "rating": 5, "expected_grade": "", "created": "2019-12-13T07:43:30Z"}, {"professor": "Richard Bell", "course": "HNUH218A", "review": "Pros: Very good lecturer, he's engaging and interesting, if you like history. You actually learn a lot.\r\nCons: The papers and discussions just suck. There's 3 papers that you have to write, and all of them require you to use at least 15 primary sources from newspapers. No online resources allowed. You can use lecture slides and discussion readings though. Discussion section participation is also a quarter of your grade, and the readings are usually very long (10+ pages).", "rating": 3, "expected_grade": "B-", "created": "2020-11-15T07:08:54Z"}, {"professor": "Richard Bell", "course": "HNUH218A", "review": "Professor Bell is great. He's very engaging. The papers and discussion sections are pretty chill. The graduate TA that grades the papers is pretty chill. The sources that you are stuck on using are difficult to use since it's pretty much all primary sources or the slides. After the first paper, the others should not be so difficult.", "rating": 5, "expected_grade": "A", "created": "2020-12-15T03:35:05Z"}, {"professor": "Richard Bell", "course": "HNUH218A", "review": "Professor Bell is hands down one of the best lecturers I've ever had. His lectures are well prepared and thorough and engaging. The workload is probably what you would expect from an honors course, and it was very much appropriate in my opinion. The first paper might have a steep learning curve for some as far as finding and analyzing appropriate and adequate sources, but the subsequent papers felt more comfortable to me. readings can sometimes be a headache, but the discussions are chill and as long as you actively participate a few times each meeting you'll be fine. The TA was very fair and not harsh in grading. Professor Bell overall clearly cares about his students.", "rating": 5, "expected_grade": "A", "created": "2021-01-14T02:57:25Z"}, {"professor": "Richard Bell", "course": "HNUH218A", "review": "Rick is a very talented lecturer. They feel more like story times than anything; he does a great job telling narratives of whatever concept you learn about. However, his assignments for HNUH218A could be so much better. There were 4 papers in total, two of them requiring ~15 newspaper sources. These were extremely draining and difficult to write. Other than his assignments, Bell is a really cool guy.", "rating": 4, "expected_grade": "A-", "created": "2021-06-02T01:16:58Z"}, {"professor": "Richard Bell", "course": "HNUH218A", "review": "Big Rick is undoubtedly one of the best lecturers I've ever had. Each of his classes was clearly well planned out, engaging, and surprisingly enjoyable. With any other professor I'm sure I would've had trouble staying awake in this 9am class, but Bell made it easy. As others have pointed out, there is a fair amount of reading in this course—around 30 pages or so a week—but as long as you don't wait until the night before to start reading, I think it's pretty manageable (other than one week where we were supposed to read 180 pages of a novel). Bell sets high expectations for his students since they're UMD's \"best and brightest,\" as he likes to say, but he also cares a lot about them and values their input on assignments. Despite Big Rick's tall height, he's very friendly and approachable and always willing to answer any questions students have about course material. All in all, I definitely enjoyed his class and appreciated him as a professor. ", "rating": 5, "expected_grade": "A", "created": "2022-01-11T03:59:46Z"}, {"professor": "Richard Bell", "course": "HNUH218A", "review": " Don't have to memorize any content until the final which is fairly easy. The majority of the grade comes from essays which are graded by the TA who helps you improve your essay during office hours before you submit it. Make sure you participate in discussions as that's a big part of your grade. As for Professor Bell, he's an extremely interesting lecturer and even moved our final online and made it open note due to rising covid cases. ", "rating": 5, "expected_grade": "A", "created": "2022-01-15T17:46:09Z"}, {"professor": "Richard Bell", "course": "HIST132", "review": "An engaging professor!! One of my favorites. Just expect to be writing some hefty papers for an intro level course.", "rating": 5, "expected_grade": "A", "created": "2023-02-18T05:50:51.917024Z"}, {"professor": "Richard Bell", "course": "HIST132", "review": "I agree with many of the reviews here. Professor Bell is an amazing lecturer and his classes were very engaging. Depending on if you love history/politics, this class may be good for you! However, for a 100-level intro course, there is a lot of content and work to cover for this class. There are quite a few lengthy weekly readings that also need to be deciphered out of old English, and two papers to write (~7 pages)! In addition to that, participation is integral to your grade as well. However, if you do put in effort in this class, the outcomes are very rewarding! Professor Bell is hilarious and kind and great to have!", "rating": 5, "expected_grade": "A", "created": "2023-12-15T04:15:51.927918Z"}], "name": "Richard Bell", "slug": "bell_richard"}