{"courses": ["GVPT331", "GVPT388P", "GVPT479I", "MLAW304", "CPJT100", "CPJT250", "MLAW150", "MLAW374", "CPSP218", "CPJT230", "CPJT240", "MLAW388", "MLAW348C", "MLAW377", "MLAW404", "MLAW305", "MLAW100", "MLAW358U", "GVPT439E", "MLAW358N", "MLAW298V", "MLAW378B", "MLAW304", "CPJT105", "MLAW101", "MLAW411", "MLAW100", "MLAW101", "MLAW304", "MLAW304", "MLAW358U", "MLAW378B", "MLAW101", "MLAW100", "MLAW215", "MLAW304", "MLAW358U", "MLAW100"], "average_rating": 2.4643, "type": "professor", "reviews": [{"professor": "Robert Koulish", "course": null, "review": "Engaging and knows his stuff but completely unresponsive to student concerns. He'll pretend to care in class but when you email him he will never answer and he is not helpful at all. ", "rating": 2, "expected_grade": "", "created": "2012-12-28T19:29:00Z"}, {"professor": "Robert Koulish", "course": null, "review": "Professor Koulish's class on immigration was perspective changing. It can be difficult to begin a discussion about immigration with people outside of class because of how thoroughly uninformed I realize I was before taking the class. Immigration is a collusion of society, law, sovereignty, economics, and the list goes on, and Professor Koulish is an expert. This class was the tip of the iceberg, and I have since hit the ground running with reading and thinking about immigration and social philosophy on my own and in my course studies. I would recommend reading his book at the beginning of the semester, as it is dense and fascinating, and helps you see where he is coming from.\n\r\nI'm surprised to see the negative reviews of Professor Koulish, but I will say that his teaching style was very effective in a small class setting with an interesting topic and engaged students. I'm not sure how he would teach a course like GVPT100.\n\r\nKoulish is receptive to students who want to engage more deeply outside of class. Though he is busy and doesn't always have the time, he has been consistently willing to talk outside of class. He is an inspiration, a very intelligent person, and a formidable individual. If you engage and are interested, you will receive.", "rating": 5, "expected_grade": "A-", "created": "2012-04-11T18:02:00Z"}, {"professor": "Robert Koulish", "course": "GVPT331", "review": "The class definitely was not my favorite and I was not what I thought it would be. Koulish teaches with slides so its easy to follow along and take notes, but the way he teaches this course apparently is really different than how others teach it. As with any class, some material was really interesting and other stuff was really dry. Best advice always go to class because he does not post slides and above all always go to discussion, participate and get close to your TA because they do all the grading. ", "rating": 3, "expected_grade": "A-", "created": "2012-01-28T04:04:00Z"}, {"professor": "Robert Koulish", "course": "GVPT331", "review": "After the first day of this class last semester, I was really excited and felt sure that it was going to be an interesting course. However, after that first day, the original professor resigned, and Koulish stepped in.\n\r\nThen the class became a joke. \n\r\nI don't blame the course material, I blame Koulish. He is not an effective professor. His power points are often uninformative. Which would be fine if the words he spoke were informative. But they're not. He constantly puts down the legal profession and talks negatively about lawyers as if he is trying to talk his entire Law class OUT of becoming attorneys. Which doesn't make since if he is a law professor.\n\r\nI don't think Koulish is a bad person, he just shouldn't be teaching a 300 level GVPT class. Lectures are almost pointless, he posts everything on ELMS. Discussion isn't really worth it either but I think you get participation for going. There was a short paper (easy) and a research paper (also easy) as well as a midterm and a final. I may have gotten an A but it was not a fun experience.", "rating": 1, "expected_grade": "A", "created": "2011-07-27T15:09:00Z"}, {"professor": "Robert Koulish", "course": "GVPT100", "review": "Koulish is a Douchebag and also not to say that the class is pointless, which makes it a bad combo. The System that the class works on is total BS. This man has 8 different TAs for a class of less tham 200 students and each TA has their own philosophy which greatly differs from Koulishs. This also reflects on the way exams are graded! Koulish is a wicked man. He knows how hard it is to to come by money, but yet he makes you go out there and buy a custom book that he complied for 100 dollars when in reality you can pass the class without the Book. I can go on forever but i am sure you get the gist  of it. IF YOU love yourself, you'd stay away from Koulish!", "rating": 1, "expected_grade": "", "created": "2011-07-23T01:58:00Z"}, {"professor": "Robert Koulish", "course": "GVPT100", "review": "Koulish was a good teacher. He made what is rly a boring topic relatively interesting. That being said his lectures were really boring despite his efforts. TAs are not bad. One midterm One Final One Essay and Participation are your grades. USE GOOGLE DOCS AS A CLASS!! IT HELPS!", "rating": 4, "expected_grade": "A", "created": "2011-06-09T17:33:00Z"}, {"professor": "Robert Koulish", "course": "GVPT100", "review": "class was soooo boring. honestly i didn't learn jack. there was one midterm, one essay, one final. every thursday we had to email in 2 questions about lecture for our discussion section. Some genius created a google doc where everyone studied together for the midterm and final so dat made everything essay. Got on A on the essay but that's only because my TA Chris was real chill. participation is worth 20% of your grade so keep dat in mind. I would recommend the class if u get chris as a TA. Heard the Anne lady was an a*% tho. ", "rating": 3, "expected_grade": "B", "created": "2011-05-23T21:23:00Z"}, {"professor": "Robert Koulish", "course": "GVPT331", "review": "This was my least favorite class in my four semesters at Maryland. \n\r\nI had a lot of problems with Professor Koulish, although I must first say that he wasn't originally intended to teach this class.  The intended professor had to leave after the first week, so Professor Koulish stepped in.  Nevertheless, he did a poor job with this class.\n\r\nHis class is not particularly difficult, yet I wouldn't consider it fair.  For his exams, he provides a powerpoint \"review,\" however none of the topics were on the test.  He gave us a 10-12 page paper near the end of the semester, and a final exam.  The paper was assigned too late in the semester, and he gave very little guidance about what to actually write.\n\r\nMy biggest problems with Koulish came from his lectures.  Not only were his powerpoints messy and hard to follow, but they were also covered with grammar and spelling mistakes.  He rarely seemed prepared.  In addition, his own political beliefs were evident throughout.  He wants you to believe that lawyers who work for the private sector or with the goal of making money are terrible people.  \n\r\nIf you're looking for a LAW class, this is not it.  It is focused primarily on sociology and Koulish's beliefs.  The topics are somewhat related but not cohesive, and the readings are a little random as well.  In addition, he often would not post the reading until the day before it was due. He never responded to a single email I sent him. \n\r\nOverall, he was unorganized and not a good lecturer.  I gave him the benefit of the doubt at first because of the exceptional situation of having to step in at the last minute, but by the end I realized that he is an overall bad professor.  ", "rating": 1, "expected_grade": "A", "created": "2011-05-21T14:34:00Z"}, {"professor": "Robert Koulish", "course": "GVPT100", "review": "Not as great a teacher as everyone is saying. He is totally distant during lectures and packs as many run-ons as possible. He is not easy to follow.\n\r\nI'm a straight A student and knew the material like the back of my hand but expect a C in this class because I had a ridiculous TA. If you have Anne, switch immediately. She is insanely pen-heavy and an unfair grader. For the first exam, the average in her discussion was a C-. When the average for an exam is that low, you can only blame the students so much. There was clearly a problem. \n\r\nThere are 2 exams. The final is cumulative. He told us the whole semester that it was non-cumulative until a few days before the exam that it was. You have discussion sections and a 6-8 paper. I would suggest taking this class with someone else.", "rating": 2, "expected_grade": "C", "created": "2011-05-13T17:07:00Z"}, {"professor": "Robert Koulish", "course": "GVPT100", "review": "So I had prof koulish for GVPT100\r\nim not a huge political theory person but i took the class to get a better understanding\r\nhes a solid lecturer and what not\r\nbut something about him gave me a vibe saying im a douchebag\r\nhe was a dick to students sometimes\r\nthe TAs were ok decently helpful\r\nbut he is a pretty boting lecturer\n", "rating": 2, "expected_grade": "", "created": "2011-05-07T15:56:00Z"}, {"professor": "Robert Koulish", "course": "GVPT100", "review": "Great teacher. His lectures were interesting and enthralling. His tests were really straight forward in that he gave you the essay questions beforehand. If you do the readings and practice writing the essay questions before the exam, you will do great. ", "rating": 5, "expected_grade": "A", "created": "2011-02-21T23:03:00Z"}, {"professor": "Robert Koulish", "course": "GVPT388I", "review": "Great professor! Had him for GVPT388I (the Public Policy Internship seminar) fall 2010. As it is a course that we are required to take if we want academic credit for our internship, he gave us good advise if we needed and asked us every week to talk about the progress we have made at our internships. He did not lecture a lot, it was mostly based on discussions. Since a lot of students were doing internships in campaigns we talked a lot about that. \n\r\nAs far as work goes, we had one 10-12 page paper to write by the end of the semester related to public policy. We had to choose a topic related to our internships. He asked us to submit a paper proposal and an outline of our analysis for our paper so he could give us feedback in the process. This made it easy to have most ideas organized before the end of the semester and have the 12 page paper done without cramming too much. We also had 2 guest speakers who were pretty interesting.\n\r\nOverall, great class. \n\n", "rating": 5, "expected_grade": "A", "created": "2011-01-29T21:23:00Z"}, {"professor": "Robert Koulish", "course": "GVPT100", "review": "most boring class ive ever taken.  he was a new teacher and i absolutely hated the class.  i learned nothing the entire semester but somehow memorized the important stuff and got an A.  Course consists of 2 midterms, a paper, and a final. i have friends with other gvpt100 teachers and they either had one less exam or their paper was the final", "rating": 2, "expected_grade": "A-", "created": "2011-01-02T22:49:00Z"}, {"professor": "Robert Koulish", "course": null, "review": "Professor Koulish is such an interesting person and he cares really deeply about the subjects being discussed in class. That being said, lectures are pretty much useless because he goes on tangents a lot. He's a great guy but not the greatest lecturer", "rating": 4, "expected_grade": "", "created": "2021-12-06T00:03:21Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Very unorganized teaching method. Not receptive to students concerns. Very ineffective teaching method. His teaching method will just make you more confused than before. Had to teach myself most of the course.", "rating": 1, "expected_grade": "A", "created": "2021-12-08T18:38:48Z"}, {"professor": "Robert Koulish", "course": "MLAW358U", "review": "Please do not take this class. It was about immigration, so while on paper that may sound interesting, believe me, the class was not fun. Format is 2 essays and a final project, in the form of a presentation or a big paper. Topics were assigned and you could pick one from the list. Main issue- a dumb rule where we were only limited to the materials he provided, so online research was a no go. Class would go like this- half an hour two students present the local immigration related news, then another half an hour of Koulish going off topic for no reason. When the lecture starts an hour in, out of the 20 or so slides we get through like 5. Koulish knows his material, but goes off topic, is slow to grade any work with the TA. I had ungraded assignments for like a month or more straight, and the class was very dry. Unless you are passionate about immigration, skip this, take something else instead.  ", "rating": 2, "expected_grade": "A", "created": "2022-05-18T02:09:29Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Dr. Koulish is a great guy, but not the best lecturer. His slides are not the easiest to understand, and when you expect him to explain them, he seems to go off topic. The final assignment (7-8 page essay or 15 minute podcast) is too long in my opinion. If he wanted us to do an essay, I wouldn't have a problem if it wasn't so long.", "rating": 3, "expected_grade": "A", "created": "2022-12-08T03:06:08.270044Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Smart man and interesting to talk with but his lectures are just him rambling and his tests are confusing and poorly worded. He gets about 2 slides into the 25 slide powerpoint before getting off topic and then you have to teach yourself that material. Your TA will be doing almost all of the grading and actual teaching.", "rating": 2, "expected_grade": "A", "created": "2022-12-24T07:28:49.244276Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "MLAW100 was the dumbest class I’ve ever taken. Don’t recommend 😀", "rating": 1, "expected_grade": "A", "created": "2023-01-12T00:24:45.259495Z"}, {"professor": "Robert Koulish", "course": "MLAW358U", "review": "Dr. Koulish is the goat, class is super engaging and he knows a ton about the topic", "rating": 5, "expected_grade": "", "created": "2023-02-09T16:16:24.428845Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Terrible class and professor. Would give zero stars if could.", "rating": 1, "expected_grade": "", "created": "2023-02-09T23:35:34.026154Z"}, {"professor": "Robert Koulish", "course": "MLAW304", "review": "Very interesting guy. Kinda of just rambles on and is not organized at all. The readings and due dates are always changing. Its a required course and its not HORRIBLE. But its a 2.5 hour class and its pretty hard to stay engaged. The exams are worth like 5% so its not hard, theres a few assignments. He hates technology so you can only write in a notebook and then you turn it in and all your assignments are in that notebook. Again not horrible, kind of just seems like a waste of time sometimes and the 2.5 hour class is difficult", "rating": 3, "expected_grade": "A-", "created": "2023-03-28T17:17:01.069777Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "He is very disorganized. He is also biased against students who hold different political views from him. My interest in law still stands, but I would not recommend taking a class with him if you can.", "rating": 1, "expected_grade": "", "created": "2023-05-15T18:12:06.259802Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Dr. Koulish is a really nice guy who I had for MLAW100 during the Fall 2022 semester, but lecture starts with a few slides, then he starts rambling about things completely off topic. Also, his quizzes are very poorly worded, and the grading of assignments literally takes FOREVER. After I completed the final assignment, I didn't receive a grade for it until January, which is well after Final Exams for the Fall Semester.", "rating": 2, "expected_grade": "A", "created": "2023-06-01T01:28:32.066472Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "He's okay, what I didn't like was that sometimes would read slide and then talk about other things not going through the rest of the slides. test weren't bad but you'd have to read all the articles remember dates, authors, and sometimes what you remember isn't even on the exam. No final exam only a 8 page 2000 word essay (it's do-able, but don't be like me who did it 4 hours before it was due :( This course doesn't leave you with home-work so you don't have to focus on it as much compared to other classes. but definitely take opportunities of the JLT scholars program!", "rating": 3, "expected_grade": "B-", "created": "2023-12-14T20:57:58.122028Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Dr. Koulish is very disorganized, and it hurts the quality of the class. As the other reviews say, he is prone to tangents and lets discussions between students in lecture go on for too long; there was one class where we did not move past the title slide of his presentation because of discussions between students. Additionally, in these kinds of back-and-forth discussions, one sometimes gets the sense that, despite his claims to the contrary, Koulish wants us to come away with his specific view on the law. All of this would be fine if the class was primarily about discussions, but the components of the grade are attendance, service hours/events, two exams which test mostly from the slides, and a final paper that you don't really need discussions to do well on. The total effect of this is that the class is frustratingly paced, and lectures are extremely unhelpful (but still required!!) to prepare for exams. Also, the materials (slides, etc.) often are not posted, posted super late, or of very poor quality. On the positive side, Dr. Koulish is very accessible and willing to work with students. All in all, I really can't recommend this class.", "rating": 2, "expected_grade": "A", "created": "2023-12-21T19:53:27.556629Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Do not take Koulish if you can help it. I had him for MLAW100, and he made me want to drop scholars altogether. His lectures consist of him rambling about topics hat are only very very loosely related to his powerpoints, making his exams very difficult to study for. The TA makes or breaks the class. Although he's an intelligent person, he is a horrible professor, and I don't feel I learned as much as I could've from this class.", "rating": 1, "expected_grade": "A-", "created": "2023-12-23T07:35:33.483002Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "He is a nice professor but his teaching style is very disorganized. The lecture slides made almost zero sense, and he only got through a couple slides each class before going off topic anyway. Also, he constantly assigned things that weren't on the syllabus, and his criteria for major papers and exams were extremely vague. That being said, the class itself isn't terribly difficult only if you put in the work and study. The exams are hard but not impossible.", "rating": 2, "expected_grade": "A", "created": "2024-01-13T18:21:27.192693Z"}], "name": "Robert Koulish", "slug": "koulish"}