{"courses": ["HIST200", "HIST201", "HIST353", "HIST357", "HIST356", "HIST266", "HIST354", "HIST222", "HIST355", "HONR299G", "HIST408L", "IMMR400", "HONR239G", "EXST030", "IMMR200", "HONR259J", "HIST466", "HNUH238Z", "HIST201", "HIST200", "HIST201", "HIST355", "HIST466", "HIST201", "HIST222", "HIST354", "HIST356", "IMMR400", "HIST200", "HIST201", "HIST200", "HIST201", "HIST200", "HIST201", "HIST201", "HIST355", "HIST466", "HIST226", "HIST201", "HIST222", "HIST354", "HIST356", "HNUH258W", "HIST201", "HIST226", "HIST355", "HIST466"], "average_rating": 4.7045, "type": "professor", "reviews": [{"professor": "Robert Chiles", "course": "HIST201", "review": "Greatest professor of all time. ", "rating": 5, "expected_grade": "A", "created": "2018-01-23T21:06:01Z"}, {"professor": "Robert Chiles", "course": "HIST357", "review": "Literally the greatest professor ever. He makes every class so engaging; it's just like hearing someone tell you a really interesting story, but that story is actually history! He really understands his students and makes an effort for everyone to be seen and have a chance to succeed. Take as many of his classes as possible!!", "rating": 5, "expected_grade": "A", "created": "2018-05-22T02:43:30Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "One of my favorite professors at this school. He has so much charisma. Go to discussion and participate. Learn the term definitions for the tests, and you will receive a B even if your writing skills are terrible (like mine are).", "rating": 5, "expected_grade": "B", "created": "2018-09-06T16:49:22Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Great professor that keeps you engaged in the subject.", "rating": 5, "expected_grade": "A", "created": "2018-11-29T03:17:07Z"}, {"professor": "Robert Chiles", "course": "HONR299G", "review": "The best professor at UMD", "rating": 5, "expected_grade": "A", "created": "2019-05-20T01:55:43Z"}, {"professor": "Robert Chiles", "course": null, "review": "Intelligent professor who knows history very well. However, extremely overrated. Don't get me wrong, he is a good professor but I will never understand the fan club that surrounds him. ", "rating": 3, "expected_grade": "", "created": "2019-05-22T18:55:13Z"}, {"professor": "Robert Chiles", "course": "HIST356", "review": "Took HIST356 (Emergence of Modern America, 1900-1945) in Spring 2019 as an elective. Professor Chiles was very charismatic and his lectures were engaging, well-researched, and full of good material and helpful images.\r\nMidterm was an oral exam (20 mins discussion about the prompt), final was two essays with prompts given ahead of time. Lots of readings each week, short summary due every class. Two papers throughout the semester and optional third for extra credit. Would absolutely recommend Prof. Chiles' classes to anyone, history or not -- be prepared to participate in discussion and do work on par with other upper level history classes, and enjoy.", "rating": 5, "expected_grade": "A", "created": "2019-05-25T00:49:43Z"}, {"professor": "Robert Chiles", "course": "HIST356", "review": "Awesome! ", "rating": 5, "expected_grade": "A", "created": "2020-07-21T16:26:20Z"}, {"professor": "Robert Chiles", "course": "HIST356", "review": "Excellent, extremely knowledgeable professor who cares deeply about your understanding in his course.", "rating": 5, "expected_grade": "", "created": "2020-11-05T19:46:55Z"}, {"professor": "Robert Chiles", "course": "HONR299G", "review": "Fantastic professor! So passionate about the material, really cares about his students. Makes his lectures really engaging, even when recorded! Few assessments, very fair. Participation in discussion is a must.", "rating": 5, "expected_grade": "", "created": "2020-12-20T20:08:21Z"}, {"professor": "Robert Chiles", "course": "HIST200", "review": "Very knowledgeable and the course load was expected. He is very animated and makes learning about history enjoyable. You can tell he is passionate about what he is talking about. During fall 2020, he held only asynchronous lectures. It would have been nice to have a real zoom meeting with him every now and then, but overall it was a solid class.", "rating": 4, "expected_grade": "A-", "created": "2020-12-21T11:17:34Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "I had Mr. Chiles fully online this semester and all his lecture were through YouTube video which wasn't to bad because you could re-watch them as many times as you want. But since I had ADHD it was kind of hard to pay attention but the class was very flexible because you could watch the videos at anytime. Also the weekly writing discussion weren't to bad as long as you watch the videos and the class discussion with the TA were really helpful. Also if you participated you'll get all the points, if it's verbally or even through the chats. My TA was so nice too she's Ms. Kocher and I would contact her instead of Mr. Chiles If I wanted a faster response with my emails. She was also very understanding with my disability and my commendations when it came to the essays and the only reason I got a C was because I never completed one of the major essay's which was my fault. If I had done so I would've probably gotten a B or A but other then that this class was pretty nice and I really love history so other then that I would recommend it. ", "rating": 4, "expected_grade": "C", "created": "2021-01-08T02:45:11Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Prior to taking HIST201 I read a ton of reviews on Chiles and HIST201 saying it would be one of the more interesting and easy geneds. I am here to warn you that this is definitely not the case. Chiles does put alot of effort into his video lectures but he should have added additional materials likes slides so that we could separate the important points from the trivial points instead of having to digest all the info from the entire video.\r\n\r\nI guess the grading depends on your TA but my TA was absolutely ruthless and nitpicky for even the smallest details on the exams and essays. I felt like she was doing this just to lower the average, even when my responses were detailed enough. You think your essay deserves a 100? Nah you're probably gonna get an 85, best case 90. There was busy-work every week in the form of discussion boards which did not help me learn or prepare for exams whatsoever.\r\n\r\nSo the bottom line is if you hate writing, avoid this course. 3 stars for Chiles, 1 star for the overall way this course was set up, and -10 stars for the TAs for their grading style. A course that was supposed to be interesting was unnecessarily transformed into a super boring and tedious course.", "rating": 1, "expected_grade": "A-", "created": "2021-02-09T21:58:24Z"}, {"professor": "Robert Chiles", "course": null, "review": "Great teacher, amazing lectures, reasonable exams, and passionate about what he teaches. The best damn professor in ARHU/HIST", "rating": 5, "expected_grade": "A", "created": "2021-02-23T12:05:29Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Chiles is GOAT plain and simple. \r\nClass has some writing and 2 books for reading but there used to be weekly reading which he got rid of. Exams were identifying major events and he gives you a study guide with ones that may appear. Overall very straightforward. However, TA has a lot to do with your grading.", "rating": 5, "expected_grade": "A+", "created": "2021-04-08T19:51:23Z"}, {"professor": "Robert Chiles", "course": "HONR239G", "review": "Dr. Chiles is genuinely among the best lecturers in the entire university. He is humble and open, an extraordinary lecturer, incredibly thoughtful, and worldly and clever to boot. His typical history classes are more demanding than this, and they involve drier reading with lots more factual retention, but I know they too are great at expressing narratives.\r\n\r\nThis class in particular is likely never being offered again, which is a shame, as it truly is remarkable. In essence, it is a book club wherein, through reading novels weekly and discussing them at length for two-and-one-half hours, you learn about the history of America through its stories and themes therein. It focuses a lot on humanism and the experience of the underprivileged in the nation, especially immigrants, beginning in our case from about 1850 until modern day. This is the only Zoom class I have been in where everyone always showed up, always had their camera on, and always participated, usually enthusiastically. Almost every student showed up to an optional, extra-credit class even, despite the average grade being an A-/A. If something like this is ever offered again and you enjoy or have enjoyed or think you might enjoy reading, then I would highly suggest it. It also helps you with communication skills and structuring arguments. (I would say writing, too, but the big term paper on the book/week you chose to lead the discussion was reduced in scope.) ", "rating": 5, "expected_grade": "A+", "created": "2021-05-14T07:42:07Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Chiles is an absolute beast. The man is a living encyclopedia. He rolls up to lecture in a suit everyday and shoots endless information about any topic throughout history. If you want a professor that knows every single thing about the subject, take Chiles.", "rating": 5, "expected_grade": "", "created": "2021-11-15T00:38:15Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Literally the best professor I've ever had at this University. I was ENGAGED every day in his content, and you can clearly tell he is too. I've never written a review and I probably never will again, but he deserves to hear this and people deserve to know. ALSO!!! One of the best books I've ever read in school was in his class. Driving While Black. Absolutely highly reccommend to read. Simply put, thank you Dr. Chiles. Truly the definition of an increbile educator.", "rating": 5, "expected_grade": "A", "created": "2021-11-17T03:14:29Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Dr. Chiles is great. His lectures are engaging and you will not get bored. The midterm and final were very straight forward and easy to prepare for. He did sometimes go over the class time but overall amazing professor. ", "rating": 5, "expected_grade": "", "created": "2021-12-19T19:43:25Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Great professor", "rating": 5, "expected_grade": "A", "created": "2022-01-24T02:21:21Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Top 5 lecturer at UMD. Take this class, you won't regret it.", "rating": 5, "expected_grade": "A+", "created": "2022-03-23T00:49:21Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Dr. Chiles is an amazing college professor and I highly recommend him if you are planning on taking any history classes. The midterm was online for me and I was having technical issues and he was very lenient about it so I was still able to take the midterm.", "rating": 5, "expected_grade": "", "created": "2022-05-14T20:26:27Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "overated professor ", "rating": 1, "expected_grade": "", "created": "2022-05-28T06:31:16Z"}, {"professor": "Robert Chiles", "course": "HIST200", "review": "Professor Chiles is a great lecturer! While most of us took American History in high school, HIST 200 goes into greater depth on the founding of America through the Civil War period. Some of the material was familiar, but other bits of information came as a surprise. \r\n\r\nFair warning, Professor Chiles speaks quickly during lectures. If you're stressed about taking notes, don't be. Chiles posts all his lectures on Canvas Elms. Even better, Professor Chiles hands out study guides for all his exams, so you know what to study for. The TAs are very nice, but discussion sessions were boring at times. Assignments include two exams, one paper, and weekly discussion board posts. ", "rating": 5, "expected_grade": "A+", "created": "2022-08-05T21:44:45Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "As most people said, Chiles is the best history professor. Take his class if you need a gen ed or even as an elective. Don't skip class though. He doesn't post slides online.", "rating": 5, "expected_grade": "B", "created": "2022-12-12T20:54:27.307061Z"}, {"professor": "Robert Chiles", "course": "HIST200", "review": "Echoing most of the other reviewers, Dr. Chiles is probably one of the most charismatic, passionate, and dedicated instructors at UMD. It's honestly embarrassing for the University that he isn't tenured. However, if you're going to register for one of his lectures, I would recommend not scheduling a class immediately after on the other side of campus. Lectures routinely went 1-3 minutes over their scheduled end time. It's a testament to Chiles' lecturing skills that almost no students even began to pack up until he remarked that the class was nearly over. Absolutely would recommend any of his classes.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T20:43:41.408673Z"}, {"professor": "Robert Chiles", "course": "HIST200", "review": "Dr. Chiles is a great professor! You can tell how much he loves teaching. As someone who is not too interested in history, lecture definitely was a little boring at times. But overall a super easy class with only one paper and the study guides for the midterm/final are very similar to what is on the exam. A great class to take for a gen-ed!", "rating": 5, "expected_grade": "A", "created": "2022-12-21T03:07:57.494007Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Goated professor. Made a history class interesting to a computer science major. This dude is so passionate about history its insane. Really great class, but I have to say, your grade really depends on the TA. My TA kyle was great and very understanding, but students with the other TA did not exactly share the same sentiment. Other than that, great class.", "rating": 5, "expected_grade": "A", "created": "2022-12-22T16:15:47.183295Z"}, {"professor": "Robert Chiles", "course": "HIST354", "review": "The other reviews are true - he really is that good. Extremely engaging lecturer, clearly passionate about history and about teaching. Will not hesitate to help if you ask, very understanding and kind. I can't wait to take more classes with him. Absolute GOAT.", "rating": 5, "expected_grade": "A-", "created": "2023-05-10T17:42:51.028240Z"}, {"professor": "Robert Chiles", "course": "HIST222", "review": "Professor Chiles is genuinely one of the most insightful professors I have ever had. I took his history of immigration course with the intent of just getting the diversities portion of my gen ed requirements over with, but I ended up looking forward to every lecture. His lecture style is very entertaining because of how passionate he is about the content. The course itself broadened my perspective on cultures around the world, and even allowed me to learn more about my own. There are a few large assignments to be aware of, such as a lengthy research paper and presentation, however, I found them to be quite enjoyable. With that being said, he is also quite lenient/flexible with due dates if you present a valid reason. Overall, I would definitely recommend taking a class with this guy. He's the man.", "rating": 5, "expected_grade": "A", "created": "2023-05-11T18:05:23.328793Z"}, {"professor": "Robert Chiles", "course": "HIST354", "review": "One of the best professors not only in the history department, but at UMD. \r\nExtremely passionate when lecturing. \r\nShow up to his class, and participate in the discussion at the end of the class with a little bit of flair and style. \r\n\r\nHis lecture style is a bit traditional, with him talking for one hour followed by fifteen minutes of discussion.\r\nBut during that time you can just do random things on your laptop, or make notes, or whatever you want. \r\n\r\nNo penalty for missing class apart from the content that you miss.\r\n\r\nExtremely accommodating and caring about his students. \r\n\r\nSo passionate about history and what he does, that he might even try to \"recruit\" you to study more history classes with him down the road! I have never met any professor who was actually ready to work even more. \r\n\r\nTruly, you cannot go wrong with Chiles.", "rating": 5, "expected_grade": "A+", "created": "2023-05-20T21:46:18.806843Z"}, {"professor": "Robert Chiles", "course": "HIST354", "review": "Dr. Chiles is one of the best professors on campus, and definitely the best history professor. Very chill and approachable, super informative in the lectures and engaging in his teaching! Will sometimes tell stories while he's teaching (personal and historical), and I really enjoy that style of learning. The small things in history are what really make the subject fascinating, and Chiles makes sure you are engaged. Attending lectures is a must, exams are oral exams in person or on Zoom. Prompts given in advance and you can use notes in your meetings! He treats them as a conversation and goes actively encourages your response with questions or clarification on something you've said to really test that you know the material. The paper snuck up on me a little bit but it was relatively enjoyable to write. Does require physical copies of your paper to be turned in.", "rating": 5, "expected_grade": "A", "created": "2023-05-23T22:02:05.240554Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Most passionate professor I've taken a Gen Ed with. Took this class for the Gen Eds. One of the easiest Gen Eds. His lectures were super engaging. It was like watching a movie and this is coming from a CS Major. My TA was very nice and posted her own lecture notes. I still took notes during class. Structure of the class: \r\nMidterm (20%) and Final (25%): same format and you just write an essay and explain some ID Terms. There is a study guide that is very very very helpful in helping you study for this. Basically gives you all the possible ID terms they might ask and the essay prompts.\r\nPaper (15%): 5 page paper on a book that you have to read. Used audible and just listened to it over the span of a week and then wrote the paper. \r\nDiscussion participation (25%): yes, discussion attendance is mandatory, but just say something every time and you should be good.\r\nDiscussion board (15%): just post on canvas discussion page thoughts about the lectures\r\n- Joe", "rating": 5, "expected_grade": "A+", "created": "2023-05-25T03:37:32.943339Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "THATS WHY HES GOAT THE GOAT. Actually just a great professor and an easy A as long as you pay attention and take good notes.", "rating": 5, "expected_grade": "A+", "created": "2023-06-09T00:15:02.973700Z"}, {"professor": "Robert Chiles", "course": "HIST222", "review": "very lenient, we didn't have too many assignments. He's very entertaining in lecture and tends to ramble (in a good way lol). I recommend any class taught by him, he'll make you interested in the lectures!", "rating": 5, "expected_grade": "A-", "created": "2023-06-11T17:52:21.458159Z"}, {"professor": "Robert Chiles", "course": "HIST222", "review": "easy A, very intrigued by his lectures and didn't dread going to class so that's a huge plus. He's very lenient with grading", "rating": 5, "expected_grade": "A", "created": "2023-06-11T17:53:38.703445Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "It really shows that Professor Chiles not only cares deeply about history, but that he wants to share this passion with his students. In my experience, his lectures are always engaging and humorous. Although I will note that if you lose focus during his lectures it can be really difficult to get back on track because they are pretty fast-paced. Also, you definitely have to pay attention during the lectures because the slides are not very self-explanatory- they are mostly just talking points. Nonetheless, he is probably the most knowledgable History teacher I've ever had and his mastery is well reflected in his lectures. He often connects points back to previous themes and characters which, I think, makes history much more palatable and comprehendible. His assignments and exams are fair and not super challenging as long as you pay attention in his lectures. Would definitely recommend!", "rating": 5, "expected_grade": "A", "created": "2023-10-10T22:24:56.987595Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Robert Chiles is the most amazing professor. He literally made me want to be a history double major. His class was very engaging and the lectures were so much fun. He is so passionate about the subject and you could really tell. There were only 2 essays and the midterm which he gave us the prompt for ahead of time. He always was a very lenient grader and just wanted the best for us. I would recommend anyone to take this class and i can’t recommend Chiles enough!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T01:07:11.136949Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "He is so great and so fun and so passionate. His lectures are incredibly entertaining. He doesn't post lectures, so you have to go to class. It doesn't matter that he doesn't post anything, because he doesnt have anything on his slides anyway most of the time. He likes pictures and to speak. So you need to take notes on what he says while lecturing, so type your notes. His TA's are the ones that grade basically everything, so being super nice to them, go to discussions and talk to them; just form a relationship because being on their good side is important. His exams are kinda easy, but again, it depends on your TV because they grade them. Overall, thumbs up for this class and for Chiles. Love him \r\nPS. not as important, but he is incredibly great-looking.", "rating": 4, "expected_grade": "A", "created": "2023-12-08T16:13:55.075555Z"}, {"professor": "Robert Chiles", "course": "HIST466", "review": "It's Chiles, just take him. If you want to know more about what will happen here are his Fall 2023 and previous years' syllabuses below:\r\n\r\nhttps://drive.google.com/file/d/1oHBzBNxmUxUgRC2o7CvQGorG95K1PMuT/view?usp=sharing\r\n\r\nhttps://drive.google.com/file/d/1uG6pqPATRkxhAyz8HzjBpre2KSfRUf-2/view?usp=sharing\r\n\r\nEntire class was a group discussion around a monograph on a particular immigrant group always. Some weeks we would just not have a class to \"give the entire class a break\" (it's scheduled into the syllabus). Final exam is just another group discussion which he would call \"a victory lap\". I was personally not very interested in the material that we did but one of the best professors at UMD.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T19:30:21.577885Z"}, {"professor": "Robert Chiles", "course": "HIST355", "review": "What do you expect? It's Chiles! Can't really go wrong with him. Several of my classmates took several classes of his, some of them multiple in the same semester.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T19:31:53.905722Z"}, {"professor": "Robert Chiles", "course": "HIST226", "review": "(****took HIST226 but it won't let me put the right course*****) He was great! We had weekly journals about our thoughts from the lectures from the week which we later made into the final paper, plus only a few other assignments. Really understanding and made adjustments to assignments/due dates. He lectures the whole time so I’d say type notes on your computer lol. He’s super enthusiastic, makes jokes, and I learned a lot, definitely recommend!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-30T18:43:13.181854Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Dr. Chiles is an outstanding lecturer who made history very enjoyable. He tells a story at every lecture, which makes the content accessible and entertaining. Attendance at lecture is important, because there are no officially posted notes or slides available, but depending on your TA, they might post a slide recap at the end of the week. Most grades came from the midterm, final, and a paper which were fairly graded (class avg 90% for all). Other grades were from discussion (in-class participation and online discussion post 2x weekly). I highly recommend taking this course with Dr. Chiles. You will get a good grade if you put in moderate effort.", "rating": 5, "expected_grade": "A+", "created": "2024-01-04T00:44:03.998155Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "I took him in winter term, I can say he's amazing really passionate about history, his grading and assignments are pretty fair, with a good structure, and he is generally pretty fun, so lectures are never boring. So, he is a 10", "rating": 5, "expected_grade": "A+", "created": "2024-01-23T04:03:16.078147Z"}], "name": "Robert Chiles", "slug": "chiles"}