{"courses": ["HIST235", "HIST430", "HIST408G", "HIST234", "HIST431", "HIST215", "HIST332", "HIST333", "HIST219P", "HIST408P", "RELS342", "WMST298C", "HIST428O", "HIST215", "HIST234", "HIST235", "HIST319E", "HIST215", "HIST234", "HIST235", "HIST431", "HIST215", "HIST234"], "average_rating": 4.2222, "type": "professor", "reviews": [{"professor": "Sabrina Baron", "course": "HIST431", "review": "Dr. Baron is simply amazing. Her teaching style is somewhat old school, lecture-based with room for questions. Just the way this sort of history should be taught. If you're not a fan of lectures, don't dispair. Because she has such a comprehensive understanding of the material, class is both engaging and (quite often) amusing. She's not the world's fastest grader, a fact which she herself admits, but she's very fair. She's also flexible with students regarding paper deadlines, exam dates, etc. If you're looking for a solid history class that will provide you with a wealth of knowledge and is taught by a genuinely wonderful person, take as many classes with Dr. Baron as possible.", "rating": 5, "expected_grade": "A", "created": "2011-05-06T16:40:00Z"}, {"professor": "Sabrina Baron", "course": "HIST235", "review": "She is an interesting teacher and is really nice.  You get two five page essay assignments and two exams.  The essays are analytical reviews on a primary and a secondary source.  Take these paper to the writing center because she doesn't like grammatical errors.  \n\r\nHer tests are kind of hard because she picks random 25 words and you have to write why they are important in historical times or something like that.  She wasn't really specific on what she wanted on the test, so a lot of people didn't do so well.  But she gave us a generous curve.  She is really a slow grader, she went over our midterm on the last class.  \n\r\nAlso, you have to go to class, take notes, and talk in class to get a good participation grade.  Her power points are only pictures and your notes are based on what she says.\n\r\nThis class was really interesting, so I would recommend it to people who likes this kind of history.\n\n\n\n", "rating": 3, "expected_grade": "A", "created": "2011-01-05T18:31:00Z"}, {"professor": "Sabrina Baron", "course": null, "review": "Dr. Baron knows a lot about the course subject, which is great. However, her class style is a bit annoying. It is very straightforward yet not very focused on techniques to improve your grade. For example, I attended every single lecture yet still ended up with a B in the class despite getting an A on the midterm. I had a 4.0, so this was very frustrating. We had to write two 5 page papers during the semester, but I only know my grade on one. She does not utilize Blackboard and takes forever to grade. \n\r\nAll in all, take this class if you are really interested in the subject and you don't mind getting a B. ", "rating": 3, "expected_grade": "B", "created": "2010-05-23T11:23:00Z"}, {"professor": "Sabrina Baron", "course": null, "review": "She takes herself too seriously. I mean, this is a boring, idiotic, useless class, and she has to make it seem as though it actually makes some difference to students. It doesn't. \n\r\nShe's a nice woman and I'm sure she's a decent history teacher from all I heard about her. But for UNIV101, just like any other teacher, she's a 3.  ", "rating": 3, "expected_grade": "A", "created": "2010-05-16T23:55:00Z"}, {"professor": "Sabrina Baron", "course": null, "review": "I really like this class and professor. She is very understanding and down to earth, and she also really knows her stuff. ", "rating": 4, "expected_grade": "A", "created": "2010-05-12T20:10:00Z"}, {"professor": "Sabrina Baron", "course": "HIST235", "review": "Take this class! The only downside is that it takes awhile for her to get grades back on assignments but she is a very good professor and her lectures are interesting. She spends every class lecturing so make sure you take good notes. If you can't write fast, I recommend bringing a lap top. As long as you go to every class and take notes, you don't need to read. I wouldn't even buy the books unless you want to read them for yourself. She goes over all of the material in class that you need to know. Her exams are ID questions so they really aren't very challenging and she doesn't try to trick you. She is also very helpful in office hours so I recommend taking advantage of that too. This is one of the best classes I have taken at UMD and I recommend it to everyone. ", "rating": 5, "expected_grade": "", "created": "2009-12-27T22:30:00Z"}, {"professor": "Sabrina Baron", "course": null, "review": "Really good professor...thoroughly enjoyed the class. There is a somewhat large amount of reading but the grading isn't too bad. Overall good choice for a honors seminar. ", "rating": 5, "expected_grade": "A", "created": "2009-12-17T14:35:00Z"}, {"professor": "Sabrina Baron", "course": null, "review": "Outstanding professor. I generally do not like history, but this professor has made it very easy interesting and easy to understand. Extremely knowledgeable, and any questions you ask in class that she does not have an answer for she will look up right then and there. Great sense of humor and extremely understanding of your schedule (will make adjustments to deadlines as needed). Fairly easy assignments, and is a just grader.\n\r\nShe assigns a lot of reading for this class, but if you don't have time to do it, you can still succeed by attending lectures and taking succinct notes.\n\r\nBest history teacher I have ever had by far, and a very interesting and good-hearted person.", "rating": 5, "expected_grade": "A", "created": "2009-12-08T19:28:00Z"}, {"professor": "Sabrina Baron", "course": "HIST235", "review": "Excellent professor.  She lectures the entire class but does so in an interesting way, and her lectures are so comprehensive that if you take good notes you don't really have to read all of the assigned readings. BUT, it is imperative that you attend pretty  much every class to get these notes, and attendance factors into your grade (she takes attendance at the beginning of each classs). I only skimmed the books before tests to find any information I was missing from my notes. The class has two papers, and a mid term and final.  The final is not cummulative. Overall the class is interesting and mananagable. Not a super easy A but if you put in the effort you can definitely do well. ", "rating": 5, "expected_grade": "A", "created": "2009-01-21T10:55:00Z"}, {"professor": "Sabrina Baron", "course": "HIST430", "review": "A very smart and fair professor.  You should attend lecture and you should be fine on tests.  You have to write a 15-page paper, but you have all semester to do it.  I strongly recommend Professor Baron to all history majors.", "rating": 5, "expected_grade": "A", "created": "2008-06-17T23:46:00Z"}, {"professor": "Sabrina Baron", "course": "HIST235", "review": "She is a wealth of knowledge and really interesting.  Her lectures are formatted as kind of a story and she tells the history that way, which was really helpful.  Great class and professor for someone who is not very into history, because she makes you become into it.  ", "rating": 5, "expected_grade": "A", "created": "2008-04-15T13:52:00Z"}, {"professor": "Sabrina Baron", "course": "HIST234", "review": "She is nice. However, she doesn’t get back to you within a timely manner, and has ignored many of my emails. You won’t know your grade the entire semester because she simply did not put grades in. Lectures are lengthy and reading was a lot. ", "rating": 3, "expected_grade": "", "created": "2020-12-19T16:24:26Z"}, {"professor": "Sabrina Baron", "course": "HIST235", "review": "Dr. Baron is a very nice lady and a great professor. The only complaint I have about her is that she is very anti-technology, so all notes have to be handwritten. She also doesn't put any words on her lecture slides, so you have to listen very carefully to get all of the information. She is very passionate about the subject and grades fairly.", "rating": 4, "expected_grade": "A", "created": "2022-05-23T22:12:01Z"}, {"professor": "Sabrina Baron", "course": "HIST234", "review": "Very interesting lectures and a relatively easy grader. My only complaints were her tending to not include names (etc.) in lecture slides, taking well past the drop period to enter in any grades, and not having (from what I could find) a syllabus posted. You have to attend lecture and take hand written notes. I didn't find it necessary to do any of the reading.", "rating": 4, "expected_grade": "A", "created": "2022-12-23T06:12:34.785249Z"}, {"professor": "Sabrina Baron", "course": "HIST215", "review": "HIST215 was a very interesting course and Professor Baron is very knowledgable. There were 3 assignments the entire semester and a take-home final. You do have to attend lectures and take notes, because not much more than pictures is on her powerpoints so you have to write down what she is saying. Your notes will definitely help you on the final. If you attend her lectures then the reading assignments aren't necessary. My only problem with her throughout the semester was how long she took to grade and respond to emails (she graded one of my assignments that was due in late September in December).", "rating": 5, "expected_grade": "A", "created": "2023-01-13T04:50:34.417966Z"}, {"professor": "Sabrina Baron", "course": "HIST319E", "review": "Dr. Baron is the most accommodating professor I have ever had. Although the lectures are pretty boring, the assignments are all manageable as she is a lenient grader.", "rating": 5, "expected_grade": "A-", "created": "2023-05-07T15:50:41.571116Z"}, {"professor": "Sabrina Baron", "course": "HIST215", "review": "This was the easiest course I have ever taken, it is a literal joke. There a three assignments - a book review, a project, and the final. The project is work 40% of the grade on the only instructions on the rubric beyond guidelines for choosing a topic were to make a powerpoint and make it look nice. I also got a whole letter grade taken off my paper for grammatical mistakes and minor citations errors, so she is one of the most particular graders I have ever come across.", "rating": 2, "expected_grade": "A", "created": "2023-12-13T23:31:14.135488Z"}, {"professor": "Sabrina Baron", "course": "HIST234", "review": "Great professor, really light workload. Class is lecture-only, and readings are not really necessary. There were three assignments that I am sure any competent writer could do very well on. The lectures were interesting, and it was a pretty optimal elective for a somewhat difficult semester.", "rating": 5, "expected_grade": "A+", "created": "2024-01-28T15:08:33.545187Z"}], "name": "Sabrina Baron", "slug": "baron"}