{"courses": ["ENGL101", "ENGL272", "ENGL271", "ARHU309", "UNIV104", "ENGL101S", "ENGL391", "ENGL393", "ENGL101H", "ENGL469G", "ENGL101H", "ENGL352", "ENGL498", "ENGL352", "ENGL498"], "average_rating": 3.8889, "type": "professor", "reviews": [{"professor": "Sabrina Islam", "course": "ENGL101", "review": "Nice and lenient but a bit of a harsh grader in my opinion. Maybe writing just isn't for me though. ", "rating": 4, "expected_grade": "A-", "created": "2019-12-14T02:37:38Z"}, {"professor": "Sabrina Islam", "course": "ENGL101H", "review": "I BSed most of my writing and it was a pretty easy class. She isn't very authoritative and you can literally just not participate in any discussions in Zoom and still get by. Don't think I would have learned much anyways (?) ", "rating": 4, "expected_grade": "A+", "created": "2020-12-09T20:40:06Z"}, {"professor": "Sabrina Islam", "course": "ENGL391", "review": "Sabrina Islam is fine. It's an English class, so the professor doesn't really matter much. I skipped probably about half the lectures, and I'm still doing fine. If you can write decent papers, this class is easy. If you struggle with writing, then you might have some trouble.\r\n\r\nMy biggest complaint is that it takes forever for her to grade papers. Some of the assignment descriptions are kind of hard to get the hang of (maybe I should've gone to class more), so it was hard to tell sometimes if I was really writing about what the paper was supposed to be about. Since it took so long for the grades to come back, it kind of left me in suspense for a long time. Oh well, the grading itself is pretty lenient, or at least I think it was.", "rating": 3, "expected_grade": "A", "created": "2020-12-15T16:36:22Z"}, {"professor": "Sabrina Islam", "course": "ENGL391", "review": "Very kind and clearly passionate about English. Didn't do a great job making the class engaging in the online platform, but would take professional writing with her again if given the opportunity. I always felt encouraged and never walked away from a grade without great and constructive feedback.", "rating": 4, "expected_grade": "A", "created": "2020-12-26T01:22:47Z"}, {"professor": "Sabrina Islam", "course": "ENGL101", "review": "Really nice as a person, not that great of a grader a little too harsh. The classes don't really help just look at the assignment details and you should be fine. if you can't turn in on time shes really nice about it but I would let her know before", "rating": 4, "expected_grade": "", "created": "2021-12-13T02:28:39Z"}, {"professor": "Sabrina Islam", "course": "ENGL101", "review": "She really loves to get to know her students, however, can be harsh in grading compared to when talking to her in class. She takes quite a while to grade anything, as it is coming to the end of the semester with 2 major assignments still not graded. I would take it with her again, but note that you need to put a lot of effort into the papers. ", "rating": 4, "expected_grade": "", "created": "2021-12-16T15:47:16Z"}, {"professor": "Sabrina Islam", "course": "ENGL101", "review": "Professor Islam is a very sweet person and is really passionate about English. Although the classes can get really boring from time to time as we do a lot of textbook reading and brief discussions, the assignments are 100% manageable. There are no tests or quizzes, or reading assigned for homework, but there are a few major writing assignments and one final writing assignment (8 pages) due at the end of the semester (this is technically the final). She gives a lot of time for all her assignments and is lenient with deadlines and extensions, and all the smaller assignments are graded by the TA (you'll almost always get a 100 on them if you do them), and the bigger assignments are graded by the professor. Also, she gives a lot of in-class time to work on assignments due that night or the following morning. The only reason why I rated her 4 stars is because she takes SO LONG to grade and also because the majority of the writing assignments are pretty boring. Aside from those things, I think she's a great teacher, this was a very easy class, and you should take Professor Islam!", "rating": 4, "expected_grade": "A+", "created": "2022-12-15T06:11:48.998396Z"}, {"professor": "Sabrina Islam", "course": "ENGL101", "review": "Professor Islam is so kind and easy to talk to. The course itself is a bit boring with classes mostly consisting of reading the textbook and peer reviews. Honestly, I missed most of the classes by the end of the semester. There are a few major assignments with drafts required so it's easy to manage your time around them (i'm usually a horrible procrastinator with essays). Islam is a bit slow with grading, as the semester ended last week and I'm still not sure what my grade will come out to be.", "rating": 4, "expected_grade": "A-", "created": "2022-12-22T15:33:58.676462Z"}, {"professor": "Sabrina Islam", "course": "ENGL101", "review": "she's incredibly sweet, but incredibly slow at grading. i believe she follows the regular engl101 assignment sequence (academic summary, rhetorical analysis, annotated bibliography, digital forum, position paper), which means that your grade from this class is almost entirely from these five assignments. i thought her pacing was a little off, as she gave us approximately the same amount of time for every one of these assignments when they're all of different lengths. besides that, our homework was always just textbook readings that we would discuss in class (no quizzes or tests). overall a straightforward class that's essentially just busywork, and sabrina is very sweet albeit incredibly slow at grading.", "rating": 4, "expected_grade": "A", "created": "2023-12-11T23:58:36.004310Z"}], "name": "Sabrina Islam", "slug": "islam"}