{"courses": ["GVPT100", "GVPT409D", "GVPT409H", "GVPT201", "GVPT700", "GVPT421", "GVPT424", "GVPT429A", "GVPT309C", "GVPT722", "BSGC399", "GVPT201", "HGLO101", "BSGC399", "GVPT722", "BSGC399", "BSGC399", "HGLO101", "HGLO208", "BSGC399", "GVPT201", "HGLO101", "HGLO208"], "average_rating": 4.1667, "type": "professor", "reviews": [{"professor": "Sarah Croco", "course": null, "review": "Professor Croco is very nice and is a pretty good professor but the class is downright awful. There are ridiculous amount of incredibly tedious homework, all of which are graded. The first exam was really easy, the final exam ended up being curved 15 points because alot of people failed it. The paper was alot work, but was not graded too harshly. Try to get Zack as your TA. Avoid this class like the plague if you are not GOV major.  ", "rating": 3, "expected_grade": "", "created": "2014-11-19T05:01:00Z"}, {"professor": "Sarah Croco", "course": "GVPT100", "review": "I learned a lot in this class... but it was an awful experience. Despite being a 100 level class, it is very difficult. Much harder than it needs to be.\n\r\nThe homework assignments are VERY time consuming and extremely difficult. However, you must do well on them if you want a good grade.\n\r\nThe exams are not bad. Make sure you understand things conceptually and you will do fine on them.\n\r\nDefinitely do not recommend this class unless you need to take it.", "rating": 2, "expected_grade": "", "created": "2013-11-19T22:06:00Z"}, {"professor": "Sarah Croco", "course": "GVPT100", "review": "Professor Croco is a good professor. GVPT100 is a terrible class. Croco goes over the essential concepts in lecture multiple times, so it's easy to figure out what's important and what will be on the exams. She also encourages students to ask questions in lecture, which was really helpful. She speaks very fast and only focussed on one of the two projector screens in a fairly large room, so that was annoying. Overall though, I thought she was good and I actually learned from her.\n\r\nDo not take GVPT100 if you are not a gov major. And if you are, then make sure you do every hw assignment and get a good grade on it, even if you don't understand it. This is basically a gov stat class, so be prepared for that. Also, ask a lot of questions because everything builds on what you learned previously.", "rating": 4, "expected_grade": "A", "created": "2013-05-21T21:46:00Z"}, {"professor": "Sarah Croco", "course": null, "review": "This class is probably one of the best I've taken at UMD. There is a large amount of reading every class (usually 30+ pages), but the reading guides Prof. Croco puts online are helpful for getting through them. The readings themselves are very interesting and cover a lot of international security topics, and we spend a good amount of time in class discussing the material.\n\r\nDefinitely a class for people looking to learn a bit more about the research component of political science, and for getting into heated debates about a variety of issues.", "rating": 5, "expected_grade": "", "created": "2008-11-07T17:59:00Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "A loud and fun personality in the classroom.  GVPT 201 is a dreadful course but if you need to take it, she's the professor you want.", "rating": 5, "expected_grade": "", "created": "2019-05-01T16:55:24Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "Dr. Croco helped enliven an otherwise (kinda) boring stats class. It was a requirement for me (GVPT major). \r\nI had never taken a stats nor programming course before, so I knew it was going to be interesting. There are several (~11) coding HW assignments throughout the semester, but the coding wkbk kind of *gives* you the code to rework. Yes, it’s time-consuming, but it’s a lot easier once you get into a habit.\r\nMake sure to read the chapter in the textbook *before* lecture, otherwise you’ll fall behind quickly.\r\nI also found it easy to schedule office hrs with my TA to discuss some minor coding stuff, and stop by Dr. Croco’s during open office hrs to ask questions.", "rating": 5, "expected_grade": "A+", "created": "2019-12-18T02:38:30Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "Words cannot express how much this course ruined my semester.  BUT Croco is awesome and keeps the lectures very entertaining.  She is a great prof, but your TA's run the show.  They're the ones grading your assignments and teaching you the detailed stuff.  Exams are no joke.", "rating": 5, "expected_grade": "B-", "created": "2020-06-13T02:33:48Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "This class is not fun but Professor Croco is so entertaining. It's essentially a statistics and coding class. Not sure why it's labeled a gov class. Glad I'm done with it. ", "rating": 3, "expected_grade": "A-", "created": "2020-11-24T00:20:49Z"}, {"professor": "Sarah Croco", "course": "GVPT309C", "review": "I love Professor Croco. She's so entertaining, and can make any difficult topic much more fun. Super reasonable and predictable work load in my opinion, and no midterm or final exam for this class! ", "rating": 5, "expected_grade": "A", "created": "2021-03-25T19:28:50Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "While she is a nice teacher, she barely discussed coding which is a vital CRUCIAL part of this course. I'm not sure why she didn't discuss coding more. However, if you asked her about it outside of class she was helpful. Be aware, however, that this class is very boring and requires persistence to get an A especially if you have no coding experience like I did.", "rating": 3, "expected_grade": "A", "created": "2022-08-05T18:24:51Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "First thing: this course has a lot of reading, but you are reading actual books rather than textbooks, so it's not that bad. Also a lot of coding in R - this course is basically an introduction to using data science for politics/government. She does not teach the coding in class, but she does record tutorials and its especially not that bad if you know how to use Google. \r\n\r\nCoding assignments were once a week making a graph from a dataset. Aside from coding assignments, all other work was very easy, just a paragraph reflection and meme based on the readings for that week. Lectures were fun and she is very entertaining, definitely recommend especially if you're interested in data, but even if you're not.", "rating": 5, "expected_grade": "A+", "created": "2022-12-01T23:05:27.348995Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "I agree with the other reviews - avoid this class at all costs, but if you MUST take it, then you want this professor. She records each lecture and uploads them so attendance is not necessary. I did not go to class and it made our two exams very difficult, but I would rather cram the week of if it meant my weekly schedule was lighter. They are online and the second is worth much more points. The HW consists of a coding assignment each week due Wed night at 11:59 (based on accuracy). Our class did so bad as a whole, she curved the final 19 points- the mean was a 71, so basically a D. She is generous when she needs to be and is very good at addressing issues, answering questions, and being clear about what is to be expected. TA's go over homework code in sections so attendance for those are required and HELPFUL. She seems intimidating on day one, don't let that scare you off. It is not her fault this class sucks, she even said she is required to teach some things even if she doesn't think we will ever use it.", "rating": 5, "expected_grade": "B+", "created": "2022-12-13T06:35:39.024447Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "I really liked professor croco. Her lectures can be kinda boring but she makes it as engaging and fun as possible. Honestly, her assignments are super cool if you let them be. The final memo was super fun to do, which I know sounds crazy to say about a 4 page regression analysis. GVPT201 has a bad reputation but croco will make sure you are taken care of", "rating": 4, "expected_grade": "A", "created": "2022-12-17T04:39:09.583199Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "When I initially signed up for this course, all I had heard was how much of a nightmare it could be. However, Dr. Croco was AMAZING. Her lectures are great and I highly recommend listening to them a few times to comprehend the material. The coding seems intimidating at first, but as long as you attend discussion and read the workbook, you will be fine. Also, do not be afraid to reach out to Dr. Croco, she is always happy to answer questions and will respond very quickly. If you are interested in political science research, then take this class!!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T02:53:56.245355Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "This class is mostly about stats and that jazz and basically serves as an intro to political research. It's boring, but she tries her best to make it interesting. R is used in this class like a calculator and you have coding assignments every week. Go to discussion for participation points. Other than that, the exams scores weren't the greatest and even though she said that she wouldn't give extra credit, she had like two extra credit opportunities.", "rating": 4, "expected_grade": "A", "created": "2023-01-09T20:33:43.163474Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "If you are in Global Communities read this review carefully. Shes the only teacher who teaches this course. We were the first class to ever have her and take this course and thought it felt disorganized at times, it was a great class. Dr Croco is incredibly kind and passionate about what she does and comes to dorchester events to meet the students. She is the best. People really just hated on her because the course had coding assignments (which are so easy...and I HATE computer science). The class is literally so easy. We have a weekly reading that you have to write a 250 word reflection, a meme assignment, and a mini coding assignment (which is again...so easy). Love Dr Croco. There is no exams for this class nor is there a final.", "rating": 5, "expected_grade": "A+", "created": "2023-01-19T19:09:34.087682Z"}, {"professor": "Sarah Croco", "course": "GVPT309C", "review": "im not sure if this class is coming back but it was realllllly really cool to have guest lecturers. the workload was so little so we could focus more on enjoying the content.", "rating": 5, "expected_grade": "A+", "created": "2023-02-18T06:02:01.798727Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "If you like coding in R and reading PoliSci books then this class is for you. If not this is a great class to do HW in. Dr. Croco uses her time to repeat verbatim things you read that week. Each week you must write a reflection and create a meme, both of which are easy. If Dan is your TA you will be in luck, an amazing guy who is super helpful on all R assignments. The code can be hard to get the hang of and made me want to drop Honors but once you get over the learning curve you'll realize that Dr. Croco is right about all the benefits of knowing R.  \r\n\r\nDr. Croco does try to incorporate student input and make her classes more engaging. This was the first year so I'm sure it will only get better. Attendance is not required and there are no tests. The final project is also very easy.", "rating": 3, "expected_grade": "A+", "created": "2023-04-26T02:28:26.192773Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "overall:\r\nso this class was definitely difficult at first, but after some time you start to get used to it. you learn how to use r-studio which isn't easy but as long as you go to discussion and use the textbook you'll be fine. the midterm was a lot of material, but the project she has you do at the end really boosts your grade and is pretty easy. the final was a bit easier than the midterm and there was a big curve at the end. she also gave my class extra credit opportunities. her lectures are pretty interesting and I would definitely recommend going in person instead of watching her online. discussion sections are boring but do go because they take attendance and my TA would work through our homework problems to give us answers which helped my grade a lot \r\n\r\nrecommendations/heads up\r\ngo to discussion, go to lectures in person, give yourself time to do the homework assignments (your TA will be your best friend for the homework assignments), take time to study the midterm and you'll be good", "rating": 4, "expected_grade": "A+", "created": "2023-05-10T16:04:42.159545Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "I did not like Dr. Croco at first, but she has grown on me this past year. HGLO101 forces you to learn how to code with R, and Dr. Croco does not give much instruction on what to do. She posts some video walkthroughs and assigns readings but there are not really any lectures devoted to learning R. But, as a member of HGC, I was prepared for GVPT201 since I learned R from HGLO101. Dr. Croco really cares about her students and is very willing to help.", "rating": 4, "expected_grade": "A+", "created": "2023-05-12T16:47:48.883781Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "I had Dr. Croco during my first semester of college (Fall 2022). It also was the first semester this class was taught. She was an excellent professor. This class' content was easy, and it was graded fairly. All around good and easy class.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T20:04:10.843343Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "Dr. Croco is a really nice and understanding professor who really cares for her students. She is very engaging and friendly and it is very obvious that she actually loves what she does. \r\nRegarding the class, the work load wasn't hard when it came to the reflections and readings. The books were not that bad although some were very boring reads. My BIGGEST complaint about this class was learning R and the coding assignments for it. When I tell you they are bad, THEY ARE BAD. If you are not into tech, it will be a huge struggle. Dr. Croco was great at teaching everything BUT R. She didn't know how to explain the work and when you asked her for help, she would tell you to either collaborate with others are look it up online (which didn't help because R code you would find online is too advanced for this class). I feel if a professor is recommending you to use Chat GPT then something is wrong with how the class is being taught. \r\nI would say this class overall is 3/4 stars just because of how bad the R assignments were.", "rating": 4, "expected_grade": "A+", "created": "2023-12-15T17:29:11.779278Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "Dr. Croco is a great person and she is so sweet outside of class, so this review is not against her as a person, just her teaching style.\r\nFirst of all, the books we read and the reflections we had to do with them were very easy, that was never an issue. Sometimes she would assign like 200 pages of reading a week, which was annoying but that was so easy compared to the coding.\r\nIf you have never coded before, this class is going to be very difficult for you. Dr. Croco is very bad at teaching R. She doesn't give any support and expects us to know a lot right from the beginning. The pace we move at is so unbearable, and often Dr. Croco doesn't even know stuff. She tells us to use ChatGPT and google a lot, but those offer such immense resources that it is difficult to even know what to Google. The coding assignments are due on Wednesday which makes it very difficult to keep up with. Overall, find people in the class who have coding experience and work together with them because it will be so difficult if not.", "rating": 3, "expected_grade": "A+", "created": "2023-12-15T17:44:33.198014Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "Professor Croco is incredibly kind, easygoing, and funny. There is not a professor that is better than her at being personable and helpful. On the other hand, the class is slightly boring. The books are boring and get worse as the semester goes on. You will hate R at some point just because. I promise. However, to resolve any R issues, just ask her or either of the TAs because they are always there to help.", "rating": 4, "expected_grade": "A+", "created": "2024-01-03T22:10:46.443075Z"}], "name": "Sarah Croco", "slug": "croco"}