{"courses": ["AASP100", "AASP402", "AASP310", "AASP498M", "AASP399", "AASP211", "AASP100H", "AASP100", "AASP100", "AASP100", "AASP211", "AASP211", "AASP211", "AASP211", "AASP100", "AASP100", "AASP211", "AASP100", "AASP479"], "average_rating": 4.8, "type": "professor", "reviews": [{"professor": "Shane Walsh", "course": "AASP100", "review": "Dr. Walsh is very passionate about African American History and is very qualifed to teach the subject. However, he tells you to purchase a $90 book, but it isn't required to do well in the class. The class has very few assignments so be sure to do well on them. ", "rating": 4, "expected_grade": "A-", "created": "2020-08-22T00:46:59Z"}, {"professor": "Shane Walsh", "course": "AASP100", "review": "He was a really nice Professor and very understanding too. I have ADHD to sometime it made paying attention a little hard but thankfully he was very understanding as well. His lecture for my class were Mondays through videos and the rest of the class was through zoom so it was pretty nice. But as long as you watch the lecture you'll be ok with the weekly assignment and heads up the essays were 1,000 words for my class but he gave us time just make sure you start early. ", "rating": 5, "expected_grade": "A-", "created": "2021-01-08T02:59:03Z"}, {"professor": "Shane Walsh", "course": "AASP100", "review": "Dr. Walsh is well overqualified to teach this class. He's super passionate about this topic, so he likes to go off sometimes, but it still connects to the information on the PowerPoint and honestly helps me remember everything. The class is super chill, you just have to pay attention and mark down a couple key facts about each main person he goes over. This class does have like five graded assignments besides the final, so just make sure you do well with them. A couple of them are essays, but they are definitely manageable. Overall, pretty good class.", "rating": 5, "expected_grade": "A+", "created": "2022-01-05T02:19:44Z"}, {"professor": "Shane Walsh", "course": "AASP211", "review": "I took this class with both Dr. Walsh and Dr. Nichols. They are both pretty chill and funny and Dr. Walsh is very intelligent and super passionate about this topic, so he likes to go off sometimes, but it still connects to the information. Between Dr. Walsh and Dr. Nichols, Dr. Walsh seemed a lot more professional and structured throughout the course. The class is super chill, it's an open dialogue where anybody can speak or because we had 100+ people on zoom this semester, you can get away with lurking and only listening. We watched the Get Out movie in this class and wrote two essays on it. However, the only other grades in the courses are 5 quizzes and 3 more essays which are not directly on the movie but rather, on race issues, and black history in general. It takes VERY long to get grades back, however, and there is little to no feedback on the essays throughout the course. ", "rating": 5, "expected_grade": "A", "created": "2022-04-08T04:23:59Z"}, {"professor": "Shane Walsh", "course": "AASP211", "review": "I took this class as an international student, which gave me a large amount of information about the segregation and inequality in the U.S from the Black people's side. Furthermore, the professor is extremely structured and well-formate with the lecture and flexible with the due date. I highly recommend this course and professor if you prefer to understand the social problem from another angle or fulfill the degree requirement with a meaningful A.", "rating": 5, "expected_grade": "A+", "created": "2022-08-23T19:19:45.353307Z"}, {"professor": "Shane Walsh", "course": "AASP100", "review": "I took him to get a GEN ED credit, trust me I only went to lecture about 5 times in total and I ended up with an A. I am not advising you to miss most of the semester but he is just a very great professor. Every time I attended his lecture he was very passionate about what he thought and if you need a history credit don't shy from taking this class with him. The semester I took him he had only 1 in-person quiz the rest I mean everything else was done online. When it comes to the class very easy class if you do pay attention and go to class but if not then everything is online/open-book so yea.", "rating": 5, "expected_grade": "A", "created": "2023-01-21T19:40:42.116421Z"}, {"professor": "Shane Walsh", "course": "AASP100", "review": "I had down syndrome, but this course was very easy.", "rating": 5, "expected_grade": "A+", "created": "2023-02-20T17:14:21.806115Z"}, {"professor": "Shane Walsh", "course": "AASP100", "review": "Pretty easy gen ed class and a decent professor.  This course shouldn't take too much of your time.  However, I am not a big of a fan of his lecturing method in class.  He often zips by lecture slides pretty fast that you barely have any time to write down notes or even pay attention to what he's saying before moving on, so I just resorted to taking pictures of the slides in class.   Professor Walsh is very understanding though.", "rating": 4, "expected_grade": "A", "created": "2023-05-06T15:08:51.305098Z"}, {"professor": "Shane Walsh", "course": "AASP100", "review": "I took this class as a gen ed. It's a really easy class, only a midterm and a final. There were weekly quizzes (not in class, online usually due by Sunday) but they stopped about halfway through the semester, not sure why. He is a little slow with grading, but he's extremely fair and generous. The only thing I would say is to make sure you go to class because he doesn't post slides. The slides do have a lot of information, but I just take pictures of them and type them up after class.", "rating": 5, "expected_grade": "A", "created": "2023-05-22T00:25:05.969478Z"}, {"professor": "Shane Walsh", "course": "AASP211", "review": "TAKE TAKE TAKE this class for a gen ed or elective. EASY A!!!! It meets once a week for 2.5 hours but the entire time is watching a movie/videos and having a discussion. There were a couple quizzes online at home based on readings and two papers but they were only 1 page each and the quizzes weren't hard. You also get plenty of time to complete them. The final exam was just a powerpoint presentation where you pick any topic you want that was covered in class and make a presentation on it. You don't have to present it just do a voice recording that has to be 10 minutes long. There is also a participation grade that was basically breaking into small groups and you wrote ur name on a paper to show that you were there, but you don't know which class it'll be in so you need to go to them all. However, the classes were very interesting to hear them talk about different topics so you wouldn't want to skip anyways. TAKE THIS CLASS", "rating": 5, "expected_grade": "A", "created": "2023-11-30T04:03:28.624894Z"}], "name": "Shane Walsh", "slug": "walsh_shane"}