{"courses": ["ENGL398V", "ENGL393", "ENGL101", "ENGL391", "ENGL257"], "average_rating": 4.75, "type": "professor", "reviews": [{"professor": "Shannon Zellars Strohl", "course": "ENGL391", "review": "Prof Zellars Strohl was really helpful whenever I had questions about the major assignments. I found myself going to her (online) office hours a couple of times throughout the semester. However, I did find she graded a little harshly and left little comments about how to improve. I did a blended setting (so one day was synchronous while the other was not); I personally think the synchronous meetings were not productive for me to get anything out of it, but they were okay.", "rating": 4, "expected_grade": "A", "created": "2021-01-12T07:52:03Z"}, {"professor": "Shannon Zellars Strohl", "course": "ENGL101", "review": "Professor Zellars Strohl is an excellent professor. She's not strict and she is very lenient on grading. I've known classmates who would turn in assignments WEEKS late and she would grade as normal. Although you will never get a 100% in her class (because she never gives out 100s from my understanding), it's almost impossible to get lower than a B- unless you totally don't do the work. Her peer reviews and comments are very useful when improving your work and can definitely change your writing for future assignments. If you do get her, have fun but don't slack off.", "rating": 5, "expected_grade": "A-", "created": "2022-01-05T03:50:02Z"}, {"professor": "Shannon Zellars Strohl", "course": "ENGL101", "review": "I was initially off-put by her negative reviews on ratemyprofessor, but Professor Zellars-Strohl was awesome. Really lenient grader as long as you follow the rubric/guidelines and is super acommodating with due dates. The class itself was online and insanely boring, and I don't feel like I learned much, but there's only so much you can do with an online class. Also, she didn't give me much feedback on assignments. Definitely take her for engl101.", "rating": 4, "expected_grade": "A", "created": "2022-12-16T19:20:31.518449Z"}, {"professor": "Shannon Zellars Strohl", "course": "ENGL393", "review": "She's a nice professor and helpful when asking her questions. She's also lenient on due dates if you explain why. Overall she's a good professor to take to get the professional writing gen ed.", "rating": 5, "expected_grade": "A", "created": "2022-12-21T05:47:30.218898Z"}, {"professor": "Shannon Zellars Strohl", "course": "ENGL393", "review": "Just a heads up, you will never receive a 100% on any of the major assignments. She never gives them out, and sometimes she will not clarify in the rubric the exact reason she took the point off in the rubric. However, take advantage of the peer reviews and complete all the discussion boards and you will do fine in this class.", "rating": 5, "expected_grade": "A+", "created": "2023-05-21T21:50:50.586970Z"}, {"professor": "Shannon Zellars Strohl", "course": "ENGL393", "review": "Take ENGL393 with Professor Zellars-Strohl if you can. If you make an effort on the assignments, you should have no problem getting an A in the class. This class being online was also very convenient as you don't have to go in person to lectures.", "rating": 5, "expected_grade": "A", "created": "2023-12-24T15:27:36.809444Z"}, {"professor": "Shannon Zellars Strohl", "course": "ENGL393", "review": "Professor Zellars Strohl provided everything we needed for this course very well. This course was an online course that didn't involve any set time during the week. We were basically just expected to hand in assignments on Mondays and Thursdays as they were due. Assignments consisted of reading, discussions, 3 major assignment drafts/submissions (Resume/Cover letter, Technical Report, Infographic, Personal Website), and peer review. \r\n\r\nPros:\r\n- Very descriptive and helpful in the modules. She included everything that we needed to know and ELMS was very organized. All of the assignments are in ELMS from the start of the semester. I was never confused on what was due or what we had to do. I never interacted with the professor at all really since everything was super clear from the start.\r\n- Well structured assignments. She had us basically plan and set up all of our major assignments from the ground up, which was very helpful and made them seem not so big. I spent a few hours working on each of these assignments, so it did not take up too much time.\r\n- The major assignments gave us valuable skills such as writing cover letters, resumes, technical reports, and creating our own website. These made for a good experience and make us more employable.\r\n- As long as you completed the requirements, and put in some good effort into the major assignments, you will get an A. I accidentally submitted one of the discussions late but I didn't lose credit, so she is pretty lenient.\r\n\r\nCons:\r\n- I didn't really receive too much feedback on the major assignments. She often took off a few points without explanation. It's fine though as it doesn't really affect your grade all that much.\r\n\r\nOverall I would recommend this professor for ENGL393. I learned a lot of applicable skills.", "rating": 5, "expected_grade": "A", "created": "2023-12-24T19:43:27.441767Z"}, {"professor": "Shannon Zellars Strohl", "course": "ENGL257", "review": "Absolutely loved her for this course! The whole thing was online but she was so accommodating and kept the class fun and light. Class discussions were always so robust and interesting, and you could tell as a class we were really all on the same page and did the readings we had to do for the day. Workload is quite light, with the occasional assignment on days where we might not meet over Zoom or if a book took more than one class to cover. The readings and her book selections were great and I enjoyed all of them. It is obvious that there's going to be a decent amount of reading for the course, but as someone who doesn't like reading that much anyway, I found it quite easy to manage and complete in the time she gave us (usually a lot of time), and the books were interesting, which made it easier as well. My only negative is that she doesn't use rubrics for her assignments, and I wish she did, just so things could be made clearer and there would be less confusion on what is expected.", "rating": 5, "expected_grade": "A+", "created": "2024-01-10T02:29:46.235079Z"}], "name": "Shannon Zellars Strohl", "slug": "strohl"}