{"courses": ["BUMO720", "BUSO706", "BUSI758N", "BUSI602", "BMGT364", "BMGT758O", "BUSM758O", "BMGT289J", "BMGT364", "BMGT600", "BUSI712", "BUSM600", "BUSO706", "BMGT364", "BMGT758O", "BUSO706", "BMGT758K", "BUSI718C", "BUSI758N", "BUSM758O", "BMGT600", "BUSM600", "BMGT363", "BMGT461", "BMGT461N", "BUSO600", "BMGT461", "BMGT461N", "BMGT758O", "BUSM758O", "BUSO706", "BUSO712", "BMGT363", "BMGT461", "BMGT461N", "BUSO600"], "average_rating": 1.8333, "type": "professor", "reviews": [{"professor": "Sheetal Singh", "course": "BMGT364", "review": "Easy grader, but the class is horribly mismanaged.  I spent more time trying to figure out what was due than I did on the assignments themselves.  She is an incredibly well qualified professor, it just seemed that this class was an afterthought for her. I would not take any other classes with her.", "rating": 1, "expected_grade": "A", "created": "2020-12-15T18:11:43Z"}, {"professor": "Sheetal Singh", "course": "BUSI718C", "review": "The professor relies on her TA for grading.  The grades seem to be just numbers picked out of a hat and assigned to the students. Professor Singh doesn’t provide any relevant or timely feedback with her scores and her communication with course material is provided too late (or is just too confusing/wrong on the Canvas site). The class consisted of students teaching themselves the content before every class, submitting homework, doing a light discussion of what we thought our answers should be during class, then spending the rest of class hearing about her work experience. I would not recommend the class or her as a professor. She didn’t really seem to care all that much considering the course content was taken from the other professor that was also teaching the class, but with a different section.  I personally have no plans to take a course of hers again.", "rating": 1, "expected_grade": "A-", "created": "2023-01-24T02:41:58.351441Z"}, {"professor": "Sheetal Singh", "course": null, "review": "Do not take her. She literally doesn’t even know the course structure and relies entirely on her TAs. She may be a good speaker but that’s it. She doesn’t know what she’s doing at all. We literally have to remind her everytime that there is an exam coming up. When we ask her questions, she has to rely on the TAs to answer. Her grading is arbitrary and entire based on her mood. Maybe if she was as intuitive as she thinks she is, then she would realize all her students know she’s not qualified.", "rating": 1, "expected_grade": "", "created": "2023-04-12T19:52:54.895557Z"}, {"professor": "Sheetal Singh", "course": "BMGT364", "review": "If she was truly as insightful and intuitive as she believes she is, she would realize that her students don't actually respect or think she's well qualified. We literally have to remind her when exams are.", "rating": 1, "expected_grade": "", "created": "2023-04-16T19:23:26.690070Z"}, {"professor": "Sheetal Singh", "course": "BMGT758O", "review": "I'm shocked at all of these negative reviews. She's very kind and has good relationships with so many of her students. She responds to emails quickly and is understanding, and does her best to make class fun. Idk if it's just this particular class but I've had zero issues with her. I'd definitely recommend", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T18:30:27.935678Z"}, {"professor": "Sheetal Singh", "course": "BUSM600", "review": "I was puzzled each time by the lack of scheduling of the classes.\r\nWe were told at the beginning of every class that the correct information was consolidated on the canvas, but the information was not updated and the materials were still attached with last year's materials, so I did not know what I should prepare in advance. In many cases, the classes seemed to be conducted on impulse, and we were not able to learn efficiently because we did not cover what we had prepared, or we suddenly had to deal with different topics.", "rating": 1, "expected_grade": "", "created": "2023-05-17T13:06:16.292357Z"}, {"professor": "Sheetal Singh", "course": "BMGT364", "review": "Very nice and personable, but it is clear that she did not make the syllabus for this course because she never knows the answers to anything regarding deadlines, assignments, grades, etc. Everything was always “I’ll get back to you”. Assignments are generally easy but test are unnecessarily very difficult and averages on each one was in the 70s. If possible, take someone else for this course.", "rating": 3, "expected_grade": "A-", "created": "2023-05-21T16:26:11.330230Z"}, {"professor": "Sheetal Singh", "course": "BMGT364", "review": "The lecture is not useful to go to and will not help for the exam, but you have to go for class participation. You will get a 5/10 each week whether you attend lectures or not.  You need to actually raise your hand and participate a lot to get a 10/10, raise your hand once you will maybe get a 8/10.  Exams are based mostly on textbooks.  She said she would curve the class and then never did in the end. An A is a 94, not a 93 which is absurd. She relies on her TA for everything.  She has a difficult time backing her own answers when refuting why my exam answer is correct and explaining my reasoning.  Take it with a different professor.", "rating": 1, "expected_grade": "A-", "created": "2023-05-27T18:20:25.822046Z"}, {"professor": "Sheetal Singh", "course": "BMGT364", "review": "took her spring 2023. absolutely terrible. So unorganized, dumb assignments that teach nothing, exams that are way harder than they need to be. Does not know Jack about the course and relies on the TA for EVERYTHING. I did not know a single person who enjoyed this class. she promised a curve which she never delivered, because \"we didn't need it\". She told us a 93 was an A, but I found out AFTER grades were due, it was an A-. Don't listen to her promises. She talks more about herself and her family than teaches the course.  You HAVE to participate at least once a class period, which is incredibly unnecessary. Just terrible.", "rating": 1, "expected_grade": "A-", "created": "2023-09-09T16:18:13.995820Z"}, {"professor": "Sheetal Singh", "course": null, "review": "super unorganized and professor will blame students for not understanding assignment when it was her fault for not making it clear what we should do. considering it's a management leadership class, she's displaying very poor management and leadership skills. Her and her TA seem to have a lot of miscommunications which impact the class.", "rating": 2, "expected_grade": "A", "created": "2023-11-06T17:35:05.194758Z"}, {"professor": "Sheetal Singh", "course": "BMGT363", "review": "She is an okay professor. Don't need to buy the textbook. Rely on the slides and you will be fine. Group project is involved. TA does most of the work. So, don't bother asking questions to the professor.", "rating": 3, "expected_grade": "", "created": "2023-12-12T04:18:32.018040Z"}, {"professor": "Sheetal Singh", "course": "BMGT363", "review": "She's very unorganized and seemed to put little thought into this class. All the class materials on Canvas were copied from another professor including every single assignment and the syllabus so every assignment had the wrong due date and instructions and she wouldn't update them until like 2 days before the assignment was due. Going to class was pointless because you basically learn two things the whole semester and she spends the whole lecture asking subjective questions and then telling people they're wrong when they try to answer. This class was pretty easy but her teaching style was frustratingly lax and unprepared.", "rating": 2, "expected_grade": "A", "created": "2023-12-14T19:09:22.649676Z"}], "name": "Sheetal Singh", "slug": "singh_sheetal"}