{"courses": ["ENGL393X", "ENGL101H", "ENGL393X", "ENGL398C", "ENGL297", "ENGL393X", "ENGL393X"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Sonney Wolfe", "course": "ENGL101", "review": "Sonney is a really nice professor. She is flexible and understanding of any issues students are having. Some assignments could be lengthy but are graded quite leniently. Other than essay assignments, there is 1 presentation that is only required to be recorded, and there are no exams/finals. She does not mind absences as long as you email her beforehand. Overall, this class is very easy and I definitely recommend it to anyone requiring to take 101 or in need of an easy A.", "rating": 5, "expected_grade": "A+", "created": "2022-11-28T20:00:25.675373Z"}, {"professor": "Sonney Wolfe", "course": "ENGL101", "review": "She's a great instructor for the class, was always very accommodating and nice throughout lectures. She was very generous with my late grades fortunately even though the class was easy enough that I shouldn't have turned anything in late.\r\n\r\nEvery time students become confused at certain parts of assignments, she would gladly clarify and even change certain requirements for projects that she didn't see were important. Assignments weren't too hard inherently but that's due to the department. \r\n\r\nThere may be some better ENGL101 professors out there but I had a great enough time with Sonney Wolfe that if you're worried about taking her class, just know that you won't be stuck with an unreasonable and awful teacher.", "rating": 5, "expected_grade": "A", "created": "2022-12-07T15:03:41.430224Z"}, {"professor": "Sonney Wolfe", "course": "ENGL101", "review": "Sonney is an awesome professor and person. She is so sweet and so understanding of students' needs. She is very willing to work with students around deadlines and genuinely wants every student to succeed. She is very smart and funny and I highly highly recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-05-03T23:35:56.800049Z"}, {"professor": "Sonney Wolfe", "course": "ENGL101H", "review": "- Gives extensions any time you need it\r\n- Will often take off one or two of the major papers if the class is behind (which is normal)\r\n- Made the class so easy for every student and will make sure you are supported to get a good grade on every assignment\r\n- Class load was also not bad whatsoever, just don't procrastinate your essays and this class will give you little to no stress with Professor Wolfe.\r\n- Take this class with Professor Wolfe, I am willing to bet there isn't a better professor", "rating": 5, "expected_grade": "A", "created": "2023-05-04T16:36:10.915118Z"}, {"professor": "Sonney Wolfe", "course": "ENGL101H", "review": "Best Professor in the English Dept. \r\nTake this class she is the most caring and understanding person, gets to know her students and has fun with the class, and makes all of the papers as easy to understand as possible.", "rating": 5, "expected_grade": "A", "created": "2023-05-09T05:18:00.620800Z"}, {"professor": "Sonney Wolfe", "course": "ENGL101", "review": "Very understanding and caring professor. Due to personal circumstances, I had to ask for extensions on assignments several times, and she was completely understanding. Sonney Wolfe is also a great instructor and very approachable when you have questions. I would recommend taking a class with her if you can.", "rating": 5, "expected_grade": "A", "created": "2023-08-14T19:41:43.965113Z"}, {"professor": "Sonney Wolfe", "course": "ENGL101", "review": "Sonney is a great professor and an even better person. ENGL101 is known to be a pain in the ass, but she makes her class as fair as possible. She understands her students and treats you humanly, and works with us to make a healthy classroom environment. If you follow instructions and complete all the work you'll very likely end up with an A. I'd definitely recommend.", "rating": 5, "expected_grade": "A", "created": "2023-11-20T02:54:28.105849Z"}, {"professor": "Sonney Wolfe", "course": "ENGL393", "review": "If I could give a rating higher than a 5 then I definitely would! Sonney is an amazing professor and a very nice person. She is fair with all her assignments, understanding when it comes to deadlines, and really helpful when it comes to feedback. She is a great personality that will make you want to come to class every time! Definitely take any class she teaches if possible!", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T03:06:44.849310Z"}, {"professor": "Sonney Wolfe", "course": "ENGL101", "review": "Kind, understanding, and so easy to talk to. 100% take her if you can, i would love to have her as a professor again.", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T21:41:34.245738Z"}, {"professor": "Sonney Wolfe", "course": "ENGL101", "review": "Sonney is an amazing English teacher, and probably one of the most down-to-earth and connected teachers I've ever had. She is extremely flexible with due dates and often pushes back assignments when necessary due to the class being behind. She also gives precise and detailed feedback on papers, and it truly feels like she is invested in your success throughout the class. Sonney grades quite leniently, and it's pretty easy to do well on papers if you put in the work and don't procrastinate on papers.", "rating": 5, "expected_grade": "A", "created": "2023-12-22T00:20:40.680711Z"}, {"professor": "Sonney Wolfe", "course": "ENGL398C", "review": "I kept a 99.8% in the course. Highly recommend Sonney, as she is very understanding, takes time to go through feedback with you if you ask her.", "rating": 5, "expected_grade": "A+", "created": "2024-01-09T04:10:58.515351Z"}, {"professor": "Sonney Wolfe", "course": "ENGL393", "review": "If I had the option to give a 10-star rating, I certainly would. Sonney is truly an incredible and empathetic professor. She communicates every assignment's requirements clearly, promptly responds to students' feedback and requests, and delivers engaging lectures. Despite having a class from 6 to 9 pm on Tuesdays, I always looked forward to attending because of her lovely energy and positive vibe. It's evident that she enjoys her job, and her upbeat attitude brings joy to the students. If you have the opportunity to choose Sonney for any ENGL course, I highly recommend doing so!", "rating": 5, "expected_grade": "A", "created": "2024-01-11T14:44:54.637752Z"}, {"professor": "Sonney Wolfe", "course": "ENGL101", "review": "An amazing professor! She really cares about her students. She provides a lot of feedback as well to improve your writing. She makes the assignments very easy to understand. Overall she makes the class enjoyable and interesting.", "rating": 5, "expected_grade": "A-", "created": "2024-01-19T18:09:59.286216Z"}], "name": "Sonney Wolfe", "slug": "wolfe_sonney"}