{"courses": ["GVPT354", "GVPT356", "CPSN230", "CPSN240", "CPSN250", "CPSN100", "CPSN101", "CPSP359N", "CPSN230", "GVPT356", "GVPT105S", "CPSN100", "CPSN230", "CPSN240", "GVPT356", "CPSN101", "GVPT105S", "GVPT356", "CPSN100", "CPSN230", "CPSN240", "CPSP218N", "GVPT356", "CPSN101", "GVPT356", "GVPT356"], "average_rating": 2.8462, "type": "professor", "reviews": [{"professor": "Stacy Kosko", "course": null, "review": "Honestly, one of the best classes I have ever taken at UMD. Dr. Kosko cares so much for her students and she truly wants us to understand the material. I have learned so much and cannot wait to take another class with her. ", "rating": 5, "expected_grade": "A", "created": "2020-12-21T19:24:41Z"}, {"professor": "Stacy Kosko", "course": "CPSN100", "review": "This class is super boring. I would not take it if it wasn't required. We aren't allowed to use our computers for notes, so we all basically just sit there for an 1.5 hr class and try not to fall asleep. The TAs and the professor all grade differently, the assignments that we were given didn't have a rubric and we were not properly prepared for them. Although there is barely ever any homework, it takes super long to get graded. Dr. Kosko doesn't really know how to lecture and the lessons are poorly planned.", "rating": 2, "expected_grade": "A", "created": "2021-12-03T21:22:38Z"}, {"professor": "Stacy Kosko", "course": "CPSN100", "review": "Not a bad teacher at all but DO NOT TAKE INTERNATIONAL STUDIES. Dr. Kosko was only just appointed the director of the IS program and the previous director left a terrible curriculum that doesn't fit with her teaching style at all. For all future scholars programs students, *please* switch to something else. ", "rating": 2, "expected_grade": "A", "created": "2021-12-06T03:11:18Z"}, {"professor": "Stacy Kosko", "course": "CPSN100", "review": "Horrible professor! Rude to students, irrelevant assignments, unknowledgeable on the topics she teaches -- it's as if she was chosen off the street to teach this course. She also loves to talk about herself, but she does not like to acknowledge or discuss other students' opinions. Keep an eye out for her knitting in the back of class while other people are presenting their hard work!", "rating": 1, "expected_grade": "A", "created": "2021-12-08T02:57:49Z"}, {"professor": "Stacy Kosko", "course": "CPSN100", "review": "The class is very easy, the TA's are awesome. Stacy doesnt know what was going on though.", "rating": 3, "expected_grade": "A", "created": "2021-12-08T19:36:52Z"}, {"professor": "Stacy Kosko", "course": "CPSN100", "review": "Dr. Kosko is very knowledgable on International Studies and shows it in the class.  She is a good person and cares for her students.  She was very accommodating for me when one of my family members passed away.  I feel like since she is a new director, she is still trying to figure out how to structure the class.  All in all, she is doing the best with what she has.  If you are interested in global issues definitely pick International Studies as your scholars program.  ", "rating": 4, "expected_grade": "A", "created": "2021-12-11T21:48:08Z"}, {"professor": "Stacy Kosko", "course": "CPSN100", "review": "I honestly don't know what all of the other reviews are talking about. Dr. Kosko is great! She is very caring and kind to her students. She is actually VERY knowledgeable on the topics she discusses and is able to answer almost every question the students through at her, no matter how random or specific of a question is may be. She seems like a walking encyclopedia to me! And I actually find her lectures to be very entertaining and interesting. After her lecture on international development, I began strongly considering going into that field as a career, even though I walked into that lecture completely disinterested in it. I genuinely look forward to her lectures and the class was my favorite of the semester because Dr. Kosko made the lectures so exciting and even funny at times. However, she is very slow at responding to her students. Every time I have emailed her it has taken about a week or longer to get a response, and sometimes I don't get a response at all. The grades do typically come back slowly, but the TAs grade all of my assignments, not Dr. Kosko.", "rating": 4, "expected_grade": "A+", "created": "2021-12-12T00:29:02Z"}, {"professor": "Stacy Kosko", "course": "CPSN100", "review": "The lessons are not planned well, and the lectures are extremely boring. She has also completely changed the curriculum from International Studies to International Ethics. If you are not interested in that, DO NOT take this class", "rating": 1, "expected_grade": "A+", "created": "2022-03-30T00:29:28Z"}, {"professor": "Stacy Kosko", "course": "CPSN101", "review": "This honestly wasn't that bad of a class. Boring, but not that bad. We had to write a bunch of reflections, but that really didn't take a long time. I think that International Studies definitely isn't for me based on how it is structured and presented, but it would definitely be interesting for someone who likes learning about political ethics and global development/solutions. Also, there were some \"field trips\" for this class and I would say that they were a bunch of fun!", "rating": 4, "expected_grade": "A+", "created": "2022-06-23T14:51:11Z"}, {"professor": "Stacy Kosko", "course": "GVPT105S", "review": "Okay this class was SUPER long. Although I signed up for International Studies, I didn't really think that it entailed so much discussion on international ethics. Personally, that is not at all something that I am interested in, so I did not like the class. Also, there are A LOT of readings that take forever, so make sure to block out time for that. The lessons are usually just class wide discussions about ethics and it can get frustrating at times. Unless there is a major change in the curriculum, I would say don't stick with International Studies.", "rating": 2, "expected_grade": "A", "created": "2022-06-23T14:54:19Z"}, {"professor": "Stacy Kosko", "course": "CPSN100", "review": "Dr. Kosko's depth of knowledge and personality are sold short by the fact that this class has big lectures and meets only once a week. I genuinely believe that Dr. Kosko is a good instructor, but her class was incredibly boring. The course lacked direction so assignments felt arbitrary and it was hard to take much away from lecture.", "rating": 3, "expected_grade": "A", "created": "2022-10-10T16:46:41.307579Z"}, {"professor": "Stacy Kosko", "course": "CPSN100", "review": "This class was pretty easy, but really boring and lectures weren't really planned out very well. Dr. Kosko herself isn't terrible, but she isn't amazing either when it comes to teaching this course. When I signed up for IS, I was hoping on having a more discussion based class about international topics, but instead, CPSN100 was just 1.5 hours of straight lectures once a week which were more focused on ethics and theories rather than tangible current and global issues. Guest speakers were brought in a couple times, which was interesting, but other than that, classes were very boring (not to mention, laptops aren't allowed so you can't really do much other than sit there). Even if you are interested in International Studies, unless they change the curriculum, I wouldn't recommend taking it.", "rating": 2, "expected_grade": "A", "created": "2023-01-07T09:33:00.422647Z"}, {"professor": "Stacy Kosko", "course": "CPSN100", "review": "Kosko is a very kind and personable person, I would describe her as eccentric but she really does have a lot of experience and there's no job she hasn't done. However, she has a strict no technology policy in class, attendance is taken, and participation is important. Class really just felt like a 100 person discussion rather than lecture for both CPSN100 and 101. She brings in very engaging guest speakers and there is very limited homework besides a strictly graded Memo assignment and a final group presentation. It is true though that the class is really less International Studies and more of a development ethics and global justice perspective, as that's her field of work.", "rating": 4, "expected_grade": "A", "created": "2023-05-04T21:13:40.635996Z"}], "name": "Stacy Kosko", "slug": "kosko"}