{"courses": ["ECON315", "ECON441", "ECON340", "ECON443", "ECON387", "ECON200", "ECON387", "ECON200", "ECON387", "ECON200", "ECON387", "ECON443", "ECON200", "ECON387", "ECON443", "ECON200", "ECON387", "ECON200", "ECON387", "ECON443"], "average_rating": 3.2264, "type": "professor", "reviews": [{"professor": "Stefania Scandizzo", "course": null, "review": "so much busy work... and in a pandemic?! Her tests made me wanna cry. would've failed if it wasn't for GSS", "rating": 1, "expected_grade": "", "created": "2020-11-24T00:17:22Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Terrible. Her exams are 100x harder than class material like homework and smart books. The GSS sessions, TA sessions and practice problems are no match for her exams. Doesn’t seem to care because she barely responds to emails. Only 1 hour for exams please dont take her. ", "rating": 1, "expected_grade": "W", "created": "2020-11-25T20:21:13Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I'm actually doing ok grade-wise, but I admit I've gotten lucky. She doesn't listen to her students and the majority of the class is severely struggling (averages are typically around 70-75).", "rating": 1, "expected_grade": "A-", "created": "2020-11-30T22:24:30Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Please do not take her. Smart books and homeworks are no match for test material. If you reach out to her she’s either not going to respond to your email or she’ll reply with something that doesn’t help (in reference to grades) GSS sessions barely help. It’s like she purposely makes the exams so difficult for what reason I dont know. I would’ve been able to get by with at least a C if the exams weren’t rigorous and if we had longer than one hour. All in all, it didnt seem like she cared much. Even when other students would ask questions during zoom calls.", "rating": 1, "expected_grade": "W", "created": "2020-12-02T22:14:02Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "People exaggerate the difficulty of this class. With that being said it is a 200 level class, not a 100 level. Overall exams are not too bad if you actually study. The busy work seems dumb but honestly it drills the content into ur head. She's a pretty good teacher but does get frustrated with students sometimes.", "rating": 4, "expected_grade": "A", "created": "2020-12-04T02:50:11Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Thought she was a decent professor; make sure to take good notes since tests online are open note & almost all multiple choice, and if you take this course with no econ background, be prepared for a lot of graphs and be ready to analyze graphs in 30 seconds during a test possibly. Definitely a good course but I know a lot of kids complained about the pace of it, which I thought was pretty decent for a freshman taking a first-time college course; you teach yourself the content with the online textbook and then she goes over it in class to really get in your head which I liked; would reccommend!", "rating": 4, "expected_grade": "A", "created": "2020-12-05T01:25:50Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I want to cut her some slack because it's her first semester dealing with this many students and having it online doesn't make it easy, but she was very ineffective as a teacher this semester and at least some of that is due to the online nature of the class to be fair. Do the readings and study them hard if you haven't taken micro before and you'll be fine, but I know I'm only doing well right now because I took Econ in high school.", "rating": 2, "expected_grade": "A-", "created": "2020-12-08T15:30:32Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Tests are very fair and you don't have to do much studying. Just to the homeworks and the smartbook assignments and you're good. You don't really have to pay attention to the lectures most of the content can be self learned. She knows what's she's talking about but gets kinda annoyed if you ask obvious questions.", "rating": 4, "expected_grade": "A+", "created": "2020-12-09T17:28:27Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I’m a little annoyed by the people saying “just study and you’ll be fine” “we’re exaggerating””..More than half of the class is struggling at a borderline C/D...stop giving bias reviews if you’re already a pro at Econ. “Obvious questions”?? Econ is hard what other times do we have to ask questions if she doesn’t respond to emails? The pace wasn’t the issue the lack of assistance, help, matching test questions was the issue. Homeworks and smart books were annoying but do-able....Exams were a entire different thing. She could improve a lot of ways for the next round of students.", "rating": 1, "expected_grade": "W", "created": "2020-12-10T17:47:02Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Assigns 1-2 textbook chapters every week. Chapters are not long,  each one takes like 1 hour to finish if you read thoroughly. She goes over the material from the readings in class and records them. \r\n\r\nHW consists of Connect and Smartbook questions. Smartbook is a bunch of multiple choice questions based on the reading, but it's basically completion cause the questions are easy and you can get a bunch wrong and still get full credit. Connect questions are like problem sets, which can take a little while to finish and can get tricky, but prof drops lowest two connect and smartbook assignments, and you get 2 submissions per assignment, so there's some leeway if you mess up. \r\n\r\nIn class quizzes are assigned every week, but you get 2 attempts per quiz and prof gives you a chance to talk in groups about the quiz after the first attempt. \r\n\r\nExams are all multiple choice. If you don't know the material well then you're fffffffucked, but all you gotta do is study well, go to GSS, and go over past HW's and most importantly understand the material and you'll easily get a B+ or above every time. \r\n\r\nTo be honest, contrary to my peers, I really liked the class. If you're good at teaching yourself, you like economics, and you have an interest towards the subject, you will most likely get an A and learn a good amount. However, I can't say much about the professors teaching abilities because I mostly learned from the readings and HW assignments. You'll probably eat shit if you're looking for a loaf class and/or you rely on the professor to teach you most of the info. \r\n\r\nP.S I took this class during rona szn ", "rating": 4, "expected_grade": "A+", "created": "2020-12-16T02:06:12Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "The exams are typically easy if you know the content, and she lectures well, if you pay attention and take good notes you’ll do fine.", "rating": 5, "expected_grade": "A", "created": "2020-12-17T01:36:12Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "She is one of the most organized teachers I've dealt with but does not take constructive criticism well. Overall the class is fairly easy if you put in the work you're supposed to. I was lucky and had a background in microeconomics before taking it so most things were not new to me. She understands what she's talking about but the execution of her teaching style did not always go well with students. It was her first time teaching such a large lecture AND it was online so got to cut her some slack there. ", "rating": 3, "expected_grade": "A-", "created": "2020-12-17T02:08:43Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "(I took this class completely online.) This was a surprisingly difficult class for me. I put in a considerable amount of effort (significantly more than I've needed to get an A in most of my other classes so far) and still struggled to get the A. The pace of the class is quick–not unmanageable, but still quick. I also found the exams to be MUCH harder than the homeworks and review materials. From what I heard from my classmates, some people thought the exams were very unfair and some thought they were fine. As someone with no econ background but who genuinely put in a lot of effort, studied a lot, kept up with the material, etc, I'd say the exams are pretty hard but not impossible. She's a good professor and seems to know what she's talking about. \r\nOverall a solid course, but if you don't have a background in economics and/or economics just isn't your thing, be prepared to really work for it. ", "rating": 3, "expected_grade": "A", "created": "2020-12-22T02:44:53Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Lots of busy work which does cover the material and helps you learn, but the content of the exams is not directly covered by the homework and SmartBook assignments. ", "rating": 2, "expected_grade": "A", "created": "2020-12-25T02:23:25Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I had little trouble with Professor Scandizzo's class, and found the homework pretty straightforward, but I can understand the frustrations people have been expressing. She seems like a nice person overall and seems responsive to student concerns. I did, however, have to rely on the textbook for most of the class but her lectures were recorded and I'm glad I was able to watch them on my on time. The class felt overall pretty intuitive for me, but I can understand how people did not feel that she helped them that much through her lectures and tests.", "rating": 4, "expected_grade": "A", "created": "2021-01-14T03:07:21Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "She literally doesn't know how to explain ANYTHING. homework is horrible and super hard and her lectures dont help one bit. you're better off taking a micro class at community college", "rating": 1, "expected_grade": "", "created": "2021-11-17T21:53:34Z"}, {"professor": "Stefania Scandizzo", "course": null, "review": "She is a very good lecturer and makes the topics very understandable in lectures with examples. Go to GSS sessions if you're confused and you'll be fine. The textbook assignments are really annoying but she drops your 2 worst grades.", "rating": 5, "expected_grade": "", "created": "2021-12-06T00:05:01Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Dr. Scandizzo is very knowledgeable about microeconomics! She explains the content very well and does practice problems during class so you can watch how to do problems step-by-step. The only problem is she ONLY talks about microeconomics-- there are no tangents or anything, which can make the lectures a little bit boring. But I came into the class with no background whatsoever in microeconomics and I am expecting an A, even though I only attending one review session in the entire semester. My best suggestion is to read the chapters and take notes before the lectures so you can use the lectures as a review. Dr. Scandizzo does cover most important concepts in each chapter, but sometimes there simply is not enough time for her to cover everything, so I really suggest you take in-depth notes in advance. There is a very reasonable amount of work. Half the assignments are graded for completion, and the other half is graded for accuracy. But you get two attempts for the assignments that are graded for accuracy, and she takes the better of your two scores. Personally, I find the homework assignments to be very difficult and the exams to be extremely easy, but most of the class believes that the homework is easy and the exams are difficult, so it may be subjective. Average exam scores hover around an 80, but my lowest exam score has been a 93. Just read the textbook chapters before class and take in-depth notes and you'll be fine, but you'll need to do that no matter what professor you have for this class. Dr. Scandizzo does everything right to help her students get good grades. It's just that the content is really hard for most people. There isn't much more she could possibly do to help.", "rating": 4, "expected_grade": "A", "created": "2021-12-16T17:07:03Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "The TAs were very helpful and nice but she was very poor at explaining things during lecture. I had to work my but off for this course and had an A most of the semester until the last exam. I would try to take it at a community college if you can but be prepared to study a lot to a an A. The homework is difficult and the exams are deceptively difficult.", "rating": 2, "expected_grade": "B+", "created": "2021-12-21T03:44:06Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "EXAMS WERE SO HARD, the assignments she gave did not prepare you for the exam, the only way you were suppose to well on the exam is do the practice exam and go to class. She really nice but is awful at teaching, she explains in a very roundabout way, please take a different prof", "rating": 1, "expected_grade": "B-", "created": "2022-01-20T03:39:47Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Her exams are extremely difficult especially compared to what other Econ professors gave out. I’d be fine with her being a hard teacher if she actually cared about her students, whenever I’d go to her office hours asking for help on concepts/how to improve my study skills to better my grade she always quickly dismissed me. Honestly just go for a different professor she doesn’t seem to care about teaching. ", "rating": 1, "expected_grade": "B", "created": "2022-01-22T02:08:18Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I found Dr. Scandizzo to be a great professor. She is really knowledgeable on microeconomics and her lectures were pretty clear. I will say that the smartbook assignments were honestly pretty dumb and unhelpful. Make sure you attend lectures, do the readings, and GO TO GSS or office hours. Her exams were oddly specific and difficult but the practice tests were very similar so really try and master those. ", "rating": 4, "expected_grade": "A", "created": "2022-05-06T13:22:38Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Honestly don't really get the bad reviews. I came into the class with no micro experience but Prof. Scandizzo made everything easy to follow and fair. There was a fair amount of work every week since you have to do Smartbook questions and homework on Connect, but the Smartbooks are easy 100s and you get 2 attempts on the homework. Tests were really doable if you do the practice exams and take advantage of GSS study sessions. Her lectures also follow the notes very closely (with a couple more examples) so if you take good notes sometimes going to class isn't super necessary. I personally stopped going and just attended the review sessions before exams and was still able to get an A. I honestly wouldn't be put off by the bad reviews, just take her! If you put in the work it's definitely possible to do well in this class. ", "rating": 5, "expected_grade": "A", "created": "2022-05-15T03:22:43Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "People like to say Scandizzo is a horrible teacher but I found that not to be the case. If you do the assigned smartbooks and homework, along with the exam reviews, you'll do fine.", "rating": 4, "expected_grade": "A-", "created": "2022-12-01T20:53:46.270813Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I like Scandizzo I think she uses good examples to explain the topics and does good work building off past information. The homeworks are graded for completion and you get two attempts with the homework and she takes the highest grade which is nice. Go to the review sessions, look at the notes she posts on canvas, ask the TA's to review your past midterms and you'll do fine.", "rating": 4, "expected_grade": "A-", "created": "2022-12-06T04:25:03.464221Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "A very nice person, sometimes lectures are hard to follow. Smartbook lessons and Hw so basically completion which is nice for hw. She posts lecture slides if you can't make it to class but they are not very detailed. 2 midterms and 1 final.", "rating": 3, "expected_grade": "B+", "created": "2022-12-06T14:40:17.208019Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "It's a fairly easy class if you come to lectures. She answers questions well and her lectures do a good job clarifying material from the smartbook. There is a decent amount of busy work but that's going to be with all intro level courses and it boosts your grade which is nice.", "rating": 4, "expected_grade": "A", "created": "2022-12-08T15:52:41.072805Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "The course is hard no doubt. I think she tries as hard as she can to help students get the material down during lectures and when that isn't enough there are a lot of resources she makes sure to push and review sessions with the TAs are great. The annotated slide shows are all posted online which is great incase you need to miss class but I really recommend going. Her tests are mainly multiple choice and a few short answers of drawing and identifying graphs. Its a decent amount of work outside of class and studying is definitely needed to do well at all on her tests and even the class in general because they weigh so much. One midterm I got a 90 the other a 73 and that was with a lot of studying (granted I still didn't have everything down and I hope the 73 was just a fluke). Its a lot of information fast but if you do your work, go to lectures or look over the slides, take notes, and go to review session you'll be good. She wants you to succeed and helps as much as she can the class is just rough.", "rating": 4, "expected_grade": "A-", "created": "2022-12-08T18:03:02.530772Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I really loved Scandizzo as a person and professor. I think she is really friendly and easy to approach. Her examples in class are simple to follow and she is clear in her explanations. Go to class, attend GSS, and review as much as you can. I did extremely well on the first test, but not as well on the second. It is a tough class. I recommend taking her if you can because she cares a lot about the success of her students.", "rating": 4, "expected_grade": "A-", "created": "2022-12-09T01:46:15.550406Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Very nice professor, but the way she taught was not very engaging. Her lectures were just a slideshow of notes. I obviously understand that she taught a large lecture for ECON200 which makes it hard to engage everyone, so it's kinda something you'd have to deal with. You have to do a lot of busywork in this class. Smartbooks seemed a bit pointless because in class she covers the same material from the chapters, but just less of the smartbook and only the material needed for exams. Completed notes will always be posted if you miss a class, and the GSS sessions and TA office hours are good resources to use if you need help understanding any concepts. It is a passable course, but will be boring at times - something I felt like I just had to get through. If there is an upper level course with her, I think it would be better because she can be more engaging in smaller groups - she's still very personable and approachable.", "rating": 3, "expected_grade": "A", "created": "2022-12-13T21:39:29.634902Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I loved learning from professor scandizzo. Econ is hard to make interesting but she did as best as she could. Lectures could get boring, but if you did the weekly HW assignments and smartbooks, you don't really need to pay much attention. Her exams were pretty straightforward and were never on concepts that she didn't cover.", "rating": 4, "expected_grade": "A-", "created": "2022-12-17T04:43:14.542438Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I did not attend a single lecture after the first month and still pulled out a B. That should be all the info you need.", "rating": 4, "expected_grade": "B", "created": "2022-12-24T22:21:31.122297Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Super nice professor who gives all required material to do well in the class. I will say the exams were straight forward in a lot of ways, but I somehow always got a lower than expected grade. COME TO CLASS if you want an A. If you don’t care, the slides should suffice.", "rating": 5, "expected_grade": "A", "created": "2023-01-22T20:50:05.858806Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Easy class, but awful teacher. Does not explain anything better than the book does, and stopped going to class. However, easy class in general.", "rating": 2, "expected_grade": "A+", "created": "2023-02-06T19:20:20.910868Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I've never taken econ or anything of the sort before, but I feel like this class wasn't nearly as terrible as the other reviews are saying. If you go to lecture, and start studying for exams at least a couple days in advance, you'll do fine. I didn't take textbook notes, or go to review sessions outside of the pre-exam kahoots (recommended). She's a decent professor, just sit up front and take hand written notes so you don't get distracted. Exams are straightforward, and the practice ones she gives are accurate to how the real ones are. Don't let the people who didn't put in any effort discourage you!!", "rating": 4, "expected_grade": "A", "created": "2023-03-14T13:48:32.575346Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I have taken econ courses in high school and my first one in college I took with Professor Scandizzo. She mainly just used slides to teach the course, but I feel this really worked because her tests were almost the same as what she taught. I would recommend taking this course with her.", "rating": 4, "expected_grade": "A", "created": "2023-05-02T21:49:48.695239Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "This class is challenging if you don't have any background in economics. Dr. Scandizzo's lectures are kind of boring and there is a lot of material to cover throughout the semester. The homeworks are how you mainly learn the material and your worst three grades are dropped. The exams are definitely the hardest part of the course.", "rating": 4, "expected_grade": "A-", "created": "2023-05-12T16:43:33.988364Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "As a student with nor prior Econ knowledge, this class was tough and Scandizzo made it even more difficult than needed. She was very friendly and nice but her teaching method was hard to follow. Also, the smartbooks and HW's are really time consuming and they make up a pretty good chunk of your grade so I don't recommend slacking off on those. The test questions are a lot harder compared to exam review and what is gone over in class. \r\n\r\nAnyways this was one of the more annoying classes I had to take and I ended up self teaching myself a lot.", "rating": 2, "expected_grade": "B-", "created": "2023-05-16T01:36:55.365663Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Not rating Scandizzo because i never went to class, but the course is very simple. Read the textbook and made try to not get behind too much. It really helps to write chapter summaries/ study guides that you can look back at when studying for the final.", "rating": 4, "expected_grade": "A-", "created": "2023-05-16T22:06:41.700906Z"}, {"professor": "Stefania Scandizzo", "course": "ECON387", "review": "Take this class if you wanna prepare for job or internship related position. Moreover, the class is extremely easy to get an A+ .", "rating": 5, "expected_grade": "A+", "created": "2023-05-20T03:17:27.576272Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "For people who don't really care for this course and is only taking it because of the gen ed requirement, I feel like taking this professor is good enough. I barely show up to class and I honestly do not know anything until the week before an upcoming exam. She provides a lot of useful resources like GSS sessions and practice exams so there is really no reason to be failing her exams.", "rating": 4, "expected_grade": "B+", "created": "2023-05-23T23:43:37.440912Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Anybody who says that the class is hard is stupid. All you have to do is read the assigned smart books and take some notes. Most the people who get bad grades in the class either cheat on the homework’s or don’t read the smart book. This class takes common sense and no business background to get an A in this class.", "rating": 5, "expected_grade": "A", "created": "2023-05-24T00:39:43.219650Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Econ200 is not too difficult of a class however Professor Scandizzo's lectures were extremely boring. She mainly taught off the slides. I stopped going to lectures two weeks in and only attended Gavin's GSS. If you have the choice to choose professors pick Abbasi.", "rating": 3, "expected_grade": "A", "created": "2023-05-24T02:42:55.488402Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Scandizzo is a pretty solid professor to take ECON200 with. The class itself is very easy, and Scandizzo also writes exams that are very straightforward. The practice materials she provides are sometimes useless, but sometimes will have the exact same questions as the actual exam. Outside of exams, there's just so much busywork that, for a class like ECON200, is quite frankly unnecessary; the weekly Smartbook and homework assignments get tedious after a while, and they aren't really helpful. Her lectures are also just fine, she basically just reads off the slides but does so in a fairly engaging way. Still, after a while, I just stopped going to class altogether since honestly the material is easy enough to learn on your own.", "rating": 3, "expected_grade": "A+", "created": "2023-05-26T22:39:24.750166Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Dr. Scandizzo is a good professor to take ECON200 with because she posts annotated notes after class and explains the content pretty thoroughly during lecture. My one qualm is that lecture is extremely boring and I find myself doing other things in her class because I can't pay attention. However, she provides good resources and the class is easy.", "rating": 4, "expected_grade": "A", "created": "2023-12-05T17:07:58.569465Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Her lectures are kinda boring but this class is definitely doable. She provides a lot of resources for students and honestly you don't even really have to go to class to do okay. Economics has always been hard for me so I struggled a little bit, but take advantage of the resources like GSS and you will be fine.", "rating": 3, "expected_grade": "B-", "created": "2023-12-07T15:18:47.420649Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Not a bad teacher to take for micro at all. Do not get all the negative buzz around her. Lectures are very boring and I stopped going around third week. All HW assignments are free A's and you get two attempts. I learned everything for the midterm and final a week before and managed to pull out a B. If you apply yourself and do the work it will be easy to get an A.", "rating": 4, "expected_grade": "B", "created": "2023-12-18T05:41:34.664770Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "She posts the note for each class so you don't ever have to come to class in person. She goes over examples and releases practice tests and questions before each midterm. The two midterms are 20% each with the final being 30% of your grade. She covers different chapters than other sections so unless you have friends in your class, you can't study with anyone else. Although she doesn't curve, if you end with a 90 or above its a A. And a 88 or 89 is a A-. The smartbooks are helpful for learning content, and there are Guided Study Sessions weekly, as well as office hours which are helpful for questions.", "rating": 4, "expected_grade": "A", "created": "2023-12-19T16:45:36.551546Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Professor Scandizzo is a pretty good professor who explains concepts pretty well and makes it easy to understand what is happening. While the hws and smartbooks can be a lot of work during the week, they make it easier to understand the concepts. Her tests are fair and she provides helpful resources and practice problems to better prepare you for the exams. There are 2 midterms and a final that make up a majority of your grade. ECON200 also has weekly GSS sessions and a tutoring center that allows you to get help multiple times a week which is helpful. I recommend attending class as concepts are easier to understand when she explains them but she does post the slides if you need to go over them again.", "rating": 4, "expected_grade": "A", "created": "2023-12-19T19:50:56.388334Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I think she teaches the course pretty well and straight-forward. Tests are a pretty average difficulty and she provides adequate resources to prepare but she is a little boring.", "rating": 4, "expected_grade": "B", "created": "2023-12-21T06:27:17.673372Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Took AP Econ in highschool so this class was an easy A, other ppl tend to struggle tho. Definitely take Scandizzo, her lectures are well explained and other professors added in more material. Smartbooks and homework every week but you get a second attempt. Probably be helpful to take notes on the textbook if you're gonna skip class", "rating": 4, "expected_grade": "A", "created": "2024-01-03T22:49:32.566253Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "The instructor found it hard to listen to a long lecture twice a week and was very boring. Although practice exams were the same as the test, there was a crazy amount of material to learn for the entire semester and if you fall behind it can be hard to catch up. The ta's were not helpful for this course and made you feel stupid when you didn't get it or didn't do well on the exam and did not try to help you do better. Would take this course with someone else if possible", "rating": 1, "expected_grade": "D+", "created": "2024-01-16T04:16:45.587972Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Horrible professor to take. She is not very understanding about deadlines even if you have ADS accommodations. It took me 3 months to get my ADS signed by her after numerous reminder. Super boring lecturer and long homework assignments. Def take a different professor if you can", "rating": 1, "expected_grade": "D", "created": "2024-02-01T19:51:04.279663Z"}], "name": "Stefania Scandizzo", "slug": "scandizzo"}