{"courses": ["ENST499M", "ENST422", "ENST432", "ENST689M", "ENST622", "ENST798", "ENST472", "ENST388", "ENST689", "ENST689Z", "GEMS296", "GEMS297", "GEMS396", "GEMS397", "GEMS496", "GEMS497", "ENST388", "ENST472", "ENST689", "ENST388", "ENST432", "ENST472", "ENST689", "ENST689Z", "HNUH248B", "ENST388", "ENST422", "ENST472", "ENST622", "ENST689", "HNUH248B", "ENST432", "ENST472", "ENST689", "ENST689Z", "HNUH248B", "ENST422", "ENST472", "ENST622", "ENST689", "HNUH248B", "ENST432", "ENST472", "ENST689"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Stephanie Yarwood", "course": "HNUH248B", "review": "The class is honestly very easy, and it is really easy to get a good grade on it. Professor Yarwood is very accepting of feedback and will adjust the assignment deadlines and requirements to make it easier on the students. It may be annoying to go up to the greenhouse to take care of the plants, but compared to other UH courses, this is definitely one to take. There may be a lot of readings and assignments that seem stupid, but you still get a good grade on it even if you procrastinate and bs it.", "rating": 5, "expected_grade": "A+", "created": "2023-04-27T02:11:45.289726Z"}, {"professor": "Stephanie Yarwood", "course": "ENST422", "review": "The content in this class is super manageable if you just go to class and pay attention, and she definitely makes the lectures worth your time. She is engaging to listen to and she really lets the students' interests guide the conversations. Dr. Yarwood is super flexible on pacing of the class and she gives really useful feedback on assignments. The way she teaches the class helps you get better at analyzing things over time, which helps you do well on the exams (which are really like quizzes). Highly recommend this class or any others taught by Dr. Yarwood!", "rating": 5, "expected_grade": "A-", "created": "2023-05-11T15:25:19.019655Z"}, {"professor": "Stephanie Yarwood", "course": "HNUH248B", "review": "Fantastic professor, truly cares about the topics she teaches and her students. Very engaging material and the class is mainly composed of writing and discussion assignments. Essays and their required contents are given ahead of time, with more than enough time to complete the assignments. Greenhouse project was awesome and one of the most hands on projects I've done at UMD so far. Highly recommend taking this Honor's cluster.", "rating": 5, "expected_grade": "A+", "created": "2023-05-11T17:06:34.767666Z"}, {"professor": "Stephanie Yarwood", "course": "HNUH248B", "review": "Super chill professor and super chill class! Felt like my little break class <3", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T01:52:23.248799Z"}, {"professor": "Stephanie Yarwood", "course": "HNUH248B", "review": "Very nice and understanding professor, she understands that her honors class is not that important so is not too harsh with grading or deadlines. This class was very easy.", "rating": 5, "expected_grade": "A+", "created": "2023-12-23T18:27:03.983840Z"}, {"professor": "Stephanie Yarwood", "course": "HNUH248B", "review": "Great professor. Creates a very welcoming environment and cares about her students' mental health. There is a lot of reading for the class, but they are somewhat interesting, and easy points even if you skim (which she encourages you doing). There are essays to write, but there are for every honors cluster class I have taken so far, so it is nothing new. Bring up to her if you need extra time, or anything else at all, and she will work with you. I even asked her if I could leave class early because I wanted to see an on-campus memorial before it was taken down, and she let me without any debate. Finally, do not skip classes. Just go. You get points for it sometimes, and not going usually means having to do a makeup assignment.", "rating": 5, "expected_grade": "A+", "created": "2023-12-26T02:12:16.011641Z"}, {"professor": "Stephanie Yarwood", "course": "HNUH248B", "review": "She is super kind and genuinely cares how her students are doing. She would adjust assignments and deadlines based on how the students were feeling, and she was very lenient and passionate about the topic. The class was a great break from my super challenging major courses.", "rating": 5, "expected_grade": "A+", "created": "2023-12-28T01:09:39.924795Z"}], "name": "Stephanie Yarwood", "slug": "yarwood"}