{"courses": ["PUAF214", "PUAF215", "PUAF790", "PLCY201", "CPPL200", "CPPL101", "CPPL201", "CPSP239P", "PLCY309", "CPSP339P", "CPSP249P", "PLCY201S", "CPSP339P", "CPPL100", "CPSP339P", "PLCY201S", "CPPL101", "CPSP339P", "CPPL100", "CPSP339P", "PLCY201S", "CPPL101", "CPSP339P", "CPPL100", "CPSP339P", "PLCY201S"], "average_rating": 4.875, "type": "professor", "reviews": [{"professor": "Susannah Washburn", "course": "CPPL101", "review": "I have had Professor Washburn for PLCY201 and CPPL101. She is one of the most down-to-earth and enthusiastic people you will meet. The coursework is fair and doable; you can easily get an A in the class as long as you put in the work. She makes the Public Leadership Scholars Program as fun as possible and is always eager to connect with her students during her office hours. If you are a Public Leadership Scholar, you are in good hands.", "rating": 5, "expected_grade": "A+", "created": "2019-05-27T02:41:59Z"}, {"professor": "Susannah Washburn", "course": "PLCY201", "review": "Washburn is the absolute best, which you probably know if you're in PL. Classwork is fair and doable, the TAs are helpful, and usually it's interesting. She's also always happy to talk to students and personable is an understatement.", "rating": 5, "expected_grade": "A+", "created": "2020-12-08T15:33:43Z"}, {"professor": "Susannah Washburn", "course": "PLCY201S", "review": "Washburn is my favorite professor I have had so far. She is super kind and truly cares about her students. I didn't particularly enjoy the class, but Washburn made the class tolerable. As long as you put minimal effort into your work, an A should be no problem.\r\n", "rating": 5, "expected_grade": "A", "created": "2021-12-23T03:31:42Z"}, {"professor": "Susannah Washburn", "course": "PLCY201S", "review": "If you are choosing between the scholars programs, choose Public Leadership! Professor Washburn is engaging, personable, and invested in our success. Her teaching style is more than the typical lecture with in-class activities, group projects, and debates. While these assignments may seem daunting to some, Washburn creates a comfortable and open environment for her students where everyone is encouraged to participate, regardless of background or belief. Overall, I would highly recommend this course.", "rating": 5, "expected_grade": "A", "created": "2022-11-19T23:20:20.366948Z"}, {"professor": "Susannah Washburn", "course": "PLCY201S", "review": "If you are choosing between the scholars programs, choose Public Leadership! Professor Washburn is engaging, personable, and invested in our success. Her teaching style is more than the typical lecture with in-class activities, group projects, and debates. While these assignments may seem daunting to some, Washburn creates a comfortable and open environment for her students where everyone is encouraged to participate, regardless of background or belief. Overall, I would highly recommend this course.", "rating": 5, "expected_grade": "A", "created": "2022-11-19T23:20:50.760513Z"}, {"professor": "Susannah Washburn", "course": "PLCY201S", "review": "She is an awesome professor and super easy to talk to. She's very responsive, understanding and approachable. She wants you to succeed and is there for you. I was annoyed by time it took to grade assignments. There is a lot of reading for the course and even though she claims that every word you read is important, you can pass just skimming for general concepts. She is invested in your success but she does expect a lot of you.", "rating": 4, "expected_grade": "A", "created": "2022-12-08T16:04:43.724066Z"}, {"professor": "Susannah Washburn", "course": null, "review": "Prof. Washburn was such a good professor to learn from. She has so much experience in the public policy field and is so helpful with any questions that you have about it. PLCY201S was a decently easy class to get an A in. She drops your lowest essay grade and a huge bulk of your grade is based on attendance. She's also super understanding about late assignments or absences as long as you're honest. She wants to work with you to make sure you're getting everything that you can out of this class.", "rating": 5, "expected_grade": "", "created": "2022-12-17T04:35:39.686712Z"}, {"professor": "Susannah Washburn", "course": "PLCY201S", "review": "Washburn is the best! she is very easy to talk to and personable and she really cares about her students, not just academically but as a person. The class is very discussion based which is nice. There are short readings to do and various projects. You do have essays and I would recommend putting a good amount of energy into those as they are a large chuck of the grade. It takes her a while to grade but she goes over all of the TA's grading so its pretty fair.", "rating": 5, "expected_grade": "A-", "created": "2024-01-05T17:04:02.014445Z"}], "name": "Susannah Washburn", "slug": "washburn"}