{"courses": ["AMST204", "ENGL101", "ENGL300", "ENGL101C", "AMST418K", "ENGL101S", "HONR219F", "AMST328X", "AMST213", "FILM298V", "CINE282", "AMST204", "AMST320", "AMST328X", "AMST213", "AMST418K", "CINE282", "AMST213", "AMST213", "AMST204", "AMST320", "AMST213", "AMST418K", "CINE282", "AMST204", "AMST320"], "average_rating": 4.3333, "type": "professor", "reviews": [{"professor": "Susan Pramschufer", "course": "ENGL101", "review": "Though she was a pretty good teacher. I didn't agree with all of her opinions, but the class was good. She'll let you come to her office hours/send her your paper as many times as you want and she'll practically grade it before you turn it in. She was energized and cares about her students. At least for ENG101 she was a really good teacher.", "rating": 4, "expected_grade": "A", "created": "2014-12-16T18:54:00Z"}, {"professor": "Susan Pramschufer", "course": "AMST204", "review": "Pramschufer was an alright teacher. She came to class energized and ready to teach, which was nice. But she was unethical and biased with her grades. This was a film class and we had to write analysis of the films, which no one knew how to do. She did not teach us about this, yet expected us to know how to write a perfect paper. It was very unethical and therefore I would not recommend you take her class. ", "rating": 2, "expected_grade": "", "created": "2013-05-20T23:06:00Z"}, {"professor": "Susan Pramschufer", "course": null, "review": "Professor Pramschufer is a fantastic teacher. It wasn't until the middle of the semester that we started to appreciate her super dry sarcasm. I really enjoyed taking her class, and she does a great job of making sure that her students are prepared for assignments. I learned a lot about writing, and I always felt comfortable asking questions and seeking help. ", "rating": 5, "expected_grade": "A", "created": "2011-05-13T03:45:00Z"}, {"professor": "Susan Pramschufer", "course": null, "review": "Professor Pramschufer is probably one of the best I've had at UMD. She is always cheerful in class and willing to meet with students if office hours do not work out. She is always excited about the texts she teaches and even offers extra credit. She does grade a little hard, but is always there to help with  every step of each essay if you ask her. I took this class because I'm not an English major and wanted to improve my writing, and I can definitely say that she has helped to improve my writing. Take a class with her!", "rating": 5, "expected_grade": "", "created": "2011-05-11T22:23:00Z"}, {"professor": "Susan Pramschufer", "course": null, "review": "Pramshufer is really nice. I think she got a little overwhelmed at times, but overall ran the classroom well. She is a difficult grader, but so are most English teachers at Maryland. That being said, if you work hard, you will probably get an A. You just have to be willing to put in the effort. A writing intensive course, not a lot of reading though. ", "rating": 4, "expected_grade": "", "created": "2011-05-11T11:17:00Z"}, {"professor": "Susan Pramschufer", "course": null, "review": "This professor is very enthusiastic about her class and what she is teaching. Shes really patient and always there to help her students if asked. The only criticism I have is that she grades a little hard, but it is a 300 level class and Im not an english major so its to be expected", "rating": 4, "expected_grade": "", "created": "2011-04-06T16:44:00Z"}, {"professor": "Susan Pramschufer", "course": "ENGL101", "review": "Prof. Pramschufer is very sweet. She’s very forgiving and her TA, Roya is very nice and understanding. The class has a pretty heavy/ moderate work load depending on what other classes you’re taking because you can get a little over whelmed with all of the essays and assignments in addition to your other courses. the class is pretty straight forward, especially if you took AP english in high school. Professor Pramschufer, as well as her TA are always willing to help and answer questions which is good. I would definitely recommend visiting their office hours a lot because Professor is very strict about what she wants to see on your essays, especially with exigence, cohesion, and works cited pages. ", "rating": 5, "expected_grade": "A-", "created": "2021-01-08T13:47:30Z"}, {"professor": "Susan Pramschufer", "course": "ENGL101", "review": "Prof. Pramschufer is so so nice and she really wants all of her students to succeed. There are like 5 different writing assignments and they aren't that bad because they all build on each other. When I say utilize the professor utilize her, she holds office hours and she is willing to meet with you whenever to go over your essay. She will read through your essay and make edits before it due multiple times to help you get a good grade. I will say Prof. Pramschufer is a strict grader when it comes to the essays that's why you should defiantly use office hours to get help. Overall, she was a great professor and I would 100% take her again and I would recommend her to future students. Oh also there is a recommended textbook but you can find it as a PDF online for free so I wouldn't get waste the money on the textbook.  ", "rating": 5, "expected_grade": "A", "created": "2022-05-06T22:15:29Z"}, {"professor": "Susan Pramschufer", "course": "AMST328X", "review": "I had her for AMST328X and she was an amazing professor, highly recommend taking the course especially if you're interested in disability studies or film! The work for the course was moderate, a discussion post and response usually due each week, nothing crazy. The exams were usually based on topics she brings up in discussion, so you should take notes on the themes and subject matters that she brings up. I would say that her grading is typical of most English profs, but you can definitely pick out what she's looking for as you continue in the course. She's very sweet and is willing to answer any questions, during class and outside of it. Overall she's bestie, take the course for two (2!) gen ed requirements and relatively easy A.", "rating": 5, "expected_grade": "A", "created": "2022-08-24T13:40:59.577948Z"}, {"professor": "Susan Pramschufer", "course": "ENGL101", "review": "This class feels like an honors section even though its not as it has small class size and the professor is always the one teaching (there are no TAs). The teacher is always nice and gives energy to the class (even during my 8am section), and provides very useful feedback and support on all the writing assignments. She's very clear about what needs to be done and the whole course has a clear path to success that you will do just fine if you follow it.", "rating": 5, "expected_grade": "A", "created": "2022-12-05T19:33:21.982876Z"}, {"professor": "Susan Pramschufer", "course": "ENGL101", "review": "She’s super kind and understanding regarding student life and setbacks. A lot of mini-assignments, but that might just be the course. Overall a lovely human being.\r\nI will note that her grading is a bit strict, but her feedback is pretty useful. She definitely expects a lot more effort than you may want to put into a Gen Ed. My advice: if you take her for this class, make sure to talk with her about your papers.", "rating": 5, "expected_grade": "A", "created": "2022-12-06T18:42:17.966349Z"}, {"professor": "Susan Pramschufer", "course": "ENGL101", "review": "This teacher is AWESOME! She's very kind and makes the class enjoyable. It's quite a bit of essay writing, so she makes everyone work from early on and gives helpful feedback. Usually, 1 or 2 weeks before an essay/assignment is due, we would spend half the class time doing a peer review of our current progress. Basically, we get feedback WHILE we're writing the essays, rather than after we already submitted them. \r\nDefinitely recommend her.", "rating": 5, "expected_grade": "", "created": "2022-12-06T19:01:49.482394Z"}, {"professor": "Susan Pramschufer", "course": "AMST204", "review": "Professor Pramschufer is amazing! I can't recommend her enough. I was a little worried about this class since it was my first humanities class at UMD as a STEM major, but it was fairly easy. She's really enthusiastic and kind and sometimes lets you out of class early. There are two big essays and one small reflection, in class writing assignments, and two exams. Just take good notes and the essays/exams will be easy. If you go to office hours she's really helpful. Overall one of my favorite professors at UMD. Plus the class covers two gen eds so I highly recommend taking it.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T20:44:24.804346Z"}, {"professor": "Susan Pramschufer", "course": "AMST418K", "review": "This was my absolute favorite course I've ever taken at UMD, and much of that is thanks to Susan's obvious care for her students and the class's material. The syllabus is amazing! I was only mildly interested at first because I didn't recognize many of the movies, but by the end of the semester I've grown to appreciate each one for what it's taught me about american landscape in film. The class is structured where you watch one or two movies a week outside of class with maybe one discussion post, and then the class is a lecture format with lots of chance for class discussion. I loved this format for many reasons: I got to have movie nights with my roomies, I had time to think about the film by myself before class, and it was easy to pay attention in class because I could participate. And if participation isn't your thing, she doesn't grade it. The two essays were short, easy, and interesting. I got the feeling that she was worried about if the course was boring or not so if you do take the class and like it, make sure to tell her :) She deserves it!", "rating": 5, "expected_grade": "A", "created": "2023-05-09T18:47:42.277074Z"}, {"professor": "Susan Pramschufer", "course": "AMST320", "review": "I thought this class was going to be an easy A class but I was really wrong. At the beginning of the semester, you watch several movies, focusing on different models of disability and then you do discussion posts (like 5 times). After that, no more discussion posts, which is gold to me. There are three big essays you'd have to do. An observation, scene analysis, and restatement project. Towards the ending of the semester, you'd choose a specific scene from any movie with aspects of disability in it and \"remake\" that scene to be more progressive than it is now. You do either a storyboard or a script, depending on what is your scene. Anyway, the overall course is kind of interesting, especially coming from a disabled student like me. I don't agree with some stuff that is mentioned in this course. The film class basically says that movies or we should reject patriarchal, white, straight, and male hegemony. Cultural hegemony should be rejected.  If you are a conservative, then you might not like this course??? \r\n\r\nBut Mrs. Pramschufer is an extremely helpful teacher. She is so willing to help students understand the concepts. She would set up an appointment to meet on Zoom if you need to go over some course material. Susan really wants her students to be successful on the exams. Not sure what you understand some of the concepts? Just ask or set an appointment with her! She would try to make lots of concepts as clear as possible for students to understand. \r\n\r\nAlso, the exams are written. No multiple choices questions.", "rating": 5, "expected_grade": "B", "created": "2023-12-12T03:27:17.093662Z"}, {"professor": "Susan Pramschufer", "course": "ENGL101", "review": "She is a great professor! She tried really hard to make the class manageable for us first-semester freshman and I really appreciated that. She was super accommodating when I got a concussion and had to miss some assignments and turn an essay in late. She really tried to connect with all of us and make sure the material we went over was interesting and relevant. Honestly, the only things I didn't enjoy were the slackers in my class and some of our zoom classes, but that's on me for taking a blended class when I knew I didn't like zoom. The couple essays we do are completely manageable because she breaks the writing process up into smaller assignments and she is super eager to give feedback before you turn it in. Even if you do fumble one of the essays, the final project is easy and great way to boost your grade. You won't regret taking her!", "rating": 5, "expected_grade": "A", "created": "2023-12-20T21:44:18.171339Z"}, {"professor": "Susan Pramschufer", "course": "AMST204", "review": "Let me start off by saying Ms. Pramschufer is very sweet, and her class overall is actually pretty interesting in some ways. Now with that being said, this class is WAY too rigorous for a gen ed, with 3 essays and 2 exams. Not to mention the 11 informal writing assignments randomly assigned. On top of this, she is a strict grader and there is not much creative outlet/leniency in a class where there should be. The exams require specific answers on the short answers and essay questions, and if you don’t, you are not getting many points back. Similar grading policy on the essays, even one where I really put an all out effort to just to get a B. If you are looking for a Gen Ed, I strongly recommend not taking this class.", "rating": 2, "expected_grade": "C", "created": "2023-12-25T04:29:48.737846Z"}, {"professor": "Susan Pramschufer", "course": "AMST204", "review": "I agree with some of what previous reviews are saying. Dr. Pramschufer is a very nice person, who always makes class discussions lively. In terms of content, I really enjoyed this class. The movie selection was diverse and I thoroughly enjoyed watching every film studied. \r\nHowever, the issue with this class was the amount of work and tough grading. I managed to eek by with an A- but it definitely took a lot more effort than I expected. There are multiple in class writing assignments, which are not graded very leniently. Same goes for the three major essays in the class. The exams are also graded harshly, with points awarded being nearly all or nothing. If you are looking for an easy A gen-ed, there are much better options out there.", "rating": 2, "expected_grade": "A-", "created": "2024-01-20T23:24:42.167201Z"}], "name": "Susan Pramschufer", "slug": "pramschufer"}