{"courses": ["HONR258J", "PHIL408O", "PHIL308B", "PHIL140", "HONR218I", "GEMS296", "PHIL308D", "GEMS297", "HONR278Z", "PHIL209E", "GEMS396", "GEMS397", "GEMS496", "GEMS497", "PHIL788", "PHIL808C", "HONR359H", "PHIL338J", "PHIL209D", "PHIL308Y", "PHPE308B", "PHIL308U", "PHIL209D", "PHIL308U", "PHIL848", "PHIL211", "PHPE402", "PHIL308U"], "average_rating": 3.9333, "type": "professor", "reviews": [{"professor": "Susan Dwyer", "course": null, "review": "One of my favorite classes I've taken at Maryland thus far. She is a great professor, and she challenges her students to think critically and provide insightful analysis instead of thoughtless answers. She also helps a LOT to improve your writing. Definitely recommend any class she teaches.", "rating": 5, "expected_grade": "A", "created": "2014-10-02T11:18:00Z"}, {"professor": "Susan Dwyer", "course": null, "review": "Professor Dwyer is the best professor I've ever had. I took PHIL140 with her my first semester on campus, and then took HONR258J with her last semester just because she was the one teaching. She's hilarious and engaging, she's a \"tough\" but incredibly fair grader (she refuses to accept BS, but you are rewarded for hard work), and her classes are fun to be in. I've learned a lot from her from both classes, and my writing is significantly better after working with her. \r\nOne of my favorite things about having her as a professor is that she will work with you on your papers. If you email her a draft, she will send back suggested changes, questions to think about, and general advice. Her responsiveness and helpful feedback make it nearly impossible not to do well. \r\nTake any class she teaches, you'll be glad you did.   ", "rating": 5, "expected_grade": "A+", "created": "2012-11-26T19:19:00Z"}, {"professor": "Susan Dwyer", "course": null, "review": "Professor Dwyer is a great professor but is a very difficult grader. While this class was very interesting and thought-provoking, the papers were quite stressful. However, as others have mentioned, she will review papers before you turn them in which helps greatly.\n\r\nIf you're really good at coming up with arguments and taking apart the arguments of others, you shouldn't have too much trouble. However, as a technical major, this was a bit more than I bargained for (and I've taken several honors seminars before as well as 400-level technical courses).\n\r\nPersonality-wise, Dwyer is a hoot. She's a sassy Australian and is to the point. She also bakes and brings in food every couple weeks!", "rating": 4, "expected_grade": "A", "created": "2012-06-22T00:30:00Z"}, {"professor": "Susan Dwyer", "course": null, "review": "Professor Dwyer is a fantastic woman and a great teacher. She's very caring and nurturing and provides a safe learning place for her students. That being said, she dones't let anyone get away with sloppy work. Don't expect to do well in her class if you half-ass her assignments, because she can tell. She offers to review your papers before you turn them in. TAKE HER UP ON THIS. You're guaranteed at least a B if you review your papers with her, and she curves 85 up to an A so an A in her class is definitely doable. \n\r\nDo the readings before class obviously, and make sure you're engaged and involved. She definitely makes note of how hard you work, even if she says that won't affect your grade.\n\r\nShe's a funny person and she's very candid with her students. Expect to learn some life lessons and something about yourself from taking her class.", "rating": 5, "expected_grade": "", "created": "2012-05-31T03:15:00Z"}, {"professor": "Susan Dwyer", "course": null, "review": "She's pretty intense. While it's clear that she cares about her students and is willing to go very far out of her way to help them, she nonetheless comes off as intimidating and unapproachable.\n\r\nThis was an impromptu seminar-style class, so it was probably run differently than most. That said, she's clearly intelligent and willing to spend a lot of time making things clear. That's also frustrating, because she's willing to talk about topics that either aren't that interesting or aren't that difficult.\n\r\nI personally don't really click with her, but she earned every one of the three stars I'm giving her. She's genuine and caring and intelligent. I just didn't like being in her class that much.", "rating": 3, "expected_grade": "A", "created": "2012-05-18T19:22:00Z"}, {"professor": "Susan Dwyer", "course": null, "review": "Dwyer was an amazing, engaging teacher, and this seminar was easily my favorite class of the semester. The workload is pretty light (1 exegesis, 3 short [1000 word] papers, and 1 ~1500 word final paper), and if you submit a draft the papers about a week early she will go over them for you before you submit them for a grade. The class discussions were usually interesting, with a lot of back-and-forth between the members of the class.", "rating": 5, "expected_grade": "A", "created": "2012-02-02T17:25:00Z"}, {"professor": "Susan Dwyer", "course": "PHIL140", "review": "Professor Dwyer was a fantastic teacher. I learned a lot from her and she's very easy to follow. She's also always available for help and encourages students to seek it out. However, Philosophy 140 was the worst course I've taken at Maryland. I signed up for it expecting it to be really enjoyable, but my TA completely ruined it. He taught in an awful, monotone voice and he seemed to hate teaching entirely. I e-mailed him for help several times and I rarely got an e-mail back. For the amount of work I put into this class, I really believe I should have gotten a better grade. This is the easiest class I'm in the semester and it's the class I have the lowest grade in. If you like philosophy, this is a great class. However, I'd recommend you take a different class, especially to fill a CORE. Or, if you're determined to take it, make sure you sign up for a section with a different TA. My experience was awful.", "rating": 3, "expected_grade": "B", "created": "2011-12-12T15:20:00Z"}, {"professor": "Susan Dwyer", "course": null, "review": "Professor Dwyer is fantastic, and I would definitely recommend taking this course. The class (although slightly altered every semester) consists of a short exegesis, two short papers, and a final. If you submit a draft of your paper at least a week before the due date, she will review it for you. (It is always great to get comments/suggestions on a paper, especially when they are from the person that will eventually be grading it!) She is a very thorough grader, but very fair. You should know exactly how you did on a paper before ever getting it back.\n\r\nnote: Although the class reviews both sides of every argument and shows students new ways to look at issues, it does cover extremely controversial topics, and the students taking it tend to be liberal-leaning as a whole. If you have conservative views, I would suggest getting a friend to sign up with you. Class discussions are much more interesting when different sides of the political spectrum are represented (and Prof. Dwyer knows it) BUT be ready to defend your side.", "rating": 5, "expected_grade": "A", "created": "2011-07-17T17:55:00Z"}, {"professor": "Susan Dwyer", "course": "PHIL140", "review": "Professor Dwyer is amazing. She is always available for help whether it be online or at her office hours (online mostly). Make no mistake she never gives you the answers but she helps you find them in very creative and helpful ways to understand the source material. Be aware though this class is not a joke and should be taken seriously. I got an 85 in the class which is ok because she generously curves.", "rating": 4, "expected_grade": "A", "created": "2011-06-09T17:30:00Z"}, {"professor": "Susan Dwyer", "course": "PHIL140", "review": "Professor Dwyer is a kind, helpful instructor. Go to office hours if you need help - she loves interacting with students and will read over your papers and give tons of suggestions. My only issue with this class was the final paper, which during Spring '11 was on abortion. Considering most people, if not everyone, in the class had never taken a philosophy course before, this was an extremely difficult subject to write a first phil paper on. ", "rating": 4, "expected_grade": "", "created": "2011-04-28T15:21:00Z"}, {"professor": "Susan Dwyer", "course": "PHIL140", "review": "She is absolutely entrancing.  Philosophy by its very nature makes people think about WHY they believe what they believe......a process that can be very confusing and thought provoking.\r\nProfessor Dwyer combines just the right amount of intellect, wit, and humor to teach controversial topics effectively.  She loves students who regularly voice their opinions and has no problem answering questions.\r\nREALLY good class from which you will learn a lot from.  ", "rating": 5, "expected_grade": "A", "created": "2009-05-14T16:49:00Z"}, {"professor": "Susan Dwyer", "course": "PHIL140", "review": "While the class could be interesting, Dwyer's absolutely archaic grading policies take away from it. It could be partially because my T.A. was reluctant to offer any real help, taught in a complete and boring monotone, and seemed to dislike having to teach anything, but still.\r\nDwyer IS an engaging teacher, but her grading policies (like if you have one late assignment=0 for class) take away from it. On the tests, points are taken off for the most random things, and once those points are off, there is no way to get them back. I will be getting a B in the class, even though I tried harder on this class than others where I am getting an A. ", "rating": 2, "expected_grade": "B", "created": "2009-05-13T10:26:00Z"}, {"professor": "Susan Dwyer", "course": "PHIL140", "review": "As an introductory class in moral philosophy, the class is definitely effective. It isn't the most intellectually challenging due to the course level, and as indicated by the imbecilic comment saying this is the worst class ever.\n\r\nThe workload is fairly light, with eight one-page assignments throughout, two exams and two papers.\n\r\nGrades are distributed very fairly, and the lectures are engaging. A worthwhile class to take for those with half a mind for philosophy.", "rating": 4, "expected_grade": "A", "created": "2009-05-04T21:23:00Z"}, {"professor": "Susan Dwyer", "course": "PHIL140", "review": "I felt this class was the worst class ever. Not because of her necessarily, but the topic is the most useless information ever. \n\r\nAs for Dwyer herself, she tests on the most random information from her slides. Very little grades so if you mess up on just one, then your screwed. \n\r\nEnd of the day I would not recommend this class or her. \n\r\nP.S I feel she gets off telling information that shocks the class. She once said \"imagine yourself enjoying having sex with a 6 year old. have a good day.\"", "rating": 2, "expected_grade": "", "created": "2009-04-10T00:26:00Z"}, {"professor": "Susan Dwyer", "course": "HONR278Z", "review": "Dr. Dwyer is a great person to take any class with. For the yoga Honors Seminar, she was great at starting discussions and giving everyone a fair chance to speak, as well as respecting opinions. If you plan on taking this class, I suggest you be prepared to speak often - she likes those kids. Also, my grade was struggling and I emailed her to re-do assignments for a re-grade, and she was totally okay with it! I never went to office hours but she was always telling us to just go chat with her. Shes great at what she does.", "rating": 3, "expected_grade": "B", "created": "2020-01-08T04:20:35Z"}], "name": "Susan Dwyer", "slug": "dwyer_susan"}