{"courses": ["ENGL101A", "ENGL101A", "ENGL257"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Sydney Sharpstene", "course": "ENGL101", "review": "Professor Sharpstene is by far one, if not the best, professor and English instructor I have ever had. She is a very open and honest professor but she also takes the time to get to know her students. If you have the opportunity to take her as your professor DO IT. You will not regret it. She allows her students to make their own rules for the class, within reason of course. This model works because then students understand exactly what is expected of them and are more likely to follow the rules. Professor Sharpstene makes this class fun and she provides NUMEROUS resources to allow her students to succeed. Every paper we have written, she has allowed us to distribute the percentage of points allowing us to focus on what is most important per paper. I could honestly rave about her for hours. If you have any issues at all, just let her know and she will take care of you. If you show up, do the assignments, and always ask her questions, you are guaranteed to pass this class. I have a 99.6% in this class. Those who fail are ones who actually don't care. If you try, you will absolutely pass. She grades lightly but gives great constructive feedback. She helps you early on fix major problems with your paper so you can make sure your final draft is the best and you are guaranteed to get a good grade. I love Professor Sharpstene's quirkiness and her attitude to teaching overall. You can just tell that she thoroughly enjoys teaching and that this is her passion. Take her as a professor and I promise you that you will NOT regret it. I am beyond grateful for having taken this class with her. As a STEM major (CompE) it can be hard to balance technical classes with a class such as this but she will WORK with you! As long as you openly communicate, she will go the extra mile to help you and come up with a plan so you can actively succeed. She allows for extensions and everything. I just - ugh SHE IS AMAZING!!!!", "rating": 5, "expected_grade": "A+", "created": "2023-04-27T21:46:42.523322Z"}, {"professor": "Sydney Sharpstene", "course": "ENGL101A", "review": "Professor Sharpstene is one of the best English professors I've had as this is my first year in the fall semester. She always shows up with a bright and open attitude and actually shows that she cares about students' performance in class. Her assignments are straightforward, so nothing should be shocking or confusing to you, and she is organized with the instructions she gives out which are really useful by the way. She makes sure that she provides enough resources to her students and it is a lot, and she is always available to answer questions. Her grading isn't harsh, so it is really easy to get an A in her class (I have a A+ right now). She also posts lectures on the canvas page to refer back to which is nice and she gives constructive feedback on assignments. This course won't be difficult for you if you show up, do the assignments, pay attention, and ask for help from this professor, so I highly suggest choosing her when considering in registering for this course! I forgot to add that she usually assigns what readings to read for homework and she gives out reading quizzes based on them before the start of class. Other than that, she is a really sweet and carefree teacher!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T04:26:56.310061Z"}, {"professor": "Sydney Sharpstene", "course": null, "review": "Professor Sharpstene is the Ultimate G. She could very well be the best English professor UMD has ever seen. No cap she just cares about her students and understands how college actually works. She is totally on your team/side and would HIGHLY recommend choosing her over another English professor if you can.", "rating": 5, "expected_grade": "A+", "created": "2023-12-22T00:23:01.299936Z"}, {"professor": "Sydney Sharpstene", "course": "ENGL101A", "review": "Professor Sharpstene is an absolute G. She is super flexible and always try’s to help her students out. I would take her over any other professor no cap. 10/10!", "rating": 5, "expected_grade": "A+", "created": "2023-12-22T05:57:55.588603Z"}, {"professor": "Sydney Sharpstene", "course": "ENGL101", "review": "I ABSOLUTELY loved having her as a professor. She is so sweet and understanding, and is not a harsh grader whatsoever. The way her class was set up was you would have a reading quiz in the beginning of class, which was just asking \"what was the main ideas from the reading?\" and you can just skim the textbook readings in order to get the answers and to actually learn the material. She would teach a lesson on whatever paper we were working on, or were soon going to be working on, and then we would have a class activity or worktime to work on whatever paper we were working on. The papers don't take a lot of time to write unless you've saved it all until the last minute, and you have a week to get each draft in, and with the first draft of longer papers such as the position paper, you wouldn't have to get all the pages in. Professor Sharpstene would also be very willing to provide thoughtful feedback to papers, and would respond promptly to emails written at reasonable times of day, sometimes even in the middle of the night. Additionally, she was energetic and enthusiastic about what she was teaching, which was great during a 7:30-8:45 PM class when all the students were tired.", "rating": 5, "expected_grade": "A+", "created": "2023-12-23T14:56:11.246694Z"}], "name": "Sydney Sharpstene", "slug": "sharpstene_sydney"}