{"courses": ["ASTR380", "ASTR100", "ASTR101", "ASTR620", "ASTR101", "ASTR399", "ASTR340", "ASTR340"], "average_rating": 4.2222, "type": "professor", "reviews": [{"professor": "Sylvain Veilleux", "course": "ASTR380", "review": "Don't be mistaken by my score of 3/5.  This is NOT a difficult course.  There are going to be a few topics that may be a bit more difficult if you're unfamiliar with them (such as biology or astronomy), but it's easy enough to learn what you need.  There's 5 homework assignments of a few questions each throughout the semester that only took about 30 minutes to an hour to complete.  One midterm and a final that are completely short answer (approximately 20-25 questions on each exam).\n\r\nMy score of 3/5 is just based on the fact I found Dr. Veilleux to be an uninteresting speaker.  Going straight from the powerpoint, Dr. Veilleux tried to be engaging and a little excited about the topics, but really just doesn't have the personality for it.  Something just felt off, even when speaking to him or asking a question.\n\r\nOther than being a dry speaker, it was an easy course.  He posts his lecture slides online.  Attendance is sort of \"mandatory\" in that he will ask a 1 point question after the lecture just to make sure the people that attended and paying attention get credit (though it's usually super easy like \"Name one of the rovers on Mars\" or \"which part of this Evolution lecture are you still not convinced by?\") and he doesn't always do it (maybe half the time).  I would probably avoid taking a more challenging class with him, but he was adequate for this course.", "rating": 3, "expected_grade": "A", "created": "2014-12-03T18:10:00Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR100", "review": "He is really nice. His power point lectures are interesting.  If you attend lecture you don't really have to read. The homeworks are a bit hard.  The tests are fairly moderate.", "rating": 4, "expected_grade": "B", "created": "2007-12-02T19:29:00Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR100", "review": "He is an okay teacher, not great. But his class is laid out straight forward. There are countless extra credit opportunities, and the exams are simple. The homeworks are also easy. ", "rating": 4, "expected_grade": "A", "created": "2018-12-13T16:05:34Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR100", "review": "He is fine. Only 5 homework total. Lots of stuff to learn. Disc are fine with a worksheet. Tries to be funny. Cool experiments in class. Lectures are boring at times.", "rating": 4, "expected_grade": "", "created": "2018-12-13T19:00:26Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR101", "review": "Good professor, class was fairly easy, interesting lectures. He is an engaging speaker and the workload is not too intense for a lab credit. I was/am not super interested in astronomy but I still enjoyed the class and didn't struggle too much. Overall, I would recommend for someone looking for a semi-interesting GenEd with a good professor. ", "rating": 4, "expected_grade": "A+", "created": "2021-08-17T17:34:26Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR101", "review": "I recommend taking ASTR101 if you need an gen ed requirement for lab.  It's a pretty easy course and the labs and homework aren't too difficult.  I just gave 3 stars because I found this class to be so boring and much of chore throughout the semester to watch all of the lecture videos.  Professor Veilleux is a great guy and is good at what he does, but his speaking makes it difficult to stay focused for long periods of time.  He does however do some cool experiments in class from time to time.", "rating": 4, "expected_grade": "A", "created": "2023-05-06T15:04:45.088117Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR101", "review": "Veilleux is a pretty good professor. Sometimes concepts are left unclear, but it is not detrimental to your grade. ATTEND office hours for homework. It is likely that you will not get a good grade by yourself.  The class is a lot easier than it looks. You will get lecture quizzes the day before each class which is easy. I advise watching the lecture videos in full before class because it helps confirm concepts. Don't be afraid to take this class, it is very interesting. The lab is also pretty easy and you'll usually get out early. also, two labs are dropped.", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T14:43:53.704427Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR101", "review": "For a lab class, this was a steal. You do a little work and quizlet for all the reading assignments. He keeps lectures interesting, but he makes you watch the lecture the night before, then show up to class to 'review'. He uses clickers and has lots of participation points, but you can just answer the clicker questions from home. Everything in the class could be ChatGPT'd. Overall it was a good experience, an interesting topic, and a good down to earth teacher, I definitely recommend this class and him to fulfill the gen-ed", "rating": 5, "expected_grade": "A+", "created": "2023-05-11T00:20:15.641719Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR340", "review": "This professor is very understanding and wants you to succeed in class. He takes out your lowest grades from the homework and homework quizzes. His class is very dependent on your exam grades, however if you study the PowerPoint and homework thoroughly, you should get above average and the curve should really help you. His lecture may be a bit boring but if you go over the lecture slides you should be set for this class. 10/10 professor, would take again if I could.", "rating": 5, "expected_grade": "A-", "created": "2023-12-19T17:53:45.814930Z"}], "name": "Sylvain Veilleux", "slug": "veilleux"}