{"courses": ["ASTR380", "ASTR100", "ASTR100", "ASTR380", "ASTR435", "ASTR100", "ASTR399", "ASTR635", "ASTR330"], "average_rating": 4.7, "type": "professor", "reviews": [{"professor": "Thaddeus Komacek", "course": "ASTR380", "review": "Prof. Komacek was a great professor honestly. His lectures were kinda dry and his exams were pretty rough, but he tried his best to make the class fun and interactive, and he was very lenient with grading. If you take 380 with him you'll be in good hands.", "rating": 4, "expected_grade": "B+", "created": "2021-12-17T03:10:26Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR380", "review": "Professor Komacek tries his best to make sure you succeed in his class by giving extra credit points and even an optional project to boost up your grade. The hard part of the course is the exams as they require you to memorize a significant amount of information taught in class but otherwise this class is very laid back. ", "rating": 4, "expected_grade": "A-", "created": "2021-12-23T05:53:08Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR380", "review": "Very nice professor and wants to help you as much as he can. Lectures are pretty boring if you are not super interested in astronomy. \r\nThe only rough part are the exams since they require you to memorize ALOT from the lectures, but the class gives you a lot of other grades to make up on the exams. \r\n ", "rating": 4, "expected_grade": "A-", "created": "2022-01-23T03:27:21Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR100", "review": "He is passionate and the TAs were great! Not a fan of the async schedule and layout but one gets used to it. ", "rating": 5, "expected_grade": "", "created": "2022-05-02T19:35:15Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR100", "review": "Professor Komacek is very knowledgeable and passionate and is a good lecturer. ASTR100 is a great course for anyone looking to get a gen-ed out of the way. If you show up to class and give an ounce of effort to the at-home projects, you can easily expect a high B. I can't speak for the other TAs, but my TA, Serena, was also excellent. She made herself regularly available for office hours, responded to emails quickly, and was a fair grader. ", "rating": 5, "expected_grade": "A", "created": "2022-05-02T19:40:14Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR100", "review": "Professor Komacek is a very knowledgeable professor, that is very good at keeping the class engaged. He had many demos to relate concepts, and the course was structured in a “hybrid” fashion. We would show up to lecture every other week, and do work on our own. Everything was open notes + access to the web if we chose to do so(this made things very easy)This was a gen Ed course for me that was very manageable, and I enjoyed the material. If you need a gen Ed , definitely take this course with Komacek.", "rating": 5, "expected_grade": "A", "created": "2022-05-13T13:29:22Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR100", "review": "Professor Komacek was a good teacher and you could tell he cared about the well-being of his students, he wanted each and every student to succeed but also learn while doing it. This class was not particularly hard unless you are bad at self-discipline and time management; there is a lot of asynchronous work that you need to complete with deadlines. I really liked the structure of this class because you would have to go to discussions every week and lecture every other. Sometimes the lectures feel long and are hard to follow, coming from someone who has no past knowledge of astronomy. But overall, this class was a very good class for someone who needs to fulfill their natural science general education requirement.", "rating": 5, "expected_grade": "A", "created": "2022-05-17T01:35:20Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR100", "review": "Dr. Komacek was awesome, incredibly accommodating, and tried to make lectures interesting. The class wasn't too hard, it can be easy for the asynchronous work to pile up, but he offered lots of extra credit and was lenient on late submissions. He tries to make basic astronomy digestible and wants everyone to be able to understand.", "rating": 5, "expected_grade": "A+", "created": "2022-12-18T01:45:01.479077Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR100", "review": "Super easy class. Easy A+. My TA was awesome and I had a fun time learning about stars and galaxies. No midterms or finals either. \r\nOnly negative is a lot of reading every weekend but the end result is worth the pain.", "rating": 5, "expected_grade": "A+", "created": "2023-01-15T08:54:25.587576Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR435", "review": "Dr. Komacek is an amazing professor that made exoplanets one of the best courses at UMD. He is a great lecturer and always allowed questions and comments. He gave a mid-semester review survey and incorporated our suggestions into his homework and lectures. If you have the chance to take any class with him, I would firmly recommend it.", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T03:58:22.824554Z"}], "name": "Thaddeus Komacek", "slug": "komacek"}