{"courses": ["CMSC878O", "CMSC250H", "CMSC764", "AMSC764", "CMSC798", "AMSC663", "CMSC389O", "CMSC663", "AMSC664", "CMSC664", "CMSC498P", "CMSC798P", "CMSC473", "CMSC673", "CMSC389O", "CMSC389O", "CMSC473", "CMSC673", "AMSC764", "CMSC764", "CMSC389O", "CMSC473", "CMSC673", "CMSC389O", "AMSC764", "CMSC389O", "CMSC764", "CMSC473", "CMSC673"], "average_rating": 4.2, "type": "professor", "reviews": [{"professor": "Thomas Goldstein", "course": "CMSC389O", "review": "Taught by TAs not this professor. But definitely a good STIC class to take. Lots of EC too, so not hard to get an A.", "rating": 5, "expected_grade": "A+", "created": "2020-05-02T18:35:23Z"}, {"professor": "Thomas Goldstein", "course": "AMSC764", "review": "Probably the most interesting CS class I’ve taken. He definitely knows what he’s talking about and he’s very clear. Pace is very fast so make sure you’re paying attention.", "rating": 5, "expected_grade": "B+", "created": "2021-05-16T14:30:11Z"}, {"professor": "Thomas Goldstein", "course": "CMSC389O", "review": "An interesting and helpful STIC course to review all common data structure concepts before a coding interview. It is taught by TAs, not by professor. There are lots of extra credits assignments. It's easy to get an A as long as you submit the homework and quiz on time every week.", "rating": 5, "expected_grade": "A", "created": "2023-05-01T23:40:15.349748Z"}, {"professor": "Thomas Goldstein", "course": "CMSC389O", "review": "Taught by TAs, so the review doesn't apply to Professor Goldstein.\r\n\r\nI had no idea about Leetcode, so this course taught me how to solve some Easy Leetcode problems on arrays and strings. After that, I did not improve much, especially on topics like trees and graphs and dynamic programming.\r\n\r\nIt's not a course that starts from scratch and slowly teaches you everything there is about Leetcode problems. If you know nothing, at most, you'll learn how to solve some array and string problems. As for the rest, you get out of it what you put into it, i.e. it depends on how much you personally practice Leetcode, which has nothing to do with the course.\r\n\r\nDespite learning little, I got an A, because the exams and homeworks are easier.\r\n\r\nConclusion: take the course if you want an introduction to Leetcode, but don't expect to learn a lot just from the course itself.", "rating": 2, "expected_grade": "A", "created": "2023-05-12T01:21:28.669335Z"}, {"professor": "Thomas Goldstein", "course": "CMSC389O", "review": "Fully TA taught. Super fun class to chill in learn a bit about coding interviews/leetcode and just get some advice and talk. Class is a 5, idk anything about the teacher since no one met him before.", "rating": 4, "expected_grade": "A+", "created": "2023-12-20T07:47:29.545727Z"}], "name": "Thomas Goldstein", "slug": "goldstein_thomas"}