{"courses": ["ENGL101", "ENGL396", "ENGL352", "UNIV104", "ENGL388W", "ENGL391", "ENGL388W", "SPAN388W", "ENGL388W", "ENGL398A", "SPAN388W", "ENGL388W", "SPAN388W", "ENGL388W", "SPAN388W", "ENGL271", "ENGL388W", "SPAN388W", "ENGL388W", "SPAN388W"], "average_rating": 4.2727, "type": "professor", "reviews": [{"professor": "Thomas Earles", "course": "ENGL352", "review": "Agree with the people below me. However, I just want to clarify that he grades on the grammar and syntax of your stories rather than its content, so for some (like me) the grade can seem unfair. Just don't make those mistakes and you should be fine.\n\r\nStructure of the class is like this: you have to write letters for the stories you read, a few short assignments, 2 short stories, 1 revision, 1 crafts paper, and 1 paper about the discussion you lead. He basically hands out free A's on anything other than the stories, so even if you fuck up once or twice you should still get a solid A in the class. From what I've seen, the only reason people do poorly is if they don't come to class.\n\r\nOverall, he's a cool dude and I definitely learned quite a bit from his class. Just don't cut him off while he's talking or submit stuff late and you should be fine. Would recommend taking his class.", "rating": 4, "expected_grade": "A", "created": "2014-12-21T03:57:00Z"}, {"professor": "Thomas Earles", "course": null, "review": "Harsh grader, very subjective.  Grades should be based on your writing ability, not his opinion of your story.  The instructions for many of the assignments are misleading, and you get docked for HIS lack of clarity.  \r\nGenerally a nice guy, tho.", "rating": 2, "expected_grade": "", "created": "2013-05-09T17:55:00Z"}, {"professor": "Thomas Earles", "course": "ENGL294", "review": "Pretty adamant about turning things on time. One time a girl forgot to print something out because of a fire drill and he required her to get documentation of the drill along with the signatures of two witnesses. He does not accept late submissions. \n\r\nOther than that, he's a good teacher that genuinely wants you to be the best writer you can be. He's really good at constructive criticism. \n\r\nAs long as you stay on top of things (and it's really not a lot of things...) then it should be an easily achievable A. ", "rating": 4, "expected_grade": "A", "created": "2010-12-22T13:30:00Z"}, {"professor": "Thomas Earles", "course": "ENGL391", "review": "Really, really subjective about grading. Getting a rubric from him is like getting water from a stone. That said, he's pretty forgiving if you have decent grammar and mechanics in your paper. Funny guy too. Probably would recommend if you're already decent at writing because he doesn't necessarily *teach* a lot, necessarily. ", "rating": 3, "expected_grade": "A", "created": "2021-11-24T21:11:45Z"}, {"professor": "Thomas Earles", "course": "ENGL388W", "review": "Great guy. Very funny. Led class well but I hated how long it was. ", "rating": 5, "expected_grade": "", "created": "2021-12-07T18:20:32Z"}, {"professor": "Thomas Earles", "course": "ENGL388W", "review": "Tom was great! The internship was a lot of fun. I agree with others in that I didn't learn much about the mechanics of writing in this class. Luckily, I'm an English major and write well already, but if I didn't have a really solid grasp of English or how to write a paper, I don't think I'd do very well. Despite its length, I looked forward to ENGL388W every week. It was my favorite class this semester!", "rating": 5, "expected_grade": "A+", "created": "2022-05-22T00:39:03Z"}, {"professor": "Thomas Earles", "course": "ENGL388W", "review": "Took 388W during Spring 2022, but I want to add a review for anyone who's considering the internship because they want to tutor at the writing center. Prof Earles is a wonderful guy and really easy-going and funny. He's only harsh if you don't show up to your scheduled shifts, which is understandable, because this internship is supposed to prepare you to become an actual tutor. Classes were long, but they were only once a week, and they were enjoyable. You don't learn much about the mechanics of writing because the class is about tutoring and learning the mechanics of the WC - you're pretty much expected to already know the mechanics of writing. (If you didn't, when you applied for permission to take the class, you'd be rejected.) The workload can get a little overwhelming (readings were very long, there are a couple of group projects and discussions that every person needs to lead), but again, given that the class is once a week, it's not horrible. It also satisfies the Scholarship in Practice gen-ed req, which is an added bonus. Overall, this class is worth it, and if you'd like to try for it and you want to become a tutor, I highly encourage applying and taking the internship.", "rating": 5, "expected_grade": "A+", "created": "2022-12-01T19:43:49.858406Z"}, {"professor": "Thomas Earles", "course": "ENGL398A", "review": "Took this class for professional writing, specifically for the arts. This was a really good class. We had 5 main assignments: manifesto, press release, long review, grant paper, and e-portfolio. And also a few smaller assignments. All the main assignments felt practical and important for a working creative person / arts adjacent career. He's a really nice person. I found him to be an easy grader, but I already came in with good writing and grammar skills. He also left comments back on my papers, which I appreciated.", "rating": 5, "expected_grade": "A", "created": "2022-12-15T19:02:41.310470Z"}, {"professor": "Thomas Earles", "course": "ENGL101", "review": "Overall I would say he's a pretty decent teacher. His lectures tend to be a bit boring but he understands how people dont like to take english 101 because they want to so he definitely takes that into account. He's a very lenient grader, most of my major assignments i turned in ten minutes before they were due and still got an A on them. Really understanding that his student's are freshman still figuring stuff out so he is not nitpicky about stuff.", "rating": 5, "expected_grade": "A", "created": "2023-05-11T03:38:12.114634Z"}, {"professor": "Thomas Earles", "course": "ENGL388W", "review": "Can be scary at times, but overall super funny and nice. He grades relatively fairly, and he can be strict at times although it is always about things that make sense i.e. showing up to tutoring on time and other things related to the job.", "rating": 4, "expected_grade": "A", "created": "2023-05-14T18:06:30.385083Z"}, {"professor": "Thomas Earles", "course": "ENGL388W", "review": "Can seem scary at first but he's really funny and generally nice! He can be a bit strict in the writing center but I don't blame him. Would recommend.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T21:59:30.900108Z"}], "name": "Thomas Earles", "slug": "earles"}