{"courses": ["AMSC466", "MATH462", "AMSC460", "MATH246H", "MATH424", "MATH241", "MATH461", "AMSC808V", "AMSC666", "MATH120", "CMSC466", "CMSC460", "AMSC808F", "CMSC666", "MATH410", "MATH464", "MATH135", "MATH401", "AMSC660", "CMSC660", "AMSC661", "CMSC661", "AMSC460", "CMSC460", "AMSC460", "AMSC663", "CMSC460", "CMSC663", "MATH246", "AMSC460", "AMSC664", "CMSC460", "CMSC664", "AMSC460", "CMSC460", "MATH121", "AMSC460", "CMSC460", "AMSC460", "CMSC460"], "average_rating": 3.4783, "type": "professor", "reviews": [{"professor": "Tobias von Petersdorff", "course": "AMSC460", "review": "There was one day in class where Von Petersdorf ran around in front of the classroom at full speed and repeatedly apologized to the class in a high pitched squeaky voice because he got too nervous to continue teaching. He suffers from  some serious anxiety when talking to people and should not really be in front of a classroom.\n\r\nPosts notes online that were actually quite good and reading through these is much more useful than going to lecture.\n\r\nDid not hand back any homeworks or exams at all.", "rating": 1, "expected_grade": "A", "created": "2015-12-07T12:44:00Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH462", "review": "Von Petersdorff is crazy. I don't even know what to say. Read the description below (by the anonymous guy in AMSC466) for a detailed description of lecture, as hard as it is to believe that description is correct and there is no exaggeration. \n\r\nTests:\r\nWere fair, and based on lecture material\r\nWe had one test and one final, but we were supposed to have two tests.\r\nWe took the test before spring break and got it back on the last day of classes in May.\n\r\nHomework:\r\nWas somewhat difficult, but we only had 3 homework assignments.\r\nThis was also handed back very late, about 2-4 weeks after turning it in.\n\r\nOffice Hours:\r\nIf you want to learn anything you pretty much have to go to office hours, he is much less nervous while in office hours.\n\r\nIf he wasn't crazy he would actually be a good professor.", "rating": 2, "expected_grade": "B", "created": "2012-06-01T10:14:00Z"}, {"professor": "Tobias von Petersdorff", "course": "AMSC466", "review": "Von Petersdorff is prone to panic attacks which sadly interfere with his ability to hold meaningful lectures. Last lecture, he got lost in the middle of a proof which put him in such a state that he twice threw himself on the ground in fits after dropping the eraser. His medical condition is manifested by loud bursts of panting and crying, and overall nervousness. He runs around the front of the classroom, and when he is having trouble reciting a proof will chew on his hand. Because he has panting attacks, students will falsely reassure him that they understand his lecture so he doesn't have an episode, if they think he is about to break down. This problem is compounded by the fact that he does not use a text so the student is reliant on his lectures to learn the material. \r\nWe took an exam on March 12, and as of May 3, we have yet to get them graded and returned. That exam and 3 homework assignments are all we have done in this class, so he is completely disinterested in providing feedback to students. When approached about this, he always says they will be ready tomorrow. Finals are soon and we have received feedback on 2 homework assignments from March, nothing else.This is not an appropriate review of student performance. \r\nTo clarify: This teacher has a  condition that negates his ability to be an effective teacher during lecture, and outside of the classroom he finds no reason to provide feedback to students or find other methods to evaluate a student's progress. It is hard to be led to any conclusion other than the University turning a blind eye to his troubling condition out of pity. I would not recommend this teacher to any student.", "rating": 1, "expected_grade": "B", "created": "2012-05-03T16:37:00Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH241", "review": "Good lecturer, fair exams. However, he gets an anxiety attack anytime something goes even slightly wrong like writing the wrong thing on the board. He will erase and rewrite the whole thing multiple times. The exams weren't hard if you did the homework. The MATLAB assignments he gives out can get really ugly and painful if you don't know MATLAB. Overall, the class wasn't too bad.", "rating": 4, "expected_grade": "A+", "created": "2012-01-06T18:49:00Z"}, {"professor": "Tobias von Petersdorff", "course": "AMSC460", "review": "Despite the fact that AMSC460 supposed to be an application course, we hardly learned any applications. Lectures were good, but we were barely given any HW assignment (4 assignments were given to us instead of expected 6). Because we did not have any text to rely on; lack of HW assignments was especially hurting. \r\nThe few homework assignments, that we did get from instructor were very short, and given to us on last minute notices (to be fair, they did contained interesting problems). \n\r\nPros:\r\n1)Online notes that he did provide to us (which is materials covering first quarter of the course) were very organised and extremely helpful.\r\n2)Lectures in class were also good.\r\n3)He is a fare grader when it comes to checking exams.\n\r\nCons:\r\n1)Through later part of the course he almost stopped providing updates on his website and virtually gave us no HW so we had to rely only on the notes we made in class to prepare for the second midterm.\r\n2)Exams were not always related to HW\r\n3)He is very sensitive about due dates.\r\n4)He is difficult to talk to when he is tired or stressed out.", "rating": 3, "expected_grade": "", "created": "2011-05-04T19:26:00Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH246", "review": "He's an excellent professor who really understands the material and is pretty good at teaching it. His exams are extremely fair, and if you study you should do well, although it is easy to make stupid mistakes and lose a lot of credit. Matlab assignments were relatively long, but were graded very kindly and generally helped with everyone's grades. \n\r\nHe does have panic attacks, as other people have mentioned. Sometimes they interfere with class or getting an exam passed out on time. He seems to be working on controlling them, as sometimes he will come close to having a panic attack but will breathe deeply and control himself. It seems to help to give him all the answers he asks for and ensure him that everything is OK and readable when he starts to frantically erase.", "rating": 4, "expected_grade": "A", "created": "2010-05-20T15:18:00Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH246H", "review": "His exams are very straightforward, and he goes over the material on the review days before the exam. He's a very good professor and always tells you whats relevant. \n\r\nIf you go to class you probably wont even have to study for the exams.\n\r\nHe will also drop and exam if you need it", "rating": 5, "expected_grade": "A", "created": "2010-05-16T23:38:00Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH246", "review": "He's a good professor. Study well and earn your grade with him", "rating": 4, "expected_grade": "", "created": "2010-05-11T21:09:00Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH246", "review": "The instructor covered the material very well and explained how to do each type of problem however it was distracting to watch the professor have panic attacks in class in middle of a problem. It is unnecessary to erase the whole board because of a small algebra error such as a missed sign. His matlab assignments are very long and since he forgets to post them up I had less than a week to do the matlab and no time to do them over the weekend. I would suggest Von Petersdorff as a math professor since he covers the material well and because his tests are fairly straight forward on material covered in class.\n", "rating": 4, "expected_grade": "", "created": "2010-04-27T21:59:00Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH221", "review": "I have no idea what happened to me in this class. Math used to be my favorite, and best subject. But for some reason I got to this class and was just clueless. From what I heard, my classmates all found the class very easy and were doing very well on his exams. Me? I ended up with a C in the class because I failed the final miserably. The lectures left me lost and confused. On a side note, he was always very helpful during office hours. \r\nI don't quite know how to review him. Everyone around me found his exams easy. For me, I was just lost and confused. ", "rating": 2, "expected_grade": "", "created": "2010-01-04T16:55:00Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH241", "review": "von Petersdorff is a good professor in my opinion. If you go to class and take good notes, you'll have a good idea of what's going on even if you don't pay attention. However, his exams are in no way easy. If you want to do well, you'll have to do the homework even though it doesn't count towards your grade. As with all math courses here, having a good TA can make a HUGE difference in how you do.", "rating": 4, "expected_grade": "B", "created": "2009-05-22T18:31:00Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH241", "review": "Dr. von Petersdorff conducts his class in a manner that is suited for math majors only, and fails to realize that the majority of people in the class do not necessarily have the same aptitude for math that he does.  He fails to explain concepts that he deems simple, instead spending most of his lecture time on proving equations instead of actually teaching the class why those equations are useful.  Few examples are shown, and those do not at all cover the breadth of problems that students are expected to answer.  He is very disorganized, hard to contact (when I e-mailed him from my school address he never responded), and is overall a poor teacher for large introductory classes.  On the other hand, if you have a really good TA or spend a lot of time learning the material yourself, his tests are generally pretty easy.  Unfortunately, most of the class does not understand the material, and the median for our last two tests was in the mid-sixties.  He's not curving the class.\r\nIf you have other options and want a good math teacher for lower-level classes, don't pick him.", "rating": 2, "expected_grade": "B", "created": "2009-05-14T17:59:00Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH246", "review": "Fair exams, good lectures.", "rating": 4, "expected_grade": "A", "created": "2008-05-01T17:33:00Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH120", "review": "Try to take somebody else. His lectures are messy and make no sense, and the tests include material that hasn't been covered before. Tests are also very long, as almost everybody would be working till the end. Don't take him.", "rating": 2, "expected_grade": "B", "created": "2018-01-26T15:35:11Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH464", "review": "At the beginning of the semester there were quizzes based on each class, which was fine, but those stopped after the first few weeks. The problem was there were almost no practice problems or homework's the entire semester. He decided to assign our only homework during finals weeks and it was worth 30% of our grade. He finally provided a few practice problems for the final exam, but most of the class was unprepared for the final since we'd had almost no other practice with the material all semester. Although the theory was well explained, he did almost no examples in class, so no one in the class really learned anything.  The whole semester was basically a waste. Would not take this guy again or advise anyone who wants to learn the material NOT to take him. ", "rating": 2, "expected_grade": "", "created": "2021-05-18T03:47:35Z"}, {"professor": "Tobias von Petersdorff", "course": "CMSC460", "review": "The professor does have some pretty bad anxiety at times and it can be really uncomfortable for the students, but overall he is a great professor. His explanations can be extremely in depth and hard to follow but he does not expect you to be able to derive those explanations for yourself, just to build some intuition as to why things work. His homework’s were pretty difficult but he would give out tips and answers when students were really struggling, his exams were extremely fair and very similar to his sample exams. I recommend taking this class with Dr Petersdorff.", "rating": 5, "expected_grade": "A", "created": "2021-12-21T17:13:31Z"}, {"professor": "Tobias von Petersdorff", "course": "AMSC460", "review": "feel like the reviews are too low for this prof. he's a nice guy and solid teacher. you don't really have to go to class since he posts really good notes online. for exams he always holds review sessions the class before that are very helpful and also gives practice exams that are fairly representative of the actual exam. my only issue with him was that the homeworks could get rather tedious, but I guess that is to be expected from a 400 level class. he also provides hints for the hw so nothing is insanely difficult", "rating": 5, "expected_grade": "A", "created": "2023-01-03T17:29:43.548613Z"}, {"professor": "Tobias von Petersdorff", "course": "AMSC460", "review": "For the Fall of 2023:\r\n\r\nDr Petersdorff is the best professor I have taken a class with in my 2 years at UMD as a Math/CS major. His lectures, although dense, are easy to follow and you can walk in not knowing anything and will still be able to understand almost everything. The homework were the hard part of this class, but he always gave hints to the HW and HW often directly derived from class material. If you couldn't make it class it is fine because he posts very detailed lecture notes (sometimes even better than lectures) on Canvas. The practice exams were very similar to the practice exams he posted, and often were similar to the easier problems on the homework. He also does a thorough review session for each exam. Overall, if you have the option, I recommend taking this class with Dr. Petersdroff. It requires work, but you will actually learn the material and it isn't too hard.", "rating": 5, "expected_grade": "A", "created": "2023-06-01T18:32:49.429722Z"}, {"professor": "Tobias von Petersdorff", "course": "AMSC460", "review": "His lectures can go really in depth but he clearly emphasizes what you need to know for exams. Practice exams are also very similar to the real thing. He's also pretty helpful in office hours. The hardest part of this class is honestly the homeworks, which at times were very tedious and difficult to understand. He also is still prone to panic attacks (see reviews from before) which can sometimes be uneasy to watch.", "rating": 4, "expected_grade": "A", "created": "2023-12-19T14:10:46.368406Z"}, {"professor": "Tobias von Petersdorff", "course": "AMSC460", "review": "The other reviews summarize the pros and cons his teaching very well: the panic attacks are definitely shocking at first, but at the end of the day he's a nice guy with manageable exams and does a great job lecturing in an intuitive and interesting way. He has note sheets which summarize lectures well, and also have example code of what he wants to see in assignments, and also has midterm/exam review sessions were very clear and made the actual tests feel fair. Also, shout out to the assignments he writes, since those don't crunch numbers aimlessly, but instead use what we learn in class for real world processes (e.g modeling heat transfer through a plate with linear systems, or the velocity and positions for 2 planets orbiting with nonlinear diff-eqs), and while they're quite confusing at first, I found them to be very rewarding to complete. The downsides were some unclear parts (claiming he'd drop an assignment and then seemingly forgetting to do that, and some assignments graded oddly harshly), but also that was made up for when he intentionally pushed back other assignment due dates and had a decent curve up in the class (my 90% became an A). Overall, I'd recommend Dr. Petersdorff since he keeps the class manageable in workload and teaches it well.", "rating": 5, "expected_grade": "A", "created": "2023-12-23T17:58:14.085339Z"}, {"professor": "Tobias von Petersdorff", "course": "AMSC460", "review": "Professor von Petersdorff was a great lecturer and fair grader. This class had 9 MATLAB assignments (35%), 2 midterm exams (35%), and a final exam (30%). Lowest MATLAB assignment was dropped. Before taking this course, you should probably have a decent understanding of MATLAB, as it is required for the assignments and some of the exam questions have you write MATLAB code.\r\n\r\nPros:\r\n- Excellent lectures. He always includes every detail and never misses anything that you would need for a homework or exam. Always willing to answer questions in class too.\r\n- Homework was always interesting and fair. You had to do some written work which prepared us for the exams, as well as some MATLAB work which was just a good takeaway from the class. He included some interesting problems with real life applications which was great. He provided hints for tough assignments on the ELMS page and I never felt that the homework was too hard or easy.\r\n- He has some online notes that were extremely helpful. If you missed a lecture, the notes were always published online so you had access to them. Even if you didn't miss lecture, having them as a resource to review was always great.\r\n- He was helpful in office hours. He answered my questions quickly and helped me troubleshoot some issues I had with MATLAB.\r\n- He had a review session before every exam, and wrote a practice exam with solutions before every exam. They were very representative of the real thing, without being a total knockoff. The grading was also very fair. According to elms, midterm 1, midterm 2, and the final had medians of 90, 91, and 86 respectively. According to the syllabus, a 90 is good enough for an A, 80 for a B, and so on.\r\n\r\nCons:\r\n- His anxiety has not disappeared. If a lecture seems like it is going to go over time, he sometimes panics. The students in the class try to calm him down by saying that they understand (even if they don't) but I'm not very sure that it's helpful.\r\n- He took a really long time to return grades. The graders for the class took a few weeks to grade the MATLAB assignments. The first two midterms also took a while. We only got our second midterm back on the last day of classes before the final. However, he graded the final in a few days. \r\n- The MATLAB assignments are very long. This isn't much of a con though, if you start early you should be fine. He occasionally gives extensions if the students ask.\r\n\r\nOverall, a great professor and course; I learned quite a lot. The cons are not even that big of a deal, I still highly recommend this professor.", "rating": 5, "expected_grade": "A+", "created": "2023-12-24T18:31:16.339276Z"}, {"professor": "Tobias von Petersdorff", "course": "AMSC460", "review": "He uploads lecture notes, making going to lectures completely optional (which is good for people who hate being forced to attend lectures). Furthermore, all his exams were straightforward, with the questions very similar to his uploaded practice exams. The average for each exam when I took the class was around 90 for each exam. Pulling an A for each midterm after only reviewing the content for 2-3 hours is possible.\r\n\r\nHis homework was extremely annoying and tedious. It was all Matlab homework, and since all the calculations were too complicated to be done by hand, it was hard to verify if the solution was what we were supposed to get. Making a mistake early would also cascade and make you lose a lot of points throughout the question/part.", "rating": 4, "expected_grade": "B+", "created": "2023-12-28T00:37:19.097935Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH121", "review": "TVP is cool. One time i needed a HW deadline extended just because I had alot going on, and he did it no questions asked. Yes, he was sometimes nervous, but never in the big breakouts like these reviews detailed. Only a couple of times he became worried, but he was able to calm down and finish class. I think his biggest worry is that students do not understand or cant read his writing, that is usually what causes problems, but to me it just shows how much he cared. Overall he was a super nice guy, and you can tell he really loves the subject...class was very detailed, but I didnt find it super difficult to follow. Exams are straightforward, but  really only from what he teaches, do not practice just with the textbook, practice with HIS notes. I started doing really well when I went to his office hours, he is alot less nervous and is super kind and understanding when I met with him. I was super nervous going into the final so I met with him and he really calmed my nerves, I think he may have made the final easier on purpose. The only huge negative is that canvas the whole semester did not have the weights in that were talked about on the syllabus, so my grade I thought I had was wrong leading up until finals week...real grade was 6% less than canvas grade. wouldve been nicer to know before so I knew where I actually stood, so I would look out for this.\r\n\r\nMATH121 itself is a weird in-between class, Close but not yet 141. Homeworks had nothing to do with lectures, mostly because they were calculator based and we were not allowed calculators. Each HW assignment took me around 1-2 hours, mostly just 1 but never under 1. MATH 121 Had pop-quizzes each week, which really messed up my grade because i only had time to study right before the exam. To do best on those, you need to do practice problems, every. night.\r\n\r\nOverall I would not take MATH121 again because of the not-needed stress it caused. But mostly I want to stress that TVP is not the \"mess\" these revs make him. I do not doubt that these things happened, but he is definitely a more grounded person now. TVP was the only prof for MATH121 when I took it, but if there is another one available I would take a look.", "rating": 3, "expected_grade": "B", "created": "2024-01-09T03:59:35.249713Z"}], "name": "Tobias von Petersdorff", "slug": "petersdorff"}