{"courses": ["MATH141", "MATH401", "MATH135", "MATH406", "MATH464", "MATH402", "MATH401", "AMSC460", "CMSC460", "MATH135", "MATH141H", "MATH401", "MATH136", "MATH402", "MATH464", "MATH401", "AMSC460", "CMSC460", "DATA250", "MATH135", "MATH452", "DATA250", "MATH136", "MATH402", "CMSC456", "DATA250", "MATH135", "MATH456"], "average_rating": 3.4423, "type": "professor", "reviews": [{"professor": "Todd Rowland", "course": "MATH141", "review": "One of the nicest people I've ever met, but I think some of the students in the class could explain calculus better then him... He does not understand some of the things he teaches, and is often corrected by students. I've been teaching myself thus far as the instruction/lecture is less than helpful. ", "rating": 1, "expected_grade": "", "created": "2020-09-16T23:10:22Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Dr Rowland is a super nice guy and it pains me to say this, but he’s not a very good teacher. His entire class this semester seems very confused about topics that seem relatively simple. He presents the material using some weird program that has a lot of unnecessary code around the text. His notes are sloppy, disorganized and very hard to interpret. For the most part, the TAs were better at explaining the concepts in a lot clearer manner. However, he is willing to go out of his way to try to help you if you ask, and the grading is very lax. It’s probably difficult to do poorly in this class even if you don’t understand what is going on", "rating": 2, "expected_grade": "", "created": "2020-10-27T07:34:33Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "Like the other reviews said, he is a nice guy but I stopped going to his lectures very early on. He teaches using Wolfram Alpha/Coding and doesn't really demonstrate the problems well. He is disorganized and confuses himself during teaching. The TA's did way better at helping us understand concepts. He drops a lot of things at the end of the semester though, there is no curve on anything due to this. He even ends up dropping one of the four midterms you have to do. ", "rating": 2, "expected_grade": "B", "created": "2020-12-03T16:42:14Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Cool guy but did not teach well and was mostly a self taught class. The TAs carried the class this year and they were actually super helpful. Doing the practice exams were the best form of studying for me and the workload was decent but the worksheets were a little confusing although TAs explained most of it pretty well during discussions. Sorry Todd.", "rating": 2, "expected_grade": "B+", "created": "2020-12-09T21:30:24Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Amazing professor who stays after in office hours to make sure students understand. ", "rating": 5, "expected_grade": "A-", "created": "2020-12-10T19:06:15Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "I haven't gone to any lectures but I have gotten a 98 or 100 on every exam because he makes them so easy. If you do the practice exam and review a tiny bit on Khan Academy you're good", "rating": 5, "expected_grade": "A+", "created": "2021-04-08T22:54:09Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "Dr. Rowland is one of the nicest professors I've had at UMD. Very genuine guy and he wants you to do well. I had him during a covid semester and his online lectures were not very good because he always used wolfram alpha. Exams were always very easy and were very similar to the study guide. Definitely one of the better professors for 141. ", "rating": 5, "expected_grade": "A", "created": "2021-04-26T15:57:50Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "Had him for online, lectures are eh. He codes in wolfram the whole time, hard to understand. However, if you read the book and actually do the HW you will be more than fine. Todd is a very funny and great guy. He also drops midterms and homeworks from your final grade. Exams are easy and almost the same as the practice ones he releases. Makes 141 a breeze. Wonderful experience. ", "rating": 5, "expected_grade": "A", "created": "2021-04-26T15:57:52Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "Todd was a nice guy who in my opinion had decent lectures even though at times I seemed to have no idea what was going on. The course in my opinion got significantly harder towards the end be he does really want to see his students succeed. With some work outside of class and staying on top of the homework the exams will be pretty easy. I would recommend him if you are able to do a bit of self learning. ", "rating": 4, "expected_grade": "A", "created": "2021-05-07T19:30:32Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "Todd Rowland is a super nice guy. Honestly, if you go to lecture and discussion you will succeed in this class. Just like anything, if you put the effort in, you will learn. Plus, Rowland is literally the nicest teacher you will ever have in your entire life.", "rating": 5, "expected_grade": "A", "created": "2021-05-12T19:41:15Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "If you have the chance to take him for calc 2 do it. He really cares about his students and is one of the nicest profs at UMD. 141 is typically looked at as one of the hardest classes at UMD but he made it very doable", "rating": 5, "expected_grade": "A", "created": "2021-05-12T22:04:16Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "I definitely recommend taking calc 2 with Rowland, he is a great person and teacher.", "rating": 5, "expected_grade": "A", "created": "2021-06-22T17:13:25Z"}, {"professor": "Todd Rowland", "course": "MATH401", "review": "A great and caring guy. Had him  for Math401 online and he was genuinely caring to all his students. He made sure to have one-on-one meeting with all the students and asked how we were doing in the class and what we wanted to do in the future. The class was mainly projects, mini quizzes, and groupwork. For the quizzes we were given two tries which was very nice since he'll go over the quiz in class after the first try. Very responsive to emails and his office hours are great as he'll help you step by step with the project. He will extend office hour to help us. The projects were also very interesting too. He doesn't do plus minus grades. Definitely recommend and take him if you have the choice. ", "rating": 5, "expected_grade": "A+", "created": "2021-07-08T17:11:49Z"}, {"professor": "Todd Rowland", "course": "MATH401", "review": "Excellent. Mostly project based course, which you could receive adequate help on if needed. Projects were programming, and you could complete in Mathematica, MATLAB, or Python. Could tell he genuinely cared about students and lecture. Highly recommend this prof.  ", "rating": 5, "expected_grade": "A", "created": "2021-07-13T13:22:05Z"}, {"professor": "Todd Rowland", "course": "MATH401", "review": "great professor", "rating": 5, "expected_grade": "B+", "created": "2021-07-19T17:07:38Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Professor Rowland is the epitome of great guy, but not so great teacher. You really have to pay attention in class to understand some of the harder problems because he can make it very hard to follow and his work tends to be all over the place. I recommend going to office hours if you have a legitimate question so he can explain it to you one on one. That being said, it is possible to get an A in this class, and he makes an effort to get to know everyone and their names which is a lot more than I can say for most professors at UMD.", "rating": 3, "expected_grade": "A", "created": "2021-12-19T21:13:20Z"}, {"professor": "Todd Rowland", "course": "MATH464", "review": "He hosted office hours 4/5 days of the week and provides practice exams for each midterm and the final. The grading on tests is very fair, and the lowest homework and half of lowest midterm were dropped.\r\n\r\nThe only criticism I would give is that the lecture was not very engaging and there was too much emphasis on computer demonstrations in Mathematica. ", "rating": 5, "expected_grade": "A", "created": "2021-12-23T00:03:49Z"}, {"professor": "Todd Rowland", "course": "MATH401", "review": "Dr. Rowland is one of the nicest professors I have had; he prioritizes you learning the content and the class emphasizes consistent, project-based work. I felt like whenever I went to class, I went to learn about real-life applications of linear algebra instead of trying to pass a class for credits. With that being said, the only thing keeping him from 5 stars is that he can be disorganized or do incorrect arithmetic at times and that makes some concepts difficult to understand at first. ", "rating": 4, "expected_grade": "A", "created": "2022-01-15T21:38:28Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "Todd is a nice guy, and he does care about his students, but he should not teach calculus 2. His lectures are confusing and boring. He skips and adds material to the course randomly. He is unprepared for classes and spends about 15% of lecture time trying to remember what to teach us. Tests are quite difficult (not too difficult) and are very long. I cant in good faith give him one star, because he is kind and he does care. Based on other reviews of him, my guess is that calc 2 is just not his strong suit, which is fine, I would just stick to another professor for math141 if you can. If you do end up taking calc 2 with him, find resources outside of class to help you learn the material.", "rating": 2, "expected_grade": "B", "created": "2022-05-09T19:29:47Z"}, {"professor": "Todd Rowland", "course": "MATH401", "review": "Dr. Rowland is super friendly and caring. He made an effort to learn every student's name and even studied their ELMs picture to try and remember who people were. I believe over time his organization and content will improve and therefore his overall teaching ability. However, for the time being, those skills were lacking enough that I won't be taking another course taught by him. ", "rating": 3, "expected_grade": "A", "created": "2022-05-11T15:04:15Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "Todd is a funny and friendly professor. As many of the reviews below me state, it's pretty hard to learn from him. He tries to connect with students by learning names and stuff, but kindness does not give out knowledge.\r\nI went to every lecture and could not grasp the concepts in his lectures alone. Rather I had to find other outside resources to know what I was doing in class.\r\nFor the good things, he has very nice curves and offers extra credit for your final grade (an extra 2% which seems not like a lot but is great for borderline grades). He halves an exam, drops 3 homework, 3 worksheets, and 3 \"classwork\" like weekly quizzes. He also does not do pluses or minuses and does only normal letter grades. Great for low percentages, bad for high.\r\nI would not recommend Todd to be your #1 choice, but if you happen to land in his class, be prepared to learn on your own and have to rely on curves for your grade. Good luck!", "rating": 3, "expected_grade": "", "created": "2022-05-17T00:35:19Z"}, {"professor": "Todd Rowland", "course": "MATH402", "review": "Probably the nicest proffessor I've met. Uploaded all his lecture notes. Held review sessions on zoom before every exam including the final. All his exams were fair; the questions were pretty easy as long as you were familiar with the material. There were 3 midterms, the lowest of which was weighted as half the points as the rest. Geniunly cares for his students and tries to learn everyone's names.\r\n\r\nAs for the negatives, there are two. The homeworks were kind of hard. It invloved reading from an online textbook and answering the texbook question. Personally I found the textbook confusing, but that seems to be more an issue with the material. Secondly, lectures felt unprepaired at times. He always had something planned for lecture and would try to go over the previous homework, but sometimes he would work an example until he realized he answer was wrong about 5 minutes in.\r\n\r\n Overall, I would really recommed this proffessor to anyone considering him. His classses are more than fair.", "rating": 4, "expected_grade": "B", "created": "2022-05-17T20:17:36Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "Todd Rowland is a nice guy and is accommodating and knows his math and stuff. Only problem is he is not really good at communicating his knowledge and actually teaching. Most of the time his lectures are all over the place, and it is really hard to understand what is going on most of the time. If you rely on a lecture teaching style, don’t take Rowland because you’ll end up needing to teach yourself the entire course. That being said, because he’s nice and accommodating it’s a little easier. Another thing, his tests are really hard at least as of spring 2022 I don’t know if it’s because the end of COVID or something but yea his tests were really really hard.", "rating": 3, "expected_grade": "C-", "created": "2022-05-19T00:30:42Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "Todd is a nice guy, and he is also pretty funny. However, the way he teaches did not help. It felt like he was reading off the slides. His lectures are confusing and boring. He teaches using Wolfram Alpha/Coding and doesn't really demonstrate the problems well. Overall, if you are good at teaching yourself the material, Todd is a must. (Also ESJ is a nice place to study)", "rating": 3, "expected_grade": "B", "created": "2022-05-19T22:10:29Z"}, {"professor": "Todd Rowland", "course": "MATH141", "review": "Like everyone else says, Dr. Rowland is very nice and cares a lot for his students. He held review sessions on zoom the night before every exam which were nice, but like his lectures, were sometimes a bit all over the place. It felt like the way he lectured just simply did not work for the majority, if not all, of the class. He goes far too quickly through new material and brushes over largely important topics that leave you scratching your head at the WebAssigns wondering how some of the most important stuff was never covered. If you end up with Todd you will be okay for sure if you put in enough work, but it probably does require more outside studying than other professors. Similar to another review below, it feels like teaching calc 2 might not be his strong suit.", "rating": 3, "expected_grade": "B", "created": "2022-05-21T18:52:27Z"}, {"professor": "Todd Rowland", "course": "MATH401", "review": "One of the best professors in UMD.", "rating": 5, "expected_grade": "A+", "created": "2022-06-18T02:56:14Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Do not take MATH 135 with Dr. Rowland. Like everyone else says, he's really nice, but not a good professor. His teaching is so scatterbrained and impossible to follow. The exam averages were in the 60s and 70s. This is a 100-level class.. how does that make sense?? People have said that his exams are close to the practice exams.. well, not anymore. We had 1 exam that was close to the practice exam, and that was it. He tests us like he is a good enough teacher to warrant tests that expand on what we learned in class. I don't think it is impossible to get an A, but we all have other classes and commitments, too. I, for one, had too demanding of a schedule to put hours of work into this class every week in order to just teach myself the material, let alone study it. Take this class with Zhao instead. Everyone in that class had much better things to say (and I would assume better grades too) than people with Rowland.", "rating": 2, "expected_grade": "B", "created": "2022-12-15T22:52:53.566834Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Very nice professor. You can tell he wants his students to do good and understand the material. He always has a review session before each exam and holds office hours where he helps you with things like homework and overall clarity on the material. As said by others, his lectures are indeed all over the place and sometimes it was hard to understand. He had \"surprise\" quizzes every Friday and would always help out on answering them and allowed us to work with others. He also never had slides, just a doc. I personally found it harder with the doc to follow through but you could still understand. The class, overall, is pretty easy so you won't have a hard time. He drops half of the lowest midterm and his practice exams were kinda similar to the real exams. Just don't use the practice exam as your only way of studying because I did that once and on the real exam there was a whole section I didn't know how to do. Know the material itself and you will do fine.", "rating": 4, "expected_grade": "A", "created": "2022-12-16T15:50:38.564462Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "First, the pros. Dr. Rowland is a nice man, will explain anything to you in office hours, responds to emails very fast, and tries to learn everyone’s name. The cons: he is an extremely bad lecturer and gets lost in the middle of his examples in class. His practice exams are meant to be what you should study from but he makes his exams much harder than the practices and includes problems you likely haven’t seen before. Avoid taking him if possible. I really liked him as a person but I wish I’d gone with the other professor.", "rating": 2, "expected_grade": "A", "created": "2022-12-18T22:21:28.753482Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Very nice and caring person, but not the best teacher (however, not the worst). His lessons can be a bit all over the place and the notes he posts are written notes, so they can be kind of hard to understand. As long as you pay attention in lecture, he usually goes over all of the equations you'll need to use (math TA will go over everything during discussion which is super helpful so good to go to discussion just for reinforcement). Weekly homeworks are on Canvas, so super easy to complete and he ended up doing a lot of them in class anyway. Gives practice midterms but really hit or miss about whether they are true to the actual exam. Going to office hours can help if you have specific questions. I personally have not touched the textbook this entire semester, but I've heard from some people that they teach themselves the material using that, so could be helpful for some people. Overall, biggest thing is just to create a connection with him and go to office hours if you need help with the homework or understanding something on a practice test. Also, I'm pretty sure he does not do + or - when it comes to grading, so 90-100 is an A, 80-89 a B and so on.", "rating": 4, "expected_grade": "A", "created": "2022-12-19T03:50:56.527739Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Not very flexible. Unfunny as well.", "rating": 1, "expected_grade": "B", "created": "2022-12-20T23:09:24.222958Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "This man is one of the best and funniest profs at UMD. His lectures are fairly disorganized, but he provides more than enough resources to earn a good grade in this class!", "rating": 5, "expected_grade": "A", "created": "2022-12-21T18:05:21.196866Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "As other people have said, he is a nice guy but his teaching style is not beneficial. To do well in this class, you had to do a lot of self-teaching outside of the class. On top of keeping up with other courses, it definitely becomes a lot. The TAs were somewhat helpful, but sometimes the topics also got confusing when they tried to explain them. The first practice exam was very similar to the actual exam, so it was helpful. The last few though have been fairly different, so studying off of the practice exams became less helpful. If you have a packed schedule, I would suggest avoiding taking him because you will spend a lot of time reviewing material outside of the class in order to do well.", "rating": 2, "expected_grade": "B", "created": "2022-12-22T17:41:27.908583Z"}, {"professor": "Todd Rowland", "course": "MATH136", "review": "Dr. Rowland is a very kind man who is always willing to help his students. Utilize your resources—go to office hours and if you can't do that, discussion and ask the TA. Ask a neighbor if you're confused, or go up to him and ask a question. In all honesty I think he's the best professor at UMD because he cares about each student. He has improved so much from when I had him last year and I know so long as you try you'll be able to do so well in this course.", "rating": 5, "expected_grade": "A+", "created": "2023-02-28T01:28:00.866604Z"}, {"professor": "Todd Rowland", "course": "MATH401", "review": "Professor Rowland truly cares about his students. Even if you are completely lost, if you go to office hours you will be able to get through the homework, projects, etc and you will leave with a better understanding of the material. I took MATH401 and 406 with him and I still use what I learned from those classes to this day. His lectures are sometimes unorganized but the assignments he gives you are always fair. Top, top professor", "rating": 5, "expected_grade": "A", "created": "2023-04-13T02:05:47.735008Z"}, {"professor": "Todd Rowland", "course": "MATH136", "review": "He is a very nice person and the only professor that I've had that tries to learn every student's name. However, he is a little all over the place during lecture so there was a lot of wasted time. He does happily answer everyone's questions, but sometimes gets a little sidetracked. The material isn't that difficult but sometimes there would be random problems from the textbook that we didn't use on the exams. He does give out study guides for every exam, but the first one was almost exactly like the exam, the second one was NOTHING like the exam to purposely bring the class average down, and the third was kinda like the exam. There's also weekly online homeworks, worksheets due during discussion, and classworks. He's definitely not the worst professor, but definitely not the best.", "rating": 3, "expected_grade": "A", "created": "2023-04-30T02:06:49.085082Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "I came into this class with general mathematics knowledge with iffy knowledge from AP Calc because it was COVID year, and I'd say everything was very manageable. \r\nPeople hating on this guy for no reason. Chillest professor, super nice and understanding, as well as accommodating for student's real-life circumstances. \r\n\r\nHe is a bit over the place for the lectures but he gives good practice for exams, office hours are very helpful, and his class structure points wise is very student friendly (Drops 3 lowest HWs, 2 lowest classworks, half of your worst exam (example: 70/100 becomes 35/50)). \r\n\r\nDo beware of the second exam, this is designed to bring down the class average. First and third exams should be a breeze, as well as the final. His practice final was very similar to the actual final!! \r\n\r\nNote that all of this applies to MATH136 as well. Great human, could be a bit better as a lecturer, but I believe the guy is probably too experienced to be teaching an entry-level calculus class anyways.", "rating": 5, "expected_grade": "A", "created": "2023-05-15T09:53:52.019810Z"}, {"professor": "Todd Rowland", "course": "MATH136", "review": "He's a kind person but can be a little clueless as a professor. Often gets distracted during lecture and explains things in a really confusing manner. He's clearly very smart, but explains topics in a way that only people who are already good at math will understand. Regardless, if you actually try you'll probably get a decent grade because homework, in class assignments, and worksheets are easy enough.", "rating": 4, "expected_grade": "A", "created": "2023-05-18T21:55:53.913296Z"}, {"professor": "Todd Rowland", "course": "MATH464", "review": "Super nice professor.", "rating": 5, "expected_grade": "", "created": "2023-05-20T08:08:46.860225Z"}, {"professor": "Todd Rowland", "course": "AMSC460", "review": "Grading is 90-100 is an A. Not the freest A, homework are long and challenging. Exams are fair, averages were 82 and he offers extra credit for points back. However, you will have to work work for the A", "rating": 5, "expected_grade": "A", "created": "2023-08-19T05:02:06.975115Z"}, {"professor": "Todd Rowland", "course": "AMSC460", "review": "The homeworks are pretty hard and unclear. The exams aren't too hard though. Lectures are boring but he's pretty nice and responds to emails. I would recommend taking this professor if you work for it, but it's not exactly easy. Lect", "rating": 3, "expected_grade": "B", "created": "2023-08-22T14:23:06.201551Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "He's a super nice and funny professor, but I feel like his teaching style does not help me learn at all.  I do not often attend lectures because I feel like I struggle to learn anything from it.  The textbook also doesn't really help because the course material is usually a bit more difficult or slightly different from the textbook.  However, the exams are definitely fair and the discussions are helpful.", "rating": 3, "expected_grade": "A-", "created": "2023-11-14T15:53:36.801085Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "He is a nice guy just not the best lecturer. He does not teach well during the lectures and will often go on tangents for a singular problem/question during the whole class. Sometimes I question whether I should go to lecture or not because it's repetitive and counter-productive. I will say though, he is one of the most accommodating and caring professors. He really makes an effort to get to know everyone in his lecture (even though they are SO big). I would recommend not to take him if you have the option not to. Good luck everyone!", "rating": 2, "expected_grade": "A", "created": "2023-11-17T18:36:39.970723Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "I'm going to start this review by saying he is a very nice professor. He makes a substantial effort in getting to know his students that attend lecture and is overall one of the nicest faculty members on campus. However, when it comes to his ACTUAL teaching, he is subpar. He rants about the most little things, often gets distracted while teaching a concept, and does not thoroughly explain important things for his course. The notes he posts on ELMS are VERY confusing, and the class averages on exams are always in the 60s-70s despite the course being less difficult than MATH140 or MATH141. He does not curve his exams; however, he will drop half of the lowest exam grade. I'd say invest time into the textbook and/or a tutor if you want to be successful in this course. However, you can still get low B's/high C's on the exam and manage to hold an A in the course (like me!). I feel alright going into the final but I would suggest that anyone taking to not expect him to make the course a breeze. Attending discussion sessions is mandatory if you want to be somewhat prepared for his exams. His class is manageable but good luck if you do not like teaching yourself concepts.", "rating": 2, "expected_grade": "A", "created": "2023-11-21T05:15:11.973689Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Dr. Rowland is a character. He definitely cares about the students and he tries to answer everyone’s questions. He’s not the best lecturer…he gets a bit off topic sometimes and that makes it hard to understand some of the material. He doesn’t record his lectures but he writes clearly on the chalkboard. He uploaded a lot of resources for practice and there’s plenty of HW/ in class assignments that help boost your grade. Overall nice guy and I’d rather take his class again than do Math140 lol.", "rating": 3, "expected_grade": "C", "created": "2023-12-06T20:23:40.414502Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Professor Rowland as a person is quite endearing. He takes the time to get to know his students, initiates conversations with you, and cracks sardonic jokes. He's very encouraging and accommodating toward his students. Take note, however: once he knows your name and becomes comfortable with you, he will call you out and ask you to answer questions in front of the class. This sometimes involves solving a problem on the front chalkboard. Of course, if you decline, he won't force you, but this is just something he does that might concern some. It's usually the people in front he targets but once in a while he will make his way to the back. The questions are usually easy to answer, though, so don't stress about this. \r\n\r\nProfessor Rowland as a teacher, however, can be challenging, but the content itself isn't. Lectures are usually composed of content material, practice problems, and questions. When covering content, he tends to go off-topic, but when he's taking questions, he often goes through homework and in-class quizzes and gives the answer to you (worth attending for this reason). He provides notes for each topic, and while they can be helpful, they can be equally confusing. If you want organization, it's better to go by the textbook for definitions, relationships, examples, etc. If you ask him a question, his explanations are a hit-or-miss. For explanations, it's better to show up to the discussions and have the TAs explain it to you; I definitely do not recommend skipping the discussions for this class. To get ready for each exam, he provides 2 old exams + answer keys, an online practice exam, and also holds a Zoom review session the night before. The exams are fair and not too hard; grading for partial credit is generous. There is quite a bit of teaching yourself in this class but as long as you put in a decent amount of effort, you should be able to keep an A. Good luck!", "rating": 3, "expected_grade": "A", "created": "2023-12-14T02:13:55.551434Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "DO NOT TAKE THIS CLASS!! He's probably the sweetest professor I've ever had and is a great guy, but his teaching style is not it. I've never been in a more disorganized class. The lectures aren't really \"learning,\" it's more like someone asks questions and he goes over them for the entire class period. Also, the practice midterms are not like the real exams so be prepared to have a random question thrown your way. I had to do a lot of self-studying for this class and it takes up a lot of work.  Btw, don't depend on the half-dropped midterm, it almost does nothing for your grade", "rating": 1, "expected_grade": "A", "created": "2023-12-14T05:28:35.566533Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Dr. Rowland is a nice, caring person. He attempts to learn everybody's name and he tries hard to explain the content. He is also very open to questions and walking the class through challenging problems. However, his lectures are somewhat unorganized and honestly a little useless. I went to every lecture, but I hardly paid attention to them because of this. The good news is that this course is super easy, so Dr. Rowland doesn't really need to be that good of a teacher. I mainly used the textbook to write my notes as his notes were kind of all over the place and not very helpful. On the other hand, the discussions were beneficial and were much better at explaining the content than the lectures were, so I would recommend going to discussions over lectures. To prepare for exams, I just completed the practice exams on ELMS and read over my notes. The coursework is hardly time-consuming and I only spent about 2 hours studying per midterm (and 3 hours for the final), with most of that time dedicated to going over the practice exams. Dr. Rowland also usually hosts an online exam review session the night before exams, which I didn't really use, but he basically just answers people's questions and goes over any problems from the practice exams that people wanted help with. The exams themselves are not hard and are pretty similar to the practice exams. As for grading, it's fair, he drops half of your lowest midterm, doesn't use +/-, and is not heavily weighted toward exams. All in all, this is a fairly easy course with plenty of resources and a mediocre, but kind, professor.", "rating": 4, "expected_grade": "A", "created": "2023-12-16T00:07:54.081766Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Dr. Rowland is very kind and can be funny sometimes. He’s a great person but not the best professor. He goes on long tangents that barely make sense and takes too long to answer simple questions. But he is a really easy grader and makes the midterms and final quite easy. Also, most quizzes and homework have 2 attempts.", "rating": 3, "expected_grade": "A", "created": "2024-01-04T02:00:02.155863Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Let me start this review by saying that this is probably one of the nicest professors I've ever had. Super considerate, funny, and overall just a nice guy. He is just not a very good teacher. He can be very confusing and tends to spend his lectures answering questions about the homework instead of teaching the subject. The quizzes and homework are very easy: he usually goes over those in class, but the exams can be very difficult and hard to study for. Be warned: the practice midterms seldom match the real one.", "rating": 2, "expected_grade": "A", "created": "2024-01-12T13:40:57.113737Z"}, {"professor": "Todd Rowland", "course": "MATH136", "review": "To keep it simple, don't take it. He does not teach, takes away notes before you can get them down. Nice man and tries to learn names but, he lacks greatly in the teaching department. You have to put extra work in teaching yourself which would be unnecessary if you had a professor who actually taught you during the lecture time. Practice exams are similar to the exam but, there is usually a question or more that you have maybe seen once or not at all (weighing 8-12 points). Save yourself the stress and don't take him.", "rating": 1, "expected_grade": "B+", "created": "2024-03-15T22:55:05.303917Z"}, {"professor": "Todd Rowland", "course": "MATH136", "review": "While it's true that he's very nice, Dr. Rowland is not good at teaching. Lecture is unhelpful as he does practice problems the whole time without explaining what he's doing and rarely looks up for questions. His rants can be entertaining, but I would strongly not recommend taking this class with him if you have little calc experience like me. If you have a good amount of calc experience you should be fine. (PS go to GSS!!!!) hw and classwork is easy, but his exams suck. Take the class with someone else if you can!!!!!!!", "rating": 1, "expected_grade": "", "created": "2024-03-16T00:00:19.598632Z"}], "name": "Todd Rowland", "slug": "rowland_todd"}