{"courses": ["LING200", "LING311", "LING240", "LING499C", "LING689T", "LING888", "LING311", "LING499C", "LING240", "LING311", "LING499C", "LING888", "LING200", "LING311", "LING499C", "LING689T", "LING240", "LING311", "LING499C", "LING888", "LING240", "LING311", "LING499C", "LING689T", "LING200", "LING240", "LING311", "LING499C", "LING888"], "average_rating": 4.6364, "type": "professor", "reviews": [{"professor": "Tonia Bleam", "course": "LING200", "review": "Professor Bleam is awesome asf! Her teaching methods were so fun and helpful! She gave us alot of practice homework BUT it helped us review for the exams and such. We also had alot of quizzes, but don't freak out because it was pretty easy IF you studied. And PLEASE study for her class. Honestly, her exams and quizzes are set up just like the study guides and practice homeworks etc. ALSO if you are confused just go to her office hours! She is so easy to approach and not scary at all! Also the TA's are great. Anton (and Bleam) helped me out with alot of questions I had about the homework and helped me understand better alot of concepts I did not fully understand. Overall, Bleam is a fun, energetic,and well prepared Professor. She is the best professor I've had so far in my career as university student!  :) I highly recommend her!", "rating": 5, "expected_grade": "", "created": "2015-07-21T22:25:00Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "LOVED this class! so interesting, fun and easy. def take this class if you can!", "rating": 5, "expected_grade": "A", "created": "2014-01-07T14:39:00Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "I like her. She is very nice as a professor. The only downfall I see to this course is that even though you may understand something fully, you can still fail a quiz if you don't understand her format. The test are well put together, just watch out for the multiple choice. I also think there are too many exercises, there were times when I felt like I needed a break. It's like you relive the high school experience of homework, but they do help you learn. Other than those few things, you will learn a lot from this course. If you're not a linguistics major, you will come in thinking the subject is pointless and another version of hooked on phonics, but she does give you an insight to how it fits into our real world.", "rating": 4, "expected_grade": "C", "created": "2011-10-23T18:39:00Z"}, {"professor": "Tonia Bleam", "course": "LING200", "review": "Awesome class! Dr. Bleam is a great lecturer-to the point, simple, easy to understand, and very aware of student concerns. If you go to the lectures, at least skim the readings, you should not need to spend much time studying. I got A's on both midterms. Didn't do 1/5 homeworks, which lost me my A. The material is so interesting, nothing I have paid attention to before. Overall, a good CORE.", "rating": 5, "expected_grade": "B+", "created": "2011-05-30T20:03:00Z"}, {"professor": "Tonia Bleam", "course": "LING200", "review": "Dr. Bleam is such a sweet professor! She's really funny and down to earth, I go to class just to listen to her talk.\n\r\nThe class is really quite easy; Dr. Bleam makes all the notes available on ELMS, the homework and \"prep exercises\" keep you thinking about the material, and the required reading is minimal. Midterms don't really require studying as long as you can compartmentalize information well.\n\r\nBesides that, the material is genuinely interesting and opens up topics most people never give a thought to. If you're looking for a class to fill up your schedule without eating your time, consider this one.", "rating": 5, "expected_grade": "A", "created": "2011-04-28T22:35:00Z"}, {"professor": "Tonia Bleam", "course": "LING200", "review": "Dr. Bleam is a great professor who tries to engage her students and is a very nice person. The textbook is actually good and reading it is required for the routine homework (5 this semester). Exams are not tricky at all and very doable if studied well. This is a great core class because it actually teaches something new, interesting, and applicable to everyone. Great class!!   ", "rating": 5, "expected_grade": "A", "created": "2010-05-22T23:01:00Z"}, {"professor": "Tonia Bleam", "course": "LING200", "review": "I really liked the professor, she did a great job of explaining things thoroughly and not rushing through things. Very approachable, engaging. The tests aren't too hard as long as you know the concepts, but you do need to at least study. ", "rating": 5, "expected_grade": "A", "created": "2010-04-27T00:13:00Z"}, {"professor": "Tonia Bleam", "course": "LING200", "review": "She is what inspired me to become a linguistics major! The class is simple: if you go to class, do the assignments and attend discussion, and A is nearly guaranteed. She is always willing to help, she will accommodate your schedule if you cannot make it to office hours, and she is really enthusiastic about what she teaches.", "rating": 4, "expected_grade": "A", "created": "2010-04-26T00:52:00Z"}, {"professor": "Tonia Bleam", "course": "LING200", "review": "I took this class as a personal interest and as a CORE.\n\r\nThis class is pretty well organized. There are a multitude of TAs available to help with the class and clarify material. The lectures are available in full to download from ELMS (if I remember correctly) and are very helpful to study from.\n\r\nThere are several exams, quizzes, and some regular homework, but this isn't a hard class to study for. As long as you pay attention to the info and logically understand the concepts, then you will have no issue getting an A.\n\r\nThe material is interesting and pretty logical if you take the time to apply it to the real-world. Makes doing all the work kind of fun.\n\r\nOverall, this is a great CORE to take. No steep learning curve and decently useful info to know (IMHO).", "rating": 4, "expected_grade": "A", "created": "2009-08-19T14:39:00Z"}, {"professor": "Tonia Bleam", "course": "LING311", "review": "I like her but she makes things sound harder than they actually are.", "rating": 3, "expected_grade": "", "created": "2009-05-13T03:14:00Z"}, {"professor": "Tonia Bleam", "course": "LING200", "review": "Amazing professor. Take good notes and that's pretty much all you'll need to study for the tests. She explains everything really well. Can't wait to have her again!!", "rating": 5, "expected_grade": "", "created": "2008-05-11T21:41:00Z"}, {"professor": "Tonia Bleam", "course": "LING311", "review": "Dr. Bleam is terrific. I have *no* criticisms (incredibly rare for me, even for professors I really like). She’s extremely friendly, she’s very good at explaining things, she’s helpful in office hours, her tests are very fair, and she’s incredibly organized. Easily the best professor I’ve had at UMD.", "rating": 5, "expected_grade": "A", "created": "2017-11-19T22:21:34Z"}, {"professor": "Tonia Bleam", "course": "LING311", "review": "I love this course and love this professor. Her teaching style is incredibly helpful and interesting and the assignments she gives really supplement my learning instead of making me feel like I'm wasting my time.", "rating": 5, "expected_grade": "A-", "created": "2017-11-19T22:30:58Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "Tonia is an amazing professor, and LING240 is an awesome class. She's super nice, always willing to help, and definitely let me off more than enough times for not coming to lecture because I had other CS classes :/\r\n\r\nNot the easiest elective because of all the exercises/homeworks, but super fascinating subject material. Midterm was actually kinda tough for me, but I'd say medium difficulty overall (you have to memorize linguistics concepts and phonology as well as do syntactical analyses of fake languages).\r\n\r\nPretty good choice for an elective! DEFINITELY take the class with Tonia, and you've a good chance of getting an A/B.", "rating": 5, "expected_grade": "B", "created": "2017-12-14T19:06:37Z"}, {"professor": "Tonia Bleam", "course": "LING311", "review": "Dr. Bleam is an amazing and very down-to-earth person. She keeps class interesting and is accepting to a lot of different ways of doing things.", "rating": 5, "expected_grade": "A", "created": "2020-03-07T20:13:47Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "(I took this class completely online.) Dr. Bleam is an amazing professor and LING240 is such an interesting class! She's an excellent teacher and her lectures are engaging and helpful. You will need to read articles/studies/experiments for this class but they are always interesting and understandable. The exams match material discussed in lectures and on exercises and homeworks, both in content and difficulty. They definitely supplemented my learning and did not feel like busywork or a waste of time. \r\nI honestly found the class to be easy and scored very well on the assignments and exams with minimal effort. HOWEVER, my classmates said they found the exams to be somewhat difficult and that the TAs were picky graders, so maybe it depends on whether or not you have a knack for this kind of thing. Either way, getting an A or B is totally doable if you are willing to put in at least a moderate amount of effort. My best piece of advice is to take notes during class AND on the readings. Nothing exhaustive but make sure you have all the key points and some examples. \r\nI highly recommend this class, especially if you're genuinely interested in linguistics. ", "rating": 5, "expected_grade": "A", "created": "2020-12-22T02:31:02Z"}, {"professor": "Tonia Bleam", "course": "LING200", "review": "I took LING200 online with Dr. Bleam - she's a very good professor! This class was not hard (imo) and the workload was relatively low if you paid attention in lecture well. Very interesting course as well, in my opinion. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-18T19:22:28Z"}, {"professor": "Tonia Bleam", "course": "LING200", "review": "TL;DR Don't take this class if you want an easy A. Some of the content is interesting and enjoyable, other parts of it are tedious and annoying to solve without the IPA. Overall it isn't the worst if you put in a good amount of effort. \r\n\r\nProfessor Bleam is a good professor, it's the course content which i have a problem with. I expected the content to be solely focused on the theoretical and philosophical side of linguistics. It turns out this class was largely dominated by the International Phonetic alphabet and the scientific and technical side of linguistics. This was annoying because it takes a good amount of extra time to try to understand these concepts in addition to memorizing the IPA, which is something they required us to do. The memorization aspect really was just extra work as we could have grasped the concepts without struggling through the memorization. I went to almost every discussion section and lecture and i still found it so tedious to have to learn how to do the exercises. The topic isn't hard and I basically got the hang of it by the final, but the content/exercises were made unnecessarily hard by the memorization. Doing the out of class readings doesn't explain a whole lot either. You need to go to office hours and do some practice to understand. With this i will say that the homework assignments did help. My discussion section on the other hand was largely a waste of time. If they had provided us with a sheet detailing the IPA on tests, then the class average would have been much higher and in my personal experience I would have understood how to do the practice exercises better and much earlier on in the course. ", "rating": 2, "expected_grade": "B-", "created": "2022-05-22T16:04:52Z"}, {"professor": "Tonia Bleam", "course": "LING311", "review": "Definitely one of the best professors I've had at UMD. She teaches the material in a very engaging manner, and she is very responsive to students' concerns. She makes sure you get the foundations of syntax down before building on them. She also seems to genuinely care about her students. One thing to keep in mind though is that there is a lot of homework for this class, but doing it does help you internalize the material.", "rating": 5, "expected_grade": "A", "created": "2022-12-21T22:28:46.643276Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "Extremely kind and understanding and passionate about what she is teaching. The class is engaging both because of its interesting material and Prof. Bleam's enthusiasm for teaching it.", "rating": 5, "expected_grade": "A+", "created": "2023-11-06T20:52:19.956247Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "Kind and engaging professor. Lectures and class content are very interesting.", "rating": 5, "expected_grade": "A", "created": "2024-01-02T17:47:14.983992Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "Dr. Bleam is a super super nice professor, super understanding and willing to help and accommodate students, and also very passionate about linguistics! I would consider LING240 itself to be an easy A, and it was never boring, so it was a nice break from my harder STEM classes. You learn about lots of cool stuff in a chill welcoming environment. Definitely recommend you take Dr. Bleam because she is so lovely and also LING240 was a fun and interesting class with an easy workload.", "rating": 5, "expected_grade": "A+", "created": "2024-01-24T22:12:01.278507Z"}], "name": "Tonia Bleam", "slug": "bleam"}