{"courses": ["GEOL100", "GEOL120", "GEOL322", "EXST030", "GEOL110", "GEOL444", "GEOL100", "GEOL110", "GEOL100", "GEOL110", "GEOL120", "GEOL444", "AOSC123", "GEOL100", "GEOL123", "GEOL100", "GEOL110", "GEOL110", "GEOL100", "GEOL110", "GEOL100", "GEOL120", "GEOL444", "GEOL110", "GEOL100", "GEOL110", "GEOL100", "GEOL120"], "average_rating": 2.9592, "type": "professor", "reviews": [{"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Centorbi is one of the most incompetent professors I've had at Maryland. She told multiple students when asked if grades on ELMS were correct and weighted when it said that it was unweighted online. Even after she said all of this, now at the end of the semester she has changed everyone's grades to weighted and grades have dropped from 5-10%. I went from an A to a B. The only thing saving my A right now is the 5% extra credit field trip. \n\r\nThe class isn't too hard (she drops the lowest test, in-class activity, and homework/hw quiz grades), and she's changed her tests so they are all concept sketches with no multiple choice. However, she is a boring lecturer with a snarky attitude. I'm only taking this class for my science lab requirement but I have no idea how she has taught this class for so many years and can still be so uninformed and wrong when it comes to ELMS. \n\r\nSeriously disappointed in her lack of professionalism.", "rating": 1, "expected_grade": "A-", "created": "2016-12-08T20:31:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I really like her she teaches straight out of the textbook. You have your online homework and online quiz due each week for the chapter and then at the end of the section there is an in class exercise. SHE HAS RECENTLY CHANGE THE WAY TEST ARE GIVEN, for GEOL 100 they use to be online test and the other teachers still give the online tests but in her class each test is 4 chapters long and she gives you about 2 questions per chapter that relate to a visual that has been reviewed in the class. So for the tests on the day of the exam 2 of the total 8 sketches will be chosen at random and then you must draw the sketches from your memory. But they are all given ahead so you just have to prepare a lot and you will be fine because it's all memorization. Overall I enjoy her as and GEOL 100 and would recommend it    ", "rating": 5, "expected_grade": "", "created": "2016-11-16T13:30:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "The reviews saying she is an awful teacher have to be coming from people who skip class or don't study for the exams. Centorbi is a great teacher; she thoroughly reviews everything in the book to the point where I stopped reading the chapters and still felt very informed. It's easy to do well on the test if you take notes in class and review them beforehand, but she makes it even easier since the tests are open notes/textbook/internet. She's a very nice person and I recommend sitting in the first few rows as she often interacts with people and may give you hints on the clicker questions. The only complaints I would have is that discussions are work-heavy and the TA is kind of an asshole, but even he grades super loosely. It's easy to get an A in this class if you attend regularly and do the in-class activities assigned. You're also permitted to miss four days before she starts docking off participation points since the lowest four clicker grades are dropped.\n\r\nBottom line: Not a hard class if you pay attention, teacher is great, interesting content aside from rocks.", "rating": 5, "expected_grade": "A", "created": "2015-11-12T18:37:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I had the pleasure of Tracey as a professor for GEOL100 and it was easily the best class I had taken.  Tracey's super nice, cheerful, and breaks all concepts down really well.  Students from all majors should be able to understand the topics, regardless of your background.  The topics were actually really cool and interesting as well.  The lab had a great TA and went pretty hand-in-hand with the chapters to give you that \"next-level\" feel for what you're discussing.  The extra credit field trip was a lot of fun too.  I've kept in contact with Tracey and keep her updated on how my semesters are going.\n\r\nAnd truthfully, I'm fairly shocked regarding some of the reviews on here.  But after reading through some, a lot sound like students who didn't read, didn't study, and wanted an easy A because they thought Geology would be the \"easiest science class.\"  If you keep up with the material, do light studying/reviewing regularly, use her lecture notes as guides along with your own, and actually try to care, you shouldn't have problems.", "rating": 5, "expected_grade": "A", "created": "2015-05-07T21:35:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Listen to the other reviews advising you to take another teacher! Seriously this teacher is the motherfucking devil. I took a 100 level class in rocks and it ended up being the class witht he most exhausting workload. \n\r\nThere are three online tests and one in class cumulative test. Her online tests she gets most of them from previous homework/quizes.and google. \n\r\nHer cumulative final though is ridiculous! She says it's easier because it's in person but it's not. This is not a 100 level class. \n\r\nI feel like I'm leaving this class with a PHD in rocks. ", "rating": 1, "expected_grade": "B", "created": "2014-12-09T23:29:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "So, I have never written one of these reviews but this was probably my worst class in my 4 years at the school so instead of studying for the final, I am writing this. I am taking geol120 as my core requirement and not only is Centorbi HORRIBLE, but this class is more demanding than any of my other upper level classes. The only way to do somewhat ok in this class is to go to every lecture and record every single thing she says. Even then- you probably won't do well on her tests. Her tests are online, but even so I got 60's on the tests. Her power points are useless, as is the book. You haven't seen half the stuff on the tests before. She is rude, condescending, and takes her 100 level class WAY to seriously. Without the extra credit field trip and discussion board to replace your lowest test grade, the class is almost impossible. The discussions also have quizzes so you cannot miss any of them, and the TA's are just as unhelpful as her. The final is also (in-person) 100 questions cumulative on the entire class- and you are allowed 1 notecard. This cheat sheet would make sense for a math class, not for a class testing you on the entire text book. This is by far the worst class I have taken at this university and I wish someone would have warned me when I signed up. ", "rating": 1, "expected_grade": "B", "created": "2013-12-19T23:03:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "The class isn't hard but graded harshly and there's a lot of work involved. She's a cool person, but takes the work and class way too seriously. The TAs made up for it (they were really cool, laid back, an funny).\r\nThe information is straight-forward and she does a good job explaining concepts, but the work load is ridiculous and discussions are pointless.\r\nThe textbook is cheap (ten dollars) because she uses not the latest edition.\r\nThe tests are made with trick questions rather than comprehensive or factual questions. If you try to tell her your answer was directly written from the textbook used for the class, she'll discredit it.\r\nThe clickers are good idea but poorly executed. She grades them and half of the time they are questions out of no where. \r\nThe extra credit was an interesting trip and worth it to go(5% extra) but there's a worksheet to fill out which takes up the entire trip so you can't enjoy actually being there.\r\nDiscussion involves reading news semi-relevant articles and memorizing random facts for a 3 point quiz. Then we do worksheets that are relevant. \r\nOverall, the class was not worth taking. ", "rating": 2, "expected_grade": "A", "created": "2013-11-09T21:26:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "This teacher is the worst, the class is the worst, but it's an easy A. \r\nIf you want to actually learn things about geology, look elsewhere. If you want an easy CORE class with a self-important ***** for a teacher, look no further. \r\nTeacher is the typical example of a person who takes herself too seriously, she is the worst. She's an unhappy person and, naturally, she enjoys the \"power\" of being a professor. \r\nIn conclusion, she is the devil.  ", "rating": 1, "expected_grade": "A", "created": "2012-10-21T17:59:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Centorbi is a wonderful person but an incredibly hard teacher.  I got an A in the class by recording her lectures and then typing down what she said verbatim and using that for the exams.  That is a LOT of work and I still only got by with an A (including the 5% extra credit trip).  A lot of people underestimate this class cuz its supposed to be the easiest lab - which it IS, but that doesn't mean it's easy.  must go to every class for clicker scores, do the geotours to cancel out a bad exam, and take awesome notes or be prepared to fail.  DO THE EXTRA CREDIT TRIP --- not only was it really fun but it seriously helps your grade!  ", "rating": 4, "expected_grade": "B+", "created": "2012-05-15T18:15:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I chose this course (along with GEOL110) to fulfill my lab credit core. Yes, it is not the easiest class, but for a science class, I don't think it could get much easier. The tests are tricky but really not as difficult as people say. Go to her lectures, write down everything she says and you will be fine. She is not some evil teacher, she is very fair. Her tests are online, you have to expect them to be kind of challenging or else this class would be too easy. There is an hour and 15 minutes to do 60 questions on each test, so there is plenty of time to look stuff up as long as you are organized. ", "rating": 4, "expected_grade": "A", "created": "2012-05-13T21:47:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Do not take this class. Seriously, I don't care what anyone tells you. It is not easy. My friends told me it was easy, but its not. Even if you think you can cheat and do the online tests with people, the tests are so convoluted with tricky questions and ridiculous diagrams that you can't possibly do well on them. You have to go to every class for clicker exams which you always fail b/c she expects you to pay attention the entire time and then understand exactly what she just taught you. Its a complete waste of time and brings down your GPA for no reason. She loves to trick you, she's fat, and she's a horrible teacher.  ", "rating": 2, "expected_grade": "B", "created": "2012-05-09T13:29:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "NOT AN EASY CORE CLASS AT ALL. Her tests are online, but impossible to take. You'll have to read between the lines to understand the stuff she talks about, very vague. You also have to go to every lecture because she uses stupid 'clickers' to give participation grades and if you get a question wrong in the participation you get 50% for that question. Also she has a \"no excuses\" policy so if you're sick or dying and do an assignment you get a zero. Which is complete BULLSH@T. If I'm sick in the hospital hooked up to IVs and feel like shit, you're telling me I can't have an extension on the assignment?? BULLSH!T", "rating": 3, "expected_grade": "B+", "created": "2011-12-11T12:33:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I don't know why everyone is saying this class is hard, it's not. The class is clicker points, online homework, and online tests, and a huge extra credit assignment. Put in a little effort, and you'll get an A easily", "rating": 5, "expected_grade": "A", "created": "2011-12-02T18:48:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "This class is pretty difficult, but you'll learn a lot in a really short amount of time. Do the extra credit she gives you. You'll need it.", "rating": 3, "expected_grade": "A", "created": "2011-07-17T16:17:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "This class is so hard. I always went to lecture, wrote down what she said, and took notes on the book chapters. The tests are online, which sounds great, but they're ridiculously hard. She only gives you an hour and fifteen minutes to complete them but it could easily take me 2 hours to find all the answers. DON'T TAKE THIS CLASS. I'd much rather take an in class test that is easier than taking this course online.", "rating": 1, "expected_grade": "B", "created": "2011-04-29T18:26:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "This was a really tough class.  Although I got an A, it was with a lot of difficulty and hard work.  You will have to go above and beyond for this class, but its relatively little assignments that you just have to keep up with, not really huge papers or assignments besides the three exams, which are online.  Do the discussion board, do the extra credit.  Also, i suggest taking notes on your laptop or else you will miss typing down half of the information she puts on the test.  \r\nBasically, type down everything she says, and everything that is on the powerpoints and videos.  It will come back on the exams", "rating": 3, "expected_grade": "A", "created": "2011-01-13T19:04:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "I don't know half the people who wrote the reviews below, but they must be geology majors. This class was awful, easily the worst class ever. When you first get to the class and she tells you the tests are online, you get excited, but they are not based off the textbook at all. My first test I got a 75 with just studying off the book. The next 2 I just studied off of what she said in lecture and the slides and did better. I would recommend doing the discussion board because it is easy and to do the extra credit which is now only worth 5%. Also she is just a miserable *****. I have had teachers get mad at students for leaving class early, and even calling them out, but she would go on for a few minutes about why you shouldn't leave early. ", "rating": 2, "expected_grade": "A", "created": "2010-12-13T23:08:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "She is really not a good teacher at all. She is really mean and just really annoying. The class overall is easy. All the tests are online, including the final. You have to go to class though because she randomly gives in class exercises that are worth 10% of your grade. If you go on a field trip with her you get 5% added to your grade which is huge. Also, if 90% of people do course evaluations you get another 2% extra credit making an 83% an A. Take it, but don't expect to learn anything. ", "rating": 2, "expected_grade": "A", "created": "2010-12-13T02:45:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "This class was a waste of time. I wouldn't have taken it had I not needed a CORE lab science credit. Centorbi can be downright rude and has a bad attitude 75% of the time. Also, she moves way too fast during lecture. Printing lecture slides is a must because she does not give anyone time to write down information off of powerpoints during class. However, I refuse to waste all that paper and ink and therefore struggled with keeping up with her lectures.\n\r\nHer knowledge of geology is greatly apparent and she really does know what she is talking about. All exams are online which sounds awesome but in reality they are tough. I never scored above a C on one even though I did the 13 page review guide for every one. Attending lectures is a must because she randomly gives out in class assignments that are graded. Overall I really did not enjoy this class at all.\n\n", "rating": 1, "expected_grade": "", "created": "2010-12-12T17:39:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "Class isn't hard if you do the work (not much), online exams mean you can use your notes and textbook, lecture is boring and but informative. She takes lectures straight out of the textbook and adds her own stuff. Many test questions come word-for-word from sentences in the book. You HAVE to go to discussion if you want to pass because almost half your grades come from there, but it is super easy if you do the (one-page) readings for the quizzes and if you work fast you can get out half an hour early most days. Also you get a day off from lecture whenever there is an online test, which is pretty nice.\n\r\nProf. Centorbi does a pretty good job. She seems nice enough in person, but she randomly becomes rather bitter and pessimistic in her lectures. She has a \"NO EXCEPTIONS FOR ANYTHING EVER\" policy which gets pretty ridiculous. She's also one of those profs who calls out students for texting and talking in class. But the class is easy so it's hard to fault her too much.\n\r\nBoring class, kooky prof, pretty standard for UMD.", "rating": 3, "expected_grade": "A", "created": "2010-12-10T15:24:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "This class was honestly annoying and I did not benefit from taking it. Even though the exams are posted online, they are hard and the questions she asks are sometimes not even in the notes or lecture. What was even more ridiculous was that there were no exceptions on making up an exam and she even posted on our syllabus…\r\n\"There are NO makeup exams for any reason!! Not if you are sick, not if there's a death in the family, not if your boyfriend/girlfriend ends up in the hospital, not if you have a car accident, not if you forget because you fell asleep after turning in your paper for another class. Complete it by midnight on Friday or take the zero.\"\n\r\nhonestly… thats just downright mean. Also if you miss discussion you get an automatic zero on an activity which is worth 35-45 points and you get a 0 on a 3-5 point quiz. \n\r\nI was bored to death in her lectures and had to struggle to keep myself awake most of the time. If you want to take GEOL120 i would suggest taking it with another professor. ", "rating": 2, "expected_grade": "B", "created": "2010-12-10T02:32:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "GEOL120 Powerpoint style with all the slides online. The tests are online but you can't do well on them on just the slides alone, you have to attend lecture. In lecture there are in class activities that count towards your grade. You have reading due for every discussion and a short 3 question quiz about the reading. Then there are activities in discussion. Some of the activities are very time consuming and sometimes aren't really related to class. There are 2 opportunities for extra credit: one field trip, and participation on the discussion board which will replace your lowest test grade. If you attend lecture and take good notes and do the extra credit you should get an A, I didn't do these things.  As a teacher though she is nice but the material is very boring. ", "rating": 3, "expected_grade": "C", "created": "2010-11-30T14:51:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I loved this class! Most of the information was really interesting, but some was pretty dry. The class moves pretty fast, so you have to keep up.\r\nYou don't really need to go to lecture since she posts the slides on elms, but if you do, she does give many hints for upcoming exams.  Also, there's plenty of opporunities to get extra credit, like a field trip that can get you up to 10%!\r\nThe tests are online, which is good because you can use your notes, but she uses this testing system that shuts you out of the test if anything else is open.  You have to turn off all automatic updates and virus scans and everything, which was a big pain.\r\nBut overall, i took this class as an elective and it wasn't too bad.  Before all the exams, i printed out all the powerpoints and went through them using the book and did well on all three of the mid terms. the final had so many recycled questions, it wasn't bad.", "rating": 4, "expected_grade": "A", "created": "2010-05-23T21:56:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "If you decide to take this course, make sure you go to lecture, since she says A LOT of stuff that isn't in the book. The exams for this course were weird. I felt a lot of the questions were neither in the book, nor were they mentioned in lectures, so I found my self guessing answers. \n\r\nDiscussion sections are really important too, even though most of what you do in discussion really don't help you much on any of the exams. The exercises will help your grade a lot.\n\r\nAs for the professor herself, I thought she was cool/ok at the beginning of the semester, but as the semester went on, she was just unnecessarily a jerk to people.\n\r\nThe best thing about this course is the extra credit field trip. It's worth 10% of your grade, and it's a fairly easy exercise which isn't graded harshly, so it's easy to get a 100% on. Whatever you do, MAKE SURE YOU GO ON THE TRIP! It really paid off.", "rating": 3, "expected_grade": "A", "created": "2010-05-19T14:00:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "The first thing you should know about this class is that it is top 5 most boring classes available at Maryland.  She posts her slides online, but she always says stuff that isn't on the slides that goes on the exams.  You don't really need to go to lecture (like 1/2 our class), but if your too honest to skip lecture, bring something to entertain yourself with.\n\r\nHer exams were all online, but they were all very difficult.  One good thing about this course is that there is a lot of extra credit chances to make up points.  If you post on the weekly discussion board, you get graded on your posts and that grade replaces your lowest exam grade.  Also, theres a extra credit field trip that added 10% to your final grade.  So if you had an 80% you would have a 90% and an A.  \n\r\nDiscussion sections are easy points that make up 25% of your grade, but the work can be time consuming.  All in all, this was an annoying class that required a lot of work, but in the end, if you put in the work, you should do ok.", "rating": 3, "expected_grade": "A", "created": "2010-05-11T21:19:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "So much to say!\r\nA- I hated this class. If it was not the easiest of the Cores that it fulfills, no one would take this class. The class does not teach you anything that you wouldnt already know.  Her lectures are full of crap like \"Global Warming is bad for people, the animals, and  the environment.\" Really? I didnt know that? On the other hand, her class is so easy. Study from her PP and you should easily get A's on the tests.\r\nB- I hate this teacher. I had her last year and she is a miserable person and an even worse teacher. I emailed her a picture of my hospital bracelet WHILE I was still in the hospital and she wouldnt believe that I couldnt take the test because I was ill. I had to take her to the Dean and he eventually made her let me retake it. When I retook it I scored like a 90% on the multiple choice but surprisingly scored a 70% on anything that she graded and was subjective. She constantly made up lies about things I supposedly told her, and she was not at all understanding about my condition.\r\nThis teacher is a b*tch, the class is a joke, but its an easy A.\r\nCentorbi- if you're reading this, you got what you deserve!  ", "rating": 1, "expected_grade": "A", "created": "2010-03-21T07:47:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "I feel like GEOL120 is actually one of the classes that I've learned a lot in. Nothing that I would apply to my life really but interesting facts about the planet and natural disasters. The exams are in-depth but if you attend lectures and pay attention, it shouldn't be a problem. Discussions are a pain but easy points to your grade. Grades seem unreasonable at first but it works at towards the end.", "rating": 4, "expected_grade": "A", "created": "2009-06-02T00:51:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "Prof. Centorbi's lectures are great and you must attend them to pass the course. The information is very interesting.  Her exams are in-depth and difficult usually consisting of 40 mc and 2-5 short answers.  They require a lot of study time. You are required to attend the discussion sections which are large portion of your grades. You go over two chapters a week and the chapters are long. I took the course expecting another decently easy freshman course.  I was wrong, so do not make the same mistake. Overall it is a good course and you are forced to learn a lot. 4 stars for a tough but fair professor.  ", "rating": 4, "expected_grade": "", "created": "2009-04-13T15:57:00Z"}, {"professor": "Tracey Centorbi", "course": null, "review": "She's definitely not my favorite person but her class is very organized and pretty clear. We had concept sketches for exams and they are not hard but you really have to study. I would say there is a lot of work for a 100 level course. ", "rating": 3, "expected_grade": "A", "created": "2018-11-09T01:03:35Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "Centorbi was very straightforward and helpful as much as a professor in college should be. I noticed that most students expect college professors to tend to all their concerns but you have to realize that that's not the case.\r\n\r\nIn GEOL120, Centorbi covered a chapter or two from the book each week (which you really have to read if you want to ace the exams and final), and after four chapters there would be an exam that consists of 2 out of 8 potential concept sketches. It's very easy to study for the exams as they are just diagrams you can prepare and consult with her about prior to the test.\r\n\r\nOverall, the course was a very achievable A but not an easy one. You actually have to work harder than you did in high school to get the grade you deserve (shocker!) With that, she really is nice to those who put in the effort and try to fully understand her subject.", "rating": 5, "expected_grade": "A", "created": "2019-03-17T00:42:29Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "This is a pretty straightforward class but there is a heavy work load. Quizzes every week, HW that takes an hour, random in class assignments. Discussion has quizzes every time you meet. There are 4 exams and a final. If she likes you she'll bump you up to the next grade like from and A- to an A. Try to get on her good side. Don't take this if you are a senior looking for an easy A.", "rating": 4, "expected_grade": "A", "created": "2019-03-27T18:05:42Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "Do not take this class unless it's in your requirements! Tracey is mono-toned and condescending. She introduces herself very well but it's misleading. she can be rude at times and always threatens the class by saying she'll assign us a quiz if we don't participate. The exams are online but they are extremely difficult as half the content we don't go over in class nor is it present in the textbook. Discussions are also every friday and theres always a quiz and graded classwork in the 50 minutes provided. The subject itself is very interesting and fun but the professor did not provide a great class experience. This was not an easy class by any means but you work for what you get! Do not recommend ", "rating": 1, "expected_grade": "B-", "created": "2019-12-06T00:33:01Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "She is pretty monotoned, but she is good at answering all questions during lectures. She is very informational, but her lectures are boring and she does not really care about certain people in the room. ", "rating": 3, "expected_grade": "B", "created": "2019-12-06T14:50:55Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "She is a great teacher if you pay attention. She lectures the entire class, letting out at most 15 minutes early. One hour of homework each week and a quiz to follow. Quizzes are online, you are allowed to use google, and most of the questions she pulled from quizlet so they aren't that hard. She know what she is talking about so be sure to copy the slides in addition to what she says. It is a lot of work but I enjoyed the class despite of this. For a level 100 you can definitely find another class for your NS or lab that wall be much less work. She offers a 5% extra credit at the end, and I highly recommend doing this. This call is a lot more fun if you find friends to study with. I expected an A, and I got one, but not easily this class does require work.  ", "rating": 5, "expected_grade": "A", "created": "2019-12-17T00:14:11Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "This class when taken with the lab (geol110) is HELL. If I could give it 0 stars or negative stars I would. I don't know if it's because it's all online, but I have more work in these classes than I do in any others combined - AND IT'S NOT EVEN FOR MY MAJOR. I had to take a required lab science and I made the mistake of picking this one. Don't waste your time you will be miserable", "rating": 1, "expected_grade": "", "created": "2020-09-25T02:28:53Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "*This is reviewing the course for online instruction*\r\ntl;dr This professor is NOT an easy A. 70% of each week was spent doing work for this class. She is the only professor in GEOL that used honorlock  anti-cheat software for exams (video, mic, and screen recording). \r\n\r\nFULL REVIEW:\r\nEach week we were assigned: 30-100 hw problems (100pts), a quiz (40pts), 8-10 lecture videos with participation quizzes through out (you must watch these lecture videos because the these quizzes are scattered throughout and alone are worth 20% of final grade). All in all I spent at least 10+ hours a week for this professor alone. Exam weeks easily make this go to 15+. This is an absurd amount of work for an 100 level course. \r\n\r\nEach exam covered 3 chapters. It might not seem like much but take my word, it's a lot. Of everything that could be on the exam, we were tested on the simplest things like identifying different kinds of rocks.\r\n\r\nI gave two starts because she's a really nice person, but a mean professor. Her expectations of the students were way too high for an 100 level course. ", "rating": 2, "expected_grade": "B", "created": "2020-10-19T15:19:22Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Makes the class really difficult and is not an easy A but gives 5% extra credit ON TOP OF FINAL COURSE GRADE at the end of the semester. ", "rating": 5, "expected_grade": "A", "created": "2020-12-27T21:37:10Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I took GEOL100 completely online in Fall 2020, and the class was entirely asynchronous. It wasn't the worst class and not too difficult in my opinion. She would publish a bunch of lecture videos each Monday that would range from 5 to 20 minutes each and were easy to follow along with, just extremely boring. Embedded in the lecture videos were quiz questions about the content of the lectures, and some weeks these questions were retakeable until you got them right, and sometimes they weren't, there was no pattern to it. You would also be assigned a chapter to read each week from the textbook, and the textbook was interactive so there was a grade for completing the questions for each chapter. Most weeks I didn't even read the chapter and just answered the questions until I got them all right (they were graded for completion). My biggest complaint about this class is that the quizzes we had each week were created through the textbook service, so the questions were based entirely off of the textbook and not the lectures at all. Luckily, the quizzes are open note and you get two tries on them. There was a midterm roughly every three weeks in this class, and the midterms were based off of the lectures. The midterms also felt very \"unpolished,\" there were often repeated questions, etc. Centorbi would also use a browser extension to prevent cheating on the exams that would film you the entire time. I would definitely study for the exams, but they weren't extremely difficult. She also had no TAs for this class, so the only way to contact her outside of emailing was her office hours that were only hosted once a week. Overall, not too difficult of a class, but definitely not an easy A if you don't have at least some interest in the subject.", "rating": 3, "expected_grade": "", "created": "2021-01-13T00:12:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I took Tracey Centorbi's class in the fall of 2020. It was completely asynchronous. If you are willing to dedicate multiple hours every day studying, you'll pass. I used Quizlet, and it helped me survive the course's exams. Don't make the same mistake I did and spend too much time studying the textbook, I failed an exam this way. She says that she builds her exams mainly on the lecture videos she posts, the textbook material only factors a small amount into the exam. She also uses Honorlock. However, after discussions with the students, she removed all of Honorlock's predatory requirements.\r\n\r\nIn the final month, the class took a turn for the better. Due to the pandemic, the college allowed professors to make finals optional. The professor did, which allowed most of us to save our grades. If you think remembering hundreds of terms for one exam is rough, imagine studying for a cumulative final exam. She also posted an extra credit assignment, which added five points to your total grade.", "rating": 4, "expected_grade": "A+", "created": "2021-01-17T13:58:30Z"}, {"professor": "Tracey Centorbi", "course": "GEOL110", "review": "The lab was horrible but it was easy. There was so much work involved and if it wasn't for the extra credit offered at the end I'd have a very different grade than the one I ended up with. ", "rating": 3, "expected_grade": "A+", "created": "2021-01-23T05:13:34Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Her lectures were very hard to understand and the in-class activities were very difficult as well, I do not recommend taking her class if you are not interested in geology because you will struggle. She wasn't the worst teacher but not the best, her extra credit opportunity did save me though so I would say she's alright. ", "rating": 3, "expected_grade": "A-", "created": "2022-05-17T17:09:47Z"}, {"professor": "Tracey Centorbi", "course": "GEOL110", "review": "This lab is difficult in some areas and really easy in others. It is taught by TAs, so you will never meet the lab director. Your grade really depends on the TAs and how they think you performed on your lab work. My TA was generally very helpful and guided us through any questions we had. For this lab you will work through the lab manual, have a pre-reading every week before lab, then have a quiz on that reading at the start of your lab period. These quizzes can be extremely tricky, so make sure you read, and read carefully. \r\n\r\nIt is apparently one of the easiest labs you can take, so I would recommend it. This course doesn't demand much attention rather than pre-reading and soaking in the information.", "rating": 3, "expected_grade": "B+", "created": "2022-05-24T14:45:47Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "Tests were hard but if you studied and know how to quickly read a textbook you should do fine. Lectures felt like a waste of time but skipping them would impact your grade. Overall the class was very intuitive (what global warming is bad?!?!) which made the lectures being mandatory even more painful. Also I do not love her attitude it felt like she felt better than everyone else which like she isn't.", "rating": 3, "expected_grade": "A-", "created": "2023-01-08T23:52:09.315537Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Take a different professor or plan to take the natural lab another semester, do not take this teacher. She has an air about her in which she thinks she's better than everyone. She calls out students for small things. She tries to come off relatable the first few lectures but its just an act. Her TA's were unhelpful and both she and her TA's graded way too harshly. I typically do well in the sciences and I had to struggle through this class to get the grade that I got. Her midterms and final were just completely ridiculous unless you wrote down word for word what came out of her mouth. I literally did extra research outside of the class for an exam and still did worse than I wanted. I've had worse teachers so I won't give her a one but she doesn't deserve more than that. As for the lab, we were not given the right resources to prepare for it, and most people in my section barely got higher than a C. Also, on the midterms, because she uses some randomized testing feature, you can get asked the same question 5-7 times and you will get points taken off for each one so good luck if you don't know the answer. She also refuses to listen to critiques of this testing system and you cannot argue points back if this happens to you. I would give her a one but I've had worse professors, however she doesn't deserve more than a two.", "rating": 2, "expected_grade": "A", "created": "2023-03-01T21:18:39.459871Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "Not a bad lecturer. Exams were mostly fair. Attendance is required though. Slides kind of don't make sense unless you are in class to hear her talk about them. I didn’t like her sense of humor or how she talked. Don’t take unless you are interested in Geology.", "rating": 3, "expected_grade": "A", "created": "2023-04-29T14:08:03.925611Z"}, {"professor": "Tracey Centorbi", "course": "AOSC123", "review": "Attendance is mandatory, but the exams were fair. I only took this class as a sustainability credit, and I would recommend it to others as it is pretty easy. Some downsides are that there is a lot of work for Friday Discussions, and the clicker questions are just annoying. Other than that, this class is not bad at all in itself, but only kind of annoying at times.", "rating": 3, "expected_grade": "B+", "created": "2023-05-07T15:54:46.016254Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "The instructor was very nice and cracked some jokes here and there. Attendance is mandatory and will cost you participation points if you don't show up. Many people didn't show up and just asked others who were in class for the clickers code and did it from home to get participation points but that's against the honor code and if she finds out (and she will find out), she will write you up and give you an XF. So please just show up to class. There are 4 exams (3 mid terms + 1 final). Please do the practice exams and screen record your answers because many of them will be on the exam. P.S all the exams are online. Do the extra credit!!", "rating": 4, "expected_grade": "A", "created": "2023-12-17T04:14:06.279847Z"}, {"professor": "Tracey Centorbi", "course": "GEOL110", "review": "I had an A the whole time, but that final exam messed me up bad. It feels like a four credit course but it's only one credit. Do the extra credit. The extra credit only put me up by 1% but that was the difference between a B (3.0) and B+ (3.3). Terrible thing is that a 89.99 doesn't equal a 90.00. So if you have an 89.99 then that's a B+. Yes, you heard that right. They don't round up. I did like my TA for the class. Please rely on other people in the class too. You have a quiz every morning. Half the quiz will be on the material covered in lab the previous week and the material going to be covered in that lab. So study!!! It was a fun class and many of what I learned help me with GEOL100.", "rating": 3, "expected_grade": "B+", "created": "2023-12-17T04:23:40.264059Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Professor Centorbi is an excellent lecturer. Her slides are really good. Professor Centorbi cares about her job and knows a lot about geology. She is also super funny. I took this class in Fall 2023 as an elective and received an A. The class overall is easy, however I did not take the lab. Each week you are required to complete a quiz about the material (it is graded on participation), as well as a short discussion post. What is nice about the class is that she drops one of the three midterm exams and one quiz. However, the only issue with the class and why I did not give the class five stars is that participation is required there are clicker questions. However, she drops the five lowest participation grades (so theoretically you can miss five classes). It is an all-around easy class and a good professor.", "rating": 4, "expected_grade": "A", "created": "2023-12-20T02:02:17.071632Z"}], "name": "Tracey Centorbi", "slug": "centorbi"}