{"courses": ["ENGL101", "AASP298L", "ENGL234", "ENGL265", "LGBT265", "AASP298L", "ENGL234"], "average_rating": 4.3333, "type": "professor", "reviews": [{"professor": "Tyra Griffin", "course": "ENGL234", "review": "Tyra is an AMAZING professor and even more just a great person! I took her course as a gen-ed and loved it. She tells us that she teaches her students in a way that she would've liked to be taught as an undergrad. Almost all of the ENGL234/AASP298L classes were discussions based upon a reading that was for homework. With our readings there was also a digital journal that she had us keep where we took one/two quotes from the reading and deeply analyzed it (in 0.5-1 page) offering what we INDIVIDUALLY thought of it - it wasn't a review or a thesis-based thing; we had a lot of freedom as students in our writing. This was similar in our final paper/essay - we had freedom to write about any reading/text of our choice and deeply analyze it similar to the digital journal. I think this freedom that she gives us throughout the class allows us to explore some really deep and dense concepts. I was able to truly indulge with the text and grappled with some very amazing topics - I learned so much about African American history, literature, and culture in her course. I'm sure students will be able to take away a lot from any course that they take with her. She also completely understands that we procrastinate sometimes and life occasionally gets in the way...she's open to give extensions or offer academic support when students need it. There is a decent amount of reading in this course that I took with her (on average 40 pages twice a week so 80 pages) but that is expected with any english based course. Please take a class with Tyra if you can!! She is the best!", "rating": 5, "expected_grade": "A+", "created": "2023-05-04T15:38:43.460476Z"}, {"professor": "Tyra Griffin", "course": "AASP298L", "review": "Tyra is a Super enjoyable professor and was a pleasure to work with. Her class discussions are the most interesting parts of the class and will leave you with something to think about/consider for days. She is always easy to work with and does not want to make anything too complicated. I'm happy to say I actually learned quite a bit during her class and challenged myself She's great, please don't stress her out!! :-D", "rating": 5, "expected_grade": "A+", "created": "2023-05-15T22:41:23.714145Z"}, {"professor": "Tyra Griffin", "course": "ENGL234", "review": "I really liked how much freedom there was with writing assignments, but the class wasn't very well organized. I think this was just because it was one of her first classes, but grading took actually so long that I didn't have 3/6 of my grades in by the time finals were over. A lot of the time it was kind of unclear what she actually wanted from assignments, but she was very responsive to emails and stuff so its not hard to get clarification. She's also very engaging with her students and clearly cares about the subject a lot. Would definitely recommend, she's only going to get better as a professor.", "rating": 3, "expected_grade": "A+", "created": "2023-05-22T00:18:43.631225Z"}], "name": "Tyra Griffin", "slug": "griffin_tyra"}