{"courses": ["BSGC102", "GVPT409G", "BSGC101", "GVPT803", "BSGC302", "GVPT289A", "GVPT761", "BSGC399", "HONR208Q", "GVPT808E", "BSOS448W", "GVPT409L", "GVPT409H", "GVPT409F", "BSGC399", "GVPT206", "GVPT803", "GVPT206", "GVPT409G", "GVPT406", "GVPT407", "GVPT409G", "GVPT388G", "GVPT409G", "GVPT803", "GVPT206"], "average_rating": 4.1667, "type": "professor", "reviews": [{"professor": "Virginia Haufler", "course": "GVPT289A", "review": "Great lecturer.  The lectures are engaging and interesting.  Go to all discussions and do the assignments and you should be able to get an A easily.  I did not participate that much in discussions, which is why I got an A- in the class.  The TA I had, David Prina, was very nice and the discussions were engaging as well.", "rating": 5, "expected_grade": "A-", "created": "2013-05-28T12:55:00Z"}, {"professor": "Virginia Haufler", "course": "GVPT200", "review": "Professor Haufler is a great lecturer! The topics she covers in international relations are very helpful. I also found her to be very charismatic about her students and would often post internship listing and attempt to help in anyway she could. You really don't need to go to lecture but for some reason EVERYONE did. She posts her slides online which are very explanitory and the book is also an easy read with great definitions. I often felt that before an exam reading the book was the best way to study. For the class you have about 5 homework assignments, a midterm, a ten page paper, and a final. She also offers a point of extra credit which helped me the A in the class. You MUST go to discussion this can seriously hurt your grade if you don't go. Overall, I highly recommend her class!!", "rating": 5, "expected_grade": "A-", "created": "2011-01-05T00:45:00Z"}, {"professor": "Virginia Haufler", "course": "GVPT200", "review": "Professor Haufler is interesting, but lectures are pretty boring to me. If you want to be engaged in the lectures, you really have to sit near the front. Haufler was very helpful in promoting activities outside of the class, that would help us understand the stuff she taught us. However, you need to establish a relationship with your TA, or you need to do well on your midterm, final paper, and the final. Haufler also offered extra credit. As I look back on the course, it was a lot more enjoyable than through the semester. The concepts are really easy, and Haufler made it easy to understand. ", "rating": 4, "expected_grade": "", "created": "2010-12-20T19:59:00Z"}, {"professor": "Virginia Haufler", "course": "GVPT200", "review": "Haufler is awesome and a great lecturer. That being said, the TA is the one who makes or breaks your grade. My TA (who will remain nameless) made the class much harder than it needed to be and definitely graded harder than the other TA's.", "rating": 5, "expected_grade": "", "created": "2010-12-11T21:12:00Z"}, {"professor": "Virginia Haufler", "course": "GVPT200", "review": "GVPT200 is my favorite course. A contributing factor is the fact that Professor Haufler teaches so well. She makes it soo easy to internalize the course information, especially since she relates it all to current events.\n\r\nReally manageable class. I suppose you don't need to attend lecture, but why wouldn't you? I went to every lecture and enjoyed it.", "rating": 5, "expected_grade": "A", "created": "2009-01-23T23:53:00Z"}, {"professor": "Virginia Haufler", "course": "GVPT200", "review": "Worst experience at UMD. Martin Elissetche has to be the worst TA in government and politics. He is rude and demeaning and calls people out in class. He honestly is an arrogant prick. Try to get Jennifer for your TA if you take this course.", "rating": 1, "expected_grade": "A", "created": "2008-12-29T17:23:00Z"}, {"professor": "Virginia Haufler", "course": "BSGC101", "review": "Wonderful and kind. The slides are packed full of information, but her exams are very manageable. ", "rating": 5, "expected_grade": "A+", "created": "2019-01-29T20:17:24Z"}, {"professor": "Virginia Haufler", "course": "BSGC101", "review": "Very dedicated to globalization, and wants her students to be the same. The course itself is one of the easiest available at UMD. It's a steal for 3 credits. Few graded assignments, extremely manageable exams, and the occasional group project. Didn't learn a lot in this class, but it's definitely a gpa boost and works well as a study hall.", "rating": 4, "expected_grade": "A+", "created": "2021-11-22T17:12:40Z"}, {"professor": "Virginia Haufler", "course": "GVPT206", "review": "shes so nice ! easy class (barely came maybe like 10 times in total ) and passed with a 84% and pretty good topics, midterm was kinda hard but thats on me for not taking notes ngl, no final but a group project, overall chill teacher and class", "rating": 5, "expected_grade": "B", "created": "2023-05-15T19:54:07.931562Z"}, {"professor": "Virginia Haufler", "course": "GVPT206", "review": "shes so sweet! As a person she's very kind and very understanding, as a professor, she does read off the slides but she does at times thruout lecture go off for good examples, I'm a gvpt major and please take this class for spring!! Would usually come to only monday lectures and barely went to disscusion as she posts the notes online but most of the people I know in this class got a B- and maybe B+ as the highest", "rating": 5, "expected_grade": "B-", "created": "2023-05-31T13:58:19.614022Z"}, {"professor": "Virginia Haufler", "course": "GVPT409G", "review": "Professor Haufler is really nice. Lectures can be hard to pay attention to if they are 1.25 hours. It felt as if grading was slightly arbitrary. This can raise issues with the low amount of grades put in. If you are considering different 400-level GVPT courses, I think there are better ones out there.", "rating": 2, "expected_grade": "A-", "created": "2023-12-26T19:05:21.230582Z"}, {"professor": "Virginia Haufler", "course": "GVPT406", "review": "This was Professor Haufler's first time teaching 406 and honestly, she did a great job. She is very knowledgeable about international economics and for topics she did not know as much about she made sure to do tons of research before class. She uses a website that grades annotations for readings so make sure to do them - the course only had 5 grades. We were allowed a note page during the midterm and final and the study guide was essentially the exam. The paper was a bit weird because Professor Haufler actually required us to use Chat GPT and critique it which was interesting. Overall I would definitely take another class with Professor Haufler.", "rating": 4, "expected_grade": "A", "created": "2023-12-26T20:52:20.361418Z"}], "name": "Virginia Haufler", "slug": "haufler"}