{"courses": ["EDCI685", "EDCI467", "EDCI788X", "EDCI698", "EDCI288W", "EDPS788T", "EDCI646", "EDCI640", "TLPL288W", "TLPL456", "TLPL691", "TLPL730", "EDCI463", "EDCI898", "TLPL462", "TLPL899", "SPHL601", "SPHL602", "SPHL603", "TLPL452", "TLPL206", "TLPL288W", "TLPL456", "TLPL640", "TLPL691", "TLPL691", "TLPL899", "TLPL691", "TLPL899", "TLPL206", "TLPL456", "TLPL691", "TLPL206", "TLPL456"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Wayne Slater", "course": "TLPL288W", "review": "Wayne is a caring and passionate educator that truly cares about his students and the material he is teaching. Dr. S is the best.", "rating": 5, "expected_grade": "A", "created": "2019-12-19T20:21:44Z"}, {"professor": "Wayne Slater", "course": "EDCI288W", "review": "I dare you to find a better professor than Dr. Slater. He’s amazing. Take any class he teaches.", "rating": 5, "expected_grade": "A", "created": "2020-05-04T06:38:48Z"}, {"professor": "Wayne Slater", "course": "TLPL288W", "review": "the sweetest, most caring prof. deserves everything. I LOVE WAYNE", "rating": 5, "expected_grade": "A", "created": "2020-12-14T17:37:56Z"}, {"professor": "Wayne Slater", "course": null, "review": "BEST PROFESSOR EVER. he is the sweetest old man and is so passionate about every topic in this class. There were readings every week which weren't difficult and for book readings in addition to that I never actually read. Spark notes or other sites like that were enough to facilitate the conversation needed for this class. I will be looking for other classes that he teaches. ", "rating": 5, "expected_grade": "", "created": "2021-12-09T21:44:08Z"}, {"professor": "Wayne Slater", "course": "TLPL206", "review": "hes such a slay! such a goofy guy with the most classic grandpa humor in every lecture. i wish i got to know him more because he mentioned really interesting research and was all-around awesome. this class deals with a lot of opinions but he was great at gently and positively encouraging everyone to share, and encouraged us to disagree with the readings. a big part of this class were the TAs but they were very sweet too (rasha & carla)!  the weekly assignments that accompany the readings are quite easy, just take a bit of time. fairly light grader. for the midterm, he gave us all the questions/instructions in advance and encouraged us to just work on it on our own. he also cancelled the final exam b/c of our \"good performance\" throughout the semester which i thought was so sweet. lots of respect for Slater!!!!!", "rating": 5, "expected_grade": "A", "created": "2022-12-12T21:03:10.358355Z"}, {"professor": "Wayne Slater", "course": "TLPL206", "review": "Dr. Slater is AMAZING; definitely one of the best professors at UMD! He's so caring, funny, and passionate about what he teaches, and the TAs in the course (Rasha and Carla) were also super sweet and amazing. There were weekly assignments on readings which were pretty easy and a bit tedious at times, but they also really helped me with understanding the readings better. The midterm was open-note and explained very thoroughly, and Dr. Slater cancelled our final exam (I'm telling you he's genuinely the best). Dr. Slater is also a very fair and easy grader. Lectures and discussions were so fun and engaging and I'm genuinely so sad this class is over. My favorite class ever, 100% take it (or any other course with Slater) if you can!!!", "rating": 5, "expected_grade": "A+", "created": "2023-01-07T09:14:00.256372Z"}, {"professor": "Wayne Slater", "course": "TLPL206", "review": "Dr Slater is a picturesque, too-good-to-be-true professor. Words can't do him justice. Slater will better your understanding of the world and actualize your dreams of being in a college movie.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T18:51:05.493327Z"}, {"professor": "Wayne Slater", "course": "TLPL206", "review": "Yes, it will seem like a lot of tedious busy work, but Dr. Slater is very lenient about grading. This class is so chill to fulfill a gen ed. I got 100%.", "rating": 5, "expected_grade": "A+", "created": "2023-12-23T15:17:40.458788Z"}], "name": "Wayne Slater", "slug": "slater"}