{"courses": ["ARCH271", "RDEV250", "ARCH271", "RDEV250", "ARCH271", "RDEV250", "ARCH271", "RDEV250", "RDEV250", "RDEV250", "ARCH271", "RDEV250", "ARCH271", "RDEV250", "ARCH271", "RDEV250"], "average_rating": 3.875, "type": "professor", "reviews": [{"professor": "Wayne Curtis", "course": "RDEV250", "review": "Great Professor. A good class to take if you want to be introduced to real estate development.", "rating": 5, "expected_grade": "A", "created": "2022-10-11T23:27:26.679954Z"}, {"professor": "Wayne Curtis", "course": "RDEV250", "review": "Great Professor. Is a fair grader, is timely in responding, and provides clear lessons. His course is a great course if you are thinking about taking the RDEV minor.", "rating": 5, "expected_grade": "A+", "created": "2023-02-19T22:21:54.190774Z"}, {"professor": "Wayne Curtis", "course": "RDEV250", "review": "The teacher is very nice and educated in his field. He has lots of experience. The TAs in the class were amazing and responded to students quicker than him. The Canvas page was somewhat disorganized and needed to be clarified multiple times throughout the semester. His lectures basically became reading-off the PowerPoint slides so I stopped coming and just read them at home and basically missed out on nothing. He occasionally has some technology issues. Overall a good professor and a good introduction to the RDEV Minor.", "rating": 5, "expected_grade": "A", "created": "2023-04-13T04:55:50.249988Z"}, {"professor": "Wayne Curtis", "course": "RDEV250", "review": "He does not teach you a damn thing, he talks about his life for an hour, and then you have quizzes that have nothing to do with what he talked about. You have a better chance in this class not paying attention and just reading the slides. The TA's are basically useless. He also forces group projects, but sets up the groups in the worst way possible, a kindergartener could set up the groups in an easier way. The class itself is not bad, but the lectures are basically useless.", "rating": 2, "expected_grade": "A", "created": "2023-10-06T15:36:36.272002Z"}, {"professor": "Wayne Curtis", "course": "ARCH271", "review": "class isnt bad but lectures are useless. he brings in some decent guest lecturers, 1-2 group presentations/writing assignments. Weekly AI-graded discussion posts based on readings, weekly quizzes on readings and lectures. posted slides are disorganized but manageable, no online resources for help", "rating": 4, "expected_grade": "A", "created": "2023-10-26T17:30:29.659632Z"}, {"professor": "Wayne Curtis", "course": "RDEV250", "review": "Dr. Curtis is kind but often teaches solely off of powerpoints. All lectures are recorded. There are assignments almost every week on a program called Packback which are easy. There are four projects not harshly graded by the TAs. Mostly applying the module you're learning to a hypothetical scenario. The final is a group presentation which is similar to project 3. Overall, this was an easy gened just sometimes took a while to complete projects and lectures were hard to focus on.", "rating": 4, "expected_grade": "", "created": "2023-11-29T20:07:25.415161Z"}, {"professor": "Wayne Curtis", "course": "RDEV250", "review": "Class is stupid. He doesn't clearly explain any assignments. All the modules and files are mixed up.", "rating": 1, "expected_grade": "", "created": "2024-03-05T16:54:26.467188Z"}, {"professor": "Wayne Curtis", "course": "RDEV250", "review": "He is actually a really great and understanding professor!  As long as you're honest about everything, they will allow some extensions.  You have open note quizzes, which are easy to find answers to as long as you look and command F through the power points.  Over all its an \"easy gen ed\" as long as you put the slightest amount of effort behind it.", "rating": 5, "expected_grade": "A+", "created": "2024-03-14T19:34:26.089550Z"}], "name": "Wayne Curtis", "slug": "curtis_wayne"}