{"courses": ["PHYS261", "PHYS271", "PHYS270", "PHYS174", "PHYS375", "PHYS261M", "PHYS271M", "PHYS121", "PHYS260", "PHYS275", "CHPH718I", "PHYS465", "CHPH718I", "CHPH718I", "PHYS275", "CHPH718I", "CHPH718I", "CHPH718I", "PHYS375", "CHPH718I", "PHYS375"], "average_rating": 1.8125, "type": "professor", "reviews": [{"professor": "Wendell Hill", "course": "PHYS271", "review": "Avoid if at all possible.\r\nHe's suuuper lazy. I think he's fine with the *idea* of helping students, but on those rare occasions (lol) when it actually requires any effort to do so, he doesn't bother.\n\r\nDisorganized lecturer, pretty bad at explaining concepts. He likes transcribing long derivations from his notes, but without really explaining them very well or discussing practical applications. So hard to follow.\r\nUsed MasteringPhysics for homework, despite student protests, and never really bothered to give students help or slack when they would frequently have trouble with it. He always talked like he was going to \"look into it\" or do \"something\" about it, but he never did.\r\nHe isn't (in my experience) *explicitly* dismissive of student questions or concerns, but he just doesn't really try.", "rating": 2, "expected_grade": "B", "created": "2014-12-09T13:02:00Z"}, {"professor": "Wendell Hill", "course": "PHYS271", "review": "Only reason he got 1 star was because 0 isn't an option. If you have any passion or interest in physics do not take his class because he will ruin all of it. Horrible teacher so take literally anyone else possible. Tests are impossible and he is unreasonable. Stay away", "rating": 1, "expected_grade": "", "created": "2014-05-02T16:46:00Z"}, {"professor": "Wendell Hill", "course": "PHYS270", "review": "Dr. Hill is by far the worst teacher I have ever had. If I could really rank him, he would be negative. NEVER EVER EVER take his class. His exams were impossible, the material is class was worthless. He has no respect for his students. He was awful to deal with, never responds to emails. ", "rating": 1, "expected_grade": "", "created": "2014-01-26T19:38:00Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "The most horrible teacher you will ever have. Just HORRRRRIBBBLLLE. Never take him, he should be fired from teaching.", "rating": 1, "expected_grade": "C", "created": "2009-05-05T18:05:00Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "I have found professors in the physics department to be some of the worst professors I've had and Professor Hill was no exception.  He taught the basic concepts in lecture, but then the tests were impossible proofs that could not be finished in the time given.  There was a lot of homework every week (masteringphysics) and it didn't really help on the tests at all.  There were also quizzes every week in discussion.  If at all possible, avoid Hill.", "rating": 1, "expected_grade": "C", "created": "2009-04-20T01:16:00Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "Professor Hill did not treat students with respect and should not be teaching.  His teaching style is abysmal.  He refused to use a microphone although the class was in the large physics lecture hall.  He repeatedly yelled at students to leave his class and would never start on time.  After forcing students to buy clickers at the beginning of the semester, he stopped using them after 2 weeks of class. (I wanted my 50 dollars back, but the bookstore would not do a refund, sounds like a scam to me.)  His powerpoint presentations were the bare concepts of physics 2 without any real explanation or examples.  His exams, of course, were completely opposite, with detailed problems that were impossible to finish in the time of the exam.  He even stated that our first exam was not possible to finish in the time he gave us, I guess thats why the average was a 40 and the high was an 85%.  He barely did any example problems in class and gave us roughly 10 hours of homework a week, which was only 15% of our grade.  ", "rating": 1, "expected_grade": "A", "created": "2008-12-13T18:50:00Z"}, {"professor": "Wendell Hill", "course": "PHYS121", "review": "The only reason I got an A in the course is because I paid for a weekly tutor after the first exam. He taught topics that shouldn't be covered in this course. When I would attend office hours and ask for help he would make comments such as \"You should know this\" obviously I didnt because I am hear asking for you to re-explain it. It seems he has a passion for physics and wants to share that but doesn't understand how to teach lower level non-physics major courses", "rating": 1, "expected_grade": "A-", "created": "2020-05-16T22:55:52Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "It might be because he hasn't taught lecture in a while but he isn't as bad as the other reviews make him out to be. Sure, he still isn't the best professor to go to but he definitely is passionate.\r\n\r\nHomework-\r\nOne ExpertTA assignment per week and sometimes paper assignment along with it (Paper meaning they're textbook problems that you upload your work for). The amount of time you spend on it depends on how well you know the content and calculus. He likes integrating a lot. HIGHLY SUGGEST DOING HOMEWORK HIS EXAM IS BASED ON THEM. \r\n\r\nLecture-\r\nThis is a mixed bag. 260 in general is difficult to understand and Hill has a tendency of making mistakes and having to go back and correct things. This hurts because he likes spending most of class deriving equations and we only get through a handful (2-4) questions per class. However, he strongly encourages questions and wants us to speak. The good part of lecture is when he brings in contraptions and tools to visualize what we are learning in class (candles for sound waves, vacuum chamber, etc). He does expect everyone to be an engineering major though so if you're not... Well it's not too hard to understand notations but it will be slightly different.\r\n\r\nDiscussion-\r\nProbably depends on the TA you get but the one we got was wonderful. We get a 10 minute quiz every week.\r\n\r\nExams-\r\nIt's hard but fair, but he doesn't curve. Like other physics classes (at least for 1 and 2), you get 1 exam out of 3 dropped. He strives for an average of 70% which the first two exams did reach or almost reached. He usually gives a day of review before the exam. Exams are generally based on homework questions, one of them was straight up ripped from a paper assignment. His exam format has changed every exam though, gauging how the class wants to work with it. \r\n-First exam he provided the formula sheet and it was a few multiple choice and a few written questions.\r\n-Second exam he allowed us to write a formula sheet because the class voted for it and it was also multiple choice and written questions\r\n-Third exam no multiple choice. We got 4 questions and could choose 3 to do (and everyone failed anyways)\r\n\r\nExtra Credit-\r\nThis works a bit weird, he gave us a bonus question on exam 1 and 2 but the 10 possible points you can get from each do not directly count in the exam but instead, on the side. He also give lecture quizzes (only 2 this semester though) which are supposed to count as extra credit? The reasoning he gave was along the lines of \"if you are on the border of a grade and need that extra boost, then the extra credit gives me an excuse to bump your grade up\"\r\n\r\nOverall, he's ok. Easy to zone out but that's mostly the topic than the professor.", "rating": 3, "expected_grade": "B-", "created": "2023-05-10T13:46:20.250398Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "Every single class he just focuses on deriving equations instead of explaining concepts. Most of the time he gets them wrong too, so you have to study for everything by yourself. I stopped going to lecture because it wasted my time and instead just learned everything from the TA. Don't take his class unless you absolutely need to. Find another professor because Hill will not help you at all.", "rating": 1, "expected_grade": "B", "created": "2023-05-11T01:44:43.280936Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "Exams were a but wacky and long. Spends the whole lecture deriving an equation and his slides are not very helpful. Often times he gets lost during his own lectures and is just a difficult class. The homework also took for ever The experiments were pretty cool, I will admit, but I reccomend taking another professor.", "rating": 1, "expected_grade": "", "created": "2023-05-11T20:12:14.987148Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "He's not a great professor but definitely not as bad as these reviews are making it seem. I'll list the pros and cons of him.\r\nPros\r\n- He will stay after class with you if you don't understand something. One class I was really confused and he stayed 30 minutes after lecture with me going over problems until I understood\r\n- Discussion quizzes are a good grade boost\r\n- Offered a makeup exam before the final that would replace your lowest exam score if you scored higher\r\n- Only grades 2 exams and the other 1 (or 2) get dropped \r\nCons\r\n- Lectures are often very confusing. He'll overcomplicate concepts for no reason.\r\n- When going over problems in lecture, he likes to write out the first step or two and then tell us to \"turn the crack\", which is his way of saying that he won't solve it and we need to figure it out by ourselves\r\n- He often made mistakes during lectures and either gets corrected by students pretty often or just solves the problem completely incorrectly\r\n- The whole class didn't understand what we were learning by the end of the semester and the extremely low exam scores and standard deviations for them that were through the roof proved that", "rating": 3, "expected_grade": "B", "created": "2023-05-14T17:46:29.132694Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "He's a pretty solid lecturer, very average for the physics department. He explains derivations in class and assigns homework for practice problems based on those concepts. Sometimes there's demonstrations in lecture, which explains adequately enough, or exam review lectures, which he does okay. Hands down the most mediocre physics professor, you'll be neither falling asleep nor wide awake during lecture, and you'll be neither completely lost nor completely understanding the content by the time the course is over.", "rating": 3, "expected_grade": "A+", "created": "2023-05-14T22:12:12.265174Z"}, {"professor": "Wendell Hill", "course": "PHYS375", "review": "This guy is a BUM. Thank goodness the labs were run by the TA's (who were absolutely delightful, I might add), otherwise I would have had a completely miserable experience. Here's a breakdown of all the problems I had with Hill's 375 class:\r\n\r\n-There were several homeworks in this class. And they were TOUGH. I was showing up to office hours every week because this dude would barely give any equations or examples in class and then would expect us to write PhD dissertations on the homeworks. I found myself using Google and finding random papers or textbooks to figure out how to solve the homework problems. Lectures were USELESS. On the bright side, the homeworks were graded by a TA who was super generous. It's just crazy to me how my lab homework was harder than my main physics classes. \r\n-The class had two lectures a week, which I learned absolutely nothing from. People quickly realized lecture was useless and soon enough over the class stopped showing up. Hill started giving pop quizzes just to get people to show up to his lectures. \r\n-SOOO many typos on assignments. You would think this would be a nitpick, but there were multiple times there were unsolvable questions on the HW because of typos. \r\n-Thank goodness, Hill did not grade lab notebooks, pre-labs, or homeworks. The stuff he did grade, however (the lab report, for example), he made sure to grade as harshly as possible. For the first draft of the lab report, mans gave no guidelines and then flunked just about everyone's papers. What the heck, man. \r\n\r\nIf you can afford to wait another semester to take this class with a different professor, I would. If not, just pray the TA's are good because you aren't gonna learn anything from this guy.", "rating": 2, "expected_grade": "", "created": "2023-11-29T18:38:01.123967Z"}, {"professor": "Wendell Hill", "course": "PHYS375", "review": "He's not a good lecturer, not an awful one, but I feel his lectures generally left me not understanding the material better than had I just picked up the textbook myself. If you could take the class with another professor, it would be optimal, but it's not so bad you should delay your graduation over it. His lecturing style mostly consists of throwing an equation up on the board and trying to explain it, he doesn't get caught up in derivations too often but when he does it is a stalling point for the class. To his merit he will try to help students when they ask after class, but if it should take too long, or should he not see a clear way to answer the student he tends to brush it aside and keep moving. Overall, very dispassionate and sterile as package, which is workable but clearly detrimental.\r\n\r\nKey Points:\r\n-Medicore and dispassionate lecturer, to the point it feels detrimental to understanding.\r\n-Homework is often incongruent with lecture, this could be because he doesn't reach his objectives in lecture, or it could be that they were simply taken from various textbooks and plastered together because they were vaguely on topic in lieu of making more apropos coursework. This is in addition to asking for derivations we did not even approach in class as \"original\" problems of his.\r\n-Assignments were often unclear in their guidelines (due to typos or a complete lack of direction), we did not get a decent picture of what he wanted from the semester lab report until after the first draft, and even then, things were quite murky. He does not communicate his expectations well on project-based work, to the point the first draft of the report's average grades were dreadful.\r\n-Labs were with the TAs and went generally fine, with the expected tedium of having to handle things like lenses with your hands. \r\n-The TAs this semester were absolutely amazing which may bias my rating of Professor Hill positively as I might not be able to fully understand the shortcomings I might have experienced in the hands of less astute TAs.\r\n-To his credit his exams are fair, he went open-note for them this semester, but they are verbatim the material covered on homeworks and in class.", "rating": 2, "expected_grade": "", "created": "2023-12-10T02:51:24.926725Z"}, {"professor": "Wendell Hill", "course": "PHYS375", "review": "This guy is just not cool. Super disrespectful. Says you can ask him for help, but when you do he just says, \"well you should know how to do this\" and leaves it at that. Grades hard based off nothing. Homeworks were really difficult, and were often extended by the TAs because of that. Avoid if possible, it feels like this guy wants to spite you a little bit for taking his class.", "rating": 1, "expected_grade": "A", "created": "2024-01-06T14:58:39.680456Z"}, {"professor": "Wendell Hill", "course": "PHYS375", "review": "Greatest professor of all time! Stays in the lab the whole way and is extremely caring and kind. Very engaging lecturer and he ignited the spark of physics in me.", "rating": 5, "expected_grade": "A+", "created": "2024-03-26T22:24:14.633903Z"}], "name": "Wendell Hill", "slug": "hill_wendell"}