{"courses": ["PLSC400", "ENST471", "PLSC789M", "ENST689Y", "ENST407", "BSCI442", "ENST472", "PLSC608T", "ENST689O", "ENST689", "AGST130", "PLSC130", "ENST472", "ENST689", "PLSC608T", "PLSC275", "AGST130", "ENST472", "ENST689", "ENST689O", "ENST689Y", "PLSC130", "PLSC608T", "ENST472", "ENST689", "PLSC275", "PLSC608T", "PLSC789M", "AGST130", "ENST472", "ENST689", "ENST689O", "ENST689Y", "PLSC608T", "AGST275", "ENST472", "ENST689", "PLSC608T", "AGST130", "ENST472", "ENST689", "ENST689Y", "PLSC608T"], "average_rating": 1.7, "type": "professor", "reviews": [{"professor": "Wendy Peer", "course": "BSCI442", "review": "Dr. Peer is a nice lady, but to be honest she is a thoughtless and out of touch instructor. Her lectures went so fast and had so many details, it was impossible to know what we needed to know and what she was just telling us for the sake of telling us. I am sympathetic to the fact that it is difficult to teach during an online semester, but she made it seem like an absolute chore to do basic things such as post lecture slides, record lectures, post announcements to the entire class, and provide info about exam format. She was not sympathetic to the fact that some students are unable to attend synchronous classes sometimes (because we're in a pandemic and some of us have to work to keep paying these bills) and honestly just didn't seem to understand that students are struggling more than we would if the class was in person. She made such a deal about not telling us what the final exam was going to be like and didn't provide any sample problems whatsoever. Our only midterm was written by a different professor and there were no other assignments that gave insight into her question style, so we went into the final completely blind. When the class approached her about feeling unprepared and anxious about going into the final like that, she basically gaslighted us and was so passive aggressive for no good reason. I know this sounds like one of those super dramatic reviews but I have genuinely never had a professor roll her eyes at someone asking a genuine question before and I was shocked. The class was overall an absolute mess but then again this was an online semester and the grades seem 10x better when she was in-person so theres that. ", "rating": 1, "expected_grade": "P", "created": "2021-05-12T18:16:19Z"}, {"professor": "Wendy Peer", "course": "PLSC275", "review": "I've taken classes in the chem department before and it's brutal. That's a well known fact at UMD. But Dr.Peer took a chemistry class (Orgo for plant sciences) and removed all the frills and trickiness. In practice I'm sure I didn't see as much material as the standard Orgo I kids, and I'm sure I didn't see nearly as tricky problems, but I think when push comes to shove, we will remember about the same material and know it about as well a year or two down the line. I think she taught what needed to be taught, and what could effectively be learned in a one semester course. She does give regular quizzes but I balanced it pretty well with some other very tough classes ( 2 CS courses), she says she pulls quiz problems right off the ungraded HW (your choice to do it or not...it's not handed in). And the test are basically the HW's so if you do the couple of Hours of homework you're asked to do a week, you're in fantastic shape. Honestly she (effectively) 3 quizzes so if your overloaded with work one week...as long as you catch up before the tests or the final you're fine. The one complaint is the one test and one final which are weighted evenly, but they were both straight forward tests with a absolute no trickery (did I mention she doesn't try to trick you), and I think they both had a fair amount of extra credit (at least the final did)! Good teacher, very accommodating, very friendly, made a daunting topic easy, great topic. If you have the choice between taking 275 and Orgo I, if you have a choice...take 275 with Dr. Peer.", "rating": 5, "expected_grade": "A", "created": "2022-05-23T15:10:10Z"}, {"professor": "Wendy Peer", "course": "PLSC275", "review": "This instructor will just keep talking and talking at you, and will not stick to what info you will need. I found her to be quite uncertain and disconnected as an instructor. Often times she gets quiet during lecture, or doesn't fully finish her thoughts, and loses focus (which makes me lose focus).", "rating": 1, "expected_grade": "W", "created": "2022-08-30T13:17:37.301617Z"}, {"professor": "Wendy Peer", "course": "PLSC130", "review": "I asked her plenty of questions to clarify things in class and she often meanders around some random topic she had floating in her head and fails to answer my question. The grades she gives out are often subjective and require a lot of discussions to really figure out what you got points off for.  The rubrics in the class are not often used and she grades based on what she feels is the grade you deserve. A lot of this class is figuring things out on your own and learning to use other resources to get your answer.", "rating": 1, "expected_grade": "A-", "created": "2022-12-06T02:32:05.004595Z"}, {"professor": "Wendy Peer", "course": "AGST130", "review": "This class seemed like it would be an interesting easy A gen ed. Somehow that was not the case at all. You hardly learn in class and they expect you to watch recorded lecture videos outside of class. I wouldn’t normally mind that but these are like four hours worth of lecture videos. This class goes heavily into the fermentation process but doesn’t discuss history like how or why fermentation created civilization (which is odd since that’s the name of the class). We are expected to take weekly quizzes on lockdown browser on these four hour videos. They will tank your grade if you don’t do well and I think I’ve only gotten a perfect score once. They ask for very specific answers so you almost always need to watch the lecture videos. I have learned absolutely nothing in this class and 100% regret taking it. The projects were easy but honestly quite stupid (making business proposals and creating a law). I wouldn’t recommend this class to anyone. Dr. Peer is nice but that’s about the only good thing I can say. The recorded lecture videos were just rough.", "rating": 1, "expected_grade": "B", "created": "2022-12-16T04:13:17.674007Z"}, {"professor": "Wendy Peer", "course": "AGST130", "review": "Save yourself the stress. Dont take this class", "rating": 1, "expected_grade": "B-", "created": "2022-12-18T03:50:56.614310Z"}, {"professor": "Wendy Peer", "course": "PLSC275", "review": "Wendy Peer is a nice lady, however her teaching style was completely horrible. She would get quiet and not finish sentences, which made an already confusing course even more unbearable. She would also give us test questions based on extremely minute details from the book she had us read. I read the book and still couldnt answer her questions.  DONT TAKE DR PEER'S CLASS, you will regret it. I dropped the class and I am opting to take regular orgo instead.", "rating": 1, "expected_grade": "W", "created": "2022-12-21T19:41:38.859192Z"}, {"professor": "Wendy Peer", "course": "PLSC275", "review": "Dr. Peer is really nice and always lets me make-up quizzes, but she cannot teach well at all. She doesn't finish problems she is going over and her lectures are excruciating to sit through. If you do have to take her class though, review the learning outcomes for each topic of the weeks and you'll do much better. You honestly don't need to watch the videos if you memorize the learning outcomes, I learned this too late :(", "rating": 3, "expected_grade": "C", "created": "2023-04-26T23:26:19.537809Z"}, {"professor": "Wendy Peer", "course": "AGST130", "review": "AVOID this class if  you just need 3 credits. This class is not designed for people who don't have understanding of basic biochemistry. \r\nAdvantages: ONLINE class\r\nDisadvantages:\r\n1.Mandates to install additional browser that might be an issue for students with older computers.\r\n2.Takes off points on quizzes, if you provide additional correct information. Expects from you STRICTLY specific answer that resonates with hers.Very closed minded. \r\n3. Demands information on quizzes that was not shown on the slides. \r\n4. Makes you work in groups for THREE large assignments. \r\n5. Requires to read textbook, however 80% of quiz questions are from lectures.", "rating": 2, "expected_grade": "", "created": "2023-09-30T15:46:05.882491Z"}, {"professor": "Wendy Peer", "course": "AGST130", "review": "Waste of time. Don't take this class unless you really, really, care about basic biochemistry and history of fermentation, or you don't mind getting a maximum of 90% on every quiz. She converts random multiple-choice questions to text responses seemingly just to take off points on trivial crap.", "rating": 1, "expected_grade": "B", "created": "2023-10-28T04:14:36.337792Z"}], "name": "Wendy Peer", "slug": "peer_wendy"}