{"courses": ["ENEE131", "ENEE132", "ENEE200", "ENEE205", "ENEE381", "ENES100", "ENEE148A", "ENES100A", "ENEE490", "ENEE380", "ENEE380H", "ENEE488", "ENEE381H", "ENEE142", "ENEE681", "EDSP652", "ENEE489L", "ENES481", "ENEB302", "ENEB340", "ENES480", "ENEE140", "ENEB302", "ENEB340", "ENEE205", "ENEE490", "ENES480", "ENEE205", "ENEE381", "ENEE381H", "ENEE396", "ENES481", "ENEE131", "ENEE200", "ENEE200", "ENEE205", "ENEE381", "ENEE131", "ENEE200", "ENEE205", "ENEE381", "ENEB302", "ENEE205", "ENEE382", "ENEE489L", "ENES480", "ENEE205", "ENEE382", "ENEE396", "ENES481", "ENEB302", "ENEE200", "ENEE205", "ENEE489R", "ENES480"], "average_rating": 3.7308, "type": "professor", "reviews": [{"professor": "Wesley Lawson", "course": "ENEE200", "review": "Really don't know what people are complaining about.  I had him in summer 2014 and he was great.  I felt like the homeworks were clear and easy, the 2 papers were fairly short (i actually wrote more on both of them because they were so short), the 2 group presentations were short and straightforward and if you went to class and did the homework the tests were not difficult.  Pretty sure most of my class got an A or B at worst (aside for one guy who almost never came to class).\r\nWhen it comes to the material I think it throws off some engineering students because it requires some out of the box thinking and writing but I thought he was very knowledgeable. I liked the class a lot, my uncle has his own architecture firm and it made me think about the right type of balance you need between managers and engineers/architects and the ethics involved.\r\nI will admit the one negative is that he  mumbles and doesn't speak very clearly but he told us that and apologized for it like the first day of class, still think he's a great teacher.", "rating": 5, "expected_grade": "A", "created": "2014-07-13T12:43:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "Ok professor, He tends to change every semester; one semester he may be a dick and give hard exams, and other semesters he is sane. Lectures vary in usefulness; they were mostly useful in the beginning but started making no sense near the end. I don't think he is as sarcastic as other people make him out to be. Exams were very unpredictable; the midterm was okay but the final had a circuit that counted for 50% of the grade, and if you get part one wrong you got the other two parts wrong. He is really soft spoken and apparently really smart.", "rating": 4, "expected_grade": "B", "created": "2014-05-15T17:08:00Z"}, {"professor": "Wesley Lawson", "course": "COMM401", "review": "This review is for Professor BILL Lawson in the comm department. Lawson is...interesting. He can be funny and does have an earnest interest in his material, but he has a serious lack of professionalism and has crossed so many lines I don't know if there are any left to cross. He curses like a sailor and makes wildly inappropriate jokes for any circumstance. His sense of humor is caustic and oh boy does this man play favorites. Ego is out.of.control. If you aren't on his good list (the criteria for which is undetermined, but if you're an attractive female it helps) be prepared for an uphill battle. He is purposely unclear on his assignment guidelines (to get us thinking outside the box, so he says) and as a rule does not respond to email. Exams are comprised of open-ended essays and a smattering of jargon definitions for words you will never again use. Expect a B in his classes as a rule, although an A could be possible if you're willing to do some *personal* extra credit for it. ", "rating": 2, "expected_grade": "B", "created": "2013-04-24T02:12:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "He speaks softly and does not articulate sentences well. I am not a native speaker of English and at times I had problems hearing him even though I sat very close to the front row (read: one of the front rows). \n\r\nHis lectures were not well organized and not well-paced. He seemed to like to talk about things that were not related to the class during some lectures. However, during other lecture he rushed to cover material that he needed to cover.   \n\r\nDr. Lawson was late to 90% of his lectures (5-7 minutes), which I did not like since I used my own money to pay for the class and I paid in full (100%). ", "rating": 2, "expected_grade": "", "created": "2013-02-02T21:24:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "One of those professors that really tires you out as the class progresses. In agreement with some other reviews, writing prompts and group projects are too vague. He ends up looking for certain things that are not clearly described, and the grades end up being very arbitrary. I was overall fortunate, and this didn't affect me, but looking at other's grades for exams and group projects, they seemed random at times. In the end, you might need a bit of luck to get the grade you want, which is especially annoying considering he is practically closed to regrades. He seems to think he is extremely generous on grading, when really, he's one of the harsher graders I've come upon.\n\r\nHe keeps a fairly interesting class, and is sarcastic at times. Sometimes he starts talking way too quietly for a class of our size. I would probably recommend the winter session, as other people on this page. However, do NOT expect it to be much easier; it's about the same level of difficulty I would guess. \n\r\nReading the book is not completely necessary, but it certainly helps. He has chapter summaries which are theoretically enough. The case studies are crucial for discussion though.\n\r\nAll in all, I would say he does a bad job of teaching this specific course. In my opinion, he fails to catch the heart of the issue of engineering ethics, and further fails to get people interested. I do not regret taking it over the winter, but it was a pain.", "rating": 3, "expected_grade": "A+", "created": "2013-01-23T15:00:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "Knows the material really well and communicates it in an understandable way. He is very sarcastic which I found funny and helpful to shut up the kids who ask too many questions to show off their knowledge. I've heard complaints that he  doesn't teach all the material but his exams are pretty much the same as examples he does in class. So far has been my favorite EE professor.\n\r\nPeople hate on Lawson and say he's rude and unhelpful but those are usually the people who don't put forth their best effort and don't go to his office hours. Lawson is a great teacher especially if you take advantage of his office hours for one on one teaching. Great guy who wants you to get out of UMD with a actual knowledge as opposed to the ability to just pass classes.", "rating": 5, "expected_grade": "A", "created": "2012-11-27T13:29:00Z"}, {"professor": "Wesley Lawson", "course": "COMM330", "review": "This review is actually for William Lawson. OurUMD forwards to this page, so whatever. Overall, Lawson is a decent professor. He's enthusiastic about the material, and he definitely knows his stuff, but I wouldn't say that I learn much from his classes. Lawson is completely fixated on vocabulary. I don't think that memorizing exhaustive lists of communication jargon helps students become better writers, thinkers or speakers. ", "rating": 3, "expected_grade": "A", "created": "2012-10-27T20:59:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Class is very easy. Took it over winter. Schedule was rigorous, about five hours a day, five days a week, but the material its very comprehensible. Readings are short and easy. Two papers that are short, and two group projects that are pretty easy. Participation is relatively important. Midterm and Final are easy as well. Give effort, and an A is yours.", "rating": 5, "expected_grade": "A-", "created": "2012-06-01T13:27:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "This review is also for ENEE204 with Lawson, as I had him for both.\r\nLawson has a personality as described below, being sarcastic and fairly blunt.  He teaches his classes the same way, however it is not as bad as others have described below.\n\r\nThe biggest thing about Lawson is you cannot bs your way through the class.  He is very knowledgeable in the subjects he teaches, and can tell whether you know the material or are just rambling.   He does have a sense of humor, however sometimes you are on the other end of the joke.  If you take it personally, than you might not like him, but I don't think he ever truly dislikes a student.\n\r\nAll it comes down to with any class he teaches is you need to study.  His tests have subtle tricks that catch you if you're not paying attention, but I have never been given a question that was not similar to one we have done before in a homework or class example. He is not 'impossible', unless you don't study ", "rating": 5, "expected_grade": "A", "created": "2012-02-16T18:31:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Had him for 200 and 204. He expects a good deal from his students. In 204, he emphasized concepts and intuition in homeworks/quizzes/exams but not so much in lecture, which would have been preferable.\n\r\nENEE200 was a frustrating class since he would often assign rather vague writing prompts for essays and exams, but grade according to specific expectations he had in mind. Grading on exams and essays seemed, to me, very arbitrary.\n\r\nHe's a funny guy, but not my favorite teacher. Both of my experiences with him were not the best, but I can see how some might really like him.", "rating": 3, "expected_grade": "A", "created": "2011-12-30T12:12:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "Very sarcastic, yet he WILL teach you the material. Most of the complaints I heard from my peers was how he didn't teach us anything, but in my opinion, those same students were pretty lazy. If you're not willing to do the HW, don't expect a good grade on exams or quizzes. It's common sense.\n\r\nOverall, he was unprepared at most times, yet I felt like I learned alot about basic circuitry this semester. If you're thick skinned and you're willing to work hard, expect an A", "rating": 4, "expected_grade": "A", "created": "2011-12-24T16:58:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Terrible professor. Soft spoken and doesn't care about students. Not be fooled by the grade distribution. The A's is only about 20% of the class realistically for ethics. Looks for specific terms in every answer. Will take off all points if you dont have the specific answer that he has.", "rating": 1, "expected_grade": "BC", "created": "2011-11-16T23:14:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "I'm not sure what the two people below are talking about. Maybe that was some crazy class but i assure for Comm classes HE IS AWESOME! \n\r\nI just had him for a summer course and it was such a chill class. And this is not just me talking, I asked older students in the class who'd had him before and they loved him. Honestly if you have any motivation to do well you will. He asked us to do a lot of readings but he quizzed very broad because he's a nice guy. I think he is also very insightful and passionate. He's also hilarious and an out of the box teacher in the best of ways. I really enjoyed this class  and would definitely recommend people taking him! We watched a lot of good movies and read interesting books. Especially take his summer/winter classes. He is much more lenient with everything then!", "rating": 5, "expected_grade": "A", "created": "2011-07-27T14:50:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "Last semester with Lawson was a train wreck, which is sad considering how misleadingly well it had started.  Lawson always seems to be able to brighten your day....you know, that is, right up until he crushes your soul on his exams. I was actually very interested about 204 and, believe it or not, did about 3 weeks of studying before the start of classes. However, Lawson made doing well on tests virtually impossible. Despite my best efforts, I ended up with a B in a class I was very knowledgeable about. \n\r\nI very rarely take time out to rate professors because I find that people often exaggerate and whine instead of giving themselves enough time and doing the work. Lawson is a special case and I sincerely hope that last semester does not reflect what former (and future) students have to go through under him. Otherwise, if at all possible, I would suggest waiting a semester, taking care of cores/technical electives, and then taking Davis in the spring.", "rating": 1, "expected_grade": "B", "created": "2011-07-26T22:51:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "I agree with most of what the other people have said, but I think they are being too harsh on Lawson. \n\r\nCons: His class is hard and you will work around 5 to 6 hours a week on homework. The quizes can be tricky and you can't just do well on them by memorizing. You really need to understand the material to do well in the class. Also the midterm and final are really hard and you will really need to study a lot for both.\n\r\nPros: His class is really interesting and he keeps the class attentive. I had him at 9:30 and I never was tired during the class. He is constantly calling on people and waiting for students to answer. He doesn't just lecture you till you fall asleep. \n\r\nOverall, if you want an easy semester definitely take Davis. I've heard his class is signficantly easier. You'll learn a lot from Lawson but you will be putting in a lot of hours of work for him.\n", "rating": 3, "expected_grade": "B", "created": "2011-07-21T16:48:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "Terrible professor. Makes the workload much harder and much more time consuming than it has to be. There are very few opportunities to do well in his class as evidenced by the only midterm. His tests are too difficult -- and btw making the final a little more manageable DOES NOT redeem an entire semester's worth of unpredictable quizzes, homeworks and an impossible test. To make things worse, Lawson is very arrogant and condescending; it's ironic that someone with this much experience and knowledge would have such child-like character flaws; a real shame that all of next semester's students will be stuck with him. Overall, a very poor choice for ENEE204 and most likely ENEE205.  ", "rating": 1, "expected_grade": "D", "created": "2011-06-11T22:13:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "Lawson is by far the worst professor I have ever had at UMD. The ONLY good thing I've gathered so far about him is that he's your man if you really want to learn. Let me be clear on this for all of the people who share that view: YOU END UP LEARNING EVERY SINGLE THING THAT HE COULD POSSIBLY TELL YOU!!!! Everything from op-amps to semi-conductors to transistors, to understanding how circuits work in general. This is a 200 level course for God's sake!! It's not a job or an internship!!! There's such a thing as 300/400 levels if you hadn't quite noticed yet. So the late hours doing homework, the impossible midterms and his whole asshole persona make you beg the question: Am I really so dumb that I would let this clown ruin my GPA?\n\r\nAnd the thing is, there really aren't any redeeming qualities about his class. He doesn't care nor try to help (never shows up to office hrs), his tests are impossible and unfair, and he doesn't like giving partial credit (only does so to keep the average a 50 rather than a 30). As you can see, the overall theme here is you CAN'T WIN! When a teacher both hands you a hard test AND grades unfairly, you're screwed. I've never met a teacher who did both which is why I always managed the A or B. Now I'm stuck with a C for wanting to be an overachiever. I was shocked to see so many good reviews on here for 204 but, then again, most of them were in 08/09 when he was perhaps still sane. \n\r\nAll in all, I strongly recommend avoiding him. If you do though, please refer to this page at the end of the semester and reflect on what you did as you read this:\n\r\nYOU HAD BEEN WARNED. IT'S YOUR FAULT.", "rating": 1, "expected_grade": "C", "created": "2011-06-07T17:09:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "Dr. Lawson is an extremely intelligent professor, but in my opinion he is not a very good teacher. \r\nIn the class there were weekly homework assignments, weekly quizzes, one midterm and one final exam. \r\nHe has very high expectations for his students and, in my opinion, only shows respect to those that meet them. The average midterm was 49. He is not fond of partial credit. Supporting what the previous reviewer stated, he relies heavily on conceptual and theoretical analysis of circuits. In my opinion, this made the class much harder. I learn from repetition and there wasn't much of it as far as the practical problems were concerned. He was a very difficult teacher for me in that he discouraged me from  asking questions because he would make jokes of them in front of the class, he would not show up for his office hours and when he would make them he would rush your time and make you feel little for not knowing such a “simple concept”, and his exams (only the midterm I should say) were nothing like the previous semester that he would post online. There is no easy A here, nor B, nor C. I worked very hard to earn my C. He has no tolerance for exceptions, make up work, any of that. His final email to the class ended in, and I quote, “The grade you get in this class will be the grade on your transcript until the end of time.”", "rating": 3, "expected_grade": "C", "created": "2011-05-27T15:21:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "The reviews written by most of the students below (except maybe for the last post) are astoundingly inaccurate. To be honest, I really wanted to fry Lawson for all the evil things he did to us during the semester but for the sake of credibility and actually helping the students who read this, I will try to be impartial.  \n\r\nPros: Lawson is one of the smartest guys you will ever meet. He is incredibly knowledgeable about literally anything circuit-related and, to be fair to him, he's probably one of the better lecturers the Clark School of Eng. has to offer (though the bar is set extremely low in EE). Also, if you suck up to him enough, he will give you marginally helpful advice for quizzes and homework. Lastly, the material he focuses on is very conceptual in nature which helps you learn a lot of interesting phenomena. \n\r\nCons: This guy is DEFIANTLY lazy, careless, and disorganized. He literally dares you to call him out on his antics just so he can insult your intelligence and give you whichever grade he feels like giving you -- and once he does, he just ignores your pleas every single day onwards. And, trust me, you're absolutely powerless in stopping this -- he is held in very high regard in the EE department and is practically untouchable (seriously, if you think i'm joking/exaggerating, ask around and you'll see)  \n\r\nAdvice: Unless you are taking 12 creds or less, taking Lawson is suicide. He doesn't show up to office hrs and gives hw that even TA's can't figure out at times. Moreover, there is only one midterm and it is wildly unpredictable - seriously it will crush you mercilessly. The best you can hope for is being above average -- the average on our midterm was a 49 as calculated by Lawson himself.  People often see him as a funny, goofy guy which is, I think, why he still has a loyal following -- but ultimately you find that he doesn't really care what happens to you unless he likes you. \n\r\nDon't be a hero. You're EE/CE, you deserve a break. Make your life easier. Pick Davis. ", "rating": 1, "expected_grade": "C-", "created": "2011-05-25T20:20:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "I just finished taking Proessor Lawson's ENEE204 class. He very heavily focuses and the conceptual aspect of the class (explain the physical meaning behind the inductor, capacitor, transients, etc.) which can be very annoying, as he spends no time on this in class. His exams were very hard (class average for the first midterm was a 50, compared to Davis's 85ish averages). He is also kind a dick, and likes to shoot kids down when they ask questions and I'm sure discourages some kids from asking questions. He is also consistently late and does not hold to his promises. Seems very unorganized (didn't upload answers to practice exams because he couldn't find them?)\n\r\nGiven all of that, he is a pretty good teacher. He goes by the book (which he wrote, which helps) and his lectures are definitely worth attending. Also, if you see him in office hours, he is MUCH nicer than in class. He will really open up, and you can ask almost any question and he will provide a solid answer.\n\r\nOverall, the class was not a breeze at all, especially when I talked to friends in Davis's class. Looking for the easy A? go Davis. Looking to learn a lot? Go Lawson.", "rating": 4, "expected_grade": "A", "created": "2011-05-17T17:21:00Z"}, {"professor": "Wesley Lawson", "course": "COMM330", "review": "Lawson was the best professor I ever had at UMD. If you get the chance to take a class by him, DO IT! Even if the class seems like a boring subject - he will make it fun! He makes you laugh EVERY class. Very fair grader. No final exam, just a group project that wasn't too bad! ", "rating": 5, "expected_grade": "A", "created": "2010-12-21T13:29:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "Professor Lawson is the most compassionate professor out there.  He is an amazing professor for ENEE204.  I would 100% choose him over Prof Davis.  I saw Prof Davis's ENEE204 homeworks and they were WAY WAY more complicated than Prof Lawson's homeworks. \n\r\nIn addition, if you go to Lawson at office hours he will literally GIVE YOU the answers to homeworks.  His exams are also pretty easy.  A HUGE Plus for Lawson is that he teaches from his own book!  Meaning, if you ever need to skip a lecture just go over that section from the textbook!  \n\r\nI would def recommend him over Davis.  ", "rating": 5, "expected_grade": "A+", "created": "2010-11-26T22:58:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Ok class, ok teacher, more reading than I would have expected, but it wasn't bad.", "rating": 4, "expected_grade": "A", "created": "2010-11-16T02:30:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "I would say Lawson is a pretty good professor. He's fair and he explains the material pretty well. But he shows up late a lot, which I find stupid because he doesn't give you points and mark you in when you show up late. I was late only once! That, and you have to say, \"Good Morning Professor Doctor Lawson.\" But as a professor, I would say he's not bad.", "rating": 5, "expected_grade": "B", "created": "2010-02-02T15:56:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "Lawson is an incredible teacher. Definitely take him for 204. He goes over the material very well and is happy to answer any and all questions that you have. I took this course during the summer, so i expect it to be quite different from the regular semester. His exams/quizzes sometimes require you to think slightly differently from his class examples, so dont take his examples for granted", "rating": 5, "expected_grade": "A", "created": "2009-08-01T15:32:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "Well..he IS a very great prof..but he likes to make jokes during class, and sometimes doesnt have enough time to cover all the material.and those jokes are not funny.it will be even better if he just focus on the lecture.", "rating": 5, "expected_grade": "A", "created": "2009-04-14T21:45:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Professor Lawson was amazing. He reviewed all material supposed to be covered in homework and none of his exams or papers were easy. Even the group project was a simple task. However, this is based off of having taken the course in winter. Either way I would highly recommend taking Professor Lawson.", "rating": 5, "expected_grade": "A", "created": "2009-01-28T16:23:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "The class was really easy.  The prof was really good.  He was not a hard grader for HW's and papers.  The test were easy and even if you did not do well he curved them.  \n\r\nDrawback: there were two group projects that were annoying.  I ended up doing a lot of work while the other members slacked on the group projects.  Some group members didn't do anything so the group as a whole suffered because during presentations its was clear they didn't know what they were talking about.  I barely got an A and it was because of the group projects.  IF there weren't any group projects i would have less work and gotten a better grade.", "rating": 5, "expected_grade": "A", "created": "2008-05-24T13:37:00Z"}, {"professor": "Wesley Lawson", "course": null, "review": "Lawson is a good prof.  The class was straight forward, he wasn't sneaky or devious on the exams.  I do recommend going to all of the review sessions prior to exams, they are extremely helpful.  If he does throw in something rather ugly on an exam he'll usually do something similar to it during the reviews.", "rating": 4, "expected_grade": "", "created": "2008-05-23T10:54:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE380H", "review": "Very reasonable, very awesome professor. The kind of guy you could talk to casually. Makes jokes and interacts with class. Isn't afraid of \"dumb\" questions, and you can interrupt him at any time. If you do your homework, maybe read the (optional) book or his uploaded notes, you will be in good shape. \r\n\r\nHe even gave my class a 10 percent boost because we all came in wearing T-Shirts with Maxwell's equations on them!\r\n\r\nI wish I could have taken him for ENEE200 as well. ", "rating": 5, "expected_grade": "A", "created": "2018-01-13T20:16:58Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "Lawson is a pretty great professor. I thought his lectures were strong and the homework was challenging just enough to make you learn. Exams were pretty reasonable. My enjoyment of the class inspired me to pursue micro as one of my specializations.", "rating": 5, "expected_grade": "A", "created": "2018-12-18T23:13:50Z"}, {"professor": "Wesley Lawson", "course": "ENEE380", "review": "Lawson makes 380 a painless experience. Extends homework deadlines, has a handy set of lecture notes and makes reasonable exams (excluding our first midterm). On top of that, he curves as well. Also has a sense of humor to keep the class engaged. ", "rating": 5, "expected_grade": "A", "created": "2019-12-16T15:43:13Z"}, {"professor": "Wesley Lawson", "course": "ENEE380", "review": "Lectures are not well taught and do not teach me much useful information. Hope for a good TA as it would be quite helpful. Grading is fair, with ample extra credit provided.", "rating": 3, "expected_grade": "B-", "created": "2019-12-21T18:19:42Z"}, {"professor": "Wesley Lawson", "course": "ENEE380", "review": "Grading was arbitrary and was completely unwilling to consider otherwise. I do not believe he actually grades the exams, rather he looks at your name and decides a score based on the grades you received on previous assignments. Other students had the exact same answers on multiple questions, yet received either much higher or lower grades for the exact same answer.\r\n\r\nLecture style is a mess, nearly impossible to follow.", "rating": 1, "expected_grade": "A-", "created": "2020-02-13T20:29:58Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "Lectures were pretty boring, as he just read off the slides through various circuit examples. That might have been due to a lack of class participation online, but I could not remain engaged in most lectures. As for the rest of the course, Lawson made it pretty easy. Quizzes and the final were fair and the content of each assignment was clearly communicated to the class. The overall grading for the course was confusing and not clear to the class, but Lawson granted a small curve in the form of extra credit opportunities. The course material can be challenging, and you have to put in time and effort if you want to succeed in this course, but it is not too difficult. Overall, a fair professor that rewards students who are willing to put in the effort and show they want to learn.", "rating": 4, "expected_grade": "", "created": "2021-01-11T23:03:58Z"}, {"professor": "Wesley Lawson", "course": "ENEE380", "review": "I've taken many classes with Lawson and he's one of my favorite professors in the ECE Department. ", "rating": 5, "expected_grade": "A", "created": "2021-05-04T17:29:47Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "He is nice and a very fair grader. Has a sense of humor. Told us in advance what would be on the final, which was helpful.", "rating": 5, "expected_grade": "", "created": "2021-05-21T16:18:04Z"}, {"professor": "Wesley Lawson", "course": "ENES100", "review": "Lawson is a pretty chill guy, who tries to teach the course at a pace that actually helps you learn the material without feeling pressured by the deadlines.\r\n\r\nHowever, when it comes to teaching the course itself, I would say the TA was more of a professor than Lawson. \r\n\r\nStill, he's a pretty chill guy and I did enjoy going to this class.", "rating": 4, "expected_grade": "A", "created": "2021-12-21T01:49:56Z"}, {"professor": "Wesley Lawson", "course": "ENEE490", "review": "Took Lawson for 381 and 490, and will be taking him again for 489L. This will mainly go over his 490 class.\r\n\r\nLawson is one of my favorite professors in the ECE department. I found that his instruction can be dry at times when he just reads off his slides, but he is always good at explaining and clarifying things. He also made his classes very manageable in terms of workload, and gave out fair exam problems. Our final was take-home, and the midterms were open note/electronics (laptops allowed!). He always provided previous exams (some with solutions), so that was helpful too. He is very approachable and friendly, with a sense of humor that catches you off-guard with how unpredictable it can be sometimes (for the better). \r\n\r\nHe was also really generous with extra credit. He would often break us into groups to work on a problem, and then 2 groups would both get the correct answer. In this case, both groups would get extra credit, and the first to get the answer would get slightly more allocated to them proportionally. ", "rating": 5, "expected_grade": "A+", "created": "2022-01-15T05:39:16Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Disclaimer: I took this class over the winter.\r\nProfessor Lawson teaches ENEE200 well. I was already familiar with his style, and enjoyed it through the 3 short weeks of the class. Though the lectures were long and sometimes redundant, I'd rather take it with him than someone else because of his comedy and care.", "rating": 4, "expected_grade": "", "created": "2022-01-23T00:08:42Z"}, {"professor": "Wesley Lawson", "course": "ENES100", "review": "ENEE100 requires a lot of time and energy, and Professor Lawson made the experience more fun. He's witty and a good lecturer. Definitely will take him again.", "rating": 4, "expected_grade": "A+", "created": "2022-01-23T00:08:58Z"}, {"professor": "Wesley Lawson", "course": null, "review": "This was Lawson's first year and hopefully his very last teaching ENEE140. Waking up in the morning and knowing he was the first professor I had to see literally drained everything out of me. He is a horrible lecturer, mumbles, and his slides do not help me learn at all. The only reason I am passing his class is that I had an amazing UTF who was patient and kind. If I had a better professor I would've enjoyed this much more.", "rating": 2, "expected_grade": "", "created": "2022-04-18T03:18:25Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "Chicken scratches on slides and talks like he's half asleep for the entirety of the boring lecture. Nobody can read his lousy handwriting on graded assignments, and he is exetremely bad at teaching because he mumbles his way through the lectures.", "rating": 1, "expected_grade": "A-", "created": "2022-09-13T18:31:59.603925Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "I took this class the previous summer with Dr. Lawson, and I gotta say, it's not that bad of a course if you're already an engineering student. For starters, there's no heavy math, or math at all, and it's really just a philosophical discussion every lecture. We didn't have discussions during the summer session, instead, we'd openly discuss as a class the different readings we'd have to read right before. Participation was fair and honest as long as you said something, you got points.\r\n\r\nThe writing prompts on the final exam were somewhat vague; even I got points off because apparently I \"misinterpreted the question\". But as long as you're able to regurgitate the appropriate material based on keywords you'll see, you'll be fine. Overall, this class is light work, and the professor is quite boring at times, but at least it's not gonna give you any trouble. Keep up with the readings, say 1-2 things each class, clearly articulate key concepts and terms, and you'll get an A+.", "rating": 5, "expected_grade": "A+", "created": "2023-01-07T05:48:51.663229Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "Lawson truly wants his students to succeed. Even though the lectures may seem boring, he wants students to really collaborate/participate when he asks questions. His class format is also really nice as there are only 10 quizzes in the class and a final at the end. He basically gives the question that will be on the quiz if you attend class and the topic so you don't have to study too much for those. The final he basically gave all the questions and went over them in class the week before. Just attend class even if it seems boring cause he drops hints and answers for everything he grades while lecturing.", "rating": 5, "expected_grade": "A+", "created": "2023-01-15T06:15:12.670515Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "I took the winter session, so every day was equivalent to a normal semester week. The daily homework was to read case studies about sketchy/unethical incidents (usually ~4 pages of reading) and write a paragraph about them. There were a few quizzes, an independent paper (2-3 pages), a final exam, and two group projects. Dr. Lawson always drops hints (or even whole quiz questions) for what he's expecting, and the instructions are always extremely clear. He does have a tendency to mumble/slur some types of sounds, which *may* be difficult to understand if you have a hearing impediment. The course content can be dry at times, but he really tries to engage people and relate the content back to real life examples. You will get the most out of the class if you TALK. If you don't make the effort to engage, then this will be a terribly boring class (but you can still get a good grade).", "rating": 5, "expected_grade": "A+", "created": "2023-01-24T22:26:14.059030Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "Beyond goated tenured professor. He's been teaching the course since they invented sliced bread and knows the best way to present the content. He wrote a very good textbook on introductory circuit analysis two decades ago which serves as a good reference, but he provides everything you need to master the course through slides, homeworks, and lab assignments. Extra credit points and privileged information about quiz and exam questions are handed out like candy to those who actually bother to come to lecture.\r\n\r\nI struggled a lot with learning circuits and Lawson made the course minimally painful. He's also very funny and approachable. Five stars.", "rating": 5, "expected_grade": "A", "created": "2023-05-15T04:07:28.474674Z"}, {"professor": "Wesley Lawson", "course": "ENEE381", "review": "Probably the best person to take 381 with.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T03:04:23.937966Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "Lawson is an amazing professor. He does not give midterms, practically hands out answers to the quizzes in lectures, gives extra credit points for just showing up to lecture and participation, and is a pretty funny guy. I had a great time in this course and I highly recommend that you take Lawson. If you show up to lecture you are set to get an A. And if you go to a couple of office hours with a TA or Lawson, you will definitely get an A. The answers for this class are handed out in a way that pretty much guarantees you a passing grade and guarantees that you will learn something.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T10:52:17.247271Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "If there are two things you should know about Lawson before going in, it's that he is kind of particular about certain things, and he can have a bit of a sharp tongue in writing.  For example, for quiz 6, despite the fact that the nodal analysis matrix equation is derived from KCL, you get a 0 for the quiz if you derive it from KCL.  I'm not a big fan of that.  For our final exam, he put it very bluntly (and with quite a disappointed tone) that no one got the extra credit, and that exam performance was... very likely worse than usual to say the least.\r\n\r\nFor some other things I didn't really care for in the class, the part of his lectures where he reads off slides are dull.  He doesn't really add much to them except in the rare case he uses a slide as a springboard for a solved example.  Quite frankly I didn't go to a lot of lectures towards the middle, due to a combination of an unreasonably long sickness, the 9:30 start time, and the fact I didn't really get much from them.  I mostly learned through the material through the TA James, who was the GOAT.  Also, homeworks can be quite annoying, and the solutions he provides to TA's don't really help them help us during office hours.  Finally, most things about the labs are awful, from the equipment malfunctions which are difficult to diagnose, to the boring lab procedures which get especially bad regarding the several frequency sweeps performed in the filter labs, to the tedious lab reports themselves.  I believe this is a universal 205 and 245 problem, so I won't hold this against Lawson specifically.\r\n\r\nThat's about it.  Lawson is a good professor for 205.  The use of 8 quizzes across the semester instead of midterms is really nice in reducing stress around what's typically midterm season for other classes (and one of them is dropped according to the syllabus).  The worked examples in class are pretty good.  There's typically a bit of looseness regarding student-professor interaction, with plenty of comedic moments to speak of in the class.  I don't know what else to say.  I can see why people wouldn't like Lawson, but in spite of my issues, I can't say I'm one of the haters for his teaching of 205.", "rating": 4, "expected_grade": "A", "created": "2023-12-17T03:46:13.624635Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "I'm currently taking this class in Winter 2024, and I'm really not enjoying it.  I tried to adjust my rating for personal bias, but I just cannot compromise my final verdict based on many unfavorable factors.  From what I've heard, Lawson is about the best you're gonna get from ENEE200, so take what you will from this review.\r\n\r\nFirst on the list of personal biases, the class is 3 hours a day for 3 weeks.  ELMS lists 2 hours of lecture and 2 hours of discussion, but in reality it's 3 hours of Lawson's lecture per day, with a 15 minute break somewhere in between.  I have grown increasingly impatient to lectures over the course of college, and even with taking ENES197 last winter, this class is somehow even more of a slog.  Admittedly, there are some pretty interesting stories shared, and the class can get pretty interesting to engage with regarding certain topic discussions.  However, this is not enough to make the class not unbearably dull for me most of the time.  Furthermore, Lawson makes us have our cameras on unless there's a valid excuse, and he states that he retains the right to take off attendance credit for having cameras off.\r\n\r\nSpeaking of, the grading.  If you've had Lawson before, like I did for 205 this past semester, grading will be pretty familiar.  The grade is split into 5 equally weighted parts: participation, homework and a paper, quizzes, final exam, and group project.  One quiz and two homeworks are dropped, and the quizzes and final are theoretically closed book closed notes.  I have issues with three of those components.  Starting with participation, it's not really clear what constitutes a good or bad participation score.  I got a 9/10 for participation 2, and an 8.5/10 for participation 3, both of which are below the mean, and I have no idea why.  I think he mentioned vaguely mentioned some form of criteria on the first day, but there's no rubric, so I can't tell if it's because of internet issues potentially causing my camera to not display sometimes (it always displays on my screen), or if it's because I really struggle to pay attention in class, or what it is.  Regarding the quizzes, they're a mixed bag.  Quizzes 1, 2, and 5 are fairly straight-forward multiple choice affairs, where 5 questions are worth 20% of the quiz each.  3 attempts are given.  Quiz 3 is an open response on line drawing.  Quiz 4 is an open response on conflicts of interest.  Some issues.  I fundamentally disagree with the use of assessments in this course.  They made sense in 205, since each quiz had a corresponding homework.  While some quizzes did go beyond the homework content, we could generally gauge our progress on a quiz's topic from the corresponding homework's feedback.  That is not the case in this class.  I found the homeworks did not correspond well to either quiz 1 or 2, and nothing at all correlated to quiz 3.  Quiz 3 in particular went poorly, as the class average was pretty low (for transparency, I got lower than the mean), but we only got 2 examples of how to do a line drawing (one incomplete example from the slides, and one pretty bad example in lecture).  Yeah the quiz was probably pretty easy, but it's just testing on something where you either memorize a chart or you don't, and it seemed like there was no in-between.  Speaking of, for quiz 4, which I haven't taken yet, we have to memorize specific facts about one of the case studies, and regurgitate conflict of interest information about it.  I don't know how this will turn out, but this accomplishes absolutely nothing.  In fact, none of these quizzes do, and neither will the final exam.  Why are there examinations in an ethics class?  Sure, there are incorrect ways of analyzing a situation.  However, the mere presence of highly weighted examinations imply that there are objectively correct ways of analyzing situations, which is simply not true in any situation with any sort of complexity.  It boils down ethics into algorithms or correct/incorrect answers, which I believe is poor design.\r\n\r\nIn terms of the day-to-day work, there is homework due almost every day, and some of it can get pretty tedious.  However, it's not the worst thing to keep up with, and that's coming me who can't write to save my life outside of the last minute.  Some days are worse than others, but if I had to put a total, it's about an additional hour each day, give or take.  I haven't started my personal paper or group project yet, so that number could probably increase to 2 additional hours per day if you pace yourself well, but I'll probably have to take 3 or more per day this upcoming week since I'm rather behind on those assignments.  It's a winter course I guess.\r\n\r\nI really wanted to like this class.  I gave Lawson 4 stars for 205, and that was in spite of hating the labs.  However, this class is just tedious, and I disagree with his grading methods for this class on a fundamental level.  I realize that I'm writing this review before the end, but I'm at the point where I know this professor and I know this class well enough to know that I thoroughly hated this class.  I've unfortunately had multiple worse classes in the ECE department, but this was certainly not a highlight.  However, this is just my experience.  You may like this class because you like the way Lawson does things, the way he runs things clicks better with you, or simply because he sometimes has interesting stories to tell, and some of the classes have had interesting moments.  You may hate the class more than I do for different reasons than what I brought up.  All I know is that, in my opinion, ENEE200 is a sad state of affairs.", "rating": 2, "expected_grade": "", "created": "2024-01-14T11:13:58.603180Z"}, {"professor": "Wesley Lawson", "course": "ENEE205", "review": "His lectures are ridiculously quick. The homeworks are super difficult. There's too much work to place into the prelabs. Not even the TA's know how to solve half the homework questions. His lectures are super boring. He doesn't do a good job at explaining anything at all regarding course material. He must think the class is filled with geniuses because he says things as if it's obvious - it's not. I don't even know what grade I'm expecting from this class, because usually I'd get an A but his class is only getting harder as the semester progresses, and the class makes less and less sense.", "rating": 1, "expected_grade": "", "created": "2024-03-04T04:02:35.392926Z"}], "name": "Wesley Lawson", "slug": "lawson_wesley"}