{"courses": ["CMSC422", "CMSC421", "CMSC801", "CMSC800", "CMSC421"], "average_rating": 3.5, "type": "professor", "reviews": [{"professor": "William Regli", "course": "CMSC421", "review": "Regli started out seeming like an accomplished and interesting professor, but as the semester went on that facade faded. He is one of the most disrespectful professors I have ever had. The first programming assignment he gave us had 3 conflicting sets of instructions, took the longest of any cs project I've ever taken (for some people ~40+ hours), and was detrimentally open ended, which is something I normally appreciate. His exam questions are extremely vague and have no clear answer. You can know your stuff and still fail the exam because you have no idea what the questions are asking. Overall this has been the least organized and most condescending class I have ever taken. Regli sees himself as above the students and above the class. He has not dealt with the material in 30 year and when pressed on an answer will just try to make you look stupid. Take this class if you have to, it won't be the end of the world, but you will probably hate him and the class.", "rating": 2, "expected_grade": "", "created": "2022-04-06T18:35:40Z"}, {"professor": "William Regli", "course": "CMSC421", "review": "Professor Regli is a very considerate professor as he has been both lenient with grades and deadlines. His projects can be a little challenging (and the first one was a little too open ended - but by fault of one of the TAs), but they are fair and teach you a lot more about the concepts in AI than just the slides alone. For his exams, while they are a little more on the challenging side, they have generous curves (as an 82% on one exam translated to an A). As far as workload goes, it should be pretty manageable since there are 3 programming assignments and then 3 (much smaller) homework assignments throughout the whole semester. He recommends that you read the textbook and do practice problems, but this is mostly supplementary imo (and probably not worth the extra effort). I disagree with the comment about him being disrespectful as he has always been eager to help and connect with me whenever I've reached out to him during/after class. My only complaints about Regli are that it can be a little hard to follow along with him during the lectures because he goes over a lot of content in small amount of time, without pausing to do practice problems or repeating the content, which makes it hard to retain the information. Overall, I'd recommend Regli as he does care about the content and you having practical takeaways from CMSC421.", "rating": 5, "expected_grade": "", "created": "2022-05-16T17:07:00Z"}], "name": "William Regli", "slug": "regli"}