{"courses": ["ENGL101X", "ENGL101", "UMEI007", "ENGL101S", "CMLT280", "FILM298D", "ENGL202", "CINE280", "CMLT280"], "average_rating": 4.7, "type": "professor", "reviews": [{"professor": "William Pittman", "course": "ENGL101X", "review": "Will is an awesome professor. He makes everything fair. There are not too much assignments. And he did teach me a lot. Also, because he asked us to \"socialize\", I also made a lot friends in his class. BTW, I'm not an English native speaker, but he is very patient although sometimes I may have horrible pronunciation. ", "rating": 5, "expected_grade": "A", "created": "2020-05-18T05:45:25Z"}, {"professor": "William Pittman", "course": "ENGL101", "review": "Pittman made the class super interesting and I learned a lot from him. It was not your traditional engl101 class because he taught it through reading a book about Buddhism. I would recommend him highly to any incoming freshman who needs to take an english course. He's also a really friendly guy who loves to tell stories.", "rating": 5, "expected_grade": "A", "created": "2021-08-10T21:38:20Z"}, {"professor": "William Pittman", "course": "ENGL101", "review": "William Pittman is a great professor. This is not your traditional ENGL101 class. He teaches about Buddha's teaching and how it would apply in the real world. He leaves helpful comments on the papers as well. Highly recommend him. Plus he does music on the side.", "rating": 5, "expected_grade": "", "created": "2021-12-09T17:17:09Z"}, {"professor": "William Pittman", "course": "ENGL101", "review": "Pittman is the GOAT! Go to his office hours if you're struggling. He really helped me. I learned a lot and actually enjoyed the readings he assigned for homework. Learn essay structure because that is how he grades. Overall, the A was not easy to achieve... he is a tough grader but his comments are very helpful. ", "rating": 5, "expected_grade": "A", "created": "2021-12-17T22:16:51Z"}, {"professor": "William Pittman", "course": "ENGL101", "review": "Pittman's class just makes sense. Little to no homework. Makes the most of class time. Explains exactly what he wants for every assignment. This class is just a joy to go to and learn in. You will not regret taking Professor Pittman. ", "rating": 5, "expected_grade": "A", "created": "2022-05-09T23:37:52Z"}, {"professor": "William Pittman", "course": "ENGL101", "review": "This is probably the easiest english 101 course you can take at UMD, largely because of how great pittman is as a professor. He simplifies writing and makes it clear what he expects from you for every assignment. I would definitely recommend taking pittman. \r\n\r\nAs a side note, this class focuses on a book called \"What the Buddha Taught\" for a few assignments so just know that going in.", "rating": 5, "expected_grade": "A", "created": "2022-05-10T17:53:01Z"}, {"professor": "William Pittman", "course": "ENGL202", "review": "Professor Pittman is one of my favorite professors of all time. I believe this was his first semester teaching a literature class, but the guy knows his stuff. And he knows how to teach. Classes were only discussions, with a socratic set up of the desks. You really have to read (or at least skim the readings) to know what's going on, but Pittman provides his own notes on the readings which clarify a lot so this isn't too much of a task. He's so kind and approachable, and so willing to help. He is not a harsh grader whatsoever; if he sees that you are understanding the concepts and able to think creatively and putting forth SOME effort, he will give you an A. ENGL101 is a different story since it is a composition class and it is more technical, but ENGL202 was a literal dream. Fave class ever, fave professor ever. ", "rating": 5, "expected_grade": "A", "created": "2022-05-19T03:24:33Z"}, {"professor": "William Pittman", "course": "CMLT280", "review": "Will is really funny and interesting to talk with during the discussions we had in class. I think a lot of people took this class really unseriously because no one would show up to the Friday classes or they would come late in general. Make sure to go to class and remember to do the discussion boards because they don't show up on canvas and they're due at 7pm because that's 60% of your grade. You don't even have to talk that much in class just show up on time and do the assignments which are just the discussion boards and 3 short essays.", "rating": 4, "expected_grade": "B", "created": "2023-12-15T15:43:11.095490Z"}, {"professor": "William Pittman", "course": "CMLT280", "review": "The class was very unorganized and he did not follow the syllabus at all. 30% of our grades complied of discussion board posts but he did not make that clear at all and made it seem like they were optional. Furthermore, these discussion board posts also weren't counted as \"assignments\" on elms so you can VERY easily forget about them because I use the calendar on elms to ensure I've done all my work and the discussion board posts don't show up because he doesn't put them as an assignment. Furthermore, he doesn't follow the syllabus at all and kind of reconstructed our class. Also, we didn't see our grades AT ALL the entire semester so we didn't know what we were doing wrong or how we were standing in the class. We were only given grades on our papers that we had to write for films. Will is a very nice guy and understanding but the way he structured this class was very bad and could have been done a lot more organized. If we were given a clear outlook of how this course would've been structured, it would have been a lot better.", "rating": 3, "expected_grade": "B", "created": "2023-12-15T16:01:01.786919Z"}, {"professor": "William Pittman", "course": "CMLT280", "review": "Cool class (CMLT280). He's very enthusiastic and the class is participation based. As long as you watch the movie before class and say something, you'll get an A. If talking in class is stressful, you can talk more in discussion boards. The essays (we had 2) aren't stressful either; he makes his standards clear and simple. You generally have 1 movie per week. 2 if one or both are shorter than the standard 2 hour length.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T22:51:59.817321Z"}], "name": "William Pittman", "slug": "pittman"}