{"courses": ["MATH141", "MATH241H", "MATH401", "MATH241", "MATH475", "MATH141H", "CMSC475", "MATH310", "MATH340", "MATH140", "MATH341", "HONR279T", "MATH299T", "MATH240", "CMSC456", "ENEE456", "MATH456", "MATH299J", "MATH240", "MATH299E", "CMSC398D", "CMSC475", "MATH240", "MATH241H", "MATH340", "MATH475", "CMSC475", "MATH240", "MATH401", "MATH475", "CMSC398D", "CMSC475", "MATH240", "MATH475", "CMSC398J", "MATH299G", "CMSC475", "MATH240", "MATH475", "CMSC475", "MATH240", "MATH475"], "average_rating": 4.3649, "type": "professor", "reviews": [{"professor": "Wiseley Wong", "course": "MATH241", "review": "Excellent teacher, great office hours, always willing to go the distance for students. Will take again if I can for higher level courses.", "rating": 5, "expected_grade": "", "created": "2018-03-16T14:12:18Z"}, {"professor": "Wiseley Wong", "course": "MATH140", "review": "Great Teacher", "rating": 5, "expected_grade": "B+", "created": "2018-05-07T15:09:27Z"}, {"professor": "Wiseley Wong", "course": "MATH140", "review": "Wong is so nice and really good at explaining concepts. He goes over the material various times until we grasp it", "rating": 5, "expected_grade": "", "created": "2018-05-11T05:02:57Z"}, {"professor": "Wiseley Wong", "course": "MATH140", "review": "Great professor! He sometimes talks a little too quickly for me to follow, but he is very approachable and will answer any question you have.", "rating": 5, "expected_grade": "B+", "created": "2018-05-18T01:28:50Z"}, {"professor": "Wiseley Wong", "course": null, "review": "He was a great professor! I took him for Calc 2 and 3, straightforward, and very nice. He first goes over theory and then examples in lectures. Fair exams. He had hws for Calc 2, were a bit difficult, but then exams were fair. Calc 3, I don't think he had HW, I did problems from the book, and the exams were quite manageable. Be careful on his exam 4 for calc 2 and 3, they were a bit troublesome for people. I think he kinda curves. I want to try to take a 400 level with him; he's awesome!", "rating": 5, "expected_grade": "A", "created": "2018-09-18T16:30:41Z"}, {"professor": "Wiseley Wong", "course": "MATH341", "review": "Wiseley is an awesome professor. He is excellent at explaining things clearly in class and is very helpful in office hours as well. For MATH341, he assigned projects that were interesting and actually helpful for learning concepts and how to use MATLAB and Mathematica. Not that it matters, but it's also insane how quick this man grades exams - he usually posted grades within 1 day of giving the exam. His assignments and exams are always very fair, though not always a cakewalk.", "rating": 5, "expected_grade": "A", "created": "2018-10-17T19:47:18Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "Dr. Wong is an amazing professor. He knows the material very well and is very good at explaining it. In class, he basically gives an overview of the chapter and proceeds with multiple examples. Exams are fair. He is always willing to help, especially during office hours.", "rating": 5, "expected_grade": "A", "created": "2019-12-05T03:22:04Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "He was very thorough in his teaching and writes everything on the board, usually a lot of examples. He tells you what the questions on the midterms will be, and does a lot of practice for the final. MATLAB assignments are very doable. ", "rating": 5, "expected_grade": "A+", "created": "2019-12-19T01:21:16Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "He teaches a little fast but leaves notes up for a while so you have enough time to understand everything. He also does an expert job explaining his process working through a problem, so it is easy to follow. Quizes and tests are very easy.", "rating": 5, "expected_grade": "A+", "created": "2020-04-10T20:46:12Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "Great lecturer, easy to follow, and makes everything simple.  Tests are reasonable.  ", "rating": 5, "expected_grade": "A", "created": "2020-05-03T16:50:15Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "Easy to follow; very detailed in explanations; moves quick but keeps the notes up for a while; is very open in office hours. Quizes and exams are easy.", "rating": 5, "expected_grade": "A+", "created": "2020-05-13T18:40:31Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "Great lecturer, easy to keep up with. Doesn't have too much patience with students sometimes though", "rating": 5, "expected_grade": "A", "created": "2020-05-17T20:06:04Z"}, {"professor": "Wiseley Wong", "course": "MATH401", "review": "I loved Wiseley. He's very accommodating as a professor (polled us on which of 3 days we'd prefer the first midterm). He's also great at lecturing. Dude comes in with his own bag of multiple colors of chalk so his lecture notes are color coded so students can better follow them.\r\n\r\nUses tons of examples during his lectures and when he goes over proofs they are pretty thoroughly written and explained to make sure you understand each step. \r\n\r\n401 is a pretty easy class, but I think Wiseley did a pretty good job of keeping it fun and interesting, I genuinely enjoyed what we learned in the class, and can see the usefulness of the applications of linear algebra presented (which given the class is called applications of lin alg I think this is the ultimate goal). \r\n\r\nTake Wiseley for any class. You won't regret it. Dude is organized, accommodating, and great at explaining and does not bore you to sleep like some others unfortunately.", "rating": 5, "expected_grade": "A+", "created": "2020-06-04T17:39:00Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "Wiseley is hands down the best math professor I've had. His lectures are very clear and organized.\r\n\r\nHe always told us what questions would be on the upcoming quizzes and exams at the beginning of every lecture so we would know what to focus on.", "rating": 5, "expected_grade": "A", "created": "2020-10-21T00:07:27Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "Great professor, but not very accommodating. His lectures are very detailed and have plenty of examples that he works through. My only complaint is he is not very considerate of personal issues. I had a death in the family just before a test and he was not willing to work out an alternative timeframe for me to take the test. Other than that, great guy.", "rating": 4, "expected_grade": "B", "created": "2020-11-24T14:49:03Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "Easy to follow lectures and he's very fair with quizzes and exams. Adapted to the online environment really well, too.", "rating": 5, "expected_grade": "A-", "created": "2020-12-03T14:13:36Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "Amazing lecturer with concise notes and explanations. Also very generous to his students, and never tries to make things harder than they need to be. 10/10 would take again", "rating": 5, "expected_grade": "A", "created": "2020-12-11T22:00:14Z"}, {"professor": "Wiseley Wong", "course": "MATH241H", "review": "I took this course in Spring 2020.\r\n\r\nPros:\r\n+ Extremely good lecturer. Will make sure all students understand what's going on.\r\n+ Generally nice guy.\r\n+ Is extremely flexible and adaptable to extenuating circumstances, especially during the pandemic. Dude made all of our quizzes and tests (including the final) open note and untimed.\r\n\r\nWong is often called one of the best undergraduate math professors, and after taking his class, I now know exactly why.", "rating": 5, "expected_grade": "A+", "created": "2020-12-22T02:20:39Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "Dr. Wong is a very good math teacher. The content is challenging as the semester progresses, but his notes provide a good foundation. In discussions, Dr. Wong provides the TAs with examples to use which are very helpful to use when studying for quizzes and exams.\r\n\r\nVirtually, exams and quizzes were opened note and due in a 24  or 48-hour period, so timing was not an issue if stuck on a problem. The only issue with Dr. Wong is that his notes may be messy at times but for the other 99% of the time, his notes are clear and easy to follow", "rating": 4, "expected_grade": "A-", "created": "2020-12-30T00:59:21Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "*class was fully online due to covid*\r\nI signed up for Dr. Wong because he had a 5 star rating, and he deserves every bit of it. His lectures were clear, informative, and full of examples to help you better understand the relatively difficult content of the class. He writes his notes out as he explains things, which can leave some awkward silences, but it also means he moves at the perfect pace for people doing handwritten notes. All quizzes and exams were take home, unproctored, and untimed (24 hours for quizzes and 48 for exams). There was no homework other than the matlabs, which were a complete pain, but I think it was just something the department required of the class without a real reason as to why. Overall, great teacher. Highly recommend.\r\n", "rating": 5, "expected_grade": "A", "created": "2021-01-06T02:56:10Z"}, {"professor": "Wiseley Wong", "course": "CMSC475", "review": "(online fall 2020)\r\n\r\nWas excellent lecturing and responsive to questions while giving proofs and examples for course content. Pace was fine and he was generous with regards to exam scheduling.", "rating": 5, "expected_grade": "A-", "created": "2021-01-12T02:14:34Z"}, {"professor": "Wiseley Wong", "course": "CMSC475", "review": "Couse was interesting, Wiseley taught it well and recorded lectures. Homework and exams followed the lectures to a T and were easy enough. Average exam grades were around 90 without a curve, but that might've been because they were open for 48 hours due to online classes so you could rewatch lectures.\r\n\r\nOnly nitpick is I thought it was kind of boring sometimes but that might've just been the fact that the class was online. ", "rating": 4, "expected_grade": "A", "created": "2021-01-15T04:17:18Z"}, {"professor": "Wiseley Wong", "course": "MATH475", "review": "The one and only. Class was easy and relaxed. Having background in a lot of the material, I only wish the pace was a little faster so we would be able to cover more interesting graph theory topics.", "rating": 5, "expected_grade": "A+", "created": "2021-01-18T06:49:21Z"}, {"professor": "Wiseley Wong", "course": "MATH241", "review": "Very interesting material thought he could teach pretty slowly at times. He tried to make the material as understandable as possible and usually succeeded. The exams were easy if you do the suggested practice problems because the exam problems are literally the same thing with different numbers", "rating": 5, "expected_grade": "A+", "created": "2021-01-23T05:12:03Z"}, {"professor": "Wiseley Wong", "course": "MATH340", "review": "Genuinely nice professor. Failed the first exam, was still able to bring the grade up to an A through weekly office hours and studying. Taught 2 week of vector spaces / determinants, 5 weeks of calc 3, 4 weeks of linear algebra topics, 4 weeks of graph theory. Definitely a fast-paced class, take only if you really like math.", "rating": 5, "expected_grade": "A", "created": "2021-06-22T21:52:47Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Wong was an amazing professor and clearly cares about teaching. His lectures are logical and easy to follow. I genuinely enjoyed 240 with him. ", "rating": 5, "expected_grade": "A-", "created": "2021-12-07T04:45:09Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Wiseley was one of the best math professors I've ever had. He went really fast in lecture but given all the material we had to cover, he tried his best to explain it in intuitive way. \r\n\r\nGetting an A in his class is totally possible. I made the mistake of slacking off on the final. Study well and you'll ace his exams.", "rating": 5, "expected_grade": "B", "created": "2021-12-18T17:49:33Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Great guy, very down to Earth. Lectures were pretty good but took me a couple rewinds to really get it down. He tends to skip over some of the basics of somethings that he assumes you would catch onto, but if you're like me then it'll probably take you a little bit to figure out. Overall, great class and definitely would take Wong again.", "rating": 4, "expected_grade": "A-", "created": "2021-12-18T18:03:18Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Wiseley is a great professor and really nice guy. The lectures were straight to the point and easy to understand. He did a lot of first giving the definition of whatever new thing we were learning about, and then going through examples. His exams are fair and easy if you do the suggested exercises for the sections being covered. We had weekly quizzes during discussion section which was a little annoying but still useful for reviewing and making sure you were on top of the new content. \r\n\r\nHe's really great at answering your questions during office hours and is not condescending about it at all (unlike some other profs). Right before the final he held a 3 hour review session on Zoom with practice questions. If you can, take him!!!!", "rating": 5, "expected_grade": "A+", "created": "2021-12-25T21:15:35Z"}, {"professor": "Wiseley Wong", "course": "MATH401", "review": "The absolute GOAT. Exams are easy because he tells you exactly what to study for and doesn't throw curveballs at you. Lectures are actually interesting and you can tell he has a lot of passion for what he's teaching. Does a review session the class before every exam which helps a lot in preparing for them. Homework isn't super busy, it teaches you the material, and you do some pretty neat stuff in them (for one of them, we did image compression in MATLAB). 10/10 recommend Wiseley for literally any class you can take with him. ", "rating": 5, "expected_grade": "A", "created": "2022-05-18T20:41:08Z"}, {"professor": "Wiseley Wong", "course": "MATH475", "review": "One of the best professors out there. Exams are fair and he tells you exactly what to study for. The class is no walk in the park though. You gotta put in the work", "rating": 5, "expected_grade": "B+", "created": "2022-11-06T16:32:29.886381Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Wiseley is the absolute GOAT. Midterms are extremely fair. He wants all of the students to succeed. You're able to tell that he loves teaching linear algebra when he explains hard concepts and answering questions from students. Dr. Wong is by far one of the greatest professors I've encountered in the Math department so far. I'd take him no matter what.", "rating": 5, "expected_grade": "A-", "created": "2022-12-07T03:02:06.250473Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "For a professor that has taught 10+ courses, he most definitely knows how to teach. One of the best lecturers and note-takers at this university. I struggle with math and Wiseley has made me a bit more interested in learning about math. His name truly checks out.\r\nAlso, a shoutout to his TA Weimin Jiang. Two GOATs in the math department.\r\n\r\nPlease take his class if there is an open spot. You'll hear others complain about their math classes, but not from Professor Wong.", "rating": 5, "expected_grade": "", "created": "2022-12-14T03:52:34.562364Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "He's a really nice guy, and his quizzes and exams are pretty fair. However, his teaching style is somewhat mediocre, and I find myself often referring to the textbook over lecture notes.", "rating": 3, "expected_grade": "B+", "created": "2022-12-14T15:12:16.442106Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "I feel like I'm the odd one out for saying it because there are just so many positive reviews on here, but I know for a fact I'm not the only one who thinks Wong is very overrated. Yes, he doesn't give you any surprises on quizzes/exams, which I appreciated. Yes, he's a nice guy. But does that mean he deserves a better rating than someone like Justin? Certainly not. The fact that he tells you what to expect on assessments is the upside of his class. But aside from that, I genuinely don't think he is that good of a teacher. He overcomplicates simple concepts and doesn't explain difficult concepts in enough detail because he expects that you'll catch on. Students would often ask him reasonable questions for clarification, to which he would say stuff like \"Have you taken Calc 3? Have you taken CMSC250? You would understand if you had. I can't explain this to you, it's just hard because it's math and you'll have to figure it out yourself.\" He gave exam review problems but refused to give solutions for them, claiming \"You can check yourself to see if your work is correct.\" The problem, though, is that if you don't actually understand the concepts then you can't check your work! I found my TA and the textbook to be way better resources than Wong. I even felt bad for my TA because he had to teach us so much stuff that Wong never clarified in class. Overall, I wouldn't say to avoid his class; just be prepared to do some self-teaching and don't expect to understand the material just from his lectures.", "rating": 3, "expected_grade": "A", "created": "2022-12-15T21:34:27.529218Z"}, {"professor": "Wiseley Wong", "course": "MATH340", "review": "This class was my favorite during this semester because of Wiseley. This man is absolutely without a doubt GOATED on the sticks. If you're seeing this review and decide to take MATH340 if Wiseley is an option you should 100% do it. Exams and quizzes were always extremely fair as we had prior information of the material they would cover. During the lectures proofs could get quite technical and were very abstract at times. However, class input was heavily encouraged which I felt helped everyone grasp the proofs better. But even if a lot of the minutia within the proof confused you (which it did for me) most material on assignments really only required knowledge on theorems and not the proof itself.", "rating": 5, "expected_grade": "A", "created": "2022-12-19T19:50:10.135230Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Wong is pretty cool. The midterms weren’t anything crazy, and the final was decently difficult. The reason he gets 2 stars is because of how fast he teaches. It got to the point where I felt I wasn’t learning anything so I stopped coming to the class. I learned a decent amount through the textbook and some MIT lectures. The camera Wong records the class with is extremely bad, but I blame that on the ARM building. With all that being said, this class stressed me out a lot because the concepts were flying in class and I could it grasp them, so I spent a lot of time trying to learn it myself. Unfortunately, there were some concepts that he only went over in lecture that the book doesn’t go over, so you do miss some things. Wouldn’t recommend taking this class if you can avoid it.", "rating": 2, "expected_grade": "C+", "created": "2022-12-21T02:37:14.513391Z"}, {"professor": "Wiseley Wong", "course": "MATH340", "review": "This dude is the absolute goat. Exams and homeworks were very fair. He really isn't out to get you, just wants to see you learn the important stuff and do well. Great teacher, and has a really good understanding of when and where to do example problems. Every time I found myself thinking \"okay but how does this work in practice\" he had at least one example he went through. He's also like unbelievably nice and funny and a cool dude.", "rating": 5, "expected_grade": "A+", "created": "2022-12-21T06:17:24.239118Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Wisely Wong is a beast. Take him at all cost, zero regrets.", "rating": 5, "expected_grade": "A", "created": "2022-12-22T01:47:15.770912Z"}, {"professor": "Wiseley Wong", "course": "MATH340", "review": "Absolute goat. Moved very quick but managed to actually teach all the material too. He skims over some foundational material so if you don't have a background in the material, you'll have to spend some time studying up outside of class so you understand what's going on at all. Homework was super tough but exams were very clear and not meant to trip you up. Most I've ever learned in a class.", "rating": 5, "expected_grade": "A", "created": "2022-12-24T03:27:41.057852Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "I mean the other reviews pretty much sums up everything I was going to say. Good professor and easy class, take it if you want to learn and also get a GPA booster.", "rating": 5, "expected_grade": "", "created": "2022-12-24T04:47:31.746817Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Really good, knowledgeable teacher. He shows a lot of different examples but for me, it was really hard to understand everything conceptually. Make sure TO LISTEN TO HIM while he's teaching because nothing he writes will explain anything conceptually.\r\n\r\n- IF YOU HAVE A BAD TA FOR DISCUSSION, GO TO ANOTHER TA's class. \r\n- YOU HAVE TO SHOW UP TO LECTURE EVERY DAY BECAUSE THE RECORDINGS ARE SO BAD (240p with muffled audio)\r\n\r\nQuizzes are really easy. He tells you the questions the lecture before and there was often an example that he worked out in class of that question (show up to lecture) \r\n\r\nFinal is difficult (got a score in the low 80s). Exams were fair (high 80s,90s) and definitely easier than some of the other teachers like Long. No homework is assigned/graded. Good professor, just wished he explained some of the earlier topics a little more.", "rating": 4, "expected_grade": "B+", "created": "2022-12-26T21:45:16.772090Z"}, {"professor": "Wiseley Wong", "course": "MATH340", "review": "Homework, Projects, Quizzes & Exams:\r\n- Homework every 1-2 weeks (consisted of reach problems), quizzes weekly, 2 projects (one on MATLAB and one on Mathematica), 4 exams. Some simple proof problems, and a lot of computational problems. Never anything unfair or unexpected.\r\n\r\n\r\nClassroom Environment:\r\n- Very quiet, with all students focused on the chalkboard and little talking. Even though it seemed awkward at times, Dr. Wong always welcomed questions.\r\n\r\n- Each lecture came with a dizzying amount of new content -- lots of definitions, example problems, theorems, and proofs. I personally managed this by copying verbatim what was written on the chalk board, although I know not everyone needed to do this.\r\n\r\n\r\nPacing, Difficulty & Curve:\r\n- Pacing was very quick. 2 weeks of Linear Algebra, 5 weeks of Calculus III, 3 more weeks of Linear Algebra, 5 weeks of applications in combinatorics & graph theory (his research specialty, which was new to everyone). Definitely manageable with lecture notes, textbook PDFs, classmate collaboration, and office hours.\r\n\r\n- Dr. Wong was adamant about not curving, but in the end my 92 came out as an A. \r\n\r\n- You'll figure out in the first two weeks if this class is a good fit for you. I highly recommend it; by the end, you will have a good grasp on 240, 241, and 310, and you might even be prepared to take 410 in the spring.\r\n\r\n\r\nProfessor:\r\n- Super chill, he'll ask you to call him Wiseley. Always welcomes any questions, and very open during office hours. 10/10 great professor and person.", "rating": 5, "expected_grade": "A", "created": "2022-12-27T02:45:12.853754Z"}, {"professor": "Wiseley Wong", "course": "MATH475", "review": "Excellent professor. Teaches so well and is always willing to help. But he moves pretty fast so make sure you're keeping up", "rating": 5, "expected_grade": "B", "created": "2023-01-01T16:53:11.102558Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Great guy, very knowledgeable, and always takes time to answer questions. His tests were fair, but the final was pretty tough (although it was made by Manning). He usually said what would be on the weekly quizzes, but would always talk super fast to the point it would be very easy to miss something. Although, he was very helpful during office hours. Definitely a good choice.", "rating": 4, "expected_grade": "", "created": "2023-01-05T06:00:17.840832Z"}, {"professor": "Wiseley Wong", "course": "MATH340", "review": "I decided to take his course partly because Dr. Wong is so well-regarded; unfortunately, I was disappointed. He often obfuscates relatively easy topics with fast and verbose speech. It took me most of the semester to realize that I need to just ignore him and study on my own. He also grades quite slowly.", "rating": 1, "expected_grade": "XF", "created": "2023-03-09T03:50:58.945564Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "I honestly have no clue why his reviews were so high. I attended every lecture and barely learned anything. His lectures consist entirely of theorems and definitions and he doesn't attempt to explain anything. The exams are fair, but the final had content that was not covered at all. I have no point of reference for the other professors, so maybe this is just how Math240 is as a class, but I don't get the 4.63 rating.", "rating": 2, "expected_grade": "B", "created": "2023-04-18T17:40:02.041478Z"}, {"professor": "Wiseley Wong", "course": "MATH340", "review": "I thought Wiseley was a great instructor.  His lectures were very structured, which I appreciated and which made it easy to study.  I found both his homeworks and exams to be fair, though the homework did take up a lot of time.  I would not recommend the course itself, as there was way too much material packed into it, and we spent a lot of time covering topics completely unrelated to the course description.  However, I thought Wiseley was a good lecturer and that he was very approachable and willing to help.  I would take another class with him, but if I could go back, I wouldn't take MATH340 again.", "rating": 4, "expected_grade": "A-", "created": "2023-04-22T03:01:47.426636Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Honestly, he is a fantastic lecturer I don't know if he recently got better but some of these reviews do a disservice to how good of a lecturer he is, and if you are ever confused about something he has no issue with people asking questions. He always makes himself available for office hours and is really a helpful guy the midterms are exactly like the example problems he does in class and he explains everything so well I can't stress enough of how much a good lecturer he is the only times you might walk away confused is linearly transformation and change of basis because those topics are taught out of order and that's it. Overall solid professor take him if you can you won't regret it. Don't forget to practice because people assume lectures alone will be enough and that's their downfall in this class.", "rating": 5, "expected_grade": "A-", "created": "2023-05-04T00:35:21.192649Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "He is a very good professor. However, the TA's can barley speak English thus do a poor job explains the examples, which ends up hurting you. But overall, quizzes, exams, and MATLAB's are very fair. Looking back, I wish he would at least post step by step examples of the examples he wants the TA's to go over.", "rating": 5, "expected_grade": "", "created": "2023-05-09T21:34:33.769153Z"}, {"professor": "Wiseley Wong", "course": "MATH475", "review": "Wisely overall was a decent instructor. The exams and homework's were fair and the average was high(usually around a low 80). Wisely provided examples in lectures with helped solidify understanding if the concepts. The only issues I had with the class were that Dr. Wong often forgot to record the lecture, the quality of the video was also very poor although that was not his fault. Some lectures also felt a bit rushed.", "rating": 4, "expected_grade": "C", "created": "2023-05-10T21:21:39.614426Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Wiseley is an amazing lecturer. He is very detailed and is always open to answering questions. His office hours are extremely helpful and definitely allowed me to understand the concepts beyond the surface. The midterms are extremely fair as well as the quizzes. Just make sure you practice and do some studying, because lectures alone will not allow you to retain the information to a good level. A few topics take a little longer to absorb but overall I really enjoyed the material. My biggest recommendation is to go to office hours and get to know him.", "rating": 5, "expected_grade": "A", "created": "2023-05-15T01:47:24.352727Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Extremely overrated. You can either show up to class and get examples that he shows which could be similar to quiz/test questions (don't try to watch the recordings they are recorded on a carrot), but it's completely doable to never go to lecture and just learn from the book/videos. Not much leeway for mistakes, if you do not so good on one exam its gonna really hurt your grade. MATLAB is really boring -  no one can say that they enjoy doing it.\r\n\r\nHonestly, take another professor for easier midterms and less sweaty/pretentious kids.\r\n\r\nHow to do well:\r\nDownload textbook and study guide for textbook, do problems\r\nDo past exams/finals (find the answer keys from past students) - I literally grinded past finals and aced my final.\r\n\r\nOverall, he is a decent person but most of these reviewers are glazing and he ain't allat.", "rating": 2, "expected_grade": "A-", "created": "2023-05-16T04:33:27.226605Z"}, {"professor": "Wiseley Wong", "course": "CMSC475", "review": "Wiseley is a great professor. Lectures were interesting. The exams and grading are very fair.", "rating": 5, "expected_grade": "A+", "created": "2023-05-17T17:54:07.875528Z"}, {"professor": "Wiseley Wong", "course": "CMSC398D", "review": "This class wasn't taught by Wong but it was an easy course. You have a few projects and miscellaneous assignments, but the class is chill.", "rating": 5, "expected_grade": "A", "created": "2023-05-25T04:08:50.485425Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "I cannot express how GOOD of a lecturer he is. You have to attend every lecture or make some friends in the class who you can ask of their notes since the recordings are absolute doo doo, but man, he knows his stuff. He goes over content directly from the textbook, but his teaching enhances the material by making it easier to understand. You can ask questions during lecture and he actually answers them (also he has no problems with doing so), he is very helpful during office hours, and the exams are extremely fair. Yeah, they can be kinda tricky but there was never a problem I got incorrect that I did not ever learn how to solve. Any type of transformation question is what I was really confused on during lecture but that's it. Recommend taking Wisely for any class you can.", "rating": 5, "expected_grade": "A", "created": "2023-05-26T17:27:09.292971Z"}, {"professor": "Wiseley Wong", "course": "MATH141H", "review": "I think Wiseley Wong is a decent professor. I failed the class, but it was definitely my fault and not his. He's good at lecturing and isn't too boring, I'd say he's your standard math professor.", "rating": 4, "expected_grade": "F", "created": "2023-05-28T21:04:58.349725Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Wiseley is a great lecturer but he moves very fast. You have to be ready to study many hours outside to class to be able to keep up with him. I fell behind once and I was behind the entire semester and had to work very hard for the exams.\r\nOn top of that, his TAs are all international students with accents that make it very hard to understand them, so its difficult to get help in discussion which is a really important part, so keep that in mind.\r\nHe does give you hints to what will be on the weekly quizzes which is useful, and I've heard his exams are easier than most other profs.\r\nSo he's def worth taking.", "rating": 4, "expected_grade": "A", "created": "2023-06-02T17:29:11.137986Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Wong is as good as you can get when it comes to Linear Algebra professors, from what I hear and see. His lectures are clear and engaging, and he communicates very well via Canvas. Weekly quizzes in discussion keep you up to speed during the fast-paced course, MATHLAB homeworks are very doable and can be completed as a team, and there is plenty of practice problems posted for exam prep. He definitely appeals more to students invested in the subject, which I had a hard time finding within myself. I had to drop this course because it was too much with my other classes and personal challenges, but when I schedule to repeat it (as I am a CS major and will need to complete 240 at some point) I will be trying to get Wong again. Glhf", "rating": 4, "expected_grade": "W", "created": "2023-06-08T13:23:21.250530Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Pros:\r\nHe is an amazing teacher. Like, can explain concepts really well. You don't really need to look at the textbook in this class if you really pay attention in lecture. He responds to emails really quickly and with really helpful replies, and he's always fun and helpful to talk to during office hours.\r\nCons:\r\nI often struggle to learn and take notes simultaneously. Which is definitely a me problem, but I know a lot of other professors posted their lecture notes on ELMS, which he didn't do. He did record, but it was blurry because of how outdated the armory tech is.\r\nHowever, the main challenge was that our exams were harder than all other 240 professors. That said, they definitely were fair, but the other professors were just so much easier. Plus, he didn't curve at all.\r\nAll said though, his teaching skills, approachability, and helpfulness outweigh any of these cons. He teaches very much like he tests, so I would definitely recommend Wong to anybody who plans to attend class, and I wouldn't recommend him if you don't plan to do so.", "rating": 5, "expected_grade": "A", "created": "2023-06-09T18:49:45.526377Z"}, {"professor": "Wiseley Wong", "course": "MATH475", "review": "He is amazing, take him at all costs. I had the honor of taking MATH240 with him too. The course is very difficult, but I promise you will learn a lot out of it.", "rating": 5, "expected_grade": "B+", "created": "2023-06-15T20:50:27.339438Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "1. Did you think the exams or other major assignments were fair? \r\n· The exams and major assignments were very fair, with a direct application of the problems covered during lecture and discussion. \r\n—\r\n2. Did you think the professor had reasonable expectations of the students in the course overall? \r\n· Yes, the professor had reasonable expectations and focused on direct application of the course material. \r\n—\r\n3. Were you a fan of the professor's teaching style? \r\n· I enjoyed the professor's lecture style. \r\n· It was important to attend in person (and be on time) to catch hints about what would be covered in exams and quizzes. \r\n· The hand-written notes on the chalkboard were helpful, and I recommend taking occasional notes on his verbal explanations as well. \r\n· Wiseley was patient and took the time to fully answer questions, even if they seemed basic. \r\n—\r\n4. Was the workload appropriate for the number of credits? \r\n· The workload was relatively relaxed. Only one hour per week was needed for quizzes, and about 6-8 hours were required to complete practice problems for the exams. The textbook was not necessary unless clarification was needed.\r\n—\r\n 5. Was this course a waste of time or was it beneficial in some way? \r\n· This course was definitely worthwhile as linear algebra is relevant to computer science, machine learning, and graphics. \r\n· It was interesting to learn about its applications towards the end but this course is mostly applying the concepts. \r\n—\r\n6. How much support were you given throughout the semester (office hours, extra resources, etc.)?\r\n· There was no class Piazza or answer key provided for practice problems, which made me feel more isolated and unsure compared to my regular CS classes. \r\n· The TAs were hit or miss; however, Wisely was particularly helpful during office hours, offering patient guidance from basic principles to a full understanding.\r\n—\r\n7. TLDR I would recommend Wisely for MATH240, but attending lectures and studying for quizzes and especially exams is crucial. Completing practice problems and getting them checked is also important. It sucks there's no Piazza or solutions to practice problems.", "rating": 4, "expected_grade": "A", "created": "2023-08-26T00:25:06.933157Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "I don’t recommend him. People say that’s he’s easy or that he’s good but he’s not. This class of his is hard. Although it’s not calculus 1 or 2, it’s challenging in its own way. The only reason why people say this class is easy is because they are either good at math, took calculus 3 or their brains just can understand things quickly, but if you have a hard time understanding concepts at the fast paced Wong throws them at you and then exams you on things that he didn’t cover, then don’t take this class. Yes he will test you in harder versions than what he taught you and sometimes he won’t  solve a problem how he wants you to solve it in front of you because according to him you should already know how to do it from the previous chapter and should automatically learn how to adjust that way to what hw is doing here. Your grades are just quizzes, exams and matlab. That’s it. Choose a teacher that grades you on homework, so you can better learn the material.", "rating": 1, "expected_grade": "", "created": "2023-11-17T14:36:08.357961Z"}, {"professor": "Wiseley Wong", "course": null, "review": "You probably won't understand a solid 70% of what he says in lecture, so you have to rely on discussion which is like 5 practice problems on the content you just learned. Your options are to redo these questions multiple times or just spam textbook problems until you somehow get an idea of what you're doing. Unless you are someone who can just understand math by looking at a single example and then being able to do a bunch of them, in that case you'll do great. Otherwise, you're going to be in for a rough time. I studied hours for exams practicing based on his given practice exams and discussion questions, only for him to throw in various theoretical questions in. Furthermore, he doesn't even provide an answer key to his practice exams. If you want to do well and aren't gifted in math, then be prepared to spend hours practicing even on weeks without an exam.", "rating": 2, "expected_grade": "", "created": "2023-12-02T21:37:24.847951Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Wong is the GOAT.  His notes and lectures simplify the material so well and makes it understandable for most students.  Ignore reviews that say his class is difficult (the grade distribution says that about 35% of students get an A).  He's such an understanding and down-to-earth guy and one of the few 5-star reviews I give on here.  I promise you won't regret it!", "rating": 5, "expected_grade": "A", "created": "2023-12-12T18:58:10.012013Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "don't miss a lecture or its gg", "rating": 4, "expected_grade": "B-", "created": "2023-12-16T01:27:55.046906Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "The vast majority of what is taught you will not understand. Linear Algebra is much more difficult than advertised which I did not expect. The class goes heavy into theorems, definitions, and abstract concepts. Linear Algebra is a hard transition from Calculus because it is much less computational. Wong himself is severely overrated. Not sure what is up with the high reviews. While he is a great guy that is approachable and will answer all questions asked during class well, much of what he is actually teaching will not taught well. Exams 1 and 3 were reasonable, but exam 2 was very difficult with a low average. The practice exams were just ok. Wong as a teacher is just ok, you could definitely get worse but really not anything to get excited about when taking his class. Lectures are boring and not very important because so much of what he says wont make sense. Quizzes are easy and he will let you know what's on them a few days before. The final was brutal but not impossible. It's important to understand that this class will not be easy especially taken with other hard classes int he same semester. Overall, I would not recommend Wong for 240 even though his reviews seem to be so high.", "rating": 2, "expected_grade": "B-", "created": "2023-12-18T19:39:50.952379Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "I really like Wong's class. 240 is a pretty fast-paced course, and while I wasn't always absorbing everything he was saying in real-time, his notes on the board are extremely helpful (particularly his little yellow side notes-- write them down!!). He doesn't necessarily try too hard to be liked, but he's so good at handling and validating student questions that you just naturally have to love him. Wong is communicative and reachable outside of class, does an excellent job of explaining abstract concepts, and overall made me love the course. Prioritize having him for 240!", "rating": 4, "expected_grade": "B", "created": "2023-12-19T21:25:51.283529Z"}, {"professor": "Wiseley Wong", "course": "STAT410", "review": "Wong is a good professor, but his lecture is quite fast. He seems to cover content a little more in-depth than other professors, but it is at the cost of needing to study a lot more outside of class, unless you have seen the concepts before. This semester there weren't any practice exams (which was quite annoying), but that may have be due to Wong never having taught this class before.", "rating": 3, "expected_grade": "A", "created": "2023-12-20T05:14:04.406586Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "Wong is fast paced, but that's the nature of the course. And its not like he ignores questions, either. His quizzes are relatively easy, even more so if you do a handful of his *optional* textbook HW problems every so often. In fact, most of his questions are just HW problems, in my honest opinion, even for midterms and the final. There are some conceptual TF questions that he asks, but those are relatively easy if you either understand the concepts well enough or if you do some practice. Overall, the class was relatively easy, though it required a bit of effort. Try not to cram and just be consistent in terms of practice.", "rating": 4, "expected_grade": "A+", "created": "2023-12-20T18:33:49.952526Z"}, {"professor": "Wiseley Wong", "course": "STAT410", "review": "Zooms through lectures on a chalkboard and didn't really help me understand anything. Exams were totally way too hard and unfair. STAT410 historically is supposed to be a way easier class than it was this semester.", "rating": 2, "expected_grade": "", "created": "2023-12-20T19:54:25.064243Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "lectures are great and so are discussions. I ended with a B since I didn't attend any lectures or discussions after the first 2 weeks. I only went if there was a quiz or exam. Review his practice exams and you'll be fine. he also tells you what the quiz questions will be in lecture, so if you don't go, ask someone what he said will be on the quiz. I ended with a B mainly because I didn't attend any lectures or discussions, so I was self studying the whole class. If you go to class, it should be an easy A.", "rating": 5, "expected_grade": "B", "created": "2024-01-03T18:47:28.666725Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "His lectures were not hard to follow, and any confusion on class material was cleared up in discussion pretty well. There are weekly quizzes in discussion, but he tells you what the question(s) will be asking in lecture beforehand, so as long as you study what he tells you to it's not hard at all. Exams were pretty fair as well. I'd recommend taking him if you can.", "rating": 5, "expected_grade": "A", "created": "2024-02-21T07:14:26.714980Z"}, {"professor": "Wiseley Wong", "course": "MATH240", "review": "I had Wong during the fall 2023 semester and all I have to say is take him if you can. Although he goes fast, his explanations are very concise, but my TA (SHE IS A QUEEN) still CARRIED me during discussion. The quizzes are predictable as there are no tricks and no surprises (there are quizzes every week but he TELLS you what the quiz will be on during lecture, so it is very important to attend lecture if possible. His style of teaching is honestly fairly typical and traditional for a math course, he goes over examples and tries his best to answer questions. He emphasizes INTUITION (MAKE SURE TO STUDY A LOT OF THEORY FOR THIS CLASS! The true/false questions in the textbook prepare you) and mentions calculus 3/multivariable/MATH241 occasionally during class because most of what we've learned are also in that class. There are no webassigns and no homework, but he does give you suggested textbook problems that are for the most part pretty helpful, AND DON'T FORGET ABOUT THE GRADED MATLAB WORK. Most of the textbook problems are harder than what you'll be learning, BUT IT'S OKAY, you can always go to office hours and ask or ask your friends. No homework but it is HIGHLY encouraged to go to office hours, ask questions, and practice! I've always found the conceptual and computational stuff easy to grasp, and most of the units use previous units (like row reducing in the very first chapter), so it is very important to make sure you have the fundamentals down. When it comes to the theoretical stuff, all I can say is practice and ask questions. With exams, they are fair but he allows for regrade requests. If you attend lecture and study, you will be fine. Overall, amazing teacher. He is the GOAT! He explains concepts very well, quizzes are easy, exams are fair, and this might be more subjective but this class was honestly much easier than Calculus 2.", "rating": 5, "expected_grade": "", "created": "2024-02-22T19:39:34.497200Z"}], "name": "Wiseley Wong", "slug": "wong_wiseley"}