{
    "average_gpa": 3.252891257154135,
    "professors": [
        "Jason Nichols",
        "Jonathan England",
        "Shane Walsh",
        "George Kintiba",
        "Kameron Patterson",
        "Robert Choflet",
        "George Kintiba",
        "Jason Nichols",
        "Shane Walsh",
        "George Kintiba",
        "Jason Nichols",
        "Shane Walsh",
        "George Kintiba",
        "Jason Nichols",
        "Robert Choflet",
        "Shane Walsh",
        "Jason Nichols",
        "Jason Nichols",
        "Jason Nichols",
        "George Kintiba",
        "Jason Nichols",
        "Shane Walsh",
        "George Kintiba",
        "Jason Nichols",
        "Robert Choflet",
        "Shane Walsh",
        "George Kintiba",
        "Jason Nichols",
        "Shane Walsh"
    ],
    "reviews": [
        {
            "professor": "Jonathan England",
            "course": "AASP100",
            "review": "Great lecturer. One of those classes where you'll learn a ton and won't mind going to class in the process. Excellent!",
            "rating": 5,
            "expected_grade": "",
            "created": "2016-04-16T20:00:00Z"
        },
        {
            "professor": "Jonathan England",
            "course": "AASP100",
            "review": "WOW. What can i say? by far the best professor i have had in college. not only does he know his stuff but he cares about his students too. He is extremely nice, and spends time to get to know everyone in the class. He will share stories about his family and crazy, funny life. He makes every class enjoyable to the point where i can actually convince myself to go to a class. Very funny, very easy going, very nice. Cannot say enough good things about him. Take his class!",
            "rating": 5,
            "expected_grade": "",
            "created": "2015-05-11T23:06:00Z"
        },
        {
            "professor": "Jonathan England",
            "course": "AASP100",
            "review": "",
            "rating": 4,
            "expected_grade": "C",
            "created": "2014-01-13T21:55:00Z"
        },
        {
            "professor": "Jonathan England",
            "course": "AASP100",
            "review": "This class is a huge eye-opener for anyone. Jon exposes you to the academic side of African American studies, which should help you view racial relations from a new perspective.\n\r\nHis class consists of a midterm, final exam, 4 short papers (you can instead do 2 short papers and 1 long one), 2 \"random assignments\" which will likely be short papers, 4 mini quizzes that are announced ahead of time, and class participation. \n\r\nThere is a lot of reading, but you don't really have to do any of it to succeed in the class, but you will get much more out of the lectures if you at least skim them.\n\r\nOverall extremely easy class to do well in, and given Jon's sociable and lively attitude, you'll never want to skip class.\n\r\nHighly recommended.",
            "rating": 5,
            "expected_grade": "A",
            "created": "2012-09-23T00:11:00Z"
        },
        {
            "professor": "Jonathan England",
            "course": "AASP100",
            "review": "You have to take this teacher and class. Teacher is funny, chill, cool. I've only been in class for like 2 weeks and he's a boss. \n\r\nIf your a nerd and are used to deadlines and an organized schedule dont take this class because you won't like it. \n\r\nBut if your an average joe take this. Easy, fun, best teacher. ",
            "rating": 5,
            "expected_grade": "",
            "created": "2012-02-13T00:28:00Z"
        },
        {
            "professor": "Jonathan England",
            "course": "AASP100",
            "review": "Jonathan is such a laid back person and he is totally engaging. He's extremely funny and his class is great. You do learn a lot and if you need a SH core I would highly recommend his class. He gives \"pop\" quizzes that he mentions beforehand. For example, he'll say there's a quiz this week and it's not today; so u know it'll be the next class. There are three papers about 3-4 pages. Not bad to write at all and he gives you plenty of options. There is a midterm and a final. All of the quizzes and exams incorporate multiple choice and short answer. He allows you to choose between a set of dates to turn in your paper. The only down side to his class is that you really have to work hard to do well on the exams and papers. He gives out review sheets for the exams and buying the books are not necessary for the class",
            "rating": 4,
            "expected_grade": "A-",
            "created": "2012-01-01T04:19:00Z"
        },
        {
            "professor": "Jonathan England",
            "course": "AASP100",
            "review": "He is the most awesome professor that I have ever had!!!!!! he's so hilarious and he's got such a awesome personality!!!!!!!!!!! I love him so much.\r\nalso he does not give a lot of works that is ridiculously meaningless. He doesn't try to teach us, but make us learn something from real life, which i loved the most!\n\n\r\nTAKE HIS CLASS!",
            "rating": 5,
            "expected_grade": "",
            "created": "2010-11-18T12:05:00Z"
        },
        {
            "professor": "Jonathan England",
            "course": "AASP100",
            "review": "Great professor!!! Made me absolutely love this class!  Im a science major and this class was my favorite this semester.  I was tempted to skip a few classes since i had it at 9:30am, but his humor made me want to go.  Hes very funny and keeps you up to date on the pop culture - its very refreshing when you attend classes like organic chemistry.  You dont even have to do the readings and he gives you hints when a quiz is coming up.  Also you have 2 write 4, 2-page essays but the due dates are up to you and you can pick your own topic.  He grades very easy as well.  I barely put any time into writing those essays and the lowest i got was a 90.  As for the exams, theres only two (mid-term and final) and he gives you review sheets for both.   The exams themselves aren't that hard and if you study enough you could probably get a 100% on them.\n\r\nI would definitely recommend this class with this professor!!",
            "rating": 5,
            "expected_grade": "A",
            "created": "2009-12-16T20:38:00Z"
        },
        {
            "professor": "Jonathan England",
            "course": "AASP100",
            "review": "Really great teacher. I highly recommend taking his classes.  ",
            "rating": 5,
            "expected_grade": "A",
            "created": "2008-04-10T00:53:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "This is the best class that I have taken at UMD thus far. He is a very entertaining lecturer, literally never bored. he's fun to listen to doesnt just stand and read. really knows his stuff\n\r\n3 dicsussion post, 2 exams (which he holds review sessions for so theer are no surprises) and participation grade.",
            "rating": 5,
            "expected_grade": "B",
            "created": "2015-06-08T13:02:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "I thought Dr. Nichols was an excellent teacher. He know his stuff very well. The reason the class is so interesting is because he goes off on rants. Although he discusses the course material he also talks about current events that are important to the topics he is discussing. If it wasn't for his rants the class would be kind of dry. His exams are fairly easy. He has a review session prior to the midterm and final. Has no quizzes if everyone participates in discussion. All in all, great professor who is very easy to talk to and willing to help with grades. ",
            "rating": 5,
            "expected_grade": "B+",
            "created": "2014-05-18T23:41:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "He is a very stupid teacher I dont know where UMD got this fool. Some one need to audit his ass he is a junky. Never knew this kind of pimps exist in higher institutions of learning like UMD. \r\nHe has no idea on what he is doing in the school teaches off syllabus and slow grader and exams do not reflect his teaching he is highly miss leading and will fail you. DONOT take this teacher. He is a moron.\r\nTalking about rap and other stupid artistic things which does not relate to the course",
            "rating": 1,
            "expected_grade": "C",
            "created": "2012-12-18T18:49:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "Parts of these ratings are true. He did go off topic a lot, but when he did was very interesting things. He kept me listening the entire class, not a single time was I bored. He has improved on that throughout this semester by providing powerpoints and staying within the syllabus more but still  providing us with the fun stories and allowing us to share our opinion. This class is easy if you read and pay attention. Jason is very easy to get a long with and if you ever have a problem within the course or with his teaching style he makes it clear that you can talk to him. I would recommend taking this class with Jason because you will learn things from him you might not learn elsewhere, as far as the work you do have to put in work outside of class to pass. ",
            "rating": 3,
            "expected_grade": "",
            "created": "2012-12-12T01:04:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "He's terrible. He never talked about anything related to readings and he went on stupid rants all the time. He only changed his ways when he read the reviews on here and he still didn't improve that much. Avoid him if you can. ",
            "rating": 1,
            "expected_grade": "",
            "created": "2012-12-09T15:59:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "Overall, he was not a good teacher. The grading was inconsistent and the material was never discussed in class. We were assigned readings, yet we talked more about subjects he thought was interesting such as his rap album or other irrelevant topics. Personally, he is a cool person, but I would not take him if you expect to learn anything",
            "rating": 1,
            "expected_grade": "A",
            "created": "2011-12-24T13:26:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "Worst teacher ever! Talked about many unrelated topics ALL THE TIME!\n\n\r\nAvoide him if you can.",
            "rating": 1,
            "expected_grade": "B",
            "created": "2011-05-14T23:39:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "He is a HORRIBLE TEACHER! I agree with the previous two posts. He talked about hisself and other useless topics. Also as a TA he disrespected the professor multiple times and even started to refer to a student as \"Snitchy\" for apparently telling the professor.\n\n\r\nAvoid him!!!!",
            "rating": 1,
            "expected_grade": "A",
            "created": "2011-03-31T20:15:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "I second the previous poster. I had him in the spring and I remember leaving work to get to class and sitting there hearing him talk about himself. \n\r\nI just sat there in class thinking. He might be funny and all, but is it really worth it to cut my work hours to come to class? Even if I did not have to go to work, is it REALLY worth it when I could actually be studying?\n\r\nBut hey - it was not like I had a choice - class attendance/participation is 30% of the grade!",
            "rating": 1,
            "expected_grade": "",
            "created": "2011-01-24T13:24:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "The Worst teacher EVER! Although he served as a TA this semester, it seems that TAs are more powerful than the instructor. He's EXTREMELY hard on grading papers and his discussion session is a TOTALLY WASTE OF TIME!!!! He talked about football, basketball a couple of times(almost 30 mins of the entire 50 mins session) which is absolutely unrelated to the class topic. \n\r\nPlease avoid him just for your own sake! PLEASE!!!!!!!!! ",
            "rating": 1,
            "expected_grade": "B",
            "created": "2011-01-05T12:09:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "I have a love/hate relationship with his teaching style. On some days, it's cool to go off topic and talk about current and controversial things. But other times, like before tests, I thought it would be helpful if he actually revied the material, and he rarely did. I feel like we spent more time talking about the Redskins than we did actual material.\n\r\nI would take this class only because AASP may be discontinued, and the information is valuable. But if you are lazy and dont like to read or take notes, do not take it.\n\r\nHe made the students buy his stupid rap album for extra credit, which I think is like buying a grade basically. Isn't that unethical?\n\r\nAnywho, fun and knowledgable guy. I got an A- and I didn't really put in that much effort. I did however show up to every class and take notes.I also just skimmed the books (there were THREE lengthy and dense novels) and got a B on the paper so...\n\r\nOverall it's riveting material, and it makes you think. My policy was that he didn't put that much effort into the class, so why should I?",
            "rating": 3,
            "expected_grade": "A",
            "created": "2009-12-29T16:53:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "Nichols is cool teacher.  He's jokes around and he raps. He goes off topic A LOT and doesn't really cover assigned reading that much. That's tough when midterms and finals come around because that's what they're based on. You should read anyway to comprehend, but it'd be nice if he reviewed what he thought were key points. He does sometimes, but like I said, he'll go off topic. Some readings are short. Some are long. He says if you skim the reading you can pass the quiz... FALSE--unless you have no life and study the reading. It sucks when you have a pop quiz on a long reading because he asks real specific questions. He also says that grades don't matter. So if you don't care about your grade and want to have discussions in class about random things, then sure.. take the class. And make time for reading and show up to class.",
            "rating": 3,
            "expected_grade": "B-",
            "created": "2009-12-13T00:24:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "I took this course a couple years ago with Jason and I'm extremely glad I did. The readings can be a bit heavy, but he knows his stuff and you're guaranteed to both learn a lot and come away interested in further African-American Studies coursework. If you read, your life is easy. His quizzes and exams are not hard, and the papers are interesting. There are other professors who are easier than Jason, but if you're seriously interested in pursuing AASP then I highly recommend taking this class with him.",
            "rating": 4,
            "expected_grade": "A",
            "created": "2009-12-07T16:01:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "Jason is very knowledgeable.  However, he assigns too much reading in one night.  He is frequently 5-10 minutes late to class, and if he thinks nobody read, or if a lot of people are missing, he will give a pop quiz (which many people fail).  But that's about it, he doesn't really give many assignments. Plus he frequently goes off topic during class, which is frustrating when he gives a test on things we didn't learn.  His motto is, grades don't matter, as long as you walk away with something. (That of course didn't help me, since I was trying to save a scholarship)lol",
            "rating": 3,
            "expected_grade": "",
            "created": "2009-05-08T00:47:00Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "Jason is a very nice guy, but he assigns wayyy too much reading and nothing ever gets accomplished in class beacause we just end up talking about a bunch of irrelevent stuff that he thinks is interesting. He doesnt give enough exams (wait a min.. did we have an exam?), and his assignments are graded much too stictly. If you want to have a good time in class, take Nichols. If you want an A in AASP dont take Nichols.  ",
            "rating": 3,
            "expected_grade": "B",
            "created": "2007-12-03T18:49:00Z"
        },
        {
            "professor": "Gniesha Dinwiddie",
            "course": "AASP100",
            "review": "She was the worst- very hard to understand in lecture and bad at engaging with the class. Lecture thinned to almost 1/4 of the total by the 3rd week. Gave little to no assistance with midterm review. Without the TAs, I dont know what I would have done. Made some very ignorant, opinion base remarks in lecture as well. Only take if you are interested in doing a lot of reading and learning almost nothing in lecture",
            "rating": 1,
            "expected_grade": "",
            "created": "2010-12-07T15:13:00Z"
        },
        {
            "professor": "Jonathan England",
            "course": "AASP100",
            "review": "Easily the most entertaining professor I had at UMD. Makes class interesting and is very helpful to students. Highly recommend!",
            "rating": 5,
            "expected_grade": "A",
            "created": "2018-12-17T20:01:16Z"
        },
        {
            "professor": "Shane Walsh",
            "course": "AASP100",
            "review": "Dr. Walsh is very passionate about African American History and is very qualifed to teach the subject. However, he tells you to purchase a $90 book, but it isn't required to do well in the class. The class has very few assignments so be sure to do well on them. ",
            "rating": 4,
            "expected_grade": "A-",
            "created": "2020-08-22T00:46:59Z"
        },
        {
            "professor": "Shane Walsh",
            "course": "AASP100",
            "review": "He was a really nice Professor and very understanding too. I have ADHD to sometime it made paying attention a little hard but thankfully he was very understanding as well. His lecture for my class were Mondays through videos and the rest of the class was through zoom so it was pretty nice. But as long as you watch the lecture you'll be ok with the weekly assignment and heads up the essays were 1,000 words for my class but he gave us time just make sure you start early. ",
            "rating": 5,
            "expected_grade": "A-",
            "created": "2021-01-08T02:59:03Z"
        },
        {
            "professor": "Shane Walsh",
            "course": "AASP100",
            "review": "Dr. Walsh is well overqualified to teach this class. He's super passionate about this topic, so he likes to go off sometimes, but it still connects to the information on the PowerPoint and honestly helps me remember everything. The class is super chill, you just have to pay attention and mark down a couple key facts about each main person he goes over. This class does have like five graded assignments besides the final, so just make sure you do well with them. A couple of them are essays, but they are definitely manageable. Overall, pretty good class.",
            "rating": 5,
            "expected_grade": "A+",
            "created": "2022-01-05T02:19:44Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "Dr Nichols is a great lecturer, coming to class was always nice. I would give him 5 stars, but the exams seemed a bit unfair, very disconnected from the lecture material. You could essentially not come to class and be fine if you did the readings, but those aren't the good part of the class. The final exam dropped me from an A to a B+, half an hour for 30 difficult mc questions seemed a bit unfair. The class is great though, just don't expect to come out with an A if you don't put in a good amount of work.",
            "rating": 4,
            "expected_grade": "B+",
            "created": "2022-05-20T18:16:48Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "Very disorganized and unprepared. Our review session and classes don't have anything to do with exams AT ALL. I will say reading was interesting though. Not the best of professors.",
            "rating": 2,
            "expected_grade": "",
            "created": "2022-07-06T01:59:54Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "Professor Nichols is the best teacher ever! Yes, he often gets side tracked and talk about things that are completely off topic. BUT our discussions are always insightful and educational. I learned a lot about African American studies as well as life lessons. Every single topic we've discussed, I've always been engaged in. He is not a boring teacher, he's funny and respectful. The people saying that he's a \"moron\" and an \"awful teacher\" are simply just close minded people that only care about taking this class as a GENED and getting a good grade. This class is more than that and if you do decided to take one of Professor Nichols's classes he will not disappoint.",
            "rating": 5,
            "expected_grade": "A+",
            "created": "2022-10-27T19:26:57.855476Z"
        },
        {
            "professor": "Shane Walsh",
            "course": "AASP100",
            "review": "I took him to get a GEN ED credit, trust me I only went to lecture about 5 times in total and I ended up with an A. I am not advising you to miss most of the semester but he is just a very great professor. Every time I attended his lecture he was very passionate about what he thought and if you need a history credit don't shy from taking this class with him. The semester I took him he had only 1 in-person quiz the rest I mean everything else was done online. When it comes to the class very easy class if you do pay attention and go to class but if not then everything is online/open-book so yea.",
            "rating": 5,
            "expected_grade": "A",
            "created": "2023-01-21T19:40:42.116421Z"
        },
        {
            "professor": "Shane Walsh",
            "course": "AASP100",
            "review": "I had down syndrome, but this course was very easy.",
            "rating": 5,
            "expected_grade": "A+",
            "created": "2023-02-20T17:14:21.806115Z"
        },
        {
            "professor": "Shane Walsh",
            "course": "AASP100",
            "review": "Pretty easy gen ed class and a decent professor.  This course shouldn't take too much of your time.  However, I am not a big of a fan of his lecturing method in class.  He often zips by lecture slides pretty fast that you barely have any time to write down notes or even pay attention to what he's saying before moving on, so I just resorted to taking pictures of the slides in class.   Professor Walsh is very understanding though.",
            "rating": 4,
            "expected_grade": "A",
            "created": "2023-05-06T15:08:51.305098Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "Most amazing class I've ever taken. Super interesting course material and the professor does a great job of teaching and not being biased. Exams are all online and the only assignments are 12 class responses due in class and a final paper.",
            "rating": 5,
            "expected_grade": "A+",
            "created": "2023-05-10T00:39:42.273642Z"
        },
        {
            "professor": "Shane Walsh",
            "course": "AASP100",
            "review": "I took this class as a gen ed. It's a really easy class, only a midterm and a final. There were weekly quizzes (not in class, online usually due by Sunday) but they stopped about halfway through the semester, not sure why. He is a little slow with grading, but he's extremely fair and generous. The only thing I would say is to make sure you go to class because he doesn't post slides. The slides do have a lot of information, but I just take pictures of them and type them up after class.",
            "rating": 5,
            "expected_grade": "A",
            "created": "2023-05-22T00:25:05.969478Z"
        },
        {
            "professor": "George Kintiba",
            "course": "AASP100",
            "review": "The class is easy to do well in because exams are online, but there are a lot of assignments for this class. The class has two papers, a group project, and like 5 exams. Once again the exams are online though so they are not bad. The class is super boring but I am doing well in it and if you need a diversity credit it is not a bad option.",
            "rating": 4,
            "expected_grade": "A",
            "created": "2023-12-01T20:41:06.130531Z"
        },
        {
            "professor": "George Kintiba",
            "course": "AASP100",
            "review": "Undoubtedly, this professor takes the title as the most appalling educator I've ever encountered. The workload is nothing short of a Herculean task: imagine grappling with six exhaustive papers, navigating through four grueling exams comprised solely of short essay questions—this doesn't even account for the midterm. As if this wasn't enough to fray the nerves, the final exam is an unforgiving group oral presentation, executed without the slightest aid of notes. To add insult to injury, the professor not only grades attendance but also finds amusement in students' mistakes, openly laughing when a question is answered incorrectly. Assignments are prematurely graded, often before their due dates, and the introduction of new assignments is so abrupt that they're handed out on the very day they're due. This teaching approach is nothing short of a pedagogical nightmare.",
            "rating": 1,
            "expected_grade": "A-",
            "created": "2024-02-26T23:19:25.829752Z"
        },
        {
            "professor": "George Kintiba",
            "course": "AASP100",
            "review": "Worst teacher at umd. DO NOT TAKE HIM!!",
            "rating": 1,
            "expected_grade": "B",
            "created": "2024-02-26T23:23:09.386830Z"
        },
        {
            "professor": "Jason Nichols",
            "course": "AASP100",
            "review": "Took this over the summer, attendance was mandatory as we had graded class responses and discussions, but the only two big assignments were a final paper and a final multiple choice exam. Dr. Nichols tends to go off topic every single class and he crams so much information into each class that it's almost impossible to keep up. I agree that he's very unorganized and I hated the way his syllabus looks. Almost everyone failed the final because there was so much information he didn't go over and he refuses to update his syllabus. Was often late to class and the class went on for so long, the material is interesting, but he just didn't make it engaging as we would just listen to him talk for almost 2 hours straight. ALSO, REQUIRED TEXTBOOK WAS JUST A BOOK THAT HE WROTE???? Do not buy -- the textbook was so pointless and just a repeat of what he said in lecture.",
            "rating": 3,
            "expected_grade": "B+",
            "created": "2024-02-29T21:46:15.796780Z"
        }
    ],
    "department": "AASP",
    "course_number": "100",
    "name": "AASP100",
    "title": "Introduction to African American Studies",
    "credits": 3,
    "description": "Significant aspects of the history of African Americans with particular emphasis on the evolution and development of black communities from slavery to the present. Interdisciplinary introduction to social, political, legal and economic roots of contemporary problems faced by blacks in the United States with applications to the lives of other racial and ethnic minorities in the Americas and in other societies.",
    "is_recent": true,
    "geneds": null
}