{"average_gpa": 3.735294117647059, "professors": ["Binod Paudyal", "Binod Paudyal", "Jennifer Cho", "Binod Paudyal", "Binod Paudyal", "Binod Paudyal", "Jennifer Cho", "Jennifer Cho", "Jennifer Cho"], "reviews": [{"professor": "Binod Paudyal", "course": "AAST355", "review": "I personally think this professor is very good when it comes to this class. Even though he didn't had any live classes, he tries his best to entertain us by giving us certain movies to watch. While there wasn't any rough work, the given time for the exams were reasonable. Usually exams take about 2-3 hrs to finish. When it came to him, he gave us about like 4-6 hours to finish exams. I think it's due to the fact that the readings he assigned were very dense. And we basically know it's impossible to remember details for at least 8 readings a week. So this teacher is pretty good!", "rating": 5, "expected_grade": "A", "created": "2022-01-23T15:32:57Z"}, {"professor": "Binod Paudyal", "course": "AAST355", "review": "Solid guy. He's pretty lenient on grading when it comes to his exams. There are also a lot of readings assigned, but it doesn't mean you have to read them. You should be watching the movies though because there are usually questions based on those. Some of the movies are good but some of them are also kind of boring and hard to watch. Since it's only three weeks it's worth to get your gened credit.", "rating": 5, "expected_grade": "A+", "created": "2023-06-18T14:29:22.521516Z"}, {"professor": "Binod Paudyal", "course": "AAST355", "review": "Everything already said in the other reviews, but BEST PROFESSOR YOU'LL EVER HAVE!!!!!!!! TRUST!!!!!!!!!!", "rating": 5, "expected_grade": "A+", "created": "2024-03-14T04:05:56.936626Z"}], "department": "AAST", "course_number": "355", "name": "AAST355", "title": "Asian Americans in Film", "credits": 3, "description": "<b>Cross-listed with:</b> AMST328W.\n<b>Credit only granted for:</b> AAST355, AAST398L or AMST328W.\n<b>Formerly:</b> 398L.\nExplores how Asian Americans have historically been represented in the U.S. by Hollywood, and in turn, how independent and Hollywood Asian American filmmakers have represented themselves. It covers the history of racial, gendered, and sexualized representations of Asian Americans in Hollywood, as well as Asian American filmic responses within and outside Hollywood. It also introduces how four basic tools of film analysis mise-en-scene, cinematography, editing and sound work together to create meaning in moving images. It examines how these elements are put together in three different types of films by Asian American filmmakers: narrative, documentary, and experimental. How films function in society to circulate ideas that reproduce and challenge stereotypes about Asian Americans.", "is_recent": true, "geneds": null}