{"average_gpa": 2.8020100502512566, "professors": ["Angus Murphy", "Wendy Peer", "Angus Murphy", "Wendy Peer", "Wendy Peer", "Wendy Peer"], "reviews": [{"professor": "Wendy Peer", "course": "AGST130", "review": "This class seemed like it would be an interesting easy A gen ed. Somehow that was not the case at all. You hardly learn in class and they expect you to watch recorded lecture videos outside of class. I wouldn’t normally mind that but these are like four hours worth of lecture videos. This class goes heavily into the fermentation process but doesn’t discuss history like how or why fermentation created civilization (which is odd since that’s the name of the class). We are expected to take weekly quizzes on lockdown browser on these four hour videos. They will tank your grade if you don’t do well and I think I’ve only gotten a perfect score once. They ask for very specific answers so you almost always need to watch the lecture videos. I have learned absolutely nothing in this class and 100% regret taking it. The projects were easy but honestly quite stupid (making business proposals and creating a law). I wouldn’t recommend this class to anyone. Dr. Peer is nice but that’s about the only good thing I can say. The recorded lecture videos were just rough.", "rating": 1, "expected_grade": "B", "created": "2022-12-16T04:13:17.674007Z"}, {"professor": "Wendy Peer", "course": "AGST130", "review": "Save yourself the stress. Dont take this class", "rating": 1, "expected_grade": "B-", "created": "2022-12-18T03:50:56.614310Z"}, {"professor": "Wendy Peer", "course": "AGST130", "review": "AVOID this class if  you just need 3 credits. This class is not designed for people who don't have understanding of basic biochemistry. \r\nAdvantages: ONLINE class\r\nDisadvantages:\r\n1.Mandates to install additional browser that might be an issue for students with older computers.\r\n2.Takes off points on quizzes, if you provide additional correct information. Expects from you STRICTLY specific answer that resonates with hers.Very closed minded. \r\n3. Demands information on quizzes that was not shown on the slides. \r\n4. Makes you work in groups for THREE large assignments. \r\n5. Requires to read textbook, however 80% of quiz questions are from lectures.", "rating": 2, "expected_grade": "", "created": "2023-09-30T15:46:05.882491Z"}, {"professor": "Wendy Peer", "course": "AGST130", "review": "Waste of time. Don't take this class unless you really, really, care about basic biochemistry and history of fermentation, or you don't mind getting a maximum of 90% on every quiz. She converts random multiple-choice questions to text responses seemingly just to take off points on trivial crap.", "rating": 1, "expected_grade": "B", "created": "2023-10-28T04:14:36.337792Z"}], "department": "AGST", "course_number": "130", "name": "AGST130", "title": "Did Yeast Create Civilization?", "credits": 3, "description": "<b>Recommended:</b> CHEM103, CHEM131, CHEM135, or CHEM146.\n<b>Cross-listed with:</b> PLSC130.\n<b>Credit only granted for:</b> AGST130 or PLSC130.\nFermented foods have played a major role in the transition from nomadic to settled agrarian societies, the establishment of social and religious customs, the expansion of empires, and modern economies.  To what extent are our past and current attitudes towards fermented foods rooted in historical and cultural imprints? Explore the central role of fermentation in human history and culture, the basic microbiological processes underlying fermentation processes, and the processes used to produce and distribute fermented foods. Find out how the fruits, grains, and dairy products used to produce fermented foods are grown and selected.  Students will learn about the development and modern use of fermented dairy products, pickles, bread, tea, chocolate, wine, beer, distilled liquors, and pharmaceutical/manufactured products.\n<i>There will be 5 required live synchronous meetings via Zoom througout the semester. Please see instructor for details. There will be a required live/synchronous meeting on the first week of classes via Zoom on Monday, 8/30/2021 at 5pm. If there is a time change to the meeting time, this will be communicated via ELMS.</i>", "is_recent": true, "geneds": null}