{"average_gpa": null, "professors": ["Sharada Balachandran Orihuela", "Sarah Bonnie", "Keisha Allan", "Sarah Humud", "Kerishma Panigrahi", "Nancy Vera", "Kristofer Reed", "James Rankin", "Andrea Knowles", "Andrea Knowles", "Sarah Dammeyer", "Andrea Knowles"], "reviews": [{"professor": "James Rankin", "course": "AMST298Q", "review": "Rankin was my teacher for AMST298Q/ENGL235, and he was a very accommodating and nice professor. I liked the discussion-based format of the class, and it's definitely a chill gen ed if you're looking to learn about other cultures in a stress-free environment. ", "rating": 5, "expected_grade": "A", "created": "2022-02-02T17:45:30Z"}, {"professor": "Andrea Knowles", "course": "AMST298Q", "review": "really fair & accommodating of any deadline concerns! the course had a lot of readings but when it felt like too much for the class she adjusted it downwards and was also always understanding when people couldn't keep up as closely ", "rating": 5, "expected_grade": "A+", "created": "2022-05-11T18:09:38Z"}], "department": "AMST", "course_number": "298Q", "name": "AMST298Q", "title": "U.S. Latinx Literature and Culture", "credits": 3, "description": "<b>Cross-listed with:</b> ENGL235.\n<b>Credit only granted for:</b> ENGL235 or AMST298Q.\nExamines the poetry, prose, and theater of Latinx communities in the United States from their origins in the Spanish colonization of North America to their ongoing development in the 21st century. Considers how authors use literary form to gain insight into human experience, including mortality, religious belief, gender and sexuality, war and peace, family, language use, scientific inquiry, cultural tradition, ecology, and labor. Also studies how Latinx literary traditions have shaped and been shaped by broader currents in American literature, as well as what connections exist between Latinx literature and social and artistic developments in other parts of the world, particularly Latin America and the Caribbean. Authors may include Alvar Nunez Cabeza de Vaca, Eulalia Perez, Juan Nepomuceno Seguin, Maria Amparo Ruiz de Burton, Jose Marti, Arthur A. Schomburg, Jesus Colon, Julia de Burgos, Cesar Chavez, Ariel Dorfman, Gloria Anzaldua, Junot Diaz, and Cristina Garcia.", "is_recent": true, "geneds": null}