{"average_gpa": 3.282141476613839, "professors": ["L Jen Shaffer", "Tanya Icaza", "Barnet Pavao-Zuckerman", "Michelle Raxter", "Susan Steen", "Miguel Vilar", "Erin Guthrie", "Zev Cossin", "Jared Schultz", "Kevin Gibbons", "L Jen Shaffer", "Miguel Vilar", "Barnet Pavao-Zuckerman", "Miguel Vilar", "Miguel Vilar", "Miguel Vilar", "Miguel Vilar", "Miguel Vilar", "George Hambrecht"], "reviews": [{"professor": "Miguel Vilar", "course": "ANTH222", "review": "I took him over the winter semester for anth222. Very friendly guy with a lot to share. His tests are very fair if you pay even a bit of attention in class and the out of class assignments are not very time consuming nor difficult. The labs are mostly just busy work. though", "rating": 5, "expected_grade": "A+", "created": "2019-01-25T03:53:25Z"}, {"professor": "L Jen Shaffer", "course": "ANTH222", "review": "I get the impression Dr. Schaffer is trying to be relatable, hip, and cool -- she curses in lecture, jokes about sex, etc. -- in reality this often makes lecture incredibly awkward.  I don't mind \"cool\" instructors, but Schaffer tries so hard it's uncomfortable.\r\n\r\nLecture style aside (it's bearable, but annoying), there were other problems with the course:  the weekly quizzes often expected outright wrong answers, the labs had vague questions or questions that didn't reflect the materials we were given, TAs didn't have enough time to prepare for the labs, we were issued the wrong book, and lectures disagreed with the book.\r\n\r\nThe most difficult parts of the course were when I was struggling against Dr. Schaffer's course design, not when I was struggling to remember the material.  ", "rating": 2, "expected_grade": "B+", "created": "2019-12-18T22:00:43Z"}, {"professor": "Kevin Gibbons", "course": "ANTH222", "review": "Professor Gibbons has got some bars.", "rating": 5, "expected_grade": "B", "created": "2021-01-08T21:07:15Z"}, {"professor": "Kevin Gibbons", "course": "ANTH222", "review": "Great professor, and actually makes class a little fun. I've never been great at any science-based class, but Professor Gibbons kind of made it easy to get an A+, STRONGLY recommend!", "rating": 5, "expected_grade": "A+", "created": "2021-08-11T02:51:03Z"}, {"professor": "Kevin Gibbons", "course": "ANTH222", "review": "I took this class over winter and it was super enjoyable. The content was interesting, and Professor Gibbons made it even more fun and interesting for us. Plus, he didn't make us buy a textbook and we got a free open-source one, which is always nice.\r\nHe's a super cool guy and the content is engaging. Would definitely recommend. ", "rating": 5, "expected_grade": "A+", "created": "2021-10-24T03:28:14Z"}, {"professor": "L Jen Shaffer", "course": "ANTH222", "review": "Shes really knowledgeable and clearly cares about the material shes teaching and her students. She includes relevant videos to better explain the information. Also, having all of the lectures on elms was really helpful, whether I missed a class or needed a refresher on the materials. Sometimes can be a little awkward, but otherwise the material is interesting. ", "rating": 5, "expected_grade": "A", "created": "2021-12-08T01:45:05Z"}, {"professor": "Barnet Pavao-Zuckerman", "course": "ANTH222", "review": "If you think that taking a social science natural lab is a good idea, let me stop you there and tell you go do an actual STEM lab. I mistakenly thought this was a good idea and I am a BSOS major. There are weekly online MC quizzes which have the answers on PowerPoints she uploads to Canvas. She has 3 exams which are also online, so the tests aren't that bad. The thing that made me contemplate some dark thoughts was the weekly lab. Lab is usually 16 people on their computers trying to do a worksheet which is literally either you fiddling with bone casts or just scouring websites that are provided. These things are painful and not remotely fun at all, and most of the time, you will have to finish the rest of the lab assignment after class. Other than that, professor is nice, but this class requires too much work for no reason. ", "rating": 2, "expected_grade": "A", "created": "2022-05-26T21:00:31Z"}, {"professor": "Barnet Pavao-Zuckerman", "course": "ANTH222", "review": "I really enjoyed this class. The professor is great and very engaging when lecturing. The labs do get a bit repetitive with mostly measuring bones. The weekly quizzes and labs are manageable as long as you pace yourself. I found class time sufficient for finishing most labs with a few being done on my own. The one difficult point are the exam written questions, which are graded quite harshly. Other than that, highly recommend for a lab science.", "rating": 5, "expected_grade": "A-", "created": "2022-05-31T00:07:38Z"}, {"professor": "Miguel Vilar", "course": "ANTH222", "review": "ANTH222 was not just an easy A, but a genuinely fun class as well.  Dr. Vilar is a great lecturer, exuding kindness and warmth.  Going to lecture is pretty necessary, but if you pay any bit of attention, you'll score high on the exams.", "rating": 5, "expected_grade": "A+", "created": "2022-12-08T17:13:29.836611Z"}, {"professor": "Miguel Vilar", "course": "ANTH222", "review": "Go to lecture! He is an amazing and kind professor.", "rating": 5, "expected_grade": "A-", "created": "2022-12-18T21:00:23.731436Z"}, {"professor": "Miguel Vilar", "course": "ANTH222", "review": "This class was stupidly easy - I finished with a 102%. Labs were easy, TA's were helpful and Professor Vilar clearly knows a lot about the subject. He is very much a morning person and was disappointed my class was not, but he still was very friendly and this class was a great way for a non-stem major to get their DNSL credits. Would recommend!", "rating": 5, "expected_grade": "A+", "created": "2023-01-18T20:32:36.173710Z"}, {"professor": "Barnet Pavao-Zuckerman", "course": "ANTH222", "review": "She's a very interesting lecturer. This class was pretty easy but the labs can take a long time. Weekly quizzes and 2 midterm exams. All quizzes and tests are online open notes. Labs are pretty boring but none were hard. Would recommend this class if you're looking for a chill way to get the DSNL credit.", "rating": 5, "expected_grade": "A-", "created": "2023-05-04T16:02:07.892476Z"}, {"professor": "Barnet Pavao-Zuckerman", "course": "ANTH222", "review": "Class is boring as shit and labs are a total waste of time. The stuff you learn is information you already know if you ever took 9th grade biology+AP Human geography. Fortunately there is no need to go to lecture because the content is so easy so you only need to go to the labs. Total waste of time but it's also probably the easiest science lab so it's not bad. The labs are painfully boring and are mostly just busy work. I think an 8th grader could pass this class.", "rating": 4, "expected_grade": "A", "created": "2023-05-09T21:48:05.604561Z"}, {"professor": "Barnet Pavao-Zuckerman", "course": "ANTH222", "review": "AMAZING TEACHER!!! She cares about her students a lot, the labs are boring and time-consuming but straightforward and easy to get a good grade on, she posts the lectures online, and the exams and quizzes are all online too. Super nice, I recommend her class fs.", "rating": 5, "expected_grade": "A-", "created": "2023-05-19T15:06:11.393983Z"}], "department": "ANTH", "course_number": "222", "name": "ANTH222", "title": "Introduction to Ecological and Evolutionary Anthropology", "credits": 4, "description": "<b>Credit only granted for:</b> ANTH220 or ANTH222.\nAn introduction to the evolution of human physiology and human behavior, the relationship between hominid and non-hominid primates, and the study of relationships between a population of humans and their biophysical environment.\n<i>Students must pay a $40.00 lab materials fee.</i>", "is_recent": true, "geneds": null}