{"average_gpa": 3.553545232273839, "professors": ["Marilyn London", "Tanya Icaza", "Thurka Sangaramoorthy", "Laura Gilchrest", "Laura Gilchrest", "Tanya Icaza", "Thurka Sangaramoorthy", "Laura Gilchrest", "Veronica Sousa", "Laura Gilchrest", "Laura Gilchrest", "Tanya Icaza", "Veronica Sousa", "Laura Gilchrest"], "reviews": [{"professor": "Tanya Icaza", "course": "ANTH323", "review": "Answering as a freshman connection student. It's been one month and so far it's been good. This class is reading and discussion heavy, and we had occasional papers to write (basically not a lot of work so far). She is also really educated and is a great teacher, but the class usually turns into a long Q&A session for questions that can be answered on google. But either way she explains everything really well. She is also very supportive of her students, and is the \"if you don't ask for anything, you won't get anything\" type. If you need help, ask. If you need support, ask. If you need extension, ask. Early. Class is very straighfoward. Put in a effort and you should be fine. No exams/final as far as I know.", "rating": 5, "expected_grade": "A-", "created": "2021-10-11T20:36:59Z"}, {"professor": "Tanya Icaza", "course": "ANTH323", "review": "Professor Icaza is one of those professors where you can tell they genuinely and truly care about not only the subject they are teaching, but the learning and general well-being of their students. ANTH323 was an EXTREMELY interesting class, especially during the time of Covid. This class was essentially a public health class, but viewed from an Anthropological perspective, which was fascinating and made it really fun to learn about. During the class each week, we would have discussions on the readings (which were really interesting, shoutout to Cholera), and discussion was based around the questions that our peers asked and bouncing off of that. There were weekly 10-point online quizzes, which were easy if you payed attention in class and did the readings. There were a few papers, assignments, and a large group paper/presentation, but nothing too hard. I really encourage students of any and all majors to take this course, especially as it is so relevant right now. I am coming out of the class really feeling like I not only learned about the material, but learned how to ask meaningful questions and reflect on my studying. I really hope I get to take another class with Professor Icaza again, she's seriously the best and so understanding. Gives off cool aunt energy. Overall, if you have a chance to take this course or any course with her, take it!", "rating": 5, "expected_grade": "A", "created": "2021-12-09T20:50:00Z"}, {"professor": "Tanya Icaza", "course": "ANTH323", "review": "She is a great professor who tries to make lectures engaging. The workload isn't too much. The papers written are done in groups of around four. The average lecture consists of answering questions that students have, lectures are heavily based on the previous nights reading. There is a lot of chances to improve your grade, the weekly 10 points quizzes are easy if you payed attention in class. The class is easy as long as you do the work. She greatly cares about her students and provides useful feedback on assignments. ", "rating": 5, "expected_grade": "A", "created": "2021-12-16T02:36:38Z"}, {"professor": "Laura Gilchrest", "course": "ANTH323", "review": "Good professor and knowledgeable, however was definitely picky when it came to point deductions, even in assignments where we may have been talking about more opinion-based stuff where we did not know too much about the course content. She also didn't respond to most of the emails I sent her way, and the grades for this (summer) class were put in well after the deadline (2-3 weeks?) without any indication as to why.", "rating": 3, "expected_grade": "A-", "created": "2022-09-12T00:17:26.697102Z"}, {"professor": "Tanya Icaza", "course": "ANTH323", "review": "Grades prospectus: An easy A+\r\nIf you put in the work for this class (and it's not even that much) this class is an easy A+. Grades come from weekly quizzes that you can control F the textbook for word for word half the time, in class participation (just attend and talk once per class) and a couple major papers. Feedback is very clear on the papers so while you may perform poorly on the first one, really take that feedback in, go to office hours, etc. and you can easily get an A average on those papers. One caveat is that the latter half of the course is group papers so you may need to do extra work because she \"balances\" groups so you are always ensured at least one person who does little to no work. She does somewhat take into account your work though and may raise your grade if you do more work than your teammates. \r\n\r\nEnjoyability Prospectus: B+ (Your mileage may vary):\r\nI think to a large extent this depends on your interest in the topic. As someone who has no particular interest in public health this wasn't exactly the most invigorating topic which made it a bit difficult to stay engaged in lecture and textbook readings (to be frank I didn't read the textbook). Prof Icaza is not a dry lecturer however and interacts with the class to a great extent so if this topic is interesting for you, this class is perfect. On the plus she also teaches various college skills on paper writing, citation, organization, etc. in addition to the basic pub health content as she is well aware of the FC nature of the class. Big props to her for that.\r\n\r\nOverall this course was a low work, relatively enjoyable course. If you need the credits this is a fantastic class with a good prof. I highly recommend", "rating": 5, "expected_grade": "A+", "created": "2022-12-15T08:00:45.321801Z"}, {"professor": "Laura Gilchrest", "course": "ANTH323", "review": "A convoluted teacher. Besides her aimless and irrelevant comments throughout class, she does not deviate from her own view on things. I find her to be infatuated with her phd, and assumes he expertise on everything accordingly. Would I take this class again? Yes, but only to perhaps give her the benefit of the doubt. After all she is a self proclaimed “intellect.” Besides that, be wary having any kind of creativity or any form of articulation that does not conform directly with her expectations. \r\n\r\nIf, however, you came to school to learn. Save yourself some time.", "rating": 1, "expected_grade": "A-", "created": "2023-01-03T07:19:00.892873Z"}, {"professor": "Laura Gilchrest", "course": "ANTH323", "review": "She was a nice person, but unfortunately disorganized and unclear about grading. she would just write random stuff on the online whiteboard and people stopped coming to class because there was basically no point in going as there was little engagement. CRA papers were really a pain, and the TAs were kind of mean and harsh graders too. one thing people were really upset about is that she took almost 3 weeks after our final paper was graded to put in grades, so no one knew what the grade was on the transcript which was super annoying. Take this class if its required for your major, but I would avoid doing it as an elective as this class took a LOT of work to be successful.", "rating": 2, "expected_grade": "A", "created": "2023-01-03T16:06:26.344244Z"}, {"professor": "Laura Gilchrest", "course": "ANTH323", "review": "Literally the worst class I have taken in 3 years. Her version of lectures were typing up stuff people said on the board during the lecture, most of the information I learnt I could have read the newspaper/social media and learnt more. She rambles for most of it not making any difficult points, and our TA showed up to around 4/15 lessons. This class is a complete waste of time, don’t bother!! Also side note they weren’t even that nice sometimes when they were the ones missing the lessons! We were told to have some initiative and take matters into our own hands. Hopefully this review is helpful to someone out there, as one of the other guys said, save yourself some time.", "rating": 1, "expected_grade": "A-", "created": "2023-01-20T14:27:05.310282Z"}, {"professor": "Tanya Icaza", "course": "ANTH323", "review": "Great lecturer. There are only 3 papers that you have to write and she gives you great feedback on all of them to help you improve your writing. Very understandable professor. The topic of this class may be a little boring for people who are not into public health, but as long as you do the reading and go to class you'll get a good grade.", "rating": 5, "expected_grade": "A", "created": "2023-08-30T22:16:28.906623Z"}, {"professor": "Laura Gilchrest", "course": "ANTH323", "review": "Dr. G seems pretty knowledgeable in anthropology, and her lectures provide a different perspective on many epidemics that occurred in the past. Her rants feel tedious to sit through at times as she goes on many tangents and the readings she assigns are a bit long, but the assignments aren't too bad if you get the main idea of them. She's a fun teacher to strike up a conversation with and she's always willing to help, but she does grade assignments several weeks after they are due. But overall, I would recommend this course if you want a fairly easy Gen-Ed that provides a unique approach to medical anthropology.", "rating": 4, "expected_grade": "B", "created": "2023-12-04T07:38:52.982283Z"}, {"professor": "Laura Gilchrest", "course": "ANTH323", "review": "ANTH323 was bad only because of Mrs. Gilchrist. The assigned readings are never talked about in class but directly have to do with what our assignments are. We are left to figure out our perspectives on so much material since she assigns 4 hours of reading a week. She is a little self-obsessed while also trying to be relatable to her students and it makes the class agonizing to sit through. She is also so unorganized. I didn't get feedback on a Critical Analysis (something worth 30% of our grade) until two months later and way after the second was due. Her incredibly late feedback is unhelpful and vague. Her rubrics are also incredibly vague making it impossible to complete an assignment feeling as if you did it to her liking and asking for clarification doesn't help as she somehow makes it more confusing when trying to explain it in person. I did extremely well in this class as it isn't too difficult I just would never recommend it unless you have to take it with her for your major or something. If you never went to this class and read a little bit of the assigned readings you could probably do fine as the lectures are useless. The only reason I am still going to the class towards the end of the semester is the group project (which again had vague instructions). I hated this class so much and due not like Mrs. Gilchrest as a person or a teacher.", "rating": 1, "expected_grade": "A", "created": "2023-12-06T17:25:12.420584Z"}, {"professor": "Laura Gilchrest", "course": "ANTH323", "review": "She assigns a ton of reading for a GenEd class. Her classes are not important to your grade, and you can do all the assignments without going. In class, she just yaps on about the readings. She is a nice person, but she is very harsh when grading. She also takes awhile to grade things, so you have no clue what your grade is going to be.", "rating": 1, "expected_grade": "", "created": "2023-12-06T22:21:53.588416Z"}, {"professor": "Laura Gilchrest", "course": "ANTH323", "review": "Dr. G is harsh at grading, assigns a ton of readings, and has lectures that are not that useful. I would not recommend taking this class as it was more effort than my computer science and math class. At lectures, she just talks on a whiteboard the whole class about the readings, and relating subjects. They are somewhat related to the assignments, but it's not necessary. You can do the assignments without going to class at all, and they are not that bad. I feel like the instructions for these assignments are not clear, and if you don't write in her way then you will lose a lot of points. You are better off taking another GenEd because this one is not worth it.", "rating": 1, "expected_grade": "", "created": "2023-12-17T21:06:31.306749Z"}], "department": "ANTH", "course_number": "323", "name": "ANTH323", "title": "Plagues, Pathogens and Public Policy", "credits": 3, "description": "<b>Credit only granted for:</b> ANTH429A or ANTH323.\n<b>Formerly:</b> ANTH429A.\nThe impact of diseases on populations from prehistoric times through the present will be examined, along with public perceptions of disease, scientific breakthroughs on treatment and prevention, and the ways that politics and public health policies can enhance or impede the advancement of disease treatment. The natural history of disease, population structure, and immunity will be discussed. The class will address emerging and re-emerging diseases and the ways that first responders, researchers, and policy makers may affect the outcome of an outbreak.", "is_recent": true, "geneds": null}