{"average_gpa": 3.653870967741935, "professors": ["Charneka Lane", "Jeanne Hanna", "Elijah Edelman", "Laura Gilchrest", "Jeanne Hanna", "Jeanne Hanna", "Jeanne Hanna", "Jeanne Hanna", "Jeanne Hanna", "Laura Gilchrest", "Jeanne Hanna", "Jeanne Hanna"], "reviews": [{"professor": "Charneka Lane", "course": "ANTH263", "review": "Great professor, very responsive to emails and grades based off of argument and not her personal opinion on the issues. I really appreciated the unbiased grading, it made the discussions pretty interesting and not just an echo chamber of her own opinion. I thought I'd hate the class tbh, but it was really enjoyable and I learned a lot from the reading and rather free-form writing assignments", "rating": 5, "expected_grade": "A", "created": "2019-01-20T22:56:17Z"}, {"professor": "Jeanne Hanna", "course": "ANTH263", "review": "Where do I even begin. Jeanne Hanna is one of the most caring, humorous, funny, charming, and understanding professors I've had. She makes class more discussion-based, but still manages to teach. Her grading is fair and clear, but the class by nature is pretty easy. She really cares about her students and doesn't want anyone to feel too stressed. In terms of ANTH263's difficulty, I would give it a 2/5, because the class has a lot of discussion board posts, papers, and projects, but they're all manageable and the grading system is fair and straightforward.", "rating": 5, "expected_grade": "A+", "created": "2019-01-29T14:38:12Z"}, {"professor": "Jeanne Hanna", "course": "ANTH263", "review": "Professor Hanna is the coolest professor I've had at UMD. She is incredibly knowledgeable on her area of study, but is also knowledgeable on how to accommodate college students. She holds office hours weekly on Discord, and provides clear agendas and expectations for class and the assignments. The lectures are always interesting, and missing even one definitely frustrated me, as you can miss a lot of important content and context. She is very hip also and is definitely someone you should get to know, as she is super approachable and friendly. Overall, this is a great class and I highly recommend it for a GenEd credit. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-21T00:48:24Z"}, {"professor": "Jeanne Hanna", "course": "ANTH263", "review": "Professor Hanna is a really good professor. She wants her students to do well in her class and gives them all of the resources they need to do so. I took her class to fulfill an easy I-Series but was also able to have really relevant discussions in her class. Class is mandatory but it is usually pretty interesting. She assigns weekly homework but if you just skim through the readings and podcasts, it shouldn't take too long to complete the work. It is a very easy class to do well in as long and I would recommend putting in the work during the beginning of the semester to complete elective points, so during finals season you aren't stressing over last minute points. I would definitely recommend this class because the workload is super manageable, Prof Hanna is really nice, and the discussions we have in class are pretty important to today's social climate. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-27T18:43:33Z"}, {"professor": "Jeanne Hanna", "course": "ANTH263", "review": "Prof. Hanna was one of the best teachers I have taken so far at the University of Maryland! Her ANTH263 class consisted of one big cultural research project that consisted of multiple drafts of papers. Considering all the papers build off one another, they are not that much work after the first one. Easy tests, and a manageable asynchronous course!", "rating": 5, "expected_grade": "", "created": "2022-09-15T05:55:20.808923Z"}, {"professor": "Jeanne Hanna", "course": "ANTH263", "review": "Prof. Hanna was such a relaxed and nice professor. Her weekly discussions were extremely easy and weekly quizzes were easy as long as you flipped through the slides. 10/10 would love to have her again", "rating": 5, "expected_grade": "A+", "created": "2024-01-24T20:18:20.485497Z"}, {"professor": "Jeanne Hanna", "course": "ANTH263", "review": "shes so sweet. she cares about her students and genuinely wants them to succeed. She's extremely forgiving, understanding, and accommodating. There is a good amount of readings and discussion posts, but its extremely doable and very interesting. The quizzes are also pretty simple, and there is only 1 exam for the final(which was still very easy). The lectures are extremely interesting as well. Love her class and the material. Definitely take her.", "rating": 5, "expected_grade": "A+", "created": "2024-01-25T20:53:17.852572Z"}], "department": "ANTH", "course_number": "263", "name": "ANTH263", "title": "Sexuality and Culture", "credits": 3, "description": "<b>Credit only granted for:</b> ANTH298K or ANTH263.\n<b>Formerly:</b> ANTH298K.\nAn overview of sexuality from an anthropological perspective, looking at aspects of sexuality within our own culture and in cultures around the world. Course topics include the biology and culture of sex, gender, physical attraction, sexual orientation, marriage and mating taboos, fertility control, sexually transmitted diseases, and commercial aspects of sex.", "is_recent": true, "geneds": null}