{"average_gpa": 3.352402402402402, "professors": ["Rachel Pinker", "Derrick Lampkin", "Michael Gerst", "Michael Evans", "Melissa Kenney", "Jeffrey Henrikson", "Laura McBride", "Samantha Kemper", "Jeffrey Henrikson", "Jeffrey Henrikson", "Tracey Centorbi", "Samantha Kemper", "Samantha Kemper", "Samantha Kemper", "Jeffrey Henrikson", "Rachel Pinker", "Jeffrey Henrikson"], "reviews": [{"professor": "Michael Evans", "course": "AOSC123", "review": "So signed up for this class cuz it looked like I'd get a better understanding of climate, yet it really seems like he expects you to already know the terminology, and how things work prior to coming to the class... VERY hard if you have zero understanding, probably VERY easy if you know the topic, but this should be a teaching class for an intro course not an affirmation of prior knowledge.\n\r\nSad cause it looked like it would be good.", "rating": 3, "expected_grade": "", "created": "2013-02-04T16:39:00Z"}, {"professor": "Melissa Kenney", "course": "AOSC123", "review": "Her expectations for the class were clear and due dates were reasonable. Cares about student success and is willing to work with students having difficulties.", "rating": 5, "expected_grade": "A", "created": "2019-01-19T00:44:41Z"}, {"professor": "Rachel Pinker", "course": "AOSC123", "review": "It's pretty clear that her main problem is that she's not very tech-savvy. Unfortunately, since many times require technology these days sometimes it does seem like she's a little scattered. I personally found her slides very helpful when studying for exams so I didn't attend lectures as much since the slides were posted online. There are clickers for participation so remember to show up for the class!", "rating": 4, "expected_grade": "B+", "created": "2019-12-06T19:57:58Z"}, {"professor": "Rachel Pinker", "course": "AOSC123", "review": "Homework takes an unnecessary amount of time, exams are very difficult. I'm only taking this class to fulfill my non-lab requirement, and this class has more work than my major accounting classes. Only take if you have absolutely no other options", "rating": 1, "expected_grade": "A", "created": "2020-04-08T21:32:45Z"}, {"professor": "Dolly Hall", "course": "AOSC123", "review": "Don't take. A TON of nonsense work", "rating": 1, "expected_grade": "", "created": "2020-04-30T16:16:45Z"}, {"professor": "Rachel Pinker", "course": "AOSC123", "review": "This has been one of my favorite courses at UMD. This lady is like a cute grandma. She makes jokes and laughs at them herself which is so cute to watch. Her lectures can get boring because they are so long, but the topics are interesting and apply to your life. As long as you do your work, you should get an A", "rating": 5, "expected_grade": "A-", "created": "2020-05-15T23:44:01Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC123", "review": "Really chill and really likeable guy. Class was easy, only two easy midterms and a final 6-10 page paper, which was not bad. No readings necessary, discussion and lecture were basically optional. You can take this class online no problem, as the modules contain all of the information you need. Quizzes are plentiful and are a small portion of your grade and are extremely easy. Recommend the class for gen ed.", "rating": 5, "expected_grade": "A", "created": "2021-12-04T13:04:39Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC123", "review": "He is an incredibly understanding professor and genuinely wants to see students succeed. He's passionate about what he teaches which made the course very meaningful. He is accessible outside of class and all his assignments have clear rubrics. One of the best professors at UMD.", "rating": 5, "expected_grade": "A+", "created": "2021-12-22T05:22:13Z"}, {"professor": "Samantha Kemper", "course": "AOSC123", "review": "Sami was always open to questions about the course and beyond. Homework and discussions were easily doable as long as you put in the time. It helps if you already know a bit about chemistry and basic physics beforehand, but it is not required. Great professor! If she taught more classes I would take them all!", "rating": 5, "expected_grade": "A+", "created": "2022-02-02T20:54:36Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC123", "review": "Best professor ever. He is super passionate about what he teaches and teaches it very well. The final is honestly really fun even if you are not a science person. The class is easy to follow and keep up with. If you struggle with anything he will be super understanding and flexible as long as you communicate with him. Recommend 100%", "rating": 5, "expected_grade": "A+", "created": "2023-01-26T17:55:21.844153Z"}, {"professor": "Tracey Centorbi", "course": "AOSC123", "review": "Attendance is mandatory, but the exams were fair. I only took this class as a sustainability credit, and I would recommend it to others as it is pretty easy. Some downsides are that there is a lot of work for Friday Discussions, and the clicker questions are just annoying. Other than that, this class is not bad at all in itself, but only kind of annoying at times.", "rating": 3, "expected_grade": "B+", "created": "2023-05-07T15:54:46.016254Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC123", "review": "This class was incredibly easy, and Professor Henrikson made it like that. If you put in the bare minimum effort you will get an A, anything more and you will get an A+. He wants all of his students to succeed, and there is not a single complaint I have about his class.", "rating": 5, "expected_grade": "A+", "created": "2024-01-03T22:04:02.731748Z"}], "department": "AOSC", "course_number": "123", "name": "AOSC123", "title": "Causes and Implications of Global Change", "credits": 3, "description": "Cross-listed with GEOL123.\n<b>Credit only granted for:</b> AOSC123, GEOG123,  GEOL123, or METO123.\n<b>Formerly:</b> METO123.\nResponsible policy and decision making on issues related to the global environment requires understanding of the basic scientific issues, relationships between the geophysical and biological sciences, the impacts on regional and global endeavors, and the political manner in which humans respond. This course embodies an integrated introduction to the broad scientific and social aspects of the global change problem.", "is_recent": true, "geneds": null}