{"average_gpa": 3.3235336712527155, "professors": ["Leslie Berns", "Patrice Kehoe", "Dawn Gavin", "Lillian Hoover", "Matthew McLaughlin", "Robert Hackett", "Aydin Hamami", "Jowita Wyszomirska", "Tyler Hildebrand", "Cindy Cheng", "Curtis Brooks", "Steven Jones", "Zac Benson", "Ruth Lozner", "Rashin Kheiriyeh", "Clayton Dunklin", "Michael Booker", "David Knobel", "Felicia Glidden", "Lauren Boilini", "Alexander Peace", "Lauren Evans", "Lauren Hofer", "Rushern Baker", "Alison Miller", "Stephen Williams", "Jessica Van Brakle", "Matthew Robertson", "Gina Takaoka", "Thomas Bunnell", "Rebecca Basch", "Irene Pantelis", "Rachel Scully", "Brandon Donahue", "Peter Cullen", "Noah McWilliams", "Elizabeth Katt", "Irene Pantelis", "Jowita Wyszomirska", "Peter Cullen", "Jason Kass", "Danielle Leizman", "Elizabeth Katt", "Irene Pantelis", "Jeremy Kunkel", "Jowita Wyszomirska", "Matthew McLaughlin", "Peter Cullen", "Danielle Leizman", "Irene Pantelis", "Jason Kass", "Jowita Wyszomirska", "Matthew McLaughlin", "Peter Cullen", "Matthew McLaughlin", "Matthew McLaughlin", "Matthew McLaughlin", "Irene Pantelis", "Jowita Wyszomirska", "Matthew McLaughlin", "Peter Cullen", "Charlotte Richardson-deppe", "Danielle Leizman", "Brandon Donahue", "Irene Pantelis", "Jill Stauffer", "Jowita Wyszomirska", "Matthew McLaughlin", "Charlotte Richardson-deppe", "Danielle Leizman", "Irene Pantelis", "Jowita Wyszomirska", "Matthew McLaughlin"], "reviews": [{"professor": "Dawn Gavin", "course": "ARTT110", "review": "Professor Gavin was one of my favorite professors thus far. I've had her twice, and she's very clear with her students and very willing to help. My favorite thing about her teaching style is that she actually taught you how to draw, instead of just sticking something in front of you and saying \"go.\" She gives you techniques and ways to look at your subjects that help you improve your realism and quality. She is a tough grader, and it is a good amount of work, but if you talk to her and ask her for help when you need it, she's absolutely willing to help you improve. She also brings her beautiful dog Emilie to class almost ever day, and can you really ask for more than that?", "rating": 5, "expected_grade": "A", "created": "2014-09-18T09:43:00Z"}, {"professor": "Dawn Gavin", "course": "ARTT110", "review": "I  enjoyed Prof. Gavin's class, as she was very friendly with everyone and pretty enthusiastic about our assignments. She graded pretty toughly though, I took this class because I liked drawing but I'm not studying art. If you're in a similar situation, don't expect an A, I think she only gave me one throughout the entire semester of over a dozen assignments. \n\r\nAlso, don't go in thinking this would be a chill class like I did. It requires copious amounts of work and dedication, which I did manage to devote, but it was rough. ", "rating": 4, "expected_grade": "B", "created": "2013-04-25T18:17:00Z"}, {"professor": "Leslie Berns", "course": "ARTT110", "review": "Berns is a good teacher for beginners who may not know the technicalities of the art world. She'll provide helpful feedback on your pieces and is easy to approach and talk to. She grades on effort that is put into art pieces rather than accuracy or high level of mastery.\r\n\r\nLectures on introductory topics, like shape/perspective/etc, by Leslie Berns may seem dry and sometimes, the thoughts she shares are repetitive or take her a while to formulate into a sentence (only because she's trying to explain in the best way possible).", "rating": 4, "expected_grade": "A", "created": "2019-01-21T16:35:12Z"}, {"professor": "Jowita Wyszomirska", "course": "ARTT110", "review": "She's a pretty good professor; you mostly spend the class working on different drawings, while she circulates around the room and gives individual feedback. I found the grading to be pretty easy and fair; I enjoyed her class!", "rating": 4, "expected_grade": "A", "created": "2019-12-27T16:21:44Z"}, {"professor": "Rachel Scully", "course": "ARTT110", "review": "I love her. She is the sweetest professor. Very flexible and understanding.", "rating": 5, "expected_grade": "A", "created": "2020-11-13T15:23:46Z"}, {"professor": "Rachel Scully", "course": "ARTT110", "review": "Took this course online and found her to be a great teacher! She is a nice, caring and very easy-going teacher. Most of the work she gives are just drawing projects and gives you so much time to complete, whether within class or outside. My only critique is she tends to spend a lot of time during class going over each project, explaining every little detail which made exhausted me having to listen for a long period of time. Other than that, I would definitely take this class again. ", "rating": 4, "expected_grade": "A+", "created": "2020-12-09T20:50:46Z"}, {"professor": "Matthew McLaughlin", "course": "ARTT110", "review": "Matt McLaughlin is an experienced and respectable art professor. I took ARTT110 during the winter semester, and found that he worked well to encourage constructive criticism between students, not just dislike or praise on their own. \r\nIn an online environment, he went the extra mile to set up still life sculptures and pieces for us to view and recreate, as well as always be available during the day to ask questions and receive feedback on padlet. The feedback was always honest, and technical. He did not necessarily comment on our ideas to change them, but our execution to bring them to fruition. I think this is a very good balance for an art professor to strike, and it was reflected in the attitude of the students as well. We were encouraged to go further out with our ideas, sometimes maybe too far away from the intended form, but to fully realize them nonetheless. \r\nHe is also pleasant just to listen to, and hear about the people/places/pieces he draws his own inspiration from. ", "rating": 5, "expected_grade": "A", "created": "2021-01-19T19:12:51Z"}, {"professor": "Matthew McLaughlin", "course": "ARTT110", "review": "Professor McLaughlin is a decent prof because the assignments are very reasonable. He's nice about giving extensions on projects if you email him. \r\n\r\nI gave him 2 stars because I can tell from elms that he did not give a single person above a 94 on any assignment!!! And the cutoff for an A is a 94, so nobody got an A in the class! This is honestly just rude of him considering it's a gen ed introductory course for non majors. Because of this, I wouldn't recommend taking this class. It's a real bummer to work very hard in a gen ed and still receive consistently low scores. Art is supposed to be subjective.", "rating": 2, "expected_grade": "A-", "created": "2021-05-21T15:24:05Z"}, {"professor": "Elizabeth Katt", "course": "ARTT110", "review": "Never teach useful stuff but so strict on grade", "rating": 1, "expected_grade": "B", "created": "2021-11-10T16:57:54Z"}, {"professor": "Elizabeth Katt", "course": "ARTT110", "review": "This teacher was willing to give extensions on most assignments as long as you ask within a reasonable amount of time. She also was understanding when people weren't able to make it to class. I emailed her and she let me make up what I missed that day. She also let students who missed class do their presentations the following class, although it wasn't in the schedule. She isn't strict on grading as long as she can see that effort was put into the art. The only thing she won't give extensions for is the portfolio, but that's because we literally have weeks to do it before it's due.", "rating": 5, "expected_grade": "A", "created": "2021-12-17T14:51:46Z"}, {"professor": "Jowita Wyszomirska", "course": "ARTT110", "review": "Professor Wyszomirska was great in person. Her feedback in class was helpful and helped me grow my knowledge in the different drawing styles. The portfolios you create throughout the semester really matter and can impact your grade, so remember to save all your work until the end. She gives at home assignments to do which can be tricky since we are not at home and in a small dorm. When she would grade at home assignments, her feedback was not the best and very vague. I wish she would explain how to improve our at home art work better. Our final was to do research on an artist and write about them and some of their art; it was not too hard. ", "rating": 4, "expected_grade": "A-", "created": "2022-01-18T18:05:24Z"}, {"professor": "Peter Cullen", "course": "ARTT110", "review": "Prof Cullen is so nice!  He is chill and understanding of students and usually lets us go a bit early!  All assignments are available with videos to follow on elms in case you miss class- the in-person experience is much better though so I recommend showing up!  he is understand and pretty chill.  I'm expecting an A and don't have much experience with art.  Just follow the rubric and you should totally be fine!  My only draw back is that there is not a lot of room for creativity, we spend every class so far just sitting in a big circle and drawing whatever collection of items is in the middle of the room.  It's not my favorite class but it is not the worst!  I'm not sure how other professors conduct the class so that might just be the style of all of them.  If you're taking this class though, I think that Prof. Cullen is a great choice!", "rating": 3, "expected_grade": "A", "created": "2022-04-14T20:16:29Z"}, {"professor": "Matthew McLaughlin", "course": "ARTT110", "review": "Prof McLaughlin is a really chill person who knows what he's doing. Our class was a very calm environment, but he does grade a bit more harsh than you might expect for an intro art class. His grading isn't unfair though, and you still can get an A in the class if you put the effort in. He doesn't really give above 94s on the drawings, but with other smaller assignments you can def manage. I wish he gave us a bit more direct instruction - during class he will walk around and give pointers but not always. I really liked his class anyway, it was def a good type of challenging. ", "rating": 4, "expected_grade": "", "created": "2022-04-19T23:35:02Z"}, {"professor": "Matthew McLaughlin", "course": "ARTT110", "review": "Professor McLaughlin was a pretty good professor, and when he did give feedback it helped a lot -- but I often had to ask for it, rather than it being freely given. So if I didn't see the issues in my work on my own, I just didn't find out there was anything wrong with it until I received my grade (and he wouldn't explain why I got points off in the comments on ELMS). He also has the mentality that \"nobody ever gets a perfect score because there's no such thing as perfect art,\" which was a bit infuriating given the lack of feedback. Overall, I liked the assignments and curriculum, but you'll have to try pretty hard to get an A in this class.", "rating": 3, "expected_grade": "A", "created": "2022-05-20T00:00:43Z"}, {"professor": "Danielle Leizman", "course": "ARTT110", "review": "Professor Leizman is amazing and inclusive of all students no matter their artistic abilities. All she cares about is that you do your best and continue to work hard to improve your artwork. She is very understanding and is very flexible. Workload is not hard as long as you attend class and have all of the portfolio requirements needed. I would definitely recommend!", "rating": 5, "expected_grade": "A+", "created": "2022-12-10T23:19:28.347043Z"}, {"professor": "Irene Pantelis", "course": "ARTT110", "review": "Professor Pantelis is a great instructor. The course itself was a bit intimidating, especially since you're working with peers that have great artistic abilities. However, Pantelis does her best to provide guidance to anyone who is seeking it. She's kind and can really help improve your artistic abilities. I would 100% recommend her to anyone interested in taking this course.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T03:14:51.947658Z"}, {"professor": "Jowita Wyszomirska", "course": "ARTT110", "review": "Very nice professor, she is very passionate about her work and offers great advice. Grading is VERY fair no matter your skill level, as long as you try your best. Attendance in class is mandatory and NECESSARY. You will be drawing in makeup work if you miss class and probably fail the class. Outside homework is time-consuming but definitely manageable if you stay on top of your work.", "rating": 4, "expected_grade": "A+", "created": "2023-05-02T02:16:13.320179Z"}, {"professor": "Irene Pantelis", "course": "ARTT110", "review": "Incredible instructor and she is willing to go the extra mile for you to succeed in her class, I asked for a religious exemption from some assignments and she was happy to indulge to the point where she made an entirely new curriculum for those assignments just for me. She is an easy grader if you are willing to put in the effort, but this class is not a cake walk as you will most likely need to put in more time outside of class to finish assignments unless you draw very fast. But professor pantelis was always very helpful and lenient.", "rating": 5, "expected_grade": "A+", "created": "2023-05-28T02:24:45.022835Z"}, {"professor": "Jowita Wyszomirska", "course": "ARTT110", "review": "Very nice professor and actually offers good feedback. Skill level doesn't matter; honestly, it feels like she works with you no matter your level of interest in art. Home project feedback was somewhat vague and attendance is mandatory. Long class so somedays feel longer than others, but after a while when you're just drawing for 2 hours with music playing you don't really notice.", "rating": 4, "expected_grade": "A+", "created": "2023-06-21T06:02:09.020544Z"}, {"professor": "Jowita Wyszomirska", "course": "ARTT110", "review": "Professor Jowita is very kind and gives constructive criticism. I liked the way she organized her class. My main problem with this class is that it is 2.5 hours long twice a week, and you'll feel it. I think the pacing of her class is far too slow and we spend weeks working on a very simple abstract artwork. The days that she was out and her TA subbed in were honestly far better than the days she led class. The teaching style of the TA was to challenge us and try to work at it while Professor Jowita was much more about the basics. A day I remember vividly is when she had us draw a very simple table for an entire class period of 2.5 hours and I was done within 20 minutes. If you have any background experience in drawing, a different professor might be better for you.", "rating": 2, "expected_grade": "A-", "created": "2023-11-09T02:15:57.193377Z"}, {"professor": "Charlotte Richardson-deppe", "course": "ARTT110", "review": "I believe Charlotte is new to ARTT110, but I think she did a great job teaching us the basics of different types of drawing, specifically with charcoal. My least favorite thing about the class was its length (2 and a half hour period) but that was something that could not really be helped. Overall, she is very nice and makes the class very straight forward and simple.", "rating": 5, "expected_grade": "A+", "created": "2023-12-09T18:19:48.348004Z"}, {"professor": "Irene Pantelis", "course": "ARTT110", "review": "I loved this class! It was such a nice break from the structure of a \"normal\" class. Professor Pantellis is very kind and creates a very welcoming environment for all her students. I would highly recommend this course as a gen-ed!", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T22:34:19.541970Z"}, {"professor": "Charlotte Richardson-deppe", "course": "ARTT110", "review": "This class was extremely easy and Charlotte is so nice. Only take this class if you really enjoy art though. Be prepared to stand and draw with charcoal and an eraser for 2 1/2 hours. Also make sure to bring headphones or earbuds or you'll be bored.", "rating": 4, "expected_grade": "A+", "created": "2024-01-29T06:42:18.191675Z"}], "department": "ARTT", "course_number": "110", "name": "ARTT110", "title": "Elements of Drawing I", "credits": 3, "description": "Fundamental concepts, media, and processes of drawing. Emphasis on observation and representation in combination with individual expression. Subject matter includes still life, human figure, nature, the built environment, and conceptual projects.\n<i>Students must pay a $40.00 studio lab fee.</i>", "is_recent": true, "geneds": null}