{"average_gpa": 3.269850746268656, "professors": ["Andrew Harris", "Melissa Hayes-Gehrke", "Melissa Hayes-Gehrke", "Melissa Hayes-Gehrke", "Melissa Hayes-Gehrke"], "reviews": [{"professor": "Melissa Hayes-Gehrke", "course": "ASTR310", "review": "If you focus on lectures alone, Hayes-Gehrke is a fantastic professor. She's clear,  patient with students, and open to student concerns and questions.\n\r\nWith that said, the workload for the number of credits that the course is worth is absolutely atrocious. In terms of what I'd consider to be assignments done out of class, there were \"Pre-Lecture Quizzes\" for nearly every lecture, \"Homework\" assignments for which there were 5, and \"Projects\" for which there were 3. \n\r\nThe \"Pre-Lecture Quizzes\" are exactly as they sound like and take about 30 minutes each to complete. \"HW\" assignments could very easily be called projects in any other classes as they were fairly difficult and took a significant amount of time (upwards of 4 hours each). The 3 \"Projects\" we were assigned were even worse in terms of difficulty and time required for completion, and the last of the projects could well be considered 2 projects with a single due date. Any one of these 4 assignments would constitute a \"Final Project\" in another class.\n\r\nAnother caveat of the class is group work. You have to make resumes to post online to your classmates, against your classmates so that you can hurry and make fairly permanent groups in 10 minute scramble. This group is probably going to be with you for the rest of the semester working on each project. This can be both a good and a bad thing, as it's encouraged that you work with classmates on the HW assignments. Having a group you're comfortable with can make the HW process easier, but you're also stuck with them for 4 months. \n\r\nI've definitely learned a significant amount in this course, but not nearly as much as the work requirement should indicate. I would take the course again, but only if I were warned ahead of time of how much of a time Hayes-Gehrke demands.", "rating": 4, "expected_grade": "B", "created": "2014-12-17T16:25:00Z"}, {"professor": "Alberto Bolatto", "course": "ASTR310", "review": "Professor Bolatto is such a nice guy, which makes it so hard for me to review him so poorly, but he is terrible! You could totally get together for a beer with him, but taking a class with him is useless. I finished the class not understanding a single one of the topics, and it was not for lack of trying. He doesn't really explain anything at all. The information obviously flows clearly in his head, but it does not mean that the class understands. Midterm and Final averages were in the 50s.", "rating": 1, "expected_grade": "", "created": "2009-12-27T02:51:00Z"}, {"professor": "Alberto Bolatto", "course": "ASTR310", "review": "great,upstanding, happy, enjoyable guy. BAD TEACHER. taught a lot of random things, didnt get us grades back until too late. a big problem with this course when 70% of your grade is the 4 research papers about the labs. but when never get the grade back until youve done most of them, you dont benefit from the criticisms at all. suggested textbooks were useless, everything you need to know is on wikipedia. said he would give us all the equations on the two exams we needed and he fooled me twice.", "rating": 2, "expected_grade": "C", "created": "2008-12-21T22:14:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR310", "review": "ASTR310 is a class that takes in a lot of effort in terms of workload and textbook use, but Dr. Hayes-Gehrke is a fantastic professor who works harder than most professors to make sure everyone understands the material and is getting the work done.", "rating": 5, "expected_grade": "A", "created": "2019-12-20T01:36:34Z"}], "department": "ASTR", "course_number": "310", "name": "ASTR310", "title": "Observational Astronomy", "credits": 4, "description": "<b>Prerequisite:</b> ASTR121; and (PHYS171 or PHYS161). Or permission of CMNS-Astronomy department.\n<b>Restriction:</b> Must be in Astronomy program.\nIntroduction to current optical observational techniques, with brief coverage of infrared, ultraviolet, and x-ray techniques. Statistics, spherical trigonometry time, catalogs, geometrical and physical optics, telescopes, and optical instruments. Effects of the atmosphere. Practical work at the observatory using a CCD camera. Some nighttime observing sessions.", "is_recent": true, "geneds": null}