{"average_gpa": 2.779831779118669, "professors": ["Lee Mundy", "Melissa Hayes-Gehrke", "Suvi Gezari", "Leo Deming", "John Vanlandingham", "Sylvain Veilleux", "Blake Hartley", "Jessica Sunshine", "Alice Olmstead", "James Hunt", "Lixin Dai", "Alberto Bolatto", "Douglas Hamilton", "Thaddeus Komacek", "James Hunt", "James Hunt", "Thaddeus Komacek", "Benedikt Diemer", "James Hunt", "James Hunt", "James Hunt", "Thaddeus Komacek", "Benedikt Diemer", "Alberto Bolatto", "James Hunt"], "reviews": [{"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "I've taken three courses with this professor. When I was a freshman in ASTR100, I hated her. I felt like she babied her students and was condescending.\n\r\nAfter taking two more classes with her (ASTR220 and ASTR300), she became my favorite teacher. She's written me multiple recommendations, and has been very helpful to me. She was always willing to listen to questions about grading, and after getting over myself I realized that her methods, while slightly babying, are amazingly helpful for learning the material.\n\r\nYou'll never find a professor more committed to helping every single student do well. If you are willing to actually do the homework (rarely more than half an hour) and do some group projects, you'll come out of it with a lot more knowledge and a professor who will write you great recommendations.\n\r\nI fully recommend all three of the courses I have taken with her.", "rating": 5, "expected_grade": "A+", "created": "2014-12-03T07:25:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Let me start by saying that I am NOT one to write reviews but after taking this course im sorry to say that professor gherke made me feel the need to warn people about her class.im not kidding when I say that this professor does not lecture. She forces you to watch pre-lecture videos of her talking before coming to class (most upwards of 25-30 minutes) which you then take a quiz on. This is horrible for learning as much as she thinks otherwise. I know she doesn’t believe in “traditional teaching styles” but her version of teaching is terrible (because she DOESN’T teach). Imagine teaching yourself and then coming to class and being quizzed everyday --- this is astr100 in a nutshell. Mind you, the grading in this course is insanely harsh.  I am a physics major taking this course for a minor and I was completely floored by the grades I was receiving in this class. She asks incredibly specific questions that ask you to apply what you know (often times trying to trick you) and will not hesitate to give you a 0/5 for a less than perfect answer. Her questions are sometimes so watered down and baby-ish that you will actually get them wrong just by second-guessing yourself. I loved astronomy before this but this professor has been incredibly frustrating. No matter how hard you study, she will never actually test you on anything but repetitive equations and hypothetical scenarios which you’ve never talked about. This class needs to SERIOUSLY be changed. Please save yourself the headache and do not take any course with this professor. Your gpa will thank you i absolutely promise.", "rating": 1, "expected_grade": "", "created": "2014-04-23T15:41:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "After a few semesters, I've realized that professor Hayes-Gehrke is the best professor I think I've had here at UMD. She really, really wants you to learn the material, and teaches it to you how she thinks is best. If you do all the work she assigns (which really isn't that time consuming), I guarantee you will get an A in this class. She teaches you the information that you need to know before lecture in a pre-lecture video and then teaches you the same material with examples in lecture. This really drills the information into your brain. It was because of her teaching style that I got an A+ in the class and over 100 on the final exam, and frankly, I wish more teachers would teach like Hayes-Gehrke does.", "rating": 5, "expected_grade": "A+", "created": "2014-03-12T20:59:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Makes what should be a very easy class, very difficult. The workload was fairly large for a 100-level class. Also, a lot of the work that you submit for this class will be graded very harshly. Take another teacher.", "rating": 2, "expected_grade": "B", "created": "2012-05-21T02:20:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "This class was lot of fun. She had completely new style of teaching. So many activities in the classroom (no problem if you are shy); even planetarium like displays. But there is lot of work to do. You have to watch a pre lecture video before every lecture and do a quiz on that. Then you also have to write a post lecture summary every time. They seemed hard in the beginning but then you get use to it. One can get a in this class, if you devote that time here. Also, I would like to mention I learned so many new things from this course. Its completely wonderful and the only class in the week which I look forward to. TAs are one the best (extremely helpful) and professor is very sweet. There are 3 midterms and a final. There is a \"retest\" paper in all three midterms where you boost your score by doing the same exam you did the classroom now at home. She usually gives 3-4 days for that, and encourages discussing with fellow students. All exams are half multiple choice and half essay types. Scoring policies are extremely fair. Recommended!", "rating": 4, "expected_grade": "A", "created": "2012-01-09T00:52:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "She's definitely excited about the material, I'll giver her that. The way this class is currently structured is also really nice. I took this class once before, and it has really been streamlined since then. The textbook has been scrapped, and has been replaced by online \"pre-lecture summaries\" and \"pre-lecture quizzes\". All you gotta do is watch the pre-lecture summary and then take the 8-point or so multiple choice quiz. Sounds easy enough, but it can get aggravating when the pre-lectures are easily as long as the in-class lectures themselves. Plus you gotta do the darn things three times a week. On top of that, each in-class lecture is followed by an online \"post-lecture summary\" that is related to the lecture material, but oftentimes requires you to think outside the box more.\n\r\nThe exams are also easy (I can't say much about the final, I haven't taken that yet). The attendance policy is forgiving and the lectures are by no means boring. You can tell Ms. Hayes - Gerhke is really trying to find the \"perfect formula\" for getting students to remember information. \n\r\nOne thing I wish she would stop doing is treating the class like little kids. She has a habit of stating something that is blatantly wrong, then asking \"do you agree? Or... is that not the case?\" or something to that effect. Then she waits for people to say WHY her statement is incorrect, and all the while people just sit there going \"durr... do we really have to spell it out for you? Again?\". It might just be another weapon in her arsenal of learning techniques (specifically, the weapon of mindless repetition), and if it is, I don't like it. The flash cards she uses are also kind of lame. The colors of the cards are generic and not at all what I'd expect from a college-level astronomy class.\n\n", "rating": 4, "expected_grade": "B-", "created": "2011-12-15T17:16:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "She is a great person, nice, and never judges students or makes them feel bad. But she does baby the students around, I felt like I was in middle school. I thought this class would be a breeze because of her teaching style but I was wrong. She screwed us all over with the midterms. Yes, there is a curve, and I thought I would be fine, but I ended up getting a B and so did everyone else. She is nice but she is an unfair grader and has a TA that is the most clueless and dumb TAI have ever seen in my life. ", "rating": 3, "expected_grade": "B", "created": "2011-08-20T14:33:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "She was an okay teacher. She dumbed it down which is good if you are not a science person. On the exams, particularly the exam 3, she totally screwed us over. She made all the essays tricky and worded them badly. Basically in discussion the entire class was talking about how terrible she worded the questions to purposefully mess us up. She's a nice person and lectures aren't too bad. \n\r\nIF you wanna take this class..just remember to STUDY YOUR BUTT off for midterm 3. For a core class it could be a lot worse. Overall, I personally I am not extremely fond of her but for science she's not too bad. Just expect a lot of work. ", "rating": 2, "expected_grade": "B", "created": "2011-05-04T23:54:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Interesting class, easy A, lots of work. You might be turned off by her ridiculous demanding of extremely large amount of time for a simple 100 level class, but you get to learn a LOT. You'll be tempted to skip lectures, but she takes attendance. For both lectures and discussion. \n\r\nMy TA on the other hand was useless, condescending, and self-absorbed. She would make herself sound smart by saying terms that we don't even need to know for the exams. Things that she's learned in her \"upper\" level Astr class. I mean, really though? I didn't enjoy the discussion portion mainly because of her.\n\r\nOverall, this class made me decide to minor in Astronomy. If you think it's interesting, or just need a PS core, then I would definitely recommend you taking it with Dr. H", "rating": 3, "expected_grade": "A", "created": "2010-12-10T12:46:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "I am not a science person at all, but the professor made the course material pretty interesting with examples and demonstrations of concepts in class. Some of the material can be difficult, but if you do all the work and study at least a little, you'll do fine. \r\nExams can be graded pretty unfairly on the short answer sections, because sometimes it seems like A LOT more points are taken off than should be for whatever little mistake was made. BUT after every midterm, you can choose to do an easy \"mid-term analysis\", explaining why you got each wrong answer wrong (which you can discuss with your TA) and that will give you an automatic 10% added back onto your midterm.\r\nShe takes attendance every class with a slip you have to personally hand to a TA, and attendance is a good portion of your grade. There is also a pretty time consuming \"pre-lecture video\" (usually about 30 min) accompanied by a \"pre-lecture quiz\" before EVERY lecture, and a \"post-lecture summary\" after EVERY lecture. If you do the quizzes and go to lecture, you never have to read. It's not hard work, but this class does take A LOT of time. ", "rating": 3, "expected_grade": "A", "created": "2010-12-01T00:30:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "The professor is very engaging and interesting. She makes astronomy seem fun, and makes you want to learn. However, she is an extremely unfair grader. You can write a textbook answer on a test, and she will take off 90% of the credit because you skipped one word that did not even pertain to the question. It is still relatively easy to do well in this class, because you get a lot of points for coming to class and completing the homework, but do not expect to do well on any of the tests", "rating": 2, "expected_grade": "B", "created": "2010-10-27T13:23:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "I hate astronomy and do not find this class that difficult. Yeah you have to go to class and discussion but thats like 20% of your grade and can help you a lot. Also my TA was amazing so that helped. No matter how bad you do there is always a 10% increase. So if you get a 80% on a test or homework it becomes a 90%. The teacher is enthusiastic so that is nice, she actually loves the subject. And there is only 8 hw for the entire semester and one is dropped. I would recommend this for someones non lab.", "rating": 5, "expected_grade": "A", "created": "2010-04-27T11:56:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "This class is not that bad if you go to class and do the work.  Attendance is mandatory; everyday you have to write your name on a colored slip of paper that she makes.\n\r\nHomeworks are time-consuming, but not that difficult.  You don't have to read the book.\n\r\nThe class may seem hard at first, but it gets easier.  Your TA can make or break the class, but discussions are very helpful because you always do this multiple choice worksheet which exam questions often come from.\n\r\nThe class is very organized.  She teaches until the end of class.  The professor is always willing to answer questions.  She posts the lectures online.  The slides are very informative, not broad like other professors' slides may be.\n\r\nOne of the best professors I have had.", "rating": 5, "expected_grade": "A", "created": "2010-03-05T00:14:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "I did not like her. The material in class was as easy as you would expect from a 100 level course, but the complicated and downright childish way she does things makes it ridiculous. I haven't been told \"you cannot use a calculator and you must show all of your work in this specific format\" since High School. Get real, lady. Also, the tests are only worth 45% of the grade, the rest is a random mix of homeworks, quizzes, and lecture and discussion attendance. I did not like the fact that only 50% of the points on the tests were multiple choice. Those were easy. The rest were short answer Qs that were graded harshly. I got 3 out of 10 points taken off my answer to one question because I forgot to include the words \"low density.\" \n\r\nAlso, the 2 times I communicated with her, once via email and once in her office, she seemed very snippy and not that willing to help. I really would not recommend taking ASTR-100 with her if you are looking for something that is as easy as a 100 level class should be.", "rating": 2, "expected_grade": "", "created": "2009-12-23T15:08:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Really easy class with very generous curves on the exams and interesting material, but a ton of homework and mandatory attendence in lecture and discussion.  For me, the big downside was the textbook/CD.  It costs $120 and the bookstores won't buy it back once its been opened.  The book is only alright and the CD is required for access to online homework.  If you want either one cheap, e-mail me: alangwor@umd.edu", "rating": 3, "expected_grade": "A", "created": "2009-12-21T20:36:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "This class is ridiculous. She is extremely nice and a good teacher, but if you are looking for an easy class DO NOT TAKE IT. She takes attendence at lecutre, and their is a ton of crazy busy work (online quizzes) which aren't hard but annoying. There are also 9 homeworks, which are pretty tough and graded hard. I wouldn't reccomend this class to anyone unless you are just really in love with astronomy.", "rating": 3, "expected_grade": "B", "created": "2009-05-14T20:39:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "She is an amazing teacher. She is especially good if you are bad at science, because she explains the material in a really clear way and makes it easy to understand. The course material is extremely interesting. The homeworks count for a big part of your final grade, and a lot of what is on the tests comes from the homeworks. There are 3 midterms and 11 homeworks. Overall, a really good class, especially if science isn't your thing.", "rating": 4, "expected_grade": "B", "created": "2008-12-28T02:09:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Very nice professor. exams are straightforward and are based on lectures and homework. lectures are online but she makes lecture mandatory. homework is time consuming. the online text book is a complete waste of money.", "rating": 4, "expected_grade": "A", "created": "2008-12-28T01:28:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "She's an okay teacher, its hard to get an A in that class-you have to really focus and work on it. She's good in trying to explain things and its very helpful to go her and her TA's office hours. The discussion and textbook is very unnecessary. Its important to study the homeworks and lecture notes", "rating": 3, "expected_grade": "", "created": "2008-12-07T16:44:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "This class was way too hard for a 100-level class.  I really don't think it was fair that we couldn't even use a hand help calculator on exams.  She was nice, but it was very very hard.", "rating": 1, "expected_grade": "", "created": "2008-11-13T19:08:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Awesome teacher! She lectures extremely well, and going to class and copying down her notes is very helpful. Her homeworks are a little time-consuming, but doing them will help you learn a lot about the material. She gives quizzes once in a while, but theyre extremely easy (rewards for coming to class).", "rating": 5, "expected_grade": "A", "created": "2008-05-17T18:57:00Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR100", "review": "He is really nice. His power point lectures are interesting.  If you attend lecture you don't really have to read. The homeworks are a bit hard.  The tests are fairly moderate.", "rating": 4, "expected_grade": "B", "created": "2007-12-02T19:29:00Z"}, {"professor": "Lee Mundy", "course": "ASTR100", "review": "Professor Mundy is just amazing. He knows how to engage his students in lectures and makes hard material really easy to Understand. If you go to class and pay attention, there is no way you can fail this class. He gives out lot of extra credit. I had a B and with extra credit I got an A-. TA's are also really helpful. He will not test you on anything that he has not curved, so tests will not seem that hard. Book is not requred at all. Don't even think about taking Astr 100 with any other professor if Professor Mundy is teaching it. ", "rating": 5, "expected_grade": "A-", "created": "2015-05-17T14:57:00Z"}, {"professor": "Lee Mundy", "course": "ASTR100", "review": "VERY engaging professor!! He is super funny and really loves the topics he teaches. He definitely cares about all of his students. He posts all the lectures online, but everyone wants to go to class because he always has awesome demonstrations. The exams are difficult, but the homeworks, in-class assignments and extra credit assignments are very easy!! They are super big grade boosters!! Also, the discussion for this class was my favorite discussion at UMD. It really helps you understand the material!! \r\nHIGHLY RECOMMENDED!!", "rating": 5, "expected_grade": "A", "created": "2012-11-20T14:08:00Z"}, {"professor": "Lee Mundy", "course": "ASTR100", "review": "He is an amazing professor at UMD. He really explains all the topics presented. The TA's are a real help too.\n\r\nHe offers a lot of extra credit (boasted my grade from a B to an A-).\n\r\nAll homework, lectures, and extra credit is posted online.\n\r\nThough attendance is not mandatory, go to lecture because of in class activities that are half extra credit and half go toward you final grade before extra credit.\n\r\nLots of work, but at least a few of the homework questions end up being exam questions so the work is worth it.", "rating": 5, "expected_grade": "A-", "created": "2011-07-26T11:43:00Z"}, {"professor": "Lee Mundy", "course": "ASTR100", "review": "I loved this class, i learned a lot and the things you learn are pretty interesting. Prof. Mundy is very engaging, he tells jokes and does fun class activities and experiments to make the class more fun. He even forces his TA's to be a part of his experiments which can be really fun to watch. \n\r\nHe has homeworks almost every week but if you go to leecture, you'll be fine. You can even look up the questions online, it's no problem. He also offers tons of extra credit which can definitly help boost your grade but most of them are in-lecture activities that are on random days so you should go to lecture so you don't miss them. \n\r\nHe also posts all his lectures online so you have them during the lecture and you can go back to study from them. \n\r\nOverall really great class, the exams aren't easy or anything but definitly doable. You don't even have to get A's on them to get an A in class since he gives so much extra credit and the homeworks and in-discussion quizzes are easy points. I totally reecommend this class, interesting material, nice professor and fair grading. ", "rating": 5, "expected_grade": "A", "created": "2011-05-10T18:48:00Z"}, {"professor": "Derek Richardson", "course": "ASTR100", "review": "This class was interesting and the professor did a good job of organizing the lectures. Homework and exams are pretty difficult, but I consider myself relatively bad in science, and I managed to get an A for the class. Go to his review sessions before exams.", "rating": 4, "expected_grade": "", "created": "2009-09-30T13:40:00Z"}, {"professor": "Derek Richardson", "course": "ASTR100", "review": "pretty cool professor. class is all power point presentations, and pretty boring. hardest part was trying to stay awake. has 2 exams, which were trivial because most of his questions are taken from the online practice quizes. homework was a joke. overall, class was pretty boring, but jus try to pay attention to the stuff he repeats, and you'll be ok", "rating": 5, "expected_grade": "A+", "created": "2009-06-05T12:17:00Z"}, {"professor": "Derek Richardson", "course": "ASTR100", "review": "Richardson is a really really nice guy. However this class was definitely not an easy class at all. He is always open for office hours but homeworks are hard and online work was tedious. \n\r\nAs for the exams I did okay on them but not amazing because astronomy isn't the most interesting subject to me. \n\r\nIf your looking for an easy A def don't take this but it isn't all on Richardson.", "rating": 5, "expected_grade": "B-", "created": "2009-05-13T15:30:00Z"}, {"professor": "Derek Richardson", "course": "ASTR100", "review": "This class was a lot of fun and I would definitely recommend it. Derek is funny and his power points explain the concepts really well. I would suggest going to lecture because sometimes he gives surprise quizzes when he thinks attendance is low. The surprise quizzes aren't hard, but they're easy extra credit points. His exams were easy and the homework wasn't too bad, but the online part of the homework took up a lot of time. Overall, the class was interesting and an easy A.", "rating": 5, "expected_grade": "", "created": "2009-04-27T17:16:00Z"}, {"professor": "Suvi Gezari", "course": "ASTR100", "review": "Homeworks and discussion sections are entirely disjoint from what is on exams.  Her exams are unnecessarily complicated and lengthy.  Avoid her if you can.", "rating": 1, "expected_grade": "B", "created": "2018-01-17T19:42:13Z"}, {"professor": "Alberto Bolatto", "course": "ASTR100", "review": "This class isn't a bad science to take if you aren't a science person. GO TO LECTURE he uses clicker questions for attendance and he will catch you if you try to do them from outside of class. ", "rating": 4, "expected_grade": "A-", "created": "2018-05-22T23:35:22Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR100", "review": "He is an okay teacher, not great. But his class is laid out straight forward. There are countless extra credit opportunities, and the exams are simple. The homeworks are also easy. ", "rating": 4, "expected_grade": "A", "created": "2018-12-13T16:05:34Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR100", "review": "He is fine. Only 5 homework total. Lots of stuff to learn. Disc are fine with a worksheet. Tries to be funny. Cool experiments in class. Lectures are boring at times.", "rating": 4, "expected_grade": "", "created": "2018-12-13T19:00:26Z"}, {"professor": "Leo Deming", "course": "ASTR100", "review": "Professor Deming is amazing! His lectures are extremely thorough and it is very clear he loves the topic and wants to share his interests. The lectures are easy to follow and entertaining and his exams are more than fair. Definitely a great professor for people who are not science majors and taking his class for a gen-ed requirement. He does a lot to make sure you get the material", "rating": 5, "expected_grade": "A", "created": "2020-03-06T17:37:15Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "This class is awful.  I took this class thinking it would be interesting and fun but it's not.  It's a flipped format class and Gehrke doesn't teach at all practically.  You have to watch lectures outside of class and lectures are pretty much a waste of your time.  The quizzes and other assignments are not hard if you are watching the pre lectures but the exam questions are much more difficult because she doesn't stress what is actually important in for the test. Awful class. ", "rating": 1, "expected_grade": "A-", "created": "2020-04-23T19:41:49Z"}, {"professor": "Alberto Bolatto", "course": "ASTR100", "review": "Took ASTR100/101. He was very informative and knew what he was talking about regarding this concept, it even frustrated me sometimes because he would seem so passionate about astronomy while I just didn't understand anything. For online courses, his class was fairly straight forward. Lab every week using some sort of astronomical software (but often times it would take more than 2hrs to do it with a partner), a discussion quiz due a day after your discussion is, plus two lecture quizzes. For the lecture quizzes, you just need a 6/8 at least to get a 100% for participation. I didn't personally feel like I retained information, due to laziness on my part - but I still have a good grade in the class at the end and ended up with an above-average grade on each assignment. ", "rating": 4, "expected_grade": "A", "created": "2020-12-03T16:51:05Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "Dr. Hunt is a chill dude. I loved his class- he is communicative, clear, and entertaining during lectures. During COVID, exams were open note and you could use the internet. A great course if you find this stuff neat. There are boring bits, and if you aren't super into ASTR then this course may drag a lot of the time. ", "rating": 5, "expected_grade": "A+", "created": "2021-01-07T19:20:42Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "THIS IS A REVIEW FOR ONLINE INSTRUCTION:\r\n\r\nI enjoyed the asynchronous nature of the course but the way the professor decided to restructure the course was WAY overcomplicated. There were no grades, just \"badges\" that you get after completing assignments. It was nearly impossible to remember what amount of badges correspond to what grade. There's more about this but it's going to be irrelevant soon anyway. This is my only reason for 4/5 stars. \r\n\r\nAs for the professor herself, she's an incredibly nice person who's clearly enthusiastic about space and teaching it to students. She's very generous when it comes to grading and seems to genuinely strive for student success. ", "rating": 4, "expected_grade": "A+", "created": "2021-05-04T14:17:10Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Dr. H-G is a really kind professor. She cares about her students well-being and tries her best to make an online environment as best as it could possibly be. There were three parts to this class: chapter quizzes, discussions, and lectures. The chapters were fine but you had to complete them on your own time. The discussions were easy. The lectures were fun. The structure of this course was really confusing.", "rating": 4, "expected_grade": "A", "created": "2021-06-02T01:30:46Z"}, {"professor": "Jessica Sunshine", "course": "ASTR100", "review": "Very easy class, half to most of it is online and you only have to come to lecture once a week every Friday, maybe twice. The exams on ELMS are extremely easy and you can figure out the answers very easily (cough cough quizlet cough cough). Attendance to class is mandatory though, they have assignments at the end of every lecture or discussion that you have to turn in. Decent amount of course work though I would consider it simple to do. Overall great class if you need a natural science gen ed with not a lot of time commitment.\r\n", "rating": 5, "expected_grade": "A", "created": "2021-12-01T15:49:24Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "Dr. Hunt is very passionate about Astronomy, and that's what makes him a great teacher. If you find astronomy interesting, this will be an easy class (take 101 the lab class)", "rating": 5, "expected_grade": "A", "created": "2021-12-02T06:53:03Z"}, {"professor": "Jessica Sunshine", "course": "ASTR100", "review": "This is a great class to fulfill your science gen-ed. It is basically an online self-paced course with a couple of hard deadlines throughout the semester. Therefore, you only go to lecture every two weeks and have one discussion section every week. Even though it is self-paced, do not save everything until the end because that is extremely overwhelming. The lectures and discussions are mandatory attendance because they give an assignment at the end of each discussion and lecture. There is some work, but the quizzes are really easy (if you use online resources wisely) so it doesn't feel like that much over the entirety of the semester. Also, the general coursework is extremely interesting.", "rating": 5, "expected_grade": "B+", "created": "2021-12-03T21:50:34Z"}, {"professor": "Jessica Sunshine", "course": "ASTR100", "review": "Great and pretty easy class. For the fall semester of '21 the class was mostly a bunch of online work that you could do at your own pace. It seems like a lot of work but it's pretty easy. She is also very nice and helpful. Highly suggest taking this to fulfil gen ed and for gpa booster. ", "rating": 5, "expected_grade": "A", "created": "2021-12-04T18:27:46Z"}, {"professor": "Jessica Sunshine", "course": "ASTR100", "review": "Amazing professor who understand what it takes to teach this course. It is almost entirely self-paced, which is good for some people. Just make sure you remember deadlines and don't save all of the work until the last day. The projects are easy and kind of fun. She does a ton of demonstrations in class which is super super cool", "rating": 5, "expected_grade": "A", "created": "2021-12-22T01:59:35Z"}, {"professor": "Jessica Sunshine", "course": "ASTR100", "review": "Very amazing professor and TAs are great too. Class is easy, almost too easy, but very interesting and you learn a ton of information in the process. Take this class if you need the credit or are just interested in the Astronomy in the slightest bit and have room in you schedule. ", "rating": 5, "expected_grade": "A", "created": "2022-01-13T22:31:05Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "He's a great professor and really cares about the subject and his students!  I took it during covid so our exams were all online which made it more difficult for me.  However, he is awesome and I recommend the class!  TA's are also super helpful!!", "rating": 5, "expected_grade": "B-", "created": "2022-04-14T19:19:25Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR100", "review": "He is passionate and the TAs were great! Not a fan of the async schedule and layout but one gets used to it. ", "rating": 5, "expected_grade": "", "created": "2022-05-02T19:35:15Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR100", "review": "Professor Komacek is very knowledgeable and passionate and is a good lecturer. ASTR100 is a great course for anyone looking to get a gen-ed out of the way. If you show up to class and give an ounce of effort to the at-home projects, you can easily expect a high B. I can't speak for the other TAs, but my TA, Serena, was also excellent. She made herself regularly available for office hours, responded to emails quickly, and was a fair grader. ", "rating": 5, "expected_grade": "A", "created": "2022-05-02T19:40:14Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR100", "review": "Professor Komacek is a very knowledgeable professor, that is very good at keeping the class engaged. He had many demos to relate concepts, and the course was structured in a “hybrid” fashion. We would show up to lecture every other week, and do work on our own. Everything was open notes + access to the web if we chose to do so(this made things very easy)This was a gen Ed course for me that was very manageable, and I enjoyed the material. If you need a gen Ed , definitely take this course with Komacek.", "rating": 5, "expected_grade": "A", "created": "2022-05-13T13:29:22Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR100", "review": "Professor Komacek was a good teacher and you could tell he cared about the well-being of his students, he wanted each and every student to succeed but also learn while doing it. This class was not particularly hard unless you are bad at self-discipline and time management; there is a lot of asynchronous work that you need to complete with deadlines. I really liked the structure of this class because you would have to go to discussions every week and lecture every other. Sometimes the lectures feel long and are hard to follow, coming from someone who has no past knowledge of astronomy. But overall, this class was a very good class for someone who needs to fulfill their natural science general education requirement.", "rating": 5, "expected_grade": "A", "created": "2022-05-17T01:35:20Z"}, {"professor": "Livingstone Imonitie", "course": "ASTR100", "review": "He is the best TA at the University of Maryland. Very funny and knows how to connect with the students. The class is always a lively and never dull moment. He tells jokes in class and made sure everyone is carried along.", "rating": 5, "expected_grade": "A+", "created": "2022-12-01T02:01:02.579534Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "Dr. Hunt is very passionate about astronomy which makes his lectures engaging and he answered everyone's questions. His entertaining and very clear/communicative about materials on the exams. TAs were a bit harsh at grading but other than that Dr. Hunt is a chill guy and the class was not that time consuming or stressful.", "rating": 5, "expected_grade": "B", "created": "2022-12-07T23:03:25.346344Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR100", "review": "Dr. Komacek was awesome, incredibly accommodating, and tried to make lectures interesting. The class wasn't too hard, it can be easy for the asynchronous work to pile up, but he offered lots of extra credit and was lenient on late submissions. He tries to make basic astronomy digestible and wants everyone to be able to understand.", "rating": 5, "expected_grade": "A+", "created": "2022-12-18T01:45:01.479077Z"}, {"professor": "Jessica Sunshine", "course": "ASTR100", "review": "Class was asynchronous in nature, with all homework assignments being due at the end of the semester. The material is interesting and was an easy gen ed", "rating": 5, "expected_grade": "A+", "created": "2022-12-29T05:32:14.965628Z"}, {"professor": "Thaddeus Komacek", "course": "ASTR100", "review": "Super easy class. Easy A+. My TA was awesome and I had a fun time learning about stars and galaxies. No midterms or finals either. \r\nOnly negative is a lot of reading every weekend but the end result is worth the pain.", "rating": 5, "expected_grade": "A+", "created": "2023-01-15T08:54:25.587576Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Brilliant instructor! Always has a demonstration in class that gets students excited about the material. The course is very straightforward, most of the assignment are asynchronous online. I highly recommend you take if you're looking for a quick and painless no lab science gen ed.", "rating": 5, "expected_grade": "A+", "created": "2023-05-02T17:11:43.644870Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Really nice guy. I'm a little scared of the final since we really haven't learned much. The homework are super easy.", "rating": 4, "expected_grade": "A", "created": "2023-05-05T13:42:30.217663Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Prof Diemer is a great guy and great professor. He explains concepts well and clearly, and has a lot of demonstrations that helped me grasp concepts better. My one complaint is that the entire semester every assignment and quiz were online and open note, but he's making the final in-person and closed note. He totally has a right to do so, and it's probably my bad for taking the class because I heard the final was online. Go to lectures, and please study the material throughout the semester or by the end you'll be cramming for the exam.", "rating": 5, "expected_grade": "A", "created": "2023-05-10T23:07:33.447602Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Straightforward class with a lot of asynchronous work that at times felt like busywork. A big chunk of your grade comes from open note \"appraisals\" so that was nice. Otherwise, the professor seemed knowledgeable and there weren't any issues.", "rating": 5, "expected_grade": "A", "created": "2023-05-15T23:40:02.602965Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Chill guy, very cool class demonstrations. Vast majority of the class is done asynchronously online, and you only have to go to one of the two lectures a week. He added a final exam this semester, it was brutal but only 15% of your grade. It's very easy to go into the final with a 95 or above in the class, so it's pretty low-pressure. Discussions were super pointless, but it may have just been my TA.", "rating": 4, "expected_grade": "A", "created": "2023-05-17T16:38:08.227185Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Very easy. Had us go to only one lecture a week. Discussion was sitting through a presentation and a 50 word response. Homework was a discussion post every other week and a weekly set of questions and you get 2 attempts. Chill prof.", "rating": 5, "expected_grade": "A+", "created": "2023-06-20T21:05:06.363538Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "He is very passionate about astronomy, which is what makes his lectures engaging (for the most part). However, he rambles a lot (not necessarily a bad thing, since it's connected to the material) which is why I sometimes lost focus during the lectures. Overall, he is a very good lecturer, but just prepare for him to ramble about the material.", "rating": 4, "expected_grade": "A", "created": "2023-07-20T13:52:34.427562Z"}, {"professor": "Jongwon Park", "course": "ASTR100", "review": "Jongwon is pretty solid TA who is pretty helpful for when you are confused on material. However, just be aware, he's a pretty tough grader.", "rating": 4, "expected_grade": "A-", "created": "2023-08-08T19:45:43.915889Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "Dr. Hunt teaches well and the class is pretty easy.", "rating": 5, "expected_grade": "A-", "created": "2023-08-20T04:41:34.033113Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "He is a very nice person and very passionate about his craft. My only complaint is that there is rarely any test preparation and the exams are really difficult for having no great resources to study. This is an introductory class and it is genuinely so difficult. I would not recommend taking it if you are not interested in astronomy.", "rating": 4, "expected_grade": "A-", "created": "2023-11-30T15:13:51.493802Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Don't take this class for a gen ed. It's unnecessarily difficult.\r\n\r\nThe quiz and exam questions are ridiculously conceptual as if you had years of experience in astronomy already, and exam averages for the fall 2023 semester have been very low (e.g. 70s for multiple choice and 40-50s for the short answer).\r\n\r\nIn conclusion, if you're looking for a gen ed and an introductory astronomy course, this is not the course to take. I also don't get the point of the lecture and discussion activities from the book if they're just for completion.\r\n\r\nOne big complaint for projects: what is the point of having a \"wow factor\" make up 10% of the grade? That's subjective, no?\r\n\r\nI think the professor needs to take into consideration that this is an introductory astronomy class and readjust the questions and rubric for exams.", "rating": 1, "expected_grade": "", "created": "2023-12-03T13:45:48.507161Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "I would have given Professor Diemer 5 stars because he is so passionate about what he teaches but the way the class is set up is horrible. Diemer will answer any questions and you can tell he really loves astronomy and wants others to love it too. What is so horrible about this class is the grades. I mean it is a 100 level introductory course and the midterm MCQ averages was in the 70s and the short answer was in the 40s. This has happened with both midterms and no change has been made. And the individual tests are not curved. The class isn't over yet but Diemer said he will probably curve overall grades at the end. The lectures consist of a 50 slide slideshow each lecture of new information. Also each class there is a set of workbook problems to do as participation but we never go over the answers and even if you get every single answer wrong, you will get a 100 on them. There are also 2 projects but you can't get above a 90/100 without a \"wow factor\". Seems silly for a college class. My TA was not good at teaching so discussion sections were also pointless. I think that this class just includes way too much information that needs to be taught so my issues are with the content and not the professor. Essentially find a different science to take as your gen-ed as this one is way too much work for no reward (not an easy A).", "rating": 4, "expected_grade": "A-", "created": "2023-12-06T16:03:16.901540Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "I skipped this class for 2 months because the course material aligns almost zero with the quizzes, midterms, and projects. My grade has relied exclusively on hours of doing my own readings, only for the quiz questions to be pulled from online quizlets. The projects are graded with bias and without explanation, and the short answer midterm questions are ridiculously difficult for a class advertised as a manageable gen-ed for non-STEM majors.", "rating": 1, "expected_grade": "B+", "created": "2023-12-07T03:58:51.305448Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Let me start off by saying that Professor Diemer himself is a great guy who is very passionate about astronomy which greatly shows in all aspects of his class, but especially his lectures. He was detailed and open to questions, presented organized slides, and honestly knew what he was talking about. My issue with this class is actually not him as a person, but how he set this class up. I don't believe it is set up with the success of the student in mind. In the syllabus, the grading breakdown makes sense and seems easy. However, as the course goes on, at least for me, I felt like I put in all the work I possibly could by going to every lecture and doing the graded participation, doing the weekly quizzes, and the projects (all getting high grades) and yet the midterms would genuinely throw all that work in the garbage with the class averages themselves being 60s for the multiple choice and 50s for the short answers (and then without a curve!)\r\n\r\nObviously, my biggest struggle in this class was the exams (both midterms and final). This is an introduction to astronomy class. I'm here for a gen ed, as probably half the class is too. I understood that as we went through the semester that the information being taught was cumulative and every lecture built off of each other. This caused the content to be very heavy and have a lot of aspects that took a long time to understand completely and handle all at once. That being said, the exams themselves took everything from the 100 level lecture content to a 300 level application of knowledge. I had never taken a physics dominated class in high school, which might have been my downfall, except for the fact that this class is labeled as a 100 level class and should be even ground for all students to be able to understand and apply concepts equally. Exam questions were detailed to the point where I would have to remember the exact bullet point on the exact part of my notes to even have an attempt to get it right, which to me should just not be how an exam is set up. I feel like as an intro course it should be more about applying general concepts and showing efficiency in understanding those concepts instead of giving extreme details. \r\n\r\nFor reference, I have also been a straight A student, and this is the first time I will likely be getting a C+ as a final grade in my life. And the only reason I am putting this much time and energy into writing this long review is because when I looked at these reviews during the dark time when I got my first midterm grade back everything seemed to be sunshine and rainbows and I genuinely felt gaslighted. So here's the warning I wish I had: If you love physics, possibly read about black holes, general relativity, and the very complex life cycle of stars in your free time, AND already know or have an interest in all the characteristics of every planet (and every single one of their moons!), take this class! You will absolutely love it, and might even do better than the rest of the class for the exams. I wish you the best of luck, you STEM geniuses. For those who are social science based, thought this would be an okay gen-ed natural sciences credit because the sun and the moon are interesting, and think that a nice professor is equivalent to an easy class, I'd like to see you try. Please take my experience as a lesson to stick to what you're good at and go with PSYCH100. I promise you, ignorance is bliss when understanding the solar system and the whole universe itself.", "rating": 2, "expected_grade": "C+", "created": "2023-12-11T16:47:23.761295Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Reads of slides, few assignments to prepare for exams and quizzes, hard quizzes and exams, doesn't promptly reply to emails", "rating": 1, "expected_grade": "", "created": "2023-12-12T06:33:08.572835Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Worst professor ever. Hard quizzes and exams and boring lectures", "rating": 1, "expected_grade": "", "created": "2023-12-12T21:58:18.363028Z"}, {"professor": "Sander Somers", "course": "ASTR100", "review": "Sander was an incredibly helpful TA, available to answer questions, and if the discussion section was interested in something he would provide more information, even if it was not class related. He kept discussions fun and if you enjoy the class, and you interact with the people in your discussion, you'll have a great time, and get a way better understanding of the way the universe works.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T22:21:40.193892Z"}, {"professor": "Sander Somers", "course": "ASTR100", "review": "Best TA ever. Made discussions fun and interesting. Made sure every student was able to understand all the concepts and cared about everyone's ability to succeed. He was able to answer any question someone had and knew a lot of information about the subject. I'd 100% recommend choosing Sander because he is definitely the best TA to ever exist.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T22:21:40.615002Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Professor Diemer is an excellent professor. He made sure everyone understood the content and cared about everyone's success. He also did many demonstrations in class that were very cool. There is assignment class every class, but it is only graded for participation. There are 2 projects in the class but they are easy to do and you have plenty of time to complete them. In total there are 2 midterms and a final that are all pretty evenly spaced out. He posts lecture slides at the end of each lecture so you don't have to take notes of you don't want to. The discussions are once a week and they cover things that were taught from the previous week. Overall this is a very interesting, fun, and pretty easy class, if you have a AN INTEREST IN ASTRONOMY.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T23:36:32.168183Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Overall, this is a good course to take to fulfill your gen ed. Most of the homework is made up of reading about 20 pages of a textbook every week, and taking an open note, open internet quiz. Discussions and lectures are both pretty easy, but there are participation exercises you need to do, so you need to show up to both the discussions and lectures. In terms of the exams, there's a quite a bit of material to learn, so you will need to study for 1-2 hours for each exam. However, if you do the practice exams, you should be fine. Overall, I would take this course as a gen ed.", "rating": 4, "expected_grade": "A", "created": "2023-12-19T23:49:24.189499Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "I took 5 courses during the semester including a law class. Ironically, I took ASTR100 as an \"easy gen ed\" to count as an elective. Biggest mistake EVER. I thought I was the only one struggling but it turns out most people were. points taken off without explanation, TA was no help. I studied harder for this class than any other and still barely passed  AFTER THE CURVE. He's a nice professor but proceed with caution. he left all the Grading to the TA's who were tough. I regret taking this class.", "rating": 1, "expected_grade": "", "created": "2024-01-04T14:29:17.712070Z"}, {"professor": "Benedikt Diemer", "course": "ASTR100", "review": "Good professor but terrible class with hard exams and useless projects", "rating": 1, "expected_grade": "", "created": "2024-01-09T19:38:52.522354Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "Prof. Hunt was awesome! He is so passionate about astronomy, and his lectures were very interesting. Test questions come directly from the slides he presents in class, so if you pay attention, you're pretty set. He really seems to care about his students and really enjoys what he does, I would highly recommend him for ASTR100.", "rating": 5, "expected_grade": "A", "created": "2024-02-14T16:27:48.797944Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "He's a great professor and is super passionate about astronomy, but he tends to ramble a lot, which made lecture quite boring.", "rating": 4, "expected_grade": "A", "created": "2024-02-15T14:56:21.124029Z"}], "department": "ASTR", "course_number": "100", "name": "ASTR100", "title": "Introduction to Astronomy", "credits": 3, "description": "<b>Credit only granted for:</b> ASTR100, ASTR101, or ASTR120.\nAn elementary course in descriptive astronomy, especially appropriate for non-science students. Topics include the Sun, Moon, planets, stars, and nebulae, galaxies, and evolution of the Universe.\n<i>Discussion sections do not meet the first week of classes. Attend lecture before coming to discussion section.</i>", "is_recent": true, "geneds": null}