{"average_gpa": 2.825, "professors": ["Melissa Hayes-Gehrke", "Grace Deming", "Alan Peel", "A Sharma", "Rob Olling", "A Surjalal Sharma", "Massimo Ricotti", "Konstantinos Kalapotharakos", "Marvin Jones", "Marvin Jones", "Douglas Hamilton"], "reviews": [{"professor": "A Sharma", "course": "ASTR300", "review": "Very boring, it's hard to maintain your focus in class", "rating": 2, "expected_grade": "A-", "created": "2019-04-04T15:39:31Z"}, {"professor": "A Sharma", "course": "ASTR300", "review": "You'll pass but this class will be the most boring/useless ass class you'll ever take. 60-80% of people don't show up to the lectures at all because he only reads off slides and the exams are completely different and are harshly graded. Average on final this semester was an E. 90% of us were just here for the CS upper elective so no one really cared about the class and Sharma doesn't give a rat's ass either", "rating": 1, "expected_grade": "A+", "created": "2019-05-26T00:19:41Z"}, {"professor": "A Sharma", "course": "ASTR300", "review": "Rather difficult course. Class is extremely boring and the professor's teaching methods are absolutely whack. The exams are rather difficult and consists of a lot of writing and multiple choice. The homework is harshly graded and there are no grades that can be dropped in this course. You're better off taking a different course.", "rating": 1, "expected_grade": "C-", "created": "2019-12-08T04:35:01Z"}, {"professor": "Sarah Weatherly", "course": "ASTR300", "review": "Graded homework extremely harshly. Almost impossible to get a perfect 100% on any homework that she grades. I would avoid her as a TA.", "rating": 1, "expected_grade": "C-", "created": "2019-12-08T04:36:18Z"}, {"professor": "A Sharma", "course": "ASTR300", "review": "When I first read his reviews I didn't believe that they were accurate, I thought that these people just didn't like the subject material. I was wrong. This man has found a way to be ungodly boring whilst talking about supernovae. I really enjoy the material of this class, but he is so boring its hard to pay attention as all he does is read slides of information he took from the book. The course material is not very difficult, the difficulty is showing up to class. He's not a bad guy or anything, but I think if you can't hold the attention of people like me, who want to pay attention and learn, than you probably should not be teaching. ", "rating": 2, "expected_grade": "A-", "created": "2020-10-15T19:05:39Z"}, {"professor": "A Sharma", "course": "ASTR300", "review": "Lectures are boring. After the first 2 weeks, I didn't go to a single lecture. \r\nAll homework, exams, and quizzes can be found online on Quizlet.\r\n\r\nEasy A", "rating": 3, "expected_grade": "A", "created": "2021-01-26T21:04:04Z"}, {"professor": "Konstantinos Kalapotharakos", "course": "ASTR300", "review": "can't understand him", "rating": 1, "expected_grade": "", "created": "2023-01-25T16:07:07.762120Z"}, {"professor": "Konstantinos Kalapotharakos", "course": "ASTR300", "review": "Assigns way too many homeworks (two homeworks a week that take at least 4 hours total) for an Astronomy course meant for non-majors. Gives a quiz almost every lecture. Can't hear what he is saying for most of the lecture. Apparently won't be giving a formula sheet for exams. Likely a researcher taking a lecturer position.", "rating": 1, "expected_grade": "", "created": "2023-02-18T15:34:32.025897Z"}, {"professor": "Konstantinos Kalapotharakos", "course": "ASTR300", "review": "Pearson the class.  \r\n\r\nPay $70 to rent their digital textbook.  Weekly online homework, 40-70 Pearson textbook questions (many multipart), in addition to written homework which can be 3-10 questions (multipart) in the same week (More Pearson).  The homework isn't bad content wise, but it takes a long time since there's so much of it, feels like I'm back in highschool, its all busy work.  Lecture attendance is graded (No phones or laptops), where you will get to witness the teacher read off slides (Provided by Pearson, you might think he is seeing them for the first time) word for word, in an accent, mumbling.  Exams will also be entirely Pearson questions.  I struggle to think of a single thing in this class the teacher has done himself.  Grading?  We are just over two months in and we have gotten ONE homework back.\r\n\r\nAll the Pearson questions make the class very easy, but this class has been the perfect example of how to teach one of the most exciting topics in the most boring way imaginable.  I'm glad this is my last Astronomy class, or I might have picked a different concentration all together.  He isn't the worst professor ever, but he might be the most disappointing.", "rating": 1, "expected_grade": "A", "created": "2023-03-25T00:51:16.135823Z"}, {"professor": "Konstantinos Kalapotharakos", "course": "ASTR300", "review": "Mumbles during Lectures with an accent. All he does is read off slides too which he does not post on elms since they are based on Pearson. Pearson textbook costs $70. There are weekly online homeworks (30-80 questions) (multiple Choice + Math) (all answers are on Quizlet) and weekly written HWs (4-10 Questions). He also doesn't notify the class that HW is out and due, you have to check yourself. He also doesn't provide a formula sheet for the midterms (and there are a lot of formulas to memorize) however he did provide one for the final. I'd recommend taking a different course such as ASTR340 (pretty similar to this class) or with a different professor if you don't already have a good understanding of Astronomy because it would be very hard to follow long. I enjoy Astronomy a lot (taking it as a minor) but this prof/class just made it a snooze.", "rating": 1, "expected_grade": "A-", "created": "2023-05-19T03:51:48.678662Z"}, {"professor": "Konstantinos Kalapotharakos", "course": "ASTR300", "review": "Had him for ASTR300 which is geared towards non-science majors but he makes this 3 credit class feel like 4 credits with the workload he assigns. Every week we had two homework (written and online), one of which ranged from 40-60 questions which could take upwards to 2 hours to finish. He’s also a pretty subpar lecturer because his voice is very difficult to understand and he doesn’t engage with the material in anyway outside of lecture quizzes. His first exam was super long but the second one was  pretty fair. Additionally he was very generous with the final. Overall do not recommend especially if you’re looking for a low maintenance class.", "rating": 2, "expected_grade": "", "created": "2023-05-23T20:48:21.402140Z"}, {"professor": "Konstantinos Kalapotharakos", "course": "ASTR300", "review": "Where do I start with this class and professor. First of all the class material isnt that bad, but I think the professor just did a bad job at teaching (that is if u want to call what he did over the semester \"teaching\" because quite frankly its not). \r\nI am a senior CS student doing my ULC in Astronomy, this was my last ASTR class and it was definitely the worse out of the 4 I took by far. \r\nThis guy thinks he is the Sun and the world revolves around him and as if students have nothing to do but work on his class. 13 Mastering HWs that take a minimum 90 minutes each to complete, in addition to 8 written HWs that take a minimum of 3 hours each. All that wasnt enough for Prof. Sun! There was two midterms each having more than 35  questions and a final that was about the same. You'd think that is it? But no, this guy will never fail to surprise you! There were graded lecture quizzes every class that were worth 10% of out total grade. \r\nI was taking CMSC4XX classes and I honestly had a harder time in this class than all other combined. This class was said to be for NON-SCIENCE majors, but bro was talking about quantam physics through the semester. It honestly amazes me how UMD allows such a class to exist. \r\nOther than that, the  professor in class whispers rather than speaks, and all was done is slides from pearson that we could read from home, but he didnt give us access to them until mid-semester ish. He is also rude to students, he doesnt like students to use their phones during class and will ask you not to in a rude way. One time a student was using their phone and had their airpods on, so he asked  him or her  to put it down but the person wasnt hearing him, so what he did is he started banging on the table. \r\nGrading takes forever, 5 out of the 8 written hws were graded after the final was taken in a week.\r\n\r\nI think this might be his first time teaching, because I couldnt find reviews about him at the start of the semester. \r\nIf this class is offered again with a diff professor, give it a try. But if it was him teaching, AVOID HIM BY ALL MEANS!", "rating": 1, "expected_grade": "C-", "created": "2023-05-24T20:44:39.543725Z"}, {"professor": "Konstantinos Kalapotharakos", "course": "ASTR300", "review": "best guy ever. He's really awesome and cares for his students. He explains things very well, even if it's a hard concept.", "rating": 5, "expected_grade": "A", "created": "2023-09-09T03:38:01.423850Z"}, {"professor": "Konstantinos Kalapotharakos", "course": "ASTR300", "review": ".", "rating": 5, "expected_grade": "A", "created": "2023-09-11T03:50:32.064807Z"}, {"professor": "Marvin Jones", "course": "ASTR300", "review": "this guy is a good professor, he tries to make class engaging but most of you are going to be on your phones anyway lol. besides that the homeworks are easy, and you will be doing a couple group presentations throughout the course just 5-10 minutes. and the exams are also easy as long as your do his study guides, they are basically 1-1", "rating": 5, "expected_grade": "B+", "created": "2023-12-08T20:50:32.389934Z"}], "department": "ASTR", "course_number": "300", "name": "ASTR300", "title": "Stars and Stellar Systems", "credits": 3, "description": "<b>Prerequisite:</b> ASTR100 or ASTR101; and completion of the CORE Distributive Studies requirement in Mathematics and Sciences or General Education Fundamental Studies requirement in Mathematics. Or permission of CMNS-Astronomy department.\nDesigned primarily for non-science majors. Study of stars-types, properties, evolution, and distribution in space; supernovae, pulsars, and black holes.", "is_recent": true, "geneds": null}