{"average_gpa": 3.5029082774049214, "professors": ["Brent Goldfarb", "David Kressler", "Jeffrey Mund", "Le-Marie Thompson", "Le-Marie Thompson", "Brent Goldfarb", "Jose Teixeira", "Le-Marie Thompson", "Le-Marie Thompson", "Jose Teixeira", "Jose Teixeira", "Brent Goldfarb", "Le-Marie Thompson", "Brent Goldfarb"], "reviews": [{"professor": "Jose Teixeira", "course": "BMGT461M", "review": "A compassionate and understanding teacher who gives you the grade that you deserve. Very responsive to questions and concerns. I learned a lot from his engaging entrepreneurship course on how to start a venture and adapt to challenges throughout the growth of my business.", "rating": 5, "expected_grade": "A", "created": "2022-12-25T03:04:29.790264Z"}, {"professor": "Jose Teixeira", "course": "BMGT461M", "review": "Compassionate and understanding professor who gives you the grade you deserve. Very responsive to questions and concerns. I learned a lot from his entrepreneurship course on how to start a venture and adapt to challenges throughout the growth of my business.", "rating": 5, "expected_grade": "A", "created": "2022-12-25T03:08:24.907192Z"}, {"professor": "Jose Teixeira", "course": "BMGT461M", "review": "I don't know who wrote the previous reviews, but I can assure you that no one my class would have said that.\r\n\r\nI just want to preface that he was following someone else's course structure, so it wasn't completely his fault. That being said, he didn't help it be any better.\r\n\r\nSTRUCTURE: The structure of the class is that you are put in groups and are required to make an actual business and make real money. We then had two \"Shark Tank\" presentations in the beginning and end of the class. In theory, this is really good practice for people that really do want to go into entrepreneurship, and I would say that for some people in this was the case. Another part of the class was that every week, there was some nontrivial assignment that we had to do, which bothered a lot of people. One example was this 20 page HBS paper about someone starting a company. Yes, in theory it's a good idea to read and learn from it, but the paper takes multiple hours to read, and this is in addition to the company we are supposed to be running for this class. The worst part is that during class, he made everyone that didn't read it feel guilty about not doing the assignment, and then admitted that if he were in our shoes, he probably wouldn't have done it either. Like what? Something else that caused a lot of stress was that many times we were given assignments that were due next class. These assignments were easy either. For example, there was a 2-hour challenge to make as much money as possible in that time and we were told on Thursday about it and it was due before next class on Tuesday. This meant finding a time that worked with everyone in your group and it was hard for certain people, especially for those that were commuting and working jobs. Many big assignments were given to us with this short of a notice and most students in the class complained about it. To his credit, Jose did end up removing the weekly assignments the last few weeks, so maybe for next semester he will make them less frequent. It was his first semester teaching and we did tell him most of our complains, so hopefully he will be able to fix it for next time he teaches the class.\r\n\r\nGRADING: The grading for the class was definitely the worst part of the class. For assignments, pretty much as long as you did what you were supposed to do, you would get 100. They are not meant to trick you - it's more just so they can see you did the reading and that you understood it. This was really nice. However, the way you are graded in the class as a whole was a mix of \"Karma Points\" and Profits Ranking. So you are basically graded compared to the rest of the class. If you make the most money, you get an A in the class. So you might ask, where do the grades for the assignments play in? No one knows. He said that the assignment grades would count as Karma points. How many karma points? No clue. Most people got an A for all the assignments and still didn't end up getting a A. It seemed like he would just give out karma points randomly and that it didn't really count. For example, when he asked who did the reading for the HBS paper, a number of people raised their hands, and he said \"You all get karma points\". How many? No one knows. Did he write down who raised their hands? No. So it seemed like the was just pulling Karma points out of no where. Another issue of the grading was the profits. Since whoever made more money would get a better grade, it seemed like people would \"cheat\" to make money. Cheating could be by getting their friends and family to spend a lot of money. And why wouldn't you? Your grade depends on it, so you might as well do whatever you can. If there was a better grading system, I think a lot of people would have been more honest. A funny thing happened was that one group was selling bracelets and he thought it would be nice to buy 20 bracelets from that group to give to the class to show his appreciation of how well we handled the class at the end of the semester. While this was nice that he was supporting a group, a lot of students were mad because he was just giving them a better grade by doing that. I, and most students, felt that the grading system like this was making grading a lot more hostile than it should be. An entrepreneurship class should be collaborative, not competitive.\r\n\r\nTRDR: Obviously, I still did pretty well in the class and I think most people got over a B, but overall the class was a mess. You are probably going to have to put in 5+ hours a week to get a B, and 10+ a week to get an A, so if you are looking for an easy class, this is not it. It was his first time teaching the class, so hopefully it will be better in the future.", "rating": 2, "expected_grade": "A-", "created": "2023-01-24T18:23:03.582271Z"}, {"professor": "Jose Teixeira", "course": "BMGT461M", "review": "This man does not work much at all and pretty much freestyles the course. TAs are often the ones teaching, though there is not much learning that happened.", "rating": 2, "expected_grade": "B+", "created": "2023-11-06T19:58:54.447419Z"}, {"professor": "Brent Goldfarb", "course": "BMGT461M", "review": "He's pretty nice and helpful if you have any questions. However, the class is structured terribly. If you have a bad group member or two your grade will suffer, because the class is graded on a curve of how much money your business makes. There are also in class assignments graded on a curve, so you need to be better than the other groups. If the grading was normal and the business wasn't graded on profit, his lectures would be 5 stars because the case studies and class content are very engaging.", "rating": 2, "expected_grade": "B", "created": "2024-03-28T17:19:19.315664Z"}], "department": "BMGT", "course_number": "461M", "name": "BMGT461M", "title": "Entrepreneurship", "credits": 3, "description": "<b>Restriction:</b> Must not have completed BMGT361.\n<b>Credit only granted for:</b> BMGT261, BMGT361, BMGT461, ENES460, SMLP470 or HLMN470.\nProcess of creating new ventures, including evaluating the entrepreneurial team, the opportunity and the financing requirements. Skills, concepts, mental attitudes and knowledge relevant for starting a new business.\n<i>Restricted to Innovation & Entrepreneurship Minors (#BU03).</i>", "is_recent": true, "geneds": null}