{"average_gpa": 3.4246036778693725, "professors": ["Oliver Schlake", "Andrew Sherman", "David Kressler", "Robert Vesco", "Brent Goldfarb", "Maurice Boissiere", "Jeffrey Mund", "Le-Marie Thompson", "Maurice Boissiere", "Le-Marie Thompson", "Maurice Boissiere", "Oliver Schlake", "Le-Marie Thompson", "Maurice Boissiere", "Le-Marie Thompson", "Maurice Boissiere", "Sheetal Singh", "Le-Marie Thompson", "Sheetal Singh", "Le-Marie Thompson", "Sheetal Singh"], "reviews": [{"professor": "Brent Goldfarb", "course": "BMGT461", "review": "Interesting class overall, although I don't think it helps you become an entrepreneur. Course is graded on weekly assignments, including case studies and videos, which are discussed in class. During the semester a business is to be created and run throughout with randomly assigned team members. There are two ways to get an A in the course, by making a significant amount of profit or having more points by winning competitions based on the business through the semester. Several groups in all sections have to turn away from their first idea and pivot to another to survive. On the plus side, the lowest grade in the syllabus is a C with 0's for everything.", "rating": 4, "expected_grade": "B", "created": "2018-10-31T22:35:36Z"}, {"professor": "Maurice Boissiere", "course": "BMGT461", "review": "DO NOT TAKE THIS CLASS. I cannot stress this enough. While Boissiere is nice and seems very knowledgeable about entrepreneurship this class is a waste of time. You are literally starting a business with strangers. We had to take a survey and submit a resume to be grouped based on some algorithm by someone they tell you nothing about no credentials, nothing. I indicated I did not want to work with any of the people in my group and was still placed in a group with them. You are taught through YouTube videos and readings that you can easily find on your own. Showing up to class is next to pointless. The class elms page is poorly structured and assignments aren't clearly defined. Grading is based on a 'karma point' percentile system that has never fully been explained, or based on your companies profits. If someone in your group doesn't contribute you are essentially on your own. The idea of running a company with strangers is AWFUL. Even if you go into it with friends some will care more than others and put in more effort even though equity doesn't reflect that. Creating and running a business is extremely time consuming and is ten times harder when you have to schedule things with other people, ask and value their opinions AND complete & submit useless class assignments. The idea of this class sounds exciting but you are better off taking another class where you can actually get your money's worth. You can start a business on your own and use resources like the Dingman center which are free. There are many resources on campus that you can utilize instead of this course. Honestly you can learn more from shark tank than this joke of a class. Seriously can't believe this course is a major requirement, it goes to show how little Smith cares about non finance/accounting majors. There's a lot of potential for a class on entrepreneurship and none of it is utilized here.  ", "rating": 1, "expected_grade": "A", "created": "2022-03-28T02:05:04Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT461", "review": "Professor Thompson is one of the least organized professors I've ever had. She has her TAs do all of the grading and her syllabus and course schedule are copied from a different Professor. Her ELMS page makes no sense and the grading system in this course is IMPOSSIBLE to follow. You essentially have no idea how you're doing the entire time and then you're graded based on how well others do. \r\n\r\nHer assignments are extremely confusing (the rubric almost never matches up with the assignment description) so it is so tricky to follow. And when you ask her a question in class, she seems like she has no idea what is going on. If you can avoid this class, AVOID IT! It is way too unconventional and I am not learning anything more than I would watching an episode of Shark Tank. If you have to take this course for the minor, do everything you can to have a different Professor. Seriously the worst class I've taken at UMD. ", "rating": 1, "expected_grade": "", "created": "2022-04-07T17:18:13Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT461", "review": "She teaches an interesting course in entrepreneurship yet completely ruins it by putting so many unnecessary assignments with descriptions and rubrics that don't align. The goal of the class is to make the most money with your entrepreneurial venture yet you have to make presentations each week and do readings, taking time away from making sales. All of our ventures are in predetermined and it's very hard to come up with something within days and try and make money with it in 10 weeks. Overall, avoid taking this class with her!", "rating": 2, "expected_grade": "B+", "created": "2022-05-11T16:37:23Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT461", "review": "Lots of useless assignments, rubrics don't match assignment descriptions, professor never provides an accurate answer if you ask her a question. Overall horrible class I recommend to stay away from it if you can. You'd be better off geadornesuddy :/", "rating": 1, "expected_grade": "B", "created": "2023-05-06T03:23:52.017261Z"}, {"professor": "Le-Marie Thompson", "course": "BMGT461", "review": "She is a terrible professor. Seriously take my review seriously I saw these reviews and took this class anyways. It is WAY more work than you anticipate. If you want an A expect to work 10-15 hours a week on this class. You not only are responsible for mind numbing stupid assignments that take too much time. You have to quite literally run a business from scratch with no help or assistance. You basically are told sink or swim and if you sink thats your problem. I only got an A in this class because I worked my ass off. Do NOT take this class if you can", "rating": 1, "expected_grade": "A", "created": "2023-05-10T15:57:28.749071Z"}], "department": "BMGT", "course_number": "461", "name": "BMGT461", "title": "Entrepreneurship", "credits": 3, "description": "<b>Restriction:</b> Must not have completed BMGT361.\n<b>Credit only granted for:</b> BMGT261, BMGT361, BMGT461, ENES460, SMLP470 or HLMN470.\nProcess of creating new ventures, including evaluating the entrepreneurial team, the opportunity and the financing requirements. Skills, concepts, mental attitudes and knowledge relevant for starting a new business.\n<i>Restricted to BMGT majors with 72 credit hours completed. Non-majors should register for BMGT461N. BMGT minors should register for BMGT461M.</i>", "is_recent": true, "geneds": null}