{"average_gpa": 3.1909207909207913, "professors": ["John Buchner", "David Rollins", "Keith Lampel", "Kevin McIver", "Daniel Dwyer", "Eric Hall", "Erin Tran", "Erin Tran", "John Buchner", "Erin Tran", "John Buchner", "Erin Tran", "John Buchner", "Erin Tran", "Cherisse Hall", "Erin Tran", "Erin Tran", "John Buchner", "Cherisse Hall", "Cherisse Hall", "Elizabeth Emmert", "Erin Tran", "John Buchner", "Cherisse Hall", "Erin Tran"], "reviews": [{"professor": "Richard Stewart", "course": "BSCI223", "review": "This class was very easy. Although his lectures are boring and he tends to try very hard to make lectures exciting, they don't really make students want to stay in class. You must go to lecture 20 times at least to get the clicker points. \n\r\nOverall, Stewart is a very good teacher if you listen to what he says. He wants his students to pass so utilize his weekly study questions. If you answer these you will be prepared for the tests. \n\r\nAnother great thing Stewart does is posts the final question to each test and a sample test for every test. With these and Koofers tests (which were exactly the same tests we were given this year) it is impossible to not get an A. \n\r\nGood luck in Micro!", "rating": 5, "expected_grade": "A", "created": "2010-12-25T17:35:00Z"}, {"professor": "Richard Stewart", "course": "BSCI223", "review": "Not a very engaging lecturer although he really knows his stuff. He is much more help when you go to his office hours. Sit up closer because he doesn't ever seem to be very loud even when he is miked.", "rating": 4, "expected_grade": "A", "created": "2007-10-21T15:58:00Z"}, {"professor": "Daniel Stein", "course": "BSCI223", "review": "well first off there is a 2 to 3% curve in the class. He tells you all semester theres not, but there is. Also stein isn't a bad professor or lecturer. His exams aren't too tough if you do his study guide questions, but the set up of the class especially the lab is atrocious. Alot of times in lab we did not have to correct equipment needed for the lab and even the Tas were confused on what to do. But for steins class all you need is to get like 85 on his two exams and wont he final, as he gives a lot of extra credit (pak points up to two percent increase), and he has two group assignments worth 10% of your grade that it should be easy to get an A in (my group got 99 and 101 and our projects were that good (we also had a good TA)). Also with this class make sure to read each question carefully because alot of it isn't to hard, but can be tricky if you are not reading the questions correctly. Also this class is made alopt easier if you have taken bsci 222 and understand the central dogma. THe entire second exam is the central dogma and if you get it you are guaranteed at least an 85 on it. ", "rating": 3, "expected_grade": "A", "created": "2011-12-24T12:46:00Z"}, {"professor": "Daniel Stein", "course": "BSCI223", "review": "Dr. Stein really wanted us to \"understand\" a lot of things. His lectures slides were very engaging. I do have to say that his course is a lot of work. He is somewhat approachable, yet I feel that his test seemed unfair at times. He even claimed that \"I feel that this was a bad test, since majority of the class got x amount of things wrong.\" But, if you are up to date with everything, and work hard, hopefully, you will be able to do well in this course. Overall, I thought it was okay, the Module 3 about HIV, and immunology was great :]", "rating": 3, "expected_grade": "A", "created": "2010-05-27T09:31:00Z"}, {"professor": "Daniel Stein", "course": "BSCI223", "review": "Compared to Smith, Stein is a little more difficult. My TA, who took Smith, said the stuff we were learning was harder than what he had learned. That said, Stein really does want his students to learn the material in this course, not just regurgitate the info. He tries to make the information interesting and engages the class through \"cool\" facts presented at the beginning of each lecture. The book is pretty helpful, so I'd recommend you get it. Also, labs and assignments are actually pretty fun and interesting, but I may be biased because my TA and UTA were awesome.\n\r\nStein also grades students individually. If he sees you've improved through each exams and do well in labs, he'll definitely bump you up a decent amount.", "rating": 4, "expected_grade": "", "created": "2010-05-27T00:08:00Z"}, {"professor": "Daniel Stein", "course": "BSCI223", "review": "honestly, i didn't learn that much in lecture. found it hard to take notes unless you had a netbook because he teaches off powerpoint slides. all you really have to do to get an A is read the book. the labs were relatively easy and the exams were alright if you keep up with the reading. if you find yourself short a few points of your target grade, dont worry since he'll give out a lot of extra credit towards the end of the course. ", "rating": 3, "expected_grade": "A", "created": "2010-05-25T03:10:00Z"}, {"professor": "Daniel Stein", "course": "BSCI223", "review": "Dr. Stein is actually a very solid and effective teacher. I had a good time in class and overall learned a lot about microbiology. He uses a lot of interesting examples and the last few lectures on STDs were really awesome. \n\r\nUnfortunately, he is NEVER clear about what he wants as an answer on the exam. I'm not exaggerating - this is ABSOLUTELY TRUE: If your answer to a question is correct but does not appear on the answer key, HE WILL MARK IT WRONG! He says it's so everyone is graded fairly, and if you have any concerns about your right answer (that was marked wrong), you can go to his office hours or submit a regrade. This is terribly disrespectful of our time - we don't have time to go chase points we rightfully deserve.   \n\r\nOverall, solid teacher but crappy grader. ", "rating": 4, "expected_grade": "A", "created": "2010-05-19T13:21:00Z"}, {"professor": "Daniel Stein", "course": "BSCI223", "review": "TERRIBLE COURSE. Besides that fact, Dr. Stein is ok.  He tries to make the subject interesting by adding a few fun facts before every lecture...sometimes they actually are cool.  If the course wasnt such a mess, i think it would be really very good.  The lab+lecture activities due almost on a daily basis are very confusing, but the upside is that they help your grade quite a lot.  The reason i say that the course is terrible is because people have no idea when things are due and the dates change constantly...besides that, the course is actually fairly interesting.", "rating": 3, "expected_grade": "C", "created": "2009-06-17T14:23:00Z"}, {"professor": "Daniel Stein", "course": "BSCI223", "review": "Dr. Stein is a really good professor. He tries very hard to make this subject fun, by giving assignments that are actually real fun. At the beginning of every class he shows you one of the applications of microbiology and is always fun. He checks attendance using clickers, but he does not grade you on whether or not you got the right answer. His exams are difficult. The final exam is a combination of a 3rd exam (on new material) worth 75%, and a cumulative part worth 25%. The lab section of this class is very fun (you get to make yogurt! and play with bacteria!) The lab questions are not hard, and the lab exams are easy.\n\r\nOverall it is easy to get a B in this class (because the lab grade will boost your grade a LOT!), but getting an A requires a lot of effort. Even then I would still take Dr. Stein because he is a great teacher, he explains things well, he hold review sessions every week, and his assignments are really fun (content-wise). ", "rating": 5, "expected_grade": "A", "created": "2009-05-16T15:24:00Z"}, {"professor": "Daniel Stein", "course": "BSCI223", "review": "Not a fan.  He was not a good teacher, his tests (especially his final which was 12+ pages long) was ridiculously complicated, and he took attendance by clickers each class.  Oh, and yes, he was quite boring.  The best part of the class was it was close to my dorm so waking up at 7:50 for his 8 AM class was not too shabby.  Good luck to any who has to take this class.  ", "rating": 2, "expected_grade": "", "created": "2008-01-21T01:02:00Z"}, {"professor": "Daniel Stein", "course": "BSCI223", "review": "Dr. Stein is a very good professor who gives a very thorough explanation of microbio. Honestly, the hardest part of this class is to just keep track of what assignments are due and to go to class every time. \n\r\nThere alot of assignments every week, but in general they are all very easy and dont take up much time. Everything in lab is basically guaranteed to be 100% unless you don't put effort into it.\n\r\nThe exams are fair and the best way to be ready is to print the powerpoints before hand and take notes on what he says. Dr. Stein is one of the few teachers imo that actually explains as well as the book. If you can pay attention in class studying for the exam will be 10X less stressful and difficult. ", "rating": 5, "expected_grade": "B", "created": "2007-12-05T02:02:00Z"}, {"professor": "Ann Smith", "course": "BSCI223", "review": "This class is divided into 3 modules; Dr. Stewart taught the first two modules and Dr. Smith taught the last one. Dr. Smith lectured with more passion, but her slides were not as straightforward as Dr. Stewart's. I studied Dr. Stewart's slides without referencing the textbook, and got A's on the first two exams. However, I had to rely heavily on the textbook to understand the material that Dr. Smith taught since her slides have very little substance to them (as per another reviewer). The labs are pretty fun, and can really boost up your grade. Make sure you keep track of all the assignments and their due dates since there is a lot of busy work. Also, if a problem arises that may interfere with the class, do not hesitate to talk to Dr. Smith. She is very understanding and will work with you to devise a solution.     ", "rating": 4, "expected_grade": "A", "created": "2010-12-23T19:30:00Z"}, {"professor": "Ann Smith", "course": "BSCI223", "review": "Dr. Smith is an amazing professor! She really loves what she is doing, and teaching is evidently her passion. This definitely shines through during her lectures, her way of responding to students' questions, and even in her very well designed (but sometimes poorly supplemented/executed) laboratory exercises. This might sound strange, but Dr. Smith was so sympathetic to student's concerns, that at times she seemed like a second mother (she really is that nice!) In addition, she really has a knack for teaching you everything you need to know about microbiology. She has very fair examinations, and is really great about bumping you up provided you show improvement throughout. Amazing woman. ", "rating": 5, "expected_grade": "A+", "created": "2010-12-11T10:48:00Z"}, {"professor": "Ann Smith", "course": "BSCI223", "review": "Dr. Smith was a good teacher.  Sometimes it can be a little frustrating b/c her slides don't seem to have a lot of substance to them, but by the end of the course, you will learn a lot!  I recommend doing the study questions and going to review sessions to ask about any questions you might not be able to answer.  I also recommend looking over the PAKs before the exams.  BSCI223 overall is easier than most bio classes but there are a lot of small, kind of busywork assignments.  I really liked the lab because you learn a lot of techniques and you are not penalized for mistakes during procedures, so you aren't afraid to try new things. ", "rating": 4, "expected_grade": "A", "created": "2009-03-08T00:47:00Z"}, {"professor": "Ann Smith", "course": "BSCI223", "review": "Dr. Smith is an effective teacher. Her tests are fair and based off the material she covers in lecture via power point. Some students dislike her because she tends to use gimmicky teaching techniques as were used in middle school (like stories), but I believe this gives her points context and makes them more interesting. Also like middle school, there are lots of small things due all the time and there are many projects. The syllabus is hard to read so it can be difficult to keep track of due dates. Despite the sometimes cheesy projects, overall I'd recommend Dr. Smith.", "rating": 4, "expected_grade": "", "created": "2008-12-04T18:43:00Z"}, {"professor": "John Buchner", "course": "BSCI223", "review": "Buchner makes lectures very interesting and connects material to real-life examples, which made everything easier to understand. It definitely helps to have at least a little background in biology, because a lot of it I've seen before. His first exam was really hard and I failed, but after that, I got As on the second exam and the final. Study the PAK material. His exams are so long and you have to budget your time really well if you want to finish. \r\n\r\nThe lab is a decent amount of work, but it's an easy boost to your grade if you submit everything on time. It's not super hard to get an A in the class, you just have to focus on the bigger concepts when studying. I do recommend Buchner, just be ready to put in the time for a 4 credit class! ", "rating": 4, "expected_grade": "A", "created": "2019-01-06T15:59:36Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Has no idea how to teach. All she does is read the slides (everyone in college can read on their own thank you!!!!). Mandatory clicker points so you much show up to hear her read. Nice person, but other than that, pretty bad teacher.", "rating": 1, "expected_grade": "A-", "created": "2019-02-28T02:32:37Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "She was pretty average. The class mostly depends on lab points. The exams she gives are pretty difficult but I've heard they're better than Buchner's. She kept things clear and relatively easy to understand.", "rating": 3, "expected_grade": "A-", "created": "2020-05-22T04:53:46Z"}, {"professor": "John Buchner", "course": "BSCI223", "review": "Maybe because the course is online due to COVID, but his way of teaching does not make sense at all and he assigns too many assignments per week. His major assignments (PAKs) are genuinely useless and needs EXTRA (I mean whole new) research just for those assignments. His lecture videos are very brief and not at all detailed, so basically useless for all the assignments. His research box assignments, which we have to read a research article per week and analyze, are way out of our league and not at all related to the course. So, basically I have wasted my semester reading and doing shits that are not even related to the college-level GENERAL microbiology. I don't know who else teaches this course and about their ratings, but DO NOT (I MEAN IT) DO NOT TAKE BUCHNER IF YOU WANT TO LEARN ABOUT MICROBIOLOGY.", "rating": 1, "expected_grade": "", "created": "2020-12-19T05:57:20Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Not a very engaging professor. You can tell that she likes to read off the slides. However, her exams were fair but lacked clarity and often not provide clear directions when it comes to assigments and projects. In hindsight, the class seemed to be all over the place. ", "rating": 2, "expected_grade": "A-", "created": "2021-03-31T02:17:50Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Dr. Tran is awesome. She is very knowledgeable and from I have experienced does not read off of slides? She explains concepts very well and you can tell she has enjoys teaching. ", "rating": 5, "expected_grade": "A", "created": "2021-04-20T00:21:24Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Dr.Tran is an amazing and kind professor. I will admit that the lab assignments were pretty annoying. Dr.Tran's exams are very fair, as long as you attend the lectures and review the material you will succeed on her exams. She also gives extra credit.", "rating": 5, "expected_grade": "A", "created": "2021-05-24T13:23:10Z"}, {"professor": "John Buchner", "course": "BSCI223", "review": "Loved taking Buchner's class. He is by far the coolest professor I've had yet. He seems like a very kind and understanding person and makes lots of accommodations due to COVID. His lectures can be helpful because he just goes over questions most students didn't understand. Many bad reviews I've seen said he gives too much busy work which I agree with but MOST of it is participation points. As long as you put in some effort, you will get full points for completion. For exams there are a few parts to it but you also get 1-2 weeks to complete it but some questions can be tricky.\r\n\r\nLab was good in person. Very minimal effort. You just have to read directions and follow them. I had an awesome TA and he was very lenient with grading so lab helped bring my grade up. There are a few assignments where you have to present but they are very informal and less than 5 minutes as a group.\r\n\r\nI had to take this class for my major and was super worried about it but it was pretty straightforward. A good amount of effort but easy A for the most part.", "rating": 4, "expected_grade": "A", "created": "2021-12-03T03:01:00Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Dr. Tran is an amazing and nice professor. She is really clear at explaining things in her videos and lecture. This class may seem like a lot of work but many of the assignments are small and/or done in groups (and completion grades). A lot of the grading is done by the TA. As long as you keep up with the material, you can do well in the class. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-20T16:18:19Z"}, {"professor": "John Buchner", "course": "BSCI223", "review": "I dont need to wait til the end of the semester to give this course a review. If there is any class or set of professors that COULD CARE LESS that you're taking other classes that also require your effort and attention. Its these guys!!!", "rating": 2, "expected_grade": "A", "created": "2022-10-12T00:08:57.431571Z"}, {"professor": "John Buchner", "course": "BSCI223", "review": "easiest bsci class there is, im not even gonna hold you I may end up with an A or very high B in this class and if you ask me what I've learned?????? LOL bruhhh, take this class with a friend and you're good. On your own with no friends? um maybe not so much of an easy A or B for ya but make some in class lol. \r\n\r\nBuchner is s chill and so sweet as well. Very accessible and willing to help.", "rating": 5, "expected_grade": "A", "created": "2022-12-15T14:33:58.396566Z"}, {"professor": "John Buchner", "course": "BSCI223", "review": "Dr. Buchner is a great professor who provides many resources to help you succeed in class. This class is not very difficult content-wise, but the work can be tedious and time-consuming. If you attend lectures and go over the slides, you should be able to get an A or B. Dr. Buchner is a funny professor who is extremely helpful. He goes over assignments and questions in class, and after exams, provides an opportunity for individuals to request their tests to be regarded. If you can provide evidence to back your answer he will give it to you. Buchner likes to relate a lot of the course content to current events, making this class interesting. This class is pretty straightforward, but the workload can be overwhelming sometimes. The class PAKs can take a while to complete depending on the questions. The lab is very simple, but attendance is necessary. In the lab, you follow directions and have a couple of group assignments and presentations, which are pretty simple. Overall the workload in this class can be a lot especially since you have 2 lab sections each week.", "rating": 4, "expected_grade": "A", "created": "2022-12-22T21:58:03.212205Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "I am not learning anything in this class. They just flood you with pointless assignment after pointless assignment. It's also screwed with my mental health and made me resent one of my favorite subjects.\r\n\r\nInstead of a 1-hour exam per week, you're expected to a 20-30 hour assessment that basically forces you to redo all of the classwork you did so far, only with entirely different set-ups, if that makes sense. Then you have a massive report due that constitutes 50% of your grade during the same week the huge assessment is due. \r\n\r\n Expect to spend 8 hours a week in this class, and that's just the lecture, lab and \"discussion\". Not counting the endless work you have to do. They also pick apart your grade for the tiniest things, and every instruction is a 3-page word salad with thousands of requirements. It's also very condescending. \"Your idea must have real genetics and biochemistry to back it up... nothing from the realm of fantasy or science fiction land.\" I have seriously never seen instructions like these that insult you, confuse you and overload you at the same time. This class also demands brevity out of you despite dumping walls of text infront of you. I've seriously read an assignment 8 times back and forth for an hour and have lost 20/30 percent of the points for missing one small step. I've also made a single mistake and had that repeatedly docked from my total in the same report. I have to white-knuckle through this class and beg for my efforts to be seen.  One day you've spent 8 hours straight doing homework and the minute you look up you drop a letter grade for something that would have been a 1 or 2 pt deduction in any other class. Even in classes I have taken that grade harshly in writing, like psych and english, don't grade your writing as harshly in this class. And to what end? It's a fucking micro class. \r\n\r\nI just feel like the class expected us to be more immature than we were and simultaneously way more experienced in microbio. I have roommates in the grad school at UMD and they tell me that this class is more ridiculous than what they have to do. Whatever they're trying to do, it's really not working. \r\n\r\nIf you can wait to take this class until a prof that gives exams teaches it, do so. If you can take it at a diff college, do so. If you can put it off until your last semester so it doesn't affect your grad/med school app, do that. Do not take this as an elective no matter how much you care about the subject. Would you take Math115 as an elective? This class is seriously the same way. Do what you can to avoid this class.", "rating": 1, "expected_grade": "P", "created": "2023-03-15T03:57:12.902779Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Loved the prof. Super understanding (gave me an extension on a big assignment just cuz I asked) Very down to earth and encourages you to use outside sources and collab with friends. You can zoom into lectures but there is participation credit via turning point questions. But you can miss 3 lectures and still get 25/25 participation points. \r\n\r\nThe lab was super fun and interesting I just got fucked with my TA, Husan T. He is an asshole and also grades way too harsh.", "rating": 5, "expected_grade": "A-", "created": "2023-05-25T02:40:49.232223Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Prof Tran is soo nice. She is so caring and welcoming. She always is available for office hours too. Her lecture style is mainly focused on participation, but its through the form of clickers. You can also attend class on zoom and participate on clickers too. As long as you turn in the weekly assignments, lab quizzes, and attend lecture either in person or online you should expect an A.", "rating": 5, "expected_grade": "A+", "created": "2023-11-02T14:26:27.235295Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "This class is very boring, the teacher gives long assessments and these assignments are ridiculous. Labs are long and never graded in person, only online assignments that don't even boost up your grade besides 0.5%. They don't care about your other classes and your mental health. I still got that A+ tho and thank you to myself.<3", "rating": 1, "expected_grade": "A+", "created": "2023-11-07T05:57:45.603722Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "literally the worst class ever. content wise, if you've taken BSCI222, BSCI330, BSCI410, or BSCI420, this class will be a piece of cake. workload wise, however, this class is absolutely RIDICULOUS. endless assignments due literally every single freaking day, so much busy work. I have not taken a class with 5 homework assignments due every single week since high school, and i'm a senior. be warned: just because the exams are online + open book does NOT mean they are easy. they are broken down into 5 individual assignments, each of which takes HOURS to complete. what's even worse is the day after the exam is due, you still have other assignments due. the labs are fun; the protocols, however, are not user friendly. they need to hire a new prep TA because they were not well prepared for some labs due to shortage of materials, culturing issues, confusions and mix ups. very bizarre and chaotic course. sorry, girl, but some of us have lives outside of this course and cannot be bothered by these dumb assignments.", "rating": 1, "expected_grade": "A", "created": "2023-11-10T14:35:00.902571Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Dr. Tran is a very helpful and kind professor. She holds office hours every week in which she is more than welcome to answer any questions you might have and she also responds to emails almost instantly. Participation points are based on clickers which you can do from Zoom. The class itself is not too difficult, but the grading is very strict. The workload is a bit heavy and for assessments, you get 6 days to do 5 assignments which could take many hours to complete, they are online + open note. Honestly, your grade depends on whether you can keep up with the assignments and how well you can understand the material and apply it to different concepts.", "rating": 4, "expected_grade": "B+", "created": "2023-12-11T20:46:59.185886Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "This class is entirely busy work and group work. Good luck if you aren't assigned a group with competent people. Your grade highly depends on your TA as well, as some are stricter with grading than others. As for the lab manual, you have to print out all of the pages prior to lab, and the protocols are very poorly written. The lectures are flipped-classroom style where the actual lectures are pre-recorded videos and the lecture time is more discussion-style. Overall this class is very time-consuming, however, I feel I have barely learned anything in the end.", "rating": 3, "expected_grade": "A", "created": "2023-12-15T03:12:44.702417Z"}, {"professor": "John Buchner", "course": "BSCI223", "review": "Super chill professor, you don't do much in class besides clickers/point solutions. I gave him 4 stars only because of the insane amount of homework he gives. He typically grades on completion rather than accuracy though and the assignments are relatively easy.", "rating": 4, "expected_grade": "A+", "created": "2024-02-13T16:48:23.811215Z"}, {"professor": "Erin Tran", "course": "BSCI223", "review": "Def a crap ton of work, a class I would not want to do again, but got the grade I wanted along with many other students", "rating": 3, "expected_grade": "A", "created": "2024-03-26T06:34:34.097666Z"}], "department": "BSCI", "course_number": "223", "name": "BSCI223", "title": "General Microbiology", "credits": 4, "description": "<b>Prerequisite:</b> BSCI170 and BSCI171; or BSCI105.\n<b>Credit only granted for:</b> BSCI223 or BSCI283.\nFundamental concepts in morphology, physiology, genetics, immunology, ecology, and pathogenic microbiology. Applications of microbiology to medicine, the food industry and biotechnology.\n<i>(Sponsoring Dept.: CBMG) Students must pay a $40.00 laboratory materials fee.</i>", "is_recent": true, "geneds": null}