{"average_gpa": 2.662453715132066, "professors": ["Michael Keller", "David Kirschtel", "Norma Allewell", "Patricia Shields", "James Sniezek", "Reid Compton", "Leah Surikov", "Swarna Mohan", "Nicholas Fletcher", "James Sniezek", "Michael Keller", "Reid Compton", "Anne Simon", "James Sniezek", "Michael Keller", "Reid Compton", "Swarna Mohan", "Anne Simon", "Cornelia Van der Weele", "Eric Haag", "James Sniezek", "Michael Keller", "Nicholas Fletcher", "Michael Keller", "Michael Keller", "James Sniezek", "Michael Keller", "Reid Compton", "Swarna Mohan", "Eric Haag", "James Sniezek", "Michael Keller", "Nicholas Fletcher", "Niranjana Krishnan", "James Sniezek", "Michael Keller", "Nicholas Fletcher", "Swarna Mohan"], "reviews": [{"professor": "Michael Keller", "course": "BSCI170", "review": "Keller isn't the best professor around, but as long as you show up to class and study hard for exams, you should be fine. Take advantage of GSS and make sure to look over your exams because sometimes the TA's take off points for no reason", "rating": 3, "expected_grade": "C", "created": "2018-12-19T18:28:15Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller is an interesting professor. His exams aren't necessarily tough, but you definitely have to get used to the way he wants you to answer the question. For example, in his class, he does not want you to think that glucous is a product of photosynthesis. ", "rating": 3, "expected_grade": "B", "created": "2019-11-10T17:02:13Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "For an introductory biology course, this class really requires you to put in three times the effort. Dr. Keller is very tedious with his assignments and exams; your answers can never be too general even if they're right, so pay attention to every little word that man says during lectures or you're gonna lose points. I really feel like this course was designed to trick you, so be careful. Even some of the homework assignments and quizzes can be hard and require you to think twice about your answers. If you're able to pay attention to every little detail and remember every one of them for the exams, then you may be fine.", "rating": 3, "expected_grade": "B-", "created": "2019-11-12T00:14:19Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I really hated this class. It put me through so much grief. The homework assignments are ridiculously hard. Dr. Keller looks for answers so specific to what he wants; if it is not worded to his exact specifications, it is wrong, even if it is scientifically technically correct. Some of the Wednesday activity sessions are pointless, only the question review sessions help. Both Keller and Shields get off topic very easily and cannot take control of their classes. The entire course was made so much harder than it needed to be. I'm sure a lot of the BS was because of Dr. Shields. Keller is really enthusiastic and I'm sure he's a nice person, but in terms of a professor that will help set you up for the future, you can do much better.", "rating": 2, "expected_grade": "A", "created": "2019-12-09T15:43:16Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Doctor Keller is a nice guy however, his exams are quite difficult. He is very knowledgeable but if I had to do it all over again I wouldn't take his course or recommend it to anyone.", "rating": 2, "expected_grade": "C", "created": "2019-12-18T18:07:34Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Personality wise- Dr. Keller is a great professor. He makes corny jokes sometimes. Very understanding if you need an extension or miss an assignment, just make sure you tell him in advance bc communication is key. His exams are not TOO hard but he does look for specific wording or details that he has gone over in class. This also goes for the HWs so you need to be careful bc i would get several points off for not being thorough. Topic wise, this class isn't hard if you put in effort or have background knowledge of biology. Dr. Shield's class was exactly the same as Dr. Keller's for spring 2020. All the hw, quizzes, tests etc", "rating": 4, "expected_grade": "", "created": "2020-08-16T03:30:18Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Really cool teacher. His exams are okay if you study and understand concepts thouroughly. Reasonably difficult but most concepts in the test are in his lectures/study materials. Moderate workload/homeworks. (Virtual class)", "rating": 4, "expected_grade": "B", "created": "2020-12-09T21:11:41Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller was a solid professor who did a good job teaching things in his lecture videos. There is quite a bit of material in the class, but as long as you take good notes from his videos and modules, you can easily do well on all of the quizzes, exams, and the final. We also never read from the textbook, since the videos included everything we would need to know for the class, so that was a plus.", "rating": 5, "expected_grade": "A", "created": "2020-12-18T14:13:37Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Professor Keller is a nice guy, but his class is quite hard. Lectures can be very long but very informative and helpful. The weekly quizzes sometimes ask questions that are too specific to what was in the lecture, making it much harder. Exams have been pretty hard. He expects your answer to be exact to words he expects; if not, you get it wrong.", "rating": 3, "expected_grade": "", "created": "2020-12-18T23:16:47Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Great professor! Even with asynchronous classes, he clearly demonstrated what we needed to know for his tests.", "rating": 5, "expected_grade": "A", "created": "2021-01-17T18:15:15Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Great professor with interesting and easy-to-follow lectures. Dr. Fletcher's exams are not too difficult and if you watch all the lectures as well as take good notes, you should be fine. He also has some really cool pets that he shows on the zoom calls sometimes :)", "rating": 5, "expected_grade": "A-", "created": "2021-03-23T14:46:47Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Fantastic professor, fantastic person. Cannot recommend him highly enough. Lots of material, but his lectures are great and exams are not too bad if you study. He clearly cares about his students. All around stellar person and professor. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-03T19:09:30Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "He's such a caring professor! He makes the BSCI170 material super engaging and actually makes you interested in what you're learning. He also gives plenty of opportunities to get an A ", "rating": 5, "expected_grade": "A", "created": "2021-05-07T16:08:42Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a great professor!! He's an incredibly nice person and an understanding teacher. He's very considerate of students' time and other possible concerns (he was always flexible with due dates). More importantly, his teaching is very thorough yet straightforward. He always makes assignments and quizzes/exams on the concepts discussed/covered in class, so if you pay attention during lectures and take good notes you'll do very well in the class. I absolutely recommend his class!!", "rating": 5, "expected_grade": "A+", "created": "2021-05-07T17:30:41Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "I LOVED HIM AS A PROFESSOR!!! He made the material so easy to understand and made it very possible to get an A (I suck at bio for reference). He's so nice and caring and definitely wants to see his students succeed.", "rating": 5, "expected_grade": "A", "created": "2021-05-11T17:56:53Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "AMAZING AMAZING AMAZING PROFESSOR. If you have the opportunity to take his class I couldn't recommend him more. He's extremely kind and caring to his students and genuinely tries his best to make sure that his class knows the material and is able to work hard. He also had one of the highest grade point averages for a BSCI170 class this semester which was very impressive. Honestly, just make sure to pay attention to his lectures and do work on time and you will be all set. His exams aren't too difficult but at the same time they aren't too easy. Really they are just the expected amount of difficulty and he doesn't throw any curve balls. HE ALSO SHOWS HIS PETS ON ZOOM ALL THE TIME.", "rating": 5, "expected_grade": "A-", "created": "2021-05-13T16:31:08Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "This class is very doable if you put in the work and study a couple of days before the exam. Making sure you understand the information presented in lecture and understanding the assignments is key for learning and doing well in the course. Keller is extremely nice and understanding as well, so taking the course with him is recommended. However, I will say sometimes I didn't enjoy his teaching style but overall it was still effective.", "rating": 4, "expected_grade": "A+", "created": "2021-05-22T18:14:55Z"}, {"professor": "Reid Compton", "course": "BSCI170", "review": "Goes through lectures way too fast, it's really hard to glean any information. Our first midterm average was a 59 and he said we needed to \"study harder,\" despite his poor teaching. He's a really nice guy, very approachable, but his exams are way too difficult given the information he presents to the class. ", "rating": 1, "expected_grade": "", "created": "2021-10-26T22:04:40Z"}, {"professor": "Reid Compton", "course": "BSCI170", "review": "He's a great lecturer (albeit monotone) and knows what he's talking about BUT his exams are way too difficult. We only learn course information in the class, never how to apply it the way he wants us to in the exams. Going to multiple GSS sessions is CRUCIAL if you want to get above a 75 on his exams. Even then, his exams are just unnecessarily difficult--I highly recommend taking another professor for BSCI170.", "rating": 1, "expected_grade": "B-", "created": "2021-11-07T01:56:55Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a great guy. He really cares about his students and is incredibly nice. I would say there is an average amount of work for a bio class. A fair amount of assignments can be completed reasonably late without penalty. The tests are fine for the most part as long as you study. Much of the studying is memorization, understanding the material is key. The good news is he has a lot of places to find that information such as powerpoints, modules, and extra videos. Sometimes his lecture style can be a little boring, but he very clearly communicates what is meant to be known for his tests. If you want to succeed in this class it is incredibly doable. ", "rating": 5, "expected_grade": "A+", "created": "2021-11-20T17:49:11Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is such a great and funny professor. He teaches relevant information during lecture and wants to see all of his students succeed. He also gives out extra credit through clickers so definitely show up to class for a grade booster. Exams are fairly simple especially compared to the other professors. Study for the exams using his resources provided and you will succeed. ", "rating": 5, "expected_grade": "A", "created": "2021-12-05T01:39:33Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "GOAT", "rating": 5, "expected_grade": "", "created": "2021-12-06T00:53:43Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Great professor. Heard a lot of bad things going into the class about him and I can't imagine how they came up with bad thoughts about him. Tests are super easy if you take notes in lecture and pay attention. Clicker points boost avg by about 3 percent if all completed. ", "rating": 5, "expected_grade": "A", "created": "2021-12-06T04:17:43Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I strongly recommend taking Dr. Keller. I feel that he really cares for his students, and his tests are easier than high school exams. take advantage of gss meetings and make sure to study the modules, because they are quite literally the exams. He does not go into too much detail for anything and keeps things pretty simple. ", "rating": 4, "expected_grade": "A", "created": "2021-12-06T17:45:47Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a great professor. He wants all his students to do well and teaches information that you need in order to do good on the exams. The exams are straight from the lectures and by studying the content a little, you are guaranteed to get a good grade. He gives about 20 points extra credit through clickers and lots of opportunities other than exams to boost your grade. Definitely recommend!", "rating": 5, "expected_grade": "A", "created": "2021-12-07T22:45:52Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "She's not that bad of a professor. Her lectures can get boring and I find it hard to stay focused. However, when she's lecturing she does point out if the information will be on the exam and how she would test us on it which was extremely helpful when rewatching lectures and studying. I think that if you put in the work, do the weekly quizzes and study at least a week before the exam you should have no problem getting an A. Her exams are straightforward and if you studied you should do well.", "rating": 4, "expected_grade": "A", "created": "2021-12-16T03:32:27Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Pros\r\n- Dr. Keller is a decent lecturer, information is conveyed clearly through his own speaking and his slides\r\n- Lectures are relatively engaging, with light humor\r\n\r\nCons\r\n- Bad at communication (i.e. emails)\r\n- Highly passive-aggressive\r\n- As of the Fall 2021 semester, it is CLEAR that he does not care about the health and well-being of his students. Some context: there is currently a massive uptick in COVID-19 cases, and President Pines has mandated the wearing of KN95 masks (which will do little to negate the spread, considering how students must sit elbow-to-elbow for two hours for a single final exam). Dr. Keller has aggressively refused to move his final online despite other professors doing so.\r\n\r\nFor the last point alone, he nets a single star out of five. He is an actively immoral human being.", "rating": 1, "expected_grade": "B+", "created": "2021-12-17T01:57:32Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller isn't an awful professor, but its glaringly obvious he could not care less about any individual student. He constantly seems annoyed by students emailing him and makes people feel bad for asking questions about concepts he glazes over. Highly recommend taking Compton instead if you have the option.", "rating": 2, "expected_grade": "B", "created": "2021-12-17T02:52:56Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a great professor to have for this class. The course load consists of worksheets, weekly quizzes, practice exam problems, four midterm exams, and a final. The amount of midterms can seem overwhelming, but Dr. Keller provides study guides that perfectly outline the material you need to know. GSS worksheets are also available to study from as well.\r\n\r\nI decided to give Dr. Keller a 4/5 rating due how he handled the current Omicron situation. Students were very concerned about sitting shoulder to shoulder with others while having to take this exam, and he was very passive aggressive in his remarks to those with concerns.\r\n\r\nOverall, the class is pretty straightforward, and he gives out a lot of extra credit!  ", "rating": 4, "expected_grade": "A", "created": "2021-12-17T18:06:59Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "She makes students feel stupid and is honestly so rude. Avoid her at all costs. I went to her when I was struggling in the class and she told me to literally keep doing what I was doing. She goes way to fast and her exams are so hard. Her wording is the worst in the exams- note, they are not multiple choice. I regret signing up for her class and even going to her for help. I had an A until recently because her exams are so hard and 50 minutes is not enough. Also, having extreme anxiety for her final tomorrow. ", "rating": 1, "expected_grade": "B", "created": "2021-12-17T22:12:11Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "this class was pretty easy if you put in the work and study for the exams. the exams were really straightforward and easy. i recommend going to gss, reading the modules, and looking over the study guides he posts on elms because they were extremely helpful when studying for exams. dr. keller himself is nice and sometimes funny. lectures can be boring sometimes but you NEED to attend to get the extra credit clicker points! clickers rlly carried my grade. this would have been a 5 star review but it is 4 stars since he is pretty passive-aggressive. ", "rating": 4, "expected_grade": "A+", "created": "2021-12-19T17:58:22Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I am seeing all of these negative reviews and am taken aback. Dr. Keller is a great teacher and gives very easy and straightforward exams. (They are super similar to the gss worksheets so do those!). He is a very nice man and cares about making sure everyone is learning well.  If you try to do well in this class and study, you will do well, it is that straightforward. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-20T07:14:49Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a great professor. He gets the class very engaged in the lecture and never just reads off the slides. He makes good analogies that better the understanding of the topics when he could tell some people can't understand. I would recommend never missing a lecture and always taking notes. If you just pay attention for every lecture the exams will be very easy and minimal studying will be required to do well. He gives out a ton of studying resources which are very similar to the exams. Beside his poor communication with the students and passive aggressive responses, he is an amazing professor. ", "rating": 4, "expected_grade": "A", "created": "2021-12-20T21:19:16Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Great professor, gives not much homework but when he does, it's pretty helpful and relevant to the upcoming test. His modules on ELMS are top notch, especially the study guides he posts before exams. Pretty nice overall and attend his classes for extra points! This can really help your grade ", "rating": 5, "expected_grade": "B+", "created": "2021-12-27T05:59:12Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller was an awesome professor. His lectures were were very clear and he followed a slide show which he showed on the projector and posted on ELMS.  He was pretty funny too which helped make the class more engaging. The coursework is pretty light with some worksheets every couple weeks and easy online quizzes. Tests were pretty easy and tested you on exactly what he said in lecture and put in the notes on ELMS. He also had clicker questions in class that were free bonus points for participation. It's an easy class if you pay attention in class and are actually interested in the material.", "rating": 5, "expected_grade": "A", "created": "2022-01-11T23:11:10Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "He is an amazing teacher who really knows his stuff. As long as you listen in class you should be fine. The tests are very fair but the weekly quizzes are a bit tricky. Overall, I had an amazing experience taking Dr. Keller.", "rating": 5, "expected_grade": "A-", "created": "2022-01-24T23:47:52Z"}, {"professor": "Reid Compton", "course": "BSCI170", "review": "Dr. Compton means well as a professor, but can come off harsh. His lectures are a little boring but they go over everything you need to know for every exam. The class wasn't hard, just put in time before and after class, and you should know the concepts. As long as you are constantly reviewing the material, you won't have to study a lot for the exam. I never got lower than a B on his exams. Also he tests your knowledge on the concepts, not just memorization of them because he will Gove you random scenarios where you will have to apply what you've learned to correctly answer. ALSO GSS SESSIONS ARE VERY VERY HELPFUL. HIGHLY RECOMMEND--ESPECIALLY THE GSS LEADER, SAAD.\r\n\r\nHonestly I was very scared to take the class, but if you want an A and work for it, you will get it. Also there was a slight curve at the end of the semester and he dropped the three lowest grades from the little quizzes we had. ", "rating": 5, "expected_grade": "A", "created": "2022-01-27T17:07:45Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Awesome teacher, take if you have the option! He actually cares about kids doing well and learning and has a pretty consistent schedule that makes it easy to keep up with. Also posts lecture material very soon after class which is helpful if you miss or are late. ", "rating": 5, "expected_grade": "", "created": "2022-02-18T17:32:05Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is an amazing professor who has open discussion boards for specific questions (where he personally responds to you), detailed slides that he shows during the lecture and posted on ELMS, and records his lectures. He speaks loud and clear for the entire room to hear and he cares about all of his students. It is worth an early time slot and/or a Friday class in order to have Dr. Keller. I have not heard anything good about other BSCI170 teachers and would even wait until Dr. Keller's class is open to take BSCI170. Amazing teacher.", "rating": 5, "expected_grade": "", "created": "2022-02-23T15:51:07Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller is one of my favorite professors at UMD thus far based on his teaching. I always felt engaged and understanding with the content. His exams get progressively harder just study and go to the GSS if possible and you should do fine.", "rating": 5, "expected_grade": "A", "created": "2022-04-13T02:11:27Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Unpopular opinion but I did not think Professor Fletcher was worth taking an 8 AM. He only gave 3 exams, versus other classes that gave 4 so therefore there was more information on each exam. His \"exam guides\" had like 4 example problems and the rest pretty much told you to go through each of this 40 page powerpoints that you'd have at least 7 of per unit. I feel as though he wasn't super helpful and didn't give me an easy way to do well in the class. I have a lot of friends who agreed with me and regretted not taking Kehler", "rating": 3, "expected_grade": "B", "created": "2022-04-25T20:13:15Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Maybe the people who reviewed Fletcher well had him online because I personally did not understand the hype especially when I took this class at 8am. His review guides are not helpful as there are only about 4 questions on it which don't constitute a study guide in my opinion. While he does post all lectures online, and textbook reading isn't really required, be aware there are group activities once a week that are mandatory. Exams had an incomprehensible amount on them also, I think he could spread the topics out more. Be ready to spend a majority of your time studying the week of exams if you take this class. ", "rating": 3, "expected_grade": "B", "created": "2022-05-06T02:33:30Z"}, {"professor": "Reid Compton", "course": "BSCI170", "review": "Like many of the other reviewers have said, Dr. Compton is a nice guy but not a good professor at all. He is very monotone and just goes through slide after slide way too fast, and gets mad when no one wants to participate. He makes studying for exams difficult, as he will upload ones from previous semesters but not a key to see if you actually did well. His exams also consist of applying knowledge that is taught in lecture, but he never actually teaches how to apply in the first place. Would recommend taking a different professor.", "rating": 2, "expected_grade": "B", "created": "2022-05-08T19:49:44Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Took an 8 am for his class in spring 22', I honestly don't think it was really worth taking. I went to nearly all his lectures and his tests were ok, it contained a lot since there were only 3. From the reviews and grade data for his 170 class, there was a high chance of getting an A for the class. But now that I think about it, the grade data only showed for previous years when his class and exams were online. Connect the dots. Overall he's a really nice and helpful professor. GSS is also very helpful, especially Saad's, he goes in-depth with explaining and it's much easier to understand in lecture. ", "rating": 4, "expected_grade": "B-", "created": "2022-05-09T19:39:59Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "great class. lectures are super engaging and makes really good examples to relate content to stuff you know. I'd say tests are pretty fair he gives weekly quizzes and practice exam questions that really help out. Sometimes he does talk a little fast and goes over complicated concepts like they're nothing so I recommend watching a quick crash course video before his lecture to kind of get a better sense of what he's referring to. he also gives lots of clicker question credit and posts all his slides", "rating": 5, "expected_grade": "", "created": "2022-05-12T00:41:23Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I thought Dr. Keller was a pretty good teacher, but he definitely could have done a better job explaining some concepts. He does have amazing recourses to learn and understand everything, and a lot of extra credit from clickers. As long as you show up to class and study from his modules, you will do well", "rating": 4, "expected_grade": "A", "created": "2022-05-13T01:00:23Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "I understand where the other reviews are coming from, but people must understand 170 is a very content-heavy course. Almost any biology course will cover a lot of information and I believe his exams were really fair. None of the exam questions were trick questions or surprises. Everything on the exam is something that he has gone over in lecture or are very similar to the in-class activities we are required to go to. He is also really lenient with grading as he allows you to drop the lowest assignment in each category. Fletcher was more than generous when it came to grading and I found his exams to be easier than other 170 professors when I compared with friends. Plus, he recorded his lectures so it wouldn't be the end of the world if you slept through his class. ", "rating": 5, "expected_grade": "A", "created": "2022-05-17T05:28:51Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Great professor. He requires a lot of effort, but his exams are straight forward and it's possible to do well in his class. Attending GSS or office hours before the exams, and reviewing the concept checks were helpful for studying.", "rating": 4, "expected_grade": "A-", "created": "2022-05-19T00:42:22Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "I think that Flectcher is a really great professor. His class is low stress, and I thought that all the assignments were very easy, even the exams. The concept checks were really helpful, and the exam questions were entirely based off of the Powerpoints. Having mandatory group activities on Fridays wasn't great, but they were very easy points. He also drops the lowest assignment in every category, so if you missed one, it wasn't a big deal. His lectures are a bit dry, but I still think he's worth taking. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-24T14:20:25Z"}, {"professor": "Reid Compton", "course": "BSCI170", "review": "His lectures can be a little boring but he is very passionate about the material. The class is very easy if you put in time to study and do your homework. I highly recommend going to GSS sessions and studying the formats of his past exams since they can be challenging. There are no keys but you can email your practice answers to a TA or GSS leader to see how well you did. He also tends to give bonus points on the exams to boost your grade. Quizzes are open note and easy to get full points on. I recommend doing all the small work he gives because it will really help lower exam grades. He likes to have participation in the lectures so do not be surprised if he comes up and asks you a question, he is not mean about it either. It felt like he truly cared about his students' learning.", "rating": 4, "expected_grade": "A+", "created": "2022-06-02T14:56:57Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller teaches off of slides every class, but he manages make it not a monotone lecture. He also creates modules for every lesson which I strongly encourage looking over. The information he provides in the modules is not overwhelming, and definitely helps build a clearer picture. His test are pretty straight forward as long as you listen to what he says during lecture. He is also a fair grader, and puts in the effort to explain concepts during office hours. You will honestly be fine. (And just to be clear, I expected a B- in this course; however, I received an A-. And in the beginning, I thought it would be hard too).", "rating": 5, "expected_grade": "B-", "created": "2022-08-25T04:49:53.619259Z"}, {"professor": "Reid Compton", "course": "BSCI170", "review": "When I originally signed up for Professor Comptons section of BSCI170 I was hesitant considering the reviews here and after taking his class I can reassure you all those bad reviews are right. No curves on exams, extremely hard exams, a very small amount of resources to use for studying, and very boring lectures that have me panic typing notes at a 100mph because he goes so fast. I would reccommend anyone who has to take this class to honestly try and get another one of the other BSCI professors, this guy prides himself on having class average grades be from 45% to 60% and then gives no curves because he claims you didn't study hard enough. I wouldn't consider myself a try hard student but when I am in the library 4-6 hours a day, the week leading up to Professor Comptons exams following his review guides all day something has got to give. And trust me I didn't do bad on his exams and quizzes but the structure that this class was taught in honestly made trying to learn about something interesting more of a hassle and super boring. Don't take this mans sections, even if the only other option is an 8am with a different professor.", "rating": 2, "expected_grade": "C+", "created": "2022-10-31T01:19:12.212357Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Dr. Mohan is extremely knowledgable about the subject and offers great resources to help prepare for exams. All of the exam material is consistent with what is taught in class, participation is key to ensure you do well on the exams. The only complaint is that there are 3 exams throughout the semester, with the final exam shortly following the third, with little time in between. Overall, BSCI170 with Dr. Mohan is a course I do not regret taking and would highly recommend her as an instructor", "rating": 4, "expected_grade": "A", "created": "2022-12-02T20:15:44.619092Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "great professor overall", "rating": 5, "expected_grade": "A", "created": "2022-12-06T15:21:44.166775Z"}, {"professor": "Reid Compton", "course": "BSCI170", "review": "I was scared to take him after all the reviews I read. However, in my opinion, his class is merely not as bad as others describe it to be. Although the slides aren't the most interesting thing in the world, he records most of his presentations, so you can always go back and watch them which I found to be extremely helpful for exams because his exams are super specific to his presentations. Maybe his exams aren't as straight-forward as other professors, but by no means are they impossible. He gives a small curve on each exam and if you know how to study properly for them (and ahead of time), you should be completely fine. You need to put in a substantial amount of time into this class, but it is completely doable and Professor Compton definitely knows his stuff and loves biology. He can come off as a little harsh, but when you talk to him, he is very kind and reasonable.", "rating": 4, "expected_grade": "A", "created": "2022-12-06T21:29:48.756603Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is an alright professor if you're looking to learn biology. He teaches from the slides and doesn't really give much insight past that so attending lecture isn't that big of a deal. The exams are not what you'd expect either. The lectures teach the material to you in an elementary fashion, but the exams are much more than that. If you're looking to pass the class with a decent grade you'll have to do a lot of outside studying on the basic material.", "rating": 2, "expected_grade": "B", "created": "2022-12-09T16:29:32.638149Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I really like Keller. He simplifies as much as possible and will do visual demonstrations that are helpful. He also supplies lots of resources that are in easy access on canvas. You don’t need a textbook for his class. Exams are pretty easy but you do not get practice exams. Great class and professor overall.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T17:26:34.342157Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "He's a goat; his class is not easy, so don't think it is, but if you work hard, you can get an A, He's a lot of fun, and I plan to TA for the class, I need a 69% on the final to get an A and a 75 for an A+. Keller is fair and gives back many points if you ask I remember I got an exam regraded from 81 to a 90 if you can prove you are right, he will not trip. He gives really good study guides he's really fair he's so good. If u want to learn, take Keller. If u want an easy A, then look at fletcher (Idk if that's how you spell his name lol), But his class is just easy it will not help you if you have more Bio to take. All this to say, go take Keller he's good he really cares about his kids. gives extra credit, and always had a smile when class started. I wish he taught more bio I would keep taking his classes", "rating": 5, "expected_grade": "A+", "created": "2022-12-14T22:48:52.785187Z"}, {"professor": "Reid Compton", "course": "BSCI170", "review": "The exams were very difficult but if you put in a lot of time and effort you could start to see the types of questions he was going to ask. Additionally, Dr. Compton was always available during office hours and even let you stay after they were over to answer all your questions. He was very approachable and responded to emails within hours even on weekends. GSS was very important so I would not recommend neglecting that, especially in the beginning of the course", "rating": 4, "expected_grade": "A", "created": "2022-12-19T19:57:02.359327Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "his exams are fairly easy. Just study his modules.. His slides contain nothing so you have to take notes as he lecture. There are quizzes and worksheets every week but he drops many stuffs. Extra credits from clickers", "rating": 4, "expected_grade": "A", "created": "2022-12-19T22:05:48.228108Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Dr. Mohan is extremely knowledgeable about the subject, but she teaches very fast, it is hard to keep up. If I had not taken AP Bio in high school, I probably would have struggled immensely in this class. Her slides are very disorganized, often either containing a lot of words, or just screenshots of pictures from the textbook, making them hard to follow. She also does not give very much introduction to the topic and just starts lecturing, often going from one topic to another that have zero connection. She does clicker questions, and you have to answer 80% to get the full 50 points, so you do have to go to class most of the time. HOWEVER, she records lectures and posts those and the slides right after class which was helpful. Additionally, every week she does a problem set, and drops the lowest three grades, so you do have to be present for those. There are three exams plus a final and none are dropped. She provides a very loaded list of what you need to know, basically including every single thing we learned, as well as the problem sets with the answers. Overall, I did not enjoy her teaching style and I taught myself 90% of the topics through YouTube videos. You also have to study A LOT. Get ready to teach yourself. She does not curve the class at all, which I found unfair due to the amount of work I put into this class. She does not appear to care about her student's success, so please try and take a different professor who actually cares and does not make you dread class.", "rating": 2, "expected_grade": "B+", "created": "2022-12-20T00:33:52.462906Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Aside from being a great professor. He's just a great person all around. He's willing to help you in and out of class. One of the best professors I've ever had. I had him couple of semesters ago and I still wish all of my professors were as good as he was.", "rating": 5, "expected_grade": "", "created": "2022-12-21T00:23:48.830642Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "She definitely goes fast in lectures but she uploads them to canvas so you can rewatch anything you missed. Her study guides for the exams list (nearly in order of how they appear on the exam) exactly what you need to know. She will also tell you as she teaches what things will be important on the exam and what will not. Sometimes she jumps around but its really manageable with a bit of review. You definitely have to watch every single lecture (online or in person) and then go through and deeply review all of the terms on the study guides for the exams. The weekly quizzes are super easy as long as you took lecture notes. Although BSCI170 is a broad, difficult class, it is mainly memorization. Mohan teaches it very straightforward and there were never any trick questions/unclear questions on the exams.", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T06:40:01.199319Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "She wasn't a bad professor, but she went over the lecture slides quickly, making it difficult actually to learn the material. I took this course during my first semester and since I'm a first-year student, I found the content of this class to be DIFFICULT. I felt more behind than everyone else since I didn't take any AP science classes like bio or chem in high school. For this class to be seen as a doable course for first-year students is a bit much. I felt like I wasn't learning anything cause the amount of content you go through in this class is face paced and a lot. If you don't have any prior background in Biology I think you may find this class difficult as it was for me. The lectures are somewhat mandatory since at the end she does give 50 points if you answered over 80% of the clicker questions. The weekly quizzes were online and fairly easy. The problem sets that happen in class aren't bad sometimes the problem sets were difficult it had the whole class confused but I think asking around and talking to people will get you to understand the problem sets more. The exams are NOT multiple choice. They consist of things like matching definitions and almost like word problems, so you have to study a lot to know the material cause when I studied I still struggled on the exams cause I felt like the wording is off. I don't know if I would suggest the professor cause I just struggled mainly with how the class was structured more than the actual professor. She does give you a lot of resources and practice problems and a list of all the content you need to learn for midterms and exams. There are 3 midterms and a final which is 2 weeks after the third mid-term. I would say find a better professor if possible but also be prepared to study a lot in class especially if you don't have any science background.", "rating": 2, "expected_grade": "C", "created": "2022-12-23T04:13:57.787591Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I liked Keller's style of lecturing. Unlike the other review, I thought that his slides did contain a lot of information that was relevant for notes, but definitely pay attention to what he says because he gives a lot of little hints about stuff that will be on quizzes or that will be important for you to know. His clicker questions end up being quiz questions too, so write those down. I ended with an A in the class, didn't really study much for the exams because GSS was so helpful in their reviews. There wasn't a final GSS session, but you can go back and redo the old GSS worksheets to review. I got a 97% on the final by doing that.", "rating": 4, "expected_grade": "A", "created": "2022-12-24T14:31:04.080975Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Honestly, she's not that bad. Before I took her class, the reviews scared me but after taking her, she's a great teacher . . . sometimes. When it comes to course material, she is very organized and has recorded lectures which is great because if you don't get the information down the first time, you can watch it as many times as you want. Although she does post the slides, some of them have the information written on them but some don't. So you actually have to take notes on what she says because sometimes she shows diagrams and the info she speaks is important for the quizzes or practice problem sets. NOT ONCE did I use the textbook so don't waste your money, it's useless. But that just shows how good of a lecturer she is. She also is awesome at creating reviews for exams. Her exams are similar in format to the practice problem sets that we do in class so it's a good thing to become comfortable with the format (not confusing at all). Her practice exams are also very helpful. Clicker questions are done during class but they are based on participation so it's not much of a hassle. One reason I didn't give her 5 stars is because of her manner. She sometimes comes off as passive-aggressive when answering questions for her students but I kind of understand, kinda. Like saying \"you can go over the recorded lecture after class, I will not repeat myself because of our limited time\" which I kinda get but she also gives standoffish vibes which might prevent students from asking questions.", "rating": 4, "expected_grade": "A+", "created": "2023-01-10T17:45:26.328785Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a pretty good professor. His style of lecturing is easy to understand and follow along with. He makes it very easy to review and study for the exams. His clicker questions test you on stuff that will be on the exam. He uploads his slides and other very helpful resources on canvas that I would definitely recommend studying.", "rating": 5, "expected_grade": "B", "created": "2023-01-11T22:18:34.334584Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "I was scared going into her class due to past reviews but she was not as bad as the reviews make her out to be. She was very straightforward and went deep into her lectures. She records her lectures but has clicker questions so going to class is mandatory. However, you only need 80% of clicker questions to get an A, so if you can't go to class for any reason, it's not the end of the world. There were 3 midterms and a final with a 2-week break between the 3rd midterm and final. She was very understanding when I was sick and couldn't go to class and take her midterm. She was very accommodating and waited until I was better to give me the midterm. Her TAs grade everything and she gives many chances for regrades. There is a quiz each week, due at the same time each week. It is online and open note and she gives plenty of resources to help you. For all her midterms and the final, she provides all recordings, past exams, practice exams, past quizzes, and a list of everything that will be on the exam. It is a hard class but if you just listen to all the recordings, go to TA review sessions, utilize the GSS person and do all the assignments you'll get an A. One thing was she can be a bit condescending when people ask questions but is intrigued by other questions. Also make sure not to talk in class when she is talking or she will certainly embarrass you. She definitely has tricks in her exams so make sure you know the material throughly. I ended the class with a 89.7 and she rounded it to an A even though the syllabus marked 89% as a B. W teacher tbh", "rating": 5, "expected_grade": "A", "created": "2023-01-15T23:21:12.578689Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "i had her fall 2022 & didn't see her reviews until too late so i was scared. she ended up being fine, i think the reviews are a bit harsh. she has weekly quizzes online with 2 attempts, nothing too bad, weekly in class problem sets that are really helpful for the exams, and she records her lectures and posts all of the slideshows. there were 3 exams and the final, the spacing was really bad because the third exam and final were only a few weeks apart which left me cramming to learn the latest material. she also has clicker participation that's only graded on completion so don't miss too many classes or you won't get a full participation grade. as a professor she was fine, she was accommodating when i was sick and is definitely very passionate and knowledgeable. she does move fast but stops for questions, she does not appreciate talking in class so don't do that. as long as you understand her lectures and are doing the problem sets and asking questions you'll do fine", "rating": 4, "expected_grade": "A-", "created": "2023-01-26T20:36:55.487869Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller was great. He projected so everyone could hear him. He was lively during his lectures, which made them easier for me to concentrate on. He's also very approachable and nice, so don't be afraid to ask him questions. His exams are also not bad, if you study the material and go through the modules. I really don't have a single complaint about this professor, he was amazing. 10/10 would recommend.", "rating": 5, "expected_grade": "B", "created": "2023-02-09T18:59:30.464932Z"}, {"professor": "Cornelia Van der Weele", "course": "BSCI170", "review": "Super nice lady but not the best teacher. Spend a good amount of time studying for the exams", "rating": 3, "expected_grade": "A-", "created": "2023-04-29T18:05:36.861011Z"}, {"professor": "Eric Haag", "course": "BSCI170", "review": "Dr. Haag is a passionate professor who gives interesting lectures and genuinely seems to enjoy teaching. Unfortunately, this was his first semester teaching BSCI170 and it shows. Exam averages were significantly lower in Haag's class and test material required much more in-depth studying than the general conceptual understanding covered in other professors' exams. Over time I believe Haag has realized this and made adjustments to help students succeed, but they have been minor and the majority of his help is just reminding students of how to study properly. I have enjoyed BSCI170 and can say it is 100% possible to succeed in this class, but you will have to put in much more work to get the same grades as people with other professors. I do think this was a test-run semester for Dr.Haag and things will be smoother if he teaches this course again.", "rating": 3, "expected_grade": "A-", "created": "2023-05-01T16:10:21.867388Z"}, {"professor": "Cornelia Van der Weele", "course": "BSCI170", "review": "Dr. Van der Weele is a very sweet professor, and she is very accommodating. Her study guide modules on ELMS are incredibly helpful for studying for the exams, and there usually isn't anything out of the blue on them. If you look at those, you should do fine. Sometimes she can be a bit quiet during lecture, but a mic is used so it doesn't affect much. I really enjoyed her class!", "rating": 5, "expected_grade": "A+", "created": "2023-05-02T01:02:14.611213Z"}, {"professor": "Eric Haag", "course": "BSCI170", "review": "Dr. Haag is a very passionate professor who tries his best to make sure you understand the material taught and tries to make the class enjoyable and fun. Now this was his first semester teaching BSCI 170 so there were some bumps in the road throughout since he was getting accustomed to teaching 170. As there were no practice exams, as the TA's had to get examples from Dr. Fletcher's practice exams and used those during GSS sessions. Throughout the course, Dr. Haag improved and adjusted to help his students succeed after the very poor average on the first exam. Dr. Haag does not give any extra credit, and the course is primarily based on 3 exams (lowest gets dropped) and a final. There are concept checks following each lecture that you have 3 attempts on, and GAE sections that are participation points, and at the end of the semester, those will eventually have the same point value as a midterm. The material covered throughout 170 is very similar to what one would've learned in AP Biology, but you just go a bit more in-depth with the material covered. I have enjoyed BSCI 170 and I can say that as long as you put the effort, you can easily pass this class. But in order to pass, you need to know more than just the memorization aspect of the material covered but also how to apply the concept taught. I will say that going to office hours and GSS sessions are VERY important to go to because the TA's help you understand the material in a way that an undergraduate student would understand. Dr. Haags office hours are great to go to as well but he sometimes tends to ramble on the material you had questions on but this further shows how much Dr. Haag knows about the concept and his passion to help you understand what you're learning instead of just memorizing the material. The bulk of the material that I understood came from the TA office hours and GSS sessions so DON'T SKIP THEM. This class is very interesting if you take the time to learn the material and ask questions when you have them. I would 100% recommend Dr. Haag as since this was his first semester teaching BSCI 170 it will be smoother when he teaches this course again.", "rating": 5, "expected_grade": "A", "created": "2023-05-02T20:20:30.127601Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller is a great lecturer. He provides really good examples and simplifies things to make it easy to understand. His exams are fair - what is on his study guides is on his exams. He doesn't word them weird. His quizzes and worksheets are very helpful for studying. He gives many opportunities for practice. Would definitely recommend.", "rating": 4, "expected_grade": "B+", "created": "2023-05-03T19:01:20.819254Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Like the other reviews say he is a great lecturer and an amazing teacher. His exams are straight to the point and cover more content less in depth and not one that has a bit of content but very in-depth (if that makes sense). TA's were good and the GSS sessions were very useful. I highly recommend him and see him as the top option for BSCI170", "rating": 5, "expected_grade": "A", "created": "2023-05-03T19:48:16.304542Z"}, {"professor": "Cornelia Van der Weele", "course": "BSCI170", "review": "Easy test, if you study u get an A, Easy slide to learn not overload information", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T16:31:45.379747Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a fantastic professor and his lecture style is incredibly easy to follow. He teaches the course almost like a middle-school type feel (and I mean this in a positive way) where he explains many concepts well as if it is the first time you are hearing about it. The lectures do not feel dragged out, and he provides great summaries of concepts on his ELMS page inside the modules. The exams are very straightforward, and the open-note weekly quizzes are nothing to worry about since they can be finished usually in less than 10-15 minutes. He also had worksheets for us to complete for concepts that required a more out-of-the-box thinking, which were helpful. I didn't think it was a lot of work either, and the studying before the exams didn't take long. I highly recommend Dr. Keller as a professor.", "rating": 5, "expected_grade": "A", "created": "2023-05-09T18:31:29.948052Z"}, {"professor": "Eric Haag", "course": "BSCI170", "review": "Honestly, he was nice but made the class very challenging for no reason. For the unit on proteins, we were expected to know every single structure of all 20 amino acids. Compared to the other BSCI170 classes our exams were always more challenging and we were expected to know more material than the other classes. Honestly, this class feels like an upper-level bio class.", "rating": 2, "expected_grade": "C+", "created": "2023-05-11T00:09:14.387715Z"}, {"professor": "Eric Haag", "course": "BSCI170", "review": "I wanted to give zero stars. This class is very difficult and he says \"I'm sure this is a review\" at the beginning of every class even tho this is an intro level bio class. He usually teaches upper level bio courses, and I honestly don't think he knows how to teach an intro level course. If you say you are struggling, he will say to study more. And don't ask for extra credit! He will say you are begging and you should just focus on what you bombed on the previous tests to study for the final. Just save yourself and take this class with Keller. He does not curve and thinks a 60 average on tests is fine. He always says bare with me but then does not accommodate when the student is having trouble. SAVE URSELF!!", "rating": 1, "expected_grade": "C-", "created": "2023-05-11T00:13:59.001736Z"}, {"professor": "Eric Haag", "course": "BSCI170", "review": "Do NOT take bsci170 with this professor, unless you care about c elegans and want to fail your tests while your friends with Keller are actually learning things. He overly complicates everything and tries to fly through 50 slide lectures while talking at you. He also seems like a nice guy but doesn't actually wants what's best for us as students. By the end of the semester, he told us to stop asking for \"freebies\" and start learning the material as it is \"our job\"... as if his job this whole semester wasn't to teach us. GSS is helpful but not enough to pull you out of the rut many students will end up in. These exams are so irrelevant to class and you will fail them (which he thinks is fine) unless you spend every waking hour watching videos on the topics.", "rating": 1, "expected_grade": "C", "created": "2023-05-11T00:16:54.277540Z"}, {"professor": "Eric Haag", "course": "BSCI170", "review": "Dr.Haag is one of the nicest professors I have met at UMD. He is extremely passionate about his job and truly shows an interest in the topics he teaches. While he is a quirky guy, he tries his best to make his long lectures somewhat interesting. His class is certainly not for everybody and your grade is solely dependent on your midterms, but if you put in the work you will be rewarded. Additionally, he is great at actually responding to feed back from his students, and his course has gotten progressively better as the semester has gone on (this was his first semester teaching 170). This class will definitely challenge you, but there is not reason why you should be afraid of taking Dr.Haag.", "rating": 5, "expected_grade": "A", "created": "2023-05-11T23:30:54.261129Z"}, {"professor": "Eric Haag", "course": "BSCI170", "review": "I would give zero stars if possible. avoid at all costs. why? ill get straight to the point. 50+ slides, exam averages lower than organic chemistry averages (how is that possible?? bc of his exams) his exams are NOTHING like the slides. the slides say (x,y,z) the exam says (z-x+y). Basically, it's complicated for no reason. I asked him how to study better, he said read the slides. thanks! helped a lot. The biology department needs to seriously evaluate this. incredibly disappointed about how this class was taught. I was expecting this to be one of my favorite classes, as I love bio- and suddenly I hate it.", "rating": 1, "expected_grade": "B", "created": "2023-05-12T15:55:55.037783Z"}, {"professor": "Cornelia Van der Weele", "course": "BSCI170", "review": "She is a nice person, but a bad lecturer. There were multiple times in my class where students were talking while she was and she didn't say anything to them. She is also a relatively quiet speaker, so that didn't help. Her lectures are pretty boring and sometimes hard to follow and she had multiple tech issues. Her exams aren't the worst I've had for sure, but not being able to learn much from her lectures and having to study a lot on my own definitely contributed to my lower than expected grade.", "rating": 3, "expected_grade": "B-", "created": "2023-05-12T20:12:46.781586Z"}, {"professor": "Eric Haag", "course": "BSCI170", "review": "Really nice guy, super enthusiastic, but his lectures were not for me. He talked really fast and did not explain concepts in a way that worked for me. He would try to give real-life examples, but he had not explained the concept enough for the example to make sense. Moreover, he always had like 60 slides and would cover the first 30 at a really fast pace, but because he would ramble, he had to cover the last half of the slides in the last 15 minutes. I will say that his lecturing improved throughout the semester. 3 midterms (only 2 count) each worth 100pts, a final worth 150, and 110 points of mini quizzes and participation. He was nice, and if you are super passionate about bio then he might be for you.", "rating": 3, "expected_grade": "B", "created": "2023-05-12T22:08:56.159006Z"}, {"professor": "Eric Haag", "course": "BSCI170", "review": "This professor is very knowledgeable in the subject he is teaching. He conveys the material in a way understandable to students. He has long slides but as long as you get though them you should be okay. grading scale is reasonable and the lowest exam gets dropped. Take dr. Haag for 170!", "rating": 5, "expected_grade": "A-", "created": "2023-05-13T02:07:14.359419Z"}, {"professor": "Cornelia Van der Weele", "course": "BSCI170", "review": "Very nice lady, but not a good teacher. Lectures/lecture slides are very hard to learn from. I ended up teaching myself most of the course. However her study guides were very well done and reflective of what would be on the exams, which helped a lot. If you understand everything on the study guide you will do well on the exams. It was easiest for me to look at them to see what I needed to know and then just teach it to myself through youtube or online. Also does not drop an exam like some other BSCI170 professors do.", "rating": 3, "expected_grade": "A+", "created": "2023-05-16T01:14:22.501330Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is an incredible professor. His exam format is really nice and makes sense. Definitely use his study guides because they help so much for the exam. He is really flexible and super approachable, so never feel scared to ask him any questions. His lectures are really straight forward and he does an awesome job at explaining.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T20:50:12.437603Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Loved dr Keller. I wish he taught more bio classes that I could take. He was quirky, but overall lectures were somewhat engaging. His exams were very reasonable and pretty easy. I liked his grading system which was by points instead of what canvas actually says. Overall he’s an amazing professor and I’ll miss his class.", "rating": 5, "expected_grade": "A-", "created": "2023-05-19T22:07:32.285159Z"}, {"professor": "Cornelia Van der Weele", "course": "BSCI170", "review": "As others are saying, she's really nice to talk to, but hard to learn the material from. It's not super difficult by any means, and it's mostly just memorization that can be done on your own. The slides and worksheets are really helpful, and there are exam study guides. I will say if you just rely on lecture to prepare, it most likely won't go well. 99% of the material was identical to Keller's, the slides, the exams, everything. Some quiz scores and worksheets grades are dropped, so it's unlikely that there will be a large curve at the end. You will most likely get a good grade, just may not learn the material very well from her.", "rating": 3, "expected_grade": "A", "created": "2023-05-19T23:03:55.916644Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Such an awesome teacher! Take him if you can!", "rating": 5, "expected_grade": "A", "created": "2023-05-21T18:29:37.698085Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller was great. He tries his hardest to keep the students engaged. He's great at explaining topics, I do feel like he oversimplified some complex topics and wouldn't spend enough time on those. Which is especially concerning because some complex questions were on the exam. However, I think a little research into the topics wouldnt hurt. There wasn't any curving in this class, but relatively the exams weren't too difficult. I would say the photosynthesis/calvin cyle unit is the most difficult so just be careful during that unit and make sure you pay attention. His study guides are great and good for  exams. Wished he gave practice exams tho.", "rating": 4, "expected_grade": "C", "created": "2023-05-23T04:59:13.879816Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller is an amazing professor who cares about his students. He simplifies all the concepts so they're easy to understand and I never felt too confused in his class. If I was, doing the worksheets normally solved that problem (he only keeps the highest 5!) or I could just go back and watch the recorded lectures since he posts them. His class sets you up for success. Make sure to show up to class because you can get up to 20 extra credit points from clickers, and the clickers themselves actually help you apply what you're learning throughout lectures. Also he explains a lot more in depth during his lectures than what's on the slides and a lot of this information really helped me for the exams. His exams are super fair, if you learn the material, you'll do great. He posts exam study guides that include everything that'll be on the exam, nothing on the exams were ever a surprise.  I honestly have no complaints, I'm so glad I had him as a professor. Pick Keller.", "rating": 5, "expected_grade": "A", "created": "2023-05-23T21:25:22.518294Z"}, {"professor": "Eric Haag", "course": "BSCI170", "review": "Really nice guy, but very evident that it was his first time teaching the course. He dropped the lowest exam grade, but the averages on all of the exams were lower than all of the other classes. His lectures weren't excellent, and you could tell that he didn't know the content well or maybe he knew it too well and was unable to explain it. He would keep repeating that it should be review, but if it was I wouldn't be in the class. Also, I technically should have gotten a B+ because of his rounding policy, but he gave me a B and has not responded to my emails (I emailed him three days ago and followed up this morning since grades are due today and he has not responded which means that I will likely end with a B :( ). He kept saying that he does not give freebies and that studying harder will help, but he never taught anything well enough to study from. He lectures really fast and I ended up having to relearn the material from Fletcher's prerecorded lectures. He also smashed lectures into one day to add more content and then once off-handily said we needed to know all 20 amino acids like structure for the test and about 20 points/100 on the test ended up being about having them memorized some way or another. All of his lectures were confusing and he would go on side rants about his research, and then had to rush through the slides. I didn't want to give him one star because he seems like a nice guy, but I would not recommend him.", "rating": 1, "expected_grade": "B", "created": "2023-05-24T03:08:18.639307Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "I'll keep it simple. Take him", "rating": 5, "expected_grade": "A", "created": "2023-05-25T14:40:16.236312Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "I would recommend taking Fletcher for this course. The only negative I can come up with is that he can rush through the slides sometimes, but everything else about the course is well done. You are typically given concept checks and group activity quizzes that are in place to help boost your grade and understand the material. The concept checks went over what we learned in lecture slides, and the group activity quizzes would help you prepare for the group activity worksheets. These worksheets helped to understand the material and were some more grade boosters. His tests were fair, and some of the questions in the review guide would be on the test. He also records his lectures, so if you miss a class or want to review material you can watch them. He would also drop the lowest midterm, so only two midterms will impact your overall grade at the end.", "rating": 5, "expected_grade": "A-", "created": "2023-05-25T14:44:10.020162Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Dr. Fletcher is the nicest most kind professor I have ever met. He records almost all of his lectures so going to class is optional except for about once a week where he has group activities to reinforce content. The group activities are relatively easy and reinforce topics. After each lecture and before each group activity you will have a short quiz these are easy and great to check your understanding. For the ones post-lecture you get three attempts while for the group activity ones you only get one. I found his exams to be difficult and very detailed oriented despite everything coming off his slides. There are 3 midterms and a final. He drops your lowest midterm. A lot of this is memory based and I wish I had started reviewing material earlier in the unit because I would have done better. The final was really difficult but manageable. It's just a lot of information and content to cover. The TAs, GSS people, and Dr. Fletcher himself are all super helpful and willing to answer your questions.", "rating": 5, "expected_grade": "B", "created": "2023-05-25T23:12:20.482695Z"}, {"professor": "Cornelia Van der Weele", "course": "BSCI170", "review": "For someone who didn’t take any AP science courses in high school, I found this class very challenging as Weele not only goes fast, but likes to waste class time teaching her students Dutch. Her class is exam HEAVY as there are 5 total exams when other professors only have 4; this means that if you do bad on her exams (no notes) but do great on literally everything else — then you’ll still get an overall bad course grade. Throughout the semester, I’ve had multiple classmates express that they never learned anything from Weele’s lectures and we basically had to teach ourselves in the only ways that we could. Please refrain from taking her class if you can.", "rating": 2, "expected_grade": "", "created": "2023-05-26T22:31:27.104750Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller provides so many supporting materials that there is really no way to be unprepared for exams. He posts written summaries of each lecture and study guides for each exam detailing exactly what you need to know. It's important to attend lectures as he says many things that aren't included on the slides, but he records lectures. The only downside is that he can be slightly passive-aggressive. Otherwise, I highly recommend Keller.", "rating": 5, "expected_grade": "A-", "created": "2023-05-30T20:10:11.498384Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Mohan's lectures were fast, overwhelming, and boring for me. If you can find the motivation and interest for the subject within yourself to review the material on your own, then you will be ok. She uploads slides to canvas. Weekly quizzes are easy, but exams need preparation. Took Mohan's BSCI course my first semester at UMD in Fall 2021, and I was a poor student in that class, so I did not succeed with her as a my professor. I did great in the lab (BSCI171), but the two are split, so the lab couldn't help my lecture grade.", "rating": 2, "expected_grade": "C", "created": "2023-06-09T00:11:45.210479Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "as someone who is horrible at Bio, i passed with a B! his lectures are very good, i would just skip too many lol. He teaches well, and the tests reflect that. However the tests are way more complex and complicated than what we learned. So you really have to understand the overall structures to get some of the questions.", "rating": 4, "expected_grade": "B-", "created": "2023-06-11T17:58:37.192604Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "The class itself isn't as bad as I expected. Just go to class and do the problem sets and weekly quizzes and you should be okay. Although Professor Mohan as a teacher is not great. She's rude and mean when you ask questions about something she already went over. Not helpful at all. Her lectures are also fast paced and she gets mad if you do the clicker questions without actually trying. TA's are super helpful so lean on them and other classmates!", "rating": 2, "expected_grade": "B-", "created": "2023-11-27T21:39:02.064737Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I thought his teaching style was confusing. He would throw a ton of information at you but wouldn't end up applying it to the bigger picture, which made everything a lot harder to remember even after studying for the exams. He's truly a really nice guy, but his teaching style could be confusing for someone who's not a STEM major (like me).", "rating": 2, "expected_grade": "W", "created": "2023-11-27T21:56:20.742840Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I think he would be a great professor for someone in a STEM major with a comprehensive background in biology. He is very knowledgeable in his field and clearly wants to help us learn, but he explains things in a way that only someone with prior knowledge can understand. His explaining methods confused me because he would throw a lot of information at you, but wouldn't do a concise job of connecting it to the bigger picture. However, he's a really nice guy and a pretty engaging lecturer.", "rating": 2, "expected_grade": "W", "created": "2023-11-27T22:01:28.576447Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "She's literally fine. Talks alot and goes through slides fast but she records lectures and and post ALOT of helpful materials during exam time. Weekly quizzes that are open note are fine, problems sets are fine, just ask the TAs for help. Exams are pretty straightforward and like 80% identical to problem sets, so just review those and practice exams she post in canvas", "rating": 5, "expected_grade": "A-", "created": "2023-11-30T00:41:50.548597Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Mohan is a very strict person and seems unwelcoming/unforgiving at times. She seems rude to her TAs and doesn't like when people overstep her power in the slightest bit. Our class is generally quiet, but she gets mad when she sees side conversations, even if they are about her lecture. Her exams are purely memorization based so if you study her slides well you will do fine on the exams. The TAs, on the other hand, are very helpful and nice, so I would refer to them for help on practice worksheets and if you have questions before exams.", "rating": 1, "expected_grade": "A", "created": "2023-11-30T21:46:27.556280Z"}, {"professor": "Cornelia Van der Weele", "course": "BSCI170", "review": "Solid professor but take Keller if you can.", "rating": 3, "expected_grade": "A-", "created": "2023-12-01T02:57:37.060139Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "AMAZING PROF, he was so engaging and he got to the point. His tests are extremely fair - only info based off his ppts. Clicker questions are an easy way to boost your grade and its only participation based. gss is super duper helpful, especially the exam review gss because they give you all the answers to the practice problems due before class. super nice and fair guy, take him if u can.", "rating": 5, "expected_grade": "A", "created": "2023-12-01T13:25:57.211374Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Mohan's exams are completely from her slideshows, and there's no conceptual application whatsoever. She expects us to know facts about biology rather than thinking about how this relates to real life. She's also very unforgiving, and borderline rude to the class and even her TAs. I always reach out to the TA when I have questions because they're super helpful, and make sure to utilize her weekly practice sets / TA review slides to help study for the exams.", "rating": 1, "expected_grade": "A-", "created": "2023-12-01T18:19:15.800199Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Threatening and unaccomodating in the slightest of situations. She gets mad about small stuff like a bit of quiet side chatter in the class even if it's related to what she's lecturing about. She expects all of us to sit there and memorize everything on the slideshow without actually applying anything to the real world. She's even worse over email because she hates slow-responders and will take it out on you by threatening with your grade", "rating": 1, "expected_grade": "B+", "created": "2023-12-02T03:43:26.818471Z"}, {"professor": "Reid Compton", "course": "BSCI170", "review": "This is a very hard class. He goes very fast over the slides during lecture, so if you want to actually undertand the material and take notes, you'll have to go over the lecture after every class (he does post them). The exams are extremely difficult. Even if you have all of the definitions or information from the slides memorized, it is still very hard to do well. The exam questions are often nothing like the practice review questions, and if you want to succeed you have to know everything in extreme detail as well as what types of questions he likes to ask and how he asks them. He is very available and responsive to email. There are also multiple online quizzes a week.", "rating": 2, "expected_grade": "B-", "created": "2023-12-08T15:54:28.571448Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "As the first major-related class that I had to take, I'd say that Professor Keller does a really good job of teaching us what we need to know. You can get a gist of the topics through the slideshows but the major points are super helpful when trying to get the small details of what you learning. He has weekly quizzes and has a lot of worksheets that are helpful to review before exams. Just to note, he's a silly little guy and I feel like he's super nice once you get to know him! Great professor for BSCI170 ! :)", "rating": 5, "expected_grade": "B+", "created": "2023-12-09T03:34:53.843774Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "I actually loved having Dr. Mohan. As long as you paid attention in class and took notes you could easily ace all the quizzes and problem sets. The exams were also pretty easy as long as you put in effort and studied the material. I feel like overall the course load was not too bad because all of your graded work is open notes besides the exams. She can be snappy sometimes but just like be respectful while she's going through her slides.", "rating": 4, "expected_grade": "A-", "created": "2023-12-09T20:05:36.088599Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I really enjoyed taking this class and Dr.Keller was definitely my favorite professor this semester (BSCI170). He only puts exam content from his lectures so the textbook content is only a re-enforcer. He explains content very well and in a very step by step manner. If you attend lectures and pay attention//take notes you will do good in the course. He also uses completion clicker questions to boost your grade as extra credit if you attend class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T16:06:32.956893Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "I actually really like her. You can learn all the stuff the day before the exam if you really needed to. Her exams are more than fair and pull directly from problem sets and weekly quizzes. She has tons of cushion points (weekly quizzes, participation clicker points, problem sets, syllabus quiz... like 250 easy A points) and no curve. She's a clear teacher and doesn't try to trick you. This class probably took up 4 hours of my week in total (including lecture, which is 3 hours a week!) and I'll end with an A.", "rating": 5, "expected_grade": "A", "created": "2023-12-14T22:25:27.908080Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I really like this professor, he was sometimes passive aggressive but otherwise did a good job at explaining the content, and between ta's / gss / his office hours there was a lot of opportunities for extra help. Exams were always pretty fair and not too hard, the study guides tell you pretty much exactly what would be on it, so definitely had to study a lot but then they wouldn't be too hard. He also posts major points for every lecture which helps if you didn't understand any points on the slides. There's a good amount of extra credit in the form of just participation in class, you can get 20 points maximum and the whole class is out of 700, so almost 3% extra. Worksheets also helped a lot with understanding the concepts, so overall it was a pretty good class and not too difficult given that I'd never taken any biology before this.", "rating": 5, "expected_grade": "A-", "created": "2023-12-17T23:19:41.591187Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "He's a really nice professor and he does seem to genuinely care about his students. You can get an extra 20 points just by doing the extra credit clicker questions. Exams are based only on lecture content, I never read the textbook and have been doing fairly well. He drops 5 of the lowest worksheet assignments (there's only 10) and other than that there was just the weekly quizzes and the practice questions before each exam. I found a lot of the content and his teaching/explanation style to be difficult to understand - maybe people who are in STEM majors have an easier time understanding him - but he's always willing to help and there also GSS sessions that can be helpful. This was definitely the class I had to study hardest for when it came to my exams, but it's not bad if you're willing to put in the effort.", "rating": 4, "expected_grade": "A-", "created": "2023-12-17T23:29:09.788989Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Exams are a breeze if you look at the study guides. They never covered anything he didn't talk about during the lecture. Always summarized his lectures online with his main points.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T02:30:44.736837Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller was an engaging lecturer and provided a lot of materials to help students do well in the course including slides, summaries of every lecture, study guides, related book chapters (not required reading), and helpful worksheets. He was also always happy to help students outside of class and was accommodating to legitimate excuses for needing extensions or rescheduling exams. I enjoyed his teaching style overall, but I am a stem major (though I’ve never taken any bio other than ecology) so I can see how this course could be hard to follow for non-stem students. I also thought his exams were straightforward and generally included topics on the study guide and questions similar to the quizzes and practice questions. Exams are worth a lot of points though.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T03:42:58.219723Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Man do I not like his teaching style, gosh. He says at the beginning of the semester that you don't need to have any chemistry background, but a lot of the concepts that he teaches relies on understanding some chemistry concepts and I had a friend who struggled so bad with these concepts because she just could not rationalize this info, but if you're taking this class alongside orgo 1 you'll be great! You will have 4 exams but none are dropped. The first exam is a mini exam that should be relatively easy if you already have previous knowledge in the topics. The rest is your doom and you need to buckle up for an un-joyful ride. Exams are fair tho I just didn't think his style of teaching was made for me. He would post the slides and an additional word doc that would highlight the most important concepts, but he doesn't record lecture and a lot of the things he says during class is very important and may pop up on an exam. Obviously he is the better option out of the other bsci170 professors but don't think you won't need to put the work in because he's the \"easy\" professor. He drops 5 out of 10 wks and that helps a little but those quizzes will catch up to you and will dock your grade since he drops none and you will need to do well on them. But if I were to say one good thing about him, he adequately presents information valuable for the exams. The final tho? please don't stress out trying to learn every single thing, because he will not give you a study guide or anything to work with. But instead go over the areas you are not comfortable with like at all, that's better than nothing I promise.", "rating": 3, "expected_grade": "B", "created": "2023-12-22T03:36:22.413351Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Good professor but the class and concepts are difficult to understand unless you already have a background in biology. A lot of the course is weighted on the exams and they aren't weighted but overall he was a great professor.", "rating": 4, "expected_grade": "B", "created": "2023-12-22T19:38:47.375355Z"}, {"professor": "Reid Compton", "course": "BSCI170", "review": "the exams are never like the material or practice exams. he doesn’t actually explain any of the concepts and just reads straight off the slide show. rambunculous", "rating": 3, "expected_grade": "B-", "created": "2023-12-23T02:11:29.131732Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I thought Dr. Keller was an amazing professor! Pay attention in class, study the worksheets, and study the main points he puts out for each lecture. He literally summarizes the main points from each lecture, puts together a study guide for each test, and the worksheets are given so that we actually UNDERSTAND the concepts not just busy work. I went to GSS a couple times before exams and they were very helpful as well. Would definitely recommend Dr. Keller", "rating": 5, "expected_grade": "A+", "created": "2023-12-24T16:23:13.722932Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller himself is nice and approachable, but I really struggled with the exam formats in this class. His exams are often fill in the blank, matching, short answer, labeling pictures, etc. This mixed with his monotonous lecturing really messed with me and my grade. I would recommend taking good notes and attending GSS when you can.", "rating": 4, "expected_grade": "B-", "created": "2023-12-26T03:53:17.029843Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Good professor, he provides an outline for his exams almost question to question. He does provide a good amount of extra credit. His final exam is almost the same as all of his midterms jsut combined and slightly modified. While i wouldnt want to talk to him one on one, he is still good for lectures. He makes the terms easy and a lot of the stuff he says in person and not on the slides are the exact answers for mid terms. Defniletly dont look at just the slides make sure to listen to him. His homeworks were easy, some of the TA's were questionable with their grading.  His weekly quizes are easy and often times will help you study for mid terms. His practice questions for the midterms and finals are helpful, a lot of the times the same exact questions on the practice questions were on the exams. I think that if you like studying on the notes you write personally, then this professor is for you. His lectures are not recorded btw.", "rating": 5, "expected_grade": "A-", "created": "2024-01-09T16:57:59.493970Z"}, {"professor": "Niranjana Krishnan", "course": "BSCI170", "review": "If I could give this class zero stars, I would. I HIGHLY RECOMMENDED NOT TAKING THIS PROFESSOR. Take Keller, or anyone else. FIRST EXAM IS STRAIGHT ORGANIC CHEMISRTY, SO IF YOU DONT KNOW THAT, THEN YOUR COOKED. She gave the worksheets out and expected you to finish them in 30 minutes while another professional let you take them home. WOULDN'T RECOMMEND HER, EVEN FOR WORSE EMENY", "rating": 1, "expected_grade": "W", "created": "2024-02-29T03:53:12.235321Z"}, {"professor": "Niranjana Krishnan", "course": "BSCI170", "review": "DO NOT TAKE THIS CLASS WITH HER! Seriously, she should be a last resort. She is super unfriendly and unhelpful. I went into this class expecting to do fairly well as it is supposed to be an introductory class, but she treats it like it is a graduate class. There is no review before exams and no resources to help you study other than reviewing her powerpoints which are super long and complicated. She moves incredibly fast through topics and gives the bare minimum explanation. She expects you to come in already knowing the material. If you can, choose any other professor for this class. This has been the worst experience with I professor I have ever had.", "rating": 1, "expected_grade": "C", "created": "2024-03-01T01:32:05.118987Z"}, {"professor": "Niranjana Krishnan", "course": "BSCI170", "review": "AWFUL AWFUL AWFUL. She is extremely unfriendly and unwilling to help. The class is supposed to be introductory but is treated like a graduate class. You have to have a knowledgeable background in chemistry to even begin to do well in this class. There is no review or study materials before exams. Any other professor would be better than her for this class. Worst experience I have ever had with a professor.", "rating": 1, "expected_grade": "C", "created": "2024-03-01T01:35:49.595634Z"}, {"professor": "Niranjana Krishnan", "course": "BSCI170", "review": "Dr. Krishnan's classes are engaging, she spends adequate time explaining concepts, asks a lot of questions to gauge student understanding, and records her lectures. She is easy to approach. Worksheet was tough and there is quite a bit of chemistry, but the exams had the same questions. During lectures, she also tells what to study and what won't be asked in exams.", "rating": 5, "expected_grade": "A", "created": "2024-03-03T04:23:53.305123Z"}, {"professor": "Niranjana Krishnan", "course": "BSCI170", "review": "Professor and class are not too bad. Professor tries to ensure students understand topics. Is very friendly/approachable. Answers emails quickly. The first exam was not too hard. Hope there was study guide or prior practice exams but Prof. Krishnan is teaching class for the first time.", "rating": 4, "expected_grade": "B", "created": "2024-03-03T05:32:54.984545Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "His exams were based on the slides, clicker questions, and practice problems. He is a great lecturer, summarizes his main points, and condenses them, which is nice. He honestly gives you all the tools to succeed.", "rating": 5, "expected_grade": "A+", "created": "2024-03-25T17:45:34.491636Z"}], "department": "BSCI", "course_number": "170", "name": "BSCI170", "title": "Principles of Molecular & Cellular Biology", "credits": 3, "description": "<b>Prerequisite:</b> Must have math eligibility of MATH120 or higher.\n<b>Recommended:</b> For Science majors.\n<b>Credit only granted for:</b> BSCI105 or BSCI170.\n<b>Formerly:</b> BSCI105.\nBasic principles of biology with special emphasis on cellular and molecular biology.\n<i>(Sponsoring Dept.: BSCI).</i>", "is_recent": true, "geneds": null}