{"average_gpa": 3.084989858012171, "professors": ["David McCandlish", "Eric Wish", "Amy Billing", "David McCandlish", "Eric Wish", "Amy Billing", "Eric Wish", "Amy Billing", "Eric Wish"], "reviews": [{"professor": "Sam Borbiev", "course": "BSOS201", "review": "Very knowledgeable TA and responded fast on GroupMe and email. Office hours were helpful before the midterm and the final project. Strongly recommend. ", "rating": 5, "expected_grade": "A+", "created": "2021-01-27T20:44:02Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "Unless you are already interested in stocks, do not take this class. If you are already interested in stocks, do not take this class either. The work is tedious and the grading is abysmal. You cannot see your average grade for the entire semester at all. All assignments (Excluding the midterm and final report) for this semester have added up to be roughly 375 points. The midterm and final are worth about 330 points. This class is not worth the stress. ", "rating": 1, "expected_grade": "", "created": "2021-12-08T21:11:11Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "Doesn't grade anything and the grading system he has set up is awful, you can't even see the final grade and his teaching style sucks. You are basically teaching yourself and the workload is awful for this class. not that great don't take it for a gen ed too much work.", "rating": 2, "expected_grade": "", "created": "2021-12-13T02:26:35Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "This class is definitely not for everyone but for people who are genuinely interested in learning about stocks and other financial tools, I would highly recommend. I knew nothing going in and I learned so much. This class is long, the lectures can get super boring, and there is a lot of reading during the first half of the semester, but if you just suffer through it I think it is worth it in the end. Even if you do poorly on the weekly quizzes, most of your grade depends on your final report. The grading system is super weird where he won't give you a cumulative grade until the end of the semester but most people end up with an A or A+. If you are willing to put in the time, this class is really useful. ", "rating": 4, "expected_grade": "A+", "created": "2021-12-27T18:52:37Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "Dr. Wish is a great teacher. He's nice, but the workload is insane. There is an 8-week trading simulation with insane trading rules (you need to be 90% invested, you can only follow certain rules, you cannot purchase meme stocks, etc). After the 8 weeks, you do a final report on what you did. To be honest, I did not follow most of the rules and I wrote that on my final report. He says to be honest in your report, and I did. I surprisingly came out with an A after getting a C on my midterm and doing decent on my quizzes.\r\nI genuinely don't know how I got an A.\r\nIf you want to take the class to learn about stocks, I learned a bit. You should do your own research if you really want to get into the stock market. Everyone is talking about grades, but to be honest just don't lie on your final report, put in a bunch of stuff you learned, and your grade will flip to be on the bright side. If you're not going to pay attention, expect a poor grade. I understood 50% of what he taught and managed to get a good grade.", "rating": 4, "expected_grade": "A", "created": "2022-01-05T04:01:57Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "DO NOT TAKE. I am writing for about 50 other students when I say this class is not a first year class. The workload is more than you have ever seen and half the stuff Wish talks about is mad outdated. You will most likely get an A or B, but this class was horrible and I would never take it again.", "rating": 1, "expected_grade": "", "created": "2022-02-22T16:16:50Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "I took this class a few years ago and have been a Teacher's Assistant for it ever since. Do not be scared off by some of the recent negative reviews. The fact is that this class isn't for everyone, but if you are interested in the topics then it will be the best class you'll take at UMD (it has been for me). The first half of the semester is intense and requires reading a few books. There are weekly quizzes used to encourage you to stay on track but they aren't weighted high for the overall grade. I hate to read and stress about quizzes, but being interested in the topics makes it pretty enjoyable and the quizzes aren't too bad. \r\n\r\nPeople complain about the workload during the start of the class, but it's really not that bad and only having class once a week means you can space out the work. It is by no means easy for the first part of the class, but if you manage your time then it's fine. After the midterm, the weekly quizzes stop and the class goes into cruise control basically. You'll be in a virtual trading competition that you'll need to monitor every few days, but if you put in the work during the start of the class it is pretty easy. \r\n\r\nThe final project makes up a very high percentage of your grade. If you pay attention the whole year, the project shouldn't be bad at all. It takes a lot of time and detail to put together, so you'll need to give yourself a lot of time to do it. But in terms of difficulty, it isn't too hard at all (if you pay attention and try throughout the semester). The way the grades work, you won't have access to your grade on elms throughout the semester. They do this because your grades are calculated using excel and it makes it easier to play with the final weighting and stuff. If the grade was visible in elms throughout the semester, it might give students a false sense of their performance in the class. If you want to know your general grade and how your doing, you can just go to the virtual office hours and ask a Teacher's Assistant. Dr. Wish usually says that almost no students ever fail his class.\r\n\r\nYou'll also see some people complaining about technical analysis in these reviews. Even if you never plan to use technical analysis or Dr. Wish's trading strategies, this class is till very valuable. You'll learn all the financial terminology and how to properly save for retirement. This class prepares you for the real world and gives you so much more confidence in setting up your future.", "rating": 5, "expected_grade": "A+", "created": "2022-05-04T06:48:23Z"}, {"professor": "David McCandlish", "course": "BSOS201", "review": "SUPER genuine and nice. Very accommodating and knowledgeable. He Co-teaches with Dr. Wish and does a great job making the class run.  ", "rating": 5, "expected_grade": "", "created": "2022-05-04T06:53:00Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "This class isn't as bad as people make it seem, I learned some pretty fundamental knowledge about the stock market and personally i didn't spend more than 2 hours a week on this class. The grading is a bit weird as I didn't know my final grade really until it was put in but he literally tells you what to do to get an A so theres really no surprise there. You can take a look at the grade distribution as well, majority of people get an A as long as you follow instructions. Last note* This course is very final heavy, your final basically determines if you pass or fail this class so keep that in mind.", "rating": 4, "expected_grade": "A", "created": "2022-05-11T15:50:51Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "Do not take this class. I have spent hours studying algorithms that do not work. Dr. Wish rambles for half the class, and you will do better by randomly choosing stocks than using this course as trading reference. Also this class is a miserable slog of 3 hours. Do not take this class if you wish to learn about the stock market. I wouldn't wish this course upon my worst enemy.", "rating": 1, "expected_grade": "A", "created": "2022-12-02T21:11:51.103164Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "TLDR: do NOT take unless you really really love the stock market, otherwise it's painful busywork where you don't learn much. This is also NOT a class about financial literacy.\r\n\r\nI took this class because I thought I would learn how stocks work, what can make them move up or down, and some general knowledge on how to manage my money. I got none of that. I still have no idea what makes a stock move up or down other than \"uhhh someone out there thinks this company is good maybe\". And we learned one and only one thing about financial literacy, which I'll tell you right now: get a Roth IRA, it's better than a traditional IRA.\r\nThe first half of the class was learning the alien language of Technical Analysis. From everyone I've talked to outside this class who knows what they're doing, TA is considered absolute garbage. You'll learn about \"indicators\" for the stock movement that are pretty much arbitrary and often even contradict each other (e.g. MACD histogram and stochastics have a strong correlation, but tell you opposite things). Of course, when you put these into practice, stocks turn out to be largely random noise. I'd go on here, but I'm no expert in the stock market, and others can say this better (including some of the reviews here, especially that one really long one). At roughly the halfway point of the course, you'll take a big midterm. That was fairly standard, but it took me way longer than I was expecting.\r\nThe second half is a trading simulation where you get $100,000 in fake money and have to invest it. I ended up with a ~1.7% profit, in a pretty bad market. This is a cute idea on paper, but in reality it just creates a ton of extra work and eats up your free time, including thanksgiving break. It's also really restrictive; the idea is to trade for yourself to see what it's like, but every stock you buy has to follow some strict rules (which I didn't even realize I broke multiple times), and every stock needs a \"setup\", which is even more restrictive. You're supposed to learn about trading from the simulation, but all I learned was that stocks are mostly random noise. You have to trade quite a bit, and the final has you analyzing every single trade you made. It's just tedious for no reason. The one thing I will give to him is that he's clear about grading. He tells you pretty much exactly what you need to do to get an A, meaning you don't have to think much... so it's not only busywork but MINDLESS busywork!! Also the final paper is worth 65% of your grade which is just horrendous.\r\nOther notes: the gender ratio is really bad. Like, CS class bad. There are 10 TAs and 2 professors and none of them know me. The classroom is huge, and you can clearly see more and more empty chairs as the class goes on. In the first week or so, he'll go the entire way through the 3 hours with no break to scare people off, but after that he'll typically have a 10 minute break in the middle-- which is still nowhere near enough to sit through a 3 hour lecture. If you get top 10 or bottom 10 in the simulation he'll make you talk in front of the class, so maybe don't do that. Or just don't take the class in the first place.", "rating": 1, "expected_grade": "B+", "created": "2022-12-04T18:15:27.259590Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "This class will be very difficult if you have no prior knowledge or interest in the stock market. If you do, you might be fine. But, if you do not have a burning passion for stocks I would avoid this class like the plague. Within the first few weeks we were assigned multiple books to have read. The course grading itself is not that difficult, but it is a lot very quickly. In addition, the final is worth most of your grade. For a Gen ED course, I would not take this.", "rating": 2, "expected_grade": "B", "created": "2022-12-06T04:12:41.360436Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "Dr. Wish is a nice enough guy, but this class is absolute torture.  I took this class to learn more about stocks, and while I feel as though I did learn some bit of information, I am also more confused than I was initially.  If this class was split up into shorter sections over multiple days in a week I feel as though myself and many of my classmates would've been able to focus on this class much better.  Even pounding cups of coffee did not help me stay engaged and zoned-in to the lecture.  If you are super into stocks and the stock market, go ahead and try this class, but I definitely wouldn't just take it for the gen-ed, as insane amounts of work and a 3 hour lecture each week simply aren't worth it.", "rating": 2, "expected_grade": "", "created": "2022-12-07T18:39:48.718799Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "I would not recomend this class unless you are very interested in the stock market. It is not an easy Gen Ed! as I thought it was. The 3 hour lectures are way to long and Dr wish will finish his slide in the first 1.5 hours and just ramble on for the last half of the class. It requires you to read 3 books in full and the final is a 25 page paper that for me was over 5000 words long. The setups he teaches are useful except that they are not taught very well so he briefly goes over them and expects us to understand them in full.  The TAs are very helpful but that still does not make this an easy class. But if you are really interested in the stock market this might be the class for you but if you are not do not take this class.", "rating": 2, "expected_grade": "B+", "created": "2022-12-09T16:46:28.265115Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "Please spare yourself from this class. It's a 3 hour lecture which is impossible to sit through, and you have to commit to doing crazy amounts of work. If you don't already know how the stock market works, you won't learn it here, so your energy is better spent somewhere else. I do believe that Dr. Wish is a knowledgeable guy, but he doesn't do a good job at transferring that knowledge to his students. He has been pretty harsh to people that don't understand his expectations. This class is my biggest regret of the semester and I should've dropped it after the first week. Good luck to anyone in it.", "rating": 1, "expected_grade": "B-", "created": "2022-12-09T17:42:42.524775Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "This will be a long review so for sake of time here's the tl;dr:\r\nThis course is only enjoyable if you have interest in stock trading prior to this course and may serve as a catalyst to further that interest. The course itself is not quite fun nor teaches much content and may be difficult to achieve a high grade in.\r\n\r\nOnwards to the full review!\r\nBecause of the sheer conflicting amts of 1 and 5 star ratings I'll be going very very indepth here and review in form of Q&A. Read other reviews before this one. Simply put they're both right\r\n\r\nQ: Is the workload for this course actually bad? Who is right?\r\nA: The ones who say it's crazy are right to an extent. Those saying it's not bad are flat out lying for the first few weeks. Some of your first quizzes have assigned readings of 50-200 pages and like 30 minutes of videos in addition to lecture content. Luckily you can get away with a B or A on these quizzes through good use of cntrl F, google, and youtube video -> transcript conversions. However the fact that you're expected to dedicate this amount of work initially? Crazy. Luckily these quizzes fall off in difficulty over time and halfway through the course cease to exist, from which case effort is smooth sailing until your final paper. You have a trading simulation instead which you are supposed to actively manage, but if you plan it out and know in advance what you need to do you can realistically only put in effort trading a few stocks and still be fine by the end. The two week add drop will expose you to these quizzes, so if you think they're manageable then this course is easy from then on.\r\n\r\nQ: Are the 3 hour lectures bad? Is it impossible to set through?\r\nA: Nah but man does this class not need to be 3 hours. The first hour might be taken up by relatively slow review over quizzes, some what rambly analysis of new market events, or other things. Simply put it's not very organized and the content could be easily delivered in 2 hours or less. The end of this course has frequent guest speakers as there is no more content in this course left, so while this might be a pro or con I found some of these speakers quite boring. Impossible to sit through? Certainly not, but lecture 100% does not need to be 3 hours. They're all recorded and you can totally skip so you can play them back at 2x speed. (My recommendation)\r\n\r\nQ: Is the class content actually useful? Is TA astrology?\r\nA: Yes-ish, Yes-ish. If you have 0 financial background or 0 stock backgrounds then this course will intro you to some basic ideas that can be useful as a catalyst for your own further personal research. If you have previous experience not much in this course will be new info for you. Despite being 14 weeks long surprisingly little content is discussed in the 3 hour lectures. I personally am not a fan of TA and thus didn't take away much from the course itself, but having to work with stocks and research so often catalyzed my own interest and passion which I think was a net plus. Thus the course itself? Not very useful, but for newbies it can be an ok launchpad.\r\n\r\nQ: General biggest cons?\r\nA: Dr. Wish makes TA sound like the second coming of christ. In reality TA is a mixed bag that doesn't have crazy proved performance. Don't get trapped by this and make sure to do your own personal research for alternative trading methods. \r\nA: Grades are LOCKED and you cannot view your own grade in calculus and thus have to do the math for it or beg a TA to view it. Annoying as all hell and frankly am not sure why they do this. \r\nA: Trading simulation has assigned busywork (and quizzes). In reality you will learn what you can skimp and not do and get away with to have a more manageable schedule, but before that workload is high.\r\nA: Grading is brutal, but there always are rubrics. Despite this you can feel like you followed the rubric and still lose points because different TA's are very different in grading style and rigor. Go to office hours and complain your case and you just might get points back on certain assignments (When applicable, most things you cannot change your grade like this. Realistically only one assignment you can) \r\n\r\nAnd to end it off on a positive note here's why despite all that I give it a 4 stars. It's just a good way to immerse yourself in stocks and to socialize with other people who are interested. The actual class itself? Mid. The experience? Good.  If you actually want to learn deep thoughtful content on stocks, learn it yourself and you will learn it better and faster. This class however introduced me to some great people and just sparked my interest so I'm biased with personal experiences to like it. I think in reality though the haters are right and this class is outdated and badly organized. \r\nThis class is certainly not the easiest A, nor may it be enjoyable for some of you. My advice is take it and drop by the 2 week add-drop if need be.", "rating": 4, "expected_grade": "A-", "created": "2022-12-15T08:32:38.016573Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "This course is definitely a learning experience. If you have experience and/or interest in stock trading prior to the class, this course is for you. For me, coming in I did not know anything about managing a stock portfolio, however, I learned very fast in this course. This course is like a crash course to stocks, bonds, retirement, and everything in between. This class is very enjoyable if you love learning about stocks, however, the lectures sometimes tend to be long and boring. Most people in the class had a cup of coffee or something to keep them awake throughout the lecture.\r\nIn terms of the workload, the beginning of the semester was not horrible, however, you need to read A LOTTT. You will read on average about 6 chapters of the several textbooks in a week. After the readings and small quizzes at the beginning of the semester, you will jump into stock trading. First, you have to get approval and this will be addressed in the class. However, you want to get approved to trade quickly and please please talk to the TAs if you have any questions EVER in the class. They were very helpful throughout the course, and they are willing to work with you. \r\nIn terms of Dr. Wish, he is an amazing professor. The guy definitely knows what he is talking about. Also, don’t be afraid to go up to him and ask a question. Dr. Wish makes class interesting if you are willing to listen to him. He is like a pastor, he preaches the content to you, and your job is to listen. \r\nLast, the grades are closed, so try not to worry about your grades, as they will be good if you try your best. Good luck!", "rating": 3, "expected_grade": "A-", "created": "2022-12-18T19:44:56.071281Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "Interesting professor, you can tell he’s very passionate ab the content but the content itself is just boring. Unless you’re really into stocks like which I was only remotely interested in, you probably shouldn’t take this course. I only showed up for the first two lectures out of the entire semester because I lost interest. Expected a B because of this but somehow wound up with an A even though I forgot to take a 40pt quiz, didnt do any of the readings, and rushed the final report in 3hrs. All the content is online including the recorded lectures so there’s really no point in sitting for an entire 3hr lecture every week. \r\n\r\nAll in all, boring content, a lot of busy work, I put in no effort but some how came out with an A, would be very cautious in choosing this course.", "rating": 3, "expected_grade": "B", "created": "2022-12-26T08:56:35.329286Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "I would not recommend anyone who doesn't have a REAL interest in the stock market to take this class. I went to every 3 Hour class and it felt like a waste of time. Dr. Wish also makes it extremely difficult to ask questions during lectures. He has a way of making you feel stupid for asking a clarifying question(Oh and don't let him call on you if you don't know what going on). Then he will complain about how the class doesn't ever ask questions... Also. hearing DR. Wish go over the same slide for a 1hr and a half really takes its toll after a while. Second, the amount of work needed in this course is way too much. The quizzes every week, trying to remember the weekly survey that continues to happen after the final, trying to learn about each fundamental and technical setups ( which I might add are not easy to search for online or go by different names when you try to look it up.), keeping up with stocks/ having to stay 90% invested during the stock game, and worse of all the 23-25 page final. Having other classes I needed to study for and then having to do this final a week before finals week was absolute HELL. I also think my final scores in my other classes took a hit because I was unable to fully study for them because of this class. Third, the overall fact that you cant check your class grade tops the cake. It is December 28 and I still have no clue what my actual grade will be - The expected grade on this post is what I got on my final.", "rating": 2, "expected_grade": "A", "created": "2022-12-28T18:16:17.098341Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "He provides a comprehensive overview of his trading style, but does not delve into other styles. He also doesn’t talk about crypto at all. However, we did have guest lecturers who came in and talked other different strategies for trading. Classes were very long (3 hrs). He’s also kind of anal retentive about grading and it takes a lot of time to fill in charts for each stock the way that he wants you to. He expects a large time commitment.", "rating": 3, "expected_grade": "A", "created": "2023-04-29T13:57:58.864586Z"}, {"professor": "Amy Billing", "course": "BSOS201", "review": "She's good.", "rating": 5, "expected_grade": "A+", "created": "2023-08-10T18:16:33.495976Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "if u are not interested in stocks, DO NOT TAKE THIS COURSE. IF U THINK U ARE INTERESTED, U ARE NOT. also everything about this class is literally fake. like none of it is real because the things u learn will only help you if the market is in a uptrend and in a up trending market EVERY ONE DOES WELL.", "rating": 1, "expected_grade": "B", "created": "2023-12-19T19:54:46.671912Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "honestly, if you're not terribly passionate about investing, i wouldn't recommend this course. dr. wish is a cool guy with a lot of fun stories to tell, and i enjoyed the lectures that i attended (besides that fact that they were 3 hours long and my attention span prevented me from really coming away with much). however, grades are hidden for the entire course and its honestly awfully stressful. if you put in the work its definitely not a difficult A, but it might be needlessly stressing for a gen ed that you can probably take easier classes to fulfill.", "rating": 2, "expected_grade": "A", "created": "2024-01-04T07:30:35.408627Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "If you're at all interested in the stock market, investing, or making money, take this class. *Be aware* this class is not just foundational concepts. Dr. Wish dives right into the thick of it and will teach you EVERYTHING. Most useful class I have ever taken. You will learn very valuable life skills. Go to his classes (especially in the beginning and whenever there's a quest speaker) and you'll succeed. \r\n4/5 stars because the TAs grade a little harsh.", "rating": 4, "expected_grade": "A", "created": "2024-01-07T20:52:38.951431Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "1. This course is a lot of work only for the first 6 weeks. Then one or two assignments between the midterm and final. Final is long, but not as painful as the other reviews make it seem. \r\n2. For the first 6 weeks, you learn stock material and he assigns reading, but you can lowkey not read. For the weekly quizzes, you can google majority of them and work with friends (take it outside of class). \r\n3. For the midterm, it is open note and you can do it with friends, but it is long and will most likely take the full 3 hours. (also done outside of class - can work with friends).\r\n4. Stock trading portion - second half of semester. Lowkey pretty light, if you are top 5, just say your strategy and that it worked. \r\n5. Dr. Wish assignments HELP you for the final paper, do NOT BS them. \r\n6. Final paper - long but kinda easy tbh. He gives an example, literally copy the format and you'll get an A. \r\n7. Dr. Wish is a nice guy and helpful, his TAs are knowledgable and class if easy if you put in the effort. \r\n\r\ntldr;\r\nThe course is intense for the first 6 weeks, but assignments ease up later. Initial weeks involve stock material and reading, but quizzes can be googled and done with friends. Midterm is long but open note, and stock trading section is light. Dr. Wish's assignments are crucial for the final paper; copying the provided format guarantees success. Dr. Wish and TAs are helpful, and the class is manageable with effort.", "rating": 4, "expected_grade": "A+", "created": "2024-01-18T04:28:01.569144Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "This is an awesome course, honestly my favorite so far. I let my grade slip early, make sure to do all the quizzes and reviews, its worth it. After that though most of the grade revolves around trading and keeping a record of your trades in order to make transaction reports and give reports. The majority of the grade in the class is going to be based on these reports, so try to attend lectures as often as you can. \r\nThe class is incredibly useful, I've been trading profitably on my own after the class and I 100% learned how from Dr. Wish. As a side note, he's a great lecturer and a great person, do your best to show up.", "rating": 5, "expected_grade": "A", "created": "2024-02-02T15:37:58.113303Z"}, {"professor": "Eric Wish", "course": "BSOS201", "review": "Dr Wish is a super knowledgeable person who is passionate about his teachings. I can confidently say that I have a firm grasp of technical analysis and the stock market after finishing this course. If you're not interested in the stock market and are just taking the class for the gened credits, you'll have a very hard time. Otherwise, would definitely recommend.", "rating": 5, "expected_grade": "A", "created": "2024-03-10T00:25:23.301036Z"}], "department": "BSOS", "course_number": "201", "name": "BSOS201", "title": "Ensuring your Financial Future Through Stock Investing", "credits": 3, "description": "<b>Credit only granted for:</b> BSOS289I or BSOS201.\n<b>Formerly:</b> BSOS289I.\n<b>Additional information:</b> No prior knowledge of the stock market or investing is expected or required.\nIntroduces students to investing and trading, with special emphasis on the field of technical analysis.  Planning for one's financial future is a critical skill for all students. Students will learn how to evaluate companies using the investors.com website and the TC2000 stock charting program.  Students will develop an idea of the risks and benefits of investing, establishing a savings strategy, opening an IRA, and strategically planning for future financial security.  In addition to readings, lectures,  and online videos, students will participate in virtual stock market trading exercises and manage a virtual account.", "is_recent": true, "geneds": null}