{"average_gpa": 3.6493877551020413, "professors": ["Peter Weinberger", "Thomas Guarrieri", "Samuel Henkin", "Amy Pate", "Amy Pate", "Amy Pate"], "reviews": [{"professor": "Samuel Henkin", "course": "BSST335", "review": "Expecting a B. \r\n\r\nProfessor Henkin's BSST 335 class offers a unique insight into what drives people to adopt extremist ideologies. He is extremely approachable, always willing to talk to students and most importantly is VERY passionate about this subject. Lastly, you walk out of this class feeling like you can help a fellow citizen from going down the wrong path. This class is highly applicable to everyday life. \r\nThere are some assignments that require a lot of effort and can be stressful but that comes with an upper level course. \r\n\r\nCould not recommend the course more!", "rating": 5, "expected_grade": "B", "created": "2021-12-18T15:08:28Z"}, {"professor": "Amy Pate", "course": "BSST335", "review": "Absolutely loved this class. Professor Pate is a great lecturer, is very passionate and knowledgeable about the subject, and her seminar-based class was very informative. She clearly cared about each of her students and made sure that they understood each topic we covered. After the midterm, the class shifts into group work for the final project and we are walked through each aspect of the final project and then given inclass time to work with our groups. Would most definitely take another class with Professor Pate.", "rating": 5, "expected_grade": "A+", "created": "2023-12-28T18:51:41.125985Z"}], "department": "BSST", "course_number": "335", "name": "BSST335", "title": "Innovations in Countering Violent Extremism", "credits": 3, "description": "<b>Credit only granted for:</b> BSST335 or BSST338V.\n<b>Formerly:</b> BSST338V.\n<b>Additional information:</b> It is recommended that BSST335 be taken after, or concurrent with, BSST330.\nIntroduces students to novel innovations in the development of Countering Violent Extremism (CVE) programs. CVE is a realm of policy, programs, and interventions designed to prevent individuals from engaging in violence associated with radical political, social, cultural, and/or religious ideologies. Unlike counterterrorism strategies that often focus on targeting and disrupting terrorist plots, CVE focuses on radicalization prevention through engagement and intervention with communities. CVE also focuses on deradicalization and rehabilitation of former extremists. Throughout the course, students will work in groups to develop their own innovative CVE programs, rather than merely learn about CVE through lectures.\n<i>Restricted to Global Terrorism Minor students (#BS07).</i>", "is_recent": true, "geneds": null}