{"average_gpa": 3.106329113924051, "professors": ["Thomas Alexander", "Christine White", "Margaret Hardy", "Kimberly Mehlman-Orozco", "Maria Velez", "Robin Shusko", "Brooklynn Hitchens", "Brooklynn Hitchens", "Brooklynn Hitchens", "Richard Harris", "Maria Velez", "Richard Harris", "Demar Lewis", "Brooklynn Hitchens", "Demar Lewis", "Richard Harris"], "reviews": [{"professor": "Brooklynn Hitchens", "course": "CCJS370", "review": "The class subject is interesting but the Professor talks super fast and very quickly goes over material. Tests are theory and application-based and one of the most difficult styles of tests Ive taken. Seriously felt like a grad school class.", "rating": 2, "expected_grade": "", "created": "2021-12-22T00:05:56Z"}, {"professor": "Brooklynn Hitchens", "course": "CCJS370", "review": "Class is one of the most interesting classes I've taken at UMD. But the final paper and the final exam are worth 50% of your grade. She also deleted the class before she put in the final grade which is annoying", "rating": 3, "expected_grade": "", "created": "2022-12-20T23:24:33.116676Z"}, {"professor": "Maria Velez", "course": "CCJS370", "review": "She’s a kind professor and wants to help out her students BUT there is a lot of readings that you have to memorize for the exams which the first two are non cumulative but the final is. Taking notes in this class is also very difficult. Don’t recommend this class to any of my friends.", "rating": 2, "expected_grade": "W", "created": "2023-05-17T00:01:03.500208Z"}, {"professor": "Maria Velez", "course": "CCJS370", "review": "Dr Velez is a good teacher because she genuinely cares about her student's learning and grades. The class is hard, and there's a lot of reading and the exams have very specific questions, but the material is interesting and really important if you want to go into the criminal justice field. I honestly think everyone should be required to take this class. There's also a paper that's worth 30% of your grade and I found it really confusing at first, but she'll review it for you as much as you want before it's due so you can get lots of feedback and if you work with her you can get a 100% on it. I did poorly on the exams (my fault tbh) but the A on the paper saved my grade because I continued to get feedback from her throughout.", "rating": 4, "expected_grade": "B", "created": "2023-05-19T14:48:33.956831Z"}, {"professor": "Maria Velez", "course": "CCJS370", "review": "Dr. Velez is a great professor and once you get a hold of the exam format (using the guide she gives you) its smooth sailing honestly. I struggled at first in 370 but it got so much easier so I took 418Q and 454 as well considering its the same format for the class. Paper is alright, she is really helpful if you ask. She does care about you and your success in the course, so not utilizing her would be your loss tbh.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T23:30:01.969519Z"}, {"professor": "Demar Lewis", "course": "CCJS370", "review": "This course was way more work than I was expecting with little to no instruction about the expectations. Also, do not take this class if you are expecting to talk about the criminal justice system or specific problems pertaining to race, because you won’t. For each class (so twice a week) there are readings, usually 2-3 that are around 30 pages. Often times, these readings are briefly mentioned in lecture, but you don’t need to read them to understand what he’s talking about. The entire class so far has been about realizing the social constructs in place in this world. Dr. Lewis is very nice and passionate about his work though which does help. \r\nThere is a group podcast assignment that is briefly explained and he does not give you any time to even find your group members in the class, which multiple classmates agree would have been helpful. There is also a paper to go with this. He neglects to mention when this assignment is due because it was only talked about one time. There was also criminological debates and the same thing applies to this as well: he expects you to find the instructions and does not give you time to meet your group members. Finally, there are in-class assignments, but he does not give you time in class to work on them. \r\nOverall, I would not recommend this class because we never talk about the criminal justice system directly and there is an overwhelming amount of work.", "rating": 2, "expected_grade": "A", "created": "2024-03-13T20:48:24.760736Z"}], "department": "CCJS", "course_number": "370", "name": "CCJS370", "title": "Race, Crime and Criminal Justice", "credits": 3, "description": "<b>Prerequisite:</b> CCJS100.\nRole and treatment of racial/ethnic minorities in the criminal justice system. Course will provide students with historical and theoretical framework for understanding this dynamic.", "is_recent": true, "geneds": null}