{"average_gpa": 3.162246455834242, "professors": ["Laure Brooks", "Alan Lehman", "Wendy Stickle", "Thomas Alexander", "Alan Lehman", "Laure Brooks", "Alan Lehman", "Laure Brooks", "Thomas Alexander", "Wendy Stickle", "Alan Lehman", "Laure Brooks", "Thomas Alexander", "Alan Lehman", "Alan Lehman", "Alan Lehman", "Laure Brooks", "Thomas Alexander", "Wendy Stickle", "Alan Lehman", "Brett Lacey", "Thomas Alexander", "Alan Lehman", "Brett Lacey", "Wendy Stickle"], "reviews": [{"professor": "Laure Brooks", "course": "CCJS300", "review": "I had Dr. Brooks for CCJS 300 and CCJS 340. She is one of the best professors I had here at UMD. Her teaching model should be a blueprint. Her tests contain no tricks. She tells you exactly what sections to go over in the book so you don't read the entire chapter. The rest of the test comes from the clear lecture notes that she presents. She's nice, straightforward, and she cares about her students. I highly recommend. ", "rating": 5, "expected_grade": "A+", "created": "2016-05-19T12:30:00Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "Dr. Brooks is amazing! She is one of the best professors I have had at UMD. Her class is very straightforward, and the exams require maybe 2 hours of studying if you attend lecture regularly. She offers extra credit and grades very fairly. I had her for 300 and 340 concurrently, and she was wonderful for both. ", "rating": 5, "expected_grade": "A+", "created": "2014-12-04T15:19:00Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "SO nice, straightforward, extra credit, exams are simple if you study", "rating": 5, "expected_grade": "A+", "created": "2011-12-20T16:41:00Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "Dr. Brooks is INCREDIBLE. I had the pleasure of taking two classes with her (CCJS340 and CCJS300) in one semester and I LOVED it. \n\r\nHer exams are very straightforward--they are based right off the notes and the few readings (if you wait until right before an exam to read the textbook, you'll be done within a few hours). \n\r\nFor CCJS300, there really isn't an excuse to not get an A. The computer assignments boost your grade significantly AND you can take them to her before she grades them to make sure it's correct.\n\r\nFor CCJS340, Dr. Brooks makes the material very easy to understand and gives the best notes! Also, there are 5 extra credit points you can get off the quizzes and another extra 5 points you can get from a ride-along.\n\r\nOverall, she is OUTSTANDING. I only wish she taught more CCJS classes!", "rating": 5, "expected_grade": "A", "created": "2011-05-15T15:25:00Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "Professor Brooks was GREAT!!\n\r\nShe gives like 10 extra credit quizzes which can be really helpful...They helped me get a B instead of a C...I missed the first 3 and after I realized we had them, I never missed another one because I never knew when they were coming, but knew I needed the extra grade boost!\n\r\nShe keeps the class interesting and fun, knows how to keep us engaged.  Her notes are very thorough and organized which helped me A LOT!  \n\r\nI'd take her class again if I had the opportunity", "rating": 5, "expected_grade": "C", "created": "2009-12-23T02:05:00Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "There is one thing she does that MAY at first annoy you, but TRUST ME on this, it will help A LOT. There are open-note quizzes during class (once a week, I think) that are short that REALLY help keep the knowledge fresh in your head, give you an easy padding on your grade, and force you to keep taking notes.\n\r\nThe way she structures her notes is also commendable because it makes it SO much easier to study later. She numbers and sub-headers everything. And each section is divided VERY clearly.\n\r\nAdditionally, she gives EXTREMELY helpful review sheets that give exact page ranges of reading that will be assessed on the exam from the book. This makes studying 200 times easier.\n\r\nThis way, you learn a lot and never feel pressured to over-study in case the teacher sneaks something onto the exam. She is very meticulous and specific about what you will be assessed on.\n\r\nOverall, she is very upbeat, has a great personality, covers the material very clearly and effectively, and makes it easy to pay attention and take good notes.", "rating": 5, "expected_grade": "A", "created": "2009-08-19T14:55:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "I completely agree with everyone else lol\r\nProfessor Lehman studies medicinal marijuana so he talks about it a lot and you will learn a lot about it in this course. The class material is pretty dry so he makes it a little more interesting.\r\nFor the SPSS assignments he outlines EXACTLY how to do them with detailed instructions on the assignment and sometimes he'll give you the answers in class. \r\nFor the exams it's very important to READ EVERYTHING in the assigned chapters, you should also go to class because we watch film clips and he'll talk about his research & some questions appear on exams.", "rating": 5, "expected_grade": "B", "created": "2013-05-06T10:10:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Honestly, everything the others have said about him is true. He can be a bit on the boring side some days, but considering the material he's teaching he does a good job of it not being boring EVERY day.\n\r\nFor the SPSS assignments, he writes on the packet he hands you EXACTLY where to click in the program, what kinds of graphs he wants, and how to interpret the data to get your answers. If you come to class, he even gives you the answers to some of the fill in the blank parts. \n\r\nThe exams are a bit tricky, as they're a random mash up of his lectures and stuff in the book. If you go to class and take notes on your laptop and then skim the chapters though before the exam you'll be fine.\n\r\nHe does talk about his work to decriminalize weed a LOT, but it's mostly done when it relates to the material. He also throws extra credit questions on the exam that you will only know the answers to if you go to class. (like about where he started his research or a state he is working with currently to find information)\n\r\nOverall, I'd take him over Dr. Brookes. She's a nice lady, but his tests are much easier and she never showed movies in class.", "rating": 5, "expected_grade": "A-", "created": "2012-11-28T21:37:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Class should be re-named \"POT101\" because he does his research on Medicinal Marijuana. \n\r\nJoking aside, he is a pretty cool guy/good professor. Very approachable. Dry material, but not too difficult. Every semester he sets aside a week to watch a movie. Grades are on 3 tests and SPSS computer assignments. I would highly suggest taking this course with him, ", "rating": 4, "expected_grade": "A-", "created": "2012-05-19T13:13:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Lehman is my new favorite professor.  He's a little quirky and obsessed with research about medical cannabis, but those are some of the reasons that we love him.\n\r\nHe tells it like it is, and makes research methods actually seem interesting.\n\r\nYour grade is made up of four homework assignments with SPSS (easy as pie!) and  exams.  Exams are easy -- just go to class, take notes, and read the book once.\n\r\nHe usually teaches for an hour instead of the hour 15 each class, so you always get out early.\n\r\nAfter dreading having to take Research Methods, Lehman made this the one class I looked forward to.", "rating": 5, "expected_grade": "A", "created": "2011-12-01T16:53:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Lehman is great! His exams and computer assignments are pretty easy. There is an attendance policy, so you have to go to class. Buy the textbook, but don't buy the computer assignment book. Overall he a great teacher, and I'd highly recommend taking him. ", "rating": 5, "expected_grade": "A", "created": "2011-05-18T17:01:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Professor Lehman is great. He talks about a lot of interesting subjects in class and tries to help out students as much as he can.  Very helpful during office hours and tells you what you need to fix on assignments. His exams are straightforward, and not difficult. A+ Professor in my book", "rating": 5, "expected_grade": "A", "created": "2010-11-10T22:11:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Dr Lehman is straightforward. His exams are the best, they are not tricky at all. You literally just have to learn his lecture notes and read the chapter once. The material is easy and he is a pretty cool professor. Lectures arent boring, and the homework (worth 25% of final grade) is super EASY. You could literally do it an hour before class.\n\r\nWould def recommend him if you want to get a good grade without trying too hard ;-)", "rating": 5, "expected_grade": "", "created": "2010-08-31T10:40:00Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "I had her for CCJS300 and CCJS340 and loved her! She makes her notes easy to follow and tells you which sections from the readings will be on exams. She makes an effort to get to know and help her students. I definitely recommend taking her class", "rating": 5, "expected_grade": "A+", "created": "2018-05-01T15:43:03Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Okay professor. The 100 question quizzes were a bit much. He always told us about stuff like a day before it was due which was annoying but I did take this online bc COVID. He’s not terrible but I probably wouldn’t take again. ", "rating": 3, "expected_grade": "A", "created": "2020-11-20T21:33:02Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "Dr. Brooks is one of the best professors I've had! She is very organized and this is the second semester I'm taking one of her classes. She posts all the lectures for an exam ahead of time so you can go ahead if you want, and also you can send her your assignments ahead of time so you can get feedback before the deadline. She is very responsive and cares for her students, so I recommend taking her for every class you can!", "rating": 5, "expected_grade": "A+", "created": "2021-01-08T16:04:34Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "I took two classes, both 340 and 300, with her. She is a great professor. The exams are easy and clear, and she provide helps about the projects and homework as well.", "rating": 5, "expected_grade": "A+", "created": "2021-08-31T16:07:27Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Lehman is a super sweet guy. The content itself isn't too interesting but you can tell he loves teaching it. The exams are very lengthy and HEAVILY memorized based which is the only fault. There is so much content from the lectures to memorize but as long as you get it all down you will get an A. Overall hes a great guy and was not a terrible class by any means. ", "rating": 4, "expected_grade": "A-", "created": "2021-11-08T20:58:55Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "He's a great professor and knows his stuff. Two pieces of advice for you guys: be sure to take good notes because he writes notes on a piece of paper and for the SPSS assignments, pay attention to the instructions because I did lose some points for that.", "rating": 5, "expected_grade": "B-", "created": "2021-12-19T00:17:44Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Pros:\r\n- Research methods can be a little dry, especially if you’re not interested in research. Professor Lehman incorporates examples from his own research on marijuana into the class, which makes it much more interesting.\r\n- He wants students to succeed, and you can email him at almost any time before SPSS assignments are due with questions. He will get back to you. \r\n- Class almost always ends early. When he finishes his material for the day he doesn’t feel the need to keep students ‘just because’. \r\n\r\nPro or Con depending on your preferences:\r\n- Everything in this class is hand written by the professor on the board or a piece of paper that is projected onto the board. You have to write really good notes.\r\n\r\nCons:\r\n- The exams are 100 question multi-choice, and they are heavily memorization based. You’ll be tested on stories he tells in class, so study those too!", "rating": 4, "expected_grade": "A-", "created": "2022-05-20T20:59:12Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "I had Dr. Brooks for 300 and 340 this semester. I cannot say enough good things about her. She is the best professor I have had at UMD so far. She wants all of her students to succeed. She holds office hours and offers help on the research assignments, so there really is no excuse not to get 100 on them. If you go to class, take the notes, and read the textbook, you should get an A in both 300 and 340. She also offers extra credit, and is very fair with grading. There are no surprises on her exams - everything that she tells you is on it, will be on it. She keeps even the boring material interesting in class. The guest speakers in 340 are very interesting, and so is the other material she teaches. I really recommend you take 300 and 340 with Dr. Brooks if you want to get an A and have a professor that genuinely cares for her students and respects them.", "rating": 5, "expected_grade": "A", "created": "2022-05-25T17:14:24Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "I love this professor so much. The topic is super boring but since you have to take the class, this teacher is the way to go. He throws in 5 assignments that he basically tells you exactly how to do which makes ur grade boost a lot if you get 5/5 on all of them (which is so easy). He is super accommodating, has very helpful office hours, and walks you through almost everything. The tests are multiple choice with 100 questions which sounds like a lot but actually helps you with scoring as you can get like 15 wrong and still get an 85. You MUST read the textbook and you will get a good grade. Requires a lot of studying but as long as you read the book and go over the notes he gives you, you will get an A", "rating": 5, "expected_grade": "A+", "created": "2022-11-30T18:21:36.110683Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "Dr. Brooks rocks. Super organized, engaging, and adds just the right amount of humor to keep class fun. You will do well in this class, and Dr. Brooks makes sure of that by taking care of her students through office hours and in-class Q&A. Yes, her CCJS300 sections are MWF and I’m not a fan of Friday classes either. But if I had to have class Saturday and Sunday just to have Dr. Brooks as my professor, I would. Seriously, she’s that good.", "rating": 5, "expected_grade": "", "created": "2022-12-08T19:22:44.741569Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "Professor Brooks is a very good lecturer and keeps a good pace of time between assignments and exams. She is always available if you have any questions or need help. If you are a student who is organized and will read the textbook, you will do great in the class.", "rating": 5, "expected_grade": "A-", "created": "2022-12-13T16:15:15.279414Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "Professor Brooks is an amazing lecturer. I love the way she gives notes- outline style. She explains everything perfectly and doesn't leave much room for questions because she covers everything. She has research projects for this class and they aren't hard, you can go to her during her office hours and she will look at them. They're honestly an easy way to boost your grade. Her classes are very exam heavy though. There are 3 exams with 50 questions (multiple choice & true/false), and they make up the majority of your grade even with the research projects.\r\nI also had her for CCJS340 and it was the exact same, but we had weekly discussion posts and they counted even less towards your grade, so exams are very important.\r\nI would take her for all of my classes if I could!", "rating": 5, "expected_grade": "A", "created": "2023-05-17T19:51:32.717931Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "he's a great professor and the class is relatively easy. it calls for a lot of stuff from ccjs200, so if you were good on that, you should be good with this class too. however, the only difficult thing about his class was the exam. it's 100 MC questions and it was based on a lotttt of memorization. either from the notes, the articles he provides, and textbook. some things he doesn't talk about in class and we'll still be expected to know it for the exam, which kinda sucks. he also didn't have extensive review sessions so we didn't know what to study in depth about.", "rating": 4, "expected_grade": "A-", "created": "2023-11-07T14:45:10.600309Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "I was very scared going into this class that it would be like 200 but it is not. This class is on the boring side because it is research methods, but there is not a ton of work. You have very straightforward SPSS assignments (4) that literally are just copy and pasting. There is one essay based on a movie you watch in class too. Exams are extremely easy if you read the textbook and class notes. The exams are word for word from class notes and the textbook. If you do not read the textbook you will do bad on the exams. I personally read the textbook chapters twice before exams and class notes a few times and I am able to do the 100 question multiple choice exam in 20 minutes because it is so straightforward.", "rating": 5, "expected_grade": "A+", "created": "2023-12-01T20:39:39.631207Z"}, {"professor": "Laure Brooks", "course": "CCJS300", "review": "Honestly, the only reason I have a B is because I did not do well on the first exam. Exams consist of 2/3 lecture and 1/3 textbook. Do NOT neglect the textbook section! There are 6 research projects throughout the year but they are not difficult or time consuming. There is also an extra credit assignment at the end of the semester. Professor Brooks is extremely helpful and I wish to take more of her classes. She is a great speaker and easy to pay attention too. Lecture content is not too heavy either!", "rating": 5, "expected_grade": "B+", "created": "2023-12-03T22:32:44.084374Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "good professor. this class is not like ccjs200, its a lot more boring, factual stuff about the ins and out of research. spss assignments are straight forward as well as multiple choice exams. i would recommend showing up to classes because he gives out a lot of test answers. if its not something he gave the answer to in class, its something from the textbook. (also a lot of good quizlets online to study from before tests).", "rating": 5, "expected_grade": "A", "created": "2023-12-22T22:48:30.836243Z"}, {"professor": "Brett Lacey", "course": "CCJS300", "review": "This was Dr. Lacey's first time teaching this class. He is an easy professor who enjoys when the class engages with his questions. There are 3 multiple-choice exams (one of which is the final) and 6 \"Research Projects\" which are mostly easy homework assignments. He gives you are warning before the tests and will hint to test answers, he also does an exam review. He does not post his slides. Attendance is not required.", "rating": 5, "expected_grade": "A", "created": "2024-03-26T19:20:08.054927Z"}], "department": "CCJS", "course_number": "300", "name": "CCJS300", "title": "Criminological and Criminal Justice Research Methods", "credits": 3, "description": "<b>Prerequisite:</b> CCJS100 and CCJS105; and (PSYC200, CCJS200, ECON321, BMGT230, or SOCY201).\nIntroduction to the formulation of research questions covering crime and justice, research designs, data collection, and interpretation and reporting in criminological and justice-system settings.", "is_recent": true, "geneds": null}