{"average_gpa": 2.488161730857757, "professors": ["Bonnie Dixon", "Andrei Vedernikov", "Janice Reutt-Robey", "Lenea Stocker", "John Ondov", "Cheng Lee", "Natalia White", "Elizabeth Griffith", "Ashley Sexton-Radney", "Daniel Steffek", "Michael Warehime", "Raffaele Perrotta", "Matthew Thum", "Michael Pacella", "Alice Mignerey", "Michael Pacella", "Monique Koppel", "Amanda Schech", "Elizabeth Griffith", "James Rainbolt", "Amanda Schech", "Elizabeth Griffith", "Elizabeth Griffith", "Alice Mignerey", "Amanda Schech", "Elizabeth Griffith", "Samuel Lascio", "Elizabeth Griffith", "Alice Mignerey", "Elizabeth Griffith"], "reviews": [{"professor": "Michael Montague-Smith", "course": "CHEM135", "review": "If you've taken AP Chem, this class is too easy with MS. Like the others said, hardly any memorization is needed. Skim through the chapters, make sure you can do the Mastering Chem hw, and you're good to go. Lectures become a waste of time (I just gave my clicker to my friends), and I never went to discussion/GSS. The final was 1/3 directly copied and pasted, and he gave us the titration problem beforehand. If you haven't had any chemistry for awhile, you're in trouble. Be prepared to teach yourself and study like crazyy!", "rating": 3, "expected_grade": "A", "created": "2010-12-18T23:57:00Z"}, {"professor": "Michael Montague-Smith", "course": "CHEM135", "review": "One of the better professors for Chem135.  He doesn't require his students to memorize much; if it is found in a table in the book somewhere, chances are it will be given to you on the test.  The tests are pretty straightforward, and you will do well if you study.  A lot of my friends had other professors, and their tests were much harder, plus they were required to memorize a lot that I wasn't required to.", "rating": 4, "expected_grade": "A-", "created": "2010-12-06T13:50:00Z"}, {"professor": "Michael Montague-Smith", "course": "CHEM135", "review": "Pretty good professor. He doesn't make you memorize as many things like polyatomic ions, constants, formulas etc., and his tests are easier than other professors. Clicker questions almost every class, MasteringChemistry HW every week (completion grade), and he curves. Only (possible) downside is that he goes off on tangents in class and tells stories, which is entertaining to some and a waste of time to others.", "rating": 5, "expected_grade": "", "created": "2010-12-02T14:58:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM135", "review": "I took CHEM135 my freshman year fall 2012.  This was one of the most awful experiences I have had with chemistry. \r\nReutt-Robey was extremely monotone and she could not project to the back of the classroom.  She did not take advantage of the microphone for the room either.  She got confused by her own powerpoint slides and often stumbled around the content.  Lecture was pointless to go to other than the clicker questions which were often on material that we had never seen before.  \r\nThe tests were full of tricky questions on content that she glazed over.  My TA was also very incompetent, I went to most discussions and he could not answer many questions that the students asked pertaining to the material.  \r\nAlthough she curves the class, it is almost impossible to get an A.  If you are stuck with her, you can get a B with copious notes and reading the book.  I was only 1% off of a B- because I gave up on the class halfway through, but it is very possible to get a B with the curve.  Good luck if you get this professor.   ", "rating": 1, "expected_grade": "C+", "created": "2013-06-08T11:42:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM135", "review": "Reutt-Robey is nice, knows her stuff, and sincerely tries to teach. The problem is, she's not very good at teaching.\n\r\nNote-taking is extremely difficult to do because she relies on slideshows that tend to have extraneous information left and right... you basically don't know what NOT to write down until after you've already taken the test. She tries her best to answer questions but tends to make people even more confused afterward. She doesn't use the volume needed to teach 300 kids in a lecture hall - people tended to talk over her after a while, so if you're not very good at chem, it's almost mandatory that you sit in the front.\n\r\nChem discussion with the TA wasn't very helpful either. The best thing I ever did for this class was go to the GSS sessions. They prepared me much more for the tests than the lectures with Reutt-Robey ever did. The tests themselves aren't very hard, it's just that Reutt-Robey doesn't always cover everything that's on it. There was always a handful of questions that seemed to be like completely new material simply because Reutt-Robey only briefly mentioned it or never talked about it at all.\n\r\nIf you can, avoid her. Nice person but a dead-awful teacher.", "rating": 1, "expected_grade": "B+", "created": "2013-05-06T20:53:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM135", "review": "Please save yourself the time and don't take this professor. Honestly the WORST professor I have ever had in any level of school. Middle, High, College, and College Camps. Horrible professor, she speaks so quietly you can't even hear her. Besides this when you can hear her she stutters and is impossible to understand. I use to love chemistry, after taking this class I hated chemistry, which when thought about is extremely sad. Every single class, one minute before class is over she would ask what time it was, after this she skipped around six to eight slides of material that we would never see again in the next lecture to do her click question. Thus you're missing almost ten percent of the content over the semester. I'm sure she's extremely smart but she needs to be in research and not teaching. Sorry. ", "rating": 1, "expected_grade": "", "created": "2012-12-15T01:17:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM135", "review": "The nicest professor you will meet in the science department. She is soft-spoken, so sitting up front will help your learning experience. It is mandatory that you go to the lectures for the clicker questions that are reasonably fair. Dont bother taking notes from her slideshows, but try to pay a decent amount of attention. Most of the learning will occur outside the classroom and in the textbook. The teaching assistant wasnt much help for this class either. The online homeworks were a doozy and very time consuming. There are 3 exams and 1 final, so if you want an A you'd better study for all 3 and work on the practice problems in the book! Other than that good luck.", "rating": 3, "expected_grade": "B", "created": "2012-01-25T00:36:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM135", "review": "Course: CHEM135\n\r\nTeaching Style:\r\nReutt-Robey's weakest point. While I will concede that Dr. Reutt-Robey clearly knew the source material she was lecturing on, her ability to communicate is lacking. Multiple times during the semester, she was observed to trip up on certain sentences, making certain examples unnecessarily obtuse. Adding to her ambiguous communication, her class room control was very poor. While admittedly difficult to control 300 some freshman, it was impossible to hear if sitting anywhere but the front 10 rows, and difficult even then.\n\r\nAssignments:\r\nAssignments and given in two formats: one point in class responses, and online homeworks. Neither are particularly exceptional, and are average. Not terribly difficult, however.\n\r\nExams:\r\nThe exams were a point of contention for me. While average exams in every respect, I found the exams to be filled with trick questions, typos, or ambiguous wording. Somewhat below average, though not terrible.\n\r\nGrading:\r\nReutt Robey's grading system is relatively standard for most freshman classes, however, it should be noted. Dr. Reutt-Robey will not curve this class. Do not expect to get an A grade with an 85. It won't happen.\n\r\nOverall Review:\r\nAverage class with below average Professor. For most, it's not an optional course, but Reutt-Robey could certainly improve the class but refining her teaching style.", "rating": 3, "expected_grade": "A", "created": "2011-12-17T22:27:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM135", "review": "I respect Janice's lab, but she is not meant to teach. Luckily I didn't need her to know chemistry, but my friends struggled. She, in a monotone voice, just read off of her slides and did a poor job of explaining concepts to students who had never taken college-level chemistry before. Terrible.", "rating": 1, "expected_grade": "", "created": "2011-12-17T10:59:00Z"}, {"professor": "Devarajan Thirumalai", "course": "CHEM135", "review": "wow i hate him!\r\nmade chem scary!", "rating": 1, "expected_grade": "d", "created": "2011-01-25T00:30:00Z"}, {"professor": "Devarajan Thirumalai", "course": "CHEM135", "review": "If you decide to his worthless lectures, be prepared to listen to him complain about the students or something irrelevant 40% of the time.  He is a complete asshole to the students and doesn't care about whether or not you are learning.  I know this because he never once gave us a more than relative description of what would be on the exam.  He just said \"I don't know, I haven't made the test yet!\" or \"You need to study what we learned in class, what else would you be studying?\" followed by some smart ass comment.\n\r\nThis guy isn't teaching this class next semester, and hopefully, he will never teach again.  He does not take his job seriously whatsoever.  Many time, students would ask questions, and he would respond \"I'd write it on the board, but I'm too lazy\".  He spent no less than two weeks attempting to explain Shrodinger's Equation to the class.  Why?  That's what I want to know.\n\r\nThis guy is waste of time and money.", "rating": 1, "expected_grade": "D", "created": "2009-06-01T09:37:00Z"}, {"professor": "Devarajan Thirumalai", "course": "CHEM135", "review": "He seriously sucks, but he does curve the class to a C if you are around the average. He also gives you unlimited homework attempts.\n\r\nOur exam averages were 49, 64, 62.5, and I am not sure about the final.\n\r\nIt was very hard to study for any of the exams because you don't know if he is about to pull questions out of his ass that he assumes we know even though he hasn't covered it.\n\r\nHe is a rude jackass if you ask him any questions. He spends much of his time explaining how he hates when people talk in class. \n\r\nCHEM135 is suppose to be annoying and hard intentionally but this guy SUCKS, don't take him or even speak to him.", "rating": 1, "expected_grade": "C", "created": "2009-05-22T14:46:00Z"}, {"professor": "Devarajan Thirumalai", "course": "CHEM135", "review": "What these two guys have said is right, I had him this past semester. If I'd ask him to explain a question his answer was always \"Find out for yourself.\" His tests always include things that have not been taught or even mentioned in class, he does not write legibly, he is incredibly rude, does NOT care about his students, and CANNOT teach or convey material at all. Do not take him!!", "rating": 1, "expected_grade": "C", "created": "2009-05-20T22:36:00Z"}, {"professor": "Devarajan Thirumalai", "course": "CHEM135", "review": "horribly rude and quick tempered professor. does a terrible job teaching, grades harshly, and makes the exams far too hard (ie. the average on each exam ranged from 45 - 60%). avoid at all costs. if avoid him means getting that horrible math teacher, take the math teacher.", "rating": 1, "expected_grade": "", "created": "2009-05-20T01:56:00Z"}, {"professor": "Devarajan Thirumalai", "course": "CHEM135", "review": "He spends way too much time with \"descriptive\" chemistry in the beginning and then he mumbled through the rest of the course, not making too clear what we were learning.  He was also an arse when it came to students asking him questions which he expected them to not ask or something. Besides his personality, the biggest problem was that he taught stuff that didn't always correspond with the book or was not in the book at all.  The online ARIS homework also did not have any problems available to practice his not-in-the-book topics.  He also refused to mention which topics would be on any of the exams--no not spoonfeed us of course, but not even some general chapters or topic names.  Basically, he teaches stuff not in the book and doesn't give practice for it.", "rating": 1, "expected_grade": "F", "created": "2009-05-19T14:27:00Z"}, {"professor": "Devarajan Thirumalai", "course": "CHEM135", "review": "He is a smart guy, but not that great of a teacher. He spent a better portion of the semester going over some basic quantum mechanics and expected us to understand, take apart, and put back together formulas using ideas that we were supposed to have learned in high school. While I did agree with him that we should be able to use things like the quadratic formula from a 10th or 11th grade math class, I do not agree with how he covers the material. Alot of the first exam was material that he would briefly go over in class, some of the equations he only spent a total of  2 minutes on. He doesn't understand that not everyone in the room is a genius and can process equations through their heads like he can. He told us on the last day that he cared more about us understanding the material and that we shouldn't be worried so much with the grades. That is particularly easy for him to say when he doesn't have tuition money riding on a GPA. \n\r\nThis is my second time taking the course, the first time I got a C because I forgot my calculator on my last midterm and my batteries died on my final exam. I heard he is not teaching this class after this semester, which is good news for everyone else because he was probably the worst professor I've ever had. However, I got 80's on his last two exams after I got the hang of how he teaches the class. It focuses mainly on taking apart equations and putting them back together. Once you get those ideas down his tests aren't too difficult. You just have to look over your notes and pretty much ignore the amount of time he spends on certain material, because it isn't proportionate to its importance. ", "rating": 2, "expected_grade": "C", "created": "2009-05-19T03:49:00Z"}, {"professor": "Devarajan Thirumalai", "course": "CHEM135", "review": "this professor does not treat any student in his classes with any respect whatsoever, if you ask him a question he is completely unwilling to help.  as far as teaching the material he is horrible he rushes through everything and very seldom does any examples and as the other review said, alot of the material on the test was never even mentioned in class", "rating": 1, "expected_grade": "", "created": "2009-05-18T20:29:00Z"}, {"professor": "Devarajan Thirumalai", "course": "CHEM135", "review": "All the information about him is already stated!! \n\r\nThe good news is he is never teaching this class again! so no worries\n\r\nThis class was a waste of time for me! I wished I had learned some chemistry here! When i take the lab with this course I'm sure I will be super lost :(\n\r\nwords cannot describe the frustration that students had for this class!", "rating": 2, "expected_grade": "B", "created": "2009-05-16T16:16:00Z"}, {"professor": "Devarajan Thirumalai", "course": "CHEM135", "review": "I didn't take this course, but I tutored two kids in this class and am posting this review to warn you about this class. Try your best not to take it. He spends the first third of the semester on the first chapter then rushes through the remainder of the material. The tests are pretty challenging because he hasn't taught some of the material on the test in the first place. The average on the first test was in the 40's, the second in the 50's and the third was in the 60's. I am pretty sure he is the worst chem professor on campus. Avoid him if you can!!!!!!!", "rating": 1, "expected_grade": "", "created": "2009-05-04T02:21:00Z"}, {"professor": "Devarajan Thirumalai", "course": "CHEM135", "review": "He is rude and a terrible teacher. I had trouble believing he has a PhD. I'm sure he knows Chemistry but the point is that he sucks at teaching it, particularly for this class. His explanatations are horrible, handwriting is illegible, and accent is often hard to undestand. The whole class failed the exams because he didn't teach us anything (exam avg. = 47%) and he refuses to accept that he sucks at teaching and instead tries to help out by giving extra points and whatnot but it's still not enough for an A-student to even get a B. \n\r\nI give 1 star because he gives unlimited attempts on the online homework problems, which is nice. But I still hate him.", "rating": 1, "expected_grade": "C", "created": "2009-03-12T14:23:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "Vedernikov is the BEST.\n\r\nHe's a nice guy and dealt with our obnoxious class. His exams are almost exactly like his old ones, so use those to study. He actually cares about his students so don't be scared of him. ", "rating": 5, "expected_grade": "A", "created": "2015-01-23T23:44:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "His accent is kind of hard to understand, but if you pay close enough attention (don't sit in the back and browse facebook and actually pay attention), I'm sure you'll learn enough. I chose to not pay attention and just read the textbook. I found the textbook to be very helpful, and Verdernikov's slides are right from the book and pretty useful (though I still recommend reading). His tests are very easy, and if you read the book, you'll be fine. The curve (85%+ is an A) is very generous and shouldn't be hard to pass.", "rating": 3, "expected_grade": "A", "created": "2013-04-21T16:14:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "Yes he has an accent, but you get used to it. I can't comment much on how good his lectures were since I didn't pay attention. However, he does explain anything you need to know well if you go to office hours. His old exams are also almost identical to his newer exams, so study those and you should be fine.", "rating": 4, "expected_grade": "A", "created": "2012-12-19T20:57:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "His accent was my favorite part of this class. \r\nDr. Vedernikov was definitely accessible, he had office hours every day, and always ended his classes with an invitation for students with questions to come up to him and ask. \r\nIt was hard to stay focused in lecture sometimes - we would cover a lot of material and then he would sometimes have to rush through the last few slides.\r\nThe last five minutes of class were always characterized by loud shuffling noises from the 300 or so people all packing up their stuff while the professor was still lecturing, making it impossible to hear. \r\nWe covered a ton of material for the third exam, which had a silver lining in preparing us for the final the next week. ", "rating": 4, "expected_grade": "A", "created": "2012-11-30T14:09:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "For those complaining about the clicker questions, just make a friend, give them your clicker, and switch off going to class. The homework on MasteringChem was easy (most of the answers are on yahoo answers) and if you get enough correct, you can get over 100%. The tests were okay, and I didn't pay attention AT ALL in class, just self-studied from the textbook/his powerpoints. For not paying attention in class and being sick and absent for three weeks, I thought a B was pretty good. This class is MUCH easier than Dixon's class, I always felt bad when my friends in her class were studying and I was doing nothing. \r\nI took AP chem in high school, and that class was much harder than this one (might be just my school) but I didn't remember much and still did well.\r\nOh also his office is impossible to find. But he was really nice when I had to make-up an exam.\n\r\ntl;dr: Homework answers can be googled, you can self-study and do okay, if you actually pay attention in class an A is pretty easy, MUCH MUCH easier than Dixon.", "rating": 3, "expected_grade": "B", "created": "2012-01-05T16:52:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "He seems like a nice guy. Never really paid attention in his class but the workload is very light. He gives so much opportunities for extra credit like in homework which is masteringchemistry gives 13 but only counts 10 and in clicker points where he gives 50 but only counts 40. Most of the material I learned myself since I tend to fall asleep in his class since I don't keep up. He posts past exams and the final which is very similar to the tests that he gives out. Overall, just take him if you're not doing anything chemistry related in engineering. Easy A for you.", "rating": 5, "expected_grade": "A", "created": "2011-12-13T20:47:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "Vedernikov was a fabulous teacher.  Aside from the accent, which you can understand relatively quickly and easily, and his \"g\" looking like a \"p\" there is nothing really to complain about him.  He utilizes both powerpoints and blackboard.  The powerpoints will have definitions, pictures, and examples, but then elaborates on those things by writing more definitions on the board, explaining things with his own drawings, and doing more examples on the boards. All of that is really helpful in better understanding the material.  However, despite his good notes, you do need to actually read and take notes on your own (I know, it's a shocker) because it will give you a better understanding of everything and if you do it before the lectures you will be prepare to actually sit and listen rather than just sloppily copy down notes.  Overall, he has been my favorite professor so far, even though this is my first semester here, so the lesson to be learned is; pay attention in class, and do work on your own outside of class, namely take your own notes, and then you can easily get an A in the class.", "rating": 5, "expected_grade": "A", "created": "2011-11-30T22:07:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "I took CHEM135 because I need it for engineering.  Vedernikov sucked.  I took AP Chemistry last year as a Senior in high school, and I ended up getting a B+ in the class but only a 3 on the AP exam.  I came in expecting for the class to be an easy A because I was told it was basically going to be a review of AP Chem.  The first thing I noticed about Vedernikov is that he has a thick Russian accent and that he speaks quietly, even with the microphone it's hard to hear his if you are any further back than a third of the way from the front.  He has all the material on the powerpoints he does in class and he posts them on ELMS after (or sometimes before) class.  He has at least 1 clicker question in class and about halfway through the semester he started to do a clicker question at the beginning AND end of class, so you have to stay for all of class to answer all the clicker questions.  You really cannot afford to miss any (or many) lectures, though what a friend of mine and I did towards the end of the semester was one person would take both clickers each day and the other person could relax and not go to class.  I must say though, I do like his grading scale.  I got a 77, 71, and 53 on my tests (in order of test 1, 2 and 3.  I admit I could have gotten better if I studied and paid more attention) but I ended up getting a 105.7 out of 100 on my homeworks, so that helped balance out my grade b/c he has a points system (best 40 clicker questions counted at a point each per right answer, .5 points per wrong answer, lowest three homeworks dropped out of 13 homeworks (counted at out of 100 points) and 100 points each for the three tests.  that plus the 200 point final adds up to 640 points).  His grade range is pretty nice too, 85%+ for an A, 75%+ for a B, etc. and he said he curved max two points up on the final grade.  Overall, I would not recommend him for Chem135.", "rating": 2, "expected_grade": "C", "created": "2011-04-07T16:11:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "I ended up with a B because I didn't study. It is not difficult to get an A in his class. Vedernikov posts his old exams on ELMS and if you study and understand them, then you'll do fine on his tests. He does have an accent, but by the end of the first week you'll understand him just fine. He has clicker questions, which means you have to attend class. His class is also extremely boring, but he does allow the use of laptops in class, so you can get other work done. He is an easier teacher than Dixon, so if you don't really care about learning chem and just want a good grade, then take his class.", "rating": 3, "expected_grade": "B", "created": "2011-02-17T23:05:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "My \"OurUM\" account is dedicated to the famous Mr. Vedernikov. \r\nAKA worst teacher I have ever had in my entire life. \r\nHas he been fired yet?", "rating": 1, "expected_grade": "", "created": "2010-12-16T17:58:00Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM135", "review": "Vedernikov has many problems as a professor.  He gives practice exams which are great to study from for each exam, but when you get the actual test there are questions that are not featured on the practice.  Its not that problems were different, the whole concept was missing.  He just does a poor job of preparing students for tests.  The accent depends on the person because sometimes I could understand him and other times I couldn't.  If you take CHEM 135 with Vedernikov be prepared for grueling exams and terrible lectures", "rating": 2, "expected_grade": "C", "created": "2010-12-13T19:56:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dixon is truly an amazing teacher! She's on the same page as the students in terms of work. She seems very hard at first with all of the orgo but in the end, you realize you learned a lot more chemistry than kids in other professor's classes. \n\r\nShe grades very fairly and as long as you attend every lecture, you'll likely get an A or B. ", "rating": 5, "expected_grade": "A", "created": "2014-01-03T15:45:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "I took AP Chem in high school and got a 4 on the AP exam (still bitter that doesn't count for credit) so this class was not as hard for me as it is for others.\n\r\nYeah, as everyone says, its A LOT of work. But I would highly recommend taking her if you have to take future chem classes, especially orgo. She puts a lot of organic chemistry into 135, so when you do take orgo you'll have a base knowledge and be ahead of people who didn't have her. Unfortunately for me, CHEM135 is the only chemistry class I'm required to take so it would've been better and easier for me to take someone else.\n\r\nI must say, she's an amazing teacher and actually teaches, but her tests are super hard.", "rating": 4, "expected_grade": "A", "created": "2013-10-02T15:43:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "I took CHEM135 and CHEM231 with Dixon. She is a very tough professor, but she wants you to understand the material. If you have a strong chemistry background in high school, I encourage you to take CHEM 135 with her, because you will gain a new understanding of gen chem. However, I regret taking her for CHEM231. Since I had almost no background of organic chem, she was just insanely tough for organic chem.", "rating": 3, "expected_grade": "", "created": "2013-07-15T14:49:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "ATTENTION: IF YOU ARE ANYTHING BUT A CHEM MAJOR OR ARE NOT INTERESTED IN CHEM, DO NOT TAKE DIXON! \r\nHonestly, she is the biggest mistake a freshman can make when taking chem135 and here is why. Sure she is cares about her students and what not, but her tests are NOT fair. She teaches one thing, and the test is 10x as hard as what she teachers. And the amount of Organic Chem she puts in to GEN CHEM is overwhelming. \r\nIf you are a chem major, take her, it is great preperation for orgo. BUT, if you are anything but chem major, AVOID HER AT ALL COSTS. You will have to put in hours for a class that is not even a priority. Take another proffessor, get a good grade, and never look back on chem. I promise you, AVOIDING DIXON WILL THE BEST THING YOU HAVE EVER DONE. ", "rating": 2, "expected_grade": "C", "created": "2013-05-02T11:53:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "I have read a lot about Dixon and how hard she was... All of it was true. Her class is easily the hardest CHEM135 class at UMD. That being said.. she is also the best professor.  If you do your work and you pay attention and poor effort into the class and into understanding everything, then you'll be fine.  She was very approachable and kind when it came to office hours and helping students.  I felt that I definitely earned my A from all the hard work I put into her class.  (I also love chemistry, am a Chem Eng major, and got a 4 on the AP chem exam the year before taking her class). Her first two exams are hard (I got a 69% on both); the third is impossible (I got a 49%)... Then I studied for literally 20 hrs for her final, got an 85% on the final, and walked out with an A in the class.  \r\nBottom Line.... If you are willing to work very hard and you love chemistry ... TAKE DIXON you might not get the highest grade, but you will walk out of there having learned a ton!", "rating": 5, "expected_grade": "A", "created": "2013-04-29T12:38:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "I hate to say this, but she is a great teacher. I hated that class so much. This is a fair warning for everyone: DO NOT TAKE DIXON UNLESS YOU A WILLING TO PUT IN MAXIMUM EFFORT. You will not do well if you do not study and practice for hours every week. I recommend getting the mastering chemistry, if not for the possible booster at the end, for the extra practice. Her class is tougher than steel ox balls. She is a very nice teacher and will give all of her time to helping you understand the concepts. She focuses on Organic Chem. Don't take this class unless you have to take Orgo (i.e. chemical/bio engineers or people on the premed path). I did barely get a C in this class. My average test grade was like a 44%. I laid in bed at night contemplating my schedule for the next semester, wondering if I will have to take this class again. Here is the twist, I tutored my friends in chemistry who had different teachers. You will get a better understanding of chemistry if you take Dixon than with any other teacher. Good luck and you have been warned. Mwuahahahahahah!", "rating": 3, "expected_grade": "C", "created": "2013-03-19T18:51:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Whilst Dixon is definitely a good teacher and will help you learn chemistry well, the class is definitely hard, and I don't think that it is worth taking Dixon. I would recommend taking an easier teacher for the better GPA. I had a pretty good Chemistry background (4 on the AP) test, and I received a B+ as my final grade. The  averages on her tests are consistently in the low 60's, and although she curves the whole class (about a 78 is an A), It is still hard to walk out with that A. The only advantage of taking Dixon is that if you are a Chemical or Bioengineer, she will prepare you very well for orgo, but never the less, your grade will suffer. ", "rating": 2, "expected_grade": "", "created": "2013-01-03T21:52:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Here's the thing about Dr. Dixon. She's awesome, funny, cool, and easy to talk to, no doubt about that. \n\r\nHer lectures are easy to understand and she's easily the best chemistry lecturer out of all of the CHEM135 teachers. She's also really helpful during her office hours if you can make the time to go to them.\n\r\nHowever, where my complaints lie about her are in the unnecessary difficulty of her material. While she goes over the same topics as other CHEM135 teachers, she incorporates organic chemistry as a huge component in her material. For someone who likes and understands orgo, this isn't a problem, but I was very confused whenever she'd use orgo as an example for a problem that could have been taught without it.\n\r\nThe exams in the class are very fair, albeit difficult, not only because of the difficult material, but also because you almost always run out of time before finishing them. She covers all the material on her exams in class, and they're reinforced in the somewhat-helpful discussion sections. \n\r\nThere isn't much homework to do for her class, just 3 assignments due before each of the three tests, but this is just as bad as it is good. The homework assignments themselves are very difficult, and are weighted pretty heavily in your final grade. But if you work together with some friends, they should be manageable.\n\r\nOverall, if you're going into a chemistry-related major like chemical engineering or bioengineering and you'll need to take orgo in the future, take Dr. Dixon. She'll whip you into shape for that. Otherwise, you'll just burden yourself with very difficult material for no reason.", "rating": 4, "expected_grade": "B", "created": "2012-12-16T22:12:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "She is very dedicated to her students. She makes time and holds a lot of office hour time for students. She may be rude sometimes but I have never seen her angry. She makes class decently fun. The topic is hard and you have to make the dedication to practice and do extra work. Definitely try to see her in office hours and you'll do great", "rating": 4, "expected_grade": "B", "created": "2012-11-30T20:02:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Two Words: F***ing Awesome\r\nDr. Dixon can be hated on by all these goons on this website because none of them want to put in any work. If you have to take Orgo, you're most likely in a major where your career path demands you KNOW your stuff. Dr. Dixon gets that done. If you want to go pre-health shes the best prep tool youve got for chemistry. And if you dont want the challenge, then drop premed please, I don't want you operating on me or my child if you didnt want to be challenged with organic chem.\r\n I got A+s in gen chem and orgo with her, but I worked for them. I also went to her when I needed to because she loves her students, and wants us to succeed. Im even taking orgo II with her this summer because I love her teaching style so much. As for her testing style, yeah, they suck. Getting the average is something to be proud of (so just hope you know more than those sitting next to you). Its awesome when you are talking to kids with different orgo teachers and they have no clue what youre talking about because thats how much material Dixon manages to teach you. \r\nApart from the learning she is really an awesome person just to go talk to about life. She's funny, personable, and will go out on a limb for you if you truly need someone. Love the woman. Take her", "rating": 5, "expected_grade": "A", "created": "2012-05-17T11:26:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "This class is literally a joke. When you read bad freshman reviews on here, don't pay them any attention. The main problem is that these freshman come in expecting to do no work. My chem professor in high school was so bad that I basically came in with zero chem experience, and I still came this close to getting an A+. Dixon is nice and shes pretty good at teaching.\n\r\nDos:\r\nTHE MASTERING CHEMISTRY\r\nALL THE EXTRA CREDIT PROBLEMS\r\nUSE HER STUDY GUIDES\r\nUSE THE GSS STUDY GUIDES\r\nGO TO OFFICE HOURS\n\r\nDon't:\r\nPiss her off\r\nWhine\r\nGet below a 50% on the exams(auto fail if you do this)", "rating": 5, "expected_grade": "A", "created": "2012-02-20T23:59:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon is one of those feisty professors that people love and hate. She expects a lot from her students but also makes class fun. She was definitely a babe back in the day btw. If you have bad study habits you will die in this class. But if you study, you will do well and will be rewarded. As others have said, if you like chemistry you will love it with Dr. Dixon. But you will most certainly hate the class if you can't relate to chemistry. She gives quizzes every two weeks, the occasional clicker questions, three \"midterm\" exams, and one final exam. If you do the optional mastering chemistry you can earn extra credit. She also gives an extra credit question every week that you work on out of class and e-mail her the answer before midnight. Although the exams are tough (because it is hard to predict the questions asked) Dr. Dixon has a large curve for the overall class. So overall, if you put work in, you will surely get an A or B. If you challenge her teaching methods in class, prepare to be humiliated. If you joke with her or dress up, she will always play along and so will the 300 other people in the lecture hall. She is a nice person that truly wants her students to learn and will help the most she can. Just take her for the experience. ", "rating": 4, "expected_grade": "A", "created": "2011-12-26T22:50:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "What can be said about Dr. Dixon that has not been said? Excellent lecturer and cares tremendously about your grade if you care about it. The class is not easy by any measure but it is very doable if you put in the time that Dr. Dixon expects. Other CHEM135 classes will be easier but they will not prepare you nearly as well for Orgo. Dixon is in her office hours more than any other chem teacher and is helpful if you go to her although she may seem intimidating at first.", "rating": 5, "expected_grade": "A", "created": "2011-12-22T14:46:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon is a very good lecturer for chemistry. You will definitely learn a lot from her class. At the same time, though, you have to work hard. I recommend taking her if you have some prior experience with chemistry because she does assume you have some knowledge of chemistry going in. Exams can be stressful because of the limited amount of time to do them, but they are certainly doable if you study hard.\r\nTips to do well in her class:\r\n-Memorize ALL of the ions early on. She does not directly test you on how well you know your ions, but she refers to them a lot on clicker questions and exams. \r\n-Know your organic nomenclature early. Yes, she is organically inclined and will constantly test you on organic nomenclature throughout the course. I found that I only used the book to review organic nomenclature; she pretty much gives you notes on other material you need to know.\r\n-Study Hard! Practice exams are available in some fraternity, but they are a pain to access. The practice exams are a great study tool, but bear in mind her curriculum changes from semester to semester. Also go to the guided study sessions near exam time; they help A LOT.\r\n-Go to her office hours! While she is quirky in lecture, she is far more relaxed in her office, so go there if you need to ask a question or get clarification.\n", "rating": 5, "expected_grade": "A+", "created": "2011-12-05T04:27:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon assumes you have a decent knowledge of chemistry from High School, if you don't, then I suggest you take another professor. I'm not sure of the difficulty of the other professors teaching this course but it always seemed as though Dixons class was the hardest. Her tests aren't that awful, if you study your notes then you should be fine, she only tests concepts that she goes over in lecture which is nice. She is a good teacher but a hard grader and expects you to learn way more (including organic chemistry) than you would in any other general chemistry course. Basically, if you want to LEARN chemistry, take Dixon. If you want a good grade without too much effort, take another professor!", "rating": 3, "expected_grade": "B", "created": "2011-10-17T23:55:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon is definitely one of the better chem135 professors. She actually teaches really well but holds us to a high standard. Therefore, this class is not an easy A. You have to work hard. Her exams can be difficult but if you take good notes and go to her office hours you should do well. She has the most office hours of all professors. During lecture she can come off as a quirky and sometimes strict professor, but she is actually really nice and so DO NOT be intimidated to go to her office hours. She is there helping students almost everyday of the week. Also, she has tons of extra credit points which are easy if you spend a little bit of time on those. Do them all and it will help you in the long run. She curves the entire course. I think 75% and higher is an A. But she is really fast during lectures and sometimes the taught material might just go right over your head but she answers questions in class during lectures. Ask questions if you don't grasp the materials. But one major drawback is that she expects us to have a decent grasp of basic chem coming into this class. Sometimes I felt like she was referring to AP Chem because the things she said I should have known from high school chem, I didn't know and sadly I never took AP Chem but still I ended up doing well in the class. So, she tends gloss over stuff sometimes. But be warned that Dr. Dixon teaches organic chem in a gen chem class. Organic chem can be overwhelming but if you study its not bad. The engineering school apparently wants student to have seen some basic orgo chem stuff, thats why she taught it. If you are a CHEMICAL OR BIO ENGINEERING student, I would recommend taking her because she gives an overview of some organic chem concept which  should help us with organic chem courses that we have to take after chem135. If you aren't that interested in Chem, don't take her. If you love Chem, take her. She'll make you love Chemistry more. She is awesome.", "rating": 5, "expected_grade": "A+", "created": "2011-10-06T03:27:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "If you have a solid background in chemistry, then definitely take Dixon (because you will probably love her).\n\r\nIf you DO NOT have a solid high school background in chemistry, then DO NOT take Dixon. Although there are no prerequisites for the course, she assumes that everyone understands chemistry coming in, and builds off this general knowledge that everybody [should] have... which meant I had to outline each of the textbook chapters, just to have some sort of context for understanding the notes we took in class.\n\r\nShe does curve significantly (if you get at least a 50% in the course, you should finish with at least a C). If you receive a grade on the final higher than the grade you had in the class before the final, then she will bump your grade up  (i.e. if you started with a C, an A or B on the final will but you up to a B for the semester.) If you have an A before the final then she will just figure the final into your grade, as it would be for any other class. My issue with this policy is that she refused to tell students the total points they needed on the final to get a specific letter grade (even after it was over), and she wouldn't  tell students the total points they needed to get a specific grade in the class (even after all assignments had been handed in and graded). Is that even legal?\n\r\nI put significantly more effort into this course than my other classes, and still only received a B. If you take her, definitely go over your tests to check for grading mistakes.", "rating": 2, "expected_grade": "B", "created": "2011-07-17T17:56:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon is THE BEST chemistry teacher there is at UMD. Her class is going to be TONS of work and you'll have to put in a lot of time, so don't go in expecting it to be a walk in the park. \n\r\nThat being said, this woman is one of the nicest professors I've ever had. At her office hours, she'll give you a bit of tough love and push you to make you figure things out on your own, but you'll always leave feeling a thousand times better and completely understanding the material. Her tests and quizzes are pretty difficult, but there is a curve because of it.\n\r\nI would definitely recommend Dixon to anyone who has to take chem131, chem135, or the orgos. You'll learn so much! Also, if your TA is Lenea Stocker, GO TO HER! She'll help you out a great deal as well. ", "rating": 5, "expected_grade": "", "created": "2011-07-05T22:16:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon is really nice and approachable. However, she makes the class unnecessarily difficult. Organic chemistry is her baby so she incorporates a lot of that into Gen Chem, that she also unfortunately tests on. She likes to write exam questions about exceptions to general chemistry rules, so watch out for that.\r\nDixon also offers a lot of extra credit. Homework is not mandatory for her class, and I never did any. However, if you complete most of the online homework assignments, you get bonus points at the end. She also assigns extra credit assignments randomly throughout the semester, worth anything from like 2-10 points. She gave the option of a 10 extra credit point assignment just to tell her whether Duracel or Energizer made better batteries. No sources, no explanation, nothing else required. Just which one is better.\r\nDixon doesn't use the book to teach. She's a great lecturer. She also periodically sends out homework questions for practice that she writes herself. If you take her, you don't need the book unless you think you'll really do the extra reading or practice problems (besides the problems that she sends out, or is on Mastering Chemistry your usual online homework)\r\nIn addition to all the extra credit, she also has a big curve at the end (about 20%). Having taken AP Chemistry and Chem131, I had no trouble in this class, but my general impression is that most people struggled a lot with Dr. Dixon. Her exam averages are usually low (50-60). However, if you want to learn a lot of chemistry, take her.", "rating": 5, "expected_grade": "A", "created": "2011-05-19T16:39:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "I am dedicating my OUR UMD account to Dr. Dixon. She is possibly the worst teacher i have ever had. She expects you to know organic chemistry till your brain is dead...and does not do anything from the book. Shes just terrible.", "rating": 1, "expected_grade": "F", "created": "2011-05-04T21:00:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "DO NOT TAKE DIXON\r\nunless you are amazing at organic chemistry (Yes I am aware this was supposed to be a general chemistry class) and even then you'll want to die like the puppies she eats\n\r\nShe has a vendetta against engineering students. She refers to them as \"you people\" and has said \"You guys are the stupidest engineering class I've ever seen.\" In our half a semester, we have covered more than those who have taken general chemistry I and orgo I. I asked a friend in Orgo II for help and his response was \"I've never seen a problem like this before in my life.\" \n\r\nIt is unfortunate that ourumd requires a rating of at least one star as she hasn't even earned that.\n\r\nShe constantly complains that the Chemistry Department is not allowing her to teach Orgo next semester and seems to be taking it out on us.\r\nIn her office hours, there were ten students from CHEM135 and two from CHEM231. She spent her entire time with us sitting directly next to the students in Orgo, leaving the CHEM135 students to fend for themselves, like her children in the back of the lecture hall. \n\r\nIf anyone reads this, please help me. I'm DIENE... chem joke, if you don't get it, don't take her. If you do get it, don't take her. You will probably consider to be one of the worst decisions in your life thus far... If you survive. ", "rating": 1, "expected_grade": "A", "created": "2011-04-07T00:13:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Some days I loved Ms Dixon, but most days I hated her.  She made exams very stressful by yelling random things in the middle of the test like \"I have written the names of the people who I have no quiz 6 grade for.\"  She taught too quickly.  She gave clicker questions but never gave enough time to answer.  I would have had trouble if I had not taken AP chemistry.  ", "rating": 2, "expected_grade": "A", "created": "2011-01-16T21:32:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "I had a low B but I got an A on the final and she gave me an A for the course.  Her tests can be tricky, but she has a fair curve to compensate for them.  She is able to control the class quite well too.  She also grades extremely fast.  Overall she puts in so much extra work to help you, which is uncommon for an intro class.", "rating": 5, "expected_grade": "A", "created": "2010-12-17T17:31:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon knows her material very well. I think she could a couple more examples when teaching, but I understnad that she is stressed for time. She wants her students to understand, but they need to come to her for help.\r\nI would strongly recommed her if you have taken AP Chem in High School. She sometimes teaches and than mentions that what she is currently teaching is something that should just be review from high school and that she's not going to go into it. \r\nAP Chem was not offered at my High School, and a lot of the material was new to me, so I was lost through out a lot of the lessons.\r\nThe tests and quizzes are pretty straight forward, though hard. She curves a lot at the end, and extra credit is available in the form of questions she gives during class to be completed and emailed to her at night. \n", "rating": 3, "expected_grade": "B", "created": "2010-12-16T02:29:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "the hard facts are...\r\nnice lady, funny quirky\r\nvery hard exams and decently hard quizzes\r\nneed to go to all lectures\r\ndiscussion is useless form the most part", "rating": 4, "expected_grade": "B-", "created": "2010-10-31T20:45:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "While Dixon is definitely, shall we say, quirky, she really is a good professor. She moves quickly, but she knows exactly how to efficiently use the blackboard- which makes it really easy to take notes.\r\nHer exams and quizzes are not easy, by any means, but they are definitely fair. She also curves a tremendous amount- if you get 50% uncurved, you can expect to walk away from the class with a C.", "rating": 5, "expected_grade": "", "created": "2010-08-31T20:38:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "She makes lecture at least a little fun, and is always very sparky and preppy. As students, you can mess with her and she'll go with it. She teaches very fast, which was probaly my biggest complaint, and not really by the book at all, although before tests it may help to find the corresponding chapters in the book to review.\n\r\nHowever, what she teaches is what you need to know. Go to lecture and take good notes. Don't go to discussion; I found it a complete waste of time after going the first time and didn't go again except to pick up tests and quizes.\n\r\nShe gives mad extra credit and weekly quizes (non graded) that are good study material for the actual in-class quizzes, which aren't bad and shouldn't affect your total grade too much. The tests are the main part of the grade.\n\r\nAlso, she had a HUGE curve. I think a 73 % was considered and A, and she had a policy that said as long as you earned half the points in the class, you would pass, so basically a 50% was a C.", "rating": 4, "expected_grade": "A+", "created": "2010-07-10T14:43:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Love Dixon! She's a good teacher, she'll always answer your questions. Go to lecture, they're worth going to. She'll make lecture fun too. She ocasionally do clicker questions, so watch out for that. ", "rating": 5, "expected_grade": "A", "created": "2010-05-20T17:02:00Z"}, {"professor": "John Ondov", "course": "CHEM135", "review": "I did well in the class, but no thanks to Dr. Ondov. He's not a bad guy, and you can tell that he's trying, but his lectures are all over the place. He makes mistakes a lot and his thinking is hard to follow. His tests really aren't too bad, but if you're expecting to learn the material from lecture, you'll do poorly. Luckily, I took the AP in high school so I already knew most of the material.", "rating": 2, "expected_grade": "A+", "created": "2014-07-07T14:38:00Z"}, {"professor": "John Ondov", "course": "CHEM135", "review": "This is supposed to be an introductory course for students seeking to enter the engineering program. Unfortunately, the majority of this class will most likely need to retake this course. His lectures are terrible; he reads off of power points that are impossible to logically follow, and any time that there is something you want to write down he glosses over the subject and launches into another incoherent rant. The home work is way too advanced, and the book isn't much help either.  For the most part, students are on their own. \"His\" tests usually consist of half of another professor's test and a few problems that would take a good 15 minutes to solve alone. You'll also probably only get about half an hour for the exams because he screwed up the seating chart or something stupid like that. Our last exam was about a 57% average.\n\r\nThe takeaway: look for another professor. If there isn't another one available, hold off for the next semester.\n\r\nOne more thing; if you intend to be a civil engineer, just know that he especially despises civil engineers.", "rating": 1, "expected_grade": "D", "created": "2014-04-05T17:50:00Z"}, {"professor": "Michelle Brooks", "course": "CHEM135", "review": "I took AP Chem in high school and got a 4, which I thought was pretty good. The School of Engineering only gives credit for 5's, so they still made me take 135, which was basically everything I learned in high school. As you can obviously tell, this class was an incredible waste of my time. I will say, Dr. Brook's patience with our class was impressive, considering how downright rude we were. That being said, her lectures were still mediocre, and I learned way more in high school than in this class.", "rating": 1, "expected_grade": "", "created": "2009-02-25T15:54:00Z"}, {"professor": "Michelle Brooks", "course": "CHEM135", "review": "Dr. Brooks is eclectic and amusing. She does her best to get through a large amount of material in this course, and sometimes has trouble getting it all out in an effective manner. This is largely due to the requirements placed on the course by the engineering department.  \n\r\nI thought she was remarkably patient with our class considering how disrespectful it was. Any pause was immediately filled with talking from all corners of the auditorium, making it very hard for me to hear her, even from the third row. \n\r\nShe is approachable and willing to help students during office hours or outside them. You can generally get a few more points out of her on tests.  \n\r\nYou will get through this course if you try. It isn't supposed to be easy, it is intended to weed out people who don't want to be engineers. Once it's done, you don't have to take any more chemistry if you don't want to.  ", "rating": 4, "expected_grade": "A", "created": "2008-06-09T16:16:00Z"}, {"professor": "Michelle Brooks", "course": "CHEM135", "review": "She tries to make everything harder in this class because she doesn't like having to teach engineering students and she feels as though they should be put through hell. In general, she is a ***** and I would definately not recommend her at all. Her tests are extremely hard (averages around a 50) and the grading is usually messed up on them. Homework is also hard. Try and get another teacher...", "rating": 2, "expected_grade": "A", "created": "2008-05-22T12:56:00Z"}, {"professor": "Natalia White", "course": "CHEM135", "review": "Not a good teacher. Reads directly from powerpoint. Puts questions on tests and homeworks that the TAs have never seen before, let alone the students. \n\r\nOften will put things on tests that were not mentioned in review. Most tests, the average was very low, below B- and not lenient on grading. \n\r\nOverall, read the book and powerpoint slides (she posts them online) on your own and you will do just as good as if you went to class.", "rating": 2, "expected_grade": "", "created": "2014-12-14T19:09:00Z"}, {"professor": "John Ondov", "course": "CHEM135", "review": "Professor Ondov is known as one of the worst professors that teach CHEM135. This is mainly due to the fact that his lectures are incredibly boring and cover way too much content. \r\n\r\nThe exams are bearable but you definitely need to be prepared for a decent grade. Beforehand, he gives you a study guide, which is nice, but unlike most professors who give you their exams from the previous semester, he only provides you with exams that are from other professors. He even informs you that there is content on these practice exams from other professors that will not be on his own exam. This makes absolutely no sense and it is super annoying. However, he does curve the exams by at least 7% (the class average on the exams has been curved to around 75%). \r\n\r\nIn general, CHEM135 is passable as long as you are committed to learning the material from the textbook. However, if you cannot, for whatever reason, get another professor to teach you CHEM135, I recommend that you just have to suck it up and attend the incredibly painful lectures because it can be somewhat beneficial to hear him in the background while getting work for other classes done.  And if you ask me, Ondov is not a terrible professor, but I would not recommend his class to anyone that I know. ", "rating": 2, "expected_grade": "B+", "created": "2017-11-30T21:40:25Z"}, {"professor": "John Ondov", "course": "CHEM135", "review": "Atrocious lecturer. Utterly incoherent and disorganized. Avoid at all costs.", "rating": 1, "expected_grade": "B+", "created": "2018-01-23T20:02:43Z"}, {"professor": "John Ondov", "course": "CHEM135", "review": "I think a lot of people exaggerate. Ondov's class is a nice introduction to college, where learning is taken into your own hands. He is a nice guy, just misunderstood. The biggest problem is his lectures are quite boring/can put you to sleep. But honestly, If you study on your own and do some practice problems, there's no reason you shouldn't get a B or higher in the class. This semester he gave out a messy exam (wasn't hard, just way too hard) but he rectified that by giving a MASSIVE curve. Even his final was easy. Honestly, the other chem135 teachers have exams that are just as bad or worse, he's not the worst you can do.", "rating": 4, "expected_grade": "B+", "created": "2018-03-01T19:24:14Z"}, {"professor": "John Ondov", "course": "CHEM135", "review": "Amazing professor. Love him", "rating": 5, "expected_grade": "", "created": "2018-04-03T05:13:17Z"}, {"professor": "Cheng Lee", "course": "CHEM135", "review": "The best thing about taking him is that tests aren't too difficult and he gives out extra credit quizzes. Extra credit quizzes can't harm your grade no matter how bad you do. They're simply added onto your exam score, so they only help you. Lee's exams are fair and straightforward, so just make sure to grind MasteringChemistry (I honestly felt the mastering chem questions were harder than his exam questions.)\r\nAs far as lecturing goes, he just reads off the slides which makes the class pretty boring. Just make sure to really understand the slides or textbook examples for this class. ", "rating": 3, "expected_grade": "A", "created": "2018-05-20T01:59:35Z"}, {"professor": "Brandon Mariano", "course": "CHEM135", "review": "Greatest GSS Leader!!!", "rating": 5, "expected_grade": "A+", "created": "2018-11-15T19:52:48Z"}, {"professor": "John Ondov", "course": "CHEM135", "review": "Yes, he can be confusing if you don't know your stuff. But, if you can follow what he's saying without letting yourself be overwhelmed, he's actually very good with explaining concepts rather than just giving you rules/equations. Yes, it can be hard to understand the takeaway of his lectures, but read the book and take thorough notes and you'll be fine. That being said, I've heard that people say he's the worst of all the chem professors (clarity-wise), so steer clear if you can. Just don't despair if you do get him.", "rating": 3, "expected_grade": "A+", "created": "2018-12-15T15:19:34Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Griffiths taught the material pretty well and kept it interesting enough that I rarely wished I wasn't there even if I wasn't engaged. Hefty curve and reasonable exams, and from what I hear of other professors is that Griffiths is a lesser of a few evils for 135", "rating": 4, "expected_grade": "A-", "created": "2018-12-18T23:05:38Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "absolutely the best professor for chem135 ", "rating": 5, "expected_grade": "A-", "created": "2018-12-19T03:35:06Z"}, {"professor": "John Ondov", "course": "CHEM135", "review": "The worst professor or teacher I have ever had. His lectures are best used for catching up on sleep. Save yourself the hassle and pick a different professor.", "rating": 1, "expected_grade": "C-", "created": "2019-01-01T22:48:50Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "She is one of my favorite professors at UMD. Hilarious, straightforward, clear, and concise. She states her expectations, gives hints during lectures, and provides useful problems during both lecture and discussion. Her exams might be harder, but that only means that the curve is higher. Get her if you can because her teaching helped me so much. For course difficulty, I would give CHEM 135 4/5, since its a very difficult class. ", "rating": 5, "expected_grade": "A", "created": "2019-01-29T14:27:12Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "She's nice but I highly recommend looking at the grade data for her. If you think you'll excel with her teaching style, then go for her. However, you'll see in the grade data she curves so majority of the students get C's", "rating": 2, "expected_grade": "", "created": "2019-05-16T18:34:34Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is a great teacher who seems to know the content very well and is very good at managing the course. Her class is difficult, but there are no curve balls or tricks on the exams, and she will even explain the topic distribution of each test ahead of time. (On the final exam, we were given whole questions ahead of time!) Attendance is mandatory, and there are graded in-class participation questions, but they are not very hard.", "rating": 5, "expected_grade": "A+", "created": "2019-06-09T03:05:13Z"}, {"professor": "Monique Koppel", "course": "CHEM135", "review": "She's average - not the best but not horrific either. Just understand as many of the given problems as you can, and you'll pass for sure.", "rating": 3, "expected_grade": "C+", "created": "2019-09-19T17:28:47Z"}, {"professor": "Matthew Thum", "course": "CHEM135", "review": "I HIGHLY recommend you avoid his classes, especially if you're an incoming freshman in your first semester. While CHEM135 is already difficult as a course, Dr. Thum doesn't make it any better - his lectures are monotonous and are not engaging - and he teaches freshman as if they were graduate students. You'd be doing a lot of frustrated self-study. ", "rating": 2, "expected_grade": "W", "created": "2019-10-07T14:19:52Z"}, {"professor": "Matthew Thum", "course": "CHEM135", "review": "Dr. Thum explains things very well and makes chemistry more understandable. I struggled in high school, but coming here I excelled because of how well he explains the topics and how engaging he is. He can move very quickly, so be prepared to study on your own. Make the most out of his office hours; he is much more personable and will take more time to explain things to you. ", "rating": 5, "expected_grade": "A", "created": "2019-11-26T00:24:43Z"}, {"professor": "Matthew Thum", "course": "CHEM135", "review": "exams be kinda hard doe", "rating": 5, "expected_grade": "A", "created": "2019-12-11T17:03:11Z"}, {"professor": "Cheng Lee", "course": "CHEM135", "review": "Exams are nearly identical to the old ones he gives you for practice. Gives extra credit pop quizzes so be sure to show up for lecture. ", "rating": 5, "expected_grade": "A+", "created": "2019-12-13T15:02:57Z"}, {"professor": "Cheng Lee", "course": "CHEM135", "review": "Cheng Lee is a grumpy man. I had accommodations for test taking and he fought me on them even though they are on the paperwork. He said I was back talking him when I was just trying to submit the accommodations paperwork. Besides that he is rude to students and very strict in class. His lectures are straight from the ppts which he provides which is nice. He tells you what will be on the test and occasionally gives out extra credit so go to lectures. I spent the lectures working on other work since he's such a boring lecturer and studied the ppts on my own. \r\n\r\nOverall he is not the best but easy to get an A in the class. ", "rating": 3, "expected_grade": "A", "created": "2019-12-16T17:18:35Z"}, {"professor": "Matthew Thum", "course": "CHEM135", "review": "He was fairly engaging in lecture, but definitely you had to take the time to learn on your own if you wanted to do well on exams because the material was a lot more from the book than from lecture. The exams were hard, but the curve at the end of the class was generous.", "rating": 4, "expected_grade": "A", "created": "2020-03-27T06:06:32Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is a really great professor! The class is challenging but she is very straightforward about what to expect on tests and teaches exactly what you need to know. And she does curve the class.", "rating": 5, "expected_grade": "B+", "created": "2020-04-02T02:01:27Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "if you can get Dr. G for CHEM135, do it. She is one of those rare professors who clearly are here because they love to teach. The class is tough but the curve is generous and there are lots of bonus points", "rating": 5, "expected_grade": "A", "created": "2020-08-10T01:09:34Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "CHEM135 is already hard, but Griffith tries her hardest to make it manageable. If you are feeling stuck like I was, go to her office hours! Shes honestly really approachable and wants to help you and wants to see you learn. Only reason I didn't do better is because I waited until it was too late. ", "rating": 4, "expected_grade": "C", "created": "2020-09-02T14:47:14Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is a fantastic professor and really cares about your learning. She takes her job as an instructor very seriously, and is willing to work hard for you as long as you show up and are respectful. I was super nervous taking chem135 because I was always so bad at chem in general, but she really helped me out in office hours and was very approachable. She expects a lot of her students, and her class is tough, but completely worth it for the quality of learning she facilitates.", "rating": 5, "expected_grade": "B", "created": "2020-11-02T20:11:50Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Dr. Stocker seems like a great person, but this class just wasn't it. Maybe it was the fact that it was online, or maybe just this course in general, but this class sucked. The tests were horrible, and that was pretty much all that was graded. There was no partial credit, and they were harder than anything we saw in lecture or in problem sets.", "rating": 2, "expected_grade": "B", "created": "2020-11-19T02:29:59Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "-10/10 made me cry many times ", "rating": 1, "expected_grade": "", "created": "2020-12-03T02:21:59Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Though I understand during this pandemic things are tough and circumstances are hard she has not adjusted to the online environment and being understanding to her students by any means. She has 800 students, which should have never happened, but access to resources is unavailable, she explicitly states to not email her concerning questions.  Her tests are extremely hard and she gives us a time limit where answering all the questions is essentially unachievable. She does not release the answers to her practice exams, which I get, there are numerous professors that do that, however, her practice exams are nothing like the ones we take. She will make corrections to the test and change the numbers of a question within the last 20 minutes and will only notify through email, so good luck making the corrections. She has redone her tests but not given us the resources to study for them. GSS sessions all have over 50 students in them and aren't effective in helping everyone's situations, in fact, the last GSS session I went to had 169 students. This being said her lectures are not bad, she covers examples and material and is fairly thorough.", "rating": 2, "expected_grade": "C-", "created": "2020-12-03T03:00:33Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "While her lecture videos are easily understandable and clearly explain concepts, her exams are infinitely more difficult. It seems like she is more concerned about making sure that cheaters won't be able to succeed that she hurts honest students too. All the exams have been impossible to finish due to lack of time. It seems like if you don't intrinsically know the answer to all the problems and actually have to think them through, it is impossible to finish within the 50 minutes given for the exam.\r\nIt is also extremely hard to contact her as all her classes are asynchronous and her office hours can fall during some of your other classes.", "rating": 1, "expected_grade": "D", "created": "2020-12-05T18:39:41Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "People love to hate on her because the course is difficult but really that should be expected for any chem class. She puts a lot of emphasis on speed so I advise practicing problems sets with a time limit so you get used to rushing through problems and picking out important information. Go into exams with a plan for what order to complete problems to get as many points as you can, you will run out of time so plan for that. GO TO OFFICE HOURS. She gives more exam level questions at office hours. Even if you don't have a question just go and listen and learn. She's not typically available via email which can be frustrating since she has limited office hours. In that regard I suggest relying on the GSS sessions or your TA. \r\n\r\nOverall not the greatest teacher but if you put in the work it is possible to do well in the class. ", "rating": 3, "expected_grade": "A-", "created": "2020-12-08T16:40:57Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "EVIL. Created a cheating trap that could easily be triggered by miscounting a carbon or remembering a formula commonly used in the homework. she accused 152 students of cheating on exam 2 in fall 2020, causing a ton of stress for students right around the time of final exams.", "rating": 1, "expected_grade": "B", "created": "2020-12-12T17:12:52Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "She's very nice and very straightforward in lectures, which were usually not hard to follow. Always emphasizes the most important material making it easier to study for exams. The exams were definitely tough but fair, and she always gives a generous curve. She's also lenient with make-up exams when necessary.", "rating": 5, "expected_grade": "", "created": "2020-12-20T18:06:13Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Had her for fall 2020. Goes way too far to catch cheaters and is very happy to make accusations. No trust between her and students, and created a terrible environment. Only reason she gets two stars and not one is because she is an average at best lecturer.", "rating": 2, "expected_grade": "B", "created": "2021-01-06T02:54:47Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "*class was fully online due to covid*\r\nThis class was a mess, and you're probably seeing a lot of conflicting reviews, so i'm going to do my best to explain everything.\r\nTl;dr- Dr. Stocker was dealt a bad hand by the university, but the way she handled the circumstances made it actively worse for her students this semester.\r\nThe circumstances: 800+ students, 4 TAs, 1 professor. Dr. Stocker got stuck teaching every single one of the 21 sections of chem 135 offered fall 2020. As a result, it was nearly impossible to get individual help from her or the TAs, leaving many students to turn (unsuccessfully) to GSS. Dr. Stocker also all but banned students from emailing her directly, which seems harsh at first, but after reading so many stupid questions in the groupmes from people who were just oblivious to the syllabus or her emails, seems fair. Also as a result of all the sections, Dr. Stocker released lectures MWF (even for people who signed up for TuTh sections, but it was pre recorded, so whatever), and the TAs moved their discussion times.\r\nTeaching style: The lectures themselves were pretty good. All were pre recorded and uploaded to panopto, and she tended to stick within the 50 minute time frame. They could be a bit boring at times, and a bit heavy on organic chemistry (she wants to be an orgo teacher, and it shows), but overall better than what you'd expect considering the rest of the class. The discussions were lowkey useless, and I started skipping pretty early on. Dr. Stocker also released practice sets for every topic. DO THEM!!!\r\nGrading: The chem department likes to give impossible tests and then a crazy curve, and Stocker is no exception. My 82% turned into an A. Unfortunately, info about the curve is very poorly communicated. She doesn't release estimates of final grade cutoffs. After each exam, she releases 2 sample grade cutoffs. One tells you an estimated letter grade of the exam you just took, based on points. These give students the illusion of hope, since exam grades tend to have means around 50-60%, but since only the overall grade is curved, these are functionally useless. The other set of grade cutoffs tells you your estimated letter grade in the class as of that exam. For some reason, she makes you manually add up points on just some assignments, instead of just using the percentages that elms auto generates. It's just annoying.\r\nExams: Since Stocker had 800 students, she couldn't manually grade exams. Instead, she used the quiz feature on elms to give exams that were all multiple choice/drop down/check all/etc. Anything that could auto grade. This meant you got your grade instantly, but there was no partial credit. All exams were on an insane time crunch designed to make the averages low. Exams were given at 7 PM EST, regardless of section, unless you had another class at that time. She didn't proctor the exams (too many students for zoom), which led to more creative (read: annoying) ways to catch cheating.\r\nThe cheating allegations: THIS IS WHAT BROKE THE CLASS!!! Exam 2 had 2 bait questions, where she gave a real chemical name, but changed the formula. This was designed to catch students googling answers. Unfortunately, a tiny mistake on the math and/or a miscount could get you the same answer as google. Every student who got the google answer was reported to OSC for cheating, and their cases were still being processed even after finals. All in all, 152 students got accused of cheating. ONE HUNDRED AND FIFTY TWO now facing an XF. WTF\r\n", "rating": 2, "expected_grade": "A", "created": "2021-01-06T02:57:15Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Had her for CHEM135 online, fall 2020. As many others have said, this class was a mess. It's not her fault that they gave her every section, forcing the lectures to be asynchronous, but it is her fault that the class was extremely disorganized, the tests were impossible, and she was very unsympathetic to the difficult nature of this semester. I choose to give her the benefit of the doubt that she's a good person who was overwhelmed by an insane amount of responsibility, but I can't recommend taking her class.", "rating": 1, "expected_grade": "B", "created": "2021-01-12T03:02:28Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Dr. Stocker is a good lecturer and helps when you ask questions. Office hours are helpful to go to. As for her teaching style, there are not really resources you can use outside her class since she just picks her own topic order. \r\nI gave her 4 stars because I think future classes with her will be better off (where she does not have 800 students). As a professor, she explains concepts well and gives practice problems that reflect the test. You need to work on the problem sets she sends out they are one of the best ways to prepare for tests. \r\nThere were a lot of issues for Fall 2020 that made the class more difficult as a lot of other reviews say but Chem135 is also designed to be a rough class. \r\n", "rating": 4, "expected_grade": "B", "created": "2021-01-19T05:01:24Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "For fall 2020 I took this. The first thing I'd say was she is a fantastic lecturer, honestly one of the best I've seen. She explains concepts very well and teaches everything you need to know, I didn't look in the textbook a single time. I just watched the lectures and did the practice worksheets, and I felt like I understood all the material.\r\n\r\nMy main problem with the class was the organization. Every discussion session was moved from whatever you signed up with, ie my section discussion was suppose to be on Wednesday, but they decided to hold it on Monday. The lectures were all just posted videos as well, but that didn't bother me too much.\r\n\r\nThe exams were difficult, but if you knew the material you'd do well after the generous curve, AVERAGE test score was around a 60%. They were made short on time purposely but open book so that if you had to go looking for every answer, you'd run out of time quickly.", "rating": 4, "expected_grade": "B", "created": "2021-01-20T00:46:10Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Dr. Stocker is a very good lecturer and her class material was very good given the circumstances. But those exams and the weight of said exams were utter B.S. Those exams were universally struggled upon, with averages being around 55% overall.", "rating": 2, "expected_grade": "C-", "created": "2021-01-28T00:16:50Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "CHEM135 Fall 2020. Professor Stocker did a really good job teaching this class and I know that a lot of students are salty bc it was an open-note class, but the exams were pretty much fine if you actually paid attention, took notes, and studied. She was a good lecturer and the concepts were really well taught, plus she does a lot of practice problems.", "rating": 5, "expected_grade": "A", "created": "2021-01-28T22:47:11Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Great professor, another perspective on her cheating \"trap\"- it wasn't really a trap. There were questions that have a chemical name, and where you can google the name to get the formula for the chemical. There was no chance that you could get the answer that you can find on google, as the correct answer with the different constants that she provided you with. And with almost 20% of the class getting caught, it's pretty clear that it wasn't \"by chance\" that they all made the same error and magically got the googled answer. Her lectures, though asynchronous, were well made, and released usually well ahead of time so we can get started on the lectures early. They were clear, provided many examples, and organized. Her exams on the other hand was definitely a bit more difficult, however your grade is relative to the other people in the class. If everyone were to get around a 20/100 on the test, around 25% or whatever % of students would get an A in the class. If everyone were to get around a 95/100, the same 25% would get an A. I personally did not get an A in the class because I honestly did not put as much effort into the class as I would have liked, but the majority of these people here (as seen in the groupme), are complaining about their grades even though they put minimal effort in the class. (didn't proofread, may have grammar mistakes)", "rating": 5, "expected_grade": "B", "created": "2021-02-06T01:39:32Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "I took this in fall 2020, it was alright at best. I can only say it was alright in hindsight because all the curves landed me an A. My biggest piece of advice is to keep up with the lectures as they're uploaded, do not put them off in any capacity if at all possible. As for the content of the lectures? She's great at explaining concepts, but none of that matters when you take her exams. She is good at explaining things, that does NOT mean she is a good professor. A good professor would prepare you for the exam content. Instead, stocker talks about organic chemistry for 15 minutes of the lecture, and the actual thing being tested for the other 10. Did a lot of people cheat? Yes, undeniably. Was Stockers method of baiting cheaters annoying? Yes, undeniably.\r\nAvoid her if at all possible, if not, just try your best, most students struggle in this class.", "rating": 2, "expected_grade": "A", "created": "2021-02-16T04:33:19Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "This class was the worst. Stocker's lectures were hard to understand and often did not give her students the full picture of what she was trying to explain. Some of the content she covered in her class was not meant for an entry-level chemistry class, which only made the class more stressful. On top of all that, her problem sets were nowhere near as challenging as the exam questions were. The exams were strenuous and ridiculously complicated, as she often made the questions multiple parts and did not provide enough time to adequately complete all the problems. She also tried to set trap problems to catch people who were cheating on her test, and ended up falsely accusing a lot of people of cheating. Unless you absolutely have to take this class, I would recommend getting a tutor or attending as many GSS sessions as possible, because just attending lectures alone will not be enough to pass. ", "rating": 1, "expected_grade": "", "created": "2021-03-04T20:58:57Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Dr. Stocker was a really great lecturer. I had her fall 2020, and all of our lectures were asynchronous but very helpful. She also provided lots of examples and opportunities to practice the material which lined up fairly well with exam material. Her midterms were brutal, with averages of about 60%, but the final was actually really easy. The curve is super nice, so it's easier to snag an A than you might expect. You do need to put in the work to get an A though. Again, her midterms are brutal.", "rating": 5, "expected_grade": "A", "created": "2021-03-24T01:14:05Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Lenea had an attitude from the start. She shuts down students and instills a sense of fear into them. The class was very uncomfortable, to say. She definitely has her intentions. Also, exams are NUTS and extremely difficult.", "rating": 2, "expected_grade": "B-", "created": "2021-04-02T03:35:01Z"}, {"professor": "Lenea Stocker", "course": "CHEM135", "review": "Dr. Stocker is a really great professor. She does a really good job at explaining concepts clearly and her exams are difficult but not impossible, CHEM135 is just a lot of material so there's a lot to memorize and understand. She also gives a lot of really good material to study for the exam; many worksheets and practice exams. If you put the work in to understand the concepts and study before the exam, you can get an A, but 135 is a weed out class for engineers and covers a lot b/c it's the only chem class a lot of engineers have to take, it's not her fault there's so much to teach.", "rating": 5, "expected_grade": "A", "created": "2021-04-20T18:42:02Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon: Ahhh... where do I start. I feel very mixed about Dr. Dixon. She definitely feels like a fun person. At times, I felt like she was out to get us, but other times she was patient and listened to our concerns. She has a messy gradebook (a pet peeve of mine), but come a month from the end of term, she helps explain standings so you can get a grip of where you're out. She covers material pretty quickly and REALLY EMPHASIZES orgo, which is a pain for engineers lol. Some good points are that she makes asynchronous videos and gives out extra credit (DO THEM!!!). She does go over material in depth so you have an understanding, I just think she doesn't go too in detail on how to actually apply that knowledge in questions, but after doing non-graded problem sets and homework, it works out.\r\n\r\nCHEM135: The class goes fast. High school knowledge won't carry you too far. With Bonnie, you're going to have to put in the effort, but its worth it. Compared to Stocker, I feel she cares more and teaches WAY better. I always ran into a timing issue on my tests, walked away feeling like I failed, but always got above average! Dedicate TIME and energy to this class, and do all non-graded problem sets too! I went in just needing a C- or better and now I'm currently at an A before the final! Just know what the class is about, go in with a good productive attitude, and you'll be set!", "rating": 3, "expected_grade": "B", "created": "2021-04-29T03:56:29Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "First, and foremost let me be clear that CHEM 135 is ABSOLUTELY BRUTAL no matter who you get. This class is so poorly designed and structured to set people up to fail and the order of topics covered makes no sense at all. If you have never taken AP Chem or if you have not taken chem recently (or not taken chem at all) then this class can become a nightmare. However, she did a great job at explaining things and trying to accommodate students. She rushes through the majority of the work however that is the fault of the pace of the class, not hers. Attendance is necessary. She gave students 1 index card of notes during exams. To make up for the difficulty of the class she does a pretty generous curve at the end of the year, somewhere around 15%. Assuming you do all your classwork attendance participation and homework and score around a 50 or 60 on all your exams you can pass because of said curve despite those horrible test scores.", "rating": 5, "expected_grade": "B+", "created": "2021-10-12T04:17:37Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith explains things very simply and eloquently. The content in class generally lacks depth, but it is sufficient for an introductory course and the exams. The pacing is relatively fast, but not unmanageably so. I think some of the topics are covered too quickly, which makes it difficult to do problems without supplementing your knowledge with a textbook or online sources (e.g. hybridization). \r\n\r\nExam average this year is a low-to-mid C, which isn't as disastrous as previous years, and better than most of my other classes. I heard the curve is relatively generous, and Dr. Griffith wants people to be as successful as possible. Exam formats are handed out before exam day, and exam difficulty is very similar to previous years and pretty straightforward. Discussions are good for practicing problems.", "rating": 5, "expected_grade": "A+", "created": "2021-11-01T18:53:46Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "She is a really good teacher! You can tell that she really loves her job and that is seen in her teaching. She explains things really well and wants everyone to have a good understanding of the material. Her lectures are very clear and she does a lot of examples and a lot of them are similar to what will be seen on the exams. She even let us have a notecard that we can write stuff on for each exam. She also provides a lot of previous exams to practice with which a very very similar to what your exam will be like. SO I really recommended on studying with them. She also host review sessions before each exam which are really helpful and she brings the answer keys to all her previous exams.\r\n\r\nSo overall if you can take her for CHEM take her. \r\nIt is a hard class but she makes it a little easier and she curves it really well. \r\nThis is coming from someone that didn't take AP chem in high school.", "rating": 5, "expected_grade": "A", "created": "2021-11-18T00:54:39Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I started off with Dr. Koppel and the beginning of the semester but for some reason she stopped teaching and our class now has Griffith. Her teaching style is a million times better than Koppel. She reminds me of a high school teacher in that even in a lecture with 200+ students she tries her best to engage students, answer all questions, and make sure students are following along. She has a great sense of humor and makes the class itself tolerable. Her online lecture videos are almost better than in person because you can pause the videos and go at your own speed. It's difficult to be a good professor for such a difficult and unfair class as CHEM135 but Griffith does a very good job. I'd highly recommend.", "rating": 5, "expected_grade": "B-", "created": "2021-11-22T17:24:56Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "AMAZING PROF\r\nyou have to go to class!!!!!!!\r\nyou have to study in class notes to do good on exams\r\nexams are 8-10 easier multiple choice or write ins then 1-2 problems that are CHALLENGING and require knowledge and work \r\ndiscussion worksheets are optional practice to do with your TA, i personally have an A- before finals and have never done one discussion worksheet. \r\n", "rating": 5, "expected_grade": "B+", "created": "2021-12-06T13:57:29Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Amazing Professor, is new but great.  You want him.  His teaching is good, very understanding and flexible.  Does Learning catalytics which help you understand content and is easy grade boost.  Midterms are scary and hard but also has a very generous curve.  ", "rating": 5, "expected_grade": "B+", "created": "2021-12-06T19:41:58Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Dr. Pacella did an amazing job teaching with the content he was given in Chem135. I think the video lectures were immensely helpful and that his teaching style was very engaging and easy to follow. He is a great person and a great teacher that covered a hard class pretty well.", "rating": 4, "expected_grade": "B+", "created": "2021-12-06T19:46:53Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": " The literal Goat, Dr. Pacella is the nicest professor I had freshman year. His explanations are top notch and unmatched. If you have questions, go to office hours and he will definitely help you out.  There is so much content in the course that it is important to study on your own before tests. He provides tons of review material. If you put in the work, you will see results on the exams. In regards to the exams, they are some what difficult. They will really challenge your understanding of the topics. Just make sure to study and you will be just fine. (I got his final next week so hopefully all goes well). ", "rating": 5, "expected_grade": "", "created": "2021-12-06T19:51:49Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "This class (CHEM135) is definitely a hard class regardless of what teacher you have, but taking Griffith is such a blessing. The difference between her and other teachers is that she actually wants you to succeed in the class and gives you multiple opportunities to do so (has a decent amount of extra credit opportunities, hold exam review sessions, gives previous exams,  gives fair curves, etc.). Although her lectures can hold a lot of information, she tries to make sure that the class understands the material before moving on, creating different ways to explain a topic, or simply writing out how to do different processes rather than most teachers who just read off slides. She is the best teacher I've had at UMD so far, and would highly recommend taking her for this course.", "rating": 5, "expected_grade": "B+", "created": "2021-12-07T19:05:35Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "He is really the best. This man does no wrong. But with that being said one cannot pass this class without investing time to learn the material. I mean lots of time. As long as you're trying, he will 100% be your best bet!", "rating": 5, "expected_grade": "", "created": "2021-12-09T19:48:07Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Great teacher for just how hard chemistry is. Explains very well and wants to make sure you learn. If you go to office hours for a question, you will walk out understanding the answer and the topic. Gives a good amount of credit and is a very valid grader. He gives practice problems for each exam that actually relate to the exam, so always do those. Please take him!", "rating": 5, "expected_grade": "", "created": "2021-12-10T04:29:05Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is an excellent teacher who did her best to keep us all engaged the entire year.  She tries her best to make everyone understand the content, and wants to see people do well.  She even openly acknowledged that people wouldn't be as interested in chem, and has this class designed to see people pass.  She makes it clear that she wants her students to be engaged, and sometimes class is even fun!  She always comes to class full of energy, with a smile on her face, excited to teach a subject that she very clearly enjoys, and successfully makes a huge lecture actually enjoyable, not droning on like other teachers sometimes do.  I would very highly recommend Griffith for chem, as she is a superb chemistry teacher.", "rating": 5, "expected_grade": "A", "created": "2021-12-10T14:25:52Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Literally the best professor I ever had. She made this awful course somewhat ok. If you have to take this course make sure you take it from her. I had Dr. Koppel at begging but for some reason the instructor changed to Dr. Griffith. I thought I was going to fail when I had Dr. Koppel but with Dr. Griffith I am pretty sure I will get an A. ", "rating": 5, "expected_grade": "A", "created": "2021-12-10T18:39:37Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Amazing teacher that genuinely cares for each and every student. The class itself goes very fast and is difficult but with the resources that Dr. Pacella gives you, it is absolutely passable. That being said, you need to put the time and effort into the course or else you will be behind very quickly. There are textbook readings, video lectures, and in person lectures with in class participation points on the content. If you have any questions, GO TO OFFICE HOURS, Dr. Pacella will talk to you and answer your question(s) until you understand. As well, he will explain a certain subject as many times as necessary. He makes practice exams and give you access to past exams with challenging questions that prepare for every exam. He is a great human being and an even better Professor, I definitely recommend taking him. ", "rating": 5, "expected_grade": "", "created": "2021-12-13T22:43:37Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Dr. Pacella is a very nice person and will do his best to help you pass and understand the course. That being said, while the other reviews are raving about his teaching style, I would recommend taking Griffth and avoiding Pacella. His explanations are convoluted and he has a hard time simplifying hard concepts into a vocabulary that students can understand. It is easy to become distracted in lecture when you have to sit there and mentally define every other word. I would be the first to admit that chemistry is not my forte. However, I have spent an insane amount of time studying for this class in hopes of passing. I have to study a month out before every midterm because Dr. Pacella seems to delight in multi-step word problems that are extremely hard and force you to scramble to apply the content in ways you have never tried and you hope will work. Dr. Pacella tries his best to help during office hours and is very accommodating, however, even then he struggles to explain. I feel bad writing this review because he is such a nice person but I feel obliged to give future students a warning that it is not all sunshine and rainbows.", "rating": 2, "expected_grade": "", "created": "2021-12-13T22:54:31Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Dr. Pacella is a great professor, and I will even go to say that he is the best chem 135 professor currently when I am writing this review. He is so helpful and cares about his students. Also if you are an engineering major I highly recommend taking Pacella. Dr. Pacella makes chem 135 manageable if you put in the time and effort into learning the material taught.", "rating": 5, "expected_grade": "A", "created": "2021-12-16T02:54:05Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Pacella is great and caring and is best possible professor for this course. Hey, whoever gave him a 2 star, youre lying. This must've been a prank right. The person who gave a 2 star probably talks during lectures. Office hours help tremendously and will double your midterm/final exam score if you go to those. He makes you understand concepts that you weren't strong on and had questions with. \r\n'", "rating": 5, "expected_grade": "", "created": "2021-12-17T20:36:11Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Dr. P was the man, hes a great teacher and if you try hard enough you can get an A.  His expectations are well laid out.", "rating": 5, "expected_grade": "A+", "created": "2021-12-17T22:55:07Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I really enjoyed having professor Griffith for CHEM135. She was energetic and was very flexible with the class and made chemistry as entertaining as chemistry can be. ", "rating": 5, "expected_grade": "A", "created": "2021-12-18T00:20:14Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Great professor. The course itself is very fast, but Pacella takes the time outside of lecture to help anyone who needs it through office hours, discord, and review sessions before exams. He truly cares for each student and I highly recommend him for this course", "rating": 5, "expected_grade": "", "created": "2021-12-18T01:15:36Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "I believe that Dr. Pacella's teaching method and appreciation for his students makes him an amazing professor. Generally his tests are fair (although they are pretty difficult) and he gives you a good amount of resources to study with. Anty complaints I've ever had with chemistry revolve more around the curriculm rather than the teacher, and the fact that Dr. Pacella was able to teach such a ridiculous course so well is a testament to his ability. He has his quirks, and sometimes he doesn't explain things the greatest way in lecture, but if you ask questions he makes sure to try and answer them so you understand. \r\n\r\nEven so, Chem135 is a difficult course, so dont expect a cakewalk. but expect to be supported by a great teacher.\r\n", "rating": 5, "expected_grade": "", "created": "2021-12-18T03:17:13Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Dr. Pacella is a great teacher who truly cares about his students. I think this was his first year teaching here but he was very professional and good at making the class enjoyable. He has ample resources to making you succeed in the class and won't hesitate to answer any questions you have if you are struggling. I also enjoyed how he gives \"engineer specific\" questions in his free response questions, it truly shows how thoughtful he is in teaching the course and it's kind of funny.", "rating": 5, "expected_grade": "A", "created": "2021-12-20T22:41:42Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr.Griffith is definitely the teacher to take for CHEM 135. She always seems excited to teach the material, and her exams test you on your ability to understand the underlying concepts for each topic rather than just memorize them. \r\n\r\nShe also gives plenty of opportunities for her students to meet with her, and is very quick to respond to emails. \r\n\r\nTLDR; she wants you to do well and I think that's a pretty desirable trait for a professor.", "rating": 5, "expected_grade": "B+", "created": "2021-12-21T00:48:24Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I highly recommend Dr. Griffith for CHEM135. \r\n\r\nCHEM135 is a hard class. It goes lightening speed and there is A LOT of material that needs to be covered which can be confusing. I was having a hard time keeping up even though I took AP Chem in high school. Having said all this, I believe Dr. Griffith is the only professor capable of going over this material all while making it comprehensible. She gives AMAZING examples which really help us understand the mountain of information we were presented with. Not to mention the practice problems and discussion worksheets she gives are almost always identical to the problems you will see on exams. So as long as you try your best to understand the practice problems she provides you with, you will do well on her exams. Now lets say you don't do well (which is bound to happen at one point or another), Dr. Griffith provides a very generous curve to the class at the end of the semester. \r\n\r\nNot an easy A class, but Dr. Griffith makes that A possible. Good luck :)", "rating": 5, "expected_grade": "A", "created": "2021-12-21T03:39:04Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Pacella was the best professor I have had so far. CHEM135 is a hard course and moves extremely quickly but he gives you a lot of practice. He offers textbook readings, in class participation points for a grade boost, online videos, discord, held office hours all the time, gave exam practice, and held review sessions for every exam. Very approachable professor and will make sure you understand the material. The exams are difficult involving multiple choice questions and very long, difficult word problems but he gives a very generous curve depending on what the class average is. Take a lot of time to study for all exams! All in all you want this professor.", "rating": 5, "expected_grade": "B", "created": "2021-12-21T03:55:57Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I initially started with Dr. Koppel until she left and Griffith replaced her for the rest of the semester. This was a MIRACLE in disguise because Griffith taught exponentially better than Koppel. She always came to class energetic and ready to teach. She empathizes with her students as many engineers dislike CHEM135 by making the class more bearable, like giving use notecards on the exams. Although her midterms/exams are definitely harder, she goes through many examples during lectures and always gives us a chance to try the question first before she solves it. My tip for the class would be to go through previous midterms and practice them to study. 12/10 would take again", "rating": 5, "expected_grade": "A", "created": "2021-12-21T18:09:00Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Pacella is definitely one of the nicest professors I have ever come across. CHEM135 is supposed to be a nightmare for engineering majors and is often considered a \"weed-out course\" but after hearing things from friends who have Griffith and comparing her with Pacella, it is clear that Pacella is the way to go.\r\n\r\nPros:\r\n- There is an insane curve for this class. I did decently well on the first midterm (A) but FAILED the last two midterms (D & E). However, I have an A on my transcript for this class because an 80% was the cutoff for an A letter grade this semester.\r\n- Pacella does \"clicker questions\" through a website called Learning Catalytics and they are easy points to boost your grade. This does mean you have to go to lectures to know when the questions go live. You even get half credit for each question just for participating and submitting an answer. For example, if there were 4 Learning Catalytics questions in a given lecture and you happened to submit an answer for every question but they were all wrong, you would still get a 2/4 for that day. Pacella drops the lowest few Learning Catalytics sessions from your overall grade at the end of the semester. Also, since Pacella is such a nice person, he will frequently announce that a Learning Catalytics session will be fully participation points for some days (ex: after an exam date or after a confusing lecture)\r\n- The textbook is online and interactive through Pearson which is helpful. Do NOT fall behind on reading because Pacella will assign chapters to read but it is extremely easy to get away with not reading which becomes a horrible habit. You must purchase the textbook for this class because the online homework comes with the package.\r\n- There are weekly online homeworks based on the readings. Pacella drops the lowest to help your grade.\r\n- There are 3 midterms and one final. In the case that you do better on the final exam than you did on one of the midterms, your final exam score will replace your lowest midterm exam score. THIS. SAVED. ME.\r\n\r\nCons:\r\n- Not necessarily a complaint regarding the professor but there is a whole crap ton of material for this class. The curriculum for this class is similar to the content covered in AP Chemistry from high school... Only about 5x as fast.\r\n- The midterms are HARD. I often found myself studying for over a week on these exams yet still receiving the scores that I mentioned previously. On the first midterm the class average was a B but that quickly dropped to a class average of a D on the second and third midterms. Our second midterm also had way too many questions to be able to do in 50 minutes. Pacella even sent out an email to the class to apologize for how lengthy it was. However, the curve for the class was adjusted to compensate for this.\r\n- Occasionally, it would be difficult to fully understand what Pacella was lecturing about. He is extremely knowledgable and it is possible that he forgets that he is lecturing to a class full of majority freshman students who are learning these concepts for the first time. This is a rare complaint though. Most of the time, his lectures are very informative.\r\n- It is pretty easy to pass the class and pull even an A. What would be an E (55%) in another class was considered passing and curved to a (C), based on the curve we were given. (This will most likely change based on how YOUR class performs on midterms). Because of this, I don't know how much I truly retained from this class.\r\n\r\nOverall, I think Pacella is the way to go for CHEM135. He makes what would be the most atrocious and painful class of your first semester in college a decently fair and doable class.", "rating": 4, "expected_grade": "A", "created": "2021-12-22T19:54:18Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Very good professor. Easy to communicate with and is very understanding. Of course, CHEM135 is a decently challenging course and will take a good amount of leg work and preparation. Pacella helps with every exam by providing practice exams that are pretty relatable to the real exam, all you have to do is do the practice exam and know how to approach the problems. His lectures are slowed down and put online and you are supposed to watch them before every class, and he basically zooms through the same slides during in-class lectures. His lectures are pretty straightforward and he is very open to questions and has a positive attitude towards his students. His grading is also very fair and he does give a good amount of points for partial work, but do not forget to write the oxidation states of elements when you get to that chapter, because you will lose full points for not writing it down. Overall, this class is designed to see if you are really about that Engineering life and whether or not you can put in the effort and succeed in a difficult class. It is not a piece of cake and you will have to study a fair amount to be able to get those exam grades up, but if you actually listen to his lectures and do the practice exams, I can almost guarantee a B-/C+ at the bare minimum. If you already have a solid chemistry foundation, then all you have to do is do the practice exams and pay attention to the difficult stuff during lectures and then you will get an A. The class is very similar to AP Chemistry except it's a lot more fast-paced, so if you have taken that class it is very comparable. Anyways, just listen to his lectures and do the practice exams, and you are golden. ", "rating": 5, "expected_grade": "", "created": "2021-12-23T04:27:08Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I highly recommend Dr. Griffith for CHEM135.\r\n\r\nShe is an amazing person but the class is super hard. She made this awful course somewhat ok. ", "rating": 5, "expected_grade": "C+", "created": "2021-12-27T03:00:10Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Dr. Pacella is a great professor! This was his first semester teaching CHEM135, but he taught it extremely well. \r\nTo start, you need to study a LOT. I did decently well on the midterms (A+ on the first, A on the second, A on the third) because I read the textbook. IT IS ESSENTIAL TO READ THE TEXTBOOK!! A lot of questions on the tests will come from material in the textbooks and just reading the textbook will remind you of information you learned throughout the semester. I made flashcards to reinforce concepts for the first midterm, but I don't think that is necessary anymore. Overall, watch the lectures/take notes and read the textbook and you'll be fine.", "rating": 5, "expected_grade": "A+", "created": "2021-12-30T17:39:19Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "My grade really suprised me, very generous curve. Understands that the people who take chem135 do not care about chemistry and just want to pass. ", "rating": 5, "expected_grade": "B-", "created": "2021-12-31T01:56:12Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I heard a lot of bad reviews about CHEM135 before going into this class, and was completely surprised when I enjoyed class. TAKE GRIFFITH SHE IS AMAZING (plus the curve was insane). She is very organized, understands the concepts, sometimes jokes around, and adjusts to the needs of the class. If you took ap chem, you will be fine because it will all be review. The hw assignments are mastering chemistry (aka they take a long time and are boring) do yourself a favor and break up the hw into sections and don't do it last minute. ", "rating": 5, "expected_grade": "A", "created": "2022-01-07T20:11:46Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Dr Pacella is an amazing professor! His lectures go over the slides that he prepares. He makes video lectures of some slides that cover the main content. WATCH THE VIDEO LECTURES BEFORE CLASS! I didn't find the text book super useful. I found the slides much more helpful (maybe personal preference). Not that many people went to discussion, although mine was at 8am. To make the most of discussion, have questions for the TA. If you take that initiative, it can be like private tutoring. \r\nMidterms are tough, but the practice tests were very similar to the midterms. Same for final. Study early. \r\n", "rating": 5, "expected_grade": "A+", "created": "2022-01-07T22:30:49Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Despite my relatively low grade compared to most other reviewers here, I cannot recommend Dr. Pacella enough. He is an absolutely wonderful teacher, and curves VERY generously. Just to give you an idea of how well curved the class was, I got a D, F, and D on the 3 midterms, and yet I still got away with a B- in the end. However I did manage to get a B on the final due to a ton of studying so honestly I barely passed that threshold. The class is very difficult. You NEED to read the textbook and watch the video lectures BEFORE class. You may think it is optional, but if you truly want to succeed in this class you will need to use all the resources given to you. I did not do any of this, and as such a I struggled a ton during the class. Do not do the same mistakes I did. As long as you study at least 2 weeks before each test, and study efficiently, while using the textbook, you will do great. This class is hard but Dr Pacella gives you all the resources needed to succeed. Its simply up to you to use them to their full potential. ", "rating": 5, "expected_grade": "B-", "created": "2022-01-08T20:22:51Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith was very accommodating, giving extra credit and pushing back homework assignments. Tests were fair, would give an outline of each test the lecture before. Definitely recommend.", "rating": 5, "expected_grade": "A+", "created": "2022-01-12T01:46:49Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is an excellent professor who listens to the needs of the class and adjusts her lesson plans accordingly. The tests were fair for the most part and she was good about letting us know what to expect before each exam. If you are able to take her, do it!", "rating": 5, "expected_grade": "A", "created": "2022-01-12T01:49:22Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Amazing professor. He clearly cares about his students and their success. His lectures are very clear and he is open to answering questions during class. The video lectures which he posts before class asp help greatly. His practice exams and practice problems will help you prepare for the exams adequately. Also, every time I had to email him about an issue he responded quickly. I never liked Chemistry before this class but he made it easy to understand and enjoyable.", "rating": 5, "expected_grade": "A+", "created": "2022-01-17T21:47:32Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Dr. Pacella is a wonderful professor. He's always helpful in office hours and has video lectures on every chapter that you go over. It's a lot of work to be successful but his exams are fair and he is a kind person.\r\n\r\nGreat professor.", "rating": 5, "expected_grade": "A", "created": "2022-05-10T17:48:36Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Dr. Pacella is a blessing to UMD's chem department. From labs to most lecturers, chem classes and any weed out engineering class like this one is a pain, but Pacella made it great. I went to most classes because there is in class participation but you technically could do that from your room (I do not recommend this because he goes over similar types of questions right before in class). The homework was also easy. The exams were not too bad given that it is a gen chem class (I got a 97, 80, 72 and 72 on the final) and the class averages are SO low that an 85 in the class got me an A. Dr. Pacella is witty, smart, and really really caring and if you need help, he will find a way to help you just don't fall behind and you will be great. It is so easy to fall behind on videos but if you put them on 2x speed or even 1.5x, you can get through them before class and that will definitely put you ahead of the class (most people are lazy, just do above average and you will be fine!).", "rating": 5, "expected_grade": "A", "created": "2022-05-18T16:28:18Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "Great professor, he cares about the subject he's teaching which makes lectures more engaging. The video lectures he posts are essential to the class though since they teach you better than reading the book does. Also really generous with partial credit on exams. As long as you put in work in his class you can definitely pass", "rating": 5, "expected_grade": "B-", "created": "2022-05-21T00:31:15Z"}, {"professor": "Michael Pacella", "course": "CHEM135", "review": "He's very nice and very understanding of the students. He has a lot of resources for you to access and he usually replies immediately when you email him. His lecture style is interesting where you are forced to go to class and learn. He also has videos covering the material as well as he suggests that you read the textbook. I'd say that you would gain more from watching the video lectures as the concepts he chooses to cover will most likely be on the exam (i made the mistake of not watching them before the first exam and did poorly). He is super good at answering questions during class and makes it possible for even those who are shyer to ask questions without being embarrassed (by using learning catalytics). I'd totally recommend this professor but the only downside is that he speaks very slowly and that his voice can be kind of boring (it's okay in the vids because you can speed them up to 1.5 and it sounds like a regular person on 1.25 speed).", "rating": 4, "expected_grade": "B", "created": "2022-05-25T02:36:21Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "He was funny and kept the class interesting. His lecture style was a bit hard to follow but the modules he gives out are very useful.", "rating": 4, "expected_grade": "A-", "created": "2022-11-08T13:14:46.480451Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "He made class very fun with his lightheartedness but his lecture style was sometimes slightly confusing. The modules he creates are very useful in studying and to learn the material.", "rating": 5, "expected_grade": "A-", "created": "2022-11-08T13:16:57.206969Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "Great professor. Likes to make jokes and keeps it interesting. Posts prelecture videos that are super helpful for review time. Also writes his own modules which have everything you need to succeed in them, so even if lecture can be a little confusing, you have everything you need to learn in your hands. Approachable, great during office hours, and a nice guy overall.", "rating": 5, "expected_grade": "A-", "created": "2022-11-11T03:36:29.560901Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "She's a nice teacher and her work isn't too much or hard either, but she just takes too long to teach and spends a lot of time answering unnecessary questions. I had no trouble understanding the material however in this class as she made the material very digestible and easy to understand.", "rating": 4, "expected_grade": "A", "created": "2022-11-26T05:48:11.932493Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Professor Griffith's CHEM135 is hard, that's nothing new. But she is a great professor to do it with. She explains things REALLY well. Her PowerPoints are well made (and evidently haven't changed much over the years), and discussions sections are a MUST. Also gives a lot of little extra credit clicker questions and super generous with the curve. Recommend.", "rating": 4, "expected_grade": "A-", "created": "2022-12-01T01:19:13.378226Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "He's an amazing professor who provides students with all the study materials and resources they need to succeed. His modules and pre-lecture videos contain a run-down of all of the content you need to know and practice problems that prepare you for problems on the exams. Although his lectures are sometimes slightly confusing, his humor makes lectures enjoyable and he is very easy to approach.", "rating": 5, "expected_grade": "A-", "created": "2022-12-01T15:12:57.466586Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "While CHEM135 is a difficult course, Griffith explains concepts in a way that makes sense, using a lot of examples and hand writing the examples down while working through them rather than just using a PowerPoint. her PowerPoints are very thorough and useful, but the handwritten examples are even more useful. She will answer any question as completely as possible and ensure you understand the answer. Make sure to do the homeworks.", "rating": 5, "expected_grade": "D", "created": "2022-12-01T16:51:52.212144Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "Rainbolt was amazing. His grading is really fair. This is a really big factor because he really cares about your grade and is generous with his grading policy. His lectures were a little confusing, but if you watch the pre-lecture videos and use the modules he provides, you are going to do well. I personally hate chemistry, but he made the class fun. I definitely looked forward to his lectures. If you need some in-depth help, definitely utilize the office hours, he is very approachable and helpful. He genuinely cares and you will know it. He does stick specifically to what is required for the course, so that is very good thing.", "rating": 5, "expected_grade": "A", "created": "2022-12-02T00:02:17.795945Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is such a good professor. Sure, the content is hard but she makes sure to repeat concepts multiple times and answer any questions. She also does many practice problems during lecture and gives a lot of study material. Her old exams are almost identical to the ones you take in class. She is also extremely personable. She likes to banter and make jokes in class which definitely makes chemistry more enjoyable. She is easily one of the best professors here at UMD. She genuinely cares about the students doing well and always makes herself available to help with any material you may be struggling with. She also posts videos on ELMS so if you miss lecture, you can watch the videos. Do yourself a favor and take her class, I haven't taken chem in years and I somehow did really well in this class .", "rating": 5, "expected_grade": "B+", "created": "2022-12-02T02:25:06.597205Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "Really good at teaching and explaining chemistry concepts. He occasionally can be a little condescending, but it doesn't get in the way of him explaining things well. He also makes super helpful modules and pre-lecture videos. He's also funny and likable.", "rating": 5, "expected_grade": "A+", "created": "2022-12-02T22:07:01.568689Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Schech (pronounced like Shrek without the R, she says) is really good at explaining everything in an understandable way and not moving too fast even in an accelerated chemistry course. The homework was never too much, the tests were straightforward and clear representations of everything we had learned in class, and she always communicated about what was going on with the content in class and what would be on the tests.", "rating": 5, "expected_grade": "A", "created": "2022-12-05T19:44:22.435645Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Coming into the year I heard all the standard things about how chem135 was an impossible weed out class. Looking back, CHEM135 is not impossible, there's just a lot of material that you have to learn in a very short time frame. Thankfully, Dr.. Griffith does an amazing job at making sure that all of the material is approachable and easy to pick up if you pay attention and do the work. She's a great lecturer, she's always available, she maps out her exams question by question (content, not exact details) in advance so you know what to expect- I can't really think of too many things she could have done to make this easier for us beyond giving us the exam answers ahead of time too. If you're an incoming freshman engineer and need to take CHEM135, take it with Griffith; I'd imagine it'll be even easier once she finishes the redesign of the course she's working through.", "rating": 5, "expected_grade": "A", "created": "2022-12-08T19:02:32.918342Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Chem135 sucks as a class, but Griffith made it possible. There's too much material for one semester and so some of it ends up as rushed, but Griffith made what would have been an impossible class into something manageable. She's clear about grading and is very fast to start giving bonus points to give some grade boosts. Even though I only actually talked to her a few times, she genuinely felt like she wanted every single person in the class to succeed. I hope after the redesign, the class is less impossible, but regardless, if you have a chance to take Griffith, take it.", "rating": 5, "expected_grade": "A+", "created": "2022-12-08T23:08:29.180643Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "Dr. Rainbolt is truly an amazing professor! He knows the course content extremely well and is amazing to have for lecture as he consistently tells you exactly what you need to know and how to apply it. Rainbolt knows that memorization, to an extent, is unreasonable and he has a heavy emphasis on applying the actual content of the course instead of simply memorizing a ton of equations and constants. For each topic of the class, at least for CHEM135, he gave out a module with practice problems, explanations of every topic, and an outline for exactly what you should be able to do on an upcoming exam. For anyone reading this review but is looking to take something like O-Chem, Rainbolt has said that gen chem is not his specialty so with the experience I had, I'm sure O-Chem with Rainbolt would be even better. I don't think there is anyone better who could have taught this course and I was extremely lucky to have Dr. Rainbolt for this semester.", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T17:14:40.264661Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Lectures and powerpoints are detailed and the exams are fair", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T20:43:08.038655Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "First of all, I want to say that CHEM135 is just a hard class, no matter your professor. However, Dr. Griffith made the class extremely bearable. Not only is she a good lecturer, but she provides a huge curve that helps a lot of people's grades. She posted online lectures from her previous online classes which helped a lot when you miss something in class. She answers all questions and tells you during lecture what questions she will consider putting on the exam. On top of that, either the two lectures or the lecture before the exam, she will give you a question layout of the entire exam so you know exactly what question on every exam will ask you. The lectures were sometimes weird, as we would end a unit halfway through class and start a new unit the other half, but she explains the concepts really thoroughly. If you don't understand something, make sure you clear it up as it's really easy to get behind in the class. If you don't understand chemistry or haven't taken a previous chem class, I would highly recommend you take it with her. But honestly, even with prior knowledge, this class will still be a little difficult.", "rating": 5, "expected_grade": "A-", "created": "2022-12-10T22:39:26.055627Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "This chemistry professor is amazing. He cuts right to the business and doesn't fool around with anything. For example, he doesn't like memorization and only makes you memorize what you NEED to know (which is little). He loves to puts jokes in his lectures. Even though his lectures are kind of hard to understand, he knows this flaw by making prelecture videos and going in-depth in the modules so you can understand it. What he puts in his content will be EXACTLY on the test. I have him for Orgo next semester, and even though it is at 8am, I will probably not feel lost. His personality is overall approachable and kind.", "rating": 5, "expected_grade": "B+", "created": "2022-12-12T21:32:38.455183Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Schech is really nice and passionate about chem. Lectures are relevant and helpful although can be boring at times due to pace of material (sometimes way too fast, other times way too slow). Discussions were often very helpful and would def recommend going to those. Homework helped with concepts and never was too much. Exams were very fair and she gives plenty of resources to students (past exams, problems, notecard on exams, etc). Would def recommend.", "rating": 4, "expected_grade": "A", "created": "2022-12-13T21:35:10.285102Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Hard class but Griffith is a great professor and the exams weren't bad, even though the averages were in the 50s normally.", "rating": 5, "expected_grade": "A+", "created": "2022-12-16T02:09:22.952564Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Basically have one homework a week and three exams plus clicker points. You have to go to lectures to get the clicker points even though she has all of them posted. Clicker points may seem insignificant but they add up and actually can make a big difference. I usually just watched all the lecture videos over and did a few practice exams to prepare for the exams and did average. She makes the exams way to hard which I think is dumb but its whatever because the curve is huge as everyone says. Honestly the difficulty of this class is overrated by everyone. It hard to get an A and you will need to work for it but if you just want to pass its not that bad just show up and do the homework.", "rating": 4, "expected_grade": "B-", "created": "2022-12-16T03:40:44.971306Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "This class is DIFFICULT. As an engineering major, you just got to get through it. If you do not like chem(like me), you won't like this class. There is a ton of content to cover. Work hard and you can get through this. Griffith has all the PowerPoints for her lectures posted at the beginning of the semester. Get through your homework early and do NOT fall behind on the content. It is a lot and you want to be on top of things. Griffith curves nicely, but that only works out if you study hard. You can get through this, just do your best.", "rating": 4, "expected_grade": "A-", "created": "2022-12-16T07:39:01.151453Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Griffith is a good lecturer, and although the exam averages are usually terribly low, she does give the letter grade cutoffs after each exam, so that definitely gave me some peace of mind during the semester and kept me from being stressed out about grades after receiving the score back. \r\n\r\nIn Fall 2022, she did also allow you to take a notecard into the exam. I am not sure if the other professor(s) allowed you to do this or not.", "rating": 4, "expected_grade": "C+", "created": "2022-12-18T04:16:21.367898Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Even though CHEM135 is a difficult class, especially if you did not take AP Chemistry in high school, you'll still do well with Dr. Griffith. She's really helpful and makes the lectures bearable, and there's a huge curve in the class. I'm not entirely sure how the course will look like after the redesign, but if you are good at test taking (unlike me), then you can definitely get an A in this class.", "rating": 5, "expected_grade": "B+", "created": "2022-12-20T17:39:33.542631Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "The only thing I can criticize about Dr. Rainbolt is that there wasn't really comprehensive review material for any exam.  The modules are great for review, I just would have liked something a bit more concise for reviewing.  The lectures are very engaging, and really the only lectures I got anything out of this semester.  The exams were manageable for the most part, and other assignments were fine.  The focus was placed on where it should be for most engineers: solving problems, and I appreciate that given that most engineers will probably never need chemistry.  I have no doubts he'll be good in higher level chemistry courses.", "rating": 4, "expected_grade": "C", "created": "2022-12-23T03:56:08.895339Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "Lectures could be confusing but the modules and the prelecture videos he made were very helpful. His grading is very fair. He makes this challenging class fun and doable.", "rating": 5, "expected_grade": "B-", "created": "2022-12-23T21:59:42.822808Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Professor Schech is a great professor. She is able to break everything down and explain it in simple terms. She seems to really care that her students do well. She is very helpful in office hours and reachable via email. However, this class is hard so you do need to go to class, take notes, go to discussion, do your homework and discussion worksheets, and study. If you put in the effort to just show up to class and discussion and take notes you can easily get an A without having to do too much out of class studying because of how good professor Schech is at explaining things. She also allows you to use a notecard on exams which no other CHEM135 professors do. She also records her lectures which is nice. I definitely could have gotten an A but I decided to skip about 8 lectures and then not watch the lectures I missed until the day before the exam at 2X speed which definitely hindered my learning. If you go to lecture and discussion and do your homework you will do well in this class.", "rating": 5, "expected_grade": "B+", "created": "2022-12-24T07:25:38.245837Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "Everyone knows chemistry is hard asf, but this professor did a pretty good job at teaching it. The beginning of the year started off very easy, but it progressively got harder. The first topics taught were stuff we learned in high school such as lewis dot structures, compound naming, dimensional analysis, etc. But don't get comfortable. The first test I got an 80% (because it was easy compared to the rest of the year), and I thought the next few tests were going to be that easy. I then bombed the next 2 tests. Because there are only 3 tests before the final, so much material is crammed into one exam. This class requires a lot of complex word problem solving with several steps, so be ready with that. As the topics got harder, Rainbolt's lectures were hard to follow, as he goes pretty quickly. Sometimes he would end his lectures 30-45 minutes early, which I honestly would rather have him continue to teach us because of how hard this class is. Overall, he is a good teacher and he will crack jokes every once in a while so just laugh. He gives prelecture videos as well as practice modules so make sure you watch and do them. He curved the 2nd test and that was it. Sadly, he didn't curve the test that everyone and their mom failed (the 3rd one) and I don't think he curved the final either. I ended up with a C- in the class, you most likely have a few more braincells than me so you should be able to do a little better. However, most of my friends ended up with the same grade as me (highest being a C+).", "rating": 4, "expected_grade": "C+", "created": "2022-12-24T15:24:12.792152Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "Great teacher, teaches the class content very well, keeps classes interesting and is an interesting person overall. Keeps the classes engaging by answering questions and giving the class practice problems in his custom modules. Great teacher overall", "rating": 5, "expected_grade": "A", "created": "2022-12-25T15:31:19.974334Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "I honestly didn’t really like his class. I saw he had good reviews but maybe he wasn’t for my learning style. I didn’t like the confusing lectures/videos, and sometimes he put the wrong answers to the modules. But the modules are helpful, he writes all of them himself and I owe it to them that I passed the final. Occasionally goes on tangents in lectures but cracks a few jokes. Could be condescending to confused students. Doesn’t give nearly enough time to solve problems in lecture. Gave few extra credit problems in tests and quizzes. Tests are both concept and problem based but still pretty fair. He gives formula sheets for the tests so you don’t have to memorize them. Slow/bad at grading in elms, so you can’t check your grade unless you go to his office", "rating": 3, "expected_grade": "C+", "created": "2022-12-25T17:30:56.435797Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "She is a great professor and a REALLY good lecturer, however her exams were very difficult (averages usually lie around 50-60). It is absolutely essential that you attend lecture to succeed in this class. Curve is really good at the end given the exam averages are so low (about 10%).", "rating": 4, "expected_grade": "B", "created": "2022-12-26T03:18:14.202617Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is an incredibly nice person, but more importantly, is amazing at lecturing and makes chemistry genuinely interesting. Prior to this class, I only had bad experiences with chemistry and was dreading this class. I had heard terrible things and was beyond nervous. But since Dr. Griffith is a physical chemist, she explains chemistry in a way closest to how most engineers would understand. If you like physics and have experience with things like Coulomb's law from electrostatics, then this class is made significantly less stressful since so much of chemistry can be explained with physics and Dr.Griffith is the one who made that connection.", "rating": 5, "expected_grade": "A+", "created": "2022-12-27T04:49:55.156243Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith was a very very sweet woman and seemed incredibly caring. The curve at the end of the course was very generous. With that said, this was the hardest course I have ever taken in my life. She moves through content incredibly fast, about 1 1/2 units a class. The content on the tests were incredibly difficult and the averages on the tests were 40's and 50's. I would recommend taking Amanda Scheck. I heard that her class moves slower and the tests are easier. If you have not taken AP  Chem or are not good at chemistry, do not take Griffith.", "rating": 3, "expected_grade": "C-", "created": "2023-01-08T00:58:51.319028Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Overall Griffith is a pretty good prof for 135; she answers emails, has good lectures, and makes a lot of study resources available. Her exams are pretty brutal but the curve helps and she is pretty accommodating overall. I definitely recommend using the textbook because her lectures match the book content very closely.", "rating": 4, "expected_grade": "B", "created": "2023-01-10T02:14:49.147943Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Good lecturer but her exams are extremely hard. Practice exams were nothing like the actual exams.", "rating": 2, "expected_grade": "C-", "created": "2023-01-17T05:33:15.992506Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "FANTASTIC lecturer, makes everything very clear and actively takes feedback in lecture. Lets you use index cards on exams and final. Great curve and lots of extra credit opportunities. Lecture videos available. She's lowkey petty sometimes when the lecture hall gets talkative and sometimes she complains a lot but it's okay, her lectures were honestly a highlight of my week because of how clear and informative they were. Ask questions because she will answer them well. \r\n\r\nRelatively easy class if you've taken AP Chem, entire class is basically dimensional analysis. Definitely don't fall behind and don't be afraid to ask questions.", "rating": 5, "expected_grade": "A", "created": "2023-01-20T18:41:06.679295Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Chem 135 is one of the toughest courses a freshman can take, but don't worry, Griffith is a great proffessor. As someone who never had a proper chem class before, this was a challenging class that moved quickly, especially in the last two units. That being said, Griffiths teaching and her assigned work will help prepare you for her exams. They are hard but the class is curved. If you are willing to put in the work, and understand instead of memorize, you can do well in this class. Also in case you are worried, AP chem is not a prerequisite.", "rating": 5, "expected_grade": "B+", "created": "2023-01-23T02:30:19.223492Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Griffith is an amazing lecturer. Every day, she enthusiastically engages with the class  throughout her lectures. Although attendance is mandatory, she generously rewards participation points which are a great way to raise your grade. Expectations and deadlines are always clearly established, and she declares test material ahead of time! As a bonus, tests are always graded within 1-2 days. Although CHEM135 is an incredibly difficult class, Griffith makes it possible to get a good grade!", "rating": 5, "expected_grade": "A-", "created": "2023-01-26T19:04:11.884371Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I was pretty nervous going into this course that AP chem was a pre-requisite, that's not true at all. Griffith is very friendly and will do her best to prepare you for the \"most accelerated class in the chem department.\" Homeworks and practice problems are instrumental in learning each of the topics. After the second exam, a new topic is taught per day and it becomes very important to attend lectures. During lectures, Dr. Griffith will tend to hint at possible exam problems and will go over problems by hand which is vital to staying on track. Clickers also give generous opportunities for extra credit, don't skip lectures. Exams are challenging, but the entire class is curved in the end to make up for this. Her office hours are also welcoming and very useful to answering questions. As long as you study hard and challenge yourself, it's possible to get an A, even if you have never taken a proper chemistry class before.", "rating": 5, "expected_grade": "B+", "created": "2023-01-27T03:30:56.831401Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "It is chemistry so it is of course hard work. But the good thing is that I got an A- when I should have a B.", "rating": 4, "expected_grade": "A-", "created": "2023-02-28T19:14:18.121146Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I'm late reviewing her but she is just terrible. Yes, she is nice and does not make her lectures boring but her exams are rediculous and lectures do not cover exam material in the slightest. She does do around a 10% curve as I got a 75% at the end despite failing the final and I ended up getting a B. Take another professor if you can!", "rating": 1, "expected_grade": "B", "created": "2023-03-11T01:23:23.411895Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "I had Schech for CHEM135 Fall 2022, she is a very passionate teacher who you can tell cares about teaching chemistry from her lectures. During class she takes the time to explain things thoroughly, but also records all of her lectures and makes them available on her class page. She has pretty fair exams and allowed us to have a note card, the only negative I can think of is the final felt disproportionately hard. However I think the homeworks and lecture videos generally are enough to understand the topics. Overall probably one of the best professors I have had.", "rating": 5, "expected_grade": "B+", "created": "2023-04-20T23:31:45.425771Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "Rainbolt is a decent guy but not that great of a professor (at least for my teaching style). His lectures were not organized and he wrote all of the work he was teaching us on the board, making it hard to see if you were in the back. Other than that, his class atmosphere made it so hard to ask a question without being judged. A lot of the other reviewers said he's condescending, and I think that only applies to him during his lectures. Not sure if he's trying to be witty but it makes students not want to clarify mistakes if the teacher deems question \"good\" and \"bad\". \r\n\r\nDuring office hours, he is really nice and approachable. He is very understanding of makeups and tends to take a while to grade so you will probably get your makeup grade the same time as the class gets their grade (do with this what you please). All in all, not the best Professor and won't suggest taking unless your grasp of Chem is already good.", "rating": 2, "expected_grade": "D+", "created": "2023-04-24T17:15:10.340648Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "Honestly great teacher and a great guy. I can say that the exams for this class are FAR easier when compared to other classes. His lectures are sometimes difficult, but going to his office hours does help a lot.", "rating": 5, "expected_grade": "A", "created": "2023-04-26T19:29:17.863842Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Good professor, goes a little fast sometimes but clearly knows what she's talking about and is passionate about what she teaches. Her exams were fair and she allowed a notecard for both the midterms and final, so that definitely helped a lot. If you are like me and really struggle with chem then this class will definitely be a challenge. There are homework assignments, they are a little annoying but definitely help you learn the material and also raise your grade. TBH I didn't do most of the hws and really regretted that, so learn from my mistakes and don't be like me. Overall though, solid professor and the class is definitely manageable even if you struggle in chem as long as you put in the effort and don't fall behind.", "rating": 4, "expected_grade": "C-", "created": "2023-05-05T18:16:44.515434Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Great professor who explains things well. If you attend lecture, discussion, and do some practice you will be set up to succeed. You will see problems from discussion and the lecture worksheets on your exams so make sure to practice those. The final was pretty tough but the curve at the end of class was very generous.", "rating": 5, "expected_grade": "B-", "created": "2023-05-18T14:55:11.712001Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "She is a good professor who really attempts to make you understand exactly what is going on instead of just attempting to make you memorize. Her and Dr. Griffith split class time throughout the semester. Lectures are recorded but I would recommend going to class as the learning experience is much better. Exams can be tough but if you practice the discussion worksheets and the lecture group worksheets you will be better off as they often sneak replicas of these questions into the exams. Also, if your grade is slipping I wouldn't be quick to withdraw as the curve at the end of the semester is substantial.", "rating": 5, "expected_grade": "B-", "created": "2023-05-18T15:01:50.266298Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "This semester Dr. Griffith taught this class with Dr. Schech. Dr. Griffith is a nice professor and willing to help her students, but her lectures move very fast so it's easy to fall behind on note-taking. Homework can be long and sometimes difficult. Exams make up the majority of the grade and are often challenging, but reviewing problems from the discussion sections can help. This class is doable and Dr. Griffith does a good job of making it interesting, but it takes work. I took this class as a non-engineer and without AP Chem and did fine. She curves at the end of the semester.", "rating": 4, "expected_grade": "B", "created": "2023-05-19T01:09:34.852599Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Insanely good! She is so nice and welcoming, writes fair tests, and teaches AMAZINGLY. This course is obviously hard, and most students are doing it for the requirement, and she acknowledges it. I would have gotten a C with any other teacher. The slides are really detailed, she knows when to work through problems with us versus just showing us the information on pre-made slides. She answers all questions students ask, even if it is cutting into time she needs to teach more information. She provides practice exams and exam tips, and sends out an email about two days before the exams saying the broad topic each question will be with how many points. All questions on exams are clearly related to what we learned in class, so just make sure you are listening and study before exams (I personally do all of the textbook problems she recommends from the syllabus for the topics that will be on the exam). She grades SUPER quickly, like in three days for regular exams, and literally just one day for the final. The curving is fair. Also, what is really good about this class and how it is taught is that the topic we learn are not just chemistry topics on their own, but how they apply to things us engineers may actually use, like combustion engines, batteries, biodegradable stitches, solar panels, and for wastewater treatment.", "rating": 5, "expected_grade": "A", "created": "2023-05-21T20:34:07.319856Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Insanely good! She is so nice and welcoming, writes fair tests, and teaches AMAZINGLY. This course is obviously hard, and most students are doing it for the requirement, and she acknowledges it. I would have gotten a C with any other teacher. The slides are really detailed, she knows when to work through problems with us versus just showing us the information on pre-made slides. She answers all questions students ask, even if it is cutting into time she needs to teach more information. She provides practice exams and exam tips, and sends out an email about two days before the exams saying the broad topic each question will be with how many points. All questions on exams are clearly related to what we learned in class, so just make sure you are listening and study before exams (I personally do all of the textbook problems she recommends from the syllabus for the topics that will be on the exam). She grades SUPER quickly, like in three days for regular exams, and literally just one day for the final. The curving is fair. Also, what is really good about this class and how it is taught is that the topic we learn are not just chemistry topics on their own, but how they apply to things us engineers may actually use, like combustion engines, batteries, biodegradable stitches, solar panels, and for wastewater treatment.", "rating": 5, "expected_grade": "A", "created": "2023-05-21T20:34:26.800174Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Professor Griffith is incredible and brilliantly smart, she is very clearly an expert in the field and tries to make the material interesting and relevant to us as engineering prospects. She although seems salty about teaching CHEM 135? She makes a lot of condescending jokes during class if no one answers a question, and takes jabs at the fact that the students in the lecture are trying to go into engineering and don't have any interest in chemistry. She has very professional slides, and if you go to class you will do well. I think the tests were fair, and they are very generous with the curve, and VERY FAST at grading tests! It was impressive.", "rating": 4, "expected_grade": "A+", "created": "2023-05-29T20:46:23.745602Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Professor Schech is brilliant and absolutely a sweetheart. She tries to make everything relevant to us, and is very receptive to questions and really wants her students to understand the material. She's great with emailing in a timely manner and the tests are very fair. Her PowerPoints can be a little dull, but that's also because I had to take the class and have no interest in the content of chemistry. I would highly recommend if you are nervous about the class.", "rating": 5, "expected_grade": "A", "created": "2023-05-29T20:48:15.509211Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Online homework is nothing like the exams, some of the slide presentations are rushed (too much information at once)", "rating": 1, "expected_grade": "W", "created": "2023-08-28T18:00:09.150363Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Exams are nothing like online homework, homework are around 3 hrs + , lectures are fast paced", "rating": 1, "expected_grade": "W", "created": "2023-08-28T18:01:44.091849Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Hated every moment. Exams are beyond college level making not sense. HW are dumb and long. Reviews are fake.", "rating": 1, "expected_grade": "", "created": "2023-09-14T01:26:12.581268Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Griffith is extremely smart and knows what she's talking about. Chances are if you ask her any question she'll answer it with a good explanation. However, her lectures move pretty fast and it's pretty hard to keep up with her pace at times and her exams were extremely difficult compared to the already difficult HW but she does curve at the end of the semester. Overall I'd recommend Griffith for CHEM135.", "rating": 4, "expected_grade": "C", "created": "2023-10-27T19:32:31.802905Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "The most boring and horrible professor I have ever seen. If you haven't taken AP Chem or reviewed chem in the past year you are screwed. The only way to learn in her class is to do the homework which takes forever if you don't know what you are doing. Lectures are extremely boring and are mostly filled with examples that tell you nothing about what will be on the homework. Please switch to another professor!! The only good thing was that her practice exams and her exams are the same format.", "rating": 1, "expected_grade": "A-", "created": "2023-11-01T18:03:00.484599Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Pick anyone other than Mignerey for CHEM135. We have a homework software(ALEKS) that takes the whole day just to do. Not only that but her lectures are so boring, you rather just look at her posted slides and watch videos to get by. Don't rely on her practice exams that she provides, they not similar. All her exams are just calculations problems and more difficult than other chemistry professors like Griffith. Always take Griffith for CHEM135.", "rating": 1, "expected_grade": "C-", "created": "2023-11-12T23:33:42.679619Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Terrible professor. Very uninteresting, makes the tests way too difficult, and quite frankly gets off topic too often. I would avoid at all costs.", "rating": 1, "expected_grade": "A-", "created": "2023-11-28T21:44:35.220785Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is genuinely one of the best chemistry professors I have ever had. She is extremely caring and really wants her students to do well. She was always willing to work with me if I couldn't come to office hours or needed any help. I had a really bad TA so I mostly relied on her office hours to help me get through. She offers tons of in-class bonus points through clickers. Her lectures are a little fast, but she tries to give as many examples as possible and shows the derivation of each of the concepts so it is easy to understand where the formulas were coming from if I ever forgot one. Her lectures being fast also is not her fault at all there is just a lot of material that needs to be covered in the class. By no means is it an easy class, but she offers tons of help and support to make things a little easier.  We get to use a notecard on every exam and also on the final. She also provides an outline of every exam before and shows all of the point values and the concepts tested for each question.  The exams are difficult, but fair and she is willing to regrade for partial credit. If you stay on top of your assignments and ask for it if you need help you should be good. She is also redesigning her class right now which is making the material a lot more manageable. Overall, Griffith is a really great professor, and I would definitely recommend her class.", "rating": 5, "expected_grade": "A", "created": "2023-11-29T16:17:37.553410Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is great!! She records all of her lectures, always gives bonus clicker questions in class, and is always available to help out. She is a great teacher and definitely knowledgeable about chemistry. Her exams are hard but we get a decent-sized notecard and she tells us the outline of the exams with point values and the concepts tested so with that and all of the previous exams and keys it is not too hard to find the format of the questions. Obviously, like any teacher, she throws curveballs on her exams but she does give partial credit and is always willing to work with you if you need help. She also posts all of her lecture recordings which is really helpful to look back on. If you do the homework, show up to class, make a good discussion group, and ask her if you need help it is not a bad class. Definitely recommend Dr. Griffith!!!", "rating": 5, "expected_grade": "A", "created": "2023-11-29T16:23:08.266357Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Her lectures are not that helpful, but if you use the textbook, the class isn't nearly as bad as what other people say. Her teaching style is definitely not good, but she makes up for it with her exams that are very similar to her practice exam format, and she also gives a list of the exact topics you will need to know, which is also quite helpful for preparing for exams.", "rating": 3, "expected_grade": "A+", "created": "2023-11-30T14:50:00.520481Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "I absolutely hate chemistry and am only taking it to fulfil a requirement, but Dr. Schech is super nice and very good at explaining topics in chemistry that I had a hard time trying to understand prior. She posts all her lectures online which are very helpful when trying to review, and even cuts them down to make them shorter! She also posts past exams for midterms and the final which are very helpful! Right now, we are a bit behind and are rushing through the last few modules, the exams are difficult but if the class average goes too low she will curve, and the homework isn't really representative of everything we do in class or the exams, but the rest of the class is great! I'd defintely recommend taking Dr. Schech for CHEM135!", "rating": 5, "expected_grade": "B-", "created": "2023-12-01T18:09:32.313706Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Mignerey is genuinely the worst teacher I have ever had in 13 years of schooling. There are so many complaints I don't know where to begin. For starters, her lectures are absolutely useless. Her lectures consist of her copying down her slides (which look like they were last updated in 2008), fiddling with tech that she doesn't know how to use, and making mistakes upon mistakes COPYING down her OWN work. She makes so many mistakes in her lectures that many students find it more useful to NOT attend her lectures and read the slides themselves. On top of her terrible, almost non-existent teaching skills, she assigns the most painfully tedious and boring homework. No joke, I have recorded almost 90+ hours on ALEKS (the homework software) which she also assigns over \"break\" and holidays. Her practice tests may be similar to the actual exams, but the exams themselves are created in ways as if it seems she wants the students to fail them. Additionally, for some reason she decides to have four midterms, the last of which is A WEEK before the final exam.  Although the TA tries, she is unable to makeup for the horrendous teaching practices of Mignerey, If you need to postpone taking chemistry for a semester I would STRONGLY recommend that over wasting a hundred hours on a teacher that doesn't even care about teaching her class.", "rating": 1, "expected_grade": "B+", "created": "2023-12-05T01:35:11.072043Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Definitely not the professor you want for chem. If you are good at teaching yourself, then you'll be fine, but otherwise, I would recommend avoiding her.  Her lectures are just her flying through PowerPoints (too fast to write down notes) and talking about examples of topics that she barely even taught us, and the discussions didn't help much with that either. The only thing that I actually learned from were the homework assignments. The one good thing though is that she gives practice exams that are pretty similar to the actual exams, and she does have a decent curve at the end of the class. Also, she does grade very quick, so you don't have to worry about that. Overall, it was between a 2 and a 3, but I chose 2 just because of how confused I was taking her class. If you can get a better professor, go for it, but if you get her, its not the end of the world.", "rating": 2, "expected_grade": "B+", "created": "2023-12-06T21:09:52.121312Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Avoid choosing this professor at all costs!  Her lectures are not that helpful, and the homework software (ALEKS) is not representative of the material on the test.  She assigns multiple (40 topics) that have 5 questions in each topic, you will be doing chemistry homework all night with little reward.  Yes ALEKS teaches you better than she does but the test looks nothing like the homework.  I HIGHLY recommend choosing another professor as this should be a VERY LAST RESORT, I would recommend dropping out before taking this class.  Practice exams are somewhat helpful but she makes multiple errors and is always correcting mistakes that others find.  Lastly, DO NOT TRUST the fake responses below saying she is amazing because they are just trying to boost her rating.", "rating": 1, "expected_grade": "C-", "created": "2023-12-07T04:24:46.333909Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Great professor, so many opportunities of extra credit. Fair deadlines and exam content is clear. Posts old exams for practice that are very similar to those.", "rating": 5, "expected_grade": "A", "created": "2023-12-08T16:41:20.961186Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Mignerey is the worst teacher I have had in thirteen years of school. Her teaching style is nonexistent as the majority of her lectures consist of her failing to set up technology, copying down the slides, and making COUNTLESS mistakes. In fact, her lectures are so poor that the majority of students feel like its more beneficial to not attend and just look at the slides, as her narration makes concepts MORE confusing. On top of her terrible teaching she assigns hours of tedious homework as if this is the only class the students are taking. Although the homework software, ALEKS, does help students learn; it ends up taking 95 hours of your semester to complete (seriously  -- and she assigns work over break) . In addition to her terrible teaching and tedious homework Mignerey structures her class to have four midterms, the last of which is taken only one week prior to the final exam. These exams do not test your knowledge in the course as Mingerey randomly cobbles together niche topics from her slides. The only reason I was able to get an A in this class was because I put over 100 hours of self study time ( which is completely unnecessary when better teachers exist). DO NOT TAKE ALICE MIGNEREY, restructure your schedule if you need to.", "rating": 1, "expected_grade": "A", "created": "2023-12-09T21:44:44.289491Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Best CHEM135 professor!!! Allows us to vote on 3 questions for the final which are identical to one question from each of the midterms. Gives lots of bonus points during lectures. Lectures are recorded. Always helpful during office hours and email.", "rating": 5, "expected_grade": "A", "created": "2023-12-10T19:36:57.249639Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "If you have to take CHEM135 at UMD then please take another professor. She teaches solely using half assed slide decks and never puts any effort into teaching in an engaging manner or in any manner that allows students to learn well. The practice exams she posts to review for the midterms are much easier than the actual midterms so you always go into tests feeling better than you should. On two tests this year there have been questions that were simply never covered in class. The homework software (ALEKS) that all students have to use is horrible and takes an ungodly amount of time ( I spent over a hundred hours just on homework this semester), and is the only way anyone actually ends up learning any content. PLEASE switch teachers if you have her or simply drop the class and take it another semester as it is simply not worth it. I would give her 0 stars if I could.", "rating": 1, "expected_grade": "B-", "created": "2023-12-10T20:29:44.328941Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Very good teacher. She records all of her lectures, which includes her written notes + powerpoints. She provides plenty of resources in order to stay afloat in her class. The class did move at a very fast pace but she never assigned extra lecture videos or extra homework (I never took chemistry either so everything was brand new to me). Outside of class, I dedicated about 5-10 hours a week doing homework and rewatching lectures to understand the class work.  She really does want all of her students to do well. I really recommend her!", "rating": 5, "expected_grade": "C", "created": "2023-12-10T22:55:35.280230Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Lectures are so boring and unhelpful. She has a bunch of example problems that she'll go through each class, but she reads everything off the slides as if you already know it. The homework was tedious and took a ridiculously long time, but it was also the only way I learned anything in this class. She provides good study materials but I basically had to teach everything to myself. This class isn't hard if you take it with a different professor.", "rating": 2, "expected_grade": "A", "created": "2023-12-12T03:43:42.117086Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Great professor for Chem 135. Lectures are easy to follow along and she does a great job explaining the concepts and going through examples. All lectures are recorded and she uploads all lecture slides and handwritten notes to ELMS. HW assignments weren't bad and she gives a lot of points through clicker questions during lecture and offers bonus points as well. Tests were hard but she does curve the class and gives you a notecard to use during the test. She definitely made a notoriously difficult class a lot more digestible, and I would definitely recommend her.", "rating": 5, "expected_grade": "B", "created": "2023-12-13T15:18:18.030924Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is such a good professor! She is extremely personable and is so passionate about chemistry, and it shows in how she teaches and her attitude. However, this course was very hard for me. The magnitude of information you're expected to retain and the difficulty of those topics make this course very rigorous. However, if you keep up with the lectures, do practice problems on top of homework, and understand the module activities throughout the semester, you should be fine. She offers a lot of bonus extra credit and lots of advice and insight for her exams (like the layout and the topic of each question). She knows how difficult this course is and is constantly offering support and help, she wants you to succeed and she believes in you!! For the final, she let us vote on 3 questions we wanted from the midterms to be on the final, so those were guaranteed points. I would go to her office hours frequently, you can gain valuable insight from questions asked by other students as well and she's such a great person to talk to. Continuing this semester (Fall 2023), she and another professor are redesigning the course so you kind of jump around in the chapters in the textbook. She applies the actual chemistry to topics engineers will need to know later down the line (like combustion or corrosion). I also did not find discussions particularly useful. There are videos that Dr. Griffith recorded in a previous year that you have to watch before the discussion, then the TA basically reteaches it. Unfortunately, I did not have a good experience with the TA as he did not teach well at all, so I would definitely just watch the videos. Although I really don't like chemistry, I am overall happy and satisfied I took this class with Dr. Griffith!", "rating": 4, "expected_grade": "", "created": "2023-12-13T22:18:45.496915Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "Terrible professor. I wish I checked his reviews before taking this class. He assigns a quiz every week but doesn't prepare us for it or give us enough time to do it. Even worse, 90% of the time, out of the 20 multiple-choice possible answers he gives for one single question, NONE OF THEM ARE THE ACTUAL CORRECT ANSWER. His lectures are unclear and confusing and the way he answers questions is very condescending. The lecture videos and the modules are more helpful but contain errors and are not posted consistently. Nothing in his class prepares us for the exams. Worst of all, THERE ARE MISTAKES ON THE EXAMS. For the second exam, I spent all my time trying to figure out this one question (I know, stupid), but it turns out the question was wrong and we couldn't get the answer from it. Overall, horrible professor, and do not take his class if you want a good grade.", "rating": 1, "expected_grade": "C", "created": "2023-12-14T01:01:06.808024Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Before taking this course, I, like many of you reading this, was extremely scared to take CHEM135 as it has a reputation for being a notoriously difficult class. After taking this course I can confidently say that this course is a weed-out class NOT because it is impossible, but because it is a test of how much effort you are willing to put into it. For context, I came in with little chemistry knowledge (no AP just chemistry sophomore year of high school) and ended the class with an A+. Much of this is due to Dr. Griffith. Dr. Griffith is an amazing professor who clearly wants everyone to succeed. Her tests are hard but fair, but the averages are usually low (between mid-60s to mid-70s). However, her averages are usually low because people do not take advantage of all of the study materials she provides. She provides numerous past exams to practice with that prepare you for the types of problems that she gives on exams (speaking from experience, this is the BEST way to study). For those taking CHEM135, here are some tips: first, make sure that you attend office hours if you are confused about something. Many of her exam problems are conceptual and if you are confused about one topic it will make it far more difficult on exam day. Second, make sure that you do as many practice questions FROM HER PAST EXAMS as possible, as the concepts are VERY similar to the ones you need on the actual exam. Third, do not stress if you bomb one exam. I did, and in the end, it was fine because she gives so many opportunities for extra credit. Overall, I would definitely recommend Griffith for CHEM135 as she gives you all of the resources you need to succeed!", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T00:09:38.445212Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Do not get me wrong, Professor Mignerey is a very brilliant woman but she should not be teaching this course. Do not take her for chem135, I have spent 148hours on my homework she gives this semester alone. She provided 4 midterms this semester, the last one being the second to last day before finals. On one of my exams she gave me 0/8 points for a problem but gave a fellow classmate 6/8 points on the same question when we both had the same work and the same answers. She lets you submit regrades but sometimes she will take away points during a regrade. Her grading is so inconsistent.", "rating": 1, "expected_grade": "C-", "created": "2023-12-15T04:53:29.898258Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Very smart and knowledgeable of chemistry. This class is very hard because of the amount of material that must be covered; however, Dr. Griffith explains everything well and simplifies things to make it manageable. Do not expect this class to be easy even with a great teacher, it will still be difficult, just not as bad. She gives our extra credit generously, so even if you do really bad on one of the tests you can still get a good grade.", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T23:12:10.647056Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Great professor and interesting course. I had basically zero chem experience and was just taking this course as a gateway to engineering, but I learned so much, and the applications of chemistry to engineering in this course were really cool! Very organized Prof and recorded lectures and notes, easy to understand despite the fast pace. When I say fast paced I mean this class is super duper fast paced. Like zooooommm.\r\n\r\nMake sure to try on the homeworks and definitely check out the past exams. She has the exams posted in elms and keeps the keys in her office which you can take photos of. Review notes and you'll do well! Definitely do lots of practice math since this course is like 70% math and plug-and-chug. You do have to put in the hours. It's pretty important to know some of the ions for the exams, so I suggest just writing them all on your notecard lol (you can also just memorize them if you're built different). Many, many extra credit opportunities which saved my grade. Also great curve!!! I got an 87.7% in the class and it surprisingly got rounded up to an A-!! Did not feel like as much a weedout course than math141", "rating": 5, "expected_grade": "A-", "created": "2023-12-16T22:09:52.781190Z"}, {"professor": "Samuel Lascio", "course": "CHEM135", "review": "Really good professor who goes above and beyond to accommodate students. Extended hw several times, and hosted extra review sessions.", "rating": 5, "expected_grade": "A-", "created": "2023-12-17T01:20:07.180646Z"}, {"professor": "James Rainbolt", "course": "CHEM135", "review": "Stay absolutely away from this man. I enrolled in his course before any reviews were available for the fall 2022 semester. He teaches his class as if it were a theater performance – very dramatic\r\n-  NO CURVE\r\n- NO CHEAT SHEET\r\n just you and your brain. The course is extremely challenging and compact, but he offers no leniency. His exams are notably more difficult compared to those of other professors, and he doesn't provide practice exams. Instead, he hands out thick 20-page lecture booklets for each chapter. When I requested practice exams, he simply told me to study those booklets. Imagine flipping through twelve chapters of 20-page booklets. Yeah, no. Additionally, his personality is condescending.\r\n\r\nYou were warned.", "rating": 1, "expected_grade": "", "created": "2023-12-19T11:34:16.715013Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "You definitely want Dr. Griffith for Chem135, the course sucks and she is your best bet. \r\n\r\nGriffith is extremely knowledgeable and very fair with her grading. She speaks pretty fast, but she is always available during office hours and she records her lectures. She provides a lot of opportunities for bonus points (on the exams, homework, and with in-class clicker questions). Her exams are fair but very difficult, she lets you use a notecard and also provides an outline of the exams beforehand. The homeworks are usually pretty easy which is nice but they don't really prepare you for the exams, past exams are the best study material.\r\n\r\nI found this course to be pretty difficult (I am not a chemistry person and my high school chem class was online) but she is a great professor and there were enough fluff grades that failing a couple of exams will not kill you.", "rating": 4, "expected_grade": "C", "created": "2023-12-19T23:18:35.155998Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "I feel biased because I took AP Chem and would have done well in the class either way, but I genuinely do think Dr. Schech is a great lecturer who gives a lot of resources to succeed. She's very passionate and knowledgeable about the topic and tries to make lectures as interesting as possible. Definitely not someone who drones on, so I would say its easier to follow what she's saying. Her format for drawing complicated diagrams and doing calculations on the screen while she lectures is really helpful. She posts lecture slides and recordings after every class which is a LIFESAVER. She's also very responsive to questions that you ask her in/after class or at office hours and will continue to work with you after class/in office hours until your confusions about the content are thoroughly answered. She also posts old exams which are probably the most helpful resource to study with. She's reasonable and cuts content from lectures/exams if its clear that we're not going to get through all of it, and says she will curve exams if needed. I think if you are nervous about this class or it's your first time learning chemistry Dr. Schech is definitely a solid choice for CHEM135. Only complaint is that the pacing of the content was rushed towards the end of the semester.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T03:30:53.148012Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Good professor but it's obvious she doesn't like teaching a class full of people who don't wanna be there. There's a ton of content in each lecture. GO TO LECTURES. Even if you know the material, her clicker questions are easy points and you don't want it to come down to a couple points at the end of the semester. Not a great curve this semester, not gonna lie. The discussion wasn't helpful and I never learned anything. But her lecture videos she sometimes gives as resources were very helpful. Her exams were very hard but easier than other professors. Exam is crazy hard but it's graded in a day. Go to office hours, she made a bonus on her final you would have no idea about unless you went to her final. Online homework is helpful for understanding but not really similar to the exam questions. For exams, go through all the previous exams.", "rating": 3, "expected_grade": "C", "created": "2023-12-21T04:14:09.521364Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "Mignerey got to be the most  useless professor I have ever seen. Not only her lectures so bad you wish you haven’t taken this class altogether, but also she just so boring. If you’re not good at chemistry then don’t bother even taking her class. She never explains the concepts well which makes it harder for beginners to do well at all in her class. Her supposed practice exams were never useful at all because they were made easier than the actual exams. The only thing useful from the practice exam are the same style and format that is written. I’ll say take any other professor for chemistry as a whole other than Mignerey. She just a poor professor overall.", "rating": 1, "expected_grade": "C", "created": "2023-12-21T08:39:57.216325Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "CHEM135 historically has been extremely poorly taught -- primarily on purpose, it's a weedout. Professor Schech makes the topics", "rating": 5, "expected_grade": "B", "created": "2023-12-21T09:52:21.082705Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "She’s really not a great lecturer and her exams are tough to boot. Expect a MASSIVE curve in her course, average going to a B, ~15%. Ingratiate yourself with a TA, it’s much needed when she struggled to convey concepts in a cavernous lecture hall.", "rating": 1, "expected_grade": "B-", "created": "2023-12-21T16:39:10.653441Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is an amazing teacher and I'm really glad I got to take CHEM135 with her. I had very limited chemistry instruction beforehand (1 semester high school chemistry class where the teacher gave up on teaching once the pandemic began), but I felt like the way she taught was very digestible. While the exam questions don't parallel the homework questions super well, they match the examples she does in class. She also gives a lot of opportunities for bonus points (bonus clicker questions in class, bonus questions on homework, bonus questions on exams). The class is fast paced (which it is required to be by the chemistry department), but she does a very good job with the time she's given. 10/10 very few complaints.", "rating": 5, "expected_grade": "A+", "created": "2023-12-22T20:39:05.084358Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "So, in short: should you take Mignerey for CHEM135? Definitely not if there are any other professors available. Or even if you can take the course next semester instead. But if there does happen to be an unfortunate turn of events and you do have to take this course, I guarantee that you’ll be fine. You’ll probably learn more from this class than any other class you’re taking - not about chemistry, but about how to deal with a whole lot of setbacks. Our class average prior to the final exam was ~55%, to which Mignerey responded “that’s a little bit lower than I expected - I like to aim for 60.” Suffice it to say that the exams are rough. They typically include information Mignerey says won’t be on the exam, so if she says it won’t be there, study it. That’s the gruesome beauty of this class - as much as it sucks, if you adapt to it you’ll be able to pull through. It’s worth noting that the curve is just as insane as the averages, meaning that your average 55% grade will translate to roughly a B-. As long as you pay attention and study, your GPA won’t take too much of a hit. And on the bright side, your friends from this class will be your comrades for the rest of college. Suffering has a way of bringing people together, and this class is a whole lot of suffering. Between the inane lectures where Mignerey frequently makes odd noises, the intentionally confusing exams, and the copious amounts of homework, this class deserves its infamy. Never before have I been so happy to get a C+ on an exam, or to leave a lecture hall at the end of a long day. And in spite of all of this, my GPA has stayed fairly healthy and I’ve learned a lot of hard lessons through this odd experience of a class. Relax, take a deep breath. Even if it feels like it sometimes, Mignerey’s class is not the end of the world. Adapt and you’ll be just fine.", "rating": 2, "expected_grade": "A", "created": "2023-12-30T14:42:47.204913Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Great professor, she's very enthusiastic about teaching chemistry and tries to make it easily understood. There isn't too much homework compared to mignerey and griffith. The tests weren't that bad and the averages were around 70s to close to 80. She posts all her lectures online, but there are clickers so you should go to class. Overall amazing professor, would gladly take again.", "rating": 5, "expected_grade": "A-", "created": "2024-01-03T21:28:15.201993Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "This professor is very condescending to all of her students and only does practice problems for lectures. The homework software Aleks was about 50 dollars to access and do homework. The homework is very long and complicated with your progress regressing for wrong answers. Avoid her at all cost for CHEM135. The only redeeming quality was her curve at the very end of the class, the average was about 65% and I had a 60% that turned into a C+. If you're stuck with her good luck.", "rating": 1, "expected_grade": "C+", "created": "2024-01-06T02:51:26.947127Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Wonderful lecturer providing real world applications to the concepts being covered in lecture. Many office hours were made available. Only a few major exams that averaged around 65-70, but making use of all the study materials provided in the canvas page can pretty much ensure decent grades. Highly recommend Dr. Griffith.", "rating": 5, "expected_grade": "B-", "created": "2024-01-17T00:58:39.752952Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Dr. Schech is the best CHEM135 teacher hands down. She teaches with enthusiasm and enjoys teaching. She cracks jokes and tries to make everything relatable. Her lectures are easy to follow and she posts recordings of all of them online. She'll answer all questions even if it takes up half the lecture, and she's super helpful in office hours. Her exams were straight forward and she posts practice tests before each exam. She will curve the class if the average is bad, but it was much higher than the other chem classes so I'm not sure if it was. Overall she was a great teacher and a very nice person.", "rating": 5, "expected_grade": "B+", "created": "2024-01-18T20:04:33.674610Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Sometimes I feel like she never really gets to the main point with her lectures and presents an overwhelming amount of information on the slides at once and rushes through them making it hard to follow along. I used the homeworks and the previous exams to prepare for the midterms. Overall she's a great person, she really cares about her students and posts extra practice when people ask. She also answers questions towards the end of lecture and records her lectures. She curves the final grade pretty reasonably.", "rating": 4, "expected_grade": "B", "created": "2024-01-19T18:18:27.635534Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Schech is pretty good at what she does. She is very approachable during office hours and answers questions during class. Her exams are harder than the content taught in class and practice exams, so make sure you study the material deeply. The TAs for discussion vary a lot however, so you may find discussion to be unnecessary especially since there are no quizzes for the class.", "rating": 5, "expected_grade": "A-", "created": "2024-01-26T02:32:12.577472Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Took 135A last semester. I fully expected to make at BEST a C ~ >= 75. It was a hard class, it didn't help that we had multiple Chem. Eng. in the class so the curve disappeared. I will say that Schech did do a good job at teaching and lecture. The Exams were not a direct reflection of that. You will have to read your book and review it. A lot of times she will tell you in class don't worry about this **special rule or situation and that would be what would be on the exam. She wouldn't even subtly remind you to remember it so anytime there are crazy exceptions then take it as gospel that you will see it on an exam somewhere. The review she posted does help for the most part; if I had to tell someone the % of it that shows up via exams it would be 40/60. (40%) of the exam review will showcase similar type of problems covered on the exams. I went to AMP hours multiple times to get questions answered and they had a harder curriculum than 135A and they were sometimes lost at why this would be taught so so early. TAs for discussion was really just practice problems so if you are actually following along with the book this was very helpful. \r\n\r\nI barely passed with a C-. every test was hard. Didnt make higher than 68 on pretty much every exam.", "rating": 3, "expected_grade": "C-", "created": "2024-01-31T17:51:12.983257Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith:\r\nShe is a very nice and knowledgeable person but sort of sarcastic during lectures (which i find funny, but others not so much). She is very fast paced, but this course has a lot of content to cover. Her organization of her slides are not the best, but she is, for the most part, able to get the content across. However, I found her exams to be quite difficult, even I felt I knew the content. There were times when I felt good taking the exam, but got a poor grade back. There are clicker questions every class that are graded on participation.\r\nCHEM135:\r\nI recommend only taking this course if you are studying engineering, and this is required. My professor continually said that this course has much more additional content than a usually gen chem course since the engineering department requires it, so don't take this course unless you need to.\r\n(is the work hard/a lot, is the grading forgiving, is attendance mandatory, is there a curve is the teacher boring, stupid, hard to reach, or strict be specific).", "rating": 3, "expected_grade": "C", "created": "2024-02-01T19:38:05.692787Z"}, {"professor": "Wenhao Xu", "course": "CHEM135", "review": "Wenhao:\r\nVery knowledgeable, but moved through discussion slides fast and wasn't great at answering questions. I still found value in attending discussions.\r\nCHEM135:\r\nI recommend only taking this course if you are studying engineering, and this is required. My professor continually said that this course has much more additional content than a usually gen chem course since the engineering department requires it, so don't take this course unless you need to.\r\n(is the work hard/a lot, is the grading forgiving, is attendance mandatory, is there a curve is the teacher boring, stupid, hard to reach, or strict be specific).", "rating": 3, "expected_grade": "C", "created": "2024-02-01T19:43:11.161399Z"}, {"professor": "Samuel Lascio", "course": "CHEM135", "review": "This class is very fast. There’s a lot of content but Professor Lascio is very nice and tries to make things really easy to understand. Very easy to talk to, responds to emails fast, and tends to push back hw deadlines if you ask. He is also a good lecturer. However, the homework takes forever. Weekly homeworks took like 6-7 hours usually so don’t procrastinate. Tests are very difficult, the averages were like 30-60%. Final curve was pretty heavy tho like 20%. Good professor, hard class.", "rating": 5, "expected_grade": "A-", "created": "2024-02-07T21:36:51.391213Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "She is horrible at teaching, she ignores your questions, is super rude and thinks you're dumb if you ask her a question during class. She only does practice problems during class without teaching so you cant really follow along cause she never taught us how to do it just makes us watch her do it. she assigns homework that take 8 hours to do and im not even overexaggerating... please if you have to rearrange your schedule or put it off a semester just please do not take her, she will probably spend 90% of class figuring out her computer and then mumble and give attitude to everyone for the rest of class.", "rating": 1, "expected_grade": "F", "created": "2024-02-09T16:41:22.596100Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Dr. Schech was an amazing professor. She understood all of what she was teaching and that was very obvious. If there was a question that she did not have the answer to, she would do research on it and get you the answer as soon as she could. In addition, she is very understanding to students with accommodations and is willing to work with them to figure out what is best. Chem135 overall is a challenging course, however I do not think I would have done nearly as well with a different professor. You cover a lot of content in a very little amount of time, so attending office hours is extremely helpful. In addition, by going to office hours she gets to know you as a person which is a quality not many professors have. Dr. Schech literally set up a friendship making event for her classes so she could get to know her students better. Overall I felt like her exams were reflective of what we covered in class and were similar in rigor to the practice exams she presented us with. I highly recommend Dr. Schech's class.", "rating": 5, "expected_grade": "A", "created": "2024-02-13T21:34:50.725524Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Dr. Schech is an enthusiastic professor and it was enjoyable to learn from her. The course redesign incorporated engineering applications very well and Schech's teaching style made most concepts easy to understand.", "rating": 5, "expected_grade": "A-", "created": "2024-02-14T16:25:54.417615Z"}, {"professor": "Samuel Lascio", "course": "CHEM135", "review": "Prof Lascio was both the TA and the professor for this course. Despite, this he did very well in replying to emails quickly and doing his best to answer student's questions. We went over example questions often and he posted example problem coursework on ELMS. Once in a while he will go off on tangents and talk about random fun-facts. \r\nGET THIS MAN SOME HELP, he needs a TA!", "rating": 5, "expected_grade": "A", "created": "2024-02-16T02:12:48.346595Z"}, {"professor": "Alice Mignerey", "course": "CHEM135", "review": "She was a terrible professor for CHEM135, banning us from using TI84 (or any other programmable) calculators on tests. Furthermore, the class (which is supposed to be chemistry for engineers) felt like a general chemistry class, and many of us still cannot see how it relates to our degrees (especially if the degree only requires CHEM135), while I heard that other professors connected it to engineering. Other than that, the homework is assigned in a terrible website on which if two different assignments are due on one day, the second assignment will not even be accessible until the first one is completed. \r\n\r\nWhile she did provide practice tests and office hours (in which she was willing to answer any questions), her answers were quite harsh (like a strong callout) and they could have been more constructive.\r\n\r\nIf you end up enrolling for her CHEM135 class, I recommend you to unenroll and (if all other classes for the semester are full) take it next semester with a different professor or split up the chemistry requirement into CHEM131 and CHEM134.", "rating": 1, "expected_grade": "", "created": "2024-03-03T16:28:51.232157Z"}], "department": "CHEM", "course_number": "135", "name": "CHEM135", "title": "General Chemistry for Engineers", "credits": 3, "description": "<b>Prerequisite:</b> Must have math eligibility of MATH120 or higher.\n<b>Credit only granted for:</b> CHEM103, CHEM113, CHEM131, CHEM135, or CHEM146.\nThe nature and composition of matter, solutions, chemical reactions, equilibria, and electrochemistry, with applications to various fields of engineering.", "is_recent": true, "geneds": null}