{"average_gpa": 2.8509652509652508, "professors": ["John Fourkas", "Bryan Eichhorn", "Andrei Vedernikov", "Efrain Rodriguez", "Efrain Rodriguez", "Mercedes Taylor"], "reviews": [{"professor": "Alice Mignerey", "course": "CHEM146", "review": "Dr. Mignerey is a really nice lady and she really cares about her students. She gave us plenty of opportunities for extra credit and has office hours all day the day before the exam. Her quizzes are usually not too difficult and you can make up for any low grades with extra credit from the homework. In class she gives plenty of examples to help you understand the material. Her exams are generally not too difficult if you do your part which means doing the \"optional\" homework and completing her practice exams. Before every exam she gives us a practice test which depicts EXACTLY what will be on the exam. She doesn't expect us to memorize a lot of things so if you understand the material, you'll do well on the exam. ", "rating": 4, "expected_grade": "A", "created": "2010-12-17T23:53:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM146", "review": "Easy class; showed up half the time and barely made it to the final. RR gave quick quizzes and online Homeworks which were a super easy way to boost your grade. Exams are fair. Approachable outside of class and very nice and understanding. Knows what she's doing, but sometimes has trouble conveying it. ", "rating": 3, "expected_grade": "A", "created": "2010-04-19T17:26:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM146", "review": "Dr. Reutt-Robey is a very quiet and reserved professor.  She seems very reclusive, anti-social, and kind of a hermit.\n\r\nWith all that said, she is very very knowledgeable on the subject of chemistry and is very approachable outside of the large lecture hall.", "rating": 2, "expected_grade": "B", "created": "2009-03-26T21:25:00Z"}, {"professor": "Amy Mullin", "course": "CHEM146", "review": "Worst professor to begin my college career with. She is terrible at conveying the topics to her students. No doubt she is a smart person but her way of understanding chemistry doesn't work for everyone. She could barely get through an example without confusing herself so I have no idea why she thinks her students could understand her. Do your self-esteem and GPA a favor and AVOID her!", "rating": 1, "expected_grade": "", "created": "2012-01-16T13:19:00Z"}, {"professor": "Amy Mullin", "course": "CHEM146", "review": "Don't take this professor. Her lectures are alright, but not great. Her exams would not be difficult except you never know what is on them. She may say one sentence about a topic and it makes up a quarter of the exam. If your lucky you studied the right information, but you never know. She does curve a lot, I think that I had a C+ or B- and I ended up with an A.", "rating": 1, "expected_grade": "A", "created": "2011-12-21T16:23:00Z"}, {"professor": "Amy Mullin", "course": "CHEM146", "review": "Please don't take her if you have a choice. She is awful! She tests on material she never goes over and blames the students when everyone fails. Her teaching methods are all over the place, she is obviously a smart person but is awful at teaching the material at a freshmen college level. I regret taking her, I wish I took general chemistry instead because you can take gen chem and be a biochem/chem major. Be prepared to fail if you take her. She destroys your self-esteem about you ability to do chemistry ", "rating": 1, "expected_grade": "", "created": "2011-12-12T18:06:00Z"}, {"professor": "Amy Mullin", "course": "CHEM146", "review": "She is a great lecturer but her exams are extremely difficult, so her lectures dont help at all unless you are some genius. ", "rating": 2, "expected_grade": "", "created": "2011-12-11T15:43:00Z"}, {"professor": "Bryan Eichhorn", "course": "CHEM146", "review": "I had him freshman year(2018) so i don't really remember a lot of his teaching style. His lectures were okay, he explained the concepts really well, he's also very helpful during his office hours and he does his best to answer them.For some also talked about barbecuing a whole lot during lectures .The past exams he posted were very much like the exams he gave us. One thing i'll say is practice a lot , he pulled a couple of questions right from the textbook once or twice. \r\nOverall, i think he's really fair in his exams, grading and curves. ", "rating": 5, "expected_grade": "A", "created": "2019-11-26T15:27:32Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM146", "review": "He's a nice guy, only thing annoying is he mumbles when explaining stuff sometimes and can be hard to hear and understand. His lectures are pretty boring and he usually goes over things in way more detail than necessary which isn't a horrible thing because then the exams seem more straightforward. There is homework due every week that takes anywhere from 1-2+ hours. He provides sample exams that are super similar to the actual exam so those are great study tools. The class is curved so an A is an 85. If you put in the time to at least do the homeworks and go to class for the clicker questions you shouldn't fail if you do somewhat okay on the tests. I never went to office hours because I was slightly intimidated. ", "rating": 3, "expected_grade": "A", "created": "2021-12-02T17:45:47Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM146", "review": "Very nice professor, but his lectures were very concept based and did not seem to connect much with the midterm or homework concepts. His practice exams covered what was on the test almost exactly so I would recommend studying from practice tests instead of lecture content. The TA for the class was terrible, he never seemed to double check his slides or have clear communication with Dr. Vedernikov.", "rating": 3, "expected_grade": "", "created": "2022-01-07T21:51:06Z"}, {"professor": "Andrei Vedernikov", "course": "CHEM146", "review": "Lectures have nothing to do with what's on the test, and everything in the textbook is expected to be prior knowledge. Couldn't follow his lectures at all and was not good at taking questions. Posts old exams that are exactly the same as the ones he gives. Only an easy class if you already have a good chem background(I had none). Went from an A to a B- in the last week. Easy to pass but hard to learn anything. ", "rating": 2, "expected_grade": "B-", "created": "2022-02-04T19:59:44Z"}, {"professor": "Efrain Rodriguez", "course": "CHEM146", "review": "Honestly such a great professor. Very caring about his student and more than willing to give help if approached. He makes it a point to form personal connection and does a good job of explaining concepts in different ways if you don't understand. You can tell he is super passionate.", "rating": 5, "expected_grade": "C", "created": "2022-11-10T05:21:46.537942Z"}, {"professor": "Efrain Rodriguez", "course": "CHEM146", "review": "He is very passionate about chemistry and cares about each student he teaches (even remembers the names of most people in the lecture). His midterms are fair as long as you study using his exam practice test, which is really helpful.", "rating": 5, "expected_grade": "A-", "created": "2022-12-18T03:49:29.782738Z"}, {"professor": "Efrain Rodriguez", "course": "CHEM146", "review": "Dr. Rodriguez was a good professor who was tasked with teaching the \"not so interesting\" general chemistry 1 class. He is very understanding and will answer your questions during class. The curve is based off he class average which made it easy to get an A even if you had trouble recalling some of the information from Highschool.", "rating": 5, "expected_grade": "A", "created": "2023-01-30T21:00:21.368035Z"}, {"professor": "Efrain Rodriguez", "course": "CHEM146", "review": "Honestly, Dr. Rodriguez is a great lecturer and professor. You can tell he wants his students to succeed. He explains stuff really well and he will eventually post lecture slides. He has 10 homework assignments, and he drops the three lowest. Three midterms, 50 points each, and the final is 80 points. The points are pretty evenly distributed but I wish there were more up for grabs as a grade booster. But really, you don't need the grade booster since he curves. He doesn't curve individual exams but he curves the final grade. He sets the average of the class at a B. So as long as you're above the average on the exams, you pretty much get an A. I will say though, that his exams are a lot harder than the content seen in class. The final was especially hard, the average being 10% lower than the midterms. The questions on his exams are usually worded differently than the ones done in class so it really messes everyone up. There are also multiple-choice questions which you would think is good, but when they're all or nothing it really messes with your grade. Definitely go to his office hours with questions, I regret not doing that. And go to discussions, I missed way too many and paid the price on my second midterm.", "rating": 4, "expected_grade": "B", "created": "2023-12-20T15:23:24.544984Z"}, {"professor": "Efrain Rodriguez", "course": "CHEM146", "review": "Very good lecturer, nice guy. You'll do fine in this class as long as you work hard and study. He's very understanding and remembers the names of almost everyone in the class. He also curves the class which is nice. I'd recommend doing the readings and going to discussion to do well!", "rating": 4, "expected_grade": "A-", "created": "2023-12-20T18:37:47.496225Z"}, {"professor": "Efrain Rodriguez", "course": "CHEM146", "review": "Professor Rodriguez was always willing to accommodate my office hour requests and is very approachable. His exams are a bit harder than the practice exams, but as long as you \r\nkeep up with the material and ask questions, you'll be fine.", "rating": 5, "expected_grade": "A+", "created": "2024-01-18T03:14:37.123194Z"}], "department": "CHEM", "course_number": "146", "name": "CHEM146", "title": "Principles of General Chemistry", "credits": 3, "description": "<b>Prerequisite:</b> Must have math eligibility of MATH140 or higher.\n<b>Corequisite:</b> CHEM177.\n<b>Restriction:</b> Must be in one of the following programs (Chemistry; Biochemistry).\n<b>Credit only granted for:</b> CHEM103, CHEM131, CHEM135, CHEM143, or CHEM146.\n<b>Formerly:</b> CHEM143.\nAn overview of the Periodic Table, inorganic substances, ionic and covalent bonding, bulk properties of materials, chemical equilibrium, and quantitative chemistry. CHEM146 is the first course in a four-semester sequence for Chemistry and Biochemistry majors.", "is_recent": true, "geneds": null}