{"average_gpa": 3.7601307189542488, "professors": ["Jerae Kelly", "Yewon Lee", "Yewon Lee", "Yewon Lee", "Yewon Lee", "Jerae Kelly", "Jerae Kelly", "Yewon Lee", "Katryna Andrusik", "Yewon Lee", "Katryna Andrusik"], "reviews": [{"professor": "Yewon Lee", "course": "CHSE205", "review": "A really good professor! She's really passionate about the subject and is really kind. She does give a lot of homework though, sometimes it's a 1 hour documentary, plus a reading, but watch it in 2x speed and you'll be fine. The class is mostly discussion based. You do not need to take notes on anything other than the homework and the guest speakers. She's really lenient when grading, as long as you read the rubric and put some effort into it, she'll give you 100%. For a class that gives 3 gen-eds, it's very manageable and you'll have fun doing it.", "rating": 5, "expected_grade": "A", "created": "2022-01-20T23:05:10Z"}, {"professor": "Yewon Lee", "course": "CHSE205", "review": "I was looking forward to the class given the subject, but she made it quite boring and it became difficult to even get myself to go to class. The only reason I attended was due to the group work that she had us do. Lectures were very unorganized, mostly consisting of long group discussions that lasted entirely too long and did not help in learning the material. She is a very nice woman but also has little control of the class. You'll have to put a bit of work into the class but nothing that is too time consuming or difficult. Reading materials were never really necessary to read thoroughly, I normally just skimmed to get the general idea and it was fine. Wished I came out learning more than I did.", "rating": 2, "expected_grade": "A", "created": "2022-08-19T00:38:57.038214Z"}, {"professor": "Yewon Lee", "course": "CHSE205", "review": "Super super easy class. I really recommend this class to everyone, you'll get an easy A if you just do the assignments how she asks you to do them. I currently have a 100 in the class and there is 2 weeks left of class. Very easy and the group work makes the class even easier. Also the professor is super nice and everything is online besides lectures. Presentation are virtual recordings and Midterm and Final Exam are online and only like 15 questions and they are all based on the notes that you take in class and the guest speakers that come. Overall, very easy class and everyone should take it if they are looking for an easy A with little effort.", "rating": 5, "expected_grade": "A+", "created": "2022-11-15T17:55:15.928203Z"}, {"professor": "Yewon Lee", "course": "CHSE205", "review": "Dr. Lee is one of my favorite professors here at UMD. She really tries to get to know her students in a big lecture and really appreciated what you had to say in class. Though attendance is not required, going to class was an awesome experience with discussions. Sometimes the length of the content before class is a bit outlandish, however, it sparks worthwhile class discussions. On top of this, the guest speakers she brings in are super interesting and provide so much depth to the class. The projects, group work, and quizzes/exams are not difficult in the slightest. Overall, if you want a good, easy gen-ed that you'll get something out of, absolutely take this course!", "rating": 5, "expected_grade": "A+", "created": "2022-12-16T18:24:51.099746Z"}, {"professor": "Yewon Lee", "course": "CHSE205", "review": "Dr. Lee is an incredible professor. She deeply cares about her students, both academically and emotionally; I felt very seen in her class and I can tell that she really makes an effort to understand her students. The layout of her class is very well-done and if you keep on top of your work, it is never overwhelming. The work she does give is very interesting, and a lot of it is readings and some amazing documentaries. Take this course!", "rating": 5, "expected_grade": "A+", "created": "2023-01-06T21:27:53.598562Z"}, {"professor": "Yewon Lee", "course": "CHSE205", "review": "her TAs do most of the grading work, so a large part of your class experience will be dependent on them. mine were ok, but dr lee was great! she is clearly very passionate about teaching and her students and brings a positive and understanding attitude into every class session. she is super easy to talk to if you have any trouble with the content or even something personal. this is a very important class so it is so important that the professor is good as well! really recommend taking this whether you're trying to knock a bunch of gen eds out or for personal interest, this is a class that will just make you a better person", "rating": 4, "expected_grade": "A", "created": "2023-12-07T14:43:06.702923Z"}, {"professor": "Yewon Lee", "course": "CHSE205", "review": "She really cares for every student and is super kind, but her TAs are hard graders, taking off for every little thing", "rating": 4, "expected_grade": "A", "created": "2023-12-12T03:49:04.539605Z"}, {"professor": "Yewon Lee", "course": "CHSE205", "review": "The TAs are the actual worst at grading. We will ask Dr. Lee multiple times if something is good to submit and they take off points still because they are the ones who grade. It's very challenging to get 100% on anything because they look for things to take off points it is ridiculous and frustrating when you put effort into something. Be sure to check every rubric also because they will intentionally hide things that they want you to add so that you lose points. Dr. Lee is nice but doesn't have much involvement.", "rating": 3, "expected_grade": "A-", "created": "2024-03-07T00:26:09.437027Z"}, {"professor": "Yewon Lee", "course": "CHSE205", "review": "This is an amazing course there is not a lot of work the exams are open notes and the assignments are easy. The class is fun and Dr. Lee is an amazing professor. The TAs are a little hard on the grading but fair.", "rating": 5, "expected_grade": "A+", "created": "2024-03-12T00:27:54.504643Z"}], "department": "CHSE", "course_number": "205", "name": "CHSE205", "title": "Disability: From Stigma and Sideshow to Mainstream and Main Street", "credits": 3, "description": "<b>Credit only granted for:</b> EDSP289I or CHSE205.\n<b>Formerly:</b> EDSP289I.\nExplores the cultural, historical, educational, and medical roots of difference among human beings and examines the impact of cultural and technological changes on individuals traditionally identified as disabled. The course is designed to develop a broad understanding of the concept of \"disability\" and the emerging technologies that shape contemporary understanding of this phenomenon and the lives of those considered disabled.", "is_recent": true, "geneds": null}