{"average_gpa": null, "professors": ["Alexandria Nunn", "Porter Olsen", "Mauro Resmini", "Sara Faradji", "Konstantinos Pozoukidis", "Chauncey Dennie", "Emily Flamm", "Mehdy Sedaghat Payam", "Oliver Gaycken", "Alan Montroso", "Oliver Gaycken"], "reviews": [{"professor": "Porter Olsen", "course": "CINE245", "review": "This class was so boring and do not take him if you want your grades to be in quickly. It took him a month and a half to grade the midterm paper. I took this class thinking it would not be much work, but you have to watch a 2 hour movie every week and readings. There are also 2 papers with one of them being 8 pages and a midterm and final. ", "rating": 3, "expected_grade": "", "created": "2022-04-28T14:35:47Z"}, {"professor": "Porter Olsen", "course": "CINE245", "review": "Professor Olsen does care about the material and is knowledgeable, but his execution of explanations falls short sometimes. The class was pretty alright, but I think it could have been better. Definitely not just an easy gen-ed, he treats it like a real cinema/film course. He can be accommodating and willing to listen, but will ultimately be fair. He does grade a bit more harshly than you would imagine for a 2xx level class. He also does take a long time to grade", "rating": 3, "expected_grade": "", "created": "2022-05-14T21:50:47Z"}, {"professor": "Porter Olsen", "course": "CINE245", "review": "Very nice professor, but I don't feel like I learned much. The grading was fair, but the professor is simply not the best lecturer which was frustrating. Also, a lot of people didn't participate because he didn't facilitate participation. Often when someone would participate, he wouldn't say much, so the discussion started and ended with that one person. Exams were easy. He is very accommodating so that was nice. ", "rating": 3, "expected_grade": "", "created": "2022-05-21T15:02:16Z"}, {"professor": "Mauro Resmini", "course": "CINE245", "review": "great class for people into film to learn about the culture and the technicalities of it. very interesting lectures twice a week and one dicussion. we had to write 3 scene analysis papers which were pretty easy, and then 3 3 question quizzes plus a midterm. very low maintenance class that was actually engaging and i learned a lot. definitely recommend for an HU credit!", "rating": 5, "expected_grade": "A-", "created": "2022-12-19T01:34:24.780789Z"}, {"professor": "Emily Flamm", "course": "CINE245", "review": "Kind, and gives good feedback. Lovely class & teacher!", "rating": 5, "expected_grade": "A+", "created": "2023-05-30T00:09:12.942971Z"}, {"professor": "Oliver Gaycken", "course": "CINE245", "review": "Really knows his stuff, a lot of textbook reading assigned but you usually can just skim or get information from lecture, all you really have to do is at least watch the assigned movie every week, take some notes at lecture, and most definitely come to discussion (attendance/participation is graded but honestly I barely participated and got an A for it--this probably depends on your TA though). Also he often started class a few minutes late while people trailed in, and a major plus: the exams are open note. The essays were okay (one was 1-2 pages, the other was 3)--short but analytical. There's a fun group assignment where you make a short story using different kinds of camera shots, basically a short film in a series of photos.\r\n\r\nOverall: Not too much graded homework and open note exams (1 on paper, 1 online midterm, 1 online final)", "rating": 4, "expected_grade": "A", "created": "2023-12-19T23:53:50.884262Z"}, {"professor": "Ariana Nash", "course": "CINE245", "review": "Nash was the TA for CINE245 this past semester. In discussion, she expects everyone to voice their opinions, yet will openly tell you that you’re wrong if she disagrees. Nash expects you to make the gen-ed your life and told us to devote 2+ hours to the readings on top of watching the movies. She grades super harshly (especially if your interpretations don’t align), so I would not recommend having her if you’re looking for an easy A.", "rating": 1, "expected_grade": "A-", "created": "2023-12-22T14:08:30.604982Z"}, {"professor": "Oliver Gaycken", "course": "CINE245", "review": "This professor is awesome! He has so much insight and so much to share about cinematography. I can feel his passion through his teaching. I really enjoyed this intro class and am now thinking about minoring in film. Very understanding and pushed back a few due dates/dropped the final essay for us. Grades consist of discussion participation, a midterm, an essay, the final exam, and like one or two minor projects.", "rating": 5, "expected_grade": "A", "created": "2024-01-12T15:51:23.315802Z"}, {"professor": "Alan Montroso", "course": "CINE245", "review": "Great professor! He makes sure that students actually understand all the material, evenly balances the workload between class and homework to ensure that students don't fall behind in his class or their others and always leaves very constructive comments for how to improve on future assignments. CINE 245 is an awesome class!", "rating": 5, "expected_grade": "A+", "created": "2024-03-28T12:17:40.608281Z"}], "department": "CINE", "course_number": "245", "name": "CINE245", "title": "Film Form and Culture", "credits": 3, "description": "<b>Cross-listed with:</b> ENGL245.\n<b>Credit only granted for:</b> ENGL245, CINE245 or FILM245.\n<b>Formerly:</b> FILM245.\nIntroduction to film as art form and how films create meaning. Basic film terminology; fundamental principles of film form, film narrative, and film history. Examination of film technique and style over past one hundred years. Social and economic functions of film within broader institutional, economic, and cultural contexts.", "is_recent": true, "geneds": null}