{"average_gpa": 2.918791009353623, "professors": ["William Proffitt", "Ryan Moore", "Jorge Bravo", "Lillian Doherty", "Gregory Staley", "Rian Sirkus", "Rachel Mullervy", "Francisco Barrenechea", "Madeleine Goh", "Eva Stehle", "Brendan Magee", "Jason Edwards", "Robert Santucci", "Nicole Love", "Talia Chicherio", "Katherine Wasdin", "Rachel Gryniewicz", "Edward Parker", "Katherine Wasdin", "Madeleine Goh", "William Proffitt", "Francisco Barrenechea", "Edward Parker", "Talia Chicherio", "William Proffitt", "Edward Parker", "Talia Chicherio", "Chiara Graf", "Edward Parker", "Eugenia Lao", "Talia Chicherio", "Alexander Cushing", "Christina Clark", "Kathleen Garland", "Francisco Barrenechea", "Chelsea Stolt", "Jorge Bravo", "Kathleen Garland", "Mary Contreras"], "reviews": [{"professor": "Lillian Doherty", "course": "CLAS170", "review": "The class had so much writing. Each assignment was worth 3 points and 1 was due every week. There is a lot of motivation not to do them because they're worth so little but it all adds up in the end. \n\r\nThe discussion was really interesting but that entirely depends on your TA. Professor Doherty is really really nice and really really boring. Though she may be passionate, she literally lectures like those history classes you see in movies where they exaggerate a typical history class...but this time...you're in the movie. I went to maybe 4-5 lectures and skipped the rest and still got an A. I worked really hard on the writing assignments though. \n\r\nI thought the readings were interesting, but if you have a big work load this class will be really annoying. Also, you'll spend hours studying for the exam because there's so much material, but the exam itself is soooooo easy. It's beyond easy. You still have to study but you'll definitely overstudy for them. ", "rating": 3, "expected_grade": "A", "created": "2015-01-29T15:33:00Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "This class is awesome. The prof is extremely understanding and knowledgeable about the subject. I like to read stuff so the hw for this class is chill. Exams do require a certain in-depth knowledge about the gods, heroes, etc. But if you read everything, its kinda similar to knowing characters in a novel. It's almost natural.  Plus, how many people do you know actually read Virgil, Ovid, Hesiod in addition to Homer? This is what an HL is all about. Reading dense stuff but enjoying it at the same time. \n\r\nTA can make a difference depending on how hard he/she grades on essays. But thats luck of the draw...", "rating": 5, "expected_grade": "A", "created": "2010-12-22T13:18:00Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "I happen to be the lone person who disagrees with the vast majority of comments here.\n\r\nWhile I do agree that Professor Doherty is extremely compassionate about the subject and tries to keep things as interesting as possible, I think she structures the course fairly badly.\n\r\nThe amount of reading is tremendous, absolutely tremendous, and this is coming from somebody that enjoys reading and used to do so quite frequently.\n\r\nI wasn't an avid mythology fan before hand, but I thought it was interesting and it fulfilled core for me. Note: The readings were NOT as interesting as I thought they would be. The vast, vast majority of readings fell greatly below my expectations. Definitely not as interesting as I thought they would be and other people here have made them seem.\n\r\nThe amount of information she can ask on the exams is ridiculous, there is so much material to cover per exam. While the exams end up not being that hard, it is frustrating that she would assign so much additional information that never makes it onto the exam. And I mean ALOT of information. Information that a decent student would probably spend studying and stressing out about for an upwards of an additional two hours per exam. It pretty much all comes down to blatant memorization of way too many names, then their roman names as well, then their attributes, then who are they related too, etc. etc. etc.\n\r\nThe study guides she gives you are not very helpful, they in essence tell you to study everything. There are parts of the study guides which single out specific events and learnings to study, and sometimes they do not even appear on the exam! Very frustrating.\n\r\nI however do feel like the minority in my judgement of this class. I feel like everyone that took this is either a Classics major or came into the class with a great deal of prior knowledge about mythology (more than your typical high school learnings go). Maybe I'm just a total dumbass. Who knows.\n\r\nThe only thing that made it bearable was my T.A. He was funny and interesting and keep us all in good spirits. If you're considering this class get Sepulva for a T.A.\n\r\nFinal Note: I felt like for the vast majority of this class, spark notes/ cliff notes are just not going to cut it. She changed the exam up for our second one where we would have to identify exact quotes from characters, who was talking, who was listening, and what it was about. They were moderately difficult even for someone that has read all the required material. \n\r\nI definitely put the most work into this class this semester and I thought it was more difficult than than ECON201 and accounting I.", "rating": 3, "expected_grade": "A", "created": "2010-12-16T16:35:00Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "Professor Doherty is very very nice and knows a lot about the class. The lectures are boring and halfway through the year I pretty much stopped going to them. It didn't matter though because she posts the lectures online and I learned everything from my TA in discussion. There is a lot of reading for this class, but most of it is very interesting and the work is very doable. The tests are easy if you study and memorize key names in the works. A good class overall.", "rating": 4, "expected_grade": "B+", "created": "2010-12-14T19:15:00Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "Professor Doherty is amazing.  She is so passionate about her course topic and always makes the class interesting.  She is very kind and always wants students to raise their hands and participate in lecture so do so!  She cares what we think.  Our whole lecture applauded her at the end of the semester and no professor has ever deserved it more.", "rating": 5, "expected_grade": "B", "created": "2010-12-09T17:47:00Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "Really nice woman with a great passion for her subject. A decent amount of reading but it's interesting and mostly easy easy to get through. The slides are online but I'd recommend going because she leaves a lot off of them (you can get by off just the online slides if you are intent on skipping though). Tests are manageable and papers are short. Good way to pick up an HL.", "rating": 4, "expected_grade": "A", "created": "2010-12-02T19:13:00Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "My TA graded papers pretty roughly, but I am a big fan of Dr. Doherty. I don't like the way she sets up lecture slides, they're basically her personal queue cards, but her lectures are always interesting. I like Mythology, so it was pretty easy to pay attention. The tests aren't horrible and the homework assignments are simple. Dr. Doherty is very fair and a very nice lady. She really is passionate about the subject and it's reflected in her lectures, attitude and assignments. She reads passages out loud in class (even in Ancient Greek sometimes). I hope to take another one of her classes soon.", "rating": 5, "expected_grade": "B", "created": "2010-11-01T21:24:00Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "I thought I would hate the class because I don't like to do required reading but it really wasn't that bad. I did the reading in the beginning of the class which was sort of interesting. Toward the end of the class I was just reading cliff notes and did just as well on the exams so I recommend doing that. The two papers are only 3 pages and are very simple. She also posts her lecture notes which you can definitely get by on.\n\r\nThere was 4 online quizzes that weren't the easiest in the world, for those you actually had to do the required reading. There was also 5 HW assignments which were basically answering a question in about a page or less so that wasnt bad. My TA gave out mostly 100's on those if you wrote anything decent. 88 is a A- in this class which is nice. ", "rating": 4, "expected_grade": "A", "created": "2008-05-26T11:47:00Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "A lot of reading but it's interesting for the most part. I found it really interesting but I liked mythology going into it. Lecture is pretty boring but dicussions are useful.", "rating": 4, "expected_grade": "", "created": "2008-05-08T03:09:00Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "Just go to class. She puts up notes online, but they don't help much for exams because she usually goes through other materials during lecture.\n\r\nRead the assignments. They're not novels like Jane Eyre (sorry to those who love this book, I hate it), they're epics, so there's backstabbing, killing, and sex. It's pretty sweet. Should be an A if you go to class and read.", "rating": 5, "expected_grade": "A", "created": "2008-05-06T19:06:00Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "All I can say is PAY ATTENTION ON THE FIRST DAY!  She will tell you exactly how to get an A in the course, and she's willing to help you if you have questions.  It's a huge class, so it's lecture style, and there's a lot of reading, but she explains everything.  She's also a very nice person who tries to help her students if she can.  She will be tough, though, if she thinks you're slacking or people are not paying attention in class.", "rating": 5, "expected_grade": "", "created": "2008-04-20T18:13:00Z"}, {"professor": "Gregory Staley", "course": "CLAS170", "review": "Is he a bad professor? Maybe not. Good? Hell no. I give him a 2.5 (rounding to 3).\n\r\nHe does not seem to understand the people that are taking this course are NOT taking it to hear about Freudian psychology. Everything is either a womb or a phallus. Seriously. They went into a cave? No they went into a womb. He expects you to either have some psych background or pick it up on the side, while still completing his massive number of readings.\n\r\nHe also expects you to be Christian, with decent knowledge of Bible stories. And into Star Wars. Don't know them? Well then you're going to have to do a bunch of additional work for some of the weekly assignments.\n\r\nThe assignments are all over the place; organization is very much not his thing. He also publishes everything in html pages that are so poorly coded that some browsers cannot open them. Have fun figuring out what the readings actually are through the wall of random text that has the titles and pages included, since he thinks that the return key doesn't exist.\n\r\nHis exams are terrible. There are a list of essays that you have to prep for. Then there is matching from hell and a short answer section that has occasionally super vague questions and you will inevitably run out of time to answer. Then the pictures. There's a whole bunch of random pictures in his slides and html pages, and you need to be able to recognize a tiny grayscale version of them. We complained that it was hard to tell what they were, and he got defensive and yelled at us for making excuses. The quality is often so shitty that you can't pick up on the clues for what it is and just need to memorize the pictures. Oh, despite the fact that spellings of the names vary between the readings, spelling counts.\n\r\nHe is a generally agreeable guy and a good lecturer, but his disorganization, womb obsession, and painful  exams make him not even close to your best choice for this class.", "rating": 3, "expected_grade": "", "created": "2014-05-20T02:23:00Z"}, {"professor": "Gregory Staley", "course": "CLAS170", "review": "Professor Staley is a wonderful lecturer as well as a caring and kind professor.  The work in this course was not hard at all as long as you did the readings - there are a lot of those, but most are interesting so it wasn't so bad.  There are 3 exams, 3 papers, and a final.  Discussions were mandatory and helped to clear up confusing topics in class.  I would wholeheartedly advise anyone to take this class if they can.", "rating": 5, "expected_grade": "A", "created": "2012-01-10T14:11:00Z"}, {"professor": "Gregory Staley", "course": "CLAS170", "review": "This is a really great class. I took the class for a core credit because of the great reviews on this site, but they are true. I thought the material was very interesting, and Staley is a great teacher. There are two exams during the semester, and you have to submit homework for discussion each week, which you must also attend. You also have readings for each class, which I would recommend doing as it helps you understand the material and it also helps you on the exams. There is kind of a lot of work to do in the class, but I felt it was worth it. Staley also tried to use clickers with his classes this semester and ended up having a lot of technical problems, but they helped you know if you were understanding the material. If you don't mind a little bit of work and want to take a great class, I would highly recommend CLAS170.  ", "rating": 5, "expected_grade": "B", "created": "2011-12-27T12:41:00Z"}, {"professor": "Gregory Staley", "course": "CLAS170", "review": "Dr. Staley himself is a wonderful professor.  Extremely sweet and nice guy who is very approachable and easy to talk to.  There is absolutely NO way you can dislike this professor.  That being said...I don't like this class.  I'm just not into mythology.  Took it thinking it was gonna be an easy HL core, but looking back sadly, I probably would have enjoyed another type of literature class, even if the professor wasn't as good.  That, and my brain's just not very literature oriented (I'm a science major).  Me disliking the class however has absolutely nothing to do with Dr. Staley.  He is a great, funny guy and an excellent lecturer.  Yea I know, totally mixed feelings, however, if you are interested in myths, this is the class to take!", "rating": 4, "expected_grade": "B", "created": "2011-12-17T01:38:00Z"}, {"professor": "Gregory Staley", "course": "CLAS170", "review": "Professor Staley is an excellent professor.  It's definitely not easy and there's a lot of readings but it's really worth it.  You don't have to be majoring in the classics to like this class.  Staley is like a cute little grandpa and I loved him.  He puts so much effort into his presentations and they are perfectly timed, you never get out early or late, always on time.  He tries to make his presentations relatable to the students.  He knows how to keep the students awake and interested.  Two exams throughout the semester and a final.  Two essays due throughout the semester also.  You have to answer about 5 questions weekly, due in discussions, which are mandatory.  Great class overall. ", "rating": 5, "expected_grade": "A", "created": "2009-12-16T00:22:00Z"}, {"professor": "Gregory Staley", "course": "CLAS170", "review": "Not gonna lie, its not an easy Core but its so worth all the work that I put into this class. Staley is a wonderful lecturer, I never missed any lectures. It was something I looked forward too. You don't have to be in love with the classics to appreciate this guy. A lot of readings but if you fall behind a little, wikipedia is always there. But you need to be able to analyze the myths you learn for the test.  He gives the essays that will be on the test and also he gives you all the important names that you need to know. I had a dictionary of classical myth which proved to be very helpful. ", "rating": 5, "expected_grade": "A+", "created": "2009-12-01T21:42:00Z"}, {"professor": "Gregory Staley", "course": "CLAS170", "review": "Staley is a great guy and a good professor. He does a good job of presenting the material, and although mythology can get kind of boring at times, with all the readings, he does a good job keeping it at least fairly interesting. Still, this is definitely not an easy A. I had a low B in this class and did poorly on the final, pushing me down to a high C+. There is a lot of reading and if you do all of it, especially when you are supposed to, it makes it a lot easier to follow the lectures, and you'll probably get at least a B. Some aspects of the tests can be difficult though, because there is simply just a large depth of information, and there are usually some pretty specific questions.", "rating": 4, "expected_grade": "C+", "created": "2008-05-19T13:09:00Z"}, {"professor": "Gregory Staley", "course": "CLAS170", "review": "Dr. Staley is a great professor. His lectures are interesting and I always enjoyed them. He is not an easy teacher though. The tests are difficult but he made the class so interesting that I barely minded studying for them.", "rating": 5, "expected_grade": "", "created": "2008-02-11T02:23:00Z"}, {"professor": "Gregory Staley", "course": "CLAS170", "review": "Dr. Staley certainly knows his mythology.  The course is interesting, just be prepared for 3 readings a week of 15+ pages.\n\r\nThis is NOT the easy A core that I was told it would be.\n\r\nThe textbook fell out of the binding after the first month.", "rating": 4, "expected_grade": "", "created": "2007-12-04T13:45:00Z"}, {"professor": "Gregory Staley", "course": "CLAS170", "review": "Staley is a master of mythology.  His lectures are interesting and hilarious.  He gives you outlines to follow along with his lectures and routinely uses movie clips in lecture to make a point and get a laugh.  Readings can be lengthy but are, for the most part, interesting. 2 mid-terms, 2 essays, and a final.  One-page writings due at discussion every week and discussions are mandatory.", "rating": 5, "expected_grade": "A", "created": "2007-11-28T12:11:00Z"}, {"professor": "Gregory Staley", "course": "CLAS170", "review": "i took his class as a core, but it really got me more interested in mythology. there is a lot of reading, but if you go to lecture, most of it isnt necessary. he makes lecture interesting and holds your attention. he is also really helpful if you have questions about anything from reading or the lecture, and the tests arent too bad if you take notes during lecture, he gives you the potential essays.", "rating": 5, "expected_grade": "A", "created": "2007-11-15T16:00:00Z"}, {"professor": "Gregory Staley", "course": "CLAS170", "review": "Dr. Staley is an amazing lecturer and I enjoy coming to class every day.  He obviously puts a lot of effort into making his presentations, and they are well thought out and offer answers to his essay questions.  In fact, most lectures will have the potential essay topic at the beginning, and he will give you answers to the question throughout the lecture.  Each test has 2 essays that come from about 8 that he gave during lectures, so you should have answers and notes for any essay he gives.  The tests also have short answer/multiple choice that comes from notes mostly (some reading) and they are a bit difficult because they usually aren't the big ideas, but include smaller, relatively unimportant characters and places from Greek myth.  For example, you might not see anything specific about Apollo, but you will need to know the name of one of his lovers.  But once you take the first one it will be easy to see how to study, and I did so much better on my second test.  The TA does all the grading so they are very important- James was really great and very interesting in discussion, which is mandatory and part of your grade.  The responses to reading give you easy points to bring up your grade.  Dr. Staley is a wonderful professor and I really recommend his mythology class.", "rating": 5, "expected_grade": "A", "created": "2007-11-14T17:45:00Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "You will probably good grade in this class but you also will probably have a horrible experience getting the grade if you have a strict TA. Becarful", "rating": 2, "expected_grade": "A-", "created": "2018-04-27T06:29:59Z"}, {"professor": "Madeleine Goh", "course": "CLAS170", "review": "Prof Goh was amazing! She knows what she's talking about and has passion for what she teaches. Her lectures can be long but she makes them interesting by talking about myths. She responds quickly to emails and is super nice. There's three required textbooks but I only opened one, if you go to class you don't need to read. Easy A just pay attention!", "rating": 5, "expected_grade": "A", "created": "2019-12-05T23:22:56Z"}, {"professor": "Ryan Moore", "course": "CLAS170", "review": "This is the best professor.", "rating": 5, "expected_grade": "A", "created": "2020-09-09T01:59:32Z"}, {"professor": "Katherine Wasdin", "course": "CLAS170", "review": "This class was super interesting and Professor Wasdin KNOWS HER MYTHOLOGY! She is very passionate about it and that makes it fun. It’s a ton of reading but it’s not boring. Super great elective choice. ", "rating": 4, "expected_grade": "A", "created": "2020-11-20T21:34:14Z"}, {"professor": "Katherine Wasdin", "course": "CLAS170", "review": "class was online and asynchronous. didn't talk to her once but its a rlly good class. ", "rating": 5, "expected_grade": "A", "created": "2020-12-14T17:39:23Z"}, {"professor": "Talia Chicherio", "course": "CLAS170", "review": "Talia is such an excellent professor and I cannot emphasize this enough. You know when a professor is really passionate about their subject and just knows it all and it helps you better understand it? Yeah, that's prof. Chicherio. She made Greek/Roman mythology more interesting than it already was and the class was very enjoyable. While there is a good amount to read for the class (as to be expected) it is totally do-able and the books we read were all fascinating. The HW was reading and discussion board posts, and if you read the material, the discussion posts aren't bad. She also was so quick to answer emails and was very considerate if you had any questions. If you are thinking about taking CLAS170, take it with Talia. By far my favorite class and I'm gonna miss it a lot!!", "rating": 5, "expected_grade": "B+", "created": "2021-01-12T04:36:18Z"}, {"professor": "Francisco Barrenechea", "course": "CLAS170", "review": "Great professor. Really chill dude. The reading overwhelmed me, but boy, I really feel like I learned something. Definitely take this class if you can tolerate an average of 40 page reading per week. (It got to 80 once...) ", "rating": 5, "expected_grade": "", "created": "2021-05-18T02:10:59Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "this class is horrible. It is a 100 level class but I am more concerned about it than my 400 classes. \r\n\r\nthe amount of content in the course is almost impossible to memorize.\r\n\r\nthe tests you are expected to know  the smallest things\r\n-only fill in the blank and an essay. No word box or anything\r\n\r\nTHIS CLASS IS A HUGE WASTE OF TIME", "rating": 1, "expected_grade": "A", "created": "2021-11-15T14:48:57Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "This class is a lot for a 100 level course, it's definitely interesting but A LOT of reading and memorizaition. You're expected to complete fill-in-the-blanks (no word bank), text identification, picture identification, short response, and an essay on each test (except the final which is cumulative and longer) in 50 minutes. My TA would grade the homeworks very harshly as if this is an english class. This class is not an easy A, you will have to put in a lot of work.", "rating": 2, "expected_grade": "B-", "created": "2021-12-15T19:56:31Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "I am here to warn you about this class, for the love of god do not take it. Doherty really is a lovely professor, very very knowledgeable about class content, and a great teacher. However, the amount of work this class assigns is INSANE. There's literally artwork identification on the exams. In the span of a month, you're expected to read 6 works, including the entirety of the Odyssey and the Iliad. It's far too much for a 100 level course. I have a 3.8 GPA and this class is about to ruin it. Never got below a B+ in college but I think I'm about to get my first C. I regret taking this class so much.", "rating": 2, "expected_grade": "B-", "created": "2021-12-17T14:12:50Z"}, {"professor": "William Proffitt", "course": "CLAS170", "review": "Such a good teacher! He is a very nice guy and gives a standard amount of work for a once a week class. The class is very interesting for a gen ed. I would 100% recommend mr. proffit and his class for an easy gen ed that you want to actually enjoy. Answers IMMEDIATELY and grades very fairly. There are a fair amount of readings, but if you know the content you'll be fine.", "rating": 5, "expected_grade": "", "created": "2021-12-17T22:03:11Z"}, {"professor": "Madeleine Goh", "course": "CLAS170", "review": "Professor Goh is a wonderful professor. She clearly cares about her students. Her class is both intellectually challenging and enjoyable, which is always a great combination. I've been interested in myths for a while and I learned a ton of new things I didn't know before in her class. Don't think this is a class you can blow off, though. There's a lot of reading and exams are weighted heavily and are fairly challenging. READ, go to lecture, and participate, and you will do fine in her class. ", "rating": 5, "expected_grade": "A", "created": "2021-12-18T21:57:45Z"}, {"professor": "Lillian Doherty", "course": "CLAS170", "review": "Professor Doherty is such a lovely professor. She really loves what she’s doing and her lectures are incredibly interesting. That being said, this class isn’t for everyone. I think that if you’re interested in Greek mythology and are willing to read (actually read and not use spark notes) then you’ll do fine in the class. The content is not too bad since it all flows together. However, there is a lot of it. I really loved this class since it acted as a break between all the stem classes I took for my major. This class isn’t what I would consider an “easy A” but it’s a class that you have to care about. So if you want an easy gened to cruise through this isn’t for you. But if you are interested and willing to put in the work then, I 100% would recommend this course.", "rating": 5, "expected_grade": "A+", "created": "2021-12-22T18:57:18Z"}, {"professor": "Madeleine Goh", "course": "CLAS170", "review": "I took this class to fulfill a GenEd humanity credit and ended up really enjoying the course. As the other reviews have mentioned Professor Goh is a great instructor who genuinely cares about the success of her students. The topics were always interesting and she kept the coursework both organized and straightforward. In order to do well in this class just make sure to keep up with the readings and weekly short essay assignments. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-22T22:29:12Z"}, {"professor": "Madeleine Goh", "course": "CLAS170", "review": "Professor Goh is so sweet and really cares about her students!  She is also very passionate and knowledgeable about the subject!  However, I bought a lot of books that I didn't end up needing and it was a very \"reading heavy\" course for a gen ed- and I took it during Freshman Connection.  I recommend the professor, so if you need to take this class she's a great option.  However, if you can take another class ot fulfill the requirement, I think that would be wise", "rating": 5, "expected_grade": "B+", "created": "2022-04-14T19:29:05Z"}, {"professor": "Talia Chicherio", "course": "CLAS170", "review": "Writing this as a senior with only one semester left, but I really miss this class (took it freshman year and it's hands down my favorite class). It was very interesting and Talia kept the course engaging even though it was pretty late in the evening. There is a fair amount of reading but it is doable and there are resources that will summarize the texts. There's a handful of writing assignments so if writing is your thing it should be a breeze. We had fun study sessions for exams during class and she was always open to helping with material and assignments outside of class. She is super kind and passionate about the material so if you pay attention, and do most readings you're golden.", "rating": 5, "expected_grade": "A", "created": "2022-10-28T22:53:12.441491Z"}, {"professor": "Madeleine Goh", "course": "CLAS170", "review": "TLDR: nice professor, can't keep the class' attention, lots of reading, graded things are few and far between\r\n\r\nFirst off, she is very nice. She does what she can to help you in the class, always has a positive attitude, clearly loves the material, and while I didn't reach out to her much, she was helpful when I did. Grades are split into 4 sections: 3 midterms, and homework. The lowest 4 homework grades get dropped, but she only ended up assigning 5, so I only had to do 1. Midterms are online and open note. This format unfortunately isn't good if you want to actually learn anything; I procrastinated prep for one of the midterms until 2 days before the test, did well, and have forgotten most of it by now. Having sat in the back, I could see what a lot of people were *actually* doing on their computers, and it was very rarely taking notes. She just stands there and talks at us, which I guess is her job, but she does NOTHING to get us to actually pay attention each class. If you're a little more diligent than me, you don't even have to go to class, you can just self study everything. All material covered is posted on canvas (4/5 in terms of her knowledge of how to use canvas btw), and she posts the slides anyways... which she doesn't bring to class finished. Pretty much every class, she's had to make a correction somewhere. Slides are also extremely bland, though readable. In terms of reading, there will be a lot, and most of it is the original poetry (translated of course, but still poetry). If that's not your thing, save yourself and do what I did: don't read any of it. Instead, use whatever other resources you have. Youtube, litcharts, sparknotes, you name it. This is mythology, there are resources on this everywhere. I haven't read a single line of poetry for this class (besides excerpts we read in class) and I've been doing fine. Youtube is going to be a lot more helpful earlier in the course, but don't just watch a single video and call it a day. Every video has a slightly different version of the myth, so watch a bunch and use their common ground, then correct anything you got wrong in class.\r\n\r\nI took this during freshman connection, though I don't think that affected much. This is an okay way to get a humanities gened, especially if you like Greek & Roman mythology.", "rating": 3, "expected_grade": "A", "created": "2022-12-03T17:14:10.550763Z"}, {"professor": "Katherine Wasdin", "course": "CLAS170", "review": "dr wasdin is a great lecturer and knows her mythology. i really enjoyed her class and it made me enjoy learning more about myths. there are a lot of readings, however, if you go to lecture/discussion and pay attention, you'll be fine and probably wont have to read much outside of class. there were 3 essays, a midterm, and a final. she posts study guides for each week and she always tell us what is on the midterm or final and what she expects for each essay. ALSO,  if you need an extension for a paper, just ask her and she'll give you as much time as you need. there were also weekly responses, however those are easy and short. dr. wasdin is also a pretty quick responder when it comes to emails and she always is very helpful.", "rating": 5, "expected_grade": "A+", "created": "2022-12-10T01:26:11.748323Z"}, {"professor": "Katherine Wasdin", "course": "CLAS170", "review": "Professor Wasdin is awesome! She KNOWS her mythology. She is so sweet, and willing to answer questions in class. She is super approachable, and wants everyone to understand the content/do well. Her lectures can be a little dry at times, but for the most part I found them very interesting! I took CLAS170 for a gen-ed, and ended up really enjoying the content. There is a lot of reading, essay writing, and memorizing, but if you put in the work you will do well!! TAs were awesome too!", "rating": 5, "expected_grade": "A", "created": "2022-12-16T17:54:04.861569Z"}, {"professor": "Madeleine Goh", "course": "CLAS170", "review": "This was one of the best classes I’ve taken so far!  Professor Goh is super nice and extremely knowledgeable in her field, so it’s very easy to talk to her and ask her to clarify any topic that we go over in class. She puts all of the readings on ELMS, so you don’t need to worry about buying textbooks. She assigns readings every week, but they tend not to be super long, and you don’t really need to read them. As long as you understand the general gist of the mythology, you’re set. Lectures could be long at times, but she does her best to tell the myths like stories, and she often lets the class out pretty early.  Throughout the course there were 3 midterms which each focused on only that unit of study.  They had 50 MC questions and 2 free responses, but you could chose which 2 to answer out of 3 questions, which really helped me out.  There were five homework’s assigned, but she drops the four lowest, so theoretically you only have to do one all semester, plus they are only supposed to be 2 pages long.  I took this class out of my interest in Greek and Roman myths, and I am not disappointed!  I would recommend this class to anyone with an interest in mythology, or anyone who wants an easy gen ed!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-24T03:38:47.631087Z"}, {"professor": "Katherine Wasdin", "course": "CLAS170", "review": "Really nice professor who is passionate about greek mythology. Although there was a lot of reading and essay work, I didn't actually read the greek myths but looked over her slides and looked up her weekly terms to study for the exams which is really useful, also used sparknotes to look up the summary. You can definitely get an A in the class without actually reading her assigned readings.", "rating": 5, "expected_grade": "A+", "created": "2023-03-04T05:13:37.546444Z"}, {"professor": "Francisco Barrenechea", "course": "CLAS170", "review": "I literally love this man and his lectures. He is so funny and makes the content really engaging, so it doesn't feel like you're learning about Greek mythology, which might come across as boring to some people. He really brings the material to life, and he's genuinely one of the best professors I've had. I took this class as a gen-ed, and while the exams were definitely demanding, it's a really fun class. Also, take Alex Houseman as a TA he is awesome.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T00:52:00.562333Z"}, {"professor": "Edward Parker", "course": "CLAS170", "review": "The professor is nice and usually replies to any concern or questions about the lectures and assignments. Lectures were interesting when it focused on aspects of epic poems from Greco-Roman mythology. Class is graded by few things, so make sure to study and understand the readings and lectures when doing the assignments. All assignments for the class were quizzes, a midterm exam, and a final exam. Overall, a good and easy course to take as an elective or if you want to know more about Greco-Roman mythological important figures and stories.", "rating": 5, "expected_grade": "B+", "created": "2023-07-14T18:25:16.834938Z"}, {"professor": "Francisco Barrenechea", "course": "CLAS170", "review": "I really didn't know what to expect when I first took this class, but I was definitely satisfied in the end. Professor Barrenechea is hilarious and personable, attending the lectures is something to look forward to every day. The workload is pretty manageable overall. In the first couple weeks you will only be reading a few paragraphs a day. Around the middle of the semester, the workload picks up and you will be reading a lot more, but it's far from bad. As long as you do the readings and take notes, this class will be an easy A.", "rating": 5, "expected_grade": "A", "created": "2023-08-26T22:57:40.979031Z"}, {"professor": "Chiara Graf", "course": "CLAS170", "review": "Good teacher, fun class, but if you are taking a gen ed humanities and want something fun and easy, look elsewhere. Lot of reading, and every assignment requires you do the readings. Sometimes she will assign a reading and give you extra time since it's \"a lot\" and then not do that for the next week which has twice as much for you to read.\r\n\r\nAnnoying, but don't take this as your last 3 credits in an overloaded semester, you'll come to hate Wednesdays.", "rating": 3, "expected_grade": "B+", "created": "2023-11-15T05:01:58.728976Z"}, {"professor": "Chiara Graf", "course": "CLAS170", "review": "Professor Graf is a very knowledgeable and helpful person. She wants all of her students to be engaged and excited about learning. She is very helpful to any questions and I definitely recommend this class. The readings can be a little but challenging but she posts context for most stories to make it a little bit easier. The midterm was easy and she gives lots of notice and study tips. There is only one assignment per week and it is very manageable.", "rating": 5, "expected_grade": "A", "created": "2023-11-15T18:02:47.198966Z"}, {"professor": "Kathleen Garland", "course": "CLAS170", "review": "Great professor, okay course-load. This class is reading heavy and its easy to fall behind if you do not keep up with it weekly. Ms. Gardner is very understanding and answers emails very quickly. She is happy to provide clarification on any assignment. Be aware she sometimes gives out random pop quizzes.", "rating": 5, "expected_grade": "A-", "created": "2023-11-17T14:56:32.543556Z"}, {"professor": "Eugenia Lao", "course": "CLAS170", "review": "She is a very hard grader and in class discussion, she does not accept any one else's ideas just her own.", "rating": 1, "expected_grade": "C+", "created": "2023-11-30T15:44:10.676336Z"}, {"professor": "Kathleen Garland", "course": "CLAS170", "review": "This is an easy gen-ed if you are somewhat interested in Greek mythology/classics. I was not fond of the organization of the class- pop quizzes, random tasks that make absolutely no sense (ex; check out 5000 books from the library just to never open them once), and boring lectures. She would expect us to watch boring lecture videos and then quiz us on them. Aside from the annoying assignments she gives, Garland is really nice and understanding, replies to emails fast, and is very knowlegable in Greek mythology. There are easier gen-eds out there, but this ones not a terrible choice.", "rating": 3, "expected_grade": "A-", "created": "2023-12-01T03:21:16.401665Z"}, {"professor": "Chiara Graf", "course": "CLAS170", "review": "Dr. Graf is great. Her lectures are genuinely interesting. This class has a hefty amount of reading, but she gives a lot of context in lectures that you can get by on. There is only 1 written assignment a week based on the readings, only 300-400 words. The midterm was pretty simple if you study good, and there is an essay. Ours was meant to be written in-class due to AI, but it ended up being online because of the extended Thanksgiving break. In the future, though, i'm sure it will be in person. The final is a combination of the midterm and this handwritten essay, we shall see how that goes.", "rating": 4, "expected_grade": "A", "created": "2023-12-02T04:12:08.740173Z"}, {"professor": "Chiara Graf", "course": "CLAS170", "review": "WHAT ARE YOU DOING, TAKE HER CLASS!!! \r\nThis is a really good class to take for elective credit or for a DSHU, SCIS credit \r\nShe is honestly an amazing professor, her last 2 midterms have been very reasonable and it works well with what the class been teaching. Same for everything else, you just need to do the work and go to class or even if you don't go to class you can understand from her slides. The assigned reading and response every week is basically the only homework you will have and I LOVE THAT. There are assigned type of readings that she would let you know of that will prepared you for class but you don't really have to do it, she gives a good brief summary during her lecture. The TAs are also very nice and useful. Just a great overall class, honestly my favorite class of the semester I am glad I'm taking it. You can just tell when she talks she really enjoys what she's teaching and just her positive light attitude matched with her humor makes just listening to her talk interesting and what you learn get into your head more. The midterms are also very much based on what she teaches and she gives you ample time and does well with preparing you and making sure you will do great. You just gotta learn and try!", "rating": 5, "expected_grade": "A+", "created": "2023-12-04T16:56:14.108147Z"}, {"professor": "Francisco Barrenechea", "course": "CLAS170", "review": "Took him last semester and he's an absolute madman in the best way possible. He's absolutely hilarious, literally called a greek hero a \"boytoy\" to the delight of the class. Always very personable, and there's no deception at all. If he's upset or proud he will let you know, which is very refreshing. Make sure to do the readings but tbh the readings are super enjoyable, as are his lectures. You'll literally want to show up to lectures and do well. Would 100% recommend this teacher and this class, you won't regret it", "rating": 5, "expected_grade": "A", "created": "2023-12-18T00:01:16.640711Z"}, {"professor": "Eugenia Lao", "course": "CLAS170", "review": "she is a hard grader, incredibly unorganized, gets lost in her thoughts, lowkey does not know how to teach, do not take her class, despite the interesting material she somehow found a way to make it the MOST BORING CLASS EVER", "rating": 1, "expected_grade": "B-", "created": "2023-12-19T19:44:55.302805Z"}, {"professor": "Chiara Graf", "course": "CLAS170", "review": "She is a very passionate and kind professor, but this class is too much work for a gen ed. Do not take this class with her if you are looking for an easy class to fill your schedule. There are a lot of readings, assignments, and things you have to memorize. The topics are pretty interesting though, and she does a pretty good job going through all of the material. The exams are a lot of writing, and you have to memorize such minor details about the lectures or readings, such as people's names, a random city's name, etc.", "rating": 4, "expected_grade": "A+", "created": "2023-12-28T01:23:38.531986Z"}, {"professor": "Christina Clark", "course": "CLAS170", "review": "Dr. Clark is really nice and caring but the class is a lot of work. Readings are usually 20-30 pages of the textbook and there will be a quiz or written prompt following most readings. Lectures just go through the reading in depth can be boring but participation is graded. Tests are pretty hard but she doesn’t grade too hard. Overall, interesting and fun class but lots of work.", "rating": 4, "expected_grade": "A", "created": "2024-02-07T21:32:14.108576Z"}], "department": "CLAS", "course_number": "170", "name": "CLAS170", "title": "Greek and Roman Mythology", "credits": 3, "description": "Cross-listed with RELS170.\n<b>Credit only granted for:</b> CLAS170 or RELS170.\n<b>Additional information:</b> This course cannot be taken for language  credit.\nAn introduction to the mythology of ancient Greece and Rome. This course is particularly recommended for students planning to major in foreign languages, English, history, the fine arts, or journalism. Taught in English.", "is_recent": true, "geneds": null}