{"average_gpa": 3.346428571428571, "professors": ["Ines Rivera", "Uchechi Okereke-Beshel", "Nataliya Pratsovyta", "Manon Soulet", "Sarah Bonnie", "Martina Domnick", "Michael Colson", "Emilee Durand", "Amanda Dykema", "Chinenye Okparanta", "Ellen Moll", "Jeremy Metz", "Liora Moriel", "Lindsay Bogner", "Ana Farach", "Niloufar Etemad Sarabi", "Elise Auvil", "Tung-An Wei", "Fatima Taha", "Keisha Allan", "Norrell Edwards", "Sarah Humud", "Nabila Hijazi", "Brian Davis", "Sara Faradji", "Kerishma Panigrahi", "Justin Thompson", "Nasim DarouieHaghighi", "Nahid Ahmadian", "Da Som Lee", "Nahid Ahmadian", "Andrea Knowles", "Rachel Waugh", "Da Som Lee", "Ariana Nash", "Xiaofang Huang"], "reviews": [{"professor": "Nahid Ahmadian", "course": "CMLT275", "review": "Least favorite professor I have ever had. She didn't just play favorites, she treated students who she felt didn't work hard enough disrespectfully. I have never been so frustrated by an individual in my life. She grades purely off of emotions. As someone who got an A- in English 101, I know that I am not a terrible writer. Was I the best writer in the class no, but my writing was better than some of the grades I received. This class made me feel like less of a feminist. Some of the stories and novels she forced us to read were absurd. I hope to never have a class with her again and if I do I will be switching out. ", "rating": 1, "expected_grade": "B", "created": "2019-12-19T21:33:25Z"}, {"professor": "Nahid Ahmadian", "course": "CMLT275", "review": "She is the worst professor I have ever had. She plays favorites and gets mad that her class is not #1 priority. Recommend to never take her. Very biased on her thoughts and didn't even let her students meet with her for the final presentation and paper outside of class. She was often unprepared and made us read erotic poetry, short stories and novels. I showed my mom the book we had to read and she was applaud that a professor would assign such a reading to her students. 0/10 would take the class again. ", "rating": 1, "expected_grade": "B-", "created": "2020-01-13T02:33:55Z"}, {"professor": "Justin Thompson", "course": "CMLT275", "review": "Such a great professor! WGSS275 / CMLT275 (Women in Literature) was one of the best Gen Eds I have taken at UMD. The structure of the course is very simple yet meaningful - we read about 3-4 texts throughout the course of the semester, and we wrote 3 close reading papers (not including the final paper). Each text was a very unique take on how women are potrayed in fiction and non-fiction books, graphic novels, etc. Such a wonderful class if you love reading! Not too much to ask for a 3-credit class. Wonderful professor and totally recommend!!!", "rating": 5, "expected_grade": "A", "created": "2021-12-13T19:30:27Z"}, {"professor": "Justin Thompson", "course": "CMLT275", "review": "A great professor! The class discussions and books were meaningful and eye-opening. He is very funny and understanding, which created a comfortable atmosphere.  His feedback on essays is blunt, which can be taken as harsh but if you don't take it personally and actually implement them, you'll become a better writer in the end. The workload is not very heavy, just read the books and be ready to discuss. ", "rating": 5, "expected_grade": "A", "created": "2021-12-20T20:34:09Z"}, {"professor": "Andrea Knowles", "course": "CMLT275", "review": "The kindest professor out there! She is fair and truly cares about her students. During the midterm review, multiple students expressed concern about completing weekly reading responses, so she decided to drop an additional one out of the grade book. She gives a lot of feedback and her ultimate goal is to create an open and inviting conversation. Once I went into office hours to get help on the first paper, and she was unable to tell me the form of the poem, so instead she gave me resources to find it myself. However, a few hours later I received an email from her with all of the details about the poem's form, and some suggestions about how I could incorporate that research into my paper. She is extremely caring and altruistic. Definitely take her course!!", "rating": 5, "expected_grade": "A", "created": "2022-10-28T20:25:22.590436Z"}, {"professor": "Rachel Waugh", "course": "CMLT275", "review": "Super sweet professor. I recommend taking her if you can.", "rating": 5, "expected_grade": "A+", "created": "2023-03-01T18:23:18.914460Z"}, {"professor": "Rachel Waugh", "course": "CMLT275", "review": "Hands down one of, it not the BEST professor I've had! She's super sweet and she makes sure that everyone her classes feels comfortable and included. She's also very flexible and understanding when it comes to her assignments and deadlines so do not hesitate to ask her questions when you need help on something! I will say that there is quite the amount of reading (this semester, we read 8 books) and this is a very discussion based class, so try to participate! All in all, the work is very doable and you will not regret taking this class and having her as your professor.", "rating": 5, "expected_grade": "", "created": "2023-05-13T02:53:56.017452Z"}, {"professor": "Ariana Nash", "course": "CMLT275", "review": "Professor Nash is a very nice professor. The class is very interesting and she really tries to keep your focus on the meaning of the text instead of throwing books at you. She wants you to try to understand the texts through several lenses and really cares about how much effort you put in rather than your interpretation of the text. The reading load can be a lot but it's all fairly interesting so it's not too bad. She is very considerate of her students needs and adjusts the workload accordingly. The actual workload is approximately 500 words a week which is very manageable. Grading is very much about how much effort and thought you put in so if you put in effort and do your readings the class is fairly easy. She is also very nice and accommodating so if you have any issues just send her an email or go to her office hours and she will try her best to help you.", "rating": 5, "expected_grade": "A", "created": "2023-11-27T20:02:21.996709Z"}, {"professor": "Ariana Nash", "course": "CMLT275", "review": "Ariana was such a lovely professor. She is compassionate and empathetic towards all of her students, and gives thoughtful feedback and emails. The workload was a bit much for the class, sometimes having to finish one novel in a week and a half. If you consider yourself a slow reader, this class might be a bit hard to keep up with. Lots of the readings were interesting, some not as much. There were weekly reading responses of 500 words, a midterm paper, and a final paper. Overall, the class was not a breeze but I still enjoyed her discussions. I would recommend Ariana for any class, honestly.", "rating": 5, "expected_grade": "A", "created": "2024-01-29T23:24:20.742946Z"}], "department": "CMLT", "course_number": "275", "name": "CMLT275", "title": "World Literature by Women", "credits": 3, "description": "<b>Cross-listed with:</b> WGSS275.\n<b>Credit only granted for:</b> WMST275, CMLT275 or WGSS275.\n<b>Formerly:</b> WMST275.\nComparative study of selected works by women writers of several countries, exploring points of intersection and divergence in women's literary representations.", "is_recent": true, "geneds": null}