{"average_gpa": 3.4961965134706814, "professors": ["Charles Kassir", "Alyssa Neuner", "Andrew Nolan", "Savannah Renehan", "Jessica Long", "Corie Brown", "Veronica Sanchez", "Amy Vaillancourt", "Charlotte Avery", "Charlotte Avery", "Madeline Georgevich", "Maggie Loughlin", "Brennan Rudy", "Diana Bridgett", "Brennan Rudy", "Diana Bridgett", "Jenyia Wilson", "Ronaisha Ruth", "Noah Owens", "Nyree Watson"], "reviews": [{"professor": "Corie Brown", "course": "CMSC100", "review": "A good instructor. Grades lightly. If you are a CS major or an InfoSci major, this is the one credit elective with less workload you are looking for! ", "rating": 5, "expected_grade": "A+", "created": "2021-12-07T23:28:09Z"}, {"professor": "Charlotte Avery", "course": "CMSC100", "review": "The course was a little boring at times and some of the assignments seemed like busy work, but not hard at all. Easy way to add a credit to your semester. Charlotte Avery was very nice and understanding and did seem to care about the class.", "rating": 4, "expected_grade": "", "created": "2022-12-05T01:31:01.295096Z"}, {"professor": "Madeline Georgevich", "course": "CMSC100", "review": "A really chill professor. A lot of really helpful assignments. Basically hands out 100%s on every assignment. Some classes don't really have the most interesting topic so they are quite boring while others are super fun. Attendance isn't mandatory and a schedule is included in the syllabus, so you can basically go to the classes you want and not go to the others.", "rating": 5, "expected_grade": "A+", "created": "2023-01-07T03:32:48.839405Z"}, {"professor": "Ronaisha Ruth", "course": "CMSC100", "review": "Course: Very easy course, learn about opportunities, careers, and history of computer science. Lot’s of time faculty came in to give a presentation or talk about what they did in their field of work. Attendance is required from an attendance google form, so you can get by with it on paper but the professor will know that you didn’t show up. Assignments are pretty miscellaneous and very easy. It's bizarre to me that some people in the class failed it because they didn’t do a single assignment, this is quite literally the easiest class at UMD. This class is either you get lower than a 40%, or just do the assignments that take no longer than 15 minutes each and get a free 100%.\r\nProfessor: She is super nice! She is a really cool person to talk to outside of class, as she is also pretty young for a professor. She is also pretty interested in cybersecurity so if you have an interest in that, she is a good person to talk to. I would definitely recommend taking any of her classes and keeping in good contact with her!", "rating": 5, "expected_grade": "A+", "created": "2023-12-10T19:50:07.838131Z"}], "department": "CMSC", "course_number": "100", "name": "CMSC100", "title": "Bits and Bytes of Computer and Information Sciences", "credits": 1, "description": "<b>Restriction:</b> For first time freshmen and first time transfer students.\n<b>Cross-listed with:</b> INST101.\n<b>Credit only granted for:</b> CMSC100 or INST101.\nStudents are introduced to the fields (and disciplines) of computer science and information science within a small classroom setting. They will learn to make a successful transition from high school to the university, while exploring study skills, student success plans and research opportunities.", "is_recent": true, "geneds": null}