{"average_gpa": 3.388554778554779, "professors": ["Hector Corrada Bravo", "John Dickerson", "Amol Deshpande", "Prem Saggar", "Mohammad Nayeem Teli", "Kyungjin Yoo", "Jose Calderon", "Elias Gonzalez", "Elias Gonzalez", "Maksym Morawski", "Maksym Morawski", "Mohammad Nayeem Teli", "Mohammad Nayeem Teli", "John Dickerson", "Maksym Morawski", "Fardina Alam", "Christopher Kauffman", "Fardina Alam", "Mohammad Nayeem Teli", "Fardina Alam", "Maksym Morawski"], "reviews": [{"professor": "Hector Corrada Bravo", "course": "CMSC320", "review": "CMSC320: really interesting lectures imo. Apparently lots of people disagree, as very few people attended lecture (maybe 25%? of ~180). He was pretty lenient on assignments: he gave extensions on ~50% of the projects due to people asking on piazza.", "rating": 5, "expected_grade": "A+", "created": "2018-05-23T05:56:05Z"}, {"professor": "Hector Corrada Bravo", "course": "CMSC320", "review": "Pros: Was a really, really nice guy when I went to talk with him during his office hours.  You can tell he's very knowledgeable in his field.  He is also the most lenient grader I've ever seen (apart from Meesh) and gives a lot of extra credit.\r\n\r\nCons: His lectures were pretty horrible. They were very hard to follow and required that you knew a lot about statistics going into the class (he mumbles a lot and tends to gloss over the basics).  Calculus based statistics is basically a hidden prereq for this course, which sucks because I didn't take calculus based statistics.  The biggest problem I had with him as a professor is that I actually didn't learn anything all semester.  I honestly don't know any more now than when I started this class.  He is a lenient grader, but what that really means is that you can basically stop going to class and BS every assignment and still come out of the class with a decent grade.  I got a B, but I did NOT deserve a B.\r\n\r\nI will say that I learned some VERY basic stuff about the R language, but that's about it. I didn't learn the stats, I didn't learn the ML, I learned how to pretend I knew stats and ML.", "rating": 2, "expected_grade": "B", "created": "2018-05-23T14:52:15Z"}, {"professor": "Hector Corrada Bravo", "course": "CMSC320", "review": "Hector is a decent guy and research professor, but he's honestly a horrible lecturer. My friend (who was a TA for the class) hyped up this class a lot, and it was a big disappointment.\r\n\r\nAbout 75% of students stopped going to class after a few weeks because his lectures were fast-paced, hard to follow, and he mumbles/glosses over important concepts. Nobody tells you that calculus-based stats is a needed prereq for this course, and on top of that, Hector uses his own statistical notation in his notes (which often differs from the standard). The bi-weekly homeworks aren't too bad, but his exams are conceptual and weirdly difficult.\r\n\r\nBe warned - it's hard to learn anything from this class. If you take it, make sure it's on a semester when Hector teaches Python (R is useless the way he teaches it). \r\n\r\n\r\n\r\n", "rating": 2, "expected_grade": "B", "created": "2018-06-11T16:49:47Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "Projects are not too bad. One midterm, really hard because he doesn't provide study materials for it. great class", "rating": 4, "expected_grade": "B+", "created": "2018-12-08T00:26:02Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "Great Professor Overall - went over content in depth but well. Was a bit hard to ask questions in a big lecture hall, but I don't think that's on him. Projects were interesting and overall a good class.", "rating": 5, "expected_grade": "B+", "created": "2018-12-11T17:05:28Z"}, {"professor": "Prem Saggar", "course": "CMSC320", "review": "Took him for CMSC320. Went to lecture even though almost everybody else didn't. He would go over about 6 slides in an hour and 15 mins. He just was bad in all respects. He was a nice guy, probably a good coder, just not a good professor.", "rating": 1, "expected_grade": "A-", "created": "2018-12-11T17:06:46Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "10/10 would recommend this Prof. CMSC320 with him is very interesting. Projects actually helped me learn a lot of Python and ML stuff. ", "rating": 5, "expected_grade": "A", "created": "2018-12-25T22:50:42Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "honestly i did not learn much from his lectures. i mean i looked at his slides and learned but i don't really like his lecture style. i stopped going after the midterm since there's no final exam. the TAs were sometimes very unresponsive on piazza and the projects are veryyyy vague and can be unclear what they want. then when you do what they want, they take more points off because of \"requirements\" that weren't even mentioned in the description(this didn't happen to me but some other people). overall if you have to take 320 it honestly doesn't matter, i wouldnt go out of my way to avoid dickerson and he's a pretty nice person and has done a lot of great work/projects(check his kidney transplant scheduling..thing) but i didnt really like the experience of 320. ", "rating": 2, "expected_grade": "A", "created": "2019-12-21T02:43:05Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "Course size is way too large. Dickerson is a good lecturer, but I think the the course covers too much material overall. Learned a bit of python and pandas, and projects were okay.", "rating": 5, "expected_grade": "A-", "created": "2019-12-22T21:31:59Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "Really liked the structure of the class. 4 projects, a midterm and a final project, along with weekly quizzes online. The material is interesting, however does not go super in depth. Slides are posted on the class page and contain all the information you need to know very thoroughly", "rating": 5, "expected_grade": "A", "created": "2020-01-06T09:38:42Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "He's a good lecturer and a nice guy, but it's almost impossible to reach him by Piazza or email because he barely ever responds to anything. TAs similarly were very unresponsive on Piazza, and he and the TAs were super late/negligent on giving help and practice material.  For our midterm, we barely got any test practice and what we did get was only a few days before the exam. This may probably be benefited by having more TAs in this class.  Also, project descriptions were vague and full of errors. \r\nDespite this though, the grading is very lenient on the projects and final once you put in the work, so I'd probably still recommend him over the other guy (Hector). ", "rating": 2, "expected_grade": "A-", "created": "2020-10-26T03:40:34Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "Not the worst CS professor I have had, but I wasn't impressed. Lectures often delved into hard to follow free-hand mathematical derivations that he would speed through (especially true for the latter half of the class that was focused on ML algorithms). I often felt confused after lectures and bored midway through.  I found understanding in the material through reading lecture slides for some of the topics. Lecture slides for ML algorithms (ie linear regression, KNN, decision trees, random forests, etc) were confusing and I got a way better understanding by watching youtube videos on relevant topics. The midterm was ridiculously difficult which was annoying; the average was pretty low. Projects are interesting in my opinion; I really enjoyed the web scraping project. It was a great introduction to the topic. All projects were written in Python. I can say I gained a lot of worthwhile experience with relevant data science Python libraries such as NumPy, Pandas, scikit-learn, Matplotlib, and others. I would take this class again but I cannot say I recommend this professor.", "rating": 3, "expected_grade": "", "created": "2021-01-12T02:57:44Z"}, {"professor": "Jose Calderon", "course": "CMSC320", "review": "Great professor, cares about his students and is chill during class.", "rating": 5, "expected_grade": "", "created": "2021-03-07T19:17:09Z"}, {"professor": "Jose Calderon", "course": "CMSC320", "review": "I had an amazing time in Professor Calderon's class, I believe he is easily one of the best undergraduate CS professors at UMD.\r\nI took this class in Spring 2021.\r\n\r\nPros:\r\n+ Infectious passion about data science, very easily bleeds into his teaching style\r\n+ Extremely intelligent regarding course material. It is very obvious this isn't his first rodeo\r\n+ Does his best to make even the most complex material digestable and easy to understand\r\n+ Answers any and all questions regarding lecture content and project questions\r\n+ Tests and projects are fair\r\n+ Plenty of extra credit opportunities\r\n\r\nCons:\r\n- Lectures would occasionally go long (although this was rarely an issue)\r\n- This is barely a con, more a given of most upper level classes, but there is no late deadline; either it's on time, or a 0. However, I would hardly call this unfair, there is plenty of notice as to when projects are due.", "rating": 5, "expected_grade": "A+", "created": "2021-05-23T03:08:53Z"}, {"professor": "Jose Calderon", "course": "CMSC320", "review": "Probably the best CS teacher I've ever had at UMD. I'll just say this - if this dude was my professor for every single CS class, my life at UMD would have been much easier and so would my GPA. \r\n\r\nEverything from the quiz policies to the lecture slides were just right. All you had to do to pass quizzes was get 3/5 questions right. The lecture slides were very helpful too because I barely attended any Zoom lectures (only like 1 or 2 lol) and only caught up by skimming over the slides (not that I recommend you do the same) and still was able to have a solid grasp of the material and get an A+ final grade. Furthermore the take-home midterm was a piece of cake. He is extremely understanding - I had some issues at the deadline for projects but he was very lenient about extensions. Don't hesitate at all to take this course with Jose, you will learn a lot about an extremely important field from a super chill teacher while not having a heavy workload and the stress that comes with it.", "rating": 5, "expected_grade": "A+", "created": "2021-05-28T03:35:28Z"}, {"professor": "Jose Calderon", "course": "CMSC320", "review": "Simply fantastic when it comes to lecturing and organizing class materials. He was also a lenient grader and always reachable during this last online semester. ", "rating": 5, "expected_grade": "A+", "created": "2021-06-29T11:59:32Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "This class is much harder than it needs to be because of how disorganized it is. The lectures cover maybe 10% of what you need to know for projects. John and the TAs rarely answer questions on Piazza, and when they do they're usually not helpful. There are basically no practice materials for exams, or even general information on what topics are covered. Project descriptions are extremely vague and ambiguous.", "rating": 1, "expected_grade": "", "created": "2021-10-10T21:22:39Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "Very fair teacher, but lectures are pretty boring. Projects take a long time but are not very complicated. Class is very slow at grading so you will not know how you did on a project for at least a month.", "rating": 4, "expected_grade": "A-", "created": "2021-12-06T18:38:21Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "Absolutely ridiculous how long it takes a project to get graded.", "rating": 3, "expected_grade": "", "created": "2021-12-20T18:12:14Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "Dickerson is a nice and approachable professor. However, I found that the projects were unecessarily difficult and took a long time to complete. The TAs weren't very helpful, so this class ended up taking a lot more time than expected. The grading is also pretty slow. However, Dickerson did a good job teaching and was generally quite engaging. The final project, which requires making a tutorial, was a great resume builder and was fun to work on. ", "rating": 4, "expected_grade": "A", "created": "2021-12-23T00:28:33Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "Firstly, hes a pretty young and chill guy. His lecture topics are relevant and he makes the course in Python so that you can actually benefit from the material in the class. The course itself is actually kind of interesting. Now here is the kicker, it takes a CENTURY for him to grade stuff. The projects themselves are quite time consuming, and I had to google how to do half the shit on the projects because he makes them so you learn as you go. There are about 4 TA's in the class and they tend to be not helpful themselves. He gave us 2 mid term exams, one which was kinda hard, while the other which was kinda easy. Though he gives no practice, so you do not know how to study for any of his exams. He is also an awful communicator to the point where he avoids questions on piazza because he simply doesnt feel like answering them. Ive seen him answer like 2 questions and then ignore all the others. For our Final Project (no final exam), he is independently grading all of them so obviously it may take a bit, but he essentially just assigned us grades on testudo and didnt even tell us what we got on our final projects. When asked on piazza about it, he has been stone cold silent. We did not get our project 3/4 grades until the day before our Final Project was due. We got our project 2 grades the week before that. Keep in mind these projects were due like months before.", "rating": 3, "expected_grade": "A-", "created": "2021-12-27T00:53:23Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "Honestly, I was pretty excited for this class, but I was disappointed this semester. As others said, Dickerson is a nice guy and he's a decent lecturer. I found the lecture content, however, to be boring. Perhaps this was just me excepting data science to be less math oriented and theoretical. The lectures would sometimes seem to be overly complicated. The content that you learned in lectures barely helped for the projects. I remember being quite frustrated by the first project because I was going through slides and I didn't know how to do it. Once you realize that the projects are a lot of Googling how to use the tools they give you (such as Pandas and numpy), they become pretty easy. Even though they were easy, the projects were tedious and uninteresting, and they do take quite a bit of time. I expected more of a coding class, but you have to explain and analyze a lot of things in your project (which is I guess how data science is, but I found it uninteresting). There's only four projects, however, and the fourth one (the map one) was pretty short and interesting. The projects were graded leniently, with averages in the high 90s, but they took way too long to grade them. The midterms didn't end up being too difficult, but he had basically no practice material. It'll probably get better as time goes on since he'll just re-use old exams as practice, but I had no idea how to prepare for his midterms. Since the projects have basically nothing to do with lecture, I stopped going after the second midterm (there's no final exam, just a final project). He has you do weekly reading quizzes and they were pass/fail, so they were pretty much free points. The final project is basically what you make out of it. It's a great opportunity to put something meaningful on your resume as someone down below said, but I ended up doing something much easier for a good grade. Still, it's very open-ended and a great idea.\r\n\r\nEven with all my complaints, the class itself wasn't very difficult to be honest. Dickerson is a nice guy and a decent lecturer, and you will be be fine if you take a class with him.", "rating": 3, "expected_grade": "A", "created": "2022-01-11T18:14:03Z"}, {"professor": "Jose Calderon", "course": "CMSC320", "review": "Hands down the best CS professor I have ever had. Very engaging lectures, fair exams, and challenging (but interesting) projects. ", "rating": 5, "expected_grade": "A", "created": "2022-05-21T19:40:38Z"}, {"professor": "Elias Gonzalez", "course": "CMSC320", "review": "Did a good job with the course although the content and lecture was kind of boring at times. Projects and exams weren't too bad.", "rating": 5, "expected_grade": "A-", "created": "2022-09-08T18:43:52.463631Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "DO NOT take this class with Maksym Moraswki. His lectures is interesting but has nothing to do with our project/exam. His project description does not match how he grade it.", "rating": 1, "expected_grade": "B-", "created": "2022-10-17T20:55:12.884947Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Love how the rate my prof ratings are so much better. https://www.ratemyprofessors.com/professor?tid=1822434. \r\nExam wasn't that bad as long as you listen to what he says in class. He doesn't always teach everything in lectures, a lot of self learning is expected of you as well; however, he always points out the topics you have to self learn. It is very clear and probably like an hour of learning outside of class a week.", "rating": 5, "expected_grade": "A", "created": "2022-10-19T19:38:30.116079Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "He doesn't know how to teach. He deleted all lecture slides from the previous semester which are rather clear and useful, and teach classes without slides. He also canceled a bunch of classes without trying to make up.", "rating": 1, "expected_grade": "", "created": "2022-10-26T19:23:52.079928Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Classroom lectures, while interesting, aren't relevant at all to what's actually on the exam, and concepts that are briefly glossed over in class show up as a full-fledged exam question. Nothing in class is really relevant to the knowledge needed to complete the projects past the first couple of lectures.", "rating": 1, "expected_grade": "C+", "created": "2022-10-27T19:51:36.707432Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I learned nothing from his class.", "rating": 1, "expected_grade": "B", "created": "2022-11-02T20:31:40.656533Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Horrible professor contingent on making your life as confusing and miserable as possible. First exam was a complete crapshoot, so bad in fact that there was not even a GradeScope timer. Genuinely ignore the 5 star review. I ended up with above a 100% on the exam after this curve to compensate how horrible the exam was (removed 10 points from a 42 exam) and I'm telling you he's horrible. Quite horrible.", "rating": 1, "expected_grade": "A-", "created": "2022-11-07T02:32:08.936343Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Great guy, very funny, clearly has experience with what he is teaching. While the first midterm we had did have some more vague questions, it was graded very fair with a curve and numerous questions converted to extra credit. Lectures don't always line-up exactly with projects/exams but are interesting in useful in overall terms for data science. Would guarantee most of the reviews on here that are negative are people who aren't putting in effort/starting projects last minute, etc. Would highly recommend for anyone interested in data science and would advise to take most of these negative reviews with a grain of salt/open mind", "rating": 5, "expected_grade": "A", "created": "2022-11-07T04:02:41.205259Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max is a really nice guy and on the first day of class got me excited about the course by telling some very interesting stories about his time in the industry. This was the first time in a CS class that I had been excited to learn or thought to myself, “wow that sounds like something I want to do when I graduate.”\r\n\r\nThat is why I’m extra disappointed by this class. I suspect that all the Max does to prepare for each day is make a general list of things he wants to talk about and the occasional very plain PowerPoint which he doesn’t stick to. What happens in class is that he simply rambles about said topics without any semblance of structure. There are no key points even if he is using a visual aid. Max will often hand write notes but this is pretty spotty and no one would be able to understand the full picture if they were to try to go back and look at the notes. It is often as if his lectures are simply a conversation between him and people sitting in the front row which quickly breaks down the flow of class and creates too many tangents. It also reveals how unprepared he is when people ask questions and he realizes he should have planned to address that but that it had slipped his mind. This is only a small summary of the issues in this class. Projects are way too hard in comparison for how casually he teaches and test questions seem to be first drafts without any revision. Unless you have the time or personality that would allow you to live in his office hours, don’t expect to get much from Max because his lectures are very difficult to learn from.", "rating": 1, "expected_grade": "C", "created": "2022-11-07T21:29:23.929820Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "easy class, only con is you have to take it with Max. Fun if you want to hear a tech bro boast about his salary every lecture", "rating": 1, "expected_grade": "A", "created": "2022-11-08T01:52:54.784023Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "This review is after Maks addressed what has happened in the class and the midterm recently, which is why you are going to wonder why all the 1 star reviews.\r\nI do agree that he isn't the greatest lecturer, and that a lot of topics that he very lightly brushed on the exam came in full force in the midterm, however I am posting this after he gave an EXTREMELY generous curve and on top of that he admitted that a lot of the questions that seemed out of scope of the class or  that were badly written, well that was actually the case, and he made it up within the curve that he gave us.\r\n\r\nIt's his first time teaching this course, not sure if actually it's his first time lecturing huge sections, and actually. I was frustrated too with his lectures but I can see why he wants us to learn all of this and he is trying to re-make the class. It's to get us to think data-wise and not just be code monkeys who just do python,sql, and stuff to whatever we are told to do for the projects. He is a caring and great guy and I have never seen instructors be so caring to the point of admitting their own mistakes and taking student input in order to improve.\r\n\r\nThere could be more in depth examples and case scenarios for the next exams theory/stat/math wise, and perhaps include a bit of the project stuff in class, but he is great and trying his best at getting us to get the most out of this course.", "rating": 5, "expected_grade": "A", "created": "2022-11-08T03:49:53.714517Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "The way that CMSC320 is being taught in the fall 2022 is a disaster. \r\nThe class was known as a easy CMSC elective class. But it is not this semester. Morawski is a cool, fun guy. Maybe caring according to my friends, but he is far away from good professor this semester. \r\nHe has a few little lecture slides at the beginning of the semester, but no more after he decided to remake the class. We get speaker notes sometimes, but it is only converging the topics he went over. Furthermore, the lectures he gave doesn't teach us how to do our projects and exams well. We basically need to learn how to do the project on our own - it is much workload that I was expecting for CMSC320. It is probably the workload similar to CMSC216. BTW I start projects early so I can ask TA for help, but they are still time consuming and suffering because you have to find out what are expecting (the project description doesn't always tell you where you graded on) and teach yourselves (since you didn't really learn how to do the project yourself)\r\nAlso, I do agree that he is trying to make \"us to think data-wise and not just be code monkeys\". But we need to think data-wise AND how to code.  \r\nMany of the exams questions went far away from the scope of the class. And some are bad written. The projects we did (and cmsc320 is project heavy class) probably worth 6 points in the 42 points exam (which is 32 after he gave curve). Also there is no timer on the gradescope when we took the exam so we will realize \"we had to time ourselves!\" after you read the exam starts 3-5 mins. \r\nHe might improve next semester (Spring 2023) based on the feedback he got this semester, but honestly, if you have choice, try to wait a semester to see how it went . At this point, I will say he is definitely 1/5 at CMSC320. If you have to, I will suggest to treat this class not as elective CMSC class that is kinda easy as the previous reviews have, treat it as a CMSC216 class that will took your lots efforts to get A.", "rating": 1, "expected_grade": "W", "created": "2022-11-09T20:00:45.605784Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I really enjoy his class. He makes the material fun and engaging, and added a lot of real world applications to our lessons.\r\n\r\nThis is his first semester teaching it, and so it's a bit bumpy because of the transition to new material, but he's been doing his best to make it smooth and respond to student feedback", "rating": 5, "expected_grade": "A+", "created": "2022-11-09T20:22:37.155109Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Really gracious curve and very responsive to feedback. Really interesting class.", "rating": 5, "expected_grade": "A", "created": "2022-11-09T20:25:20.819542Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "The main issue is poor organization in lecture. Does not provide clear explanations of each topic nor specific examples. Hand written notes are his passing thoughts rather than coherent, structured notes. I often leave class feeling as if I learned nothing. I struggle to take notes because of lack of structure in lectures. Exam was not very relevant to what was covered in lecture, but he is working on this for the next one! Lectures are not really related to the projects.\r\n\r\nDespite all this, Max is a funny and really cool dude. I enjoy talking to him and hearing his thoughts and stories. It's obvious he's working to improve. I appreciate he has industry experience, which he ties to what we're learning!\r\n\r\nMy recommendations for improvement: \r\n- Organize lectures with clear explanations of each data science technique, use cases, and relevant examples. \r\n- Create more organized hand written notes that can serve as a reference. \r\n- Review key concepts necessary for projects and exams.\r\n- Keep sharing cool stories and industry insights!", "rating": 2, "expected_grade": "A", "created": "2022-11-10T00:27:45.065723Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Everyone who gave him a 5 star review doesn't understand that just by curving an exam by 30% makes you a better professor. His lectures are still uninteresting, he goes on niche tangents with 3 kids in the class that make lecture an unbearable nightmare where you don't learn anything. I'm willing to bet that the 3 people who gave him those 5 star reviews are the same people who sit front of the class asking him questions to get him to go on random tangents for 90 minutes.", "rating": 1, "expected_grade": "A", "created": "2022-11-10T00:57:54.400526Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Really nice guy passionate about data science. Not a good teacher. If you want to self-teach yourself all of the content in this course then take Maks. His lectures are hard to follow as they involve at least 3 tangents minimum. He is not organized and it is very unclear on how much we need to know about mentioned topics. This makes studying almost impossible. I only did well on the first exam due to prior knowledge and google. I would recommend taking this class with someone else and make your life easier.", "rating": 1, "expected_grade": "A+", "created": "2022-11-10T23:46:14.584872Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Take it with someone else if you actually want to learn something. He's a nice guy, but doesn't really teach anything substantial that's useful for the projects and exams. He talks about various topics at a very surface level but doesn't go into any of the details. The first exam was just STAT 400 questions and student-made questions from Piazza. Also the things we were tested on he didn't really go into much detail in in lecture. Only thing that I have found valuable from this class so far are the projects created by previous professors for the course.", "rating": 1, "expected_grade": "A", "created": "2022-11-12T00:24:42.136849Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Professor Max is a super down to earth dude. I personally really enjoy his class and he makes lectures fun. \r\n\r\nThe way he is teaching CMSC320 is unusual but it comes from a person who has worked in the field, which holds a lot of value in my eyes. \r\n\r\nProjects: not easy but he is reusing projects from other semesters so I don’t understand why people are complaining. A lot of project work is fully self taught, which isn’t unusual for CS courses. The project grading is lenient and Max is super easy to talk to if you have any issues. If you don’t want to self learn then you are going to have a lot of trouble in various CS courses, it’s just how it is unfortunately \r\n\r\nExam 1: This exam was online so we had access to Google and any notes we had taken. The average was around 65% but Max is giving us a generous curve and again, none of this is unusual for a CMSC course, it’s only really bad if the professor isn’t fair with curving based on the averages, which is not the case here. There were technical difficulties but Max accommodated for that and helped anyone that had issues. Also, the vast majority of the grade comes from projects so this isn’t even a big deal\r\n\r\nLectures: Max talks about the fundamental topics briefly and doesn’t go into too much detail. Again, most of the code you will learn is self taught and contained in the projects, lecture is for high level explanations of the different topics of the course. Max also shares stories about projects he had to do in industry and problem solving techniques he used to get his solutions. All very practical and useful information. if you’re a geek that doesn’t care about real life and want to stuff your face in a text book and fully learn everything in depth, this gem of a lecturer isn’t for you. \r\n\r\nOverall thoughts: I personally think this class is a breath of fresh air amongst the sea of boring and difficult computer science courses. Max actually makes me want to come to lecture as opposed to feeling like I have to. I love having professors that are easy to talk to and feel more down to earth. This is definitely one of the rare instances of a professor that understands that students have a life outside of their course and is willing to accommodate for real excuses. \r\n\r\nOther ratings: I honestly feel like Max is getting a lot of unfair reviews. This is his first semester teaching the course and he is demonstrating a clear willingness to learn and improve as a professor. There are lots of complaints about the unorganized lecture styles, which is a fair criticism that I’m sure he will address in the future, but also bs criticism about an exam that isn’t worth very much of our grade and projects that he didn’t even write? These are literally reused projects from other semesters so if that’s the complaint then you have a problem with the class, not Max. There seems to be two sides to this. If you want to hear real life experiences and get advice about how to make it in the industry, then you’ll like Max. If you’re looking for a professor that solely focuses on teaching the class material, then Max is not for you.\r\n\r\nConclusion: He a little confused but he got the spirit", "rating": 5, "expected_grade": "B", "created": "2022-11-12T11:32:52.662848Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Great professor that is a little unorganized but makes up for it with real life industry work experience. Max shares his work stories about projects he did and how he did them, which is a lot more valuable to me then just coursework\r\n\r\nMax is a breath of fresh air in the sea of super boring work heavy CMSC courses, love the dude\r\n\r\nThis is his first semester teaching the course and he is very gracious with curves and listens to student concerns. Super down to earth dude. Some technical difficulties in the class but he’s working on them \r\n\r\nOverall: he a little confused be he got the spirit", "rating": 5, "expected_grade": "B", "created": "2022-11-12T20:55:01.032636Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Has a super fun personality. Unfortunately, this personality also involves him being incredibly hand-wavy for just about every topic, making it impossible to do the projects or the exams without literally learning all of the details and processes (which are deemed uncool) yourself. This is made more difficult by the fact that he's thrown out all of the previous relatively well-structured course material, replacing it with his free-form, tangent-filled lectures, with no useful slides or notes posted. \r\n\r\nLogistics is a nightmare. Completely unreliable and disorganized. Difficult to get in touch with and has yet to timely follow through (if at all) on a single assurance he's made all semester when you do. Hasn't bothered to figure out the most basic software used for the course, making things even worse for students in every way (exams, projects, recordings, notes, slides).\r\n\r\nEven if we end up with an insane curve to make up for his incompetence (which seems to be the case from the first exam), we've been taught little in a potentially fascinating course and have been enormously stressed and frustrated.", "rating": 1, "expected_grade": "B+", "created": "2022-11-13T07:50:29.054960Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Horrible teacher. He fails at not only teaching but also responding to relevant questions. His lectures are more about his personal life than it is about data science, and I feel like I wasted a lot of time by even attending the lectures. The fact that he had to curve an exam by >30% in a class that's not even meant to be difficult speaks volumes. As much as I'd like to say he's a good person but bad professor, I'm afraid to say an irresponsible professor is not exactly the best person.\r\n\r\nIf you're reading this, kindly teach relevant information. As much as some members of the class enjoy your tangents, I (and many others) came here to learn and nothing else. Please teach in a practical and planned manner. I loathe those who are fortunate enough to not value over 90 minutes of time.\r\n\r\nTo reiterate, if you are reading this: Students come here to learn data science. You are obviously a talented and tested individual, and clearly possess the capability of teaching. I can only assume you think we don't take this course seriously, and therefore neither should you.", "rating": 1, "expected_grade": "A", "created": "2022-11-13T08:14:53.062387Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Absolutely horrid professor and class. If you take this class get prepared to teach yourself all the material related to any assignment or quiz. He has no comprehension of what it's like to be a student in his class where he handwaves every topic briefly with no reinforcement and then assigns us projects where it is NOT RELATED AT ALL to what he is teaching. He is more concerned with his job at EBay than he is with actually being a good professor and to compensate for this just showers the class in extra credit (which does not make him a better professor). Overall, horrible professor. If you enjoy learning any actual material don't take a class with him. You will regret it.", "rating": 1, "expected_grade": "W", "created": "2022-11-14T19:04:47.952638Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "READ! This semester was his first time teaching and he caused a blunder with the midterm, which wasn't even that bad in my opinion. That's the only reason a bunch of nutcases spammed him with 1-star reviews. Anyway, he curved very reasonably and is set on not repeating his mistake. Aside from this, he consistently enlightens us about the Data Science industry and teaches us useful concepts relevant to the industry. His lectures are fun to go to! Additionally, he listens. He's always asking for feedback and genuinely feels bad for the mistakes he has caused. You study for exams (both online) by following a well-written study guide he provides. Regarding projects, they are also fun and you learn applicable Data Science skills. There's no final exam, but instead, a final project where you can make what you want to while fulfilling certain requirements. Max is super lenient with your ideas and is super easy to talk to. If you're uneasy because of his reviews, just go talk to him and decide for yourself.", "rating": 5, "expected_grade": "A+", "created": "2022-11-15T03:19:02.930628Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Honestly, ignore the 1-star reviews. He has a 5 star on ratemyprofessor out of 30 ratings. It's from UMBC and it's the same Max, I checked his LinkedIn. I can guarantee the 1-star reviewers are all nerds.\r\n\r\nMax is hilarious, makes lectures fun, and teaches valuable course material. People are mad because \"what he says in lecture doesn't help us with the projects\", yea, it doesn't. That is a common occurrence for higher-level CMSC courses. I guess none of those reviewers have gotten past CMSC351/CMSC330 yet.  Projects involve using code to extract text from websites, organizing it, and making graphs/visualizations out of the data to make a point. Do people actually expect Max to stand there for 90 minutes every lecture teaching us how to code in pandas? He showed us the basics then everything else builds on that. Making a pretty visualization is something google helps you with. I do think Max should provide us with documents with code examples relevant to the projects outside of lecture, which is something he currently does not do, otherwise I don't mind his teaching.\r\n\r\nMax also uses his experience from working in the field to teach us and explain what is and is not relevant. I love knowing what topics are actually used in the field because I want to work in data science. Knowing what to expect means I can focus on certain topics more and do better on interviews. Everyone that is roasting Max for talking about his work in the field is an absolute donut that just wants to be spoon-fed code instead of learning topics at a high level and figuring out the code on their own. \r\n\r\nMax is also a very considerate and reasonable instructor that understands that students have a life outside of his class and is willing to accommodate for special circumstances. Very down to earth and likable dude", "rating": 5, "expected_grade": "B+", "created": "2022-11-19T05:07:36.690991Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Yeah anyone who gave him a 5 is a complete lunatic. I'll admit he has promise but for now he is currently teaching one of the worst run CS courses in the entire department. Nice guy, would love to get a beer with him some time but the course is so disorganized to the point where it makes learning horrible. He was adamant on changing the slides in the beginning of the year because they \"weren't good\" and now instead teaches off whatever tangents his brain works off of. I can't imagine how Jose feels as he recently revamped the course just to have it ruined by Max. Maybe once he sorts this all out he'll be better, but for now he deserves the 1, ignore anyone who gave him a 5.", "rating": 1, "expected_grade": "B", "created": "2022-11-22T02:46:29.761981Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "A pretty unorganized course to be honest, but it's his first semester teaching so it's to be expected. Only problem with this course is that there isn't enough code examples in class and the slides/notes are unorganized if there are any at all. Other than that, he's a cool guy and completely understanding/willing to take feedback. The 1-star reviewers are all crybaby's and think everything they need to know for this class needs to be spoon-fed to them like a little child. People even tried to take advantage of his kindness claiming the stat questions on the midterm shouldn't count because STAT400 isn't a prerequisite for this class. Well... if you made it through CMSC250 and can't solve a simple Bayes Equation question then I really don't know what to tell you.", "rating": 3, "expected_grade": "A", "created": "2022-11-22T19:06:49.950793Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Sucks. If you want to learn anything avoid him.", "rating": 1, "expected_grade": "A", "created": "2022-11-22T21:27:54.232804Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "terrible professor. picture this: jose, a very good and well respected professor, teaches this class the previous semester, takes his time to redo the course material, makes all these projects and slides, proper organized class. then max comes along, deletes all the slides, keeps the projects because he is too lazy to create new ones (he literally wont stop talking about how he has never even seen the projects) and whos lectures consist of word vomiting material he only has surface level knowledge on, then has exams that are designed to be googled on. he has amassed a weird bunch of groupies who will shill for whatever he says (hence all the 5 stars who sound like they were written by the same person). Do not take any class with this man", "rating": 1, "expected_grade": "A", "created": "2022-11-25T02:32:13.295092Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "The worst course I have ever taken! Attending lectures is a total waste of time because you cannot learn anything. You need to teach yourself everything when doing projects and reviewing for exams, and when you are taking the exam you need to google almost everything. If you want to pay a lot of tuition and gain the ability to be a self-learner, take this course with Max. Although Max is a nice professor, who likes talking about his success in the industry, this course is so unorganized and that is because he removed all the good slides from the previous semesters and wants to teach this course in his own way. \r\nThe first exam was a nightmare.  The exam was not related to his lecture and we had no idea about what kinds of problems would be in the exam. He curved a lot to make up for that, but it still can't change the fact that we did not learn ANYTHING.", "rating": 1, "expected_grade": "", "created": "2022-11-26T18:58:21.429087Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "AVOID. Not only learn nothing, but also take your time complete projects that are completely unrelated to the course content. Be prepared to spend hours understand the project and google.", "rating": 1, "expected_grade": "", "created": "2022-11-27T05:48:13.099438Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Ill break it down for everyone as best as I can.\r\nCons: \r\n- No lecture slides\r\n- He has lecture notes he wrote, but only sometimes do they get posted\r\n- The first midterm was a mess. He put a huge curve on it to make up for it though. \r\n- Not many code examples\r\nPros: \r\n- Relatable nerdy guy with stories from the industry (he is not a professional professor, he is data scientist with an insanly good resume) \r\n- Willing to do better as a professor, the first exam was a mess, the second one was not. If someone did bad on the second exam it was probably because they did nothing all semester. \r\n- Gives warm-up questions at the start of lectures which he describes as interview problems \r\n\r\nAll in all, he is not the worst professor. The projects are related to the materials despite what some other peoples reviews are saying. The exam questions were related to the lectures, despite what some other reviews are saying. Do the projects require a lot of Googling? Yes, they do. There were not too many code examples given in the course but the documentation surronding what you are doing is actually really good. So, having to Google it, is not like shooting yourself in the foot. \r\n\r\nI'd say 4/5. There is room for improvement, but it could of been way worse. \r\n\r\nI found it was best to skip the in-person lecture as watching the recording of the lecture made taking notes easier as the lectures are actually him just talking to you and not reading off a slide show. So if you cannot take notes based on speech in a quick manner like myself, watch the recordings.", "rating": 4, "expected_grade": "A-", "created": "2022-12-06T16:27:47.068295Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "oh you thought 351 was the CS weed out class? think again and welcome to 320 with max", "rating": 1, "expected_grade": "B", "created": "2022-12-10T02:18:39.793055Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "Teli is a really good professor. Always willing to help, quizzes and exams are fair; not too hard if you study the material. He explains well and his lectures are very interesting. Would recommend!", "rating": 5, "expected_grade": "B", "created": "2022-12-10T03:30:27.226573Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "did an oopsie woopsie with the first midterm, curved it to make up for it\r\n\r\nprojects are heavy on googling but its not terrible/pretty obvious what to do from the descriptions\r\n\r\nsecond midterm was better written than the first, still relatively low average but imo questions were very googleable (which he hints as a solution for exam problems)", "rating": 5, "expected_grade": "A+", "created": "2022-12-11T07:04:57.576521Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "This was genuinely one of my favorite courses at UMD. The lectures were a useful overview of tools available to data scientists, and the projects were realistic representations of what it's like to work with data. Max is a really fun lecturer and I highly recommend stopping by his OH to chat / get life advice. It's really unfortunate that so many people gave him bad ratings after the first midterm - he's a super reasonable guy and adjusted the rest of the course after receiving feedback and I don't think anyone can claim that he made the course unfair. Anyways, highly highly recommend taking him for 320!", "rating": 5, "expected_grade": "A", "created": "2022-12-12T20:50:06.648292Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "This was genuinely one of my favorite courses at UMD. The lectures were a useful overview of tools available to data scientists, and the projects were realistic representations of what it's like to work with data. Max is a really fun lecturer and I highly recommend stopping by his OH to chat / get life advice. It's really unfortunate that so many people gave him bad ratings after the first midterm - he's a super reasonable guy and adjusted the rest of the course after receiving feedback and I don't think anyone can claim that he made the course unfair. Anyways, highly highly recommend taking him for 320!", "rating": 5, "expected_grade": "A", "created": "2022-12-12T20:50:06.672912Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "This was genuinely one of my favorite courses at UMD. The lectures were a useful overview of tools available to data scientists, and the projects were realistic representations of what it's like to work with data. Max is a really fun lecturer and I highly recommend stopping by his OH to chat / get life advice. It's really unfortunate that so many people gave him bad ratings after the first midterm - he's a super reasonable guy and adjusted the rest of the course after receiving feedback and I don't think anyone can claim that he made the course unfair. Anyways, highly highly recommend taking him for 320!", "rating": 5, "expected_grade": "A", "created": "2022-12-12T20:52:05.154705Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max gave very interesting lectures and is a great presenter and I feel like I learned a lot in the course. He has a lot of experience in the field so he makes sure to focus on the things that people will need to be successful in their careers. He also gave lectures on important skills that aren't taught in Computer Science like ethics and how to talk to people. He makes the class feel like a safe space for everyone and is very accommodating.\r\n\r\nHis first test was very disorganized but he gave lots of extra credit to make up for it and worked things out with people who had problems on top of that. The second test was a lot better and he still let people talk him into extra credit for certain questions. The final project is one that will look good to employers and replaces any final test. There are 4 projects in the class that can take a bit of time to complete if you don't understand the tools but once you know how to use the them the projects don't take long at all. Overall, I highly recommend taking this class with him.", "rating": 5, "expected_grade": "A+", "created": "2022-12-12T22:24:52.487608Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Maks is a fun lecturer, as a data scientist who had worked in the industry he shared a lot of interesting stories relating to his experience with past jobs. However the class itself is disorganized, you have to rely heavily on the notes you take during class as he doesn't consistently have official class notes, and the exams didn't have any official practice questions other than student-made ones posted on Piazza. The projects rely heavily on your ability to google the right things as there's not much in the lectures dedicated on teaching students how to use Python other than a few mentions of some random Python methods here and there.\r\nAs this is his first semester teaching here he is willing to improve, he does listen to students' feedback. His second exam was much more fair and comprehensive compared to his first exam.", "rating": 4, "expected_grade": "B+", "created": "2022-12-13T18:51:14.984925Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "So here's the thing - I don't think the 1-star grades are fair. Maks first and foremost is a genuinely nice person - this goes a long way. The only real issue with the class is the material covered in class is pretty orthogonal to the exams from what I understand\r\n\r\n320 also has a reputation of being a very chill class so the departure from this I think makes a lot the ratings (unfairly in some sense) lower - he's a new professor and I truly think he wants everyone to do well.\r\nAlso just wanted to point out that the claim in an earlier review that the class material not corresponding with the tests/projects is common in upper level classes is completely wrong. I've taken 6 or 7 (I can't remember) 400 level CS courses - this has never been the case. \r\n\r\nI generally agree with the review left on 12/06/22", "rating": 3, "expected_grade": "A+", "created": "2022-12-13T22:55:04.638493Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "This class started off very disorganized, as Max restructured the entire course curriculum. He taught what he thought was useful, and gave lots of stories about his time in industry and was clearly very experienced in the field. The big knock was that exam 1 was poorly structured, and even though I didn't agree and thought it was fine, he gave such a big curve that my 77% became a 110%. Projects were admittedly unrelated to most course content, but there was an emphasis on trying to learn how to Google, and they were easily manageable. Overall, nice professor and good class.", "rating": 4, "expected_grade": "A", "created": "2022-12-13T23:02:18.554460Z"}, {"professor": "Jose Calderon", "course": "CMSC320", "review": "I had some friends who took 216 with him say he was very knowledgeable and good at teaching, so when he was listed I was excited to take him. While I wouldn't say this class has been a wreck, there was a lot of moments that had me think there were flaws with the way the course was taught.\r\nIn terms of the class itself: the content is quite overwhelming and there are a lot of potential ways to make mistakes and falter. I think the cheating scandal had worn him off and ever since the first exam (and when he went to write on paper) the direction of lectures became more confusing (no slides, writing on paper without having any code editor open), and he took a good deal of time to explain something mediocre compared to the slides that were given from last spring or 1 year ago. He took ~2 lectures for each of opsem, lambda calc, regex/dfa/nfa and the parsing which made the last section of Rust feel extremely rushed.\r\nSome peeves that he has that are somewhat grating are 1) constantly telling the room to silence even though there's hardly noise, 2) asking for interaction from the class, but then also 3) making big deals over questions/answers that are misphrased (e.g \"method\" vs \"function\"). Each of these aren't too bad on their own but hearing these ~5 times per lecture for 3 months gets a little old.\r\nThat all said, he still is professional and good at answering questions, while also having some good anecdotes about \"good\"/\"bad\" practice and making class quite entertaining. He also has the schedule made so we don't quickly fall behind in projects, so he wasn't all bad. I would say be ready to put more work into a class if you see he's teaching, and that he has some patterns of teaching that don't always suit everyone.", "rating": 3, "expected_grade": "A-", "created": "2022-12-14T07:36:48.617965Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "This is Max's first semester and I definitely think he will improve as a professor, however I feel like I did not get as much out of this class as I had hoped. He doesn't really have any lecture notes, so sometimes it is hard to follow and know what is and isn't important in lecture. The only exam practice that is given are practice problems created by other students in the class, which is nice practice but gives you no direction about what you actually need to know for exams. He does curve exams pretty generously. He rarely answers Piazza posts, which can be pretty frustrating especially when questions that are asked days before projects are due are never answered. I feel like what we learn in class isn't super helpful with the projects, and I usually spend more time googling than I do coding. It's not too difficult to do well in this class, but unfortunately I don't feel like I have learned a ton. Outside of teaching, Max is a very nice guy and I can tell he genuinely wants everyone to do well in his class, and I think his classes will definitely get better after he gets more practice as a professor.", "rating": 3, "expected_grade": "A", "created": "2022-12-16T20:25:21.122730Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Every lecture was kinda scuffed but content was interesting and lot of topics were covered. Max is the chillest lecturer I've had. Definitely has GOAT potential. I'd give it 2 more semesters.", "rating": 4, "expected_grade": "A", "created": "2022-12-17T05:50:02.159875Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Good lectures. Reasonable grading.", "rating": 5, "expected_grade": "", "created": "2022-12-22T04:05:59.529907Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "He definitely cares about his students and makes the effort to answer questions and improve our understanding of whatever he's lecturing. That being said, here are some general points about his class:\r\n- He redid the CMSC320 curriculum in the beginning of the semester, but relevant lecture slides/notes and recordings sometimes weren't posted until weeks later \r\n- Projects and class material didn't really line up \r\n- The first exam had a really low average which led Maks to curve our grades (by a LOT). Second exam went by much better. We also had an opportunity for extra credit for each exam (posting an exam question on Piazza).\r\n- No real practice exams or questions (outside of the questions posted for extra credit)\r\n- He has prior knowledge working as a Data Scientist for places like Google and Ebay and tells us about his experiences there\r\n- Grading is kind of slow -- 2/4 of the mini-projects still aren't graded (and one was turned in around a month ago)\r\n- Googling is an important skill to have\r\n- Maks is open to feedback, willing to improve, answers questions, will offer advice and ways to improve, and cares about his students\r\n\r\nThis was his first semester here though, and I definitely see things with him improving next semester.", "rating": 4, "expected_grade": "A-", "created": "2022-12-22T15:19:41.929995Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Will be good in 2-3 semesters. But for now he remains disorganized and uncoordinated with the material he teaches in lecture and what he expects from projects and exams.\r\n\r\nVery reasonable guy however and generous curve was given for any mistakes. Once he figures out things I imagine he’ll be a great addition to the department.", "rating": 3, "expected_grade": "", "created": "2022-12-24T18:23:47.184737Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Disorganized course admittedly. However, he's a really nice guy and has definitely been trying his best. The biggest thing is that he's always willing to make up for things he's made mistakes with. He curved generously when the exams went (on average) poorly. I did abysmally on the first exam (failed it even after a 15% curve), because the class is harder with Max than it seems to have been with some other professors. The final project was interesting and topic selection was lenient (although grades took a while). I ended up with needing about 0.01% to get an A- and I emailed Max asking if he would round me up. He graciously rounded me all the way to an A (approximately a 3-4% bump iirc). \r\n\r\nUltimately, you shouldn't *not* take a class because it's with Max. Even if you feel like you don't know what's going on during the class, your grade will reflect your understanding as relative to your peers. Give him a shot, sit in the front of the class, and you'll like him.", "rating": 5, "expected_grade": "A", "created": "2023-01-06T16:29:59.332532Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "The class was a mess. Lectures kept getting sidetracked. We were never prepared for exams. Exams had weird grading. Grades took forever to come out.", "rating": 1, "expected_grade": "A+", "created": "2023-01-14T04:20:51.709592Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Overhated. He is a nice professor, and chances are if you ask him after lecture, he will accommodate you best he can. Exams could be somewhat challenging, so I recommend you find study groups and follow his study guides he releases. Like any CS course, most of my learning is from Googling and stackoverflow, so I can't really hate on him. He was lenient in the projects being turned in (we had an extra day for like 3 of them). I am sure he will get accustomed to everything in the Spring.", "rating": 4, "expected_grade": "A", "created": "2023-02-02T02:31:28.028598Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I had him in the previous semester. Great guy, cares about his students. He makes class very engaging and tries his best to make sure students understand the material. Some issues did come up, but this was his first time teaching, some mistakes are expected. He also made sure that his mistakes didn't screw over students giving VERY generous curves on exams when they did happen (many of the negative reviews came immediately after the exam, before he announced the curve). For a normal exam with no mistakes, they can be pretty difficult but he also curves it up to an average of 75%. Overall I'd recommend this professor, I genuinely enjoyed his class and he's good at teaching imho. Giving 4 stars for the the mistakes, but I have no doubt that he could get 5 easily. Definitely one of the best CS professors at UMD. For reference, I'd personally put him next to Nelson and Jose Cauldron in ranking.", "rating": 4, "expected_grade": "A-", "created": "2023-02-09T20:56:10.343456Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "Idk bout assignments cause we never get any. So boring. My energy in this class is used to stay awake not to absorb content.", "rating": 3, "expected_grade": "", "created": "2023-02-09T21:27:04.865328Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Took the course in Fall 2022. He was very generous with the curve but I didn't feel like I learned much from his lectures. However, the projects were pretty fun and useful for getting some experience with data science. You can do something meaningful for the final project and add that to your resume as well.", "rating": 3, "expected_grade": "A", "created": "2023-02-16T22:14:53.967904Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "While taking CMSC250 with Professor Mohammad Nayeem Teli last year, I encountered some difficulties with the course structure and materials. I believe that Professor Teli may have been assigned to teach classes for which he is not entirely qualified or knowledgeable, as his first language is not English and his heavy accent made it difficult to understand him at times. Additionally, the wording of the tests and quizzes was poor and riddled with errors that could have been caught with adequate proofreading.\r\n\r\nFurthermore, I found Professor Teli's lectures to be long, rambling, and often disorganized, frequently losing track of the topic or failing to address key learning objectives. He also taught incorrect information and would often double down, claiming that he was teaching different ways of doing things. The projects in the course were terribly worded and ambiguous, requiring a lot of guesswork to understand what Professor Teli wanted us to do. The grading was inconsistent and required a lot of regrading to receive full credit.", "rating": 2, "expected_grade": "A", "created": "2023-04-09T15:36:41.532586Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "I had the pleasure of taking CMSC320 with Professor John at UMD, and I can confidently say that he is one of the best professors I've ever had. I've sat in Maksym's lectures and honestly John is much much better! His knowledge of data science and computer science is unparalleled, and he has a real passion for teaching and helping students understand complex concepts. His lectures are engaging, and he always takes the time to answer questions and provide extra help to students who need it. THERE IS NO FINAL EXAM! THE WEEKLY QUIZZES ARE PASS/FAIL (FREE POINTS!!)\r\n\r\nI will probably be one of the TA's for this class next semester and we have taken into account all the reviews that are on planet terp and rate my professor. We will have a whole new set of practice material for the exams which are similar to the exams themselves. We have also listened to the issues about grading time and we will CONSIDERABLY REDUCE them next semester so that students can track their progress and take action if necessary to improve their grade.\r\n\r\nOne of the things I appreciated most about Professor John was his approachability. He was always available to talk to outside of class, whether it was to answer a question about an assignment or just to chat about the course material. He truly cares about his students and wants to see them succeed.\r\n\r\nOverall, I would highly recommend Professor John and CMSC320 to anyone interested in data science or computer science. It was a challenging course, but with Professor John's guidance and support, I was able to learn a lot and feel confident in my abilities. Thank you, Professor John, for being an amazing teacher!", "rating": 5, "expected_grade": "A-", "created": "2023-04-27T23:24:48.122395Z"}, {"professor": "John Dickerson", "course": "CMSC320", "review": "EXCELLENT PROFESSOR!! Weekly quizzes are pass/fail (free points) and THERES NO FINAL!! You are graded pretty much based on projects which are usually extremely fun to do! John is a very nice guy, even though i'm not the kind of guy who goes to office hours much, I could tell that he has a very nice and fun personality and he's very approachable.  I can confidently say that he is one of the best professors I've had.\r\n\r\nOverall, I would highly recommend Professor John and CMSC320 to anyone interested in data science or computer science. It was a challenging course, but with Professor John's guidance and support, I was able to learn a lot and feel confident in my abilities. Thank you, Professor John, for being an amazing teacher!", "rating": 5, "expected_grade": "A", "created": "2023-04-27T23:30:35.122391Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max taught this course in his own way this semester and it worked out really well. Definitely didn't feel disorganized like people were saying about previous semesters and I feel like I learned a ton. Great professor with a lot of potential!", "rating": 5, "expected_grade": "A", "created": "2023-05-10T13:57:34.993069Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Trash, Trash, don't take it. He has some crazy cultists who sit at the front of the class every time, and the other students don't come to class all time. The exam is hard, don't take this course if you are not the crazy cultists.", "rating": 1, "expected_grade": "", "created": "2023-05-19T01:04:09.052401Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "You are better off learning on your own then learning from his class. This makes sense because Max really wants his class to be geared towards practical industry skills, but it just translates to a bad class experience. The exams are very open ended, sometimes weirdly or vaguely worded, and generally just harder then they should be. The class material only really prepares you for the exams if his exact way of teaching works for you, and for most people it doesn't. Everything else in the class is graded very generously though. That being said, I would recommend taking this class with someone else if possible.", "rating": 2, "expected_grade": "", "created": "2023-05-22T19:04:40.791948Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max is definitely not your standard CS professor, but do yourself a favor and take him anyways. You’ll leave this class feeling like you have a better understanding of what data science actually is, rather than a random assortment of knowledge that you have to regurgitate on exams to get an A(which is what a lot of CS classes are). On top of that, I’m almost certain he’s the nicest person in this department. He’s very understanding of the fact that we’re all stressed out college students, so he’s chill with deadlines as long as you reach out to him. He’s also a huge nerd and is incredibly funny. I found myself laughing constantly throughout his lectures(go to lecture, they’re fun). Also, go to his office hours or set up a meeting with him. This man has a lot of experience in industry, he’s well connected, and he’s a very approachable guy who wants to help everyone be the best version of themselves. You’re missing out if you don’t talk to him.\r\nHe’s not perfect. He sometimes makes promises he doesn’t keep, he doesn’t really have practice questions for exams, and it often seems like he put the lecture together the night before and hoped for the best. BUT he made up for everything and was willing to change his course policy any time we had an issue with something. \r\nTLDR: take him if you want a friendly professor who cares about you and wants you to be a competent person in industry. Don’t take him if you want a super structured, math-heavy course.", "rating": 4, "expected_grade": "A", "created": "2023-05-22T23:24:13.375303Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "He’s the goat. I love what he did with the class", "rating": 5, "expected_grade": "A", "created": "2023-05-25T22:09:59.199883Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Absolutely would not recommend class with him. His projects were fine and fair, but lectures and exams were horrible. The class was so unorganized, exams were horribly made and had very low averages. There were a lot of people who got 50s and also people who got 100s on the second exam which clearly shows it was a horribly made exam. The second midterm was also right before classes ended making the final seem pointless. His lectures are bad but instead of improving them, he tells you to watch videos and read articles if you want to learn the material. His review sheets that he makes during class are scarily organized and a majority of the stuff he said was gonna be on the exam was not there, making it hard to trust the review sheets at all. Overall, would not recommend this class with him.", "rating": 1, "expected_grade": "", "created": "2023-05-26T16:00:32.217733Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Absolutely would not recommend class with him. His projects were fair and doable, but lectures and exams were horrible. The class was so unorganized, exams were horribly made and had very low averages. The second midterm was also right before classes ended making the final seem pointless. He seemed to acknowledge what was wrong or that the results were bad but then just kind of moved on.  His lectures are bad but instead of improving them, he tells you to watch videos and read articles. His review sheets that he makes during class are scarily organized and a majority of the stuff he said was gonna be on the exam was not there, making it hard to trust the review sheets at all. Overall, would not recommend this class with him.", "rating": 1, "expected_grade": "", "created": "2023-05-30T21:59:19.620510Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "My only complaint is that the class is a bit disorganized. Other than that, I think he did an amazing job teaching the class. If you have a genuine interest in the content covered, you will do great.", "rating": 5, "expected_grade": "A+", "created": "2023-05-31T02:12:44.881721Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "I would not recommend taking CMSC320 with Professor Teli at all costs (take with Max instead of anyone else). This class now has a midterm, a final project, weekly closed-note quizzes, and a final exam. Teli's lectures were dense with material and he failed to keep his students engaged. Most people would just be on their laptops or their phones waiting for the quiz at the end of class. The quizzes were on some reading tangentially related to the class, and they would either be really easy or really hard. It would often require you to remember random facts or sentences from the article. \r\n\r\nThe first midterm of this class was a total mess. There was a sample midterm given, but the actual exam was nothing like it. You were allowed to bring a cheat sheet, but that didn't matter. It was essentially random python trivia about random inbuilt python, pandas, numpy, or data-cleaning techniques/commands. If you didn't have it on your cheat sheet, you would not be able to answer the question. These commands had nothing to do with class or the projects. It also included topics that were briefly mentioned in class, not really in the class slides, and that question would be work 20% of the midterm. Almost fully random, the best way to classify this midterm is like a history test, but your textbook is the whole internet. Good luck.\r\n\r\nThe final was better. I believe he understood what he did from the first midterm, so he made the final closer to the practice final and kept it related to the class content. This however didn't fully make up for the first midterm, because we didn't know what to expect and it could have easily been just as hard/random. \r\n\r\nProjects were straightforward and all were group based. Grading was inconsistent - your luck of the draw of what TA you got. \r\n\r\nEssentially, this class no longer teaches you \"data science\" and is closer to a history/overview course. It provides a lot more stress than is needed (with the midterms, quizzes, and final) and Professor Teli makes it a lot more random than it should be. I would recommend taking it with a professor who has better grading policies and doesn't have midterms like Professor Teli. Professor Teli is very knowledgeable about the subject, but when it comes to teaching it, he could use a lot of work.", "rating": 1, "expected_grade": "A", "created": "2023-06-01T18:44:13.385094Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "Lectures way too fast. Doesn't explain anything in depth. Uses a mouse to draw things illegibly on the screen. Clicks through slides like its a race. Halfway explains a concept, then says we'll come back to it later, never comes back to it. Tells you he won't go through certain slides, and to review them on your own time. Why put them in the slides then? He really needs to look at what it means to teach and see how he can reform his approach. Teaching is explaining a simple concept -> show an example -> wait for understanding -> show a slightly harder example -> wait for understanding -> explain a harder concept -> show an example.. repeat. He never waits for understanding and sometimes doesn't even explain the concept. I am here to learn and 100% willing. I feel like I was scammed out of the $1000 I payed to take this summer course, because he didn't even teach it. Slow down, seriously. Lecturing is NOT a race.", "rating": 1, "expected_grade": "W", "created": "2023-07-14T14:28:07.939881Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "The last review that I can see was from 7/14. Today is 7/27 and I can say that the situation has gotten worse. Topics have gotten harder and has moved on to talking about about STAT400 material and linear algebra. These two courses are not prerequisites and he assumes that you all should know everything about these classes. He does not give you a debriefer on these topics, so if you don't remember content from these classes, you are out of luck. He does not explain very effectively: his slides use short hands that I cannot understand, his handwriting is very hard to read, he provides no examples for any material that we are learning,  (just rants on a hard topic, and expects us to understand with no concrete examples). I had teli for 250 and he was real solid, but this class.... I hiiiighly encourage against him.", "rating": 1, "expected_grade": "C", "created": "2023-07-27T20:39:34.706273Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "He was a bit too quick early on in week 1, but he slowed down and really went in depth, took out a pen and paper and gave great examples. He really is a gifted teacher because he knows what the student is thinking and explains what is necessary to bridge to the jump of understanding. First ML class that I actually understood what was happening. The only problem with this class is that it relies on stat and linear algebra heavily, but stat and linear algebra are not requirements for the class. That's not his fault though that the department that made that decision. I highly recommend this course but you will get the most out of this if you have taken Calc 1, linear algebra and stat as recently and havent forgotten too much.", "rating": 5, "expected_grade": "B", "created": "2023-08-01T02:33:43.924794Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "I think Professor Teli did a great job with organizing the class. The lecture materials were all in 1 place, the directions for the 4 projects were very clear and not too challenging, the lecture quizzes weren't that bad, the final tutorial instructions were very clear and examples were provided. We were also given practice questions to prepare for the midterm and final and they were relatively similar to the actual exams. We were also given the opportunity to have 1-page cheat sheets during the exams, which I really liked. The lecture recordings he made went over the slides and handwritten examples of the topics. The TAs also had plenty of online OH and they were willing to answer any questions I had and offer any assistance. Professor Teli is also a nice and understanding professor overall. This class also helps you prepare for 422 since 422 essentially builds upon it and goes over these topics in depth with a stronger emphasis on ML. It helped me refresh my statistics and linear algebra skills. The only things I will mention that could have been improved were 1) Responding to Piazza posts and questions a little sooner and 2) Slowing down the lecture pacing. I'm aware that since this was a 6-week course, the content that would normally be covered in a 15-week course had to be covered more than twice faster but that's not Prof Teli's fault. I understand the concerns that the other reviews have regarding the lecture pacing and do agree that you should have some background in statistics and linear algebra and calculus but the class more touches upon the high-level concepts instead of delving into them too deeply. If you haven't taken statistics and linear algebra, then it may be a little problematic. Other than that, I really liked this class and look forward to taking 422 with Teli in the fall. Would strongly recommend taking a class with Teli but if you prefer another professor, that is also understandable.", "rating": 5, "expected_grade": "A", "created": "2023-08-20T20:22:57.615316Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "So I had Max for 320 last semester. I wrote a Piazza post 3/4 of the way through the semester, discussing the lack of organization, lack of resources, and how the exams were just bad. Majority of the class agreed to that post and he said he would address the feedback. He mentioned he would have dropped the final exam, but he didn't want to change the syllabus. He also did mention he would also drop the final for the following semester, especially since it would be redundant along with a final project. From what I hear, he did not do so. I would avoid Max and wait for a professor who can support students through the learning process rather than throwing the kitchen sink at them and seeing what sticks.", "rating": 1, "expected_grade": "", "created": "2023-09-07T14:17:44.552220Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "Terrible professor. Inconsistent exam, terrible lecture style. Throughout the exam she had to make multiple corrections and some of the questions weren't related to course material.", "rating": 1, "expected_grade": "", "created": "2023-10-11T21:39:03.012619Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "Fardina is amazing, the problem is me", "rating": 5, "expected_grade": "XF", "created": "2023-11-13T20:49:17.516883Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "He is a fair professor who does want his students to succussed. The projects where tedious but straightforward and the exams where usually fair. Only complaint is that he is not a great lecturer, can put you to sleep and it is easy to get lost. Lectures are posted before class so your better off read them and teaching yourself. Other than that fine professor.", "rating": 4, "expected_grade": "B+", "created": "2023-11-16T18:53:24.524569Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "It is her first time teaching the course, so there were some hiccups, but Fardina is very receptive to student concerns and the course has generally been smooth", "rating": 5, "expected_grade": "A-", "created": "2023-11-19T11:15:11.517969Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "Fardina is really great! Her slides are amazing and thorough, and you can tell she puts in effort into the class and material. She's kind and responds well to student feedback, and is responsive on Piazza and email. Her lectures can feel a bit rushed/confusing at times, but I think it's because this is her first time teaching the course and she's new. It didn't help that Max's previous exams are kind of chaotic too so we didn't really have anything to base content off of. But give her time and she has potential to become a favorite :) She's also really knowledgeable in data science!", "rating": 5, "expected_grade": "", "created": "2023-11-28T04:04:42.187238Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max is nice but can be a bit arrogant and often makes mistakes in class. His slides are minimal, and he's proud of it, refusing to change them. Although he suggested Dr. Fardina's slides as those are really detailed. I wouldn't recommend taking his course.", "rating": 1, "expected_grade": "A", "created": "2023-11-28T21:47:51.808090Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "A super genuine person! Fardina always puts effort into understanding the students. Her slides reflect her sincerity in class (you can compare them with slides from other sections). She's active on Piazza. The question on Mid-Exam 02 was pretty fair, but honestly, I liked both questions. Our exam average for both midterms is far higher than that of the Max section. I wish her good luck!", "rating": 5, "expected_grade": "A", "created": "2023-12-05T20:21:13.687091Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "Her slides are detailed and reflective of the exam content. She is also very nice and takes student concerns into consideration.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T17:00:53.383487Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Easily my favorite professor I've had at umd, and made me want to go into data science. The class is a bit disorganized, but exams and homework are pretty fair. Max has the only lecture that I actually looked forward to attending, he has so much knowledge to share about the actual industry (he's worked at google, ebay, etc), he's super chill and understanding of students, and a super entertaining dude. Can't speak for any of his other classes but 100% recommend taking 320 with him, class has been pretty easy. Definitely goat potential", "rating": 5, "expected_grade": "A-", "created": "2023-12-11T23:12:04.925087Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Lowkey I love Max. I understand the criticisms, but if you go to class, pay attention, and just try your best on exams its really really easy to get an A. Just take a look at his grade distribution. He really prioritizes students learning, which sometimes comes across as not caring about grades. Just have faith and wait for the curve.", "rating": 5, "expected_grade": "A", "created": "2023-12-12T18:48:01.620298Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max is a nice guy with decent career advice and industry knowledge and that's about it when it comes to his teaching. While his projects were insanely easy, they in no way prepared you for his exams. He expects people to have a deep understanding of the content but doesn't realize that to get to that point of deep understanding you need quality practice material and assignments that build up your knowledge. The lectures are incredibly surface level and showing up to class is a big waste of time, I found it hard to separate the word vomit/tangents from the important content. I didn't feel like I learned much in this class besides how to Google. Overall, I would recommend taking a different professor.", "rating": 1, "expected_grade": "A-", "created": "2023-12-14T06:27:25.194132Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "Slides are informative, course content is easy. It's her first time teaching but she did very well aside from a few minor lecturing issues at the beginning of the year.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T02:11:47.974414Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "OMEGA STRAT TO GET AN A IN CLASS:\r\n\r\n- DONT GO TO CLASS\r\n- DO HW (start like a week in advance lowkey)\r\n- A WEEK BEFORE EXAMS READ REVIEW SHEET (OMEGA GRAIL)\r\n- SLIDES ARE SO CLUTCHHHHHHHHHH, W PROF\r\n- TAKE EXAM (hella fair fr fr)\r\n- PRAY", "rating": 5, "expected_grade": "A", "created": "2023-12-15T23:25:11.426711Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "very chill professor. As a first time professor, she taught lectures well, very flexible if you have valid reasons. Most importantly, exams were very fair. Projects/homeworks were not too bad either.", "rating": 5, "expected_grade": "A", "created": "2023-12-16T06:39:47.879657Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Class is just a mess. Grading takes forever (Homework due late October still is not back yet) and Prof. Morawski doesn't seem to really care about that. Our final project was released extremely late and last homework was also released really late. Barely any communication about this. The last homework was released so late that we were basically expected to work on it over Thanksgiving break, when it was originally supposed to be due 2 weeks before break. None of the homework is that hard (IMO at least) but it's just annoying that you continuously have to check up to see if the professor has even released the homeworks when he's already behind schedule. \r\n\r\nProf. Morawski also is just bad at teaching, plain and simple. Lectures seemed more like a stand up routine to him. As other reviewers said, the slides have minimal info, and equations are often wrong. There's no clear definitions for anything, you'll have to look elsewhere. Everything is taught in an example/high level way but you are expected to understand and replicate at a low detailed level. For example, with hypothesis tests, you will not find detailed definitions in the slides that include everything he wants you to know. You have to google these things or use the other prof's slides. This is kind of insane to me as Prof. Morawski has taught this class MULTIPLE times before. And, you can tell that he thinks his teaching style is superior to other professors, which is frankly hilarious as he also goes on about how he thinks he didn't explain things well or how the exams he wrote/gave us are bad exams.\r\n\r\nHomeworks and projects always needed numerous corrections-- again, kind of ridiculous for a professor who has taught this class before. Good luck starting the homework early, because he will probably change multiple things in the first few days of homework release. \r\n\r\nExams had questions where you were supposed to use your \"real world brain\" and think outside the box. What does this actually mean? Trick questions and ones that are long/confusingly worded for no reason. We had some tricky questions on things that he *explicitly* did not teach us previously due to cancelling class multiple times or having the other prof teach us for a class. I understand that he had to cancel class for personal issues, but I didn't think it was fair to have tough questions on concepts that he himself did not teach us.\r\n\r\nAnyway, all of the below reviews are very accurate as to how you will feel about Prof. Morawksi. You will either be mildly irritated at his lack of organization and general lecture style, or you will become part of his fan club. No in between. You will not feel neutral about him.", "rating": 1, "expected_grade": "A-", "created": "2023-12-16T20:15:56.602513Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Guys a G. Hilarious. He ACTUALLY WANTS US TO LEARN THE MATERIAL. He doesn't want the education to continue the way it is, where students can just cram for an exam and then forget about it. This leads to harder exams. Get over it. If you wanna take the easy way out take another major. If you go to class and PAY ATTENTION he shares useful information and knowledgeable insight to his experiences in the industry. My only complaint is his slides are pretty bad, but luckily he's coteaching with Fardina who has pretty excellent slides so as I study for the final I will be going off her slides. They are just more detailed. He should improve his slides because with just his slides it hard to know whats going on. If you care about learning and are interested in Data Science take Max. Its really entertaining due to Max being the way he is and pretty interesting content compared to some of the boring an useless CS classes I've taken here.", "rating": 4, "expected_grade": "B+", "created": "2023-12-18T05:44:20.347182Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Max's lectures are fairly unorganized, and he oftentimes goes off-topic. He is more engaging than the average CMSC professor.", "rating": 2, "expected_grade": "A-", "created": "2023-12-19T05:01:43.935665Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I thought this was the first time he was teaching this course (F23) so I was willing to excuse disorganization. Seeing as he's already done this before, this semester was inexcusable. If there is another professor available, take 320 with them. The class final project was somewhat of an afterthought and was just a 15% of your grade homework tacked on the end of the semester. It was Doctor Fardina's first time teaching the course, yet she put together a much better experience over the semester (specifically the last two exams: much higher average score on midterm 2 and allowed a formula sheet on the final/was very clear about what topics to review).", "rating": 1, "expected_grade": "B", "created": "2023-12-19T18:40:50.195141Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "he's VERY funny, but his slides are minimal and the tests were HARD.", "rating": 3, "expected_grade": "B", "created": "2023-12-20T01:05:38.170362Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "Easy, final had an average of 97.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T05:58:08.056205Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Runs an incredibly practical and applied data science class, which is super useful and unlike most other courses at umd (especially if you want to be an actual data scientist, you'll learn tons of things to put on your resume). This is my second course with Max, and the disorganization has definitely improved, but is still pretty bad. Regardless, it's clear that he LOVES this class, and he's incredibly knowledgeable on the subject (has industry experience at Google and some startups). Would definitely recommend if you can put up with the long wait time for grades to come in, and the generally disorganized course structure.", "rating": 4, "expected_grade": "A", "created": "2023-12-22T16:35:20.998825Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Nice guy but going to his class is useless because you can just get all the information needed from Fardinas slides and online. He writes nothing on his slides and doesn't post his recorded lectures unless you ask. The coding assignments weren't bad but to get full points you have to do more than what the directions are asking. He grades kinda easy and there are multiple opportunities to get extra credit. HIs exams are not formula or math-heavy.", "rating": 3, "expected_grade": "B+", "created": "2023-12-23T15:46:27.838843Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Overall, I think Max made data science my favorite course that I've taken here at UMD. There are still truths to some complaints here, but the positives are still far greater than the negatives and the way it's taught is so unique so I think people should still take this class with Max (or at least go to his 320 lectures when they happen, since they're quite interesting, humorous, and thought provoking).\r\nFirst, the cons: Yes, the class was quite disorganized, we had an assignment due in October that wasn't graded until the last day of finals. Some problems were unclear or needed us to search up information on our own (but this research was very simple and not really an issue). He is unprepared sometimes; he mentioned some lectures went way faster than expected, or will forget to put something very important on slides, and also stopped posting recordings for lectures which made it a bit hard to study for exams. Additionally, he isn't the best at math, so he'll sometimes make mistakes on some slides or formulas, but in practice we hardly used formulas so this hardly disrupted the flow of the class. In terms of grades, the other section for Fall 2023 (with Fardina) was basically a guaranteed A (the average on Max's exams was about 77%, Fardina's average on exams was about 92%) so honestly, if grade is the [only] thing you care about, maybe you should take it with Fardina based on the stats.\r\nBut Max's section and thoughts have many positives: The overall grade for the regular assignments and final project (which were worth 55% of the class) was at 95% so no one really risked failing the class, and most of these took just around 2-4 hours to complete since there are lots of guides to do what was asked. Where Max really shines is in his lectures: they were the most consistently engaging ones that I've been through at the university, always getting people to ask questions, cracking jokes and being relatable on what being in CS is like. The way he teaches the course isn't just learning data science in how to design & execute an experiment, because he also notes where it's relevant and useful (he mentions how Goodhart's law is seen in practice through grade inflation, I wonder where this could be present...), what the industry currently uses in practice (how does Netflix or Amazon actually recommend things), and bringing his own industry experience to elaborate on what we would do working in data science. Additionally, he also goes on some important side tangents about other important topics, like critically thinking about what grades are, career advice and thinking about interviews, how to ingest ethics in practice, and other considerations in life that many other professors don't touch (he informally holds a group of people that learn more on these general life skills). In the end, the class is such a unique, refreshing, and positive experience that I'd advise everyone that can take 320 to take Max's section when he teaches it.", "rating": 5, "expected_grade": "A", "created": "2023-12-23T17:24:34.998525Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I would not recommend him for this class at all. I had quite a bit of experience going into this class and as other reviews mention, it TRULY is disastrously organised. His slides were too minimal, and he would/could not explain concepts clearly (which he acknowledged) and then we'd be tested on minute details about those very concepts! His \"review guides\" would tell us we'd be tested on some topic, and that topic would never show up on the exam! He actually prides himself on his \"quirks\" but it's super annoying because it's too specific and not relevant. His office hours are also always filled with the same people chatting away so it's hard to ask him questions. I had him for 351 and I thought this course would be better but it's about the same. I don't think I learnt anything from him in either course.\r\n\r\nHe'll tell you cool stories about his time in the industry and that will usually be enough to distract you from the real problem that he doesn't know the content well enough to teach it. NEVER TAKE ANY CLASS WITH HIM!", "rating": 1, "expected_grade": "B+", "created": "2023-12-24T02:12:21.423126Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "Possibly on the same level as Kruskal, and that tells you something.", "rating": 1, "expected_grade": "C", "created": "2023-12-24T04:17:53.483805Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I had Max for 320 this semester (Fall 2023) and 351 last semester (Spring 2023), and all I can say is that he is a great lecturer that genuinely cares about his students and wants them to succeed when they go to the industry. Many students complain that his slides are not comprehensive and that we need to google most concepts to better prepare for exams. However, I would argue that this reflects exactly what data scientists (and most CS related jobs) are doing in the industry. You are just required to have a basic understanding of class concepts, so googling stuff and learning the basics isn't really that bad. Max's style of teaching prepares the students to better navigate real-world challenges and to not be always \"spoon-fed\" with information.\r\n\r\nRegarding the coursework, Max's exams are essentially about two things: Demonstrating basic understanding and extending the class ideas to real-world situations. I didn't study a lot for exam 1 and the final, and I got an A in both of them. If you hope that you will get an A by memorizing concepts and not actually understanding how the algorithms work and the math behind them (in a general/basic level), do not take the class with Max.  However, I must mention that Max sometimes messes up exams, where the average would be 70% or less. Though, you can always get partial credit and extra credit in all of his exams and assignments. Also, you can always email Max about anything, including bumping up your grade to the next cutoff if you think you deserve it! In general, Max's classes are easy, and you will do just fine if you attend lectures and demonstrate basic understanding in exams.", "rating": 5, "expected_grade": "A", "created": "2023-12-24T23:48:40.957700Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I felt extremely disappointed at the end of this course! It seems like Max always has fans who think he is cool, and obviously, his lectures were nice. But the exams were EXTREMELY difficult! The average of Mid 02 was extremely low, and he was absent for some classes ( he is was sick though). He promised to curve that exam and ended up curving NOTHING! Before that, he openly admitted to us that it was unfair, and it felt like everyone was depending on it. Extremely disappointed, as the overall average for Fardina's section was so much higher than ours, and as heard from that section, she was very considerate to the students' needs. Everyone talked about how cool he is, but no one says the reality - how disorganized and less affectionate he could be.", "rating": 3, "expected_grade": "A-", "created": "2023-12-26T05:36:19.817781Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "He is trying his best to reach Kruskal level. Do NOT take him as your professor. Anyone else would be better. He just gets worse and worse each semester (based on what I’ve read). Not a very understanding professor.", "rating": 1, "expected_grade": "C", "created": "2023-12-26T19:34:29.323514Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "My opinion:\r\nHe is not that bad as some of the 1-star reviews state, and also not as good as some of the 5-star reviews. He taught the class in a way that was different from what one would expect. The subjects taught in class are very simplified, so students are encouraged to do outside research on what you learn in class. The projects were really fun for me as for some of them we were free do implement them how we wanted to. On the other hand, the exams were quite difficult and required us to expand on what we have learned in class to a large extent.", "rating": 3, "expected_grade": "B+", "created": "2023-12-28T15:07:39.386039Z"}, {"professor": "Fardina Alam", "course": "CMSC320", "review": "She's a super nice professor who's very fair in her homework and exams.", "rating": 5, "expected_grade": "A", "created": "2023-12-28T16:48:48.906302Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "The class with Max is generally straightforward, especially the programming assignments; the homework on SQL and Pandas borders on trivial, and the later assignments simply require using some Python libraries and can be completed with the help of a wealth of online tutorials. A couple assignments involve writing a report, and while they can be graded rather subjectively, it's simple enough to manage a decent grade on them with a few hours work. Our final project was released quite late, and thus was reasonably easy and minimal in time required.\r\n\r\nThe exams are designed to be open ended and make you display true conceptual understanding, as opposed to simply regurgitating material from the slides; it's not clear how effective this model was, as the averages on the first midterm were very high but were below a C for the second. Regardless, all the exams are doable if you really think about what Max is asking you to answer (rather than assuming what he is asking based on how a normal CS exam might go).\r\n\r\nMax is prone to going on tangents while lecturing, keeping track of his idiosyncrasies can be annoying when trying to submit work that meets his standards, and his slides are wholly unhelpful; in spite of all of that, if you follow along in class and spend a few hours studying for the exams you'll be fine. I ended up enjoying Max's teaching style as a whole, even if it could sometimes be strange or frustrating. Recommend.", "rating": 4, "expected_grade": "A", "created": "2023-12-31T08:33:25.172195Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "He is a quirky guy who has his funny moments but at the end of the day, is a terrible instructor and comes off as incredibly arrogant and annoying. Yes, his lectures are engaging, but for all the wrong reasons. He rambles on about his work and personal experiences but ends up teaching very little substance as a result. He takes pride in his slides for being minimal, which isn't a problem by itself. But when you combine minimal slides containing useless information and formatting and an instructor who rambles on about pointless topics the whole lecture, then it becomes a problem. \r\n\r\nExams are not fair. He tells us that to do well on exams we need to have a deep level of understanding of the material and to think outside of the box, which again, isn't a problem by itself. But he never gives us practice material to achieve that, as the homeworks are super straightforward and generally unrelated in concepts to exams, and doesn't teach properly enough to expect that from us. This is evident from our exam 2 average, which was 69 percent. Comparing that to Fardina's class (the instructor he was co-teaching with), which was 86 percent, it becomes comically unfair. He also never curved because of that exam even though he said he would. He said he instead \"compensated\" by making the final a bit easier, which is funny because our final exam average was still low at 82 percent compared to Fardina's 96 percent. \r\n\r\nAt least CMSC320 isn't too difficult conceptually, with much higher weightage on homework, and less on exams, allowing many students, including me, to barely manage to get a good grade. I just feel really bad for people who were stuck with him for CMSC250 and/or will be for CMSC351, because those are objectively two of the most conceptually difficult CS classes students will take, with high weightage on exams, and Max will do everything to make it even harder for you.", "rating": 1, "expected_grade": "A", "created": "2024-01-20T07:20:29.712400Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "no way bro grades subjectively", "rating": 2, "expected_grade": "B", "created": "2024-02-06T21:20:26.210698Z"}, {"professor": "Maksym Morawski", "course": "CMSC320", "review": "I second what the person below me said", "rating": 1, "expected_grade": "A-", "created": "2024-02-21T03:59:20.397520Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "I learned nothing in this class", "rating": 1, "expected_grade": "", "created": "2024-03-08T17:45:49.085358Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "What are his practice exams lol. useless, terrible", "rating": 1, "expected_grade": "", "created": "2024-03-10T23:02:42.252634Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC320", "review": "he's nice but i haven't been able to pay attention in a single lecture the entire semester they're so dry and content dense so i've had to self study\r\n\r\nprojects aren't hard but they're tedious\r\n\r\npractice exam was not helpful for exam 1 (formatted pretty different from the actual exam), a lot of the exam came down to guessing what to write on the allowed note sheet because it wasn't clear how much detail we needed to remember for the different parts of the sheer amount of content we covered", "rating": 2, "expected_grade": "", "created": "2024-03-28T13:44:44.199399Z"}], "department": "CMSC", "course_number": "320", "name": "CMSC320", "title": "Introduction to Data Science", "credits": 3, "description": "<b>Prerequisite:</b> Minimum grade of C- in CMSC216 and CMSC250.\n<b>Restriction:</b> Permission of CMNS-Computer Science department.\n<b>Credit only granted for:</b> STAT426 or CMSC320.\nAn introduction to the data science pipeline, i.e., the end-to-end process of going from unstructured, messy data to knowledge and actionable insights. Provides a broad overview of several topics including statistical data analysis, basic data mining and machine learning algorithms, large-scale data management, cloud computing, and information visualization.", "is_recent": true, "geneds": null}