{"average_gpa": 3.190452261306533, "professors": ["Elias Gonzalez", "Elias Gonzalez", "Elias Gonzalez", "Elias Gonzalez", "Elias Gonzalez", "Elias Gonzalez", "Elias Gonzalez"], "reviews": [{"professor": "Elias Gonzalez", "course": "CMSC125", "review": "If you have the opportunity to take a class with Elias, I highly recommend you do it. He's very easy going and lenient with basically everything. He's a good lecturer and tries to make things interesting when they're not. Any extension requests are always accepted and honored, his email is always open, very helpful during office hours, and is overall a great person. The class was pretty easy, as long as you put in effort you can get a good grade. The coding in the class is pretty basic and if you have a little background you'll be set, even if you don't the assignments are very doable and he always explains things in detail during class. The rest of the class is about the tech field and is still relatively interesting, but there is one section of the class that's done on code.org and it's not really that interesting in my opinion. This class was my first one that was about tech and he made it a better experience than I could've hoped for. The only complaint was that there always seemed to be issues with my grades being wrong and assignments not being able to be opened (we used google doc links for a lot of them), but that's partially due to the TA's. This was the most annoying part of the class, but it's an easy fix if you talk to him in class or over email, he'll usually regrade it and give points back. Overall, I would take his class again in a heartbeat. ", "rating": 5, "expected_grade": "A", "created": "2022-05-16T00:30:31Z"}, {"professor": "Elias Gonzalez", "course": "CMSC125", "review": "Super chill and lenient professor. You learn a lot and it should be an easy A if you do the work.", "rating": 5, "expected_grade": "A", "created": "2022-12-28T19:59:58.991473Z"}, {"professor": "Elias Gonzalez", "course": "CMSC125", "review": "Perhaps the most caring professor I've ever had. Makes class engaging and is super attentive to the feedback of his students. Workload is manageable and work is straight forward.", "rating": 5, "expected_grade": "A", "created": "2023-05-21T22:56:03.783141Z"}, {"professor": "Elias Gonzalez", "course": "CMSC125", "review": "Great professor, class was engaging and he was approachable and helpful", "rating": 5, "expected_grade": "A+", "created": "2023-06-01T15:08:08.724644Z"}], "department": "CMSC", "course_number": "125", "name": "CMSC125", "title": "Introduction to Computing", "credits": 3, "description": "<b>Prerequisite:</b> Must have completed or be concurrently enrolled in MATH115 or higher.\n<b>Restriction:</b> Must not be in the Computer Science program; and must not have completed any courses from CMSC131-499; and must not have completed INST126 or INST127.\nIntroduces you to the computing field as a whole. You will gain skills used across the spectrum of computing majors and learn about the great variety of routes into the various areas of study and employment in technological fields.", "is_recent": true, "geneds": null}