{"average_gpa": null, "professors": ["Jeffrey Adams", "Elizabeth Wilson", "Wiseley Wong", "Roohollah Ebrahimian", "Samuel Braunfeld", "Anthony Ostuni", "Wiseley Wong", "Wiseley Wong", "Wiseley Wong", "Wiseley Wong", "Wiseley Wong"], "reviews": [{"professor": "Wiseley Wong", "course": "CMSC475", "review": "(online fall 2020)\r\n\r\nWas excellent lecturing and responsive to questions while giving proofs and examples for course content. Pace was fine and he was generous with regards to exam scheduling.", "rating": 5, "expected_grade": "A-", "created": "2021-01-12T02:14:34Z"}, {"professor": "Wiseley Wong", "course": "CMSC475", "review": "Couse was interesting, Wiseley taught it well and recorded lectures. Homework and exams followed the lectures to a T and were easy enough. Average exam grades were around 90 without a curve, but that might've been because they were open for 48 hours due to online classes so you could rewatch lectures.\r\n\r\nOnly nitpick is I thought it was kind of boring sometimes but that might've just been the fact that the class was online. ", "rating": 4, "expected_grade": "A", "created": "2021-01-15T04:17:18Z"}, {"professor": "Wiseley Wong", "course": "CMSC475", "review": "Wiseley is a great professor. Lectures were interesting. The exams and grading are very fair.", "rating": 5, "expected_grade": "A+", "created": "2023-05-17T17:54:07.875528Z"}], "department": "CMSC", "course_number": "475", "name": "CMSC475", "title": "Combinatorics and Graph Theory", "credits": 3, "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH240, MATH341, MATH461); and 1 course with a minimum grade of C- from (MATH241, MATH340). And permission of CMNS-Computer Science department; or permission of CMNS-Mathematics department.  Cross-listed with MATH475 .\nGeneral enumeration methods, difference equations, generating functions. Elements of graph theory, matrix representations of graphs, applications of graph theory to transport networks, matching theory and graphical algorithms.", "is_recent": true, "geneds": null}