{"average_gpa": 3.8438931297709926, "professors": ["Melissa Lucas", "Christine Schaaf", "Melissa Lucas", "Christine Schaaf", "Melissa Lucas", "Melissa Lucas", "Melissa Lucas", "Christine Schaaf", "Christine Schaaf", "Melissa Lucas", "Christine Schaaf", "Melissa Lucas"], "reviews": [{"professor": "Melissa Lucas", "course": "COMM107B", "review": "Dr. Lucas is down to earth and teaches you exactly how to succeed in her class. If you put in the effort, there is no way to end the semester below an A. I Love her and the class, highly recommended. ", "rating": 5, "expected_grade": "A", "created": "2021-12-16T16:37:36Z"}, {"professor": "Melissa Lucas", "course": "COMM107B", "review": "Dr. Lucas is a very easygoing teacher and is also open to changing dates as long as the class asks. Almost everyone in the class has an A and as long as you put in a little bit of effort you should do well.", "rating": 5, "expected_grade": "A", "created": "2022-12-06T21:29:46.193436Z"}, {"professor": "Christine Schaaf", "course": "COMM107B", "review": "The nicest woman ever. I just had my last class today and I was sad! She is very accommodating to the needs of students and cares a lot about her class. As a person, she has tons to offer. Take her advice in and outside of class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T01:58:13.686525Z"}, {"professor": "Melissa Lucas", "course": "COMM107B", "review": "I love Dr. Lucas! She is so understanding and accommodating for her students, and she almost always lets you out early. She is a great teacher who gives really helpful feedback. I feel like she has actually helped me improve as a presenter. As long as she sees that you are putting in effort, you will get an A. Dr. Lucas is a great professor and I definitely recommend her!", "rating": 5, "expected_grade": "A", "created": "2022-12-12T14:19:57.775253Z"}, {"professor": "Christine Schaaf", "course": "COMM107B", "review": "Professor Schaaf is incredible. She is so kind and caring as a person, and as a teacher. She not only is a wonderful person but she is so knowledgeable on all things business and marketing, and is someone to look up to. If you have the opportunity to take her course and get to know her, take it!", "rating": 5, "expected_grade": "", "created": "2023-12-07T19:27:12.906152Z"}], "department": "COMM", "course_number": "107B", "name": "COMM107B", "title": "Oral Communication: Principles and Practices", "credits": 3, "description": "<b>Credit only granted for:</b> COMM107, COMM200, ENES143, INAG110, JOUR130 or THET285.\nA study of and practice in oral communication, including principles of interviewing, group discussion, listening, informative briefings, and persuasive speeches.", "is_recent": true, "geneds": null}