{"average_gpa": 3.4271085855692784, "professors": ["Jessica Lu", "Liang Ma", "L Gordon", "Julio Bermejo", "Xinyan Zhao", "Jon Hoffman", "Bo Yang", "Yvonne Slosarski", "Ning Xie", "Timothy Penn", "Amanda Irions", "Sreashi Das", "Annie Nichols", "Paula Nadler", "Karen Lamb", "Samuel Rubin", "Jean Vandenbosch", "Jeffrey McKinney", "Deepa Anagondahalli", "Gerry Strumpf", "Elizabeth Gardner", "Jade Olson", "Irina Iles", "Rowena Kirby-Straker", "Thomas McCloskey", "Sifan Xu", "Meridith Styer", "Nma Obike", "Jiankun Guo", "Stephanie Madden", "Kathleen Brown", "William Howell", "Rebecca Alt", "Megan Fitzmaurice", "Devin Scott", "Heather Epkins", "Jaclyn Bruner", "Hsin-Yi Chien", "Rong Ma", "Yiwen Dai", "Savreen Hundal", "Zexin Ma", "Janna Soeder", "Melissa Lucas", "Rodney Schwartz", "Julie Gowin", "Denise Erskine-Meusa", "Lauren Hunter", "Claire Tills", "Brooke Fowler", "Christopher Volker", "Hagar Attia", "Taylor Hahn", "Sarah Nelson", "Kyle Stephan", "Tyler Page", "Nathaniel Stoltz", "Lara Hollenczer", "Cassondra Pope", "Lauren Bender", "Luke Capizzo", "Sumin Fang", "Christopher Swift", "Morgan Hess", "Nora Murphy", "Jung Kyu Lim", "Gareth Williams", "Christina Saninocencio", "Lingyan Ma", "Rowena Winkler", "Alyson Farzad", "Andrew Caves", "David Payne", "Kimberley Hannah-Prater", "Yan Qin", "Marlene Cohen", "Sue Sherburne", "Sabeen Sheikh", "Mollie Kaufer", "Skye de Saint Felix", "Neha Kamran", "Victoria Ledford", "Sarah Aghazadeh", "Joshua Wood", "Daniel Foster", "Junqiao Chen", "Alex Thomas", "Jim Golden", "Anne Smithson", "Raphael Mazzone", "Tori Mends-Cole", "Mark Fernando", "Misti Yang", "Naette Lee", "Allison Chatham", "Randall Fowler", "Michael Paquette", "Jennifer Bourne", "Hyunhee Kim", "Kelly Daily", "Stephen Underhill", "Doo Lee", "Lois Lipman", "Alyssa Samek", "Jarim Kim", "James Gilmore", "Lauren Harris", "Julia Fraustino", "Kimberley Hannah", "Steven Cohen", "Lauren Wint", "Mengqi Zhan", "Jacquelyn Murdock", "Rachel Elrom", "Katherine Kuhn", "Michael Steudeman", "Leysan Khakimova", "Amanda Kennedy", "Melissa Janoske", "Sean Luechtefeld", "Alexandra Gibson", "Shannon Holland", "Michelle Futerfas", "Kathleen Kendall", "Josie Moore", "David Paglin", "Tiffany Banks", "Ashlee Richman", "Jung Lim", "Samantha Stanley", "Ashley Lewis", "Christine Schaaf", "Jeannette Viens", "Jose Gomez Garcia", "Junhan Chen", "Matthew Salzano", "Sarah Vick", "Shawna Dias", "Soyoung Bae", "Tamanika Ferguson", "Yumin Yan", "Kisha Dasent", "Rose Piskapas", "Shoaa Almalki", "Duli Shi", "Darrian Carroll", "Aya Farhat", "Aaron Swanlek", "Jonathan Leach", "Shelby Sturm", "Ashley Aragon", "Katlin Gray", "Drew Ashby-King", "Saymin Lee", "Jacqueline Jackson", "Kathryn Thier", "Salima Valiyeva", "Elizabeth Phipps", "Megu Itoh", "Fielding Montgomery", "Taylor Hourigan", "Jeremy Grossman", "Ollie Jefferson", "Yuan Wang", "Taryn Myers", "Brittany Gregory", "Erika Perez Montes", "Xiaojing Wang", "Max Erdemandi", "Umisha Kc", "Tong Lin", "Jeannette Iannacone", "Jiawen Zhang", "Ari Perez Montes", "Kalin Schultz", "Delight Agboada", "Victoria McDermott", "Carolyn Robbins", "Divine Aboagye", "Shilin Xia", "Xin Ma", "Miriam Komuhendo", "Faith Otchere", "Viktoriia Savchuk", "Ran Ma", "Olivia Truban", "Alisa Hardy", "Daviana Fraser", "Kimberli Munoz", "Donia Galarowicz", "Rebecca Theim", "Tatenda Mashanda", "Sean Rhodes", "Abigail Vazquez Rosario", "Megan Fromm", "Aaron Swanlek", "Alisa Hardy", "Ari Perez Montes", "Ashley Aragon", "Aya Farhat", "Ayodeji Dapherede-Otusanya", "Carolyn Robbins", "Cassondra Pope", "Christopher Swift", "Daniel Foster", "Darrian Carroll", "Daviana Fraser", "Delight Agboada", "Donia Galarowicz", "Duli Shi", "Aaron Swanlek", "Alexandra Grimm", "Alisa Hardy", "Ari Perez Montes", "Ashley Aragon", "Aya Farhat", "Ayodeji Dapherede-Otusanya", "Berkay Erdemandi", "Cassondra Pope", "Christopher Swift", "Courtnee Connon", "Crystal Stone", "Daniel Foster", "Daviana Fraser", "Donia Galarowicz", "Delight Agboada", "Delight Agboada", "Alexandra Grimm", "Alex Thomas", "Alisa Hardy", "Ari Perez Montes", "Aya Farhat", "Ayodeji Dapherede-Otusanya", "Cassondra Pope", "Christopher Swift", "Crystal Stone", "Daniel Foster", "Divine Aboagye", "Donia Galarowicz", "Allison Doherty", "Anani Kuwornu", "Andrew Lowe Mohammed", "Ari Perez Montes", "Ayodeji Dapherede-Otusanya", "Cassondra Pope", "Chantay Moye", "Crystal Stone", "Daniel Foster", "Daviana Fraser", "Delight Agboada", "Allison Doherty", "Anani Kuwornu", "Andrew Lowe Mohammed", "Ayodeji Dapherede-Otusanya", "Cassondra Pope", "Chantay Moye", "Crystal Stone", "Daniel Foster", "Daviana Fraser"], "reviews": [{"professor": "Paula Nadler", "course": "COMM107", "review": "I originally had Vandenbosch as my professor for this course, but she ultimately fell ill and was replaced by Nadler.\n\r\nDespite the other reviews, I enjoyed having Nadler as my professor. She stuck very close to the text (she lectured by reading her notes from the text itself) and her exams were often open note. She also made lectures very interesting and open to discussion. She has a sarcastic sense of humor, but she never means to insult anybody. She actually praises people in the course that had speech anxiety because she notices how hard they work to overcome it.\n\r\nThat being said, I had an extensive theatrical and speaking background and received B's on most of my presentations. She does grade semi-harshly. However, she left extensive notes on our grades on ELMS (BIG PLUS--she sticks to ELMS quite closely, very convenient). She also replies to emails very quickly, so it's easy to get in touch with her.\n\r\nDefinitely socialize with her before and after class. She's a sweet woman! It will also get you on her good side. I missed probably close to 10 classes and the entire second exam, but she bumped my grade up from a C+ to a B- after an email asking her for help. She understands how important grades look on a transcript and will sympathize.", "rating": 4, "expected_grade": "B-", "created": "2015-05-14T09:42:00Z"}, {"professor": "Paula Nadler", "course": "COMM107", "review": "Prof. Nadler generally was a decent grader and did seem to take into account people's natural skill level entering the course, which was fair and helpful. \n\r\nShe did however have a tendency to nitpick on written assignments. She also definitely gave off a passive aggressive personality at times.\n\r\nThat being said, she was helpful when you asked her things before and after class. \n\r\nShe was notably open with her progressive political beliefs, which I suppose is to be expected on a college campus, and knowing this will help you when picking a speech topic. Talking about microaggressions will go over a lot better than talking about the perils of affirmative action. ", "rating": 3, "expected_grade": "B", "created": "2015-05-07T23:57:00Z"}, {"professor": "Paula Nadler", "course": "COMM107", "review": "DO NOT TAKE PAULA NADLER! I know this looks like a long review but PLEASE READ AND DO NOT TAKE THIS LIGHTLY.\n\r\nI should have taken my roommate's advice more seriously: He had Nadler when she began teaching 107 sections last Spring semester, and according to my roommate, she TOLD his class, \"I WAS ASSIGNED TO BEGIN TEACHING COMM 107 TO LOWER THE OVERALL GPA FOR THIS COURSE.\" I could not believe him at first, but as it turns out, he (and she) were right. There are 2 people in my class who have A- 's and one who has an A. The rest of the students' grades range from B to F. That just should not happen in an INTRODUCTORY LEVEL, GENERAL EDUCATION COURSE. In speaking with friends who took the same course this semester, I have heard that almost everyone in every class has an A or a B. \n\r\nAs said from previous reviewers, she plays favorites LIKE YOU WOULD NOT BELIEVE. I actually thought I was one of her favorites, but that seemed to change about midway through the semester as I started getting more and more points taken off of my assignments and speeches. Your skills are supposed to improve in this class, not degrade! It did not help having her at 8am three days each week, as she marked me off for coming in only 5 minutes late...and did not care about student who slept in. She does give you 3 free absences as per dept standards, but as it was my only 8am class, these 3 freebies evaporated all too quickly for me--and every class you miss after the first 3 basically removes from a half to a whole PERCENT off of your grade. Course is comprised of 200 points, and the participation grade is like 15 points or something like that. Every bit you miss will hurt you. NADLER LIKE TO NIT PICK ON EVERYTHING, BE AWARE.  \n\r\nShe is a terrible lecturer, and will start the year by going through the chapter assigned for that day's reading  and then will progressively cover less and less information than is on the exams. I received a 100, an 88, and a 55 on Exams 1, 2, and 3, respectively. For the main presentations, I received a 4.5/5, a 25/30, a 24/30, and then a 32/41 on the final. Did I become a worse student? I really doubt that.... given that I am in the Engineering school and got straight A's in all my other classes, and I also gave a most memorable speech at my High School graduation. \n\r\nIf you think you are a good public speaker, you are probably right. Don't let this woman's class tell you otherwise. Take anyone else and you should get a solid A just by showing up and trying your best. BUT NOT HERE. DROP IF POSSIBLE. Another section will likely open up. If you absolutely cannot drop her, HEED MY WARNINGS AND GOOD LUCK.", "rating": 1, "expected_grade": "B", "created": "2014-05-13T19:03:00Z"}, {"professor": "Paula Nadler", "course": "COMM107", "review": "This professor does play favorites (as the reviewer below mentioned) with athletes. She takes her personal feelings into the classroom, she also is plain mean to individual students. Try not to take this professor. She made everyone dread coming to class everyday. She sees everything as a challenge and does not like students who think/have ideas. ", "rating": 1, "expected_grade": "A", "created": "2013-12-17T13:54:00Z"}, {"professor": "Paula Nadler", "course": "COMM107", "review": "Nadler is disrespectful to students. She cops an attitude when people ask questions, rolls her eyes, and sighs at the class. One student said to me \"I am scared to ask questions anymore in class\". For a COMM107 teacher, I would hope she would know the impact of her verbal and nonverbal communication. She laughed at a students hair one day. She is not engaging at all. We have to use power points, and hand gestures, and move around during our speeches, but when she lectures for the class she just sits in a chair at the front, sometimes eating food. Are we supposed to do what she does? Or do what she tells us to do? She does not like to be challenged. She refused to repeat a vocabulary word for a student. I do not respect her as a teacher and do not think she should be allowed to teach an 100 level COMM class.", "rating": 1, "expected_grade": "A", "created": "2013-12-07T18:50:00Z"}, {"professor": "Paula Nadler", "course": "COMM107", "review": "Terrible professor, she definitely plays favorites among the athletes. She grades rather harshly on the group presentations. Her review sessions are not helpful, answering everything with \"We discussed it in class.\" Does not like to be challenged. ", "rating": 1, "expected_grade": "B", "created": "2012-12-15T02:00:00Z"}, {"professor": "Judith Tenney", "course": "COMM107", "review": "She's nice and her class is easy going but her grading and tests are so hard.\r\nAll she does in class is sit there and talk, and the stuff she's talkign about seems so easy and straight forward but them the tests are all fill in the blank and True/false and they ask you about the most random details in text book like \"how many avg hours do kids watch tv in the us\" and the word bank has like 7 different numbers so you just have to guess. \r\nas far as grading goes every times I turned in a paper to her it came back to me covered in red marks with her \"corrections\" but really most of the time i hadn't done anything wrong, she just preferred things I said to be stated in her own style which really annoyed me. ", "rating": 2, "expected_grade": "B", "created": "2008-07-22T15:55:00Z"}, {"professor": "Gerry Strumpf", "course": "COMM107", "review": "Best teacher. So kind, yet also a fair grader. Oddly felt at home in her classroom. ", "rating": 5, "expected_grade": "", "created": "2013-12-24T17:09:00Z"}, {"professor": "Gerry Strumpf", "course": "COMM107", "review": "Gerry Strumpf is a seriously adorable southern woman that can be put off track easily and tells story after story in class. We hardly took notes, and I never opened the book. That being said, she is a strangely hard grader for her teaching style. The class was laid back and fun, and I genuinely enjoyed being in class. It is an easy A if you take your speeches seriously (which I didn't at first). She is such a kind woman and she made COMM107 bearable. I would definitely recommend her. ", "rating": 5, "expected_grade": "a", "created": "2013-11-21T18:22:00Z"}, {"professor": "Gerry Strumpf", "course": "COMM107", "review": "I'm kind of embarassed that I got an A minus at the end of this class because it was seriously easy, although she's a surprisingly tough grader. But she's pretty lenient and caring and nice person. If you're looking for an A in comm, take her. If you're looking to learn about public speaking, take her. If you're looking to skip class, don't take her she takes it seriously(totally the reason why I got the minus).", "rating": 5, "expected_grade": "A-", "created": "2009-01-31T22:43:00Z"}, {"professor": "Jade Olson", "course": "COMM107", "review": "Jade Olson is awesome and makes comm107 great. def take this class with her if you have the chance.", "rating": 5, "expected_grade": "A", "created": "2012-06-08T00:43:00Z"}, {"professor": "Stephanie Madden", "course": "COMM107", "review": "I don't understand the other review at all...Ms. Madden was a great teacher! She really was interested in making the class enjoyable to her students. She asked her students about their preferences on exams and played really helpful videos that were informative and fun. You'll probably end up having a B in this class; you'll only get an A if you actually give this class your time which is least likely. But she was still an awesome respectable teacher who cared about her students.", "rating": 4, "expected_grade": "", "created": "2015-01-25T14:05:00Z"}, {"professor": "Deepa Anagondahalli", "course": "COMM107", "review": "I don't know why she has so many bad reviews . . . \n\r\nComm is mostly common sense, mixed in with a few new terms. \n\r\nDeepa is not a harsh grader by any means. She actually grades pretty leniently. It's not an guaranteed 100% on every assignment, but it's still an A or B as long as you follow the directions. She's nice and she tries to make her lectures as interesting as possible.\n\r\nThat being said, her exams are mostly lecture based. Pay some attention in class and most importantly to the Powerpoints and definitions.\n\r\nHer exams are a little bit more detailed which can throw you off. Learn to memorize everything. Literally.\n\r\nOverall, a relatively easy enough A with some work involved.  ", "rating": 4, "expected_grade": "", "created": "2011-12-21T01:14:00Z"}, {"professor": "Deepa Anagondahalli", "course": "COMM107", "review": "guy below me said it all.  grades extremely harsh in attempt to make this useless subject important.  deducts points for no reason and is clueless to the actual topic she is teaching.", "rating": 1, "expected_grade": "", "created": "2011-05-16T02:28:00Z"}, {"professor": "Deepa Anagondahalli", "course": "COMM107", "review": "I came into this class worried about having Deepa because of the review below, but I soon found out it wasn't accurate at all. She has a slight accent which doesn't interfere with the lecture  and she tries to make lectures as interesting as possible (comm107 is a boring class). Her grading is harder than the other comm professors, but if you follow the in depth rubrics she hands out you can easily pull an A or B on every assignment. ", "rating": 4, "expected_grade": "B+", "created": "2011-04-29T11:11:00Z"}, {"professor": "Deepa Anagondahalli", "course": "COMM107", "review": "Deepa is a power tripping ***** who loves to hear herself speak poor english for 90 minutes straight. She takes the class and grading way too seriously. Too bad this won't make her any more successful in life. This other review can NOT have come from a student. ", "rating": 1, "expected_grade": "A", "created": "2010-03-30T02:33:00Z"}, {"professor": "Deepa Anagondahalli", "course": "COMM107", "review": "I love Deepa!  She is just so nice, welcoming, and engaging.  She may grade harder than other COMM107 teachers but that's only because she really wants everybody's communication skills to improve.  She is a wonderful teacher!", "rating": 5, "expected_grade": "A", "created": "2009-12-17T16:50:00Z"}, {"professor": "Tyler Page", "course": "COMM107", "review": "The class was pretty easy overall, not much work just 5 speeches and quizzes are straight from the reading. Overall nice teacher very relaxed and grades pretty easily. ", "rating": 4, "expected_grade": "A", "created": "2017-11-19T22:35:50Z"}, {"professor": "Samuel Rubin", "course": "COMM107", "review": "One of the best teachers I have ever had period. Very easy A and the most fun you will have in a class at UMD. Take his class, you won't regret it", "rating": 5, "expected_grade": "A+", "created": "2018-01-03T05:45:50Z"}, {"professor": "Rodney Schwartz", "course": "COMM107", "review": "Rodney Schwartz is hella annoying. He won’t give out A’s in COMM107, which is ridiculous, it should be an easy A. He hates technology and is incompetent at it, so there is always issues with ELMS and he doesn’t respond to emails. He gets off topic and then blames the students for the for the distraction. The majority of the class is him going over the material from the last class and talking about random shit, so you’ll only learn new material for about 5 minutes out of the entire class. So if you want a B in a class that you should earn an A in, learn barley anything, and listen to a guy who thinks he’s the shit, I’d highly recommend Prof. Schwartz.", "rating": 2, "expected_grade": "B", "created": "2018-01-25T16:10:18Z"}, {"professor": "Rodney Schwartz", "course": "COMM107", "review": "So the professor's name is actually rodney schwartz, but i digress. DO NOT TAKE HIM FOR COMM. There are so many better teachers. He refuses to put anything on elms or tell you what your grades are. He is so unreasonable and does not teach at all. His tests are based completely on the  book, but he rarely goes over the content it in class. And when he does, it takes him so long to go over a simple concept so its no help. And on top of that he is super petty when it comes to presentations and will take points off just because he doesn't agree with you. Literally comm is so he easy, but he makes it 10x harder just because he is so old  fashion and refuses to get with technology and the times. My class was literally a month behind all the other sections so he had to drop half the assignments. DO NOT TAKE HIM!!", "rating": 1, "expected_grade": "", "created": "2014-05-18T14:30:00Z"}, {"professor": "Rodney Schwartz", "course": "COMM107", "review": "Oh, Rodney. Anti-technology, ELMS becomes useless, and you don't ever know your grade. For a communications professor he is a poor communicator as well. You don't learn much, but if you embrace the stupidity of the class you will do fine. Workload is very small and doesn't require much time or effort, but don't expect to be inspired to learn more about communications or anything. Probably better to find a different professor if you don't want a slow-paced class you learn next to nothing in.", "rating": 3, "expected_grade": "A", "created": "2014-12-14T12:44:00Z"}, {"professor": "Rodney Schwartz", "course": "COMM107", "review": "This review is also for Rodney Schwartz, the Comm \"Professor\". This guy (I will abstain from calling him professor, as that entails he actually educates students) was the worst person I've ever had for ANY class at Maryland. Not only was he completely incompetent at teaching the subject, his grades were vastly lower than every other comm class. First, onto his teaching skills. He has none. Seriously, he doesn't teach. More than half of our class was going over what we did last class, then the rest of it was him blabbering on about absolutely nothing. Well, if he sucks at teaching, at least he may give you a good grade right? Guess again. In a class full of 17 people, NO ONE GOT AN A. IN COMM107. 5 people around me got an 82 on one of the speeches, despite all varying in how well they actually did. Rodney Schwartz is the epitome of an awful \"professor\" at the University of Maryland, and you should avoid him unless you want to get a high C in COMM107. ", "rating": 1, "expected_grade": "?", "created": "2014-12-14T19:19:00Z"}, {"professor": "Rodney Schwartz", "course": "COMM107", "review": "Schwartz is a special type of person. He is the type of person that makes you so infuriated and frustrated at his teaching style, that the frustrations leak into other parts of your life. Every day after class (before I withdrew from it, because I could not take any more of his shit) I would find that I was still angry hours after I left the class. \r\nThe problems reached a head when I asked in class whether a certain book would count as a good source for the first speech. He said no, without explanation, so I asked again. This time he asked me if I was joking, and asked to speak with me after class. He chewed me out for being disruptive in class, and I told him that I had *NO* idea what he was talking about. I could tell that something was off about him at that point. \r\nAnd then the issues kept coming. Because he flat out REFUSES to use technology and post meeting times/places online, I didn't know that class was in the library one day, and he took away my participation points for the day. It's little things like that that added up, and caused me to withdraw from the class. Yes, I withdrew from the class, and got a big fat W on my transcript because of him. It was better than going through another day with him standing in the front of the class telling jokes, having no direction as a teacher.\r\nPlease take this as a warning. Stay away from Rodney Schwartz. He could quite possibly be the devil reincarnated, and his sole job on this earth is to drag students down to the depths of his education-less hell. Take my unfortunate story, and the other reviews, as proof that you do not want to have this man standing in front of you during class.", "rating": 1, "expected_grade": "", "created": "2015-01-22T08:05:00Z"}, {"professor": "Rodney Schwartz", "course": "COMM107", "review": "Shittiest teacher ever.\r\nKnows next to nothing about communication, hates everything about technology, and will give everyone a terrible grade regardless of the quality of work.  Highest grades in the class barely crossed the 90% mark.\n\r\nWorkload is fairly light, until the last few weeks where he frantically assigns the interview and persuasive and group speech to be due and presented within a week of each other.\n\r\nWork your ass off all semester, endlessly rehearsing your speeches, and dear old Rodney will reward you with a nice fat B.\n\r\nAvoid this teacher at all costs. ", "rating": 1, "expected_grade": "B", "created": "2015-12-29T12:01:00Z"}, {"professor": "Samuel Rubin", "course": "COMM107", "review": "Top tier, always go for him if you can get him.", "rating": 5, "expected_grade": "A", "created": "2018-03-16T14:10:28Z"}, {"professor": "Meridith Styer", "course": "COMM107", "review": "Stay as far away from her as possible! Her mental state is volatile at best; anger mgt issues; expects everyone to agree with her man-hating warped views that she tells inappropriately. When classes were delayed bc of weather, a commuter kid quietly walked in about 5 min late and sat silently in the back of the room. When Meridith got mad when no one volunteered to read their report (prob bc she skewers them), this kid quietly raised his hand. She flipped out at him bc he \"dared to think\" he would be called on when he was already given a 0 for the assignment bc he \"disrupted\" class by walking in late. How about: glad you made it ... Sorry to hear your car was hit on the way in. Hope you're ok. ", "rating": 1, "expected_grade": "A", "created": "2018-03-27T13:24:35Z"}, {"professor": "Christopher Swift", "course": "COMM107", "review": "Dr. Swift is a good professor, pretty chill as a person. Very clear in communicating things, responsive to student concerns. He is a tough grader though...", "rating": 4, "expected_grade": "A", "created": "2018-04-12T20:50:19Z"}, {"professor": "Samuel Rubin", "course": "COMM107", "review": "Easy fun and entertaining. Take him if you want crazy in your life.", "rating": 5, "expected_grade": "A", "created": "2018-05-11T12:42:24Z"}, {"professor": "Anne Smithson", "course": "COMM107", "review": "Professor Smithson is awesome. She brings a unique enthusiasm to every class period. She goes out of her way to make the course as fun as possible. You won't regret taking her.", "rating": 5, "expected_grade": "A", "created": "2018-05-22T05:29:43Z"}, {"professor": "L Gordon", "course": "COMM107", "review": "Dr. Gordon is a tough grader but is a lot of fun. She's crazy but it keeps the class interesting. ", "rating": 4, "expected_grade": "B+", "created": "2018-05-22T23:33:42Z"}, {"professor": "Anne Smithson", "course": "COMM107", "review": "incredibly fun teacher. loving it so far. very chill and helpful and willing to talk to you if anything comes up.", "rating": 5, "expected_grade": "A-", "created": "2018-09-26T02:12:13Z"}, {"professor": "Megan Fitzmaurice", "course": "COMM107", "review": "LOVE her! SO enthusiastic and interesting and happy to help with anything. She is super accessible ", "rating": 5, "expected_grade": "A+", "created": "2018-11-20T06:12:16Z"}, {"professor": "Matthew Salzano", "course": "COMM107", "review": "Such an amazing teacher! Actually taught the material on the syllabus, and was an easy grader. Had an amazing semester! 10/10 recommends", "rating": 5, "expected_grade": "A+", "created": "2018-11-27T23:36:57Z"}, {"professor": "Gerry Strumpf", "course": "COMM107", "review": "If you're a natural public speaker, this class is an easy A. Otherwise, Gerry does a great job of preparing you for the speeches you will give. A bunch of online quizzes (open book), no exams, a couple speeches, and one group project. Lectures require participation. Not the right teacher for quiet students... Highly recommend!!", "rating": 5, "expected_grade": "A+", "created": "2018-12-15T21:22:46Z"}, {"professor": "Gerry Strumpf", "course": "COMM107", "review": "I feel like you can't help but love Gerry's class. Yeah, she may be a bit crazy, but she is warm, caring, and clearly passionate about her subject. Although she grades a bit tougher that one would expect, she is more than willing to work with you to improve. Take this class if you want an entertaining hour fifteen every other day. Highly recommend.", "rating": 5, "expected_grade": "A+", "created": "2018-12-17T21:17:36Z"}, {"professor": "Allison Chatham", "course": "COMM107", "review": "Perfect kind of teacher for Comm. Kind, helpful, organized, and sets reasonable expectations for her students.", "rating": 5, "expected_grade": "A", "created": "2019-01-19T00:50:20Z"}, {"professor": "Yumin Yan", "course": "COMM107", "review": "She is so wonderful! Definitely take her for COMM107 if you can. Goes over content well and definitely prepares you for all the speeches :)", "rating": 5, "expected_grade": "A", "created": "2019-02-23T19:47:50Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Good professor, but not very easy. You will improve as a speaker if you take him, but your GPA might take a small knock.", "rating": 4, "expected_grade": "A-", "created": "2019-04-06T15:52:11Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "Wackiest dude I've ever met. He has a great teaching style, and vividly exemplifies the concepts. Absolutely magnificent.", "rating": 5, "expected_grade": "A", "created": "2019-04-19T02:13:50Z"}, {"professor": "Junhan Chen", "course": "COMM107", "review": "Great teacher, take her! Enjoyed the class lots.", "rating": 5, "expected_grade": "A", "created": "2019-05-07T03:29:47Z"}, {"professor": "Junhan Chen", "course": "COMM107", "review": "Really nice professor!", "rating": 5, "expected_grade": "A", "created": "2019-05-07T14:43:54Z"}, {"professor": "Tori Mends-Cole", "course": "COMM107", "review": "Awesome teacher.", "rating": 5, "expected_grade": "A", "created": "2019-05-07T22:29:14Z"}, {"professor": "David Payne", "course": "COMM107", "review": "Great professor but grades way too hard compared to other 107 professors, definitely take someone else if you can.", "rating": 3, "expected_grade": "A-", "created": "2019-05-10T15:05:22Z"}, {"professor": "David Payne", "course": "COMM107", "review": "Very difficult grader, especially for COMM107, not a bad guy, teaches well, but avoid for COMM107, he’s just not worth it for such an entry level course.", "rating": 2, "expected_grade": "B", "created": "2019-05-14T22:22:05Z"}, {"professor": "Allison Chatham", "course": "COMM107", "review": "Ms. Chatham is very kind and friendly. She sets clear and reasonable expectations on homework and on in-class speaking assignments, and is a lenient grader. Even if you are fairly inexperienced with public speaking, trying your best will provide you an A in the class.", "rating": 5, "expected_grade": "A+", "created": "2019-06-09T03:11:40Z"}, {"professor": "Janna Soeder", "course": "COMM107", "review": "really sweet, what a gangster. recommend 10/10", "rating": 5, "expected_grade": "A+", "created": "2019-12-01T19:26:29Z"}, {"professor": "Alex Thomas", "course": "COMM107", "review": "Not bad. Teaches the class well, pretty fair grader. ", "rating": 5, "expected_grade": "A", "created": "2019-12-03T18:54:47Z"}, {"professor": "Jeremy Grossman", "course": "COMM107", "review": "A great professor. Highly recommend anyone to take it with him. Super chill, fun and easy going. Class isn’t too difficult ", "rating": 5, "expected_grade": "A+", "created": "2019-12-04T00:36:32Z"}, {"professor": "Ollie Jefferson", "course": "COMM107", "review": "Don't take Jefferson for this course. Her unclear directions (that were sometimes very contradictory) made an easy gen-ed into something that I dreaded going to every day.", "rating": 2, "expected_grade": "A", "created": "2019-12-04T20:20:29Z"}, {"professor": "Paula Nadler", "course": "COMM107", "review": "Dr. Nadler is probably one of the worst teachers I have ever had. All of the other negative reviews about her are very accurate. She is completely closed off to any idea that isn't her own. She is a very harsh grader and plays favorites. Students who she likes will get very high grades on all their speeches, even if they clearly have an off day. Students who she does not like will never be able to get the same scores, no matter how skilled they are at public speaking and how hard they try. She is condescending and mean. She will take an opportunity to embarrass students in class and make them feel stupid when they try and answer her questions. She is very short tempered. If you pick a speech topic that she doesn't agree with, you can expect a bad grade. Any time you ask ANY question she will treat you like you are stupid and wasting her time. I could go on and on about her, but long story short, avoid her at all costs if you can.", "rating": 1, "expected_grade": "", "created": "2019-12-08T17:57:04Z"}, {"professor": "Jeremy Grossman", "course": "COMM107", "review": "Excellent comm107 professor. Fair grader and very helpful. I definitely did get better at public speaking and he gave good advice. He'll help you work through your speech at office hours if you go to them. Made a painful class much more bearable", "rating": 5, "expected_grade": "", "created": "2019-12-09T15:26:22Z"}, {"professor": "Fielding Montgomery", "course": "COMM107", "review": "Great Comm professor, easy grader, very understanding and friendly. He's easy to talk to and is usually available easily.  ", "rating": 5, "expected_grade": "A-", "created": "2019-12-15T22:52:13Z"}, {"professor": "L Gordon", "course": "COMM107", "review": "Tough grader. Fun but also has no filter, and can come off very rude sometimes. ", "rating": 3, "expected_grade": "A-", "created": "2019-12-16T00:56:37Z"}, {"professor": "Hagar Attia", "course": "COMM107", "review": "Nice teacher but low key felt as if it was harder than other comm classes", "rating": 4, "expected_grade": "A", "created": "2019-12-16T04:39:08Z"}, {"professor": "Aya Farhat", "course": "COMM107", "review": "I admired Aya so much throughout this semester. She is currently a grad student, with so much knowledge about the world! I loved listening to her explain her own experiences with research and communication. She forced me to grow my oral communication skills, which I am forever thankful for. Her class included 5 speeches and I have heard that other classes had less speeches. However, she always gives very constructive feedback and wants you to do well. If you are willing to put in moderate effort, Aya will notice and grade accordingly! The class may seem stressful, but it will help develop your oral communication skills.  I definitely recommend her for the oral communication credit :)", "rating": 5, "expected_grade": "", "created": "2019-12-17T21:11:04Z"}, {"professor": "Gareth Williams", "course": "COMM107", "review": "Williams is literally amazing—he’s the most chill and understanding professor ever. He understands that we’re busy college students, and because of that, he doesn’t want COMM to be our #1 worry come midterms or finals season. \r\nI’ve heard that other COMM profs tend to give out A’s like there’s no tomorrow, but if you actually want to improve your public speaking skills, you want Williams as your prof because he’s not too critical, but always offers useful suggestions and comments on your presentations and progress within the course.\r\nI’m not a strong public speaker myself, but having Williams as my COMM107 instructor really helped me grow confident in my abilities. ", "rating": 5, "expected_grade": "A", "created": "2019-12-18T02:43:19Z"}, {"professor": "Gareth Williams", "course": "COMM107", "review": "One of the most caring and just all around awesome professors I had this semester. Usually teaches COMM in the fall. Definitely recommend him if he’s available!", "rating": 5, "expected_grade": "A", "created": "2019-12-18T03:41:02Z"}, {"professor": "Drew Ashby-King", "course": "COMM107", "review": "Generally good, but grades a little harshly. He grades specifically to the rubric, so read that ahead of time. He'll still probably find something to take a point or two off of :/ Make sure you pay attention to due dates because they're inconsistent (sometimes due before class sometimes at 11.59 pm). \r\nI guess one pro is that he provides a lot of specific feedback for each of the assignments so that you know what to improve, but you won't get an easy A with this dude. ", "rating": 3, "expected_grade": "A", "created": "2019-12-21T20:44:37Z"}, {"professor": "Raphael Mazzone", "course": "COMM107", "review": "I took this class online and it was super easy. We had some reading quizzes and a few speeches. The speeches were recorded and turned in via video. We had an introductory speech, an information speech, a revised informational speech, a persuasive speech, and a special occasion speech. The final was another speech about what we learned and improved on throughout the class. The professor was very understanding and during the winter semester when I went on vacation and one of my hotels had bad wifi he let me turn in my assignment a day late without any points taken off. \r\n\r\nOverall hes a very nice guy and I highly recommend anyone who is struggling with public speaking to take the online version if you are uncomfortable with the classroom version ", "rating": 5, "expected_grade": "A+", "created": "2020-01-21T14:30:59Z"}, {"professor": "Jaclyn Bruner", "course": "COMM107", "review": "Dr. Bruner is one of the easiest going teachers. She made the lectures interesting, interactive, and allowed students to understand the material. There are online quizzes, but as long as you do the reading, the quizzes are easy. Very light grader when giving speeches.", "rating": 4, "expected_grade": "A", "created": "2020-02-12T15:15:27Z"}, {"professor": "Fielding Montgomery", "course": "COMM107", "review": "You're going to love Fielding! He understands that most students are not COMM majors, but he still makes sure everyone gets something from the class. He is incredibly understanding and caring. I HIGHLY recommend taking his class. ", "rating": 5, "expected_grade": "A+", "created": "2020-02-19T07:15:25Z"}, {"professor": "Karen Lamb", "course": "COMM107", "review": "She grades rather harshly and is extremely picky about pedantic stuff.  Her class also has attendance/participation points each day. On speech days she gives you vocal feedback in front of the entire class which can be extremely humiliating.  Most of her criticism is valid but do you really want to let your GPA suffer because of her.", "rating": 2, "expected_grade": "B+", "created": "2020-03-10T17:36:48Z"}, {"professor": "Jaclyn Bruner", "course": "COMM107", "review": "I did not want to take COMM. She understood most people were there because they had to be and did a good job teaching to that.  The class was interesting and not too difficult even if you arent interested in the material", "rating": 4, "expected_grade": "A", "created": "2020-05-03T16:54:55Z"}, {"professor": "Tori Mends-Cole", "course": "COMM107", "review": "amazing person. but sometimes forgetful/too busy with her other work. But if you talk to her during class she can always help", "rating": 5, "expected_grade": "A+", "created": "2020-05-08T03:22:28Z"}, {"professor": "Aaron Swanlek", "course": "COMM107", "review": "This prof is the COOLEST you could ever have. He is super young and cool. He also understands the stress students have over public speaking and makes the environment super lowkey for students to thrive and feel comfortable speaking. If you show up and do your speeches expect a very high grade. 100% pick Aaron if given the chance.", "rating": 5, "expected_grade": "A+", "created": "2020-05-11T01:58:43Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Such an amazing personable guy, only complaint is he gave out different grades for a group assignment that we worked on evenly but aside from that he ensures that your grade is good and makes the class super fun. I recommend taking him", "rating": 5, "expected_grade": "A+", "created": "2020-05-14T23:12:20Z"}, {"professor": "Alex Thomas", "course": "COMM107", "review": "Ok professor. Not my favorite but not my least favorite, so this professor isn’t bad to have ", "rating": 3, "expected_grade": "A", "created": "2020-05-15T23:44:57Z"}, {"professor": "Shawna Dias", "course": "COMM107", "review": "Super sweet lady! Definitely cares about all her students, and is a very flexible and understanding person. She is not a hard grader at all, I would definitely take her again.", "rating": 5, "expected_grade": "A+", "created": "2020-05-16T03:47:11Z"}, {"professor": "Tori Mends-Cole", "course": "COMM107", "review": "If you sign up for COMM107 and end up with her, I highly suggest dropping this course within the add/drop period and re-enrolling with a different professor. She projects herself as someone who wants to help her students and teach them how to be great communicators, but within two weeks into the course she reveals her true colors. She is an arrogant, unhelpful, and sometimes even offensive instructor. First of all, she gives very unclear instructions on her assignments and if you email her asking for a clarification, she won't even respond half of the time, giving the vague answer  of \"you should read the syllabus\" (even when the syllabus does not mention anything relevant). And on top of these unclear instructions, she still grades very harshly and hardly even mentions what you did wrong. If you ask her why something was graded the way it was, you will be lucky to get a proper response. She acts as if she is above everyone in the room, as if she has this aura where everyone will look up to her. And if she is running short on time, it doesn't matter if you worked your ass off on an assignment, or if you spent 3 seconds on it, you'll get the same grade. And despite the fact that we are in 2020, she has still makes so many racially insensitive comments in class which she probably thinks are okay just because she herself is a minority too.  Some of you who are reading this will probably think that this review is biased, but I am not the only one who has felt this way about her. I don't know why there aren't more reviews for her on PlanetTerp, but if you type in \"Victoria Mends-Cole\" into RateMyProfessor you will see a much more accurate depiction of who this teacher really is. To summarize this, if you want to avoid trouble your freshman year, just don't take this class", "rating": 1, "expected_grade": "A-", "created": "2020-05-22T03:26:03Z"}, {"professor": "Shawna Dias", "course": "COMM107", "review": "Great professor! Really enjoyed her class, and she made the speeches low-pressure and chill. The assignments were all good and they weren't difficult. She's a really nice person too and it was easy to talk to her, in class and out. Learned a lot from her and had a great time in her class!", "rating": 5, "expected_grade": "A+", "created": "2020-06-25T00:16:11Z"}, {"professor": "Janna Soeder", "course": "COMM107", "review": "Awesome prof. She's super entertaining and awesome. ", "rating": 5, "expected_grade": "A", "created": "2020-09-01T02:06:44Z"}, {"professor": "Karen Lamb", "course": "COMM107", "review": "Amazing instructor. Cares about students. You need to put a bit effort in class to get grades but otherwise it's excellent", "rating": 5, "expected_grade": "A-", "created": "2020-09-29T16:35:07Z"}, {"professor": "Gerry Strumpf", "course": "COMM107", "review": "I love Gerry's class so much! She is trying really hard to make the online format work for everyone and it is the most enjoyable of all of my classes. Class is relaxed and fun but my public speaking has definitely improved. Make sure you show up to class, pay attention (she can tell!), and do the quizzes (reasonable ones) from the textbook, and you'll do well. She is my favorite professor and I highly recommend taking her for COMM107. I even plan on taking UNIV362 just because she is teaching it.", "rating": 5, "expected_grade": "A", "created": "2020-10-12T20:37:51Z"}, {"professor": "Christopher Swift", "course": "COMM107", "review": "Pretty good lecturer but tough grader", "rating": 3, "expected_grade": "B+", "created": "2020-11-01T05:09:02Z"}, {"professor": "Jade Olson", "course": "COMM107", "review": "Great professor. Very understanding and actually makes the class useful", "rating": 5, "expected_grade": "A+", "created": "2020-11-04T23:07:41Z"}, {"professor": "Ollie Jefferson", "course": "COMM107", "review": "Dr. Jefferson is an excellent professor! I was nervous about taking a public speaking course, but she is great at teaching ways to develop your skills and confidence.", "rating": 5, "expected_grade": "A+", "created": "2020-11-07T04:02:02Z"}, {"professor": "Kalin Schultz", "course": "COMM107", "review": "Kalin is one of the sweetest and friendliest instructors I have ever had. It’s very easy to talk to her because she is very relatable and makes a point of letting students know they are not alone in their struggles, saying she struggles with similar things too (i.e. deadlines, group work, etc.). She is very understanding and accommodating as long as you communicate with her. That’s not to say that she’s a pushover; she usually won’t extent deadlines because it is a college course, but she is super understanding, and even if you don’t think anything will change if you come to her with a problem in her class regarding deadlines, I think it’s still really important to be in communication with her because her knowing your situation is a big way she can help you and just be aware of where you are. And if something in her class isn’t working well for you, chances are she’d be happy to help you figure out another way to approach it. She is always offering to meet individually with students who are struggling in any way, and she is happy to take the time to come up with individualized plans for her students that need it so they can succeed best. I don’t know a lot of people in my class personally, but the environment she creates is very comfortable, and I feel safe speaking my mind without being judged because she creates a very friendly and accepting environment. I feel comfortable striking up a conversation with pretty much anyone in my class just because of how relaxed and friendly the environment is. Her lectures are interesting and easy to understand. There are a lot of presentations we have to do, but Kalin does everything she can to help students have end products they are content with. She provides students with a lot of resources and places emphasis on preparation. I feel very equipped with resources and knowledge every time I start an assignment, its really just a matter of putting that knowledge into action. Even for a Gen Ed, I found the class to be really interesting. In her lectures, she’ll also share a lot of short videos that help illustrate a concept she’s teaching. The videos are one of my favorite parts about lectures because they’re really interesting and entertaining, yet also educational. Overall, she is a very friendly and understanding professor. Every student in her class is accepted and celebrated. It really is a fun class.", "rating": 5, "expected_grade": "", "created": "2020-11-18T18:47:41Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "Great guy. Straightforward class. Syllabus schedule is detailed so you should never forget about some minor assignment.", "rating": 5, "expected_grade": "A", "created": "2020-11-24T22:01:34Z"}, {"professor": "Sarah Aghazadeh", "course": "COMM107", "review": "Awesome professor, really cares about her students! ", "rating": 5, "expected_grade": "A", "created": "2020-11-26T21:58:27Z"}, {"professor": "Jeremy Grossman", "course": "COMM107", "review": "Very good teacher! Does a good job engaging students in the virtual format of the class! ", "rating": 5, "expected_grade": "A-", "created": "2020-12-02T04:29:39Z"}, {"professor": "Taylor Hourigan", "course": "COMM107", "review": "Taylor is great. Grades leniently, has clear expectations on assignments. If you do your work at all, easy A.", "rating": 5, "expected_grade": "A-", "created": "2020-12-03T20:30:58Z"}, {"professor": "Ashley Aragon", "course": "COMM107", "review": "She’s a really chill professor who’s really kind and understanding of her students especially with the stress we feel with the pandemic. Speeches are not graded harshly just put in some effort. Quizzes are not hard if u read the textbook", "rating": 5, "expected_grade": "A", "created": "2020-12-10T18:20:21Z"}, {"professor": "Aaron Swanlek", "course": "COMM107", "review": "Aaron is the NICEST guy ever! He is incredibly understanding and is willing to work with you to make sure you succeed in this class. The class is not hard and he does an amazing job at trying to make this class as easy as possible while also making sure you are learning the material. Especially with virtual learning, this man has been awesome at creating a stress-free experience. I felt super comfortable in this class and also feel like I learned a lot about public speaking. He truly knows his stuff and is just passionate about public speaking and communication, so please take this class with Aaron Swanlek if you get the chance, I promise you will not regret it. ", "rating": 5, "expected_grade": "A+", "created": "2020-12-11T16:31:14Z"}, {"professor": "Karen Lamb", "course": "COMM107", "review": "One of my favorite professors this semester, she is such a sweet professor. She is extremely accommodating and great to work with. She doesn't give a ton of homework only 2 weekly assignments. ", "rating": 5, "expected_grade": "A", "created": "2020-12-15T18:33:52Z"}, {"professor": "Jonathan Leach", "course": "COMM107", "review": "John was a really nice guy who made COMM107 super easy.  All our presentations were recorded so we could do as many takes as we liked, but you don't really need to since he is an incredibly lenient grader. Every other assignment is essentially just completion points, except for the quizzes. They quizzes were directly based off the textbook, and you could easily find the answers in it so reading isn't really necessary. There is a group presentation towards the end of the semester which was kind of annoying to organize with everyone. The final was just a special occasion presentation, which had basically no structure so you could do whatever.", "rating": 5, "expected_grade": "A+", "created": "2020-12-16T20:55:00Z"}, {"professor": "Jeremy Grossman", "course": "COMM107", "review": "He is very nice and genuinely cares about his students. The assignments are pretty chill because you get top pick your own topic for each type of speech/presentation. Lectures are very engaging and he doesn't give busy work. A lot of group work is probably the only negative, but that's probably the case in any COMM107 class because the classes are small (~30 ppl in mine).", "rating": 5, "expected_grade": "A", "created": "2020-12-17T19:52:52Z"}, {"professor": "Sarah Aghazadeh", "course": "COMM107", "review": "She seriously is one of the best professors you could have for this course and at UMD. She is very understanding of mental health and ensures that you are doing fine and the course load is very manageable. She is also very flexible with submitting assignments, and accommodated the class to fit the online method. Her grading is very relaxed, and as long as you put a decent effort, you will be guaranteed at least a 95%.  There is a textbook and weekly quizzes but the quizzes are open note and I consistently got 9 and 10s out of 10 without ever reading the textbook. Seriously, take this course with this professor.", "rating": 5, "expected_grade": "A+", "created": "2020-12-18T01:48:49Z"}, {"professor": "Tori Mends-Cole", "course": "COMM107", "review": "I advise not taking COMM107 with her. For one, she would never give written feedback (you had to attend her office hours to find out why you got a certain grade, even though this course was taught online), even after making us wait for several weeks to a month to get a grade on any given assignment. She would also make insensitive comments in class that would make students feel uncomfortable, and often did not respond to questions sent through email. I'll give her some credit for being flexible on deadlines, and I think that some criticism of her is overblown, but I still would not recommend taking this course with her. ", "rating": 2, "expected_grade": "A-", "created": "2020-12-21T19:10:38Z"}, {"professor": "Shawna Dias", "course": "COMM107", "review": "I took this course in Fall 2019\r\n\r\nPros:\r\n+ She's extremely sweet and understanding and will go out of her way to make sure you understand content.\r\n+ Easy A", "rating": 5, "expected_grade": "A", "created": "2020-12-22T01:20:24Z"}, {"professor": "Christopher Swift", "course": "COMM107", "review": "Picky grader but otherwise good teacher and adapted to online stuff pretty well. Definitely still an easy gen ed course with him", "rating": 4, "expected_grade": "A", "created": "2020-12-31T23:41:52Z"}, {"professor": "Randall Fowler", "course": "COMM107", "review": "Great professor. Was always available if you needed help and was always very encouraging and accomodating.", "rating": 5, "expected_grade": "A", "created": "2021-01-13T23:59:25Z"}, {"professor": "Aaron Swanlek", "course": "COMM107", "review": "Professor Swanlek, if you're reading this, YOU ARE AMAZING. I took this class because it was required, however I was excited to go to class because of him. He was a great, understanding teacher who knew what he was talking about and kept the class entertained with his occasional jokes and great personality. If you decide to take COMM107, go with Swanlek.", "rating": 5, "expected_grade": "A+", "created": "2021-01-14T18:44:04Z"}, {"professor": "Aaron Swanlek", "course": "COMM107", "review": "I cannot stress how incredible Professor Swanlek is. He is truly such an amazing professor. First off, he knows what he's doing and does so well with helping out students to any capacity that they need. Even with the virtual format and lack of engagement from students, he made class so fun and interesting. He's always cracking jokes and being himself which makes learning and staying engaged so much easier. He's seriously the coolest guy ever and made class so fun. He's so understanding with students, especially considering the virtual format and all that. He's also not a harsh grader. He's so passionate about what he does and it really comes off on screen. If you have the choice, pick Swanlek for comm107, you definitely won't regret it. The nicest coolest most understanding person ever. ", "rating": 5, "expected_grade": "A+", "created": "2021-01-16T00:31:17Z"}, {"professor": "Janna Soeder", "course": "COMM107", "review": "Great teacher, super nice, and grades pretty leniently. Her feedback is helpful and she grades in a timely manner. ", "rating": 5, "expected_grade": "A", "created": "2021-01-19T05:18:25Z"}, {"professor": "Sarah Aghazadeh", "course": "COMM107", "review": "Very kind and willing to work with you. Zoom classes got boring sometimes. Some assignments felt like useless busy work.", "rating": 4, "expected_grade": "A", "created": "2021-01-22T22:00:38Z"}, {"professor": "Jade Olson", "course": "COMM107", "review": "Very chill professor, has a great sense of humor and understands that not everyone is a good speaker. Sometimes grades strictly if you make mistakes but gives you useful feedback on how to improve. Definitely a good choice if you need to take this class.", "rating": 5, "expected_grade": "A", "created": "2021-02-10T22:56:00Z"}, {"professor": "Carolyn Robbins", "course": "COMM107", "review": "So chill and understanding. Definitely would recommend, great teacher and none of the workload was too much at all. ", "rating": 5, "expected_grade": "A", "created": "2021-03-11T17:05:56Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "This dude is wackyyy and so chill. Barely any work. Lectures were fun and engaging. Being all online, this was the only class to genuinely put a smile on my face during lectures.", "rating": 5, "expected_grade": "A", "created": "2021-04-02T03:28:10Z"}, {"professor": "Shelby Sturm", "course": "COMM107", "review": "Very helpful, awesome teacher. Probably my most organized professor since going online. Step-by-step rundown of each weeks assignments/ what we are going to do. I am expecting an A. She is also very sweet and accommodating!", "rating": 5, "expected_grade": "A+", "created": "2021-04-12T17:50:57Z"}, {"professor": "Janna Soeder", "course": "COMM107", "review": "didn't really love the class in my own opinion, but it was fine. She is very open and engaged. Her feedback is helpful but she will heavillyy critique your outlines even though it's just for comm107. However she graded lighter than expected for the actual presentations (based on how much she would critique the outlines). She's a good professor, I just didn't like the class itself. ", "rating": 3, "expected_grade": "", "created": "2021-04-21T18:23:21Z"}, {"professor": "Carolyn Robbins", "course": "COMM107", "review": "Pretty chill and gives you genuine feedback on your presenting skills. Had her for online comm107 and it was pretty relaxed, just stay on top of your assignments and put some effort in and its an easy A.", "rating": 5, "expected_grade": "", "created": "2021-05-10T01:54:24Z"}, {"professor": "Delight Agboada", "course": "COMM107", "review": "Best Professor Ever ! Very understanding, explains the course well, she helped improve my speech skills, and so much more . I enjoyed taking COMM 107 with her !", "rating": 5, "expected_grade": "A+", "created": "2021-05-12T02:07:45Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "Ms. Pope's class was one of those classes were she wasn't about to let you slack off and do nothing, however, everything you would ever do in the class would be for the genuine purpose of you becoming a better speaker in class. She was an awesome teacher and she made class really fun and engaging through a bunch of in class activities and she was also super helpful in clarifying topics or guidelines for assignments. She's a fair grader too and leaves a ton of feedback on every assignment you do. 10/10 recommend taking her course. Only thing I didn't like was the textbook but that's just cuz textbooks are absolute ass with any class.", "rating": 5, "expected_grade": "A+", "created": "2021-05-13T16:43:28Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "I feel like she wasn't always super considerate of the circumstances her students were facing. I distinctly remember an email where she told me \"The pandemic is not an excuse for you to not attend class.\" This was when I decided to take class online for 2 days right before spring break (where UMD practically forced students to go home) in order to avoid possibly infecting my family, some of whom are high risk. ", "rating": 2, "expected_grade": "B+", "created": "2021-05-14T20:59:42Z"}, {"professor": "Fielding Montgomery", "course": "COMM107", "review": "Great professor, very understanding and actually cares about your progress. Made this class as stress free as possible. You still had to put in the effort to get a good grade, but Montgomery makes sure that the class does not take up a ridiculous amount of time in your day. The amount of work he gave was fair. You literally cannot go wrong by taking the class with him.", "rating": 5, "expected_grade": "A+", "created": "2021-05-15T23:32:39Z"}, {"professor": "Delight Agboada", "course": "COMM107", "review": "Was my favorite professor this semester. She is caring and understanding. Also a great teacher that explains everything clearly and grades fairly. Highly recommend taking COMM 107 with her! ", "rating": 5, "expected_grade": "A-", "created": "2021-05-17T21:20:46Z"}, {"professor": "Saymin Lee", "course": "COMM107", "review": "Professor Lee is a really easy grader, and her feedback really helps with improving your public speaking. Although the work given before an assignment may seem like busywork, it honestly helped fortify concepts for the class. I would definitely recommend her to anyone. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-19T14:20:52Z"}, {"professor": "Fielding Montgomery", "course": "COMM107", "review": "Super sweet professor who always made his lectures straight to the point.  He grades quick and is super helpful and gives great advice. ", "rating": 5, "expected_grade": "A", "created": "2021-05-24T22:40:33Z"}, {"professor": "Carolyn Robbins", "course": "COMM107", "review": "The class was very laid-back with an easy workload and easy grading, as long as you stay on top of assignments and get things done in a timely manner. Professor Robbins is one of the nicest professors, and will allow for work to be slightly late with a good explanation and will extend deadlines if necessary.", "rating": 5, "expected_grade": "A", "created": "2021-05-27T17:49:38Z"}, {"professor": "Aaron Swanlek", "course": "COMM107", "review": "I don't normally write reviews on professors but Aaron is the goat! Great lecturer and very lenient grading. He is very knowledgeable and will help you whenever you need it. His classes also end early most of the time.", "rating": 5, "expected_grade": "A", "created": "2021-10-20T02:50:12Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "Thomas is amazing! He genuinely cares about your success and well-being. He is very flexible and is THE fastest grader and responds to emails almost instantly. He knows comm107 is a gen-ed and is no one's priority, so if you just turn in all the assignments an A is guaranteed. The speeches aren't that bad and he's a very lax grader. Just don't go over or undertime, and you'll most likely get a 95-100%. He's a great lecturer and makes class so much fun. Also he lets us out of class early most days which is nice.", "rating": 5, "expected_grade": "A", "created": "2021-11-03T13:45:13Z"}, {"professor": "Carolyn Robbins", "course": "COMM107", "review": "She is extremely nice and as long as you do the presentations, you will pass the class. She's a easy grader and will allow you to get an extension if you just talk with her. Also had a lot of fun conversations with her in class.", "rating": 5, "expected_grade": "A", "created": "2021-11-04T16:37:02Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "Very vulnerable and understanding guy. Quizes are very easy and open book, the work load in general is very laid back. He's also very funny ", "rating": 5, "expected_grade": "A+", "created": "2021-11-17T20:58:19Z"}, {"professor": "Jonathan Leach", "course": "COMM107", "review": "Easy prof. Likes marshmallow sweet potato tho so kinda weird", "rating": 5, "expected_grade": "A+", "created": "2021-11-18T18:06:42Z"}, {"professor": "Viktoriia Savchuk", "course": "COMM107", "review": "Great professor. Gives you every possible opportunity to do well and earn points in this course. Show up to class and put in some effort and you will get an A. ", "rating": 5, "expected_grade": "A", "created": "2021-11-24T19:23:06Z"}, {"professor": "Jade Olson", "course": "COMM107", "review": "Where do i start with her.... Excellent communicator, you can tell she has a PhD in this field. Very accommodating to students, and overall, just a very sensible person. ", "rating": 5, "expected_grade": "A", "created": "2021-12-02T06:51:45Z"}, {"professor": "Kimberli Munoz", "course": "COMM107", "review": "She's a great teacher, but a bit bad at technology. Comm classes are an unnecessarily long 1hr and 15 minutes, but she keeps it somewhat entertaining. She grades pretty leniently and she's very friendly and understanding. There are weekly quizzes, but they're pretty easy to guess. As long as you stay on top of the class, it's an easy A.", "rating": 4, "expected_grade": "A", "created": "2021-12-02T23:15:42Z"}, {"professor": "Sean Rhodes", "course": "COMM107", "review": "Sean ya boy is a legend,\r\n\r\nPretty chill class ngl. Allowed you to turn in assignments late, like all quizzes due last day of class. Other assignments with due dates usually can be turned in late. Grading on speeches were relaxed, pretty much everyone got As or Bs. \r\n\r\nReally got along with all the students, class was pretty much just free time so everything was just chill, we barely worked on assignments.\r\n\r\nWant the easiest and best comm 107 experience? Take Sean Rhodes!", "rating": 5, "expected_grade": "A+", "created": "2021-12-07T15:12:03Z"}, {"professor": "Aaron Swanlek", "course": "COMM107", "review": "BEST TEACHER ON CAMPUS! So understanding and laidback and knows that students have other things going on so he makes the class as easy as possible. As long as you show up and give your speech you will get an A+ in the class. Makes everyone feel so comfortable in the class that giving the speeches is a piece of cake. If you can take this class with this teacher 100% DO IT1!", "rating": 5, "expected_grade": "A+", "created": "2021-12-07T16:04:52Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "His lectures are engaging and he is a fun person to talk to! He is very understanding and wants the best for his students. You can tell he enjoys teaching and that makes the class enjoyable. ", "rating": 5, "expected_grade": "A", "created": "2021-12-08T04:07:57Z"}, {"professor": "Kimberli Munoz", "course": "COMM107", "review": "She is super nice and understanding of your needs. VERY easy grader, so you can expect an A as long as you do all the work on time. ", "rating": 5, "expected_grade": "A", "created": "2021-12-08T07:38:14Z"}, {"professor": "Darrian Carroll", "course": "COMM107", "review": "Do not take this professor. The entire semester he just lectures you for the entirety of the class and does not stop talking. The end of the semester came and it felt like he just gave up. We had a presentation in October that he still hasn't given grades back for and tomorrow is the last class. We haven't had class since November 16th, but he posted a video on Monday deciding to tell us oh yeah, we have a presentation in two days and we're getting graded on eye contact (so we have to write a whole speech AND memorize it in two days). He wouldn't respond to emails, and now he's giving us all of these assignments (like 5 assignments) that are due next week during finals- far beyond the class's end. So he went MIA for the past few weeks, and then decides to throw all of this work at us just when finals are beginning. As a student, it's so frustrating and no professor should do this to his students.", "rating": 2, "expected_grade": "", "created": "2021-12-08T19:23:01Z"}, {"professor": "Mollie Kaufer", "course": "COMM107", "review": "Super nice, understanding, will help you if needed. Very organized, fun class. ", "rating": 4, "expected_grade": "A", "created": "2021-12-08T20:53:45Z"}, {"professor": "Janna Soeder", "course": "COMM107", "review": "She's very transparent with due dates/information and grades quickly (tough grader on outlines, less so on the presentation itself). No reason not to take her. ", "rating": 4, "expected_grade": "", "created": "2021-12-08T21:59:08Z"}, {"professor": "Jonathan Leach", "course": "COMM107", "review": "Very easy COMM107 class. Leach makes it impossible not to get an A.", "rating": 5, "expected_grade": "A+", "created": "2021-12-09T18:02:03Z"}, {"professor": "Ashley Aragon", "course": "COMM107", "review": "Super caring and friendly person and an amazing professor. She grades very easily and just really wants you to improve as a communicator. Coursework was very light, but you may have to grind for a couple of hours the day before presentations. She knows it's a Gen-ed so she tries to make it go as smooth as possible. The only slight problem is that the class itself is very boring, but that's not on Professor Aragon, that's the class in general. Highly recommend.", "rating": 5, "expected_grade": "A", "created": "2021-12-09T18:16:45Z"}, {"professor": "Aya Farhat", "course": "COMM107", "review": "TAKE HER!!! by far the best instructor i've ever had. she's very kind and makes a class about presenting as interesting as possible. speeches weren't crazy difficult and she gave us lots of feedback before speech day. i know a class on presenting can be scary to many but she literally does brief breathing exercises before speeches to help nerves :)\r\n", "rating": 5, "expected_grade": "A", "created": "2021-12-09T21:59:35Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "The best professor ever, fairly easy class if you follow within the rubric.", "rating": 5, "expected_grade": "A+", "created": "2021-12-11T23:21:55Z"}, {"professor": "Julie Gowin", "course": "COMM107", "review": "I'm confused by the over reviews listed below because I thought she was an excellent prof. She was so sweet and actually made the class entertaining with her fun anecdotes. I really enjoyed her class.", "rating": 5, "expected_grade": "A", "created": "2021-12-13T06:49:36Z"}, {"professor": "Megan Fromm", "course": "COMM107", "review": "She is the most caring person ever! She cares about her students and is really flexible in terms of assignments and grades. You will need to put effort in this course, but it is very manageable. She also creates a very safe environment that made public speaking a little less daunting. Overall, if you need to take this course, take it with Fromm you won't regret it.", "rating": 5, "expected_grade": "A+", "created": "2021-12-16T23:57:53Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Golden is very energetic and you'll never find yourself bored in his class. He is truly passionate about what he does and cares about each students' future. You should get an A as long as you follow the rubric and stay within the time limit.", "rating": 5, "expected_grade": "", "created": "2021-12-18T01:23:57Z"}, {"professor": "Duli Shi", "course": "COMM107", "review": "I don't recommend taking Comm 107 with Duli Shi. She was a very harsh grader and made us sign a statement at the start of class saying we weren't attending UMD to be average. She made this class unnecessarily difficult. The textbook reading is self explanatory and the textbook quizzes count for very little, so I'd skip paying the $40. ", "rating": 3, "expected_grade": "A-", "created": "2021-12-19T01:17:07Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Professor Golden was not my favorite. He can be sassy and tough on students, but honestly as long as you do what the rubric says and show effort he will give you an A. As someone who is not enthused about presentational speaking, I dreaded his class at times. I managed to get an A but it definitely required a lot of work. If you go up to him in class and ask him questions about your speech he is very willing to help, which is nice. ", "rating": 3, "expected_grade": "A", "created": "2021-12-21T00:52:25Z"}, {"professor": "Sean Rhodes", "course": "COMM107", "review": "Hands down the best professor I have had. There are three speeches throughout the course of the semester which are all pretty easy. I did not practice my speeches very much before giving them to the class and managed to pull an A on every one. He is a very lenient grader and understands public speaking is not for everyone. There are a few quizzes but they are worth a very small percent of your grade. They are online so the answers are in the textbook or google. Bonded with students allowing them to navigate the class rather than teach straight from the book. Show up to class to get details about upcoming speeches and get participation points. If you miss a day of class it's not a big deal as you can make up points unless you are presenting that day.", "rating": 5, "expected_grade": "A", "created": "2021-12-21T04:02:15Z"}, {"professor": "Faith Otchere", "course": "COMM107", "review": "Very dedicated and passionate professor about teaching COMM107. It was her first time teaching in the US and she did great. Most people expect an easy professor where they can skip and do the bare minimum work to pass the class... well if this is what you're looking for I'm telling you right now she will make you work for your grade in a reasonable manner and takes attendance for each class. You will end up being a more confident public speaker (I took this class in person) and you will learn something from it. Take her if you want to learn something.", "rating": 5, "expected_grade": "A+", "created": "2021-12-21T04:27:40Z"}, {"professor": "Lingyan Ma", "course": "COMM107", "review": "Good ", "rating": 5, "expected_grade": "A+", "created": "2021-12-21T05:48:49Z"}, {"professor": "Lingyan Ma", "course": "COMM107", "review": "She is very nice but I didn't really learn any new material in this class. Her lectures are word for word what the textbook readings are and your grade depends mainly on the presentations. As long as you can speak decently in front of the class you will get an A. If you want to actually enhance your communication skills I would take another professor but if you are looking for an easy A I would recommend her. ", "rating": 3, "expected_grade": "A+", "created": "2021-12-21T18:06:36Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "This class is pretty straightforward. I hate public speaking, but Cassondra provides good feedback after every speech and keeps the environment decently light. You do need a decent amount of time to prep, but if you put in the work you should be good. She doesn't take nonsense from anyone, but overall I had a good time and felt like I actually learned from this class. ", "rating": 4, "expected_grade": "A", "created": "2021-12-21T19:34:35Z"}, {"professor": "Megan Fromm", "course": "COMM107", "review": "Top tier professor who not only keeps you engaged in lecture, but understands that people have lives outside of class. \r\n\r\nI typically have neutral feelings towards professors, but Dr.Fromm has got to be one of my favorites.\r\n\r\nJust from the start of class, she would come in with a jocular mood, and set the tone well for the class. She was never monotone, and never contradicted herself. What I mean by the contradiction, is that there may be some communications professor who speaks in a monotone manner, isn't really prepared for class, and simply make the lecture useless or boring to go to. She isn't like that. I may have went on my computer a few times in lecture from being off task, but I wish I cherished having her as a professor more.\r\n\r\nAs a person, she's 10/10. The course is organized well, as there is not many assignments you have to do in a short period of time. Even cramming the speeches at the end is not a crazy task to do (although, I advise you not to do that lol). There's 10 quizzes throughout the semester, 4 speeches (including an online asynchronous final speech), and the rest of the assignments are graded on participation/completion.\r\n\r\nStructure of the course is amazing, as well as the person teaching it.\r\n\r\nOnly Con I'd say is that the 4th edition of the textbook is on libgen, but the class required the 5th edition of that book, so I had to pay $30 on this website to rent the book for 6 months. The quizzes are open note, so you could use the textbook with the quiz (questions on the quiz are based off of the textbook).\r\n\r\nIf you have the chance to take it with Dr.Fromm, I say you do. She takes everything into account because she knows people have lives at the end of the day. What more could you ask for from a professor?\r\n\r\n", "rating": 5, "expected_grade": "A", "created": "2021-12-22T02:16:30Z"}, {"professor": "Ashley Aragon", "course": "COMM107", "review": "Super nice teacher. Very easy grading, especially for the last two (of four) major assignments. She is also flexible if you communicate with her.", "rating": 5, "expected_grade": "A+", "created": "2021-12-26T00:48:01Z"}, {"professor": "Ran Ma", "course": "COMM107", "review": "Lenient grader and gives lots of respect. ", "rating": 5, "expected_grade": "A", "created": "2021-12-27T02:59:05Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "He has clear expectations and can be a bit sassy at times but as long as you follow the rubric and stay within the time frame for your speeches, you will do well in his class. If you are having trouble, just talk to him because he will try to help you out. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-27T18:48:50Z"}, {"professor": "Aaron Swanlek", "course": "COMM107", "review": "He is truly the best professor who tries to make sure that you learn all the important things while practicing giving your speeches formally and also host a laid-back atmosphere that everyone would feel comfortable talking about the things that they like during class. He frequently end his class early so even though I have a walk conflict with my next class after his class, I don't even have to worry about it at all. Most importantly, he is a lenient grader but also make sure that you would get constructive feedback on your given speeches so that you clearly know what you need to work on further and improve for your future speeches in the class. Make sure to take him if you can. \r\n\r\n", "rating": 5, "expected_grade": "A+", "created": "2021-12-28T16:43:44Z"}, {"professor": "Rebecca Theim", "course": "COMM107", "review": "For a public speaking class, there was a lot of other useless stuff she made us do. She was very tough to work with when doing the work and a very poor/unfair grader. Other Comm teachers are better from what I've seen and heard from my friends.\r\n", "rating": 2, "expected_grade": "", "created": "2022-01-09T00:54:01Z"}, {"professor": "Junhan Chen", "course": "COMM107", "review": "Really caring and understanding teacher, you will definitely enjoy her class!!!", "rating": 5, "expected_grade": "A+", "created": "2022-01-14T04:14:16Z"}, {"professor": "Donia Galarowicz", "course": "COMM107", "review": "Donia is AMAZING. As someone with lots of speaking anxiety, she created the perfect environment to present. She is EXTREMELY EMTREMELY EXTREMELY lenient on all the presentations which allowed me to focus on actually presenting well as I was not focused the grades. She made her own quizzes that were because the question bank had very confusing questions.", "rating": 5, "expected_grade": "A+", "created": "2022-01-21T18:47:35Z"}, {"professor": "Donia Galarowicz", "course": "COMM107", "review": "Good", "rating": 5, "expected_grade": "A+", "created": "2022-01-21T21:49:10Z"}, {"professor": "Tori Mends-Cole", "course": "COMM107", "review": "Worst Comm107 professor. Was such an easy class that she somehow made difficult. She will never answer your emails and will grade extraordinarily harshly without any feedback as of why or how to improve. She is strangely picky and if you don't do things exactly how she likes she will dock you points from it. On top of all that she was rude to her students and would single them out in class acting as if she was \"teasing\" or \"joking around\" with them but would just end up making the student and their peers uncomfortable. I hate to leave a comment like this but this is an easy class that should be relatively enjoyable whether you take it as a freshman or as a senior and she makes it awful and will mess up ur GPA when it should be an easy A+. I would give a zero if I could. She was one of the worst professors I've had and would rather take another difficult science course than any course with her because they I can at least gauge whether I'm going to do well or not and not just hope for the best and then get screwed over. ", "rating": 1, "expected_grade": "", "created": "2022-01-24T00:20:33Z"}, {"professor": "Jaclyn Bruner", "course": "COMM107", "review": "Prof. Bruner is one of the kindest professors I met. She is very understanding of circumstances and is a fair grader. If you put the effort in then you will surely succeed in that class. She gives you all the materials and lessons to be prepared for this class. ", "rating": 5, "expected_grade": "A+", "created": "2022-01-24T03:18:56Z"}, {"professor": "Jade Olson", "course": "COMM107", "review": "Dr. Olson was the most amazing teacher ever. She was very well-organized, super nice and caring to her students, and also so funny. I was so sad when my class with her ended because I am just going to miss her personality so much. I definitely 1000% recommend Dr. Olson.", "rating": 5, "expected_grade": "A+", "created": "2022-01-26T03:42:58Z"}, {"professor": "Carolyn Robbins", "course": "COMM107", "review": "She was the worst professor I had. She was nice as a person but a terrible professor. She told me I wasn’t going to pass. Withdrew to get away from her. ", "rating": 1, "expected_grade": "W", "created": "2022-02-08T19:45:50Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "This guy is a great professor. He is very down to earth and real with the students in his class. One thing I will say is don't take this class if you want an easy COMM professor who doesn't care much about the speeches. Dan will give you real feedback that will genuinely help you become a better public speaker and tends to be a harsh grader on the non speech assignments (such as outlines and reflections). However, if you take COMM with him, you will definitely come out a better speaker at the end of the semester.", "rating": 5, "expected_grade": "A", "created": "2022-04-02T19:21:45Z"}, {"professor": "Megan Fromm", "course": "COMM107", "review": "One of the best teachers I have had at UMD. If you are nervous about comm, please take it with her. As long as you are respectful she will give you so much in return and understands we have lives outside of school. ", "rating": 5, "expected_grade": "A", "created": "2022-04-12T21:04:43Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "Thomas is the best!  We had weekly quizzes on the textbook where everything was copy and paste, and we had three attempts- it's impossible to fail them.  I took the class on Zoom so it was all recorded lectures but he was super chill about grading!  He knows that most people are just there for the requirement and is really understanding of it and doesn't give a lot of work.  He is fun and even lets us call him by his first name!  Definitely one of the best comm professors from what I have heard from my other friends!  10/10 recommend he's the best!", "rating": 5, "expected_grade": "A+", "created": "2022-04-14T19:38:13Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "Thomas is an enthusiastic and flexible professor. He grades assignments fast, gives great constructive reviews, and allows extensions easily if you ask him with a good reason (an important exam from another class coming up on the same due date as his class or something like that). As long as you turn assignments in on time and show efforts in your speech (slides and note cards), As are guaranteed. Most of the time, he lets students out of class early and he is fun to listen and talk to.", "rating": 5, "expected_grade": "A+", "created": "2022-04-27T16:58:30Z"}, {"professor": "Darrian Carroll", "course": "COMM107", "review": "Took his class as a freshman Fall 2021. Felt he did a good job of illustrating his points to his students as a communications professor. Assignments and speeches were straightforward. Only giving him 4 stars out of 5 because he didn't really do anything that made him spectacular. He was good, but not great.", "rating": 4, "expected_grade": "A", "created": "2022-05-01T21:32:47Z"}, {"professor": "Victoria McDermott", "course": "COMM107", "review": "AWESOME PROF!\r\nDid not care abt attendance and was a very helpful grader in the sense of deadlines. ", "rating": 5, "expected_grade": "A", "created": "2022-05-03T13:27:39Z"}, {"professor": "Sean Rhodes", "course": "COMM107", "review": "He's honestly such a goat and really cares about us. Every class he checks in to make sure we're ok and he really understands burnout. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-03T14:44:19Z"}, {"professor": "Janna Soeder", "course": "COMM107", "review": "There are two types of COMM107 professors: those who don’t care about teaching and those who do care. Dr. Soeder is the latter. She is great at providing clear and constructive feedback and is very engaging. I enjoyed showing up to her class and she is an excellent professor. However, she definitely believes that there is no such thing as a perfect outline or presentation. If you truly want to learn in COMM107, then take her. But don’t expect to get an easy A with no effort because she holds her students to a high standard.", "rating": 5, "expected_grade": "A", "created": "2022-05-06T00:28:35Z"}, {"professor": "Jiawen Zhang", "course": "COMM107", "review": "Professor Zhang is a solid professor. She taught the material well enough, all her presentations were in bullet-point form so it was easy to get notes down. She was also accommodating with presentations and tried to help students overcome stage fright over the course of the semester. Good professor, took a star away because it was really boring and I played crossword puzzles all class.", "rating": 4, "expected_grade": "A", "created": "2022-05-09T17:00:58Z"}, {"professor": "Aaron Swanlek", "course": "COMM107", "review": "honestly THE BEST comm class prof ever. He genuinely care about his students and made the classes so engaging. I hate public speaking but all the exercises we did in class really help me overcome the fear of public speaking so take his class guys ", "rating": 5, "expected_grade": "A+", "created": "2022-05-09T21:01:59Z"}, {"professor": "Kalin Schultz", "course": "COMM107", "review": "Only good things to say about her!! She really tried hard to get the class to know each other, which made me more comfortable to do presentations. She is extremely understanding with getting assignments done and if you need an extension, just ask her. She is also a student, so she knows the struggles. She is very approachable and is willing to go get coffee or something with you if you need help. When it comes to the presentations, she is a fairly easy grader if you get it done and present. She is good with giving feedback too. I know the name of professors for COMM classes do not come out till last minute, but if you can, I REALLY recommend trying to get her. ", "rating": 5, "expected_grade": "", "created": "2022-05-11T02:34:48Z"}, {"professor": "Ashley Aragon", "course": "COMM107", "review": "Very nice, very understanding, and incredibly easy grader. Literally if you don't have a mental breakdown in front of the class during a presentation you're getting at least a 90. Pretty much no homework outside of prepping for speeches, so definitely highly recommend. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-11T19:35:45Z"}, {"professor": "Ashley Aragon", "course": "COMM107", "review": "She was very easy and cool. Very understanding and grades easy. ", "rating": 5, "expected_grade": "", "created": "2022-05-11T19:37:16Z"}, {"professor": "Saymin Lee", "course": "COMM107", "review": "An absolutely wonderful professor. People say that she is a lenient grader but I think its mostly because she actually grades fairly compared to other COMM professors how appear to have massive egos. She is super nice and will always be willing to help you out. The course was really relaxing and honestly kind of fun thanks to her grading. You will learn, have fun, and come out with a better grade in COMM than most. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-12T22:12:54Z"}, {"professor": "Carolyn Robbins", "course": "COMM107", "review": "So so nice and created a positive, low-stress classroom environment. She's very understanding and made an effort to connect with students. I really struggle with public speaking anxiety but she made it less stressful and she never took points off for visible nerves or anything along those lines, and she always praised me when I got my nerves under control. Just do the presentations and you'll get an easy A!", "rating": 5, "expected_grade": "A", "created": "2022-05-14T01:19:00Z"}, {"professor": "Ashley Aragon", "course": "COMM107", "review": "Best professor I’ve had at UMD", "rating": 5, "expected_grade": "", "created": "2022-05-16T08:51:51Z"}, {"professor": "Tatenda Mashanda", "course": "COMM107", "review": "T is overall a very nice guy. However, he can get a bit sassy and passive-aggressive at times. If you can get over that aspect, I would definitely recommend taking COMM107 with him. He is very lenient with grading (I never got below a 90% on speeches) and is very understanding too (I forgot to do a quiz one time and he let me take it past the due date). He took the time to learn everyone's name, as well as memorize little facts about us which I found to be very caring. Attendance is definitely mandatory for every class, so don't mess around with that. ", "rating": 4, "expected_grade": "A+", "created": "2022-05-16T14:10:12Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "He’s a nice professor and knows what he’s teaching, but he is not considerate at all toward his students. He is also very strict when it comes to grading the speeches, points will be taken off if your hands are in ur pockets for a couple minutes, and even if u submit an assignment 5 minutes late he will not accept. ", "rating": 3, "expected_grade": "B-", "created": "2022-05-21T05:06:21Z"}, {"professor": "Elizabeth Phipps", "course": "COMM107", "review": "As someone who was nervous to take this course and speak in front of a class and be graded on it, I was pleasantly surprised by Professor Phipps' approach. She was so kind, forgiving, and thoughtful towards her students and truly wanted them to succeed. She allows you to pick whatever topic you want, as long as it follows the constraints of the speech assignment. She also is a good communicator, and sometimes allows asynchronous class times for you to work on your speeches. This course is the same among all Professors, but you will have to do 4 speeches - Informative, Persuasive, Group, and Final (Special Occassion); 10 quizzes that follow the course of the online textbook; and activities that are drawn from your participation. Professor Phipps is an excellent grader and is very forgiving for mistakes. \r\n\r\nTake her!! You won't regret it!!", "rating": 5, "expected_grade": "A+", "created": "2022-05-24T14:41:14Z"}, {"professor": "Haejung Shin", "course": "COMM107", "review": "Professor Shin's pretty good for COMM107. She knows what she's doing and COMM107 is pretty easy already. Just show up, do your work, and you'll pass with flying colors.", "rating": 4, "expected_grade": "A", "created": "2022-05-25T23:26:12Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "He isn't a bad teacher just not the most considerate. He spends a lot of class time talking about his personal experiences and life advice, it's relevant but not worth talking about almost every day. His grading is pretty harsh and he has an \"I accept no excuse except the one I have no say in\" attitude. He has clear favorites in his classes and you won't really improve unless you meet up with him or other professors outside of class time. The class is passible but I recommend other professors.", "rating": 3, "expected_grade": "C+", "created": "2022-05-31T15:51:54Z"}, {"professor": "L Gordon", "course": "COMM107", "review": "Really bias grader. you kinda have to sell yourself to her (and the class) so she likes you. Goes off on really long tangents and is all over the place but doesn't give too much work, watch out for the writing center visit requirement. sometimes you can get other work done in her class too.", "rating": 3, "expected_grade": "A-", "created": "2022-07-28T13:32:38Z"}, {"professor": "Naette Lee", "course": "COMM107", "review": "She was really nice and engaging and she was also able to provide tips for public speaking from her past relevant experiences. I don’t even like public speaking but I enjoyed this class and felt like I gained useful tips.", "rating": 5, "expected_grade": "A-", "created": "2022-07-31T14:19:12Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Class is easy enough to pass but his attitude is what made the class unbearable. It is very clear he loves to hear himself talk and was very rude to students if they did not say something agreeable to him. He's not considerate at all and won't admit to when he makes mistakes and spends entire class periods talking about himself. There were a couple online quizzes that were straight out of the textbook but other than that the only assignments were the 3 speeches we had to make about whatever we wanted, and one of them was a group speech. If you are okay with a rude professor if you want to get in easy A, then this class is it. But I would recommend looking anywhere else.", "rating": 1, "expected_grade": "", "created": "2022-08-03T19:29:30Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Avoid this SOB at all costs! I don’t get all the views at the bottom saying he is a “nice guy”. Mr. Golden is a very rude, arrogant, and narcissistic individual who will eat you alive. \r\n\r\nHe is a harsh grader, grifter, and adopts all sort of weird policies that make this gen ed unnecessarily harder so you can be “professional”. Also he acts like a department dean of Harvard while he is just a salaried lecturer.", "rating": 1, "expected_grade": "", "created": "2022-08-24T23:24:51.043335Z"}, {"professor": "Delight Agboada", "course": "COMM107", "review": "If you want an easy pass with this gen-ed, this professor is your way to go! She is very friendly and nice, willing to help you to make progress with the course and get scores (yes, with her heart). Rubrics are very clear, follow them and you can get high scores indeed. By putting in effort (you do not really need too much, just a moderate amount), reaching A or A+ is definitely and highly possible. I got A- because I was aiming for 'minimum time to pass'. (that means minimum effort can grant A-, basically). Readings can be skimmed through, you do not need to do much, professor Agboada has put a lot of information and solid good stuff in her videos. In this summer II session, her weekly synchronous check-in is helpful in keeping you on track. Overall great course experience.", "rating": 5, "expected_grade": "A-", "created": "2022-08-29T03:47:40.152318Z"}, {"professor": "Naette Lee", "course": "COMM107", "review": "One of the best instructors I've had so far in college! Very engaging, charming, and has an experience-based teaching style which was very effective.", "rating": 5, "expected_grade": "A+", "created": "2022-09-13T02:18:17.193807Z"}, {"professor": "Delight Agboada", "course": "COMM107", "review": "I took Professor Agboada’s online summer course and it was an absolute treat. She is without a doubt one of the kindest and most helpful instructors I’ve ever had. She gives plenty of constructive criticism, while also grading generously. I highly recommend that anyone taking this course online takes it with Ms. Agboada.", "rating": 5, "expected_grade": "A+", "created": "2022-10-10T16:37:58.549337Z"}, {"professor": "Olivia Truban", "course": "COMM107", "review": "Prof. Truban is a great professor and is well-organized. Presentations are fairly easy and manageable. The homework and quizzes are easy it's something you can manage to do it.", "rating": 5, "expected_grade": "A", "created": "2022-11-07T00:24:33.097496Z"}, {"professor": "Olivia Truban", "course": "COMM107", "review": "She's a great professor. Her quizzes and home work are fairly easy. Expect a lot of presentations but it's because this is a communication class other than that this is an easy class.", "rating": 5, "expected_grade": "A", "created": "2022-11-07T00:26:47.652682Z"}, {"professor": "Crystal Stone", "course": "COMM107", "review": "Crystal is a great teacher and would recommend. She has the perfect balance of ensuring that the class is easy enough for people who just want to get the gen ed, while making it engaging for people that would like to pay attention. As a person, she is very accommodating and nice, and made our class feel like a friend group. The main grades in the class are weekly quizzes and 3 speeches throughout the semester. The quizzes are straight forward and you are given weeks to prepare for speeches that range from 3 - 7 minutes long.", "rating": 5, "expected_grade": "", "created": "2022-11-07T04:41:20.267800Z"}, {"professor": "Olivia Truban", "course": "COMM107", "review": "One of my favorite professors here at UMD. Is super sweet, generous, friendly and approachable. Gives you extensions if needed and is super relatable. 10/10 loved her and the course!", "rating": 5, "expected_grade": "A", "created": "2022-11-12T18:38:45.592434Z"}, {"professor": "Tatenda Mashanda", "course": "COMM107", "review": "Mr. T is a great guy and can teach his subject with a bit of fun humor. I never was the type of guy to do speeches and such, but being in that class with him made me more comfortable. Attendance is mandatory but I’m sure you will enjoy being in that class environment so it shouldn’t be a problem!", "rating": 5, "expected_grade": "A+", "created": "2022-11-14T17:07:31.276981Z"}, {"professor": "Siqiao Ao", "course": "COMM107", "review": "Austin is by far one of the most caring teachers I have ever had. He wants his students to succeed and offers great encouragement. He's funny and makes a typically boring class entertaining through his own experiences and stories. He embodies what a communications professor should be. Rather than a simple delivery of the content, he infuses the content with his own experience as a film-maker and illustrates the applications of the theoretical concepts discussed.", "rating": 5, "expected_grade": "A+", "created": "2022-11-21T22:35:15.751579Z"}, {"professor": "Christopher Swift", "course": "COMM107", "review": "This class made me so angry. It should have been an easy A, but he's such a harsh grader that I find myself fighting for my life. Take anybody, BUT him. He is so extra for no reason and makes us do mini speeches every class. Also, if you miss a quiz, you don't get to make it up.", "rating": 1, "expected_grade": "A+", "created": "2022-11-21T23:50:01.570887Z"}, {"professor": "Janna Soeder", "course": "COMM107", "review": "Easy to get an A-, but try hard on your outlines/speeches for an A+. quizzes are easy and you have the textbook.", "rating": 5, "expected_grade": "A-", "created": "2022-11-28T02:46:55.179954Z"}, {"professor": "Ari Perez Montes", "course": "COMM107", "review": "Ari is super chill and keeps the class easy. COMM107 is fairly simple if you put a decent amount of work in, and Ari doesn't make things harder for the students. Highly recommend for a laid back easy COMM107 GenEd course", "rating": 5, "expected_grade": "A", "created": "2022-11-28T06:38:46.262155Z"}, {"professor": "Ran Ma", "course": "COMM107", "review": "Go to class and u wil be ok", "rating": 5, "expected_grade": "A+", "created": "2022-12-01T00:30:12.999604Z"}, {"professor": "Mollie Kaufer", "course": "COMM107", "review": "Mrs. K is the best!!!! She is very understanding if you need to miss class. She is always giving extensions when needed and grades pretty fairly. I recommend her class for COMM 107 credit.", "rating": 5, "expected_grade": "A+", "created": "2022-12-01T03:23:48.493539Z"}, {"professor": "Sabeen Sheikh", "course": "COMM107", "review": "Professor Sheikh grades so hard for absolutely no reason. She treats Comm like its a 400 level course and grades really hard. Since it's Comm, it's not the hardest class you'll ever take, but her harsh grading is beyond aggravating. I'm an A student struggling in a Comm class. That should say enough.", "rating": 2, "expected_grade": "B+", "created": "2022-12-01T16:45:18.613978Z"}, {"professor": "Jeannette Iannacone", "course": "COMM107", "review": "Great professor! Very understanding of students and tries to make presentations lively and engaging. Would definitely recommend to others", "rating": 5, "expected_grade": "A", "created": "2022-12-01T16:47:40.928654Z"}, {"professor": "Jeannette Iannacone", "course": "COMM107", "review": "Awesome prof!", "rating": 5, "expected_grade": "A", "created": "2022-12-01T16:48:13.954740Z"}, {"professor": "Kimberli Munoz", "course": "COMM107", "review": "She's really nice and the class is pretty easy.", "rating": 5, "expected_grade": "A+", "created": "2022-12-01T17:09:26.089014Z"}, {"professor": "Ayodeji Dapherede-Otusanya", "course": "COMM107", "review": "Relatively easy grader. Her lectures are not too interesting but I blame that more on the textbook/subject. Overall I would recommend.", "rating": 4, "expected_grade": "A", "created": "2022-12-02T17:14:20.957319Z"}, {"professor": "Olivia Truban", "course": "COMM107", "review": "Olivia is a fantastic professor. She is friendly, flexible on extensions, and very funny. Well-organized class. There is an online textbook used for quizzes, but quizzes are online.", "rating": 5, "expected_grade": "A", "created": "2022-12-05T19:45:58.430272Z"}, {"professor": "Rudy Kim", "course": "COMM107", "review": "Rudy is super sweet and her class is very easy. She genuinely wants her students to succeed.", "rating": 5, "expected_grade": "A+", "created": "2022-12-05T21:35:27.558918Z"}, {"professor": "Yumin Yan", "course": "COMM107", "review": "She is sooooo good! She makes class so much more bearable. My other friends would always complain about the workload for this course with other professors but I never complained. She was very organized and made work so well split up, that most of it you can finish in class and would only spend max 1 hr SOMETIMES to finish up work. She is very understanding and truly cares about all her students. She has workshop days that are not mandatory but allows you to get extra feedback on assignments. Her expectations are very clearly stated, and as long as you hit them, you will get good grades. She gives feedback to everyone before the final deadline for an assignment, ensuring you get a good grade. I truly loved her as a professor and recommend her to everyone possible. If you see her name, Take Her!!!", "rating": 5, "expected_grade": "A", "created": "2022-12-05T22:53:29.888157Z"}, {"professor": "Jonathan Leach", "course": "COMM107", "review": "The GOAT. Grades so easy, is a super chill grad student teacher. Impossible to fail unless you do literally nothing. Also went to middle school with kesha so thats tough.", "rating": 5, "expected_grade": "A+", "created": "2022-12-06T14:37:44.341440Z"}, {"professor": "Siqiao Ao", "course": "COMM107", "review": "Honestly, one of the greatest teachers I've had so far. Very understanding of how busy students can be, and always tries to make adjustments so that we are not that affected by the assignments from this course. Grades the presentation and other assignments VERY fair. Austin is the goat.", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T02:58:32.524743Z"}, {"professor": "Jeremy Grossman", "course": "COMM107", "review": "Easy quizzes, fun teacher, chill with deadlines and work. He actually likes teaching and he lets you use your laptop during speeches.", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T17:07:45.899149Z"}, {"professor": "Yumin Yan", "course": "COMM107", "review": "An incredibly nice teacher and a relatively easy class. The material is easy to understand and projects are broken down piece by piece and mostly done in class so it's not a huge workload. Yumin is very understanding when things go wrong, a relatively kind grader but definitely knows what she likes and is strict about criteria being met effectively. Definitely recommend her for Comm 107 you will learn a good amount about how to present well without being stressed.", "rating": 5, "expected_grade": "A+", "created": "2022-12-08T18:13:15.378543Z"}, {"professor": "Jaclyn Bruner", "course": "COMM107", "review": "Dr. Bruner somehow made a class that happened at 8AM and, as a bonus, involved me speaking for long periods of time to a room full of strangers an enjoyable experience. While I don't necessarily recommend that time slot, I would recommend taking her for COMM107 whenever you get around to it.", "rating": 5, "expected_grade": "A", "created": "2022-12-08T19:04:25.214033Z"}, {"professor": "Emma Newton", "course": "COMM107", "review": "Absolutely fantastic person and very understanding. She makes the class as easy as it can be while you are still learning. If you can take her, do it.", "rating": 5, "expected_grade": "A+", "created": "2022-12-08T23:22:31.727570Z"}, {"professor": "Jeremy Grossman", "course": "COMM107", "review": "If you need this class, take Dr. G. He’s a fair grader, very understanding, and overall just a cool guy. Plus, I saw an improvement in my public speaking. I recommend him 100%.", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T02:03:46.541691Z"}, {"professor": "Tatenda Mashanda", "course": "COMM107", "review": "T is truly an amazing professor. He really cares about his students and their success in the class. He makes class fun, so I didn’t mind that class was mandatory. He took time to make sure he knew everyone’s name within the second week of class. I would definitely recommend taking comm with him.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T09:01:43.256820Z"}, {"professor": "Kimberli Munoz", "course": "COMM107", "review": "Super nice and understanding about everything, grades very easily and the assignments aren't hard", "rating": 5, "expected_grade": "A+", "created": "2022-12-10T19:48:05.453841Z"}, {"professor": "Matthew Salzano", "course": "COMM107", "review": "Matthew  makes class so engaging and teaches useful information. He will make sure you are fully prepared for your speeches and will go over the rubric so you know how the grades work. Take his class if you can!!!! You will not be disappointed!!!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-10T22:56:40.457544Z"}, {"professor": "Crystal Stone", "course": "COMM107", "review": "AMAZING PROFESSOR!!! TAKE HER IF YOU CAN!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-12T17:43:28.304578Z"}, {"professor": "Matthew Salzano", "course": "COMM107", "review": "Great teacher and makes class interesting! He provides great feedback and is very organized. Was actually a useful class and he understands if you miss a couple of classes for excused/unexcused reasons. Weekly quizzes with two attempts (so easy), and attendance worksheets (which you can do at home if you miss class.) Overall, I would recommend him and this class.", "rating": 5, "expected_grade": "A", "created": "2022-12-12T20:17:48.119943Z"}, {"professor": "Rudy Kim", "course": "COMM107", "review": "Rudy was an incredible professor. As a first-semester freshman, I feel like Rudy's class was a breath of fresh air. She always was happy and energetic and seemed like she wanted to be there. I think Rudy cares a lot about her students, and genuinely wanted us to all do well in her class.", "rating": 5, "expected_grade": "A", "created": "2022-12-13T03:10:16.418274Z"}, {"professor": "Daviana Fraser", "course": "COMM107", "review": "Great comm prof", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T21:26:23.465396Z"}, {"professor": "Crystal Stone", "course": "COMM107", "review": "W teacher. Super nice, friendly, and very knowledgeable/passionate about comm. Class was fun and purposeful. Easy if you go to class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T21:31:38.348215Z"}, {"professor": "Ari Perez Montes", "course": "COMM107", "review": "If you need to take comm, take it with Ari. The classes are super chill and there is not that much work required. There are four speeches total. The most annoying part about the class is the group presentation just because group work in general sucks. But again if you need to take it, I highly recommend Ari.", "rating": 5, "expected_grade": "A", "created": "2022-12-14T00:43:49.633477Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Golden expects your speeches to be at least as good as Martin Luther King's \"I have a Dream\" speech. You have to memorize your entire speech or else you lose points for \"not maintaining eye contact.\"\r\nHe is completely unreasonable and has double standards. He wastes half the class giving a lecture about some irrelevant life lesson. He loves to talk about himself. Avoid him at all costs.", "rating": 1, "expected_grade": "B", "created": "2022-12-14T06:37:55.798221Z"}, {"professor": "Yumin Yan", "course": "COMM107", "review": "I LOVE here. She is the best professor I have ever had. I am probably the worst public speaker but this class was very easy to get an A in as long as you simply complete your speech. She is so kind and genuinely cares about all her students. All my friends complained about this course with other professors, but with her I have no complaints and hardly no work outside of class. She held many workshops classes that were optional to come to on days we had class so often time class was \"cancelled\".", "rating": 5, "expected_grade": "A+", "created": "2022-12-14T20:09:13.519885Z"}, {"professor": "Julie Gowin", "course": "COMM107", "review": "Not sure what changed between the older reviews and now, but Prof. Gowin has been a great instructor and I would highly recommend her!", "rating": 5, "expected_grade": "A", "created": "2022-12-15T05:02:16.839812Z"}, {"professor": "Jonathan Leach", "course": "COMM107", "review": "Very kind guy and this class is very easy. By far my favorite Johnathan", "rating": 5, "expected_grade": "A+", "created": "2022-12-16T00:55:47.643240Z"}, {"professor": "Olivia Truban", "course": "COMM107", "review": "Easy course. Chill and easy going professor. Will give you time extension if you ask her. Makes Friday lectures online and keeps the workload light.", "rating": 5, "expected_grade": "A", "created": "2022-12-16T18:34:13.027639Z"}, {"professor": "Viktoriia Savchuk", "course": "COMM107", "review": "Love her! She was very kind, considerate, and understanding. If you show that you're putting in effort for her class she will definitely give you a good grade. There were some impromptu presentations but they were very short and not that stressful.", "rating": 5, "expected_grade": "A", "created": "2022-12-17T03:16:01.718970Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "I loved this class with professor pope. My comm class felt like a group of friends by the end of it and professor pope was a huge reason why. She encourages you to get to know everyone and her class assignments are super fun.", "rating": 4, "expected_grade": "A", "created": "2022-12-17T04:40:38.965110Z"}, {"professor": "Xingman Wu", "course": "COMM107", "review": "Professor Wu is genuinely an outstanding professor. She cares about her students and makes this class engaging. Her class is not hard and she makes this gen-ed incredibly easy and educational. I appreciate her kindness towards her students and she isn't too strict with grading, so she makes this class incredibly low-stress. \r\n\r\nJust as long as you show up and essentially practice the speeches in this class (they aren't as bad!), you will get an A+. I'm usually not the type of person to like public speaking, but this class has gotten me out of my shell regarding talking in front of people. I made friends with people in the class so it wouldn't be as awkward presenting, but overall, this class has prepared me to take risks and come out of my comfort zone around strangers. \r\n\r\nI adore Professor Wu a lot, she really is the best comm professor. I wish I had the time to go to her office hours but she is super sweet and has made me excited to go to this class because of her. She understands that sometimes students are shy or aren't the public-speaking type of person, but she believes in everyone in the class and makes it a comfortable environment for you to get used to public speaking. \r\n\r\nTake Professor Wu if you can!! :)", "rating": 5, "expected_grade": "A+", "created": "2022-12-17T18:46:31.250528Z"}, {"professor": "Neha Kamran", "course": "COMM107", "review": "I really liked having this professor for COMM107. I was worried about taking this class because I have social anxiety and I'm not great at public speaking, but the class went pretty well for me. I received good grades for all of the speeches, and what I liked about regular class is that she never kept us longer than needed. Once she was done going through her slides for the day, she would let us go. If you have the chance to take her for COMM107, take her.", "rating": 5, "expected_grade": "A", "created": "2022-12-17T19:24:02.353827Z"}, {"professor": "Jeremy Grossman", "course": "COMM107", "review": "Fair teacher, good assignments with great feedback", "rating": 5, "expected_grade": "A", "created": "2022-12-18T13:27:27.808374Z"}, {"professor": "Neha Kamran", "course": "COMM107", "review": "Weekly quizzes, 3 speeches, and discussions. The lectures usually don't take the full time unless it's a speech day. Lenient grader and wants you to do well in this class. The only con is that she takes a little while to respond to emails. I would 100% take her if you see her for COMM107.", "rating": 5, "expected_grade": "A+", "created": "2022-12-18T20:01:26.930657Z"}, {"professor": "Aya Farhat", "course": "COMM107", "review": "One of my favorite instructors I've had, she was very down to earth and felt like a real person. Always defined expectations clearly, and graded speeches and quizzes extremely fairly. Overall enjoyed this class, and learned a lot from it.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T03:28:15.937107Z"}, {"professor": "Jeannette Iannacone", "course": "COMM107", "review": "Very open-minded, flexible, enthusiastic, and wants you to succeed! Amazing professor.", "rating": 5, "expected_grade": "A", "created": "2022-12-19T19:44:35.092685Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Bruh pls dont take. He makes it hard for no reason. Take literally ANYONE ANYONE ANYONE else. This is comm, not the grammys plsss", "rating": 1, "expected_grade": "A", "created": "2022-12-20T16:03:25.532903Z"}, {"professor": "Neha Kamran", "course": "COMM107", "review": "Easy class. She makes this class easy and the load of homework is very light.", "rating": 4, "expected_grade": "", "created": "2022-12-20T18:45:44.034088Z"}, {"professor": "Faith Otchere", "course": "COMM107", "review": "She made the class very easy, and if you missed points for any assignment, you could always email her for a make-up. My only issue with her was that she sometimes had some controversial things to say, and you can tell that she's a very traditional woman. I would take her for comm regardless, though. It was a very easy A", "rating": 4, "expected_grade": "A+", "created": "2022-12-22T05:51:44.407913Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "I'm literally on my hands and knees begging do not take this professor. He does not care about his students (like he claims to) and is a very harsh grader. He has no sympathy for his students and we literally get one singular note card and only one side of it. His class is boring and didn't learn a single thing. Do me a favor and stay far far away pls and thank you.", "rating": 1, "expected_grade": "A", "created": "2022-12-23T02:24:20.668251Z"}, {"professor": "Matthew Salzano", "course": "COMM107", "review": "legit the best. matthew clearly cares about his students and wants to see them succeed. gives great feedback and helps you become a stronger speaker with each assignment. take his class if you can!! he's a g fr 100000000/10 would recommend", "rating": 5, "expected_grade": "A", "created": "2022-12-23T04:18:26.749538Z"}, {"professor": "Janna Soeder", "course": "COMM107", "review": "Dr. Soeder doesn’t make this class harder than it needs to be. The grading was really fair and it was pretty easy to get an A. Classes are a bit dry but that is expected from a public speaking class. We were let out 15-20 minutes early every class which was nice. I would definitely recommend taking Dr. Soeder for COMM 107 if you have the chance.", "rating": 5, "expected_grade": "A", "created": "2022-12-23T21:56:16.895221Z"}, {"professor": "Jeremy Grossman", "course": "COMM107", "review": "Great professor! Totally recommended.\r\n\r\nVery friendly guy and approachable. He’s always super lenient and understanding with accommodations. Made the lectures more like fun conversations rather than lectures. Also an extremely fair grader!", "rating": 5, "expected_grade": "A", "created": "2022-12-26T05:37:57.206948Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "He is THE BEST comm107 professor. Firstly the structure of the class is really nice. He gets the required quizzes out of the way early in the semester and everything is very straightforward (both in what you are supposed to do and when it is due). He is a super interesting person to listen to and really kind. He is a super fast grader and as long as you put in the effort (to create notecards and do your best on the assignments leading up to the speech which prepare you for it) you will get a good grade. He is also just really interesting to listen to and uses pretty fun examples in class. Will often let class out early so you just have to make sure you get the assignments in on time. Clearly has student's interests at heart and is willing to work with you. 100% recommend.", "rating": 5, "expected_grade": "A+", "created": "2022-12-26T19:01:45.824920Z"}, {"professor": "Jeremy Grossman", "course": "COMM107", "review": "I love Professor Grossman. He was one of the best professors that I have had at maryland. He made public speaking fun and gave great feedback. I am really not a great public speaker but Professor Grossman really cares about his students and wants them to do well. He was so supportive and extremely generous and helpful. I love this man. Take this class when you need to fulfill your public speaking requirement. Grossman is HIM!", "rating": 5, "expected_grade": "A", "created": "2023-01-05T20:46:02.256707Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "The reviews for the year 2022 for Golden was quite bad as you can see at the bottom. Not going to make excuses for the man. He can actually be a bit sassy at times and does love to hear himself talk unfortunately. If you are the shy type, you might not even like his class because he could randomly pick on you and put you on the spot, asking questions like \"where you got your shirts from or what it means\". But all in all, he actually cares about his students and his job and holds you to a higher standard. He is also really nice and willing to help if you are struggling. If you want an easy A, do not even take this class for real, but if you want to step outside your comfort zone for public speaking, then take his class", "rating": 4, "expected_grade": "A+", "created": "2023-01-06T12:01:09.806398Z"}, {"professor": "Elizabeth Phipps", "course": "COMM107", "review": "I loved taking this course with Professor Phipps. She is amazing and really wants her students to succeed. She allows you to pick your own topics, have notecards with you while presenting, very fair grader, gives great feedback and advice, and has asynchronous class times leading up to presentations which you can meet over zoom to work on your speech if wanted. She understands that group speeches suck with others not doing their share but honestly tries to make it fair. I have no regrets taking this course with her and would do it again if I had to.", "rating": 5, "expected_grade": "A+", "created": "2023-01-07T05:25:10.964068Z"}, {"professor": "Daviana Fraser", "course": "COMM107", "review": "never answered a single one of my emails. She's nice but that's super annoying because it ended up costing part of my grade.", "rating": 2, "expected_grade": "", "created": "2023-01-09T21:47:15.113730Z"}, {"professor": "Jiawen Zhang", "course": "COMM107", "review": "Took her during the winter semester and she was great.\r\nThe workload wasn't bad at all. Definitely reccomend.", "rating": 5, "expected_grade": "A+", "created": "2023-01-19T23:20:13.421297Z"}, {"professor": "Miriam Komuhendo", "course": "COMM107", "review": "She was very nice and accommodating if you gave her a heads up about an issue. She was pretty straightforward when it came to grading. As long as you do the homework (easy 10 question quizzes) and do well enough on your speeches, it is an easy A.", "rating": 5, "expected_grade": "A+", "created": "2023-01-20T00:02:34.173288Z"}, {"professor": "Faith Otchere", "course": "COMM107", "review": "She was very passionate about this course and made it very clear what she expected of us! I took COMM107 in the Winter and thought it was a breeze. Showing up to all classes is necessary but she does not give a lot of work. This was a very reasonable class and I would take it again in a heartbeat!", "rating": 5, "expected_grade": "A+", "created": "2023-01-20T21:34:46.222041Z"}, {"professor": "Tatenda Mashanda", "course": "COMM107", "review": "T is a really nice guy and wants everyone in his class to pass. Just making sure you even do the work in his class will guarantee an A. He's very lenient and understanding of people's situations and accommodates accordingly.", "rating": 5, "expected_grade": "A+", "created": "2023-01-22T18:22:39.924825Z"}, {"professor": "Xingman Wu", "course": "COMM107", "review": "Professor Wu is one of the sweetest professors ever. She cares so much about teaching and really wants to make her class engaging. She was always so encouraging and really tried to make changes to the class that we thought would be effective. Her class is not hard, in fact, she intentionally tries to make it really easy. We have reading quizzes for like 10 weeks, which are easy and you have unlimited attempts. Besides that, there are 3 major presentations that she was so thorough about explaining and made sure we really understood what we were doing. The final is also so easy and low stress it took me maybe 20 minutes. She gave really good feedback and was always super kind. I hate public speaking but I swear she makes it so low-stress. She is so understanding of the fears people have and share with us her own experiences to try to make them lighter. Anytime we felt like we might be embarrassed she would share a story about herself to make us feel more comfortable. If you have the opportunity to take her class I would totally recommend it.", "rating": 5, "expected_grade": "A+", "created": "2023-01-23T19:17:38.654321Z"}, {"professor": "Kimberli Munoz", "course": "COMM107", "review": "Very nice and cares about you as a person. Class is easy, just do the assignments and show up. She is a bit of a stickler about formatting and citations and stuff for presentations, but overall a great professor who tries to keep things interesting and fair.", "rating": 5, "expected_grade": "A", "created": "2023-01-25T02:32:11.525879Z"}, {"professor": "Jin Choi", "course": "COMM107", "review": "Professor Choi is very sweet and does her best to help make this class comfortable despite the natural fears that come with speaking in front of people. Gives good feedback on speech outlines and grades leniently. Highly recommend!", "rating": 5, "expected_grade": "A+", "created": "2023-01-26T03:23:30.363409Z"}, {"professor": "Matthew Salzano", "course": "COMM107", "review": "100% my favorite professor I have ever had here. He is so so nice and immediately puts you in a great mood. Amazing at teaching and ALWAYS open to help!! UMD needs more people like him.", "rating": 5, "expected_grade": "A", "created": "2023-01-26T04:07:24.822013Z"}, {"professor": "Yumin Yan", "course": "COMM107", "review": "Yumin is very friendly and sweet, her class feels pretty cozy and she makes it easy. She genuinely cares about your wellbeing and will offer tons of help so you can't go wrong. Her feedback for each speech is spot-on and will help you better prepare for the next. The criteria and expectations for each speech and assignment could not be more clear. I don't think there is a better instructor for COMM107", "rating": 5, "expected_grade": "A+", "created": "2023-01-27T03:45:46.556041Z"}, {"professor": "Savreen Hundal", "course": "COMM107", "review": "She's a really nice and caring professor, if you have any problems she always tries her best to help. Had her for comm107 and it was a great time for me. comm107 in itself really sucked for me because it was related to public speaking but she did try to make it a bit more fun. She has a... bubbly personality and it tends to lead towards awkward situations in class usually. Also, she is a bit of a tough grader, you have to have a really good speech for her to give you good marks, otherwise you will get stuck with a B- or C+ grade.", "rating": 5, "expected_grade": "B+", "created": "2023-01-30T04:30:09.951979Z"}, {"professor": "Tatenda Mashanda", "course": "COMM107", "review": "Dr. Mashanda is an excellent option for COMM107. Although his course structure can be confusing and he had to miss 1-2 classes during the Winter semester, he is willing to forgive penalties on late work and provides stellar grades to any assignment submitted with effort. With the proper effort, you can always expect an “A” in COMM107 with Dr. Mashanda.", "rating": 4, "expected_grade": "A", "created": "2023-02-02T17:43:29.370856Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "This guy sucks. He's so full of himself and takes this joke of a gen ed way too serious", "rating": 1, "expected_grade": "", "created": "2023-02-08T21:28:40.131726Z"}, {"professor": "Ran Ma", "course": "COMM107", "review": "very lenient, kind, understanding. wants to see u winning. i miss her already", "rating": 5, "expected_grade": "A+", "created": "2023-02-16T04:16:30.672895Z"}, {"professor": "Yumin Yan", "course": "COMM107", "review": "She is so nice and genuinely wants to help. Dont be off put by her meticulousness. She really is looking for confidence.", "rating": 5, "expected_grade": "A+", "created": "2023-02-18T05:55:12.245747Z"}, {"professor": "Siqiao Ao", "course": "COMM107", "review": "Austin is a good teacher. He is a PhD student, so he would sometimes joke around with us if someone calls him \"Professor.\" He is pretty funny and is very understanding if people don't show up to class. He is also a very fair grader, and he keeps the class engaged with some of his work and experience as a film maker. Please take COMM107 with him. He's great!", "rating": 5, "expected_grade": "A", "created": "2023-03-08T02:37:39.506156Z"}, {"professor": "Crystal Stone", "course": "COMM107", "review": "SHE IS AMAZING\r\nseriously she is so down to Earth and still helps everyone learn the course material. I would honestly take every single one of my classes from her if I could and I could not recommend her enough. She really does care and wants everyone to have a good time in class, which is so appreciated when a lot of other classes and professors could not care less. All of the assignments are well outlined and well communicated and getting good grades on them is simply following the rubric and trying. Her advice and comments on presentations were not out of the box and genuinely helped everyone. Love.", "rating": 5, "expected_grade": "A+", "created": "2023-03-09T16:56:34.766049Z"}, {"professor": "Olivia Truban", "course": "COMM107", "review": "Olivia is a really great professor! She makes class engaging and knows what she is talking about. I personally hate public speaking, but Olivia made it manageable and was very supportive of all of us and genuinely wanted us to do our best.", "rating": 5, "expected_grade": "A+", "created": "2023-03-12T15:36:59.316081Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "please do not take this teacher, very harsh, very strict, expects you to make a speech like MLK. Very sassy, please do not take this teacher", "rating": 1, "expected_grade": "B-", "created": "2023-04-12T18:12:38.401632Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Most of his class is taken up by his personal stories and teachings. Most of the quizzes are pretty easy and are based off the textbook which is expected to be read outside of class. Other than that he's a horrible professor, he expects every talk to be some TEDx talk and grades very harshly, he has a huge ego and is never wrong, if you ever have problems with an assignment he will not help you fix it. He loves to hear himself talk, and is extremely sassy. Literally the first assignment was writing about his autobiography, if that's not a red flag for a professor than idk. just dont't take this professor.", "rating": 1, "expected_grade": "B+", "created": "2023-04-18T23:57:55.887950Z"}, {"professor": "Sabeen Sheikh", "course": "COMM107", "review": "Grades super harsh, has no reason to be this tough for a 100 level class", "rating": 1, "expected_grade": "A+", "created": "2023-04-24T17:01:33.808954Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "The dude is aight. He has decently engaging lectures but grades unreasonably harshly for a gen-ed like COMM107. He will give you massive point deductions for stupid details on the assignments and seems to take points off the speeches for the sake of doing so. Don't expect to earn above an A- on your presentation even if you thoroughly research and practice your speech. Overall, I guess he's not terrible if you can't find anyone else. But you're better off with a professor who actually grades based on effort and cares about your improvement. This guy grades like he has some sort of dignity to uphold.", "rating": 3, "expected_grade": "", "created": "2023-04-25T23:44:40.661421Z"}, {"professor": "Christopher Swift", "course": "COMM107", "review": "Nice guy but don't recommend. He's such a harsh grader. This class should be such an easy A but its not with him. He wont let you make up quizzes if you miss one. He takes points off for the most random things too. He also assigns a lot of work for what the class is. I don't usually write reviews but I don't want anyone whos taking comms to make the same mistake I did.", "rating": 2, "expected_grade": "B", "created": "2023-04-26T18:07:50.660957Z"}, {"professor": "Daviana Fraser", "course": "COMM107", "review": "She is a great comm professor, super energetic and chill. Her exercises are helpful, and she does give time to work on assignments in class. It's super chill, mostly group projects and really easy online quizzes that you get to use your textbook on.", "rating": 5, "expected_grade": "A+", "created": "2023-04-27T01:58:18.022827Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "If you want an easy grade don’t take this professor", "rating": 1, "expected_grade": "B+", "created": "2023-04-27T21:00:00.856730Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "Seems like a nice guy outside the classroom. I can tell he is passionate about the subject and cares about students improvement, and is willing to meet outside of class to work on assignments. But this guy is so entitled. Thinks COMM is the most important subject. Literally said first day of class \"this is the most important class you will take at this school\" or something along those lines. So he thinks his class is the most important out of all your classes, and it seems like he expects you to put in that level of work but this class is just a gened. I understand communication is an important subject, but when you downplay the other classes students take it really irks me the wrong way. I can also tell he plays favorites, and I am clearly not one of his favorites. Takes points off for random small details. Also said whoever didn't read the chapter are \"failing to be adults.\" If you are looking for a chill class to take, do not take this class with this guy.", "rating": 3, "expected_grade": "A-", "created": "2023-04-28T15:07:28.285596Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "He takes this class WAY to seriously. He always says that his class if more important than my major classes. Keep in mind I am an Aerospace Engineering student. He grades super harshly for a communications course. I haven't received a 100/100 on any assignment he was able to grade himself. TAKE ANYONE ELSE especially if you are Engineering or another hard major and you want an easy way out.", "rating": 1, "expected_grade": "A+", "created": "2023-05-02T00:18:34.511344Z"}, {"professor": "Alex Thomas", "course": "COMM107", "review": "Very awkward lecturer and toughest COMM107 grader I have ever heard of. Handed out mainly C's on a three minute informative speech while all other professors generally hand out A's. They also bring personal stances on the topics of the speeches into play by telling students that disagree with them to change their topic or it will be reflected in their grade. Stay away!!!", "rating": 1, "expected_grade": "A", "created": "2023-05-02T02:08:12.078245Z"}, {"professor": "Elizabeth Phipps", "course": "COMM107", "review": "Super easy class, it really helps with getting better at presenting. We can choose our own topics, work with her to help make our speech, and there are a lot of asynchronous classes which make the class super light.", "rating": 5, "expected_grade": "A+", "created": "2023-05-02T15:36:16.873242Z"}, {"professor": "Alex Thomas", "course": "COMM107", "review": "This professor grades based on whether or not he agrees with your topic or not. If you propose a topic that he does not agree with, you will be forced to change it or suffer bad grades moving forward.", "rating": 1, "expected_grade": "B+", "created": "2023-05-02T18:13:20.474661Z"}, {"professor": "Alex Thomas", "course": "COMM107", "review": "Alex is horrible. Bad lecturer, worse person. If Alex is the only option left take the class another time.", "rating": 1, "expected_grade": "A+", "created": "2023-05-03T04:36:58.719857Z"}, {"professor": "Viktoriia Savchuk", "course": "COMM107", "review": "She's very understanding and gives you enough chances to do well in the class and ear points. She gives you very good comments on your presentation outlines and presentations. You'll be able to earn an A in the class stress free as long as you show up and put some effort in.", "rating": 5, "expected_grade": "A-", "created": "2023-05-04T10:53:52.408844Z"}, {"professor": "Divine Aboagye", "course": "COMM107", "review": "Divine is an AWESOME guy. He is super funny and really wants to get to know his students. He is open to talking about anything and just learn about what people are passionate about. As a professor he is good too, but I would say that he lacks a bit of experience. It was annoying when he would assign us reading quizzes with only a 16-18 hour window to complete it, or even for speech outlines we wouldn't be able to see the guidelines for as assignment until a few days before it was due. This was inconvenient and frustrating at times. Aside from that, he strongly follows rubrics for grading but gives great feedback and expects students to build upon his feedback as the semester moves forward (he wants us to improve!!). COMM107 in my opinion isn't an overly difficult course, but I believe there are other professors who make this class a little bit less difficult/inconvenient at times. I had a great time with Divine because we connected well personally. I think down the line with some more experience and learning how to teach, he can be an outstanding professor because again he is truly a good guy.", "rating": 4, "expected_grade": "A", "created": "2023-05-04T16:00:20.460003Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "Ditto to the comment below. One of the first things he warns you about the first class is that he takes his class seriously, and you should drop if you aren't ready to do \"well\" in COMM. I thought he was bluffing, but he was obviously not and is super spiteful. He genuinely thinks that COMM107, a GENED class, is the most important class ever. I consider myself a hard-working student, and I have never had a problem with public speaking and am constantly getting mediocre scores on my speeches. My roommate, who says he looks at his slides and never practices his presentations with another professor, is getting high 90s on each presentation, and in my first one, I got an 85%. \r\n\r\nDan PICKS favorites, and sometimes it's really awkward and weird, and you can tell who he enjoys talking to and who he doesn't. Also, he highkey cursed out our class one day because someone wasn't paying attention, and he told us it's insane we weren't paying attention because \"nothing is more important than COMM\". He genuinely thinks you need to put in 10+ hours a week into COMM and COMM > your other classes. \r\n\r\nHe has exceptionally high standards; he's probably just annoyed he got stuck teaching a 100-level course. You should take an 8 AM with a professor with no reviews over him. TRUST me.", "rating": 1, "expected_grade": "A-", "created": "2023-05-04T18:00:02.188831Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "Hes the best comm professor. His class schedule is organized very well and the way he speaks is very entertaining. He looks like he actually likes teaching the class which is nice.", "rating": 5, "expected_grade": "", "created": "2023-05-04T18:55:49.053926Z"}, {"professor": "Stephan Garnier", "course": "COMM107", "review": "So Mr. Garnier is a nice guy who makes a really easy class. The class is mostly just him lecturing and was very quiet for a public speaking class, so I found it boring. He doesn't make the class do discussions or really participate. You are graded for attendance though, so I'd recommend showing up for easy points instead of doing the make-up activities later. He's a generous grader, gave me A's on all the speeches, even when I didn't feel good about it. \r\n\r\nI gave 3 stars because it was at 8 AM, he didn't give time to do any work in class like speech planning - just lecturing all the time and it got really repetitive - and I would have liked to have more speeches and practicing instead of all the theory and just 3 speeches, 1 of which was a group project. If you want an easy A without much work and you're fine with giving speeches then take him. If you actually want more practice getting comfortable speaking and an engaging class, I would look elsewhere.", "rating": 3, "expected_grade": "A", "created": "2023-05-05T18:51:43.138008Z"}, {"professor": "Melissa Lucas", "course": "COMM107", "review": "Dr. Lucas is super sweet, and a very understanding professor. She often let us out 30 minutes early in class. There are only three main presentations throughout the class, and a weekly quiz that can be completed in a few minutes. The workload in the class is honestly minimal, which is good for a gen-ed. As long as you prepare your speeches and follow the rubric she posts for her presentation requirements, you will get an A. The class is great for anyone to take, as it helped me greatly with public speaking. Awesome professor, would definitely take again!", "rating": 5, "expected_grade": "A", "created": "2023-05-07T14:25:30.544152Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "He is a nice person and fun to talk to, but he is not treating this class as a beginning communications class. Everything was graded very harshly and you will need to put in a good deal of work to meet his requirements for a good grade. If you are in a hard major and do not have time to prioritize a gen-ed I would recommended taking any other teacher. Literally anyone else but him. He likes to talk about himself most of the class and randomly tells us personal details about himself that I rather not hear about. Then tells us we are like his group therapy when he rants about random topics every morning.", "rating": 1, "expected_grade": "B", "created": "2023-05-07T21:51:31.318746Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "He thinks this class is the most important class you will ever take, and acts on it. He is full of himself and narcissistic and has genuinely talked crap about other professors and has hinted that he personally thinks he's the most intellectual professor (when the man teaches a gen-ed 100-level course). He has favorites. He makes COMM107, a supposedly easy gened for others, feels like a 300-level class for your major.", "rating": 1, "expected_grade": "A-", "created": "2023-05-07T22:51:10.536265Z"}, {"professor": "Justine Madoo", "course": "COMM107", "review": "I would take this class a million more times. Professor Madoo makes it extremely interesting. She incorporates stories from her personal experiences and does not shy away from humor when discussing. Exams are an hour long and open note. If you take notes in class and read the textbook (she points out specific pages) you will get an A+. There is a policy of no electronics, but don't take that as an opportunity to not take this class. Her engaging manor makes up for it. Also, there is only the exams and 1 short paper.", "rating": 5, "expected_grade": "A", "created": "2023-05-08T04:27:57.779860Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "BEST PROFESSOR EVER I CANNOT STRESS THIS ENOUGH. He is so interesting, and engaging. He is so funny, which makes you want to come to class. He uses great examples and is an overall great teacher. He always lets us out early, because if we have work that can be done independently, he does not see the need to keep you. The class was an hour and fifteen but I was often never in there for more than 35-40 minutes. He is such a fast grader, grades automatically, and for speeches, your grade is there within the minute after your speech. He lays out all expectations and if you submit your work on time, and genuinely work hard on the assignments leading up to speeches, you will get a great grade. If you submit assignments really early, he will grade it, and if it is not 100, you can resubmit it before it is due, and get points. Highly recommend taking this course.", "rating": 5, "expected_grade": "A+", "created": "2023-05-09T18:11:56.872787Z"}, {"professor": "Rudy Kim", "course": "COMM107", "review": "Had Rudy for Comm107 for Fall 2022 and she was the GOAT. Always down to help her students and always was super enthusiastic every time you walked into her classroom. She was also very welcoming and made us feel comfortable.", "rating": 5, "expected_grade": "A+", "created": "2023-05-09T19:08:11.683967Z"}, {"professor": "Jeremy Grossman", "course": "COMM107", "review": "Awful teacher. Stuck up and irritating. Boring lectures. Grades hard for no reason. Miss one class and lose 10% on your monthly attendance grade. Unless you are willing to spend as much time on COMM 107 as any other major related class, your likelihood of getting an A is microscopic with this moron.", "rating": 2, "expected_grade": "B", "created": "2023-05-10T19:10:35.232582Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "I don't know why so many people rated him so low. They are just dramatic. This man is easily the best teacher I have ever had in my life. You can tell he cares about his students a lot. He remembers personal stories and things like that so you know he cares. He is an easy grader if you do the work. He doesn't take off points for stuttering, and stuff like that. I expected a B- and I got a 97%.", "rating": 5, "expected_grade": "B-", "created": "2023-05-11T16:14:10.157318Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "Hands down the best professor I have had at UMD so far. He genuinely cares about all of his students, and goes out his way to make sure we understand concepts in the class. Your public speaking will definitely get better! Highly recommend taking Dr. Foster's class!", "rating": 5, "expected_grade": "A-", "created": "2023-05-11T17:24:46.142388Z"}, {"professor": "Jade Olson", "course": "COMM107", "review": "Dr. Jade is a fun, clear, energetic, and approachable to professor. No exams, four presentations, all graded really leniently and she leaves great feedback.", "rating": 5, "expected_grade": "A+", "created": "2023-05-11T19:49:40.568668Z"}, {"professor": "Rudy Kim", "course": "COMM107", "review": "Ms. Kim is great! So kind, understanding, and encouraging when trying to improve everyone’s public speaking skills and speech preparation skills. I’d definitely recommend taking COMM 107 with her.", "rating": 5, "expected_grade": "A", "created": "2023-05-13T17:33:12.437414Z"}, {"professor": "Olivia Truban", "course": "COMM107", "review": "Olivia is the best! She is super funny, chill, and relatable. COMM107 can seem like an intimidating course, but she made it super managable. There are 3 in-person speeches: informative, persuasive, and a group presentation. The final is virtual and SUPER low-stakes. Class literally never went the full 1 hr 15 min and there were a lot of classes that ended being held through zoom. I highly recommend Olivia if you are able to take her.", "rating": 5, "expected_grade": "A+", "created": "2023-05-14T00:08:14.645911Z"}, {"professor": "Aya Farhat", "course": "COMM107", "review": "Super kind, but weird grading. Her grading was for the most fair, but sometimes she would take points off for weird things or she would take a lot of points off on one really small thing. She was really great while grading actual speeches, but the outlines were graded really harshly. Overall, her class was as good as COMM107 was going to be.", "rating": 4, "expected_grade": "A+", "created": "2023-05-14T18:30:23.463032Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Its incredible how many of the other reviews are so salty about actually being pushed to grow and develop in a subject instead of being just an easy A while learning nothing. The fact is that a lot of people just cant do public speaking, myself included, and will go up in front of a room full of people and start mumbling or deliver a presentation dryer than a popeyes biscuit. Professor Golden actually pushes you to improve, and really holds you to a high standard, but he really knows his stuff and is probably the best teacher you can get if you want to actually get better. He's a public speaking coach for high society big shot type professionals and has tons of connections around campus, and more generally has a lot of life advice too beyond just public speaking. He really wants to see all his students succeed, and also will build personal bonds with students. Best advice for Golden is to show up to class early, apply yourself and really intend to improve, and you will see dramatic changes in your speaking ability. The only bad things about the class were the excessive grade hits for going over or under time (3 points for every 10 seconds), and the quizzes were just true or false questions on verbatim sentences from the textbook that made it necessary to have the textbook (but not to read it). Please just find the textbook on libgen, its the wrong edition but it has all the same content and still works fine for the quizzes. Overall, stop being so stuck up about your GPA and just take his class to actually get good at presenting and talking to people, it WILL help you get connections and network far more than a 0.1 point higher GPA would.", "rating": 5, "expected_grade": "A", "created": "2023-05-14T22:07:11.780187Z"}, {"professor": "Xingman Wu", "course": "COMM107", "review": "Professor Wu is an extremely outstanding and caring professor. Coming from a cs major, her workload is incredibly manageable. Her grading is very lax, since I remember completely going over the time limit once yet still getting a 98+\r\n\r\nIf you want a guaranteed easy communications class I would recommend taking hers.", "rating": 5, "expected_grade": "A+", "created": "2023-05-17T23:48:54.201977Z"}, {"professor": "Alisa Hardy", "course": "COMM107", "review": "Such a good teacher! I really learned a lot in this class without having too put in an unreasonable amount of work. She was an easy grader and her assignments never took long. Highly recommend!", "rating": 5, "expected_grade": "A+", "created": "2023-05-18T18:42:34.364511Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "Dr. McCloskey is fantastic! He is engaging, and understands that most of his class does not want to worry about an oral communication credit. So, his quizzes are early in the semester, graded work is returned very quickly, and he gives great feedback on the speeches.\r\n\r\nWhat I like most about Thomas is how he works his personal experience into teaching the class. He talks about when he coached debate teams, volunteered in Ukraine as part of the Peace Corps, and his research on the FSU and Ukrainian Nationalism. He is also a really engaging lecturer. My class was 75 minutes long, but he would let us out at least 30 minutes early to work on assignments.\r\n\r\nThe class consisted of an informative speech, a persuasive speech, a group speech, and a recorded special occasion speech. He provided resources and guidance which made actually giving the speeches easy.\r\n\r\nIf you have any nerves about public speaking, Thomas is the teacher you want. He is great!", "rating": 5, "expected_grade": "A+", "created": "2023-05-18T22:58:53.260232Z"}, {"professor": "Crystal Stone", "course": "COMM107", "review": "The best professor. So nice, friendly, and understanding. She is always there to help with work or just to talk. She is an easy grader and the assignments were all light work. She taught the lessons well and made them interesting. She truly wants everyone to succeed. If you can take the class with her I 100$ recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-05-21T03:47:36.736057Z"}, {"professor": "Aya Farhat", "course": "COMM107", "review": "Awesome, nice, welcoming, and a fair grader.", "rating": 5, "expected_grade": "A", "created": "2023-05-21T20:23:06.134388Z"}, {"professor": "Sabeen Sheikh", "course": "COMM107", "review": "I have no idea why the other two reviews are so low. I am literally a stutterer and everyone in my class literally got decent grades on their presentations. She is so understanding and literally says that she has no intention of being a jerk and on the first day she literally told us that this should not be a class that we are stressed out about. The presentations are literally so easy and she lets us do it on anything and I mean anything. Like I got to do a presentation on marvel comics and this one guy did it on why the earth is flat. Super chill and funny. Please take her if you want to actually learn and get an easy A", "rating": 5, "expected_grade": "A", "created": "2023-05-24T21:10:41.502499Z"}, {"professor": "Kimberli Munoz", "course": "COMM107", "review": "The BEST PROFESSOR she's super friendly, an easy grader, and makes the class very engaging take her if you can!!!", "rating": 5, "expected_grade": "A+", "created": "2023-05-25T21:20:38.997964Z"}, {"professor": "Alexandra Grimm", "course": "COMM107", "review": "The kindest and most caring instructor I had at UMD, and maybe I ever will have. She is sociable, and clearly wants all of her students to succeed and make them become comfortable with their public speaking skills.\r\n\r\nJust a little side note: Alexandra is still new to teaching COMM107, so she may be less experienced than other COMM107 instructors. However, she is incredibly open to feedback from her students and is always willing to improve their class experience. She’ll definitely get better at teaching comm as time goes by.\r\n\r\nIf you do the assignments with care, and attend class, it shouldn’t be hard at all to get an A; she’s a very lenient grader. She even treated us with some donuts and snacks on the last day :)", "rating": 5, "expected_grade": "A", "created": "2023-05-28T10:32:29.949476Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "He started the class by saying that we were all the same person and that he doesn't have to get to know us because he already knows who we are, since we are all the same, then spends the rest of the class trying to prove that he cares more about us as students than the \"average\" professor. He is a HARSH grader, he thinks that the standard should be a C, has very obscure grading criteria and treats the outline that you do for the speech like the review of your doctoral thesis. I have a lot of speech experience and I barely got an A in the class, absolutely ridiculous that he is willing to jeopardize your GPA because of his beliefs.", "rating": 3, "expected_grade": "A", "created": "2023-05-29T20:37:02.163998Z"}, {"professor": "Olivia Truban", "course": "COMM107", "review": "Literally so easy and relatable. Ends class around 30-45 mins early because she cuts through the BS. Very accommodating and makes everyone feel welcome.", "rating": 5, "expected_grade": "A+", "created": "2023-06-20T21:09:42.744244Z"}, {"professor": "Yumin Yan", "course": "COMM107", "review": "Fantastic teacher. Very kind and helpful. Makes a somewhat boring course easy to get through. Just follow the rubric and you will get an A. Also gives helpful feedback.", "rating": 5, "expected_grade": "A+", "created": "2023-06-25T18:16:31.594791Z"}, {"professor": "Tatenda Mashanda", "course": "COMM107", "review": "T just wanted to make sure we were doing the work and putting in the effort. As long as you do the work, there's nothing to worry about! The grading was lenient, and I definitely submitted a few assignments past the deadline (for the online summer course) and he was very understanding and nice about it.", "rating": 5, "expected_grade": "A+", "created": "2023-07-11T03:02:16.586069Z"}, {"professor": "Jin Choi", "course": "COMM107", "review": "Great teacher, gives feedback, responds to questions quickly and grades generously", "rating": 5, "expected_grade": "A+", "created": "2023-08-23T17:03:30.423348Z"}, {"professor": "Delight Agboada", "course": "COMM107", "review": "Literally the sweetest person in the entire world, her name honestly says it all. The quizzes are super easy and can be done just by following along with the reading, she is such a nice grader and genuinely wants you to do well. Nicest prof ever, take this class 100%; i've never heard of someone having a bad comm prof, however, she goes above and beyond - its worth a schedule change if necessary. take her!", "rating": 5, "expected_grade": "A", "created": "2023-10-02T17:10:36.267139Z"}, {"professor": "Tatenda Mashanda", "course": "COMM107", "review": "Extremely easy class and the workload was very light. The main thing T is expecting from you is that you show up to class and put in the bare minimum effort required. The class is truly the definition of if you show up you will get an A.", "rating": 5, "expected_grade": "A+", "created": "2023-10-24T19:57:16.196630Z"}, {"professor": "Andrew Lowe Mohammed", "course": "COMM107", "review": "This is his first year teaching so he's still learning. However, he actually grades the speeches harshly compared to the other instructors. He kinda just springs the speeches on us without enough guidance.", "rating": 3, "expected_grade": "A", "created": "2023-10-25T19:33:13.373242Z"}, {"professor": "Crystal Stone", "course": "COMM107", "review": "I absolutely ADORE her! She is actually the most wonderful and understanding professor you will encounter. She has set off my college experience on a very good note and is a wonderful and understanding teacher.\r\n\r\nCoursework wise, there's really not a lot to do. There are weekly quizzes but 10 questions multiple choice and open note. It's all based on the textbook and you can find the answers fairly easy. There are 3 major speeches, informative, persuasive, and group. As long as you give a good effort and try your best and stay within the time limit, you can get an A+. I can not stress how much she will make your COMM107 experience great and if you can take her PLEASE DO!! Even if it's an 8 am it's going to be ok and her class will be worth it!!!!", "rating": 5, "expected_grade": "A+", "created": "2023-10-30T04:21:18.410394Z"}, {"professor": "Delight Agboada", "course": "COMM107", "review": "The nicest person I have ever met. She really cares about her students and is so accomodating. Take this class, it is easy so long as you do the work and Delight is the best. The whole comm department is decent from what I have heard but she really is the best.", "rating": 5, "expected_grade": "A", "created": "2023-11-08T22:36:06.234895Z"}, {"professor": "Allison Doherty", "course": "COMM107", "review": "She talks about her ex-husband too much and is unnecessarily strict about attendance, and is super inflexible even when you are genuinely sick. She's a fairly strict grader, and due to the nature of the course (COMM 107 in this case) it is also super subjective, and her grading of our speeches fluctuated a lot even with very similar feedback. I'm not sure how good the other professors are for this course as everyone I know has this one, but if there are any other options I'd highly suggest you go for them.", "rating": 2, "expected_grade": "A", "created": "2023-11-13T22:59:09.661770Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Professor Golden is an amazing guy and really knows how to connect a classroom of strangers. He's funny, engaging, and conversational, to the point where you forget he's a professor. However, he's a pretty harsh grader and treats this class like his baby, but that's also what makes him a good professor. The class requires practically no work outside of class(besides a weekly 2-question quiz), and there aren't any exams, just presentations that weigh a good portion of your grade. As long as you treat this class like any other class you care about, you will be fine.", "rating": 4, "expected_grade": "B+", "created": "2023-11-27T22:07:31.623295Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "He's a great teacher and he genuinely cares about the students and the material. You gotta go to class for attendance but you don't really miss anything crazy he doesn't give any out-of-class assignments except reading and you can skim that. He's an extremely understanding guy and if you put the effort in you will be fine and definitely learn a thing or two. He's also very interactive and entertaining and makes an effort to get to know you.", "rating": 5, "expected_grade": "A", "created": "2023-11-29T21:49:27.285133Z"}, {"professor": "Ran Ma", "course": "COMM107", "review": "the best comm instructor ever, i literally love her. she's so lenient with grading and she made the classroom an overall safe space. barely any assignments at all, all you really have to do is show up. and presenting was not scary at all, as long as you know what you're talking about.", "rating": 5, "expected_grade": "A+", "created": "2023-11-30T00:24:44.075781Z"}, {"professor": "Rachel Bailey", "course": "COMM107", "review": "Great teacher and very helpful. She is flexible with presentation times as long as you have genuine reasons for conflict and let her know early.", "rating": 4, "expected_grade": "A-", "created": "2023-11-30T20:34:52.391466Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Professor Golden is genuinely one of my favorite professors I've ever had. Sure, I'll admit that he is a harder teacher than most of the other COMM107 instructors and that he grades more rigorously. BUT, every class period is a blast with him and it's always a good time to joke around with him. He loves the students that play off of his humor and interacting with him genuinely puts me in a good mood and sets my day off positively.", "rating": 5, "expected_grade": "A", "created": "2023-12-01T04:00:45.947568Z"}, {"professor": "Jade Olson", "course": "COMM107", "review": "Super understanding and lenient with late points, extensions, etc. Will actually give you meaningful feedback and wants you to succeed. Attendance is mandatory but she was very understanding with sick excuses and allowed me to make up all missing participation points. Projects are easy if you put in the time. About 1-2 hours of work per speech, there are 4 speeches. There are very easy weekly homework quizzes, participation points, and reflections to help boost your grade. Would highly recommend to anyone taking COMM107 who wants a bearable experience.", "rating": 5, "expected_grade": "A", "created": "2023-12-01T16:36:15.188837Z"}, {"professor": "Jeonghyun Kim", "course": "COMM107", "review": "Professor Kim is a very lenient and understanding grader. When it comes to the presentations, even if you slip up, have your awkward moments, or end it abruptly, you will walk out of the class with your grade already entered and it being a lot higher than you expected. You also have plenty of time to complete your outlines and visual aids. There are chapter quizzes based on a textbook, but they only last half-way into the semester and you can do them any time before the due date.\r\n\r\nI don't consider myself an extrovert or a good public speaker, but Professor Kim made public speaking (which would normally be my nightmare) into a simple and easy class.", "rating": 5, "expected_grade": "A", "created": "2023-12-01T17:06:53.414633Z"}, {"professor": "Sean Rhodes", "course": "COMM107", "review": "If you can choose your Comm prof PLEASE TAKE RHODES! I think he is leaving soon since he's a grad student but he is absolutely the best prof for comm. He never grades bellow a B as long as you stand up and speak. There are 3 speeches (one group) that make up most of your grade. He took a while to grade my class due to some stuff with his own schooling but he's really great. Class is never mandatory but he will sometimes say something in class just to prove who hasn't been going. The quizes are all based on the textbook which you can find online for free. He's honestly such a vibe 10/10 recommend his class!", "rating": 5, "expected_grade": "A+", "created": "2023-12-03T04:27:33.052659Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "Professor Pope is great and I loved how our class bonded. She can get a little frustrated sometimes, but I like this class and she is a great teacher.", "rating": 4, "expected_grade": "B+", "created": "2023-12-03T22:12:44.511463Z"}, {"professor": "Soyoung Bae", "course": "COMM107", "review": "Pretty boring and dry, very strict on attendance which hurts with flexibility if you have other events, nothing too spectacular", "rating": 3, "expected_grade": "A-", "created": "2023-12-04T02:30:08.054758Z"}, {"professor": "Hailey Otis", "course": "COMM107", "review": "She is so nice! Her lectures are boring but she knows what shes doing. Honestly, I feel like this course itself is a waste of time, and if you plan on taking it I would take it in the winter. However, if you take it with anyone I would recommend her! She is very lenient on grading presentations, and as long as you email her beforehand with a reasonable explanation, she will take late work as well. The workload for her course is very reasonable. Very very nice lady, I would recommend!", "rating": 5, "expected_grade": "A", "created": "2023-12-04T13:14:10.293275Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "All the quizzes are online which is great and they're pretty straightforward. It's easy to get an A in her class if you just follow the directions in her rubrics for the presentations. My class got close because she always had us do activities do get comfortable with each other. Not a difficult class to take.", "rating": 5, "expected_grade": "A", "created": "2023-12-04T15:47:48.968030Z"}, {"professor": "Elizabeth Phipps", "course": "COMM107", "review": "Elizabeth Phipps is probably the best comm107 professor there is. We had 9 asynchronous days where we didn't have to go into class at all, and we could just work on our speeches. She also ends class early a lot if she has nothing else to talk about. She also lets you use a device during your speeches, so you can just read off your notes (occasionally looking up or you'll lose points) so you only need to practice your speech a few times. She also gives actually helpful advice on your speeches and doesn't grade them harshly at all. Her quizzes are also super easy as it's open note and the questions aren't hard. \r\n\r\nOverall, a very easy and chill class (in the times when she actually holds a class).", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T18:27:51.351922Z"}, {"professor": "Delight Agboada", "course": "COMM107", "review": "Amazing professor. Super easy grader everything is basically 100%, an easy class, and she is just the nicest human being.", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T21:36:44.787249Z"}, {"professor": "Tatenda Mashanda", "course": "COMM107", "review": "Mashanda is the best professor you can have for comm, hands down. he just wants everyone to pass the class, and if you show up to every class, put in some effort on all assignments, you will get an A easily. super understanding and supportive, and will help you with anything you need.", "rating": 5, "expected_grade": "A", "created": "2023-12-05T22:04:17.286229Z"}, {"professor": "Kalin Schultz", "course": "COMM107", "review": "Very easy course with a very lenient and kind professor. She's understanding of the students and what they want and will help with any assignment there is. Just attend class for participation and it is probably more difficult to get a bad grade in her class than to get a good one. 100% recommend for people who are taking COMM107. Also most of her presentation outlines will probably be graded as a 100% if u just follow her format and the quizzes and participation are easy too.", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T22:18:50.237069Z"}, {"professor": "Faith Otchere", "course": "COMM107", "review": "Great teacher, she cares a lot about her students and makes everyone comfortable with presenting and communications even if its not your strong suit. As long as you submit the work and show up for class it is a very easy A and a great community to be in!!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T01:23:09.929238Z"}, {"professor": "Kimberli Munoz", "course": "COMM107", "review": "Very easy class and Mrs. Munoz is a super nice professor!", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T01:29:26.558594Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "Best communications teacher for this fall semester from what I heard from others. Minimal reading, just read the instructions and submit assignments on time and you should be set with an A. He's a nice guy and that shows when he is grading speeches. He is also a professor that encourages to turn in assignments early for feedback and actually does point out what to improve in a reasonable amount of time. Overall good professor.", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T01:30:12.601759Z"}, {"professor": "Delight Agboada", "course": "COMM107", "review": "Professor Delight had to leave mid-semester for maternity leave. However, the time that I did spend with Delight was sure a delight (LOLOL). Jokes aside, she was an amazing professor with an inquisitive and positive energy about her. Her presence would have a ripple effect on the students and thus allow us to work more efficiently. This class was an easy A, and I would highly recommend her as a professor to take and would keep in touch with her over the semesters.", "rating": 5, "expected_grade": "A", "created": "2023-12-06T03:40:38.187226Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "Pros: he allows multiple submissions (before the deadline) and provides feedback quickly, giving opportunities to improve grades and quality of submissions. He also responds quickly over email. \r\n\r\nCons: He uses A LOT of bad words during class. Poor language is offensive to many and quite unprofessional for a university teacher.", "rating": 3, "expected_grade": "A", "created": "2023-12-06T18:39:59.220615Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "While Golden's grading can be a bit stricter than other professors, he is kind and really teaches you how to be a better presenter. If you're looking for an easy gen-ed class, he may not be for you, but if you don't mind putting in a little work, I'd say its worth it. He is also a bit of a character, which I enjoyed, but may not be everyone's cup of tea.", "rating": 5, "expected_grade": "A", "created": "2023-12-07T03:06:09.040943Z"}, {"professor": "Daviana Fraser", "course": "COMM107", "review": "Professor Fraser has got to be one of the best professors at UMD. She made class super interesting and fun, even though it was at 8 am; you can tell she is passionate about the subject. She is super accommodating and she grades extremely fair. She gives time to complete assignments in class and sometimes we have asynchronous class to complete assignments, which I thought was great. Hands down the best comm107 professor and I definitely recommend her!", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T14:49:32.240547Z"}, {"professor": "Tatenda Mashanda", "course": "COMM107", "review": "Professor T was a great professor. If you show up and put it in an effort, it is an easy A. If you need an extension make sure to email him earlier rather than later. He can be passive aggressive at times but overall he is very funny and a great teacher. He grades very leniently, so as long as you put an effort in on your presentations, you should get an A. The quizzes are quite easy and he lets you take them at home. By the first month he learns everyone in the classes name and he truly cares about his students. I truly recommend him.", "rating": 5, "expected_grade": "A", "created": "2023-12-07T15:37:07.113194Z"}, {"professor": "Jonathan Leach", "course": "COMM107", "review": "Mr. Leach is super nice and funny. I totally recommend this class. There is a weekly quiz (online & open-book), but it is super easy and based off of the textbook. He does make us do some unexpected 30-45 second class presentations (some impromptu, some not), but that only happened like 3 or 4 times over the semester and were super helpful actually, so no biggy. He gave us plenty of time to prepare for presentations, and gave great feedback. Overall, would recommend for a stress free COMM class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T18:15:38.624940Z"}, {"professor": "Rachel Bailey", "course": "COMM107", "review": "A wonderful teacher who brought good energy into the classroom. I enjoyed the group project the most, she got me to engage with the material even if it wasn't something I was particularly interested in. She knew all the material very well. The slides were very concise. Quizzes were super easy. She never wasted class time and I believe was very fair when grading our presentations. Would definitely recommend her for Comm 107.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T19:10:56.721753Z"}, {"professor": "Misa Park", "course": "COMM107", "review": "Misa was an okay professor. She was sweet don't get me wrong, but she didn't communicate with us well. I think sometimes it was hard to understand directions and what she wanted us to do because English isn't her first language. While the assignments were generally easy and self-explanatory, she would get nit-picky about certain things she wanted to see on our speech outlines- though she previously didn't explain specifics because there were directions to follow. Something nice about her was that instead of having an in-person class every time, she'd do an optional Zoom session if we had questions so we wouldn't have to go in at 8 am. Overall, this class was not hard because all you have to do is give presentations.", "rating": 4, "expected_grade": "A", "created": "2023-12-08T19:47:23.192881Z"}, {"professor": "Tania Nachrin", "course": "COMM107", "review": "If possible don't take this professor. She is okay and grades justly but the way she handles class time is not the best, but she is very late with submitting grades. Most classes are boring. She does a poor job in managing her time and most time she is out of topics to teach/discuss so she covers assignments for the next 2-3 weeks. \r\nIt is easy to get an A if you do your work on time and clearly, but the classes are not enjoyable so if you actually want to learn something in COMM107 don't get this professor.", "rating": 2, "expected_grade": "A+", "created": "2023-12-08T21:17:27.878281Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "Overall I found this class to be helpful and fun. Professor Pope was very a great professor who helped push everyone to step outside their comfort zone and try new things. She wasn't very supportive when choosing topics to speak about but she did give good feedback on outlines and the speeches that I gave.", "rating": 4, "expected_grade": "A", "created": "2023-12-11T21:53:09.841329Z"}, {"professor": "Rachel Bailey", "course": "COMM107", "review": "Amazing Teacher! You have to put in some work with your speeches but she wants you to succeed. She is very flexible with submission dates if you let her know ahead of time. If you put in the work, the class should be an easy A.", "rating": 5, "expected_grade": "A", "created": "2023-12-12T01:20:37.486398Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Great guy, terrible teacher. He's generally a nice guy and there was a really positive environment in the classroom, but I didn't learn anything really. He jokes around a lot, and he makes an effort to get to know all the students. I actually enjoyed showing up to class. But in terms of the coursework, it was basically the opposite. He grades pretty harshly, and the 'lectures' he gives in class aren't super helpful. Communication was (ironically) pretty poor, to the point where I was told that I would be presenting in the middle of class on a particular day, but I was actually presenting first on that day, and wasn't mentally prepared for it. You'll need to practice quite a bit for an A, but if you're fine with a B you can get away without much practice.", "rating": 2, "expected_grade": "B", "created": "2023-12-12T17:52:19.053018Z"}, {"professor": "Mollie Kaufer", "course": "COMM107", "review": "Best professor! Super understanding and considerate makes class interesting!", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T23:15:31.341869Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "To me, a five-star review is when a professor genuinely cares about their students' success and tries to make them better at whatever is being taught, and this is exactly how Professor Golden is. Its true that his Comm class is more difficult than the others, but there is a reason for this. Its not because he is unfair, but rather because he wants you to put in the work and become better at public speaking. If you put in the effort, you will get a good grade and also gain very useful public speaking skills. Professor Golden is funny and keeps class interesting, and although he can be a little sassy sometimes, I really enjoyed having him as a professor.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T21:24:09.057358Z"}, {"professor": "Kimberli Munoz", "course": "COMM107", "review": "Very nice and light grader.", "rating": 5, "expected_grade": "A", "created": "2023-12-14T05:48:29.236980Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Not worth", "rating": 1, "expected_grade": "A", "created": "2023-12-14T21:54:12.449968Z"}, {"professor": "Janna Soeder", "course": "COMM107", "review": "Pros:\r\n-Entertaining lectures, can sometimes still do other things during class if you need to \r\n-Gives good feedback \r\n-Homework is quick and fairly easy\r\n-Pretty easy A, I felt my work was not always my best, but I still did not get below a 93 on any major assignments.\r\nCons:\r\n-Homework feels like busywork at times and testbank quizzes felt like they were testing technicalities, rather than major concepts\r\n-You cannot find this textbook online anywhere; you just have to pay the money.\r\n-Sometimes it felt like no matter what I did, I would always do 'something wrong', which maybe says something about the class expectations. I question if it is even possible to get an A+ in this class given some of the critiques I was receiving on outlines and such.\r\n\r\nI'd say she deserves like a 4.5/5, but this site does not have that feature, so I'll round up :)", "rating": 5, "expected_grade": "A", "created": "2023-12-14T23:34:00.703996Z"}, {"professor": "Allison Doherty", "course": "COMM107", "review": "Not sure why she gets a bad rep on here and RateMyProfessor, because she is a very nice and caring professor who wants people to succeed. She grades speeches and outlines lightly according to the rubric, so just follow the points and you'll do fine. She does a lot of activities to make the class fun and get people over their fears of public speaking. While these activities are annoying and embarrassing at first, they will 100% make you a better speaker. She is somewhat strict about late work, but if you have a good excuse you can often receive less of a penalty. Quizzes are online and super easy (the questions are straight out of the textbook). The only real work for this class is preparing for speeches, but she gives you outline templates for all of them that makes them a lot less work. Overall, a great professor.", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T01:22:22.010924Z"}, {"professor": "Kalin Schultz", "course": "COMM107", "review": "She was an amazing professor!!! An easy grader and her assignments were fair. Highly recommend!", "rating": 5, "expected_grade": "A", "created": "2023-12-15T02:17:09.389795Z"}, {"professor": "Kimberli Munoz", "course": "COMM107", "review": "Such an easy class and gened with her. Comm is just an annoying class to take, especially if you don't like public speaking, but Munoz was such an easy grader and honestly was so considerate to everyone. Definitely take her if you can!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T21:24:32.908057Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "Was amazing! Very organized, grades quickly, cares about his students. Take his class for comm 107. If you put in the work and take the quizzes the first week of class you are all set!", "rating": 5, "expected_grade": "A+", "created": "2023-12-16T18:21:33.738697Z"}, {"professor": "Gerry Strumpf", "course": "COMM107", "review": "Gerry is amazing. As long as you show effort, she will love you.", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T01:22:57.545067Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Professor Golden is very nice and if you want to truly learn about communicating and interview skills he's your guy. However if you're just looking for an easy gen ed and thinking this will be a gpa booster you better think again. He's very strict about how the presentations are done and because of his experience notices even the small mistakes and believe me he WILL take points off for them. Just try to stay within the time limit (something I struggled with but that's my fault) because 3 points are taken off for every 10 seconds over time which can add up and talk to him after or before class and get to know him because he is a cool guy.", "rating": 3, "expected_grade": "B-", "created": "2023-12-17T01:28:17.863478Z"}, {"professor": "Jonathan Leach", "course": "COMM107", "review": "Super chill guy and a super easy grader. I would definitely take him for comm107. Easiest A so far in college and the class is pretty enjoyable. he doesn't expect too much and there are only 3 main presentations and one of them is a group presentation.", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T01:31:16.757494Z"}, {"professor": "Elizabeth Phipps", "course": "COMM107", "review": "She gives you a lot of advice and feedback on the speeches you give during the semester, and she's pretty lenient on the grading. She lets you use a device during your speech so you never really need to make notecards for your speech, and you don't really need to memorize it. The best thing about he is she gives you a BUNCH of asynchronous days where you don't have to go into class and she just lets you work on your speech. On days where she does have class she usually just lets you go 30 minutes early because she has nothing left to talk about. She's very little nonsense so she gets straight to the point in class and you can just leave (she does make you go in on some days, but the asynchronous days make up for it). Overall she's a very nice lady, and it's a pretty easy A if you put a tiny bit of effort into it. \r\n\r\nOverall, if you're looking for an easy A for your comm gen ed just take her, and you most definitely will not regret it. :)", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T05:02:18.160847Z"}, {"professor": "Miriam Komuhendo", "course": "COMM107", "review": "Since most gened professor are good, so why not choose a professor who’s more generous?", "rating": 1, "expected_grade": "", "created": "2023-12-17T13:51:35.179778Z"}, {"professor": "Miriam Komuhendo", "course": "COMM107", "review": "The lecture of the professor is boring. Literally I didn't learn anything and the grade is also srtict.", "rating": 1, "expected_grade": "", "created": "2023-12-17T15:51:03.053403Z"}, {"professor": "Delight Agboada", "course": "COMM107", "review": "she’s a really nice professor and definitely a fair grader. lectures are a bit boring but that’s not really on her since it's based on things you’ve already read in the textbook. her reading quizzes are also super easy and open note, so it's an almost guaranteed 9/10 or 10/10 on those. you’ll have 4 presentations throughout the year (informative, persuasive, small group, and a special occasion), and as long as you take them relatively seriously you should pass with a good grade in the class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T16:25:18.181269Z"}, {"professor": "Taylor Kleiner", "course": "COMM107", "review": "Great teacher, as someone who was just taking the class as a gen ed I was suprised to find myself excited to go to class every lecture. She was always willing to discuss if you missed a question on a quiz and always gave feedback if you made a mistake during a presentation. Always very fair when it came to grading and truly wants you to succeed in the class. Overall great professor and I could not recommend her enough, if you get the chance to take her class please do!", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T19:11:35.335865Z"}, {"professor": "Rachel Bailey", "course": "COMM107", "review": "Honestly, the best professor I had this past semester. You can tell she truly cares about you and your overall development within public speaking. HIGHLY RECOMMEND PROFESSOR BAILEY. If you put in the work to improve she will reciprocate.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T05:26:00.551556Z"}, {"professor": "Hailey Otis", "course": "COMM107", "review": "Very nice professor that wants to see her students succeed. She is very flexible with due dates and when you plan on presenting. Makes the classroom a comfortable environment for everyone to present in.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T15:51:01.829708Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "I can not express how truly amazing Dr. McCloskey is. I am a pretty apprehensive public speaker, however, he was so supportive and really just wanted to see you succeed. He allows you to resubmit your work as many times as you want before the due date, to get back credit on points you may have lost. For speeches, he gives you outlines to follow, so if you follow them, literally word for word, you will get full credit. There are like ten quizzes you have to do and they are open textbooks and are super easy -- you can do them way ahead of time to get them out of the way. He gives great feedback on your speeches and responds to emails very quickly. He's also really funny and is so passionate about making things relatable and will often use little anecdotes about his children which is endearing. This is an hour and fifteen-minute class, but he would often let us go maybe 20-30 minutes into class, just because we'd be done with what we needed to get done in the day. If you're going to take COMM107, definitely choose Dr. McCloskey!!", "rating": 5, "expected_grade": "", "created": "2023-12-19T18:26:48.488137Z"}, {"professor": "Gerry Strumpf", "course": "COMM107", "review": "Gerry is a very easy going and supportive teacher. That being said, her grading is very random and varied based off how much she likes the topic and student. She goes on lots of tangents and gets off track a TON. If you’re not a natural public speaker, it will be a challenging, but very helpful class. I ended with 899/1000 points and she refused to give me one extra point, so I ended with a B+, which was very disappointing. Overall very easy and manageable class, so it was unfortunate to end with a B.", "rating": 4, "expected_grade": "B+", "created": "2023-12-20T01:08:05.325566Z"}, {"professor": "Jiawen Zhang", "course": "COMM107", "review": "The class can be quite mundane at times as it goes through a lot of the theoretical nature of presentations, but overall Professor Zhang grades quite leniently (given I have really bad speech anxiety) and is very constructive with her feedback. Quizzes were quite easy (2 attempts and open notes based on the textbook). Overall, I had a great experience with her.", "rating": 5, "expected_grade": "A", "created": "2023-12-20T04:11:48.820122Z"}, {"professor": "Daviana Fraser", "course": "COMM107", "review": "I had 8AM comm with her which was bound to suck but she was such a good professor! Really honest about her own anxieties with public speaking, making it easier for us to speak. She's fun, reasonable, and considerate; class was always lively, I could email her and let her know if I was going to turn in something late (i never got any points off) and she understood our needs and gave us plenty of asynchronous class days during a particularly hard semester. I'm going to miss her!", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T03:40:46.647805Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "HE IS THE GOAT. The class is engaging and he seems very passionate about what he teaches. He literally even said in the beginning of the semester that he doesn't want us to be stressed about his class, and that he will accommodate us if need be. The presentations topics are basically 100% up to us. HIGHLY recommend you take him!", "rating": 5, "expected_grade": "A", "created": "2023-12-21T06:45:20.810283Z"}, {"professor": "Taylor Hourigan", "course": "COMM107", "review": "Taylor is such a great instructor and she cares so much about her students! She really wants all of her students to improve and feel more comfortable with public speaking by the end of the semester. She also grades very fairly so if you do all of the work, you will do well.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T19:26:24.627544Z"}, {"professor": "Anani Kuwornu", "course": "COMM107", "review": "Awesome choice for COMM 107! He is a super easy grader and it requires very low effort to get a high A in his class (I think I've only lost 1 point out of 1,000 the whole semester). However, he does struggle sometimes with clarity and making it known what assignments to do and when they are due, so make sure to ask questions and check ELMS regularly. However, overall a very solid choice.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T22:11:47.574593Z"}, {"professor": "Jade Olson", "course": "COMM107", "review": "Best Best Best Professor you could have for this (necessary but unnecessary gen-ed). She understand that this is a gen-ed course and that a lot of people are not enthusiastic about taking this class like at all but she  made it worthwhile by curating an open space where students would feel comfortable presenting in a smedium crowd. There are 3 individual speeches (Informative, Persuasive, and Special Occasion) and 1 group speech. You will have to submit an outline for every single speech and that should be a breeze since she only requires minimum guidelines on how you need to structure your outline. She does allow any type of notecards or phones (whatever you need to help your speech). She does grade a little more \"harsher\" but it's doable if you actually improve on the thing that she mentions because she leaves very detailed feedback. But like I said, her grading can seem little out of tune with her feedback she gives, but honestly don't sweat it too much. You should pass with an A regardless.", "rating": 5, "expected_grade": "A", "created": "2023-12-22T01:35:07.895723Z"}, {"professor": "Daniel Foster", "course": "COMM107", "review": "Dan was a great teacher, seems to have an interest in the students and nice class environment. While his grading was harder than other professors, his class is relatively easy to do well in, with him giving good feedback and constructive points. He was overall a solid professor who I would take again.", "rating": 5, "expected_grade": "A-", "created": "2023-12-22T03:36:18.710500Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "Professor Pope is a must-take. She explains what is expected clearly and is a lovely grader as long as you do your best! All she wants to see is improvement. If you've struggled in public speaking before, she makes a friendly environment where you can grow your skills.", "rating": 5, "expected_grade": "A+", "created": "2023-12-22T18:03:35.281394Z"}, {"professor": "Sean Rhodes", "course": "COMM107", "review": "Sean is a great teacher, especially for COMM107. He really creates a welcoming and safe environment which can be important as the class can be daunting to some. Grading wise, he is A VERY SLOW grader but very lenient (literally never actually graded any presentations just put a final grade into testudo even though he continuously said the grades would be inputted into canvas soon). I would highly recommend him as a professor as he understands that most don't want to take the class but are instead required to which makes him lenient to grading as long as you are actively participating in the class consistently.", "rating": 5, "expected_grade": "A+", "created": "2023-12-25T00:15:29.149232Z"}, {"professor": "Daviana Fraser", "course": "COMM107", "review": "She is a great comm professor who can connect to the students very well since she is young and understanding. She teaches the material very well and has helpful critiques to help you improve. She sometimes takes a long time to grade assignments and answer emails, but you can just follow up with her or speak to her in person, and she helps right away.", "rating": 5, "expected_grade": "A+", "created": "2023-12-28T01:11:37.535778Z"}, {"professor": "Rachel Bailey", "course": "COMM107", "review": "Amazing Teacher, she cares about her students a lot. You have to put a lot of time for planning and writing speeches, but I feel that you're given enough time. The professor also makes it easy to go in the front of the class when you have to present. She is also very understanding and provides in depth feedback after you present. Overall a very helpful teacher that is very approachable", "rating": 5, "expected_grade": "A-", "created": "2024-01-03T18:09:29.278761Z"}, {"professor": "Vijaya Bohlmann", "course": "COMM107", "review": "Loved her! 107 was so easy compared to other instructors, no exams, weekly online quizzes are open book, attendance isn't mandatory. Honestly a really sweet professor", "rating": 5, "expected_grade": "A", "created": "2024-01-03T22:39:27.310006Z"}, {"professor": "Anani Kuwornu", "course": "COMM107", "review": "He is a super easy grader and generally very chill, however he is not the best with due dates and using ELMS in general so make sure to check in with him during class and clarify what he wants submitted and when. Overall he is nice, a good choice for COMM107 and makes it an easy A if you put in any effort.", "rating": 5, "expected_grade": "A+", "created": "2024-01-06T05:51:53.022421Z"}, {"professor": "Seyeon Park", "course": "COMM107", "review": "She was always energetic and super sweet. I can feel she wants her students to succeed in this class and I did improve my public speaking!", "rating": 5, "expected_grade": "A+", "created": "2024-01-07T17:41:47.175202Z"}, {"professor": "Seyeon Park", "course": "COMM107", "review": "Professor Park is super sweet and passionate about teaching! She cares about her students and gives very helpful feedback throughout the semester. I liked how she instructed us and it really helped me to improve my public speaking.", "rating": 5, "expected_grade": "A+", "created": "2024-01-07T17:53:02.352015Z"}, {"professor": "Ran Ma", "course": "COMM107", "review": "She ate. Funny, wants to see you succeed. I was always super nervous to present which messed up my presentations a bit, but I still always got an A. Even though she was an easy grader she gave great feedback for future presentations. If you can take Ran take her!", "rating": 5, "expected_grade": "A+", "created": "2024-01-09T04:05:27.154851Z"}, {"professor": "Seyeon Park", "course": "COMM107", "review": "Professor Park was one of my favorite professors this semester with a strong commitment to her students' learning and success. Her lectures were well-structured, engaging, and informative. She consistently encouraged active participation and fostered an inclusive and respectful classroom environment. She provided constructive feedback on assignments, which greatly helped me to be better. It was an 8am morning class, but she was always energetic and tried to bring more fresh energy to the class.", "rating": 5, "expected_grade": "A+", "created": "2024-01-09T18:56:53.833068Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "Absolutely incredible professor and highly recommend!! Thomas grades assignments quickly in less than 24 hours, gives you your presentation grade right when you finish your presentation, offers great feedback, and is very organized - he lets the class out around half an hour - 45 min in advance to work on the weekly quizzes or independent work for the next speech and trusts us to finish the busy work elsewhere instead of taking up the full hour and fifteen minutes. Lecture wise, I genuinely enjoyed them and the course was fun with Thomas teaching and is very knowledgeable and very chill. Put in the work, take his feedback, and you will get an A.", "rating": 5, "expected_grade": "A", "created": "2024-01-18T20:10:09.663202Z"}, {"professor": "Elizabeth Phipps", "course": "COMM107", "review": "Great professor loved her. Creates a super comfortable, chill environment that makes public speaking a lot easier. Gives really good feedback on speeches. A lot of classes were asynchronous which was super nice, and on days that we did go in class ended early most of the time. Also the quizzes are open book so they're super easy. Definitely would recommend!", "rating": 5, "expected_grade": "A", "created": "2024-01-19T00:56:57.985395Z"}, {"professor": "Thomas McCloskey", "course": "COMM107", "review": "love dr mccloskey!! he is super understanding of any extensions u may need and after talking to other friends taking comm107 he seems to be the easiest professor. grades everything super leniently and doesn't expect super high quality work", "rating": 5, "expected_grade": "A", "created": "2024-01-19T04:58:07.482773Z"}, {"professor": "Mollie Kaufer", "course": "COMM107", "review": "She's awesome to have for COMM107 -- Professor Kaufer is kind, organized, and very approachable. She is well aware that this class is one everyone has to take, but few are truly interested in, so she's not nitpicky or overly serious like some profs. The major assignments are 3 presentations, which are graded fairly, and she does her best to minimize any pressure/anxiety people have and offer insightful feedback.\r\n\r\nOverall, she really does want the best for you, and I'd say people leave her class as noticeably better presentational speakers.", "rating": 5, "expected_grade": "A+", "created": "2024-01-20T22:14:38.883878Z"}, {"professor": "Viktoriia Savchuk", "course": "COMM107", "review": "I really adored Instructor Savchuk even though my COMM107 class was asynchronous. She was super, super sweet and helpful. You could tell that she cared that her students did well. She gave tons of informative feedback on assignments. You could tell she took a lot of time working on the feedback. If you emailed her she would respond right away. She was super helpful. She is super super good and would recommend her 100%", "rating": 5, "expected_grade": "A", "created": "2024-01-21T08:56:43.749009Z"}, {"professor": "Allison Doherty", "course": "COMM107", "review": "I had Professor Doherty as a sub for the past few weeks of the fall semester. Since the last professor was new and not great, I was hoping Doherty would make the last few weeks worthy of a communications class. I'm not sure why she gets a bad rep here, considering she was a decent professor. Yes, she sometimes did talk about other stuff (like her ex-husband, lol), but I think she does that to connect with the class a little more and alleviate the tension of a new professor a bit. Everyone likes a professor with even a small sense of humor. However, as a professor, she spoke clearly, and at least for me, I could tell she was a decent communications professor. She even discussed one-on-one at selected times during class with different groups on their outlines and presentation slides. \r\nWith only a few weeks left, she graded our last two presentations with leniency and gave constructive feedback. She did say she graded her own students harder, but overall, I think she has higher expectations. Overall, the last weeks went smoothly.", "rating": 4, "expected_grade": "A", "created": "2024-01-23T15:18:54.804522Z"}, {"professor": "Elizabeth Phipps", "course": "COMM107", "review": "Straight to the point, a very clear and transparent professor overall. Given that I had her during 8ams and she commutes from Virginia, about 40% of the days we'd normally have her were purposely scheduled to instead be office hours for anyone who wanted to meet one-on-one over Zoom. Out of all 4 speeches in this class, two of them were individual, one of them was with a group, and the final was an online video submission that would be no more than 2-3 minutes long. If one of your group members ends up not showing up, she will be very understanding of this and reflect it in her grading and feedback. Her feedback, to add to that, is succinct, appearing to give genuinely thoughtful critiques and remarks on your strengths. \r\n\r\nMoreover, I'll mention that going into this I was admittedly anxious about public speaking, but it quickly became clear with Phipps that not only does she keep this in mind, but also seems to facilitate a class environment/atmosphere of sorts that makes you feel more natural.\r\n\r\nTake her if you can!", "rating": 5, "expected_grade": "A", "created": "2024-01-31T01:07:55.983977Z"}, {"professor": "Faith Otchere", "course": "COMM107", "review": "she's super chill. take her if u can, comms will be the easiest a uve ever gotten", "rating": 5, "expected_grade": "A", "created": "2024-01-31T02:44:06.497652Z"}, {"professor": "Viktoriia Savchuk", "course": "COMM107", "review": "I enjoyed my experience in COMM107 with Viktoriia. I would recommend taking this course in the async format during the winter term like I did. It's a good way to knock out a gen-ed and fulfill 3 credits during the long academic break. It was only 3 weeks long and the work load was pretty light. Generally there was one assignment per day. Some required more effort like a recorded speech (four in total) but most did not take long to complete. Viktoriia was very kind, she sent reminders for assignments and was very approachable. Her feedback on assignments was thorough and constructive and the grading was not too strict. Everyone has to take this course or an equivalent, so I would recommend taking COMM107 with Viktoriia!", "rating": 5, "expected_grade": "A+", "created": "2024-01-31T19:08:20.920279Z"}, {"professor": "Vijaya Bohlmann", "course": "COMM107", "review": "For 107, you really only learn the basics of presenting and you might already know most of that stuff, so class isn't that helpful other than days she explains projects. We had quite a few presentations but it does make  you better at presenting and getting over any fears you may have. She's a pretty easy grader as long as you hit all the general points. Class usually ended a half hour early unless it was a full presentation day. Her quizzes were easy and straight forward. She definitely doesn't make the course herself, so sometimes there's errors in the she shows but nothing that really inhibits your grade. The presentations topics are so vague, honestly really loved the class and loved having her as a professor. If you had questions or actually really wanted help to get better, she def would.\r\nWould recommend taking her for 107. NO EXAMS, ONLY FINAL PROJECT. PRETTY EASY A", "rating": 5, "expected_grade": "A", "created": "2024-03-05T04:16:17.436956Z"}, {"professor": "Jim Golden", "course": "COMM107", "review": "Lectured people about you choose an 8am time to lock in then proceeded to show up late every class.", "rating": 1, "expected_grade": "", "created": "2024-03-05T15:18:40.445979Z"}], "department": "COMM", "course_number": "107", "name": "COMM107", "title": "Oral Communication: Principles and Practices", "credits": 3, "description": "<b>Credit only granted for:</b> COMM107, COMM200, ENES143, INAG110, JOUR130 or THET285.\nA study of and practice in oral communication, including principles of interviewing, group discussion, listening, informative briefings, and persuasive speeches.", "is_recent": true, "geneds": null}