{"average_gpa": 3.817523056653491, "professors": ["Ricco Hall", "Kelly Brower", "Kelly Brower", "Ricco Hall", "Susannah Washburn", "Kelly Brower", "Susannah Washburn", "Kelly Brower", "Susannah Washburn"], "reviews": [{"professor": "Ricco Hall", "course": "CPPL100", "review": "90% of the class was run by either the students of the TA and most weeks were just current events discussions. It was minimal work all semester but then had multiple assignments within the last few weeks of the semester out of nowhere. Very nice guy and responsive if you email him with questions but the assignments tended to be unclear and prompts were often revised after we emailed him to clarify. ", "rating": 2, "expected_grade": "A+", "created": "2020-12-08T15:36:48Z"}, {"professor": "Ricco Hall", "course": "CPPL100", "review": "Professor Hall is a nice guy and he means well, but this class was my least favorite class I have ever taken. The class is a struggle to sit through as the only thing we did all semester was talk about current events. Ultimately, this class is such a waste of time, but it is the easiest A you will ever get.", "rating": 2, "expected_grade": "A+", "created": "2021-12-23T03:34:10Z"}, {"professor": "Ricco Hall", "course": "CPPL100", "review": "Professor Hall isn't a bad prof, I'm giving three stars mostly for the class itself. I know it's a requirement for most of us who take it, but it's nonetheless very, very dull. Mostly discussions, lead almost exclusively by the TA's, on current events (sometimes discussions of personal experience and whatnot - therapy circle type deal) and activities consisting of making a website, writing discussion posts, resume prep. etc. Like the other comments said, it's the easiest A you'll ever get (of course, assuming you do all the work, which is very little). \r\n\r\nI will say the most annoying thing about this class is they designed it so all the \"big\" assignments were loaded at the end. Obviously, this is a huge inconvenience because the last thing I needed to worry about during finals week was writing an essay for CPPL100. But, the assignments were still very straightforward and pretty effortless. So if there is any advice I can offer, it's just to do the end-of-term project/essays ASAP to avoid unnecessary stress. But yeah. Overall, super, super easy. ", "rating": 3, "expected_grade": "A+", "created": "2022-01-28T19:20:36Z"}, {"professor": "Kelly Brower", "course": "CPPL100", "review": "She really cares about her students and is always willing to help. The class itself is very easy and isn't very content heavy, but does teach you some important concepts. Grade consists of mostly exit tickets.", "rating": 5, "expected_grade": "A+", "created": "2022-12-27T00:39:44.677855Z"}, {"professor": "Kelly Brower", "course": "CPPL100", "review": "Kelly is very nice and relatable and you can tell she really cares about her students. The class is easy and kind of pointless where you \"learn\" like how to find the counseling center and about identities and such. Most of the grade is based on a website you build called an e portfolio but its basically busy work.", "rating": 5, "expected_grade": "A", "created": "2024-01-05T17:00:46.392007Z"}], "department": "CPPL", "course_number": "100", "name": "CPPL100", "title": "College Park Scholars: Public Leadership First-Year Colloquium I", "credits": 1, "description": "<b>Restriction:</b> Students must be enrolled in the College Park Scholars Public Leadership (CPPL) program.\nIntroductory colloquium: Examination of issues related to public leadership.", "is_recent": true, "geneds": null}