{"average_gpa": 3.6556962025316455, "professors": ["Lynne Price", "Curtis Stedge", "Lisa Traiger", "Meghan Bowden", "Sarah Oppenheim", "Matthew Reeves", "Christopher Law", "Christine Hands", "Stacey Carlson", "Ronya Anderson", "Jessica Laurita-Spanglet", "Shannon Dooling", "Emily Oleson", "Erin Crawley-Woods", "Megan Morse Jans", "Stephanie Miracle", "Robin Brown", "Nicole McClam", "Crystal Davis", "Heidi McFall", "Mariama Law", "Susan Miller", "Jennifer Graham", "Shawn Stone", "Kristina Harris", "Renee Gerardo", "Ama Law", "Gianina Lockley", "Xinran Qi", "Amber Daniels", "Julie Mulvihill", "Gabriel Mata-Ortega", "Tristan Koepke", "Christina Robson", "Rebecca Hill", "Cyrah Ward", "Carlo Antonio Villanueva", "Caroline Rocher Barnes", "Adriane Fang", "Carlo Villanueva", "Caroline Rocher Barnes", "Britney Falcon", "Carlo Villanueva", "Caroline Rocher Barnes", "Gerson Lanza Ruiz", "Javier Padilla Garcia", "Mary Ford", "Rebecca Hill", "Susan Miller", "Amber Daniels", "Javier Padilla Garcia", "Mary Ford", "Rebecca Steinberg", "Gerson Lanza Ruiz", "Mary Ford", "Gabriel Mata-Ortega", "Mary Ford", "Susan Miller", "Adriane Fang", "Christina Collins", "Kaela Lawrence", "Kevin Clark", "Daniel Miramontes", "Kevin Clark", "Mher Kandoyan", "Peter Pattengill", "Susan Miller"], "reviews": [{"professor": "Jennifer Graham", "course": "DANC200", "review": "Jen is really nice. She's very informative and aware of the different social aspects that impact the way we view dance. She teaches the classes with a very open mind, encourages discussion, and even lets us get studio time which is great.", "rating": 5, "expected_grade": "A+", "created": "2018-05-09T23:11:55Z"}, {"professor": "Xinran Qi", "course": "DANC200", "review": "she is the best!", "rating": 5, "expected_grade": "A-", "created": "2019-12-11T19:29:04Z"}, {"professor": "Kristina Harris", "course": "DANC200", "review": "Krissy was great for this class. She was very kind and understanding about the general work load on students, and tried to make class not as time-consuming outside of class. But also kept material fun and interesting! (Note: this class does not involve actual dancing, just learning about dance) ", "rating": 5, "expected_grade": "", "created": "2021-07-28T16:20:29Z"}, {"professor": "Cyrah Ward", "course": "DANC200", "review": "Cyrah is such a fun professor to take this class with. They really helped to expand my knowledge on the topics and ideas we learned about. The workload was very manageable, with a few projects thought the semester. Cyrah has a lot of passion for the history of dance and making sure we are understanding of the concepts. Attendance is mandatory and a large portion of the grade. I would love to take more classes with her, as she radiates positive energy and builds a connection with students in a causal way. Highly recommend this class with Cyrah!", "rating": 5, "expected_grade": "A+", "created": "2022-04-20T02:31:21Z"}, {"professor": "Cyrah Ward", "course": "DANC200", "review": "Love Prof Ward. She is extremely passionate with the course content and she is very approachable and kind. I took Danc200 as my elective and I'm proud to say I actually learned many interesting things. Keep in mind this is a lecture, not an actual dance class. I enjoyed it and would prob take it again with her if I had to. :) ", "rating": 5, "expected_grade": "A+", "created": "2022-04-26T19:06:37Z"}, {"professor": "Javier Padilla Garcia", "course": "DANC200", "review": "This class is a super easy gen ed I would definitely recommend. It can get a bit boring at times but it is an easy A. The professor is super chill and funny. There are no exams just a couple easy projects. There is also no class the week before and the week after Thanksgiving which is nice.", "rating": 5, "expected_grade": "A+", "created": "2022-12-05T17:57:11.497467Z"}, {"professor": "Amber Daniels", "course": "DANC200", "review": "This is literally the worst course ive ever taken. Dont expect an easy a. Out of my four other major courses and this, this is my lowest grade. I put the most effort into this class and am graded so harshly for every assignment. Definitely dont recommend", "rating": 1, "expected_grade": "A-", "created": "2023-04-10T18:10:49.595188Z"}, {"professor": "Gabriel Mata-Ortega", "course": "DANC200", "review": "Gabriel is a lovely teacher. He is very accommodating and patient with assignments, and he always wants you to value your health over class attendance. His assignments are actually fun and not stressful. There were a few movement presentations and one paper. The paper consisted of you watching a performance and writing about it, and it wasn't so bad at all. I actually ended up enjoying it, and I had never had a particular interest in dance in the past. Take him!", "rating": 5, "expected_grade": "A+", "created": "2023-05-02T01:16:08.801237Z"}, {"professor": "Susan Miller", "course": "DANC200", "review": "Susan was a great professor! The class was extremely easy, and I had a lot of fun. Not only did we learn about the different styles, but we also got into the studio to learn how to perform these dances. There were journals almost once a week, but they were not hard, about one page each. The midterm was a group project, and the final was a project. The class is laid back. As long as you do the work and attend class, you will get the grades you want.", "rating": 5, "expected_grade": "A+", "created": "2023-05-09T21:49:02.577225Z"}, {"professor": "Susan Miller", "course": "DANC200", "review": "Amazing teacher! Really kind and understands her students. 10/10 would recommend.", "rating": 5, "expected_grade": "A", "created": "2023-11-30T23:51:50.164403Z"}, {"professor": "Susan Miller", "course": "DANC200", "review": "Susan Miller is like the mother we've always wanted/needed. Each time I walked into class she'd greet me with a smile and genuine excitement. She cares for her students like they're her children and ensures that everyone has their needs met. She constantly asked how we were doing, if we needed help with anything, etc. Her heart is made of pure gold. Assignments consist of writing assignments (super straightforward), no quizzes, and no tests. The \"mid-term\" is a paper or choreographed dance, and the final is a paper or presentation. Love her so so much!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T20:45:26.617995Z"}, {"professor": "Kevin Clark", "course": "DANC200", "review": "Kevin is a great professor who is incredibly passionate about dance, and this class is incredibly easy. Weekly discussion posts and then a slightly longer midterm and final presentation make up most of the grade. While it often feels like he takes what is meant to be an easy class a little too seriously, I enjoyed having him as a teacher.", "rating": 5, "expected_grade": "A+", "created": "2023-12-20T18:27:29.606151Z"}, {"professor": "Kevin Clark", "course": "DANC200", "review": "Honestly, do not recommend this class. Kevin is definitely passionate about dance, but the assignments are too lengthy and take up too much time given that the class is supposed to be an easy A, dance class. Embodiment days are fine, but they can also feel very awkward. Unless you are super interested in dance, I wouldn't take this class.", "rating": 1, "expected_grade": "A", "created": "2024-04-01T21:21:39.695457Z"}], "department": "DANC", "course_number": "200", "name": "DANC200", "title": "Introduction to Dance", "credits": 3, "description": "A study of dance as a form of communication and as an art form; a survey of the theories and styles of dance, and their relationships to other art forms.", "is_recent": true, "geneds": null}