{"average_gpa": 2.662453124341634, "professors": ["John Straub", "Peter Coughlin", "Robert Schwab", "Judith Hellerstein", "Cindy Clement", "Erin Moody", "Hossein Abbasi", "Marianne Hayek", "Hossein Abbasi Alikamar", "Gentry Johnson", "Ibraheem Catovic", "Thomas Hegland", "Anusuya Sivaram", "Elena Ramirez", "Stefania Scandizzo", "Mrinmoyee Chatterjee", "Hossein Abbasi", "Stefania Scandizzo", "Stefania Scandizzo", "Sebastian Montano Correa", "Kartikeya Batra", "Sebastian Montano Correa", "Erica Ryan", "Luis Jaramillo", "Erin Moody", "Hossein Abbasi", "Stefania Scandizzo", "Stefania Scandizzo", "Erin Moody", "Hossein Abbasi", "Stefania Scandizzo"], "reviews": [{"professor": "Peter Coughlin", "course": "ECON200", "review": "I enjoyed having Coughlin for ECON200. He taught the material very well (although pretty monotonously the majority of the time), and there was never a time during lecture where I didn't totally understand what he was teaching. However, this can also play as a downfall. His ability to teach the material as if we are in elementary school made it seem to the majority of the class that the course would be a total breeze, and I definitely knew of people that had trouble especially on the exams. His exams, although not hard per se, were definitely on the tricky side, but he curves them so that the average is in the mid 80s. However, there was seldom any material that he taught during class that you couldn't have learned from the textbook. The only work besides the exams was the online homework, of which is extremely easy, and even if you can't find the answers, they are bound to be somewhere online if you look it up on Google. I can't say for any other microeconomics professors, but if you don't want to work too hard for a B (or A for that matter) in this class, take Coughlin.", "rating": 4, "expected_grade": "A", "created": "2015-01-12T20:41:00Z"}, {"professor": "Peter Coughlin", "course": "ECON200", "review": "This class was SO pointless. The hour and 15 minute lectures drag on so much to the point that MAYBE 50 people will show up from a 400 person lecture.  The content is incredibly easy, but the midterms and tests are very tricky and do not reflect the easiness of the homework and the lecture content.  He is very condescending to his TAs, but overall seems like a nice guy.  Just very boring and not a good professor.  We only got through 2/3 of the textbook material while other classes (with different professors) got though their entire book and seemed to have legitimate knowledge about the subject, unlike me.", "rating": 2, "expected_grade": "", "created": "2014-12-19T13:16:00Z"}, {"professor": "Peter Coughlin", "course": "ECON200", "review": "Coughlin was just a boring teacher. He actually had to point out which parts of his lecture were not from the textbook. The tests were a little tricky, but only because he didn't provide any good study material. TA's said the best way to study is using questions at the end of each chapter (not aplia), but they never provided us with the answers to those. By the end of the semester 100 people showed up to his 300 person lecture. Not bad for a guy who makes $73k in 2013", "rating": 1, "expected_grade": "-A", "created": "2013-12-27T14:13:00Z"}, {"professor": "Peter Coughlin", "course": "ECON200", "review": "Professor Coughlin is very fair and wants his students to succeed. The course consisted of two midterm, the final, and online homework assignments from Aplia. Each was worth 25% of the total grade. The tests were fairly easy and he curved so the average was a B. He explained the material thoroughly in his lectures, almost to the point where it became boring, but it was very helpful. \r\nI would definitely recommend taking his class.  ", "rating": 4, "expected_grade": "A+", "created": "2013-12-21T18:14:00Z"}, {"professor": "Peter Coughlin", "course": "ECON200", "review": "I liked Professor Coughlin, he did get off topic sometimes and could be a bore but the class material is pretty easy to understand. Be aware that the tests can get tricky so make you actually study. The TA's are really helpful so go to their reviews before the tests.", "rating": 3, "expected_grade": "B+", "created": "2013-01-20T19:56:00Z"}, {"professor": "Peter Coughlin", "course": "ECON200", "review": "While this guy is really nice, he is so boring. He literally regurgitates what's from the book without offering any new insight etc. He talks very slowly. Basically you can read by yourself or with a study buddy and learn twice as fast as the rate he is teaching. I stopped going to class once I realized this ( 2 weeks in)\r\nSome things to note: you don't have to attend lectures or discussions. Some other professors require a clicker but there is no attendance/random quiz. It is straight up 25% HW, 25%", "rating": 2, "expected_grade": "A", "created": "2012-12-30T14:06:00Z"}, {"professor": "Peter Coughlin", "course": "ECON200", "review": "Professor Coughlin is an absolutely wonderful man. Although this class can sometimes be a bit boring, I never dread going, simply because of the teacher. He is incredibly good-natured and deals with his not-so-good audience with humor. He tells some corny economics jokes which make things a little better. Although his multiple-choice tests are quite tricky, I would recommend this professor. Econ 200 is not much work.", "rating": 4, "expected_grade": "A-", "created": "2012-12-03T12:31:00Z"}, {"professor": "Peter Coughlin", "course": "ECON200", "review": "This class was pretty easy for me since I took macro-economics already. He uses powerpoints and slides which make the concepts clear. The homework is fairly easy and counts for 25% of your grade. The other 75% are the 3 tests, which are easy if you get the concepts of the course. If you don't show up to lecture, you won't understand what you're doing. His teaching makes the concepts clear. However, he likes to make corny jokes all the time, which just kills the flow of the lecture. It's very good to read the textbook then go to lecture, I found that helps a lot. A pretty easy class for me, all you have to do is go to lecture and understand the concepts. I barely studied for the 3 tests and got an 88, 97, and 93 respectively. Also, there's a slight curve to the tests, which is always nice. Good class, and decent professor overall.", "rating": 4, "expected_grade": "A", "created": "2012-05-27T16:14:00Z"}, {"professor": "Peter Coughlin", "course": "ECON200", "review": "So fun and funny. Sweet man with a genuine passion for the subject. Taking as an upperclassman makes me appreciate his effort to involve a bunch of uninterested and unmotivated underclassmen.", "rating": 5, "expected_grade": "A", "created": "2012-04-26T16:33:00Z"}, {"professor": "Judith Hellerstein", "course": "ECON200", "review": "A wonderful teacher. Lectures, though long, were always interesting (though somewhat less so if I'd already read the textbook chapter for that day). Coming to class was important - she often deviated from the text, and that material would be on the exams.\r\nThe exams were all multiple choice, and didn't require excessive preparation. \r\nIt's probably a bad idea to bring a laptop to this class - you'll be better off taking notes by hand than staring at the PowerPoint on your screen. ", "rating": 5, "expected_grade": "A", "created": "2012-11-30T14:13:00Z"}, {"professor": "Judith Hellerstein", "course": "ECON200", "review": "A decent lecturer. All her lectures are powerpoints which are online but that being said, there are many aspects of the lecture that are not obvious from the slides, and that she asks questions about on exams. So go to class. She does a good job of explaining concepts and providing good examples. Keep up with the readings and practice problems online, because they really help prepare you for the tests. They are all multiple choice, but not necessarily easy. All the problems require you to think a step further than the homework and practice problems expect you to. The homework walks you through answers, so don't be surprised when tests are more difficult than the assignments. The discussion sessions provide more difficult practice questions that you work through as a class, and is worth attending. I am not an economics major, but the class was pretty interesting, overall. ", "rating": 4, "expected_grade": "", "created": "2012-10-25T12:46:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "One of the best professors I've had at UMD. He explains very complex charts and relations in a very simple manner that makes them seem common sense. He tries to make lectures enjoyable and is very good at what he does. The book is not that boring either so if you get lost, reading up won't be too bad, although the book isn't absolutely necessary because his slides are very good", "rating": 5, "expected_grade": "A", "created": "2012-03-27T00:39:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Best econ class ever. he is funny, explains the material in a very comprehensible manner, and the tests are very very very easy... as long as you have actually somewhat paid attention to lecture/read the text book you'll do just fine. the only problem was the aplia problems. i thought they were more difficult than the exam questions but when i went to get help the TAs weren't allowed to answer our questions. ", "rating": 5, "expected_grade": "", "created": "2012-02-03T23:22:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Sarna is a great professor but the class is difficult.  He's very approachable and will go to every length to help a student.  He relates the class to real life and keeps it interesting.  However, the TAs are absolutely useless.  I went to discussion once and it was a true waste of time.", "rating": 4, "expected_grade": "B", "created": "2012-01-10T02:37:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Great professor. Really no complaints. Clear explanations, clear powerpoints, easier tests than the other sections (i think). Wants everyone to do well and he tells us that he is our \"friend\". Has a slight accent which may be unclear at times but just listen carefully and you will be fine. If you need to take micro definitely take Sarna. \n\r\nI actually ended up with a B in this class but that's because I stopped studying the material towards the end of the final. THat was a mistake. If you keep up with the material there is no reason why you should get less than an A. ", "rating": 5, "expected_grade": "A", "created": "2011-12-25T15:27:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Sarna is a really great professor! Unlike other professors I've had in the past, he really cares about how well his students do in the class and wants them to really understand economics. \n\r\nI ended up getting a C+ in the class (78!!) because i get really bad test anxiety but thats a whole other issue. \n\r\nIf you take your time with the course and look at it simplistically (microeconomics is a pretty simple subject that can get confusing if you think too much about it)you should do fine. His exams are not even directly from any readings from the textbook so mainly pay attention in lecture and/or go to his office hours you should get a B or higher.\n\r\nThe only thing I didnt like was that the other class got to do an extra credit assignment and we didnt! It probably would have brought my borderline C to a B. ", "rating": 5, "expected_grade": "B", "created": "2011-12-20T13:11:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Professor Sarna has a great sense of humor! For Micro, it wasn't really necessary to go to lecture though, because he posts his lecture powerpoints online after class, and they include information that's all in the textbook. \n\r\nHe genuinely cares about his students though! On the first exam, I guess many people didn't do very well, so he dedicated twenty minutes of the next lecture asking the lecture (of over 200) what could make a difference for them on the next exam. We also have mock exams before every exam.\n\r\nHe was a little rude a few times when people asked questions in class, but I think it was mostly unintentional. Overall, good professor and easy class!", "rating": 4, "expected_grade": "A", "created": "2011-12-09T22:33:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Awesome professor, awesome class. Challenging at times, but it's really not that hard at all as long as you keep up with the content. All the topics build upon each other as you progress through the course so just make sure to keep up. Sarna is great at teaching and I definitely learned a lot. If you have an interest or need the course, take it.", "rating": 5, "expected_grade": "A", "created": "2011-12-01T15:15:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "The material is straight forward and he follows the textbook very closely.  I definitely would have skipped lectures if another professor was teaching but he's too funny.  If you actually listen to his lectures, he's a really funny guy, although not always intentionally.  For the first few weeks, he somehow managed to mention Georgetown cupcakes in every lecture.  If you need to take an econ course and he's teaching it, definitely take him!", "rating": 5, "expected_grade": "A", "created": "2011-02-01T23:06:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "How well you perform in this class depends on how much you understand the concepts presented in the lectures. Therefore, attending class is mandatory. Having said that, this class will teach you a lot of things about the world of economics and how they relate to every day's life. \n\r\nThe professor is nice and knows his material. He has an accent but that factor will not stop you from learning what you need to. The power points slides are equally helpful in explaining concepts that are difficult to understand. \n\r\nDiscussions in general are optional. The professor encourages students to attend discussions but I find them very boring and merely reiteration of the concepts the professor has talked about during lectures. Nevertheless, if you don't understand something in lecture, come to discussions for clarification.\n\r\nYou will have several problem sets during the course which will be online. I suggest you start them early as some questions might take up a bit of time. The course has a midterm and a final, they are straightforward and cover the topics have been talked about during lectures. \n\r\nI personally recommend this class because it can be very interesting once you understand the concepts and able to make the connections from the classroom to everyday's life.", "rating": 4, "expected_grade": "B", "created": "2010-12-29T02:21:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Professor Sarna was a great teacher. For my first time taking Economics, I definitely learned a lot and it was not at all difficult. In this class, we had homework every other Sunday and only 2 tests throughout the year and one final. The final wasn't cumulative. All of his lecture slides are online. I never went to discussion because I didn't need to because he taught everything well in class. This class did not give me any stress.  Definitely take him for Economics!!!!!", "rating": 5, "expected_grade": "", "created": "2010-12-12T02:59:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Professor Sarna was great for my first experience learning economics. He explains the material clearly, and always adds in little jokes to keep the class intresting. All the matrial can also be learned from reading the textbook and reviewing his powerpoint slides which he posts online, so its not a big deal if you miss a class or space out. His tests are very fair and if you understand all his powerpoints, you will do fine. I'm definitely taking him for ECON201 next semester. Discussion is pointless. I only went once this semester. ", "rating": 5, "expected_grade": "A", "created": "2010-12-02T21:57:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Professor Sarna did a great job of making economics interesting and understandable. He takes difficult concepts and breaks them down into simpler analogies that are easier to understand and relatable. His tests are generally 45 multiple choice questions and very straightforward. He genuinely wants everyone to do well. In addition to the tests there are online assignments through aplia every other week which are worth 25% of the your grade. These are also generally very straightforward and it is not hard to do well. He posts all his lecture slides online, and his lectures follow the textbook. I really enjoyed going to lectures. Overall i really enjoyed this course and would highly recommend Professor Sarna. ", "rating": 5, "expected_grade": "A", "created": "2010-12-02T18:29:00Z"}, {"professor": "Daniel Vincent", "course": "ECON200", "review": "Let's get this straight: Vincent is an awful professor. He reads off of his powerpoints (which have all been posted online in the beginning of the semester) and at some points, he even reads his jokes off of them! \n\r\nTAs are usually extremely unhelpful - seriously, you are on your OWN in this class. Read from the textbook, memorize it, and complete the problem sets - that's pretty much all you can do. I recommend him if you are prepared to teach yourself the basics of micro-economics. ", "rating": 2, "expected_grade": "A", "created": "2009-05-06T11:18:00Z"}, {"professor": "Daniel Vincent", "course": "ECON200", "review": "Class is easy, but lecture might be one of the most difficult things to stay awake in. He is mind-blowingly BORING. I went to class 4 times (for the 3 tests & final) and discussion once and never returned - hopefully your TA speaks english but thats a 50/50 chance they wont. Doesnt matter though I did well on everything.\r\nReview the slides you will be good. The weekly online homework is a necessary to ensure you will understand the concepts.", "rating": 3, "expected_grade": "A", "created": "2009-04-29T02:39:00Z"}, {"professor": "Daniel Vincent", "course": "ECON200", "review": "I couldn't really tell you anything about the professor since I never went to class, but this class is one of the easiest you will take at maryland. The assignments are all online, and if you struggle the TA's for your discussion are very helpful. So I can say that he has a very organized class since I never had to go but knew what to expect on exams and how to do my homeworks. ", "rating": 5, "expected_grade": "A", "created": "2007-12-05T02:08:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "While his voice might be boring, it is the only class that I haven't missed (and it's not just because of the clicker points). I look forward to this class every time I go because he is so straightforward. He does not want to trick you. He is no nonsense, no frills, but he does attempt to be funny. This is an easy class, and he doesn't try to make it anything but that. This is a class you can just sit back and listen to. The concepts are so easy to understand that I use this class as a time to relax. I would recommend him to anyone. There are very regular homeworks, but doing them just helps reinforce basic concepts (and boost you grade). ", "rating": 4, "expected_grade": "", "created": "2016-04-16T00:45:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "I'm currently in Schwab's ECON200 blended learning course and I find it bearable. I'm not very interested in economics, but he gets that a lot of the class is forced to take it and tries to be funny. A few things worth knowing is that you have clicker questions every lecture class, discussion is kinda useless and I seldom go, Schwab does not like people leaving early at all, and he put up past exams on Elms to study from, which I used. There's a lot of resources made available to help you. If you can take it with Schwab, I recommend it.", "rating": 5, "expected_grade": "A-", "created": "2016-03-27T19:20:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "DO NOT TAKE ECON UNLESS YOU HAVE TO. ECONOMICS IS A BITCH. Also, THE most boring processor EVER. Unfortunately going to lecture is a must because of clicker questions, making this class almost unbearable, especially since he posts his power point slides online anyway. I couldn't tell you what he said in a single lecture, i sat in the back and did work that actually mattered. He's a nice guy, but his teaching methods are extremely ineffective. Listening to him longer than 5 solid minutes WILL put you to sleep on the spot. ", "rating": 1, "expected_grade": "", "created": "2014-05-13T12:31:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Schwab is a dork and hes personable but.. SOOO BORING!!!! you won't pay much attention in lecture unless you sit in the front, so if you want to pay attention, sit in the front row. There is a lot of work that comes with this class and it definately boosted my grade in the end so make sure you complete the online work. The exams are fair - I am not an econ person so to me they were kind of hard. This semester, an 85% was an A and 75% B. There is a lot of help provided so if you need help like I did, seek it!", "rating": 4, "expected_grade": "", "created": "2013-05-16T01:05:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Bob Schawb was a good professor. He's got a great sense of humor and it makes class much more bearable. Classes are important to go to because of the clicker questions, which make up a small, but very easy, part of your final grade. \n\r\nClasses are boring, but if you can read the books and do all the Aplia problems, you should be fine. Tests were sort of challenging, but he eventually caved and decided to curve our final grade so that an 85 would be an A-. \n\r\nDefinitely a good class, Prof. Schwab is a great guy and while very boring at times, paying attention is never really 100% necessary. ", "rating": 5, "expected_grade": "", "created": "2013-05-05T15:48:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "i enjoyed most of his lectures. he was a good professor and really nice in office hours. do good on the exams. the final is more difficult than i thought it would be, but he ended up curving. i don't know much about other econ200 professor but if you try hard, you will do good in this class.", "rating": 4, "expected_grade": "B", "created": "2012-06-08T00:55:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Prof. Schwab is HILARIOUS! He's this dry-humored, sarcastic old man. Sort of like your grandpa on coffee. \n\r\nI took the Blended Learning section, new this semester. The grade was based on clicker questions, simulations (game-like things you do on APLIA wherever you want instead of coming in for discussion), problem sets, pre-lecture quizzes and 3 tests. \n\r\nIt was really cool being able to roll out of bed Friday morning and just logging into APLIA to do the simulations instead of having to trek to Tydings for a discussion section. That being said, though, there were a lot of electronic issues in the beginning of the semester that I imagine should be fixed if they do the Blended Learning section again.\n\r\nHe sets a very generous curve for the class, and both he and the TAs were extremely welcoming/helpful. They invited students to come talk to them or post questions on the discussion board, which the TAs monitored regularly so that they are answered at least by midnight the same day.\n\r\nTests were fair; no trick questions in general. But like I said, if he noticed a problem with some of the questions, he set a generous curve. \n\r\nGoing to lectures were worth it, especially paired with the pre-lecture videos you have to watch online before class (about 10-15 min. each, so not that long). I only had to read the book to clarify some concepts for myself, but if you do all three there's no reason you will do badly in the class.", "rating": 5, "expected_grade": "A", "created": "2012-05-18T20:32:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "I thought this class was relatively easy. You have to do about 6 aplia homework problems and take 3 tests and a final. The tests are not hard and he covers all the material. Schwab is not a bad professor but the lectures are pretty pointless. \n\r\nThe final is terrible! I had an A in the class until the final. He swears the final is cumulative except all of it seems to be on game theory. ", "rating": 4, "expected_grade": "B+", "created": "2011-05-10T19:19:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "I thought this class was extremely easy. You can either read the book, go to class, or listen to his recorded lectures, but you certainly don't need to do all three unless you want to really reinforce the material. As mentioned below, you don't need to attend discussion sections either. The final did seem to be harder than the other tests, but overall I thought all the tests were pretty straightforward.\n\r\nTo study for the tests and to see what he wanted you to know most, I just reviewed the powerpoint slides and the aplia homeworks, and that basically gave me the best idea of how to study.\n\r\nIf you struggle with interpreting graphs, then the class may take some work. But if not, it's pretty simple and isn't too time consuming.", "rating": 5, "expected_grade": "A+", "created": "2010-12-30T19:15:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Professor Schwab is a very straight forward teacher but this is NOT an easy A class. You really must study hard for the exams and genuinely understand the material in order to get an A on them and our final was much more difficult than either of the exams. The one nice thing is that you really do not need to go to your discussion section since they do not take attendance and just go over the problem sets (which you can do on your own as a study method and the answer keys are online). Another good thing actually was that Schwab is really nice about using his own time the night before the exam to hold a Q+A session. It's a fair course but really put in a fair amount of effort to get an A.", "rating": 3, "expected_grade": "A-", "created": "2010-12-27T00:41:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Avoid this professor. There is no mercy. First two exams were EASY. He posts recorded lectures, so you don't have to go to class. Discussion is not required. You will be graded only by exams and homework, which is really easy. You can just go take the exams. But don't never ever expect the same difficulty for the final exam. Compared to previous 2 exams, it was really hard. You have to train yourself for deeper insights to do the final exam, and first 2 exams wouldn't make you ready for it. I got As in first 2 exams, and C+ in the final exam. I needed 0.4 points (which is somewhere around 0.0x%) for an A, but he won't do anything for it, nor the TAs can do anything. If all you need is decent grade, I recommand this course. But never expect any rounding up; reaching to the next grade so close would not give you what you expected.", "rating": 1, "expected_grade": "B+", "created": "2010-12-18T16:45:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Even though I am getting a B, this class was really easy. I never went to lecture because Schwab puts everything online, by everything I mean even the recordings of him talking are online. Also, you do not need to go to discussion because the answers to the problem sets are also online. Just look over the past exams and know key terms and you will get B's on the exams. The homework is really easy, they are online and only take about one hour, and there is only 6 the entire semester. ", "rating": 5, "expected_grade": "B", "created": "2010-12-10T15:08:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Proffesor Schwab is a good teacher. He explains the material well and shows how the material relates to real life situations. He also has a good sense of humor. He puts his power points and old tests online which is helpful. If you miss a class, it is realtively easy to make up the material; however, if you want to get the highest grades possible, I advise going to class.", "rating": 5, "expected_grade": "A", "created": "2010-12-07T13:40:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Bob Schwab is a very entertaining teacher.  His class is not very difficult if you go to class.  The Discussions are worthless if you go to class.  My TA barely spoke English, but it didn't matter cause Schwab is that good of a teacher.  Take him if you can.", "rating": 4, "expected_grade": "B", "created": "2010-12-04T23:50:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "BOB SCHWAB! He's pretty funny and a great guy, but he can be a little dry in lectures. The key to his class is to actually do the work expected of you (ie. read the book!) As long as you keep up with the textbook and his lecture notes, it's easy to do well in this class. Many of the TAs are very knowledgeable (and if you get a bad TA, they're really nice about letting you switch sections due to a \"scheduling conflict.\") \r\nI really enjoyed his class and found the information interesting and challenging, but never daunting. I recommend Schwab if you're a motivated student, but if you plan on skipping lecture and coasting through the class, you may want a different professor. ", "rating": 4, "expected_grade": "A", "created": "2010-04-07T17:10:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "ECON200 is just boring and Schwab doesn't help much.  His slides are completely white with some poorly drawn graphs.  Every time I went to class I fell asleep and I never went to discussion (my TA was completely useless).  Homework is given maybe one every two weeks or so, and generally you don't have to work very hard in the class.\r\nWith the first exam I did pretty poorly, low C, but luckily almost every test has a 10point curve.  The rest of the exams I did very well, the trick to this class is to read the book and take notes from there.  It is alot to read and it is very boring but that is what it took for me to get an A.  I'm sure I could have gotten an A much more easily if I could stay awake in class (it wasn't even an early class) but the material and the way it was presented was just way too boring.\n\r\nTo summarize ECON200 isn't hard as long as you put in the effort.  Schwab isn't a bad professor, he grades fairly and is knowledgeable with the subject.  His lectures are just bland and boring.", "rating": 3, "expected_grade": "A", "created": "2010-02-21T14:24:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Schwab is by far my favorite teacher ever in college. Not only did he make ECON200 as interesting as possible, despite it being a boring course, he legitimately cared about the students doing well. His lectures were very simple and easy to understand, so if you actually show up/ pay attention it should be no problem to do well in this class. The exams were very fair, with the problems being provided ahead of time. If you study, read the book, come to class, and practice the discussion problems this class should be very easy. ", "rating": 4, "expected_grade": "A", "created": "2010-02-04T18:48:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "If you are taking this class as a core requirement,I advise you to not. Econ is a tough subject, so it is not worth taking if you do not plan to use it within your major.It is your best option to just choose another class that fulfills that core. With that said, if you must take econ 200, do not take it with Scwab. Clement, who taught econ200 the same time as schwab gave out much easier exams and homework problems. Schwab's exams consisted of multiple choice and problem sets whereas Clement only have a multiple choice. With problem sets, if you get the first part of the problem wrong, you will get the rest wrong. Overall, this was my toughest class for my first semester, and the last two and a half weeks i spent in the library. With hard work you can receive a passing grade, it is just whether you put forth the effort in schwab's class. If you take econ200 with schwab, make sure you know how to teach yourself and read the book. Lectures are boring, but he is extremely knowledgable in econ. Nice guy, tough class, but you learn a lot.", "rating": 3, "expected_grade": "B", "created": "2010-01-12T17:34:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "I have to admit, I did not put in the work necessary to succeed in the class. Econ has never really clicked for me in high school or this past semester, so I ought to have worked harder. I definitely coasted and got a B. \n\r\nDr. Schwab, though humorous and well-meaning, is quite a boring lecturer. I sometimes found myself waking up 20 minutes after putting my head down for a tiny rest. His powerpoints are drab and not very informative - this is where the book comes in. Read it, outline it - I didn't! Also, go to discussion, even if you skip lecture. The discussions go over problem sets that are almost identical to exam problems. \r\nAn average class for a subject that is not very engaging for me. Schwab is obviously very, very knowledgeable, but not a stellar professor. Perhaps those who like economics more would disagree.", "rating": 3, "expected_grade": "B", "created": "2010-01-04T22:39:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Dr. Schwab is a really fair professor. His class truly is NOT DIFFICULT AT ALL if you put in the work. I was most successful learning from the book. I did very poorly on the first test because I didn't study enough, but I got a 97 on the second test and an A on the final because I read the book carefully. The problems sets for discussion EXACTLY mirror the free response on the test. Low scores on the test indicate that you haven't been putting in the work (as I hadn't been in the beginning of the year). I didn't make the A by 3.65 points (.01%) and Dr. Schwab couldn't do anything about it, but with consistent effort, you can easily get a good grade in his class.", "rating": 4, "expected_grade": "B+", "created": "2010-01-04T22:18:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "This class was miserable. I usually always goes to class but he put me alsleep and I gave up half way through the semester. I knew this would happen as he made a comment early in the year that at the end of the semester about 50 people out of the 200 in the lecture hall attend???? TA's are just ok, make sure you get a good one. I failed both tests and the final, but got a 100% on the MyEconLab and got a C. ", "rating": 2, "expected_grade": "C", "created": "2009-12-23T01:01:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "He tries to make lecture funny, but it is difficult to pay attention. Most of the multiple choice on the exams can go 50/50 and usually its not a great outcome since the MC are about 3 points apiece. However, the problem sets do help.\r\nDiscussion does not, but he does post the answers to the discussion sets online, and the exam long answers are almost identical. \r\nHard to pay attention, but really he makes it as good as it gets.", "rating": 3, "expected_grade": "", "created": "2009-12-08T20:34:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Professor Schwab is an entertaining, funny man. He made the entire room chuckle at least once per class. However, he often goes off on pointless tangents and most of his lectures don't really teach anything. The exams aren't hard, but the most people do terrible-the averages are around 60 or 70. He does scale, but its frustrating working hard and doing poorly, especially when every other class has much higher averages. That being said, the TAs can be really helpful (Alam is the best!) and the problem sets are exactly like the ones on the exams. He's not the best, but don't sweat it if you have to take his class, you'll at least get a few laughs.", "rating": 3, "expected_grade": "B", "created": "2009-12-07T19:37:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Professor Schwab is such a good professor. His class consisted of 2 exams and a final and 6 online homework assignments (unlimited attempts, so easy 100). He is funny and tries to make class interesting. His exams are very fair if you pay attention, study a little and go to discussion. The averages for the exams were pretty low (like 67 on the last one), but really, they were fair.\r\nHe's a great professor. Take it with him if you can", "rating": 5, "expected_grade": "A+", "created": "2009-12-06T06:41:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "LOVED this class. Bob Schwab is one of the best teachers I have ever had. His exams consisted of multiple choice (which were pretty tough) and problems. In discussion, we got almost identical problem sets, so the exams aren't hard. \n\r\nIf you got to lecture and discussion and take notes on the powerpoints, you'll do fine. I outlined the chapters also, which helped too. Honestly, there is no reason for people to be getting D's and F's on exams. All of the info in Schwab's powerpoints are clear and he's always willing to answer questions. ", "rating": 5, "expected_grade": "A", "created": "2009-12-03T18:55:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "THIS MAN IS AWESOME!  He actually wants his students to do well. The test are pretty fair. Nothing too difficult if you study his lecture slides. Take good notes on the slides during the lecture, that always helped. And go to discussion!! The discussion problems are VERY VERY similar to the ones on the test. I know that some students aren't doing well, but if you put in the time and effort, it shouldn't be too bad. Just study the problems, his slides, and read the book chapters like once. Plus Schwab sometimes tells hilarious corny jokes in class, so its interesting! haha", "rating": 4, "expected_grade": "", "created": "2009-11-26T09:40:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "Gives 10 aplia homeworks, 2 of which are dropped. Two exams and a Final. One of the exams will be dropped and the weight added to your final if your grade on the final is better than that exam. 68% of the grade is tests and 32% is homework. The homework is almost a guaranteed high A, so basically you have to average an 85 on your tests to get A, because there is no curve of any kind.\n\r\nGandhi is a good teacher, she posts lecture slides online, but you still should go to lecture because she will put some blanks on the online slides that you can only get by seeing them in class. Alternatively, you can just copy from a friend. She also is an enthusiastic lecturer. I'm an engineering major, and I felt that material was very easy, if you don't get an A or B in there you can only blame yourself.\n\r\nOnly problem I had was that it usually took two weeks to get test grades. Other than that, I didn't have any issues with the class.", "rating": 4, "expected_grade": "A", "created": "2011-12-09T21:27:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "too crowded\r\nTAs are bad\n\r\nother info is already provided by other peers\n\r\ntake it from the community college", "rating": 1, "expected_grade": "", "created": "2011-10-10T16:05:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "First I just want to say I found economics extremely logical so if you can think logically econ will be easy.\r\nIt was very important to go to lecture because gandhi(no accent) explained how to answer questions on her tests during lecture (she was very picky about how you draw graphs especially).  She also introduces some stuff during lecture that the book doesn't cover very extensively. \r\nThe book that gandhi uses was fantastic (I believe it was Principals of Microeconomics by Mankiw). [Hint: read book before class to understand concepts and then go to class to learn how to apply the concepts, gandhi complements this book very well]\n\r\nAlso she posts her slides from lecture, but most of the important stuff from the slides is missing (the slides are meant to be a layout so you can print them out and use them as a lecture note guide).\r\nThere are 10 online homework assignments each worth 4% of your grade (2 dropped) and 2 midterms each worth 19% of your grade (One can be dropped if your final exam grade is higher) and a Final exam worth 30%.  The homeworks were pretty easy (given through aplia which is like a very nice and forgiving webassign) most of the homework questions allowed you 3 tries to get the answer correct.\r\nThe midterms were 10 multiple choice and 5 short answer (graphs calculations and sentence answers), 60 points total.  This means you have little room for error, but it also makes it easier to get high grades (i got 95% and 100%) because it gives you lots of time to review your answers (Hint: check you answers don't just leave, she is tricky!) \r\nFinally you can go to any discussion you want, so it doesn't matter if you have to sign up for a 8am one or anything like that. (also discussion wasn't very helpful, just go to office hours if you have a question, gandhi is very nice in office hours)", "rating": 4, "expected_grade": "A", "created": "2011-05-23T16:13:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "Honestly Professor Gandhi is the best professor I have at UMD. I took this course with her spring 10 and never went to lecture and got a D. I had freshman forgiveness and retook it this semester determined to get an A. Going to class is key - she explains everything in class, takes questions and is really pretty fun. Yes, econ can be difficult but Gandhi goes above and beyond to help her students. I don't think she is going to curve my class but that is only because she lets us drop 2 of the 10 hws and a midterm grade if we beat our lowest grade on the final. She always answered my questions within hours and was genuinely a nice person. Having a professor like her makes me want to continue pursuing econ just to be able to take another class with her. Just study hard and don't blow off class - if you put the effort in you will get the grade you want.", "rating": 5, "expected_grade": "A", "created": "2011-05-18T00:56:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "Professor Gandhi is a great teacher. I don't like economics, but I really liked her. She was very funny and she stopped in the middle of lessons to answer all questions. She does not post her slides so GO TO LECTURE! She is always available to talk after class or during office hours too. Her grading system is pretty good too. She drops the lowest homework and quiz scores and if you do bad on one of themidterm test,she'll drop it and add the weight of it to your final exam if that'll help your grade. I went from a 74.9 to a 86 in that class once she dropped my lowest quiz and hw and dropped my lowest test to add to my final. The class average was a 78 so she didn't give us a curve, but at least the class average was good enough to be a c+. Great professor and overall pretty good experience.", "rating": 5, "expected_grade": "B", "created": "2010-05-24T00:25:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "Gandhi was a pretty good professor, she explains stuff well and tries to answer all questions. Sometimes she does move a little too quickly in class, and doesn't post her powerpoints. \n\r\nThe online homeworks are easy, but the online quizzes can be tricky sometimes. Her midterm exams are pretty difficult, but her Final was cake. Just study and you'll be fine.", "rating": 4, "expected_grade": "A", "created": "2010-05-22T23:48:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "Gandhi was a pretty good professor.  She's kind of funny and seems like a pretty cool lady.  Her lectures were pretty boring, but that's only because the material was boring.  She did her best to make micro seem interesting, but it just wasn't.  \n\r\nDiscussion sections are completely useless.  I went to the first one and then never went to another one.\n\r\nThere were 5 online quizzes and 5 online homeworks, one of each which is dropped.  The homeworks were easy because you get as many tries as you want to get the right answer, but the quizzes were pretty tricky.  The exams were kind of hard, but she curves them at the end and she has a system where if you do better on your final than one of your exams, then she'll drop the regular exam and add the weight of that to your final.", "rating": 4, "expected_grade": "", "created": "2010-05-16T15:38:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "I don't really like the subject at all, but she explains the subject clearly and addresses individual questions and concerns well. If you go to class and do the hw, it's not too bad", "rating": 4, "expected_grade": "A-", "created": "2010-05-12T20:04:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": " Professor Gandhi is an amazing professor and I would highly recommend her for this course. She does great job in helping the students understand the material and the concepts. \n\r\n Her exams are generally easy and she curves but you should still study really well . When studying for these exams, you should first understand the concepts and then go straight to the problems. She posts homework and quizzes online ( which you should prep for) but are really easy.\n\n", "rating": 4, "expected_grade": "B+", "created": "2010-05-10T23:46:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "Gandhi is a really good teacher! She explains things well and is willing to spend extra time going over the material in order to make sure that everyone understands. The tests are somewhat difficult, but if you understand the material well it's not too bad. There are 2 exams and the average on each test was around a 63, but she does curve at the semester AND she will drop one test for you if it benefits you at the end of the semester! If you have to take econ200, definitely try to take it with Gandhi!!", "rating": 5, "expected_grade": "A", "created": "2010-05-04T15:48:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "She's cool and funny but her class put me to sleep.  No powerpoints online but she caters to each individual student well if you talk to her.  She probably isnt #1 but be happy if you have her", "rating": 4, "expected_grade": "B", "created": "2010-04-18T12:00:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "Dr. Gandhi is a GREAT professor. She teaches off of her powerpoint slides (which, unfortunately, she does not post online...but she does post the powerpoint slides for the textbook online, which are useful if you want a quick summary of each chapter if you don't feel like reading it). She makes micro-economics very easy to understand because of her teaching style and her use of numerous examples. You probably don't HAVE to come to class, but if you do, her numerous examples and clear explanations will definitely reinforce your understanding of the concepts.\n\r\nHomework is a pretty big part of your grade, but they're usually easy if you pay attention in class and skim through the textbook chapters.\n\r\nHer exams were unusual. They were out of 78 points; each multiple choice question were worth 3 points, and each short answer questions were worth 6 points. This was probably the only thing that bothered me. If you get a few multiple choice or short answer questions wrong, you won't get an A on the exam.\n\r\nOverall, she's an excellent professor. She acts very cool, is very comfortable lecturing, and her side remarks are funny. Contrary to what people may assume from her name, she does NOT have an accent. None. Nada. Take her classes if at all possible.", "rating": 5, "expected_grade": "A", "created": "2009-05-21T19:06:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "The teacher had great explanations, going to class was better than reading. Usually about half of the class of 300 show up for the lectures. She drops either two homeworks or quizzes, which is nice, but sometimes her multiple choice is really tricky. I didn't study for the first test, but went to all the lectures and I got an 86 on it. She also drops an exam and counts the final as more if it helps your grade. The only thing I didn't like about her tests was each question was worth at least 3 points (and it wasn't out of 100) so missing two was the most you could miss on multiple choice to still get an A. She was interesting as a teacher, I would take her again.", "rating": 4, "expected_grade": "A-", "created": "2009-05-18T13:26:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "#1 choice for ECON200.  Excellent teacher.  She knows her material and explains it all in enough detail for you to fully understand the concept and she is very responsive to questions if you still aren't getting it.  If you simply attend all the lectures you will have no problem getting close to a 95% in the class.  Minimal HW and very doable tests.  ", "rating": 5, "expected_grade": "A", "created": "2009-05-01T08:18:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "Dr. Gandhi is a great professor. She knows her material backwards and forwards and answers any and every question in lecture. There were only 2 exams and 3 quizzes during the entire semester, and a homework set every other week. \n\r\nShe's brilliant and makes ECON200 interesting. As long as you go to class, you will learn and understand all the material (and if you don't, she's more than willing to answer every question). I recommend this class, even if it's just for a CORE.", "rating": 5, "expected_grade": "", "created": "2009-04-30T15:38:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "Professor Ghandi is a GREAT professor!! I HIGHLY recommend taking her class. For econ200 she explained the material in detail and answered any questions if anyone was unclear about anything. It was a discussion based class so it was very easy to ask questions and have them answered. There was NO APLIA, instead she gave weekly quizzes that were only on material that she reviewed in class and you she also reviewed the material right before the quizzes.  She posted on blackboard practice quizzes, worksheets, and exams that were VERY helpful. And she was always available outside of class if you need extra help.  In addition, she is very patient and does not get frustrated when asked a lot of questions from students.  Overall, she is a GREAT professor that makes the subject VERY interesting even for those who are not econ majors. I LOVED THIS class! If possible try to get her as your econ200 professor, you WILL NOT regret it.", "rating": 5, "expected_grade": "", "created": "2007-12-20T20:33:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "Professor Gandhi's class was fantastic. She is very knowledgeable, clear, easy to follow, and always willing to help if anyone has questions. She makes the subject lively and relevant to real life. I always thought economics would be a dry course, but she made it fantastic.\n\r\nShe gives weekly quizzes which are very straight forward. Exams are very clear, too. She offers practice assignments, quizzes, and exams online that are all helpful. She is very reasonable about grading. If you attend lecture, most everything will make sense and if it doesn't, she'll clarify in a moment.\n\r\nI definitely recommend Professor Gandhi. Her class was  great. ", "rating": 5, "expected_grade": "A", "created": "2007-11-29T16:04:00Z"}, {"professor": "Alka Gandhi", "course": "ECON200", "review": "Gandhi is so great.  Even if the section that she is teaching is at a time that you don't really want, it's worth it to take the class with her. \n\r\nShe knows what she's talking about, she's funny and very approachable.  She's the type of professor that will go over something as many times as anyone wants and not get frustrated.  Before quizzes she'll ask -- as she has them in-hand -- if there are more questions.. and people ask! and she clarifies! And she'll keep going until people don't raise their hands anymore.\n\r\nShe explains things a bunch of different ways so that if you don't get it the first time you might get it the second.     If you go to class and take notes you will get it.. there's no memorization, you will just get it.  For ECON200 (although she's not teaching it in Spring '08) I didn't need the book, just  notes.  And I have heard from all people who have taken ECON200 that you don't go to class, just read the book.  Well, she is so good that our ~50 person class was full all the time.\n", "rating": 5, "expected_grade": "A", "created": "2007-11-05T11:11:00Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "Love Schwab, he has a dry-sense of humor. There were definitely times I found myself dozing off in his class however because of the tone. But he does do a great job at answering questions.", "rating": 4, "expected_grade": "B+", "created": "2017-12-22T02:10:35Z"}, {"professor": "Robert Schwab", "course": "ECON200", "review": "ECON200 is inevitably boring, but Schwab at least tries to make it engaging. He's a decent lecturer and reasonably funny, but his habit of calling out people who try to leave early gets old and annoying fast. Exams are very fair and are similar to the past exams he puts up on ELMS. All in all, ECON200 is a fairly easy class, and I would recommend taking it with Schwab.", "rating": 4, "expected_grade": "A", "created": "2018-04-11T22:26:22Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Gives a lot of opportunities for extra credit and posts slides/practice exams online. Everything on the exam is in the slides and lecture. \r\nShe says to read the slides before class, but it's useless since she just reads the slides and draws a graph. No new information is given in lecture - there's extra credit in class though. \r\nShe uses LearnSmarts - so don't bother reading the textbook more than highlighted portions online. You don't need a physical copy of it. \r\nHer voice is annoying and the class is kind of boring. Make sure you're in the class group chat. ", "rating": 4, "expected_grade": "", "created": "2018-06-24T16:44:14Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "I really appreciate her bubbly personality that comes out during her lectures.  The material is dry but she conveys it well and offers plenty of assistance.  She drops a few of your lowest grades in assignments st the end of the term to help people out.", "rating": 5, "expected_grade": "B+", "created": "2018-10-18T18:31:39Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I thought Abbasi was a good professor. Not great, but also not bad. Most of the students in my 300-person lecture could care less and only came because we had participation points (clicker stuff). I did pretty well in the class, but the average grade was around 80%. He explained things clearly with emphasis, but sometimes you tone out to his voice. ", "rating": 4, "expected_grade": "B", "created": "2019-02-28T14:54:48Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Totally fine. Had clickers (which you could do from your phone put I think they would be more difficult if you weren't in class). First exam had some grammatical errors but late midterms were fine. Lecturing covered what it needed with appropriate emphasis according to the importance of the topic. Solid choice for professor (just don't disrupt class).", "rating": 4, "expected_grade": "A-", "created": "2019-04-11T14:41:27Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Great teacher, very understanding and explains material well", "rating": 5, "expected_grade": "", "created": "2019-05-13T22:15:18Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "our class was not the biggest fan of him. personally i hate large lecture classes but if you like economics take this. if youre looking for a gen-ed to fill, do not take this, i made that mistake and wish someone had told me earlier", "rating": 2, "expected_grade": "B-", "created": "2019-12-06T00:42:30Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "classes were boring, reads from the powerpoints, exams are impossible to study for ", "rating": 1, "expected_grade": "B+", "created": "2019-12-17T22:44:50Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I found professor Abbasi to be very good. What was helpful is him posting all of the lecture notes, so if you miss something in class you can easily go back and take notes. He also posts practice exams which reflect the level of difficulty that you will face on the actual exam which is helpful. I think the exams were fair, but you have to put in a good amount of work to get an A in the class. Abbasi is approachable so you can easily reach out to him in person after class or during his office hours, or simply email him with any questions or concerns.", "rating": 5, "expected_grade": "A-", "created": "2019-12-22T18:03:16Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Terrible. Her exams are 100x harder than class material like homework and smart books. The GSS sessions, TA sessions and practice problems are no match for her exams. Doesn’t seem to care because she barely responds to emails. Only 1 hour for exams please dont take her. ", "rating": 1, "expected_grade": "W", "created": "2020-11-25T20:21:13Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I'm actually doing ok grade-wise, but I admit I've gotten lucky. She doesn't listen to her students and the majority of the class is severely struggling (averages are typically around 70-75).", "rating": 1, "expected_grade": "A-", "created": "2020-11-30T22:24:30Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Please do not take her. Smart books and homeworks are no match for test material. If you reach out to her she’s either not going to respond to your email or she’ll reply with something that doesn’t help (in reference to grades) GSS sessions barely help. It’s like she purposely makes the exams so difficult for what reason I dont know. I would’ve been able to get by with at least a C if the exams weren’t rigorous and if we had longer than one hour. All in all, it didnt seem like she cared much. Even when other students would ask questions during zoom calls.", "rating": 1, "expected_grade": "W", "created": "2020-12-02T22:14:02Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "People exaggerate the difficulty of this class. With that being said it is a 200 level class, not a 100 level. Overall exams are not too bad if you actually study. The busy work seems dumb but honestly it drills the content into ur head. She's a pretty good teacher but does get frustrated with students sometimes.", "rating": 4, "expected_grade": "A", "created": "2020-12-04T02:50:11Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "He handled online classes really well and was a very good lecturer. Boring at times but very accessible and accommodating.", "rating": 4, "expected_grade": "B+", "created": "2020-12-04T21:40:44Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Thought she was a decent professor; make sure to take good notes since tests online are open note & almost all multiple choice, and if you take this course with no econ background, be prepared for a lot of graphs and be ready to analyze graphs in 30 seconds during a test possibly. Definitely a good course but I know a lot of kids complained about the pace of it, which I thought was pretty decent for a freshman taking a first-time college course; you teach yourself the content with the online textbook and then she goes over it in class to really get in your head which I liked; would reccommend!", "rating": 4, "expected_grade": "A", "created": "2020-12-05T01:25:50Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I want to cut her some slack because it's her first semester dealing with this many students and having it online doesn't make it easy, but she was very ineffective as a teacher this semester and at least some of that is due to the online nature of the class to be fair. Do the readings and study them hard if you haven't taken micro before and you'll be fine, but I know I'm only doing well right now because I took Econ in high school.", "rating": 2, "expected_grade": "A-", "created": "2020-12-08T15:30:32Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Tests are very fair and you don't have to do much studying. Just to the homeworks and the smartbook assignments and you're good. You don't really have to pay attention to the lectures most of the content can be self learned. She knows what's she's talking about but gets kinda annoyed if you ask obvious questions.", "rating": 4, "expected_grade": "A+", "created": "2020-12-09T17:28:27Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I’m a little annoyed by the people saying “just study and you’ll be fine” “we’re exaggerating””..More than half of the class is struggling at a borderline C/D...stop giving bias reviews if you’re already a pro at Econ. “Obvious questions”?? Econ is hard what other times do we have to ask questions if she doesn’t respond to emails? The pace wasn’t the issue the lack of assistance, help, matching test questions was the issue. Homeworks and smart books were annoying but do-able....Exams were a entire different thing. She could improve a lot of ways for the next round of students.", "rating": 1, "expected_grade": "W", "created": "2020-12-10T17:47:02Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "He’s a really good lecturer. Workload is kinda heavy but exams aren’t awful", "rating": 4, "expected_grade": "B", "created": "2020-12-15T00:26:20Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Assigns 1-2 textbook chapters every week. Chapters are not long,  each one takes like 1 hour to finish if you read thoroughly. She goes over the material from the readings in class and records them. \r\n\r\nHW consists of Connect and Smartbook questions. Smartbook is a bunch of multiple choice questions based on the reading, but it's basically completion cause the questions are easy and you can get a bunch wrong and still get full credit. Connect questions are like problem sets, which can take a little while to finish and can get tricky, but prof drops lowest two connect and smartbook assignments, and you get 2 submissions per assignment, so there's some leeway if you mess up. \r\n\r\nIn class quizzes are assigned every week, but you get 2 attempts per quiz and prof gives you a chance to talk in groups about the quiz after the first attempt. \r\n\r\nExams are all multiple choice. If you don't know the material well then you're fffffffucked, but all you gotta do is study well, go to GSS, and go over past HW's and most importantly understand the material and you'll easily get a B+ or above every time. \r\n\r\nTo be honest, contrary to my peers, I really liked the class. If you're good at teaching yourself, you like economics, and you have an interest towards the subject, you will most likely get an A and learn a good amount. However, I can't say much about the professors teaching abilities because I mostly learned from the readings and HW assignments. You'll probably eat shit if you're looking for a loaf class and/or you rely on the professor to teach you most of the info. \r\n\r\nP.S I took this class during rona szn ", "rating": 4, "expected_grade": "A+", "created": "2020-12-16T02:06:12Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "The exams are typically easy if you know the content, and she lectures well, if you pay attention and take good notes you’ll do fine.", "rating": 5, "expected_grade": "A", "created": "2020-12-17T01:36:12Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "She is one of the most organized teachers I've dealt with but does not take constructive criticism well. Overall the class is fairly easy if you put in the work you're supposed to. I was lucky and had a background in microeconomics before taking it so most things were not new to me. She understands what she's talking about but the execution of her teaching style did not always go well with students. It was her first time teaching such a large lecture AND it was online so got to cut her some slack there. ", "rating": 3, "expected_grade": "A-", "created": "2020-12-17T02:08:43Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "(I took this class completely online.) This was a surprisingly difficult class for me. I put in a considerable amount of effort (significantly more than I've needed to get an A in most of my other classes so far) and still struggled to get the A. The pace of the class is quick–not unmanageable, but still quick. I also found the exams to be MUCH harder than the homeworks and review materials. From what I heard from my classmates, some people thought the exams were very unfair and some thought they were fine. As someone with no econ background but who genuinely put in a lot of effort, studied a lot, kept up with the material, etc, I'd say the exams are pretty hard but not impossible. She's a good professor and seems to know what she's talking about. \r\nOverall a solid course, but if you don't have a background in economics and/or economics just isn't your thing, be prepared to really work for it. ", "rating": 3, "expected_grade": "A", "created": "2020-12-22T02:44:53Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Lots of busy work which does cover the material and helps you learn, but the content of the exams is not directly covered by the homework and SmartBook assignments. ", "rating": 2, "expected_grade": "A", "created": "2020-12-25T02:23:25Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I found professor Abassi to be a very good teacher. His lectures are clear and relatable. His tests are fair. I think the best way to do well in his class is to review the homeworks, attend the GSS study sessions and office hours if you have any questions, and read the textbook, and study hard and econ could be a very interesting class. the material is very valuable and helps you think about the world in a more practical light. it is very conceptual and not a lot of math. there are normally two chapters a week to read which can take an hour each at least because of the questions afterwards which are easy but a lot. the grade is counted for completion but the homework is counted for correctness.. Overall, the professor is there to help his students success and wants them to do well.", "rating": 5, "expected_grade": "A", "created": "2020-12-31T16:56:06Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I had little trouble with Professor Scandizzo's class, and found the homework pretty straightforward, but I can understand the frustrations people have been expressing. She seems like a nice person overall and seems responsive to student concerns. I did, however, have to rely on the textbook for most of the class but her lectures were recorded and I'm glad I was able to watch them on my on time. The class felt overall pretty intuitive for me, but I can understand how people did not feel that she helped them that much through her lectures and tests.", "rating": 4, "expected_grade": "A", "created": "2021-01-14T03:07:21Z"}, {"professor": "Elena Ramirez", "course": "ECON200", "review": "I had to retake this after dealing with scandizzo’s horrible nonexistent teaching (I withdrawed). I def recommend taking this with Elena. It’s fast paced and the exams are still difficult but she offers discussions points that count towards homework if you don’t get all the points. Unfortunately though, the discussions won’t help if you already have a 100% for all homeworks because they counted toward the homework grades only. She may do different things to help students out different semesters...so this may not be the case every time. I received a B after the curve :)", "rating": 5, "expected_grade": "B", "created": "2021-01-26T23:07:12Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "I came to her ECON200 class after being academically dismissed from UMD for 2 semesters, I had doubts in me and in the beginning of the semester I already planed to get a B for the class. But nope, Dr. Moody and her personality has made the dry material wayyy more fun to learn, except the Game Theory which I found it to be very entertaining to learn. It is quite IMPORTANT that you do those pre-lecture SmartBook assignments. I usually just do them right before the class starts because I'm lazy as f. But I think these SmartBook assignments are more important than the after class HW and gave a good general understanding for incoming lecture, it usually takes me less than a hour to finish them and she already highlighted all the important stuff on the assignment's reading part, just take notes from the highlighted paragraphs and bring them to lecture then you would find yourself follow her lecture drastic easily. Her mob lab extra credits are easy points to get if you follow my previous advice. And GSS sessions are also helpful btw especially before the exam. Her midterms are not hard at all if you do her practice exams, I mean literally we had 2 graph problems that we need to do ourselves then the next 30 or so questions are just multiple choices, and I appreciate she often do not test us on those controversial and theoretical questions. She is very reachable after class and have confidence in yourself, I'm writing this as I'm holding a 1.7 cumulative GPA, this class is not hard compare to other science courses I had at UMD, there is no nasty number and confusing formulas that you need to memorize, a good understanding of the demand and supply curve is sufficient enough. ", "rating": 5, "expected_grade": "A", "created": "2021-04-22T09:01:57Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Great teacher, explains concepts well, paces the content well and creates fair exams. For all her exams she makes practice tests that are very similar and give you practice for the content. She is very generous and drops some of the lowest assignments. She also provides extra credit opportunities which can increase your grade past 100. (great buffer for the tests/final) Additionally, this semester she has decided to make the final not cumulative which is awesome. Only real \"complaints\" would be that the exams have a high weight but this is college so nothing surprising there!\r\n\r\nIn terms of the biggest pro I would say is her energy, always comes to class excited and ready to teach. Very responsive to students and always happy to be in the classroom (even though its just zoom)", "rating": 5, "expected_grade": "A", "created": "2021-04-29T22:26:23Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Prof moody is always all over the place. Lectures were optional for attendance online but going to them made me more confused than I would be before attending the zoom. It was a lot of busy work and all assignments were through McGraw hill connect which I hate. Although the class sucked and I feel like I learned nothing it was still easy to get an A since most of the grades are through the chapters (you get a 100% if you complete it) and the HW which you get 2 attempts on. If you have the option take a diff prof.", "rating": 2, "expected_grade": "A", "created": "2021-05-10T18:42:40Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Class was easy but boring. I only went to two class meetings. Class requires McGraw Hill materials which you have to pay for. Major grades are two midterms and a final. Also small quiz-type assignments every week or so based on reading. Just read the textbook, take good notes, do the assignments, and you should be fine.", "rating": 3, "expected_grade": "A", "created": "2021-05-25T22:20:00Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Dr. Moody did the best she could with this class considering there were 300 people in my section alone. For anyone reading, my best advice is not to worry about the professor but GO TO GSS MEETINGS! They are the only reason I passed this class.", "rating": 4, "expected_grade": "B+", "created": "2021-06-16T22:02:09Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "She literally doesn't know how to explain ANYTHING. homework is horrible and super hard and her lectures dont help one bit. you're better off taking a micro class at community college", "rating": 1, "expected_grade": "", "created": "2021-11-17T21:53:34Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Really good lecturer, but then again, the course material really isn't the hardest thing out there. Exams were very straightforward where if you actively paid attention to his lectures and did well on the assigned work, you'll be able to ace it with little studying, as the homeworks are generally a lot more difficult and oftentimes a lot more convoluted due to bad question writing than the exams. Overall, you definitely learn a lot in the class because the course material is oftentimes rather relatable and applicable - would recommend if you need a gen-ed during a semester where you have a lighter workload, as this course is rather demanding in that aspect.", "rating": 4, "expected_grade": "A", "created": "2021-12-03T18:49:59Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Professor Abbasi is an okay teacher. He basically just teaches from the powerpoints, but those powerpoints are extremely helpful. I used those to study for every exam and they helped a lot. He releases each powerpoint so you can use that to follow along. The smart books assignments really help your grade and so do the homework assignments if you do them properly. The exams really aren't harder than the homework assignments, so just make sure to review those.", "rating": 3, "expected_grade": "A-", "created": "2021-12-03T21:36:04Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Professor Abbasi was pretty solid and the class is structured that you don't need to attend the lectures. You can do just fine from home if you follow the notes and powerpoints on ELMS. The exams can be confusing and are a huge weight of the class so keep that in mind\r\n", "rating": 3, "expected_grade": "B", "created": "2021-12-08T18:16:15Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "really nice professor. lectures can be boring at times but he is very straightforward and tries to make as many physical connections to the concepts as possible. Really liked him and he was funny in lectures. workload is very light and practice exams were extremely helpful for the exams. ", "rating": 4, "expected_grade": "A", "created": "2021-12-15T15:26:03Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Dr. Scandizzo is very knowledgeable about microeconomics! She explains the content very well and does practice problems during class so you can watch how to do problems step-by-step. The only problem is she ONLY talks about microeconomics-- there are no tangents or anything, which can make the lectures a little bit boring. But I came into the class with no background whatsoever in microeconomics and I am expecting an A, even though I only attending one review session in the entire semester. My best suggestion is to read the chapters and take notes before the lectures so you can use the lectures as a review. Dr. Scandizzo does cover most important concepts in each chapter, but sometimes there simply is not enough time for her to cover everything, so I really suggest you take in-depth notes in advance. There is a very reasonable amount of work. Half the assignments are graded for completion, and the other half is graded for accuracy. But you get two attempts for the assignments that are graded for accuracy, and she takes the better of your two scores. Personally, I find the homework assignments to be very difficult and the exams to be extremely easy, but most of the class believes that the homework is easy and the exams are difficult, so it may be subjective. Average exam scores hover around an 80, but my lowest exam score has been a 93. Just read the textbook chapters before class and take in-depth notes and you'll be fine, but you'll need to do that no matter what professor you have for this class. Dr. Scandizzo does everything right to help her students get good grades. It's just that the content is really hard for most people. There isn't much more she could possibly do to help.", "rating": 4, "expected_grade": "A", "created": "2021-12-16T17:07:03Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Good professory.  Be sure to do homework and practice exams in order to do well on regular exams.", "rating": 4, "expected_grade": "A", "created": "2021-12-20T20:40:47Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "The TAs were very helpful and nice but she was very poor at explaining things during lecture. I had to work my but off for this course and had an A most of the semester until the last exam. I would try to take it at a community college if you can but be prepared to study a lot to a an A. The homework is difficult and the exams are deceptively difficult.", "rating": 2, "expected_grade": "B+", "created": "2021-12-21T03:44:06Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Abbasi is a great professor and an A in his class is very obtainable. You don't have to attend the lectures as he posts the slides and videos covering them online. There are 4 main exams that make up the majority of your grade which are online, just study and use the practice exams and you'll be very successful. The HW can be tedious at times but the overall workload is 2-3 hours a week. Great professor and enjoyed this class with him.", "rating": 5, "expected_grade": "A", "created": "2021-12-21T20:54:01Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Easy class if you actually do the smartbooks and the exams aren't too bad, just make sure you take the practice exams first because they prepare you for the concepts covered and also have some questions from the actual exam. You don't really have to attend as long as you review the slides and try on the smartbooks, I only attended for the first two weeks then never went again. Only reason I didn't get an A+ is because I didn't take time to completely learn the concepts on the 3rd exam and could've gotten a better grade.", "rating": 4, "expected_grade": "A-", "created": "2022-01-19T20:33:11Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "EXAMS WERE SO HARD, the assignments she gave did not prepare you for the exam, the only way you were suppose to well on the exam is do the practice exam and go to class. She really nice but is awful at teaching, she explains in a very roundabout way, please take a different prof", "rating": 1, "expected_grade": "B-", "created": "2022-01-20T03:39:47Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Her exams are extremely difficult especially compared to what other Econ professors gave out. I’d be fine with her being a hard teacher if she actually cared about her students, whenever I’d go to her office hours asking for help on concepts/how to improve my study skills to better my grade she always quickly dismissed me. Honestly just go for a different professor she doesn’t seem to care about teaching. ", "rating": 1, "expected_grade": "B", "created": "2022-01-22T02:08:18Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Nice woman but honestly not a great professor. She constantly says confusing things in lecture and explains things differently than the way the book does which gets really confusing. Also, mcgraw hill sucks", "rating": 1, "expected_grade": "C+", "created": "2022-04-07T01:53:35Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Dr. Moody gives out a lot of extra credit, and as long as you study/do your homework, you should be able to do well on the exams. She is super passionate about the subject and always connects what she's teaching to real world examples which is very interesting and helpful for studying. Go to the GSS sessions, they're super helpful for studying. ", "rating": 5, "expected_grade": "", "created": "2022-04-07T17:24:48Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "She is very nice and energetic in lectures and obviously knows and cares about what she is talking about. She made lectures optional all semester and recorded them on zoom while simultaneously holding them in person. She gives extra credit throughout lectures (In the grand scheme of things it only accounts for around a 1% bonus in your final grade so it's not much) The class is VERY test-heavy, making up75% of the grade and the other 25% being LOTS of hw assignments. She had a change of heart this semester and made the tests open-note and you can bring any old practice exams to help. This is honestly the reason I have an A in this class because I only study the day before an exam. Go to class and go to lecture however, hundreds of students this semester are idiots who skip class or never attended in person and complain to her about them failing their exams when she honestly is a good teacher.", "rating": 5, "expected_grade": "A-", "created": "2022-04-08T04:09:04Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "She's nice but hard to learn from. I would recommend taking this somewhere else or from another professor... 3 exams including the final, online hw assignments, gss leaders are not very helpful ", "rating": 2, "expected_grade": "C-", "created": "2022-05-04T22:28:36Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I found Dr. Scandizzo to be a great professor. She is really knowledgeable on microeconomics and her lectures were pretty clear. I will say that the smartbook assignments were honestly pretty dumb and unhelpful. Make sure you attend lectures, do the readings, and GO TO GSS or office hours. Her exams were oddly specific and difficult but the practice tests were very similar so really try and master those. ", "rating": 4, "expected_grade": "A", "created": "2022-05-06T13:22:38Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Honestly don't really get the bad reviews. I came into the class with no micro experience but Prof. Scandizzo made everything easy to follow and fair. There was a fair amount of work every week since you have to do Smartbook questions and homework on Connect, but the Smartbooks are easy 100s and you get 2 attempts on the homework. Tests were really doable if you do the practice exams and take advantage of GSS study sessions. Her lectures also follow the notes very closely (with a couple more examples) so if you take good notes sometimes going to class isn't super necessary. I personally stopped going and just attended the review sessions before exams and was still able to get an A. I honestly wouldn't be put off by the bad reviews, just take her! If you put in the work it's definitely possible to do well in this class. ", "rating": 5, "expected_grade": "A", "created": "2022-05-15T03:22:43Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "if you want to do well: go to lecture, read the chapter before you complete the smart book assignments, and go to gas (even if only to prove to yourself that you know everything). lots. of zoom options. even though exams (3 of them) are 75% of your grade, they aren't all weighted evenly which is nice. moody is an upbeat person, but an overall average professor.  ", "rating": 4, "expected_grade": "A", "created": "2022-05-16T17:20:11Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "This class is mandatory for GVPT, business, econ, and public policy majors, so a lot of people don't want to do this class, so at least for my semester, she curves the exams. There are 3 exams worth 75% of the grade, but she weighs the lowest scoring one as 18%, middle as 25%, and the highest as 32%. The last test is cumulative, but it focuses mostly on the stuff she teaches after the 2nd exam. The other 25% of your grade should be free points, but its a lot of work. You  could attend her classes physically or virtually, and she records them in case you don't want to come. She gives extra credit, but it doesn't really raise your grade by that much, probably 1%, but if you know you're going to struggle, just go to her lectures and do it. ", "rating": 3, "expected_grade": "A", "created": "2022-05-26T20:40:42Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "She is really kind but really bad at explaining concepts. it kind of seems like SHE is confused sometimes. mcgraw hill is terrible and its hard to learn in this class ", "rating": 1, "expected_grade": "", "created": "2022-06-23T14:30:48Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I signed up for this course as a requirement for my major, but ended up getting really into it. Abbasi is a great professor, his lectures are always clear and easy to understand. You can definitely do well if you just watch the recorded lectures, but I would say to actually go to in person lectures, cause he definitely says and emphasizes different things in person. He's also funny and gives a lot of real life examples that ended up sticking with me and helped me on exams. The smart books and HW's were super helpful so make sure you do them. Definitely not a super easy A, but totally manageable if you actually do the work.", "rating": 5, "expected_grade": "A", "created": "2022-10-21T18:08:12.929959Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Pretty good professor but was a difficult class for me personally, I think you either get the material or you don't. Practice exams and practice problems help a lot for exams. Pretty easy homework but there is quite a lot of it, most answers are on Quizlet. TA's grade exams are kind of weird sometimes tho so make sure you go and review your exam sometimes you might get extra points if you argue.", "rating": 4, "expected_grade": "B+", "created": "2022-12-01T00:37:24.194424Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Good professor who tries to keep class engaging.  The lectures are straightforward and the exams are a good reflection of what was covered.  He posts all of the slides and prerecorded lectures online so you can still do well without going to class which is nice.", "rating": 4, "expected_grade": "A", "created": "2022-12-01T20:33:25.233457Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "People like to say Scandizzo is a horrible teacher but I found that not to be the case. If you do the assigned smartbooks and homework, along with the exam reviews, you'll do fine.", "rating": 4, "expected_grade": "A-", "created": "2022-12-01T20:53:46.270813Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I like Scandizzo I think she uses good examples to explain the topics and does good work building off past information. The homeworks are graded for completion and you get two attempts with the homework and she takes the highest grade which is nice. Go to the review sessions, look at the notes she posts on canvas, ask the TA's to review your past midterms and you'll do fine.", "rating": 4, "expected_grade": "A-", "created": "2022-12-06T04:25:03.464221Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "A very nice person, sometimes lectures are hard to follow. Smartbook lessons and Hw so basically completion which is nice for hw. She posts lecture slides if you can't make it to class but they are not very detailed. 2 midterms and 1 final.", "rating": 3, "expected_grade": "B+", "created": "2022-12-06T14:40:17.208019Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Very straight forward and the exams are pretty easy if you stay on track. His lectures are recorded which is a big plus. He also posts every resource you might ever need. If you're taking econ200 I would highly recommend Abbasi.", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T18:24:00.023748Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "It's a fairly easy class if you come to lectures. She answers questions well and her lectures do a good job clarifying material from the smartbook. There is a decent amount of busy work but that's going to be with all intro level courses and it boosts your grade which is nice.", "rating": 4, "expected_grade": "A", "created": "2022-12-08T15:52:41.072805Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "The course is hard no doubt. I think she tries as hard as she can to help students get the material down during lectures and when that isn't enough there are a lot of resources she makes sure to push and review sessions with the TAs are great. The annotated slide shows are all posted online which is great incase you need to miss class but I really recommend going. Her tests are mainly multiple choice and a few short answers of drawing and identifying graphs. Its a decent amount of work outside of class and studying is definitely needed to do well at all on her tests and even the class in general because they weigh so much. One midterm I got a 90 the other a 73 and that was with a lot of studying (granted I still didn't have everything down and I hope the 73 was just a fluke). Its a lot of information fast but if you do your work, go to lectures or look over the slides, take notes, and go to review session you'll be good. She wants you to succeed and helps as much as she can the class is just rough.", "rating": 4, "expected_grade": "A-", "created": "2022-12-08T18:03:02.530772Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Dr. Abbasi is the best professor for this class imo, he's very nice, understanding, and a great lecturer. His exams are reasonable and he provides practice exams that literally have the same questions as the actual exam sometimes. Just do the smartbook assignments and study for the exams and you'll be fine. He also drops the 3 worst hw grades so that's nice too. My only complaint is he doesn't allow a cheat sheet for the exams like most of the other profs for this class.", "rating": 4, "expected_grade": "B+", "created": "2022-12-08T23:45:28.570877Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I really loved Scandizzo as a person and professor. I think she is really friendly and easy to approach. Her examples in class are simple to follow and she is clear in her explanations. Go to class, attend GSS, and review as much as you can. I did extremely well on the first test, but not as well on the second. It is a tough class. I recommend taking her if you can because she cares a lot about the success of her students.", "rating": 4, "expected_grade": "A-", "created": "2022-12-09T01:46:15.550406Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "literally no one goes to class after the second week because all of the notes are online. many resources on his canvas page for practice. exams are really hard tho. wouldn't recommend for a gen ed, go find an easier one", "rating": 3, "expected_grade": "A-", "created": "2022-12-13T01:04:48.426917Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Overall a good professor who will prepare you for the exams. My only problem is his lectures are extremely boring", "rating": 4, "expected_grade": "B+", "created": "2022-12-13T03:24:17.872147Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Very nice professor, but the way she taught was not very engaging. Her lectures were just a slideshow of notes. I obviously understand that she taught a large lecture for ECON200 which makes it hard to engage everyone, so it's kinda something you'd have to deal with. You have to do a lot of busywork in this class. Smartbooks seemed a bit pointless because in class she covers the same material from the chapters, but just less of the smartbook and only the material needed for exams. Completed notes will always be posted if you miss a class, and the GSS sessions and TA office hours are good resources to use if you need help understanding any concepts. It is a passable course, but will be boring at times - something I felt like I just had to get through. If there is an upper level course with her, I think it would be better because she can be more engaging in smaller groups - she's still very personable and approachable.", "rating": 3, "expected_grade": "A", "created": "2022-12-13T21:39:29.634902Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "The professor posts all lectures online and gives practice exams and problems, overall making his content very accessible. This made it really easy to skip the class which wasn't good since I was struggling a little in the class, but all the material is there. Some of the exam questions are even directly from practice problems or lecture slides. Overall provides resources but lecture itself was just okay.", "rating": 3, "expected_grade": "B", "created": "2022-12-16T05:45:10.512069Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Abbasi's lectures are barely attended because you can learn everything he says by watching his recordings and reading his slides. You can play his recordings at 1.5x speed which is great. 2 midterms and a final do the practice exams they are super similar. Overall he himself doesn't really help or hurt too much it is mostly up to the student how well you wants to do in this class.", "rating": 3, "expected_grade": "A-", "created": "2022-12-16T21:47:40.633195Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I loved learning from professor scandizzo. Econ is hard to make interesting but she did as best as she could. Lectures could get boring, but if you did the weekly HW assignments and smartbooks, you don't really need to pay much attention. Her exams were pretty straightforward and were never on concepts that she didn't cover.", "rating": 4, "expected_grade": "A-", "created": "2022-12-17T04:43:14.542438Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "If you show up/ watch lectures and do the smart books and homework’s, and literally just study- you will be fine. I feel like a lot of people don’t do anything the entire semester and end up with a C and then they start complaining. Abbasi is definitely the best ECON200 teacher and obviously this isn’t an easy A, but you get what you put in. I mean this is college come on", "rating": 5, "expected_grade": "A", "created": "2022-12-23T19:19:31.510001Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I did not attend a single lecture after the first month and still pulled out a B. That should be all the info you need.", "rating": 4, "expected_grade": "B", "created": "2022-12-24T22:21:31.122297Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Horrible horrible horrible horrible lecturer. Take this class online at community college, you won't be disappointed. It will transfer and you won't have to sacrifice your mental sanity or gpa. This class is literally a gen ed there's no reason to spend money taking it at umd when you can do it cheaper at community college.", "rating": 1, "expected_grade": "", "created": "2023-01-06T00:47:48.046650Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Homework could be a little bit time consuming but not super difficult, and exams were based pretty much entirely off of the lecture slides he uploaded to elms and the textbook sections and were pretty similar to the practice exams so not very challenging and I found the homework harder than the exams. His lectures could be a little dry sometimes (it is economics) but solid so this class shouldn't be very hard if you consistently go to lecture and complete the homeworks.", "rating": 4, "expected_grade": "A-", "created": "2023-01-08T23:09:52.008456Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I loved Abbasi and his class. I found it easy to get a good grade if you dedicated time to actually learning the material. Homework and smartbook for every chapter (about 1-2 a week), but normally weren't incredibly time-consuming. Studying with friends was really helpful for this class, too. Abbassi also really cares about his students, so try to go to lecture if you can because he does his best to engage. Super sweet guy and very knowledgeable in the topic.", "rating": 5, "expected_grade": "A+", "created": "2023-01-18T04:16:38.064713Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Amazing professor, homework wasn't that bad, and his exams were very fair. Would definitely recommend taking him if you have the chance", "rating": 5, "expected_grade": "A-", "created": "2023-01-21T04:52:40.495508Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Super nice professor who gives all required material to do well in the class. I will say the exams were straight forward in a lot of ways, but I somehow always got a lower than expected grade. COME TO CLASS if you want an A. If you don’t care, the slides should suffice.", "rating": 5, "expected_grade": "A", "created": "2023-01-22T20:50:05.858806Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Easy class, but awful teacher. Does not explain anything better than the book does, and stopped going to class. However, easy class in general.", "rating": 2, "expected_grade": "A+", "created": "2023-02-06T19:20:20.910868Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "I did not enjoy learning from Moody. I wish I took this pre-req course at a CC and transferred over. She is really nice but omg I have never struggled so hard in a class to learn from a professor.", "rating": 2, "expected_grade": "C-", "created": "2023-02-18T05:49:27.085181Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I've never taken econ or anything of the sort before, but I feel like this class wasn't nearly as terrible as the other reviews are saying. If you go to lecture, and start studying for exams at least a couple days in advance, you'll do fine. I didn't take textbook notes, or go to review sessions outside of the pre-exam kahoots (recommended). She's a decent professor, just sit up front and take hand written notes so you don't get distracted. Exams are straightforward, and the practice ones she gives are accurate to how the real ones are. Don't let the people who didn't put in any effort discourage you!!", "rating": 4, "expected_grade": "A", "created": "2023-03-14T13:48:32.575346Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "let me warn you with this: i am not a business or econ major, literally a stem major and took this class for no reason and it was just a poor choice as a gened.\r\n\r\nbut anyways this class was pretty easy, the homeworks were a little bit of a pain because they were so time consuming, but doable. also i never went to class. never. and i also didn't watch his pre-recorded videos either. regardless, his practice exams were actually the best study material ever. very similar to the real thing and all. I was only like 0.5 away from an A- but he did already give a 1% in extra credit so its whatever. \r\n\r\nthe class is definitely doable to get within the A range, i was just slacking, and even with that came pretty close. lecture: boring; resources: helpful.", "rating": 4, "expected_grade": "B+", "created": "2023-03-27T08:24:20.765608Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I have taken econ courses in high school and my first one in college I took with Professor Scandizzo. She mainly just used slides to teach the course, but I feel this really worked because her tests were almost the same as what she taught. I would recommend taking this course with her.", "rating": 4, "expected_grade": "A", "created": "2023-05-02T21:49:48.695239Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "This class is challenging if you don't have any background in economics. Dr. Scandizzo's lectures are kind of boring and there is a lot of material to cover throughout the semester. The homeworks are how you mainly learn the material and your worst three grades are dropped. The exams are definitely the hardest part of the course.", "rating": 4, "expected_grade": "A-", "created": "2023-05-12T16:43:33.988364Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "As a student with nor prior Econ knowledge, this class was tough and Scandizzo made it even more difficult than needed. She was very friendly and nice but her teaching method was hard to follow. Also, the smartbooks and HW's are really time consuming and they make up a pretty good chunk of your grade so I don't recommend slacking off on those. The test questions are a lot harder compared to exam review and what is gone over in class. \r\n\r\nAnyways this was one of the more annoying classes I had to take and I ended up self teaching myself a lot.", "rating": 2, "expected_grade": "B-", "created": "2023-05-16T01:36:55.365663Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Not rating Scandizzo because i never went to class, but the course is very simple. Read the textbook and made try to not get behind too much. It really helps to write chapter summaries/ study guides that you can look back at when studying for the final.", "rating": 4, "expected_grade": "A-", "created": "2023-05-16T22:06:41.700906Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "This mico professor is AMAZING. He is an amazing lecturer and super sweet and funny as a person. He prepares students extremely well for the exams. The multiple choice weren't too bad for me, but the long answers are challenging and require studying. I highly recommend taking him and not the other mirco professor. He is a great lecturer. His exam reviews are helpful because he lets students ask questions. His TAs were okay, but I'm not sure how much is really in his control in that aspect.", "rating": 5, "expected_grade": "B+", "created": "2023-05-17T23:06:03.342037Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "For people who don't really care for this course and is only taking it because of the gen ed requirement, I feel like taking this professor is good enough. I barely show up to class and I honestly do not know anything until the week before an upcoming exam. She provides a lot of useful resources like GSS sessions and practice exams so there is really no reason to be failing her exams.", "rating": 4, "expected_grade": "B+", "created": "2023-05-23T23:43:37.440912Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Anybody who says that the class is hard is stupid. All you have to do is read the assigned smart books and take some notes. Most the people who get bad grades in the class either cheat on the homework’s or don’t read the smart book. This class takes common sense and no business background to get an A in this class.", "rating": 5, "expected_grade": "A", "created": "2023-05-24T00:39:43.219650Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Econ200 is not too difficult of a class however Professor Scandizzo's lectures were extremely boring. She mainly taught off the slides. I stopped going to lectures two weeks in and only attended Gavin's GSS. If you have the choice to choose professors pick Abbasi.", "rating": 3, "expected_grade": "A", "created": "2023-05-24T02:42:55.488402Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Scandizzo is a pretty solid professor to take ECON200 with. The class itself is very easy, and Scandizzo also writes exams that are very straightforward. The practice materials she provides are sometimes useless, but sometimes will have the exact same questions as the actual exam. Outside of exams, there's just so much busywork that, for a class like ECON200, is quite frankly unnecessary; the weekly Smartbook and homework assignments get tedious after a while, and they aren't really helpful. Her lectures are also just fine, she basically just reads off the slides but does so in a fairly engaging way. Still, after a while, I just stopped going to class altogether since honestly the material is easy enough to learn on your own.", "rating": 3, "expected_grade": "A+", "created": "2023-05-26T22:39:24.750166Z"}, {"professor": "Luis Jaramillo", "course": "ECON200", "review": "He was okay for the most part, he gave me an extension when I asked for it but it's super hard to get an A unless you do well on the exams (B or higher). One of the exams was hard to even finish because there was so much graphing with a little bit of time. The class emailed him, but he didn't end up doing some type of curve for it. Other than that his lectures are informative.", "rating": 4, "expected_grade": "B+", "created": "2023-07-13T01:37:18.019338Z"}, {"professor": "Erica Ryan", "course": "ECON200", "review": "Professor Ryan gave ample opportunities to meet during office hours to aid in comprehension. My grade reflects my effort & not her teaching. It was taught through an online textbook & deadlines could be flexible with notice. \r\nIt is a lot of work but if spaced out, you can do well. Overall, would take another class with Professor Ryan.", "rating": 5, "expected_grade": "C", "created": "2023-08-19T20:17:51.164837Z"}, {"professor": "Luis Jaramillo", "course": "ECON200", "review": "Very helpful lectures. He was flexible with deadlines when I asked for an extension. If you do the problem sets (you can submit them twice) and do well in the exams (which are not hard, though sometimes long) you will do well.", "rating": 5, "expected_grade": "A", "created": "2023-08-31T21:51:49.299939Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "I am currently in this class. \r\n\r\nPlease don't believe this class is easy or anything. It is actually pretty tough. I thought it would be an easier class, but that is wrong. \r\n\r\nSome people act like this is easy and if you don't get an A in this class then you are just stupid and it is all your fault. \r\n\r\nThe guided study sessions are ALWAYS overcrowded and the environment isn't the way they make it seem. \r\n\r\nIf you know someone in the class, then please study with them. I don't know anyone, so most people is hostile and stay in their cliques. \r\n\r\nI am giving it 3 stars because the professor is nice and she lets you attend sessions on Zoom (like I am currently doing)\r\n\r\nAlso, I know that there are many classes and many professors that are worse than this one. \r\n\r\nI will post an updated review when I am closer to the end of this.", "rating": 3, "expected_grade": "", "created": "2023-10-05T14:49:08.337046Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "I would give 6/5 if I could. My favorite professor I have had here, if you get a chance to take her, do it. She teaches for her students to understand and it shows. She explain things in ways they make sense. GO TO OFFICE HOURS!! She will explain everything again over to you and she is the most helpful prof for office hours. Take her!!", "rating": 5, "expected_grade": "A", "created": "2023-10-30T19:48:53.499894Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Absolutely love her! Prof. Moody is incredibly sweet and you can tell she genuinely cares about her students. She is always willing to accommodate for students and make sure they understand the material. I haven't gone to her office hours but heard she explains concepts in-depth to students to ensure they succeed and I believe it because she already does that in class. I personally wasn't a huge fan of the GSS which is why I'm giving a 4/5 because I just didn't find them that helpful as they're crowded and mostly individually paced so there wasn't much \"guiding\" tbh. \r\n\r\nI would say that coming out of high school having taken AP Econ, I definitely had an advantage. Prof Moody posts practice exams and they're pretty much exactly like what you should expect on the real one. On our first midterm, one of the FRQs was basically identical to the one on the practice (with a different scenario of course but the concepts/questions were the same) so definitely use the practice exam. \r\n\r\nThere are SO many resources available to you. The practice exam, posted slideshows from class with annotations, posted recordings of lecture, and of course the guided study sessions. I also highly recommend Jacob Clifford on YT, he helped a lot for last minute studying because I find it difficult to not zone out during lecture. She allows for you to join lecture through Zoom and there's opportunity for a tiny bit extra credit if you get the clicker questions right. Just go to lecture, review materials, do the practice exams, and you'll be more than okay! She's a great professor who only wants you to succeed.", "rating": 4, "expected_grade": "", "created": "2023-11-16T14:57:34.935362Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Mr. Abbasi is very funny and lighthearted. Attendance is not mandatory, and the smartbook (learning) and homework assignments do a good enough job of explaining the material. However, I need stress the importance of going to class, as his explanations for challenging concepts and graphical depictions are very helpful and ensure that you understand concepts well enough for essay questions. The multiple choice part of exams are much easier than the essay questions which require more prep. Nonetheless, he prepares you well enough for them with multiple exam reviews and office hours. If you can motivate yourself to go to class even though attendance isn't mandatory, then this is the perfect professor for you.", "rating": 4, "expected_grade": "B+", "created": "2023-11-29T23:12:09.571596Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Not a bad professor, and I truly do think it is just hard to teach an ECON200 course, but I did not feel like Professor Abbasi taught me anything that the smartbooks didn't. Lectures were useless, as all lessons were required as homework BEFORE the class began. Hard class but it should be expected. Use outside resources provided to your advantage.", "rating": 3, "expected_grade": "", "created": "2023-12-01T17:34:24.418162Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "He's not a bad professor, but I honestly felt like lectures were pretty useless. I stopped going after the first week because everything he covered in class was already covered by the Smartbook (reading/learning assignment) and homework. All his lectures are recorded too, if you prefer that to reading. I felt like exams were pretty fair, and he provided 2 sample exams for each exam which were overall pretty representative of the actual exam difficulty. Overall, this class shouldn't really be a problem with a little bit of effort.", "rating": 4, "expected_grade": "A", "created": "2023-12-04T06:48:40.465203Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Dr. Scandizzo is a good professor to take ECON200 with because she posts annotated notes after class and explains the content pretty thoroughly during lecture. My one qualm is that lecture is extremely boring and I find myself doing other things in her class because I can't pay attention. However, she provides good resources and the class is easy.", "rating": 4, "expected_grade": "A", "created": "2023-12-05T17:07:58.569465Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Decent professor overall. Makes lectures interesting and I like how he includes problems in his lectures for students to solve and then goes over them. A lot of what he says, however, is not written on the slides. Homework and Smartbook assignments are easy to complete. His tests, on the other hand, are quite difficult, especially the open ended sections.", "rating": 4, "expected_grade": "B+", "created": "2023-12-05T18:26:18.812972Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "content is easy, the lectures are pointless, you only go for the attendance points. She is very nice and helpful", "rating": 4, "expected_grade": "A", "created": "2023-12-05T21:38:40.148496Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "W ECON PROFESSOR: Mr. Habbasi has an old-fashioned sense of humor with his love for coconut cookies. His lectures are engaging as he has a polling system in his class for you to answer questions he proposes spread out through his lecture which does help with retaining information in the short run. But, sometimes he does ramble a lot in his lectures, like next level yap. I would have enough time to preview the slides he was about to present and copy them in my notes in the first ten minutes of class because of his rambling. But that's what makes his lectures engaging. There is a passion behind his complexities with microeconomics and a genuine love for the subject. I regret not going to his office hours more to personally get to know him and his thought process on microeconomics-related subjects. He also does not curve the class.", "rating": 3, "expected_grade": "C", "created": "2023-12-06T03:39:51.769954Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "She's okay. For a person who doesn't understand econ at all, she does an okay job. No extra credit except clickers.", "rating": 3, "expected_grade": "B-", "created": "2023-12-06T03:55:54.277252Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Abbasi is a great professor and a really nice guy. My only complaint was the insane amount of work required for this class. SmartBook assignments before every class felt like busywork given that we learned the same stuff in class, and the homework after class was often much harder than what was actually on the final. Overall, if you're going to take Micro, take it with Abbasi, but I wasn't a fan of this class in general.", "rating": 4, "expected_grade": "A", "created": "2023-12-06T14:46:17.978161Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I really liked this professor. The homework assignments are pretty helpful to actually learning the material, and combined with class notes, you have lots of material to be able to understand it all. The concepts can get difficult if you don't actually learn it and just cheat on every homework / barely take notes, so as long as you actually pay attention to what you're learning you're all set. The homework grades really add up so if you get 70s on every test you'll still be okay. Definitely take this professor if you can. I only went to maybe 5 classes and instead went over the recorded notes. The actual classes are long and draining and sometimes feel pointless.", "rating": 4, "expected_grade": "B+", "created": "2023-12-06T20:09:21.067729Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Her lectures are kinda boring but this class is definitely doable. She provides a lot of resources for students and honestly you don't even really have to go to class to do okay. Economics has always been hard for me so I struggled a little bit, but take advantage of the resources like GSS and you will be fine.", "rating": 3, "expected_grade": "B-", "created": "2023-12-07T15:18:47.420649Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Dr. Moody is absolutely amazing! Probably the best professor I have ever had. Her lectures are not boring at all and her lessons and teaching style are so clear and understandable. She records lectures, so whenever you feel like you didn't understand something, it is so helpful to rewatch them. If you watch the lectures and do the homework, you will be absolutely fine! Her practice exams are SO similar to the real ones. She allows a full sheet of paper front and back on the final. She is very understanding. Nothing but good things honestly. Will report back after the final though.", "rating": 5, "expected_grade": "A", "created": "2023-12-07T23:49:43.207186Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Professor Abbasi is very fun, kind, and sweet as a lecturer! As a Freshman Connection student, however, going to class sucked and I stopped going to lectures halfway into the semester because they were very late (7:30 - 8:45 pm). If I hadn't left class when it was dark outside, I probably would've actually attended the lecture. Previous reviews are correct though, even though I did not attend the lectures, I was able to mostly teach myself the content with the SmartBook, lecture recordings, and previous exams, getting me an A on the second midterm. Just make sure you complete your homework and take notes and you should be fine in this class with not too much effort!", "rating": 5, "expected_grade": "B+", "created": "2023-12-15T04:23:54.238058Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "His lectures were pretty boring but they were all online so you didn't even have to go. He is one of the nicest professors ever and truly enjoys teaching. The tests were somewhat difficult but the work consisted of smart books (completion) and HWs (accuracy but you have two tries). Definitely the best professor for 200", "rating": 4, "expected_grade": "B", "created": "2023-12-15T21:34:32.419671Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "TAKE HER!! She is the most amazing, helpful, and engaging professor you will find. Econ is a hard class, but she makes it doable. Anytime I didn't understand something I went to office hours and everytime it was so helpful, best office hours I've had by far. Wish I was an econ major just to take her as a professor again. Teaches for her students to actually learn and understand. Wish I could rate 6/5.", "rating": 5, "expected_grade": "A", "created": "2023-12-16T00:30:37.836996Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Pros:\r\n-She is an extremely energetic lecturer and is never dull\r\n-She does clicker questions during class which give you 100% credit if you get them wrong and 125% credit if you get them right, meaning that you can get a few overall percentage points in extra credit if you participate and go to class\r\n-She gets exam grades back to you fairly quickly\r\n-There is not a lot of homework and the smartbooks and HW can be knocked out in usually 30 minutes\r\n-She gives you 4 attempts on the HW meaning that it is basically impossible not to get a 95%+ on them\r\n-She drops the lowest 3 smartbook and HW assignment grades\r\n-She curved the first midterm by 7% because the class average was too low\r\n-She posts the slides with her annotations on ELMS meaning that you can go back and look over them to study or if you missed a class\r\n-You can also attend class on zoom rather than in person\r\nCons:\r\n-Her practice exams are imo easier than the real exams and on her actual exams she puts a lot of questions that involve picking more than one option or includes none of the above which I find a bit annoying\r\n\r\nOverall she is a very solid professor and a great choice for ECON200. I feel like a lot of the older reviews are oddly harsh on her as I personally have not had any negative experiences with her or the class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-16T02:48:00.270729Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Not a bad teacher to take for micro at all. Do not get all the negative buzz around her. Lectures are very boring and I stopped going around third week. All HW assignments are free A's and you get two attempts. I learned everything for the midterm and final a week before and managed to pull out a B. If you apply yourself and do the work it will be easy to get an A.", "rating": 4, "expected_grade": "B", "created": "2023-12-18T05:41:34.664770Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "She posts the note for each class so you don't ever have to come to class in person. She goes over examples and releases practice tests and questions before each midterm. The two midterms are 20% each with the final being 30% of your grade. She covers different chapters than other sections so unless you have friends in your class, you can't study with anyone else. Although she doesn't curve, if you end with a 90 or above its a A. And a 88 or 89 is a A-. The smartbooks are helpful for learning content, and there are Guided Study Sessions weekly, as well as office hours which are helpful for questions.", "rating": 4, "expected_grade": "A", "created": "2023-12-19T16:45:36.551546Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Dr. Moody is a great professor that wants her students to succeed. She is a great lecturer and makes sure to answer questions so that students understand the content. She even provides her slides and practice tests to students to help them study. The class wasn’t too difficult, but you have to stay on top of the material since there are a few exams. But I would recommend taking Moody if you need to take ECON200.", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T17:48:39.508394Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Professor Scandizzo is a pretty good professor who explains concepts pretty well and makes it easy to understand what is happening. While the hws and smartbooks can be a lot of work during the week, they make it easier to understand the concepts. Her tests are fair and she provides helpful resources and practice problems to better prepare you for the exams. There are 2 midterms and a final that make up a majority of your grade. ECON200 also has weekly GSS sessions and a tutoring center that allows you to get help multiple times a week which is helpful. I recommend attending class as concepts are easier to understand when she explains them but she does post the slides if you need to go over them again.", "rating": 4, "expected_grade": "A", "created": "2023-12-19T19:50:56.388334Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "I think she teaches the course pretty well and straight-forward. Tests are a pretty average difficulty and she provides adequate resources to prepare but she is a little boring.", "rating": 4, "expected_grade": "B", "created": "2023-12-21T06:27:17.673372Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "She comes off as very energetic, almost too energetic for my liking. The beginning of this course was fine, as the material was far easier but once we really got into it I felt like there was a lack of explanation and reasoning when she did something. On top of that, when someone asked a question, it felt like she confused the person more than they originally were or said something along the lines of \"let me get there in just one second\", though I felt like she never actually got there at times. As for the GSS's, they were also fine at the beginning of the year when they were smaller and more personally focused but eventually, they just got way too big and the TA would just end up giving out a test for you to do where you could ask questions. I'm never one to turn down extra test preparation but it wasn't really what they were advertised as and I expected more thorough evaluations of each topic rather than just quizzing us on it. Can't fully blame her because she offers Zoom for lectures and I got lazy halfway through the year and lost focus going to those but definitely a rougher course than I had imagined.", "rating": 2, "expected_grade": "C+", "created": "2023-12-21T23:08:43.806609Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I did not show up more than 5 times for this course (including exam days). I barley ever actually read or studied the homeworks. I will probably still pass this course with a C or C-. If you show up and put in effort this course is a free A/B and you don’t need to try on the final. If you put in zero effort you can still probably get away with a C-.", "rating": 4, "expected_grade": "C-", "created": "2023-12-22T06:07:06.737487Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "When I was picking my ECON200 professor, I was a little hesitant to choose Professor Moody since her initial rating was a little low. But I am here to say that Professor Moody is hands down the BEST microeconomics professor! I absolutely loved Professor Moody and you could tell she genuinely enjoyed teaching econ. She teaches the information in a way that is not extremely boring, which made lectures somewhat fun. Her exams are extremely fair and are sometimes curved; she also posts practice exams and answers to help prepare (definitely recommend doing them!). She gives a lot of smartbook activities and homework’s, which seem annoying at first, but they really help boost your grade. She also does clicker questions which are great opportunities for extra credit. You can definitely tell that she cares about her students and genuinely wants us to enjoy the content. Overall, take Professor Moody for ECON200! I wish she was teaching macro so I could have her again. I totally recommend!", "rating": 5, "expected_grade": "A-", "created": "2023-12-24T18:22:15.806962Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "If you had prior knowledge or can self study very well, then take the class. I would not recommend this as a gen ed if you’re business major or something along the lines of having this class mandatory. His classes were barely attend since he has a lot of resources posted on canvas and had pre recorded lectures. During class, he takes years on whatever topic he is yapping about and spends like 30 seconds on last on each side expecting you to get the concept down quickly and will end class not even halfway through the slides and moves on to the next chapter next class. Exams are exactly like the practice exams he posted but you really have to gasp the concepts and graphs down. I wish I took this at a cc and transferred it over but you just need a C- to pass with this class. He is also details oriented and will pay close attention to what you are doing on the work from what I heard from others. Overall, if you can teach yourself well enough then you will do fine.", "rating": 3, "expected_grade": "C+", "created": "2024-01-02T01:23:35.398079Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Took AP Econ in highschool so this class was an easy A, other ppl tend to struggle tho. Definitely take Scandizzo, her lectures are well explained and other professors added in more material. Smartbooks and homework every week but you get a second attempt. Probably be helpful to take notes on the textbook if you're gonna skip class", "rating": 4, "expected_grade": "A", "created": "2024-01-03T22:49:32.566253Z"}, {"professor": "Kartikeya Batra", "course": "ECON200", "review": "Took Econ200 over the winter. It felt disorganized and I didn't find the professor to be much help. As for grading the professor is pretty good about being lenient. If you struggle with Econ I wouldn't suggest taking over the winter. Overall though it wasn't too bad.", "rating": 2, "expected_grade": "", "created": "2024-01-09T16:11:44.219741Z"}, {"professor": "Kartikeya Batra", "course": "ECON200", "review": "I took this class during winter session. It felt very disorganized and I didn't find the professor to be very helpful or accessable. The class is hard but there's a curve", "rating": 2, "expected_grade": "", "created": "2024-01-10T22:47:08.773879Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Genuinely very nice guy. Assignments are very helpful, and exams aren't too hard if you're willing to prepare a bit on your own. He provides 2 very useful practice exams too which are very similar to the actual test. Final is worth 35% of your grade though which is kind of stressful.", "rating": 5, "expected_grade": "A", "created": "2024-01-10T23:51:54.516568Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "The instructor found it hard to listen to a long lecture twice a week and was very boring. Although practice exams were the same as the test, there was a crazy amount of material to learn for the entire semester and if you fall behind it can be hard to catch up. The ta's were not helpful for this course and made you feel stupid when you didn't get it or didn't do well on the exam and did not try to help you do better. Would take this course with someone else if possible", "rating": 1, "expected_grade": "D+", "created": "2024-01-16T04:16:45.587972Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Abbasi is a good lecturer. The lectures aren't the most fun but he tries his best to be engaging. Most content can be self taught from the online textbook and assignments. Lectures are posted online weekly, so it's not necessary to go to the class. Two midterms and a final, all a combination of MC and open ended questions. The class definitely requires work to understand concepts and do well on exams. I would recommend taking it with Abbasi.", "rating": 5, "expected_grade": "B", "created": "2024-01-18T21:39:05.659324Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I absolutely loved this professor. He has recorded slides explaining each chapter so you don't even have to go to class. He emails fast and will help you whenever you need. There's a lot of TA's and he offers plenty of office hours if you are struggling. He gives multiple practice exams for each exam which basically mirrored the exam format. LOVE HIM!!!! MY KING!!!", "rating": 5, "expected_grade": "A-", "created": "2024-01-21T04:09:56.631801Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "Such a big class size that it's hard to personally get to know this professor however I enjoyed his class and got a good impression from him. He's kind and often attempts to crack jokes during his lectures (he reuses his \"coconut cookies \" joke at least once per lecture but it's endearing). Lectures can be pretty boring and the content from the lectures is the exact same as the content in the reading so I went to three lectures over the course of the semester and still got an A (note that I did the reading and homework really thoroughly, studied hard for my exams, and at times attended GSS meeting for topics I didn't understand). I appreciated that he was a really organized teacher and all the class content, slides, recording, hw, study sheets, etc. were categorized in canvas and super easy to find. Tbh, it's such a big class that I don't think the professor will have that much of an impact on how you do in the class but abbasi is a good choice!", "rating": 4, "expected_grade": "A", "created": "2024-01-25T19:36:27.812869Z"}, {"professor": "Stefania Scandizzo", "course": "ECON200", "review": "Horrible professor to take. She is not very understanding about deadlines even if you have ADS accommodations. It took me 3 months to get my ADS signed by her after numerous reminder. Super boring lecturer and long homework assignments. Def take a different professor if you can", "rating": 1, "expected_grade": "D", "created": "2024-02-01T19:51:04.279663Z"}, {"professor": "Kartikeya Batra", "course": "ECON200", "review": "This professor was very lenient on grading, A+: 100-95, A: 95-90, A-: 90-85, B+: 85-80, B: 80-75, B-: 75-70, C+:70-65, C: 65-60, C-: 60-50, D: 50-40, and anything below is failing. I took this course over the winter session and it was A LOT of work. It was about 20-25 hours per week with about 12-16 assignments due each week. There was a midterm each week, which was fairly easy compared to other economics courses. The professor provided office hours for an hour each day and even did some over holidays/weekends. This was an asynchronous class and all the lectures were prerecorded online.", "rating": 4, "expected_grade": "B", "created": "2024-02-01T21:30:00.106397Z"}, {"professor": "Hossein Abbasi", "course": "ECON200", "review": "I HATE LECTURE CLASSES. I find it difficult to pay attention but more often than not— you have to attend for the sake of learning the content. That is not the case with this class! He provides so many resources and is super helpful. He's a really nice guy and wants you to succeed and provides as much help as he can to make that happen. Talks really slowly which is helpful for people who take notes in class but not my cup of tea. He also has lecture VIDEOS with are very helpful— I watched those exclusively at 2x speed and it was helpful. All in all, even if you don't like his teaching skills— the resources he provides are unmatched. \r\n\r\nHomeworks: You have auto 100% homeworks and than the actual homeworks. Both of which are fairly easy, sometimes a bit time consuming but relatively simple to complete as long as you don't save it for the very last minute. Very doable as long as you read the textbook/attend class. \r\n\r\nEXAMS: Each midterm was sectioned off on the respective chapters you learnt prior to it. He makes sure you KNOW what you need to study and provides two practice exams (VERY HELPFUL).", "rating": 5, "expected_grade": "A", "created": "2024-03-13T18:34:12.323725Z"}], "department": "ECON", "course_number": "200", "name": "ECON200", "title": "Principles of Microeconomics", "credits": 3, "description": "<b>Prerequisite:</b> MATH107 or MATH110; or must have math eligibility of MATH113 or higher.\n<b>Credit only granted for:</b> ECON200, AREC240, or AREC250.\n<b>Additional information:</b> It is recommended that students complete ECON200 before taking ECON201.\nIntroduces economic models used to analyze economic behavior by individuals and firms and consequent market outcomes. Applies conceptual analysis to several policy issues and surveys a variety of specific topics within the broad scope of microeconomics.", "is_recent": true, "geneds": null}