{"average_gpa": 3.4716720779220775, "professors": ["Patricia Alexander", "Geetha Ramani", "Min Wang", "Yuting Sun", "Alexandra List", "Peter Baggetta", "Lauren Musu-Gillette", "Anisha Singh", "Doug Lombardi", "Lauren Trakhman", "Jannah Fusenig", "Jannah Fusenig", "Juliana Van Meerten", "Juliana Van Meerten", "Alice Donlan", "Alina Maki", "Victoria Alexander", "Victoria Alexander", "Victoria Terry", "Victoria Alexander"], "reviews": [{"professor": "Patricia Alexander", "course": "EDHD460", "review": "Prof. Alexander is awesome! There are four exams (one which you have to write yourself but it's not hard) a little project you have to do. There are opportunities for extra credit so don't fret. She's very animated and really wants people to do well. So speak up and say intelligent things. Not a hard class at all. Very easy to get an A. I studied the night before for every exam, including the final and got high A's on all of them. ", "rating": 5, "expected_grade": "A", "created": "2012-05-15T22:14:00Z"}, {"professor": "Patricia Alexander", "course": "EDHD460", "review": "Dr. Alexander (prefers to be called Dr. A) is a very loving and enthusiastic professor who will brighten up your day. Her lectures are engaging and fun to be a part of. The lectures themselves are a little unorganized in terms of following along with the syllabus. She might not cover everything in one lecture so she probably will not test you on it. PowerPoint slides are posted on ELMS. I recommend printing these out because Alexander flies right through them during lecture. Dr. A makes an effort to learn many of her student's names (so watch out if you get called on in class). The class material is pretty straightforward and boring. Discussion sections are mandatory (turn in assignments and stuff). 3 midterms, 1 final, and 1 behaviorism project. No excuse not to get an A in this class. ", "rating": 5, "expected_grade": "A", "created": "2012-05-15T16:41:00Z"}, {"professor": "Patricia Alexander", "course": "EDHD460", "review": "Good class. Alexander is awesome - she's a great lecturer and she literally remembers everyone's name eventually. She studies the class roster pictures and tries to learn as many names as she can before the class even starts. Her book is REALLY boring which is weird because her lecturing is interesting / funny. No cell phones or laptops allowed in her lectures though. Sometimes the topics are boring but she makes it as interesting as possible. Discussion is fun too- her TAs have been with her for years and are very helpful! There are exams, but not normal exams at all. A different style of test. Many assignments but they aren't that difficult and are sometimes fun. A couple projects as well. Recommended!", "rating": 5, "expected_grade": "A", "created": "2011-11-07T09:09:00Z"}, {"professor": "Patricia Alexander", "course": "EDHD460", "review": "i expected to get an A in this course that i heard was very easy. this class is an absolute joke. she experiments with all her assignments and directions are never clear. she only rounds grades for people who get As on the last two exams. she gave me a C and i had a 79.9 in her class. DO NOT TAKE THIS CLASS. all exams are written worth around 18 points a page and if you forget one word they take off major points. AVOID this class unless you really need to take it. ", "rating": 1, "expected_grade": "A", "created": "2011-05-18T12:07:00Z"}, {"professor": "Patricia Alexander", "course": "EDHD460", "review": "She is a great professor!  I don't know how else to say it!", "rating": 5, "expected_grade": "", "created": "2011-03-07T23:32:00Z"}, {"professor": "Sandra Loughlin", "course": "EDHD460", "review": "Sandra was my TA for EDHD460 which was taught by Dr. Alexander. Sandra is one of the best teachers out there. She is very enthusiastic during discussion and she really cares about her students. She has a strong academic background (attended Harvard) and thoroughly reviews material with you to help prepare you for the exam. She is a good leader whether she is a teaching assistant or a professor. ", "rating": 5, "expected_grade": "A", "created": "2012-05-15T16:33:00Z"}, {"professor": "Anisha Singh", "course": "EDHD460", "review": "Easy class. Class activities. 3 Exams. 1 easy behavioral assignment (completed it in 2 hours). Great teacher.", "rating": 4, "expected_grade": "A", "created": "2019-11-13T18:01:51Z"}, {"professor": "Jannah Fusenig", "course": "EDHD460", "review": "If Jannah has 100 fans I'm one of them. If Jannah has 1 fan it's me. If Jannah has no fans I'm dead.\r\n Jannah has done everything in her power this past semester to make sure her students succeeded in this course. She gives everyone a fair chance to get the grade they deserve and as long as you put in the work you will definitely pass. I have never enjoyed taking a course more and would love to take more classes with her in the future.  ", "rating": 5, "expected_grade": "A+", "created": "2022-05-09T15:13:28Z"}, {"professor": "Juliana Van Meerten", "course": "EDHD460", "review": "Terrible. It’s nearly December and she’s managed to grade one assignment. The content seems arbitrary. I recommend taking any other edhd class with any other Professor", "rating": 2, "expected_grade": "B", "created": "2022-11-30T13:31:07.295550Z"}, {"professor": "Juliana Van Meerten", "course": "EDHD460", "review": "Fantastic instructor who cares for her students and uses the research from her mentor to create an Ed Psyc class based on Ed Psyc research. I feel as though I am actually learning in this class rather than just being expected to absorb and regurgitate too much information. The content I've learned has helped me while working as a job coach and tutoring individuals with intellectual disabilities. It's also further shaped my educational and career goals.\r\n\r\nAs someone mentioned, she's fallen behind on one major grading event. However, she's a fifth-year Ph.D. student who has no TAs, is teaching another class, and is in the middle of covid/flu season. I even have tenured professors with TAs who are grading at the same rate as her so it's nothing out of the ordinary.", "rating": 5, "expected_grade": "A", "created": "2022-12-01T03:22:16.360586Z"}, {"professor": "Alice Donlan", "course": "EDHD460", "review": "I have never written a review or thought about writing a review until I had professor Donlan. She is such an amazing teacher that relates all course concepts to real life and makes every topic interesting. She is the best professor I have had in my 5 semesters at this school and I seriously recommend taking her classes if you get the chance.", "rating": 5, "expected_grade": "A+", "created": "2023-10-25T15:55:36.168665Z"}, {"professor": "Alice Donlan", "course": "EDHD460", "review": "Dr. Donlan is an absolute gem. One of the best professors I have had at this university. She makes classes extremely low-pressure and discussion-based. I never felt like I wanted to skip class even though she records her lectures. The class content is manageable and relatively easy if you already have basic knowledge of psychology. Fair midterms and we wrote our own final exam. If you get the chance to take this class with her, do it!", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T19:08:06.109061Z"}, {"professor": "Alice Donlan", "course": "EDHD460", "review": "Amazing professor. Super low-pressure class, very discussion-based. I loved attending her classes and the content is super easy. Exams are super fair and open-note.", "rating": 5, "expected_grade": "A+", "created": "2024-01-25T04:07:14.951033Z"}], "department": "EDHD", "course_number": "460", "name": "EDHD460", "title": "Educational Psychology", "credits": 3, "description": "<b>Prerequisite:</b> PSYC100; or permission of EDUC-Human Development and Quantitative Methodology department.\nApplication of psychology to learning processes and theories. Individual differences, measurement, motivation, emotions, intelligence, attitudes, problem solving, thinking and communicating in educational settings.", "is_recent": true, "geneds": null}