{"average_gpa": 3.650174216027874, "professors": ["Joan Lieber", "Katryna Andrusik", "Jennifer Amilivia", "Amanda Schwartz", "Jennifer Amilivia", "Jennifer Amilivia", "Jennifer Amilivia", "Veronica Kang"], "reviews": [{"professor": "Jennifer Amilivia", "course": "EDSP211", "review": "She was okay. Her assignment instructions were sometimes a bit unclear or contradicting and her lecture style was not extremely engaging. I felt like I actually got more from just reading the textbook and then spending lectures vaguely paying attention. The assignments were not necessarily hard, just annoying at times.", "rating": 3, "expected_grade": "A+", "created": "2022-12-19T18:49:25.676969Z"}, {"professor": "Jennifer Amilivia", "course": "EDSP211", "review": "Professor Amilivia was a nice professor. She is willing to help her students and make appointments to meet with them. The content of the class is just bad ( which I know isn't necessarily her fault). Many classes were just her lecturing about legislation, which was very boring. Additionally, she canceled classes frequently because she had to observe her interns. While it was nice not having class, I do feel as though it made it hard to remember content when this class only meets once a week. Our midterm and final were open notes and internet, however, some of the questions were a little tricky. Overall, I liked having Professor Amilivia, but the class itself was very boring, especially for an introduction to the special education major.", "rating": 4, "expected_grade": "A-", "created": "2023-12-07T16:41:32.999513Z"}, {"professor": "Jennifer Amilivia", "course": "EDSP211", "review": "The content of the class itself was not the most interesting to me, but she was a very nice professor and made sure to give us lots of breaks during the 3-hour class. Online, multiple-choice midterm and final, and not too many other assignments. Overall a pretty easy class, but not the most engaging", "rating": 4, "expected_grade": "A+", "created": "2023-12-15T20:32:00.166487Z"}], "department": "EDSP", "course_number": "211", "name": "EDSP211", "title": "Introduction to Special Education", "credits": 3, "description": "<b>Restriction:</b> Sophomore standing or lower; and permission of EDUC-Counseling, Higher Education and Special Education department.\n<b>Credit only granted for:</b> EDSP210 or EDSP470.\nAn introduction to the field of special education. Students examine historical foundations, including legislation; review components necessary for effective service delivery; and develop an understanding of the role of collaboration and consultation with parents, school personnel and other professionals. In addition, students are introduced to the nature and characteristics of various disabilities and review current issues in the field including overrepresentation of minority students in special education, inclusion, and federal and state assessment mandates. Current topics are addressed including evidence-based practices, universal design for learning, and individualization and differentiation of instruction..", "is_recent": true, "geneds": null}