{"average_gpa": 3.563477698771816, "professors": ["Wesley Lawson", "Nicole Mogul", "Kazuo Nakajima", "Betsy Mendelsohn", "David Barbe", "Misti Yang", "Logan Williams", "Timothy Reedy", "Nicole Mogul", "Timothy Reedy", "Timothy Reedy", "Nicole Mogul", "Timothy Reedy", "Nicole Mogul", "Timothy Reedy", "Nicole Mogul", "Wesley Lawson", "Wesley Lawson", "Wesley Lawson", "Nicole Mogul", "Timothy Reedy", "Nicole Mogul", "Timothy Reedy", "Nicole Mogul", "Wesley Lawson"], "reviews": [{"professor": "Kazuo Nakajima", "course": "ENEE200", "review": "Nakajima might be a smart guy, but he does not appear so in class. His English is shaky, he says \"right\" or \"okay\" and giggles so often that you often lose track of what he is saying. He is adamant about students attending class. He started off the class by posting homework and lectures online (like any sensible prof would), but when attendance started to fall, he abandoned all use of online resources, opting instead to hand out all homework assignments and some lecture notes. His exams are off topic and do not demonstrate knowledge of the course. The only reason to attend class is for the attendance grade. He grades lecture by participation, which is outlandish given the lecture is 75+ so there is no way to participate every lecture. All knowledge comes for the textbook, the prof adds little extra information. Pray you have a good TA.\n\r\nTL;DR. Do not take Nakajima.", "rating": 2, "expected_grade": "A", "created": "2015-11-21T18:40:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Really don't know what people are complaining about.  I had him in summer 2014 and he was great.  I felt like the homeworks were clear and easy, the 2 papers were fairly short (i actually wrote more on both of them because they were so short), the 2 group presentations were short and straightforward and if you went to class and did the homework the tests were not difficult.  Pretty sure most of my class got an A or B at worst (aside for one guy who almost never came to class).\r\nWhen it comes to the material I think it throws off some engineering students because it requires some out of the box thinking and writing but I thought he was very knowledgeable. I liked the class a lot, my uncle has his own architecture firm and it made me think about the right type of balance you need between managers and engineers/architects and the ethics involved.\r\nI will admit the one negative is that he  mumbles and doesn't speak very clearly but he told us that and apologized for it like the first day of class, still think he's a great teacher.", "rating": 5, "expected_grade": "A", "created": "2014-07-13T12:43:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "One of those professors that really tires you out as the class progresses. In agreement with some other reviews, writing prompts and group projects are too vague. He ends up looking for certain things that are not clearly described, and the grades end up being very arbitrary. I was overall fortunate, and this didn't affect me, but looking at other's grades for exams and group projects, they seemed random at times. In the end, you might need a bit of luck to get the grade you want, which is especially annoying considering he is practically closed to regrades. He seems to think he is extremely generous on grading, when really, he's one of the harsher graders I've come upon.\n\r\nHe keeps a fairly interesting class, and is sarcastic at times. Sometimes he starts talking way too quietly for a class of our size. I would probably recommend the winter session, as other people on this page. However, do NOT expect it to be much easier; it's about the same level of difficulty I would guess. \n\r\nReading the book is not completely necessary, but it certainly helps. He has chapter summaries which are theoretically enough. The case studies are crucial for discussion though.\n\r\nAll in all, I would say he does a bad job of teaching this specific course. In my opinion, he fails to catch the heart of the issue of engineering ethics, and further fails to get people interested. I do not regret taking it over the winter, but it was a pain.", "rating": 3, "expected_grade": "A+", "created": "2013-01-23T15:00:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Class is very easy. Took it over winter. Schedule was rigorous, about five hours a day, five days a week, but the material its very comprehensible. Readings are short and easy. Two papers that are short, and two group projects that are pretty easy. Participation is relatively important. Midterm and Final are easy as well. Give effort, and an A is yours.", "rating": 5, "expected_grade": "A-", "created": "2012-06-01T13:27:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "This review is also for ENEE204 with Lawson, as I had him for both.\r\nLawson has a personality as described below, being sarcastic and fairly blunt.  He teaches his classes the same way, however it is not as bad as others have described below.\n\r\nThe biggest thing about Lawson is you cannot bs your way through the class.  He is very knowledgeable in the subjects he teaches, and can tell whether you know the material or are just rambling.   He does have a sense of humor, however sometimes you are on the other end of the joke.  If you take it personally, than you might not like him, but I don't think he ever truly dislikes a student.\n\r\nAll it comes down to with any class he teaches is you need to study.  His tests have subtle tricks that catch you if you're not paying attention, but I have never been given a question that was not similar to one we have done before in a homework or class example. He is not 'impossible', unless you don't study ", "rating": 5, "expected_grade": "A", "created": "2012-02-16T18:31:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Had him for 200 and 204. He expects a good deal from his students. In 204, he emphasized concepts and intuition in homeworks/quizzes/exams but not so much in lecture, which would have been preferable.\n\r\nENEE200 was a frustrating class since he would often assign rather vague writing prompts for essays and exams, but grade according to specific expectations he had in mind. Grading on exams and essays seemed, to me, very arbitrary.\n\r\nHe's a funny guy, but not my favorite teacher. Both of my experiences with him were not the best, but I can see how some might really like him.", "rating": 3, "expected_grade": "A", "created": "2011-12-30T12:12:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Terrible professor. Soft spoken and doesn't care about students. Not be fooled by the grade distribution. The A's is only about 20% of the class realistically for ethics. Looks for specific terms in every answer. Will take off all points if you dont have the specific answer that he has.", "rating": 1, "expected_grade": "BC", "created": "2011-11-16T23:14:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Ok class, ok teacher, more reading than I would have expected, but it wasn't bad.", "rating": 4, "expected_grade": "A", "created": "2010-11-16T02:30:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "I would say Lawson is a pretty good professor. He's fair and he explains the material pretty well. But he shows up late a lot, which I find stupid because he doesn't give you points and mark you in when you show up late. I was late only once! That, and you have to say, \"Good Morning Professor Doctor Lawson.\" But as a professor, I would say he's not bad.", "rating": 5, "expected_grade": "B", "created": "2010-02-02T15:56:00Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Professor Lawson was amazing. He reviewed all material supposed to be covered in homework and none of his exams or papers were easy. Even the group project was a simple task. However, this is based off of having taken the course in winter. Either way I would highly recommend taking Professor Lawson.", "rating": 5, "expected_grade": "A", "created": "2009-01-28T16:23:00Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "ENEE200 isn't really a class to worry that much about in general, but it was very enjoyable wunder Nicole's instruction. She creates a great atmosphere every lecture, and it's a nice change of pace from all of the equations and circuits that we have to deal with in every other major requirement course. Interesting lectures, including a lot of video content, and a lot of thought-provoking conversatio about Ethics in Engineering. Great class!\n\nShort essay due every week (Friday night for my class), but they're pretty simple to do. There is a bit of reading to do for the class, but that's just characteristic of ENEE200. Nicole pushed her final to the last day of class so that there wasn't a final during finals week, so that was nice. She also handed out candy the class before halloween, which was also nice.", "rating": 5, "expected_grade": "A", "created": "2015-11-13T08:06:00Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Nicole is great. Initially I thought having engineers taking an ethics class was kind of ridiculous, but after taking her class I have to say that if anyone was going to make the class worthwhile it's her. She creates an excellent atmosphere in the classroom that encourages people to participate and think in a new way. She is passionate about the material, and that passion translates to everyone else in the class. The class is not very much work and her expectations are totally reasonable. I'm really glad that I took this class with Dr. Mogul and I hope that more people get the opportunity to take this class with her.", "rating": 5, "expected_grade": "A", "created": "2014-12-03T21:09:00Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Fine lady honestly. Funny at times. Long and boring lectures. Lots of assignments although no final exam but a long paper. Tries to do fun things but don't turn out to be so. Reading each week and assignment each Friday (hated this assignment). Stupid skit at the end of the semester which is pointless and stupid for an ethics class imo. ", "rating": 4, "expected_grade": "A-", "created": "2018-12-13T18:55:03Z"}, {"professor": "Misti Yang", "course": "ENEE200", "review": "Misti is a great professor! You will get an A by going to lecture and putting in a decent effort. I'm ending the class with a HIGH A probably one of my highest but I also liked the topics. Don't be alarmed with the reading and papers it not too bad. (Coming from someone who hates papers).", "rating": 5, "expected_grade": "A+", "created": "2018-12-17T19:49:44Z"}, {"professor": "Misti Yang", "course": "ENEE200", "review": "super nice and understanding. ENEE200 is a very easy A, as long as you participate in discussion and you do the weekly writings. they are graded very leniently so even if you're absolute garbage at writing and write like a 7th grader like me, you can still do very well in this class. some of the case studies are interesting sometimes, but the material can get boring at times. but highly recommend as a gpa booster class. ", "rating": 5, "expected_grade": "A", "created": "2018-12-18T05:54:02Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Dr. Mogul is an extremely unintelligent woman, who tries to be relatable but comes off as ingenuine. While it may seem that she has the best intentions, it is clear that the entire coursework is BS. I would take the course if you want an easy Gen Ed and are an engineering major, but there are plenty of better and easier Gen Ed classes to take. Honestly, this class is a lot of writing and extremely easy, but it was a struggle to take her seriously during lectures, especially when she cuts of students answers mid-sentence, embarrassingly directs her anger at the Assistant Dean of the Engineering IT Staff for her technology not working, and for her ridiculously useless assignments. All this class has taught me about ethics is stuff I already know. ", "rating": 2, "expected_grade": "A+", "created": "2019-05-10T21:30:26Z"}, {"professor": "Logan Williams", "course": "ENEE200", "review": "An easy A in terms of content, but way too much writing. The only reason anyone showed up to lecture was to fill out lecture cards (basically for participation) and even then, half the class stopped showing up by the end of the semester. Dr. Williams would make edits on her Powerpoints during class, and the discussions facilitated in class were too broad and not technical at all. If you are an engineering major looking for stimulating technical conversations about privacy and AI and bridges collapsing and things of that sort, this is not the class for you. ", "rating": 1, "expected_grade": "A", "created": "2019-12-06T19:08:58Z"}, {"professor": "Logan Williams", "course": "ENEE200", "review": "Personally I liked Dr. Williams. I think that if you are intrinsically motivated to take this class, she is a good fit for you. You definitely don't have to be an engineering major to understand the material. Although there are easier ways to get gened credits, I enjoyed this class because it helped my writing and critical thinking skills.\r\n\r\nThis was Dr. Williams's first time teaching at UMD. I thought the class was very interesting but most people did not seem to enjoy it. She has a tough time engaging her students but definitely knows a lot about ethics and engineering and is happy to share her knowledge in office hours. Most of the assignments seem a little silly, but they do get you thinking about what you've read and learned in class. The TA makes the difference for your grade; I was lucky to have a lenient one.\r\n\r\nOverall this class takes a lot of time, since there's a lot of writing involved. But as long as you follow the writing guidelines provided by Williams and ask for clarification when needed, you'll be fine. ", "rating": 5, "expected_grade": "", "created": "2019-12-18T03:07:46Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Definitely one of the more interesting classes that the ENEE department offers. The UTFs are all pretty good and getting a good grade isn't hard if you put effort into your writing. Dr. Mogul was flexible when we moved online and was receptive to students if they needed extra time on an assignment. Her instructions for assignments can be confusing at times, so small warning.", "rating": 5, "expected_grade": "A+", "created": "2020-05-19T17:46:10Z"}, {"professor": "Logan Williams", "course": "ENEE200", "review": "The class is an easy A. It is a lot of writing, but you can bang it out in 2 hours. The course material is pretty relevant to current times. The only thing that I would be weary about is her choice of TAs. They can be really nit picky about grades, so you really have to be on top of them. ", "rating": 2, "expected_grade": "A+", "created": "2020-11-16T05:46:52Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Dr. Mogul made us do several somewhat irritating activities, in which we had to walk around our house or go outside (in the\r\nmiddle of winter) to listen to sounds, smell random items, and draw random objects. The last time I did this much smelling and drawing, I was in Elementary School. Professor Mogul definitely had good intentions with these activities, but most of the time came across as childish and inconvenient.  I also did not like that the details of the CEC paper were not revealed until a few days before the first draft had to be complete. ", "rating": 1, "expected_grade": "", "created": "2021-02-09T05:30:11Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": " I did not appreciate being required to pay over $30 for the digital coursepack, which contained only two articles that easily could have been uploaded to Elms. This felt like a complete waste of money. I also just believe that there was a lot of unnecessary material in this course. A lot of activities we did felt more like ice breakers that didn't have a clear connection to ethics.", "rating": 2, "expected_grade": "", "created": "2021-02-09T05:34:37Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "DO NOT TAKE HER CLASS especially do not take the winter or summer session. Stupid activities in class and read a lot, Almost tons of boring reading materials and also the reports that 1-1.5 single spaced long(everyday). If u r not engineering students, don't take her class; if yes, take the regular sessions or another prof. GRADES are fine tho.", "rating": 1, "expected_grade": "A+", "created": "2021-02-09T05:36:51Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "She's super nice and I found the class pretty interesting. There's a lot of writing for an engineering class. She made us do all sorts of activities moving around and doing stuff, some were fun and some were random.", "rating": 5, "expected_grade": "", "created": "2021-05-21T17:47:52Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "tldr, WORST PROFESSOR AND WORST CLASS I’VE EVER HAD.\r\n\r\nI’m my three years of taking classes at UMD, this class and this professor are by far the most unenjoyable, unproductive, and irritating course I’ve had the displeasure of taking. ENEE200 is a waste of time and a big one at that. You are assigned 2+ readings/videos a week that simultaneously say nothing interesting and talk down to you. The authors are either nobodies, overrated academia stars, or both. You are also assigned 2 to 3 writing assignments a week, sometimes due the same day that they are assigned (so good luck if you had any other plans Thursday night cause that assignment needs to get done). Expect to put in 2-3 hours+ a week of your own time into this time waster that just leaves you irritated after completing the assignments filled with condescending questions that you have to answer. If being “woke” was a major, this would be a core requirement.\r\n\r\nClass time itself is a mess. Lectures and discussions are mandatory (of course). You learn nothing and are instead divided into groups to discuss whatever ridiculous question is posted on the board, while the professor walks around and somehow contributes a negative amount to your group when she comes to speak with you. Discussions are somehow even more pointless, we’re asked to do these ridiculous activities like copying the actions your partner does, or writing down what your anthropomorphized phone you’ll say to you. Discussion activities are humiliating and degrading. We’re in college not kindergarten for God’s sake!\r\n\r\nOnly plus side is that as long as you turn in assignments and attend lecture and discussion, you will get an A. But I urge you to take a class that’s actually interesting, or at least any professor that isn’t Mogul, who is the least interesting, most shallow, and most unintelligent person I’ve run into during my time at UMD. Is it really an easy A if you need to put in 6+ hours a week into it, if you count lecture, discussion, and impromptu assignments? I think that the only reason Mogul is still around is that the material she’s pushing the -20 IQ slogans that academia has come to love in recent years. Avoid her and this class at all costs.", "rating": 1, "expected_grade": "A", "created": "2021-10-14T19:14:35Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Honestly these reviews are a bit much, and I would disregard them. I had Mogul for Fall 2021 semester. Anyone who couldn't digest the material or her method of teaching really needs to look inwards at themselves instead of pointing fingers at the professor. Mogul spends so much time preparing for lectures and really cares about her students. You can tell this class is her passion and and the effort she puts into this is also admirable. You have to take this class anyways probably so go with her, she's really nice. Easy A, too.", "rating": 5, "expected_grade": "A", "created": "2021-12-17T03:07:14Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "Disclaimer: I took this class over the winter.\r\nProfessor Lawson teaches ENEE200 well. I was already familiar with his style, and enjoyed it through the 3 short weeks of the class. Though the lectures were long and sometimes redundant, I'd rather take it with him than someone else because of his comedy and care.", "rating": 4, "expected_grade": "", "created": "2022-01-23T00:08:42Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "This professor assigns an absolutely absurd amount of work. As an Electrical/Computer engineer, I already have other difficult classes conceptually, this class is immensely time-consuming and the professor does not seem to understand that it is a 3 credit course. Out of all my classes right now, on ELMS I have 6 assignments due in the next week and 5 of them are for this class.", "rating": 1, "expected_grade": "A", "created": "2022-04-12T18:12:26Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "He makes ENEE200 class easy as hell. Just do the assignment on time and you are good. Hopefully, your ta is chill.  You have readings but from my experience, you can skim the readings, or not read at all.", "rating": 5, "expected_grade": "A+", "created": "2022-09-21T18:28:52.589829Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "Trash professor. Makes us do stupid abstract unrelated skits in discussion sections that have little to no relations to the course topics. Forces us to do a land declaration in the first class and say how we stole the land we live in from Native Americans. Made a very poorly supported and unprofessional brochoure that serves as a basis for discussion topics. My TA gave her some feedbacks from my section containing some concerns regarding the workload, she dismissed it instantly.", "rating": 1, "expected_grade": "A-", "created": "2022-11-21T02:43:31.101685Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "Easy. No Exams, or quizzes. Just some small written assignment. You can skim the readings. This class is basically pass fail, you do work you get an A+", "rating": 5, "expected_grade": "A+", "created": "2022-11-28T02:45:02.301836Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "Professor Reedy is a great professor, but ENEE200 is a terrible class. It’s organized in a way that prioritizes time management over quality work (grading contracts). It’s the busiest gened I’ve taken, so I can’t emphasize enough: Don’t take this class if it is not a requirement. There’s better geneds out there.", "rating": 2, "expected_grade": "B", "created": "2022-12-19T15:55:57.853926Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "I took this class the previous summer with Dr. Lawson, and I gotta say, it's not that bad of a course if you're already an engineering student. For starters, there's no heavy math, or math at all, and it's really just a philosophical discussion every lecture. We didn't have discussions during the summer session, instead, we'd openly discuss as a class the different readings we'd have to read right before. Participation was fair and honest as long as you said something, you got points.\r\n\r\nThe writing prompts on the final exam were somewhat vague; even I got points off because apparently I \"misinterpreted the question\". But as long as you're able to regurgitate the appropriate material based on keywords you'll see, you'll be fine. Overall, this class is light work, and the professor is quite boring at times, but at least it's not gonna give you any trouble. Keep up with the readings, say 1-2 things each class, clearly articulate key concepts and terms, and you'll get an A+.", "rating": 5, "expected_grade": "A+", "created": "2023-01-07T05:48:51.663229Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "The class doesn't really require that much thinking, kind of interesting, I guess. Lot of busy work in the class and the final project is a long paper. Reedy is great though, the grading contract system is super stupid in my opinion. There are better gen eds to take for sure unless this is a requirement.", "rating": 3, "expected_grade": "A", "created": "2023-01-22T00:31:06.305584Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "I took the winter session, so every day was equivalent to a normal semester week. The daily homework was to read case studies about sketchy/unethical incidents (usually ~4 pages of reading) and write a paragraph about them. There were a few quizzes, an independent paper (2-3 pages), a final exam, and two group projects. Dr. Lawson always drops hints (or even whole quiz questions) for what he's expecting, and the instructions are always extremely clear. He does have a tendency to mumble/slur some types of sounds, which *may* be difficult to understand if you have a hearing impediment. The course content can be dry at times, but he really tries to engage people and relate the content back to real life examples. You will get the most out of the class if you TALK. If you don't make the effort to engage, then this will be a terribly boring class (but you can still get a good grade).", "rating": 5, "expected_grade": "A+", "created": "2023-01-24T22:26:14.059030Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "I agree with other users that the work load is a little bit too much and lectures/assignments can be little boring. But she's a great professor and a great human being. She genuinely puts in a lot of effort into the class. My TA was super chill and gave us extensions when we needed it. You will unfortunately meet people in the class who lack the emotional maturity to fully appreciate what is being taught and the importance of it. Their fragile egos cause them to point fingers at the teacher instead of taking a step back and let some of the ideas sink in. All in all it should be an easy A as long as you put in the time to do the work and participate.", "rating": 4, "expected_grade": "", "created": "2023-01-30T01:13:23.679305Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "this class is very mid. theres no thinking, its not hard, its just a bunch of busy work. The problem is it a lot of busy work sometimes. take it over the winter if you can you will be very happy not taking it over a semester. The final project being a really long essay due right before actual finals was annoying. also the final exam being an essay which honestly wasnt needed to even be given in the middle of finals didnt help. overall an easy A if you have a good utf and keep up w all the busy work.", "rating": 3, "expected_grade": "A", "created": "2023-05-15T05:20:32.889685Z"}, {"professor": "Nadine Combatir", "course": "ENEE200", "review": "Really nice and helpful. I feel more ethical now!", "rating": 5, "expected_grade": "A+", "created": "2023-09-21T16:42:33.664271Z"}, {"professor": "Karen Rezkalla", "course": "ENEE200", "review": "Karen is such a kind and helpful person. She elevates this class and makes the Friday discussions fun. She also gives helpful feedback on assignments and grades in a timely manner. If I could take this course again I would want her to be my TA again!", "rating": 5, "expected_grade": "A+", "created": "2023-10-03T17:35:10.703675Z"}, {"professor": "Nadine Combatir", "course": "ENEE200", "review": "She really fostered a sense of belonging within the classroom and throughout the overall class!! As the previous review stated, I feel a lot more ethical now!", "rating": 5, "expected_grade": "A+", "created": "2023-10-03T23:58:04.353909Z"}, {"professor": "Kavin Loganathan", "course": "ENEE200", "review": "🐐", "rating": 5, "expected_grade": "A+", "created": "2023-10-18T18:43:12.059852Z"}, {"professor": "Matthew Weirich", "course": "ENEE200", "review": "Matthew is goated easily the best TA we learned so much and it was very fun because funny", "rating": 5, "expected_grade": "A+", "created": "2023-10-27T18:10:34.749261Z"}, {"professor": "Matthew Weirich", "course": "ENEE200", "review": "Very chill", "rating": 5, "expected_grade": "A", "created": "2023-10-27T18:37:17.473269Z"}, {"professor": "Matthew Weirich", "course": "ENEE200", "review": "Best TA I have ever had. very easy to communicate with if there are any problems occurring. Makes the class very enjoyable. a GOAT.", "rating": 5, "expected_grade": "A", "created": "2023-10-29T03:24:23.089517Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "this professor gives an absolutely ridiculous amount of work. this class is not supposed to consume 5 hours a week and i shouldnt have to sit at my desk for an hour to try and figure out what the actual assignment is. i dont care if she spends time preparing her lectures she should realize that this is a technical elective and 100% of her students have actual meaningful work they need to get done and this just gets in the way.", "rating": 1, "expected_grade": "A", "created": "2023-11-30T04:50:01.622109Z"}, {"professor": "Matthew Weirich", "course": "ENEE200", "review": "Take this guy hell make the unbearably tedious class actually enjoyable. learn a lot every week as well", "rating": 5, "expected_grade": "A+", "created": "2023-11-30T04:51:57.079916Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "Do the work you'll get an A+. Prof Reedy is super nice and a good guy. Class is interesting. There are a good amount of assignments which are a little annoying but not a bad class to take.", "rating": 4, "expected_grade": "A+", "created": "2023-12-03T18:55:44.671555Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "Class if fine, it's moderately interesting but nothing too crazy. Lectures are usually pretty fun, and the professor is an engaging person. HOWEVER, where this class really loses all of its points is the amount of work they assign - especially around finals. \r\nThere is just paper after paper after paper..... right when finals are happening.", "rating": 2, "expected_grade": "", "created": "2023-12-11T21:26:27.063151Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "Everything is basically just for completion, not much thinking required to get an A. Just show up and do the work. Also be prepared to be treated like a kindergartener in some of the discussion prompts, but at least Reedy seems pretty good compared to what I've heard about Mogul.", "rating": 4, "expected_grade": "A", "created": "2023-12-11T21:27:44.411876Z"}, {"professor": "Nicole Mogul", "course": "ENEE200", "review": "She’s a miserable person and it genuinely feels like she came from teaching elementary school as she doesn’t know how to talk to college students. She’ll condescend you for nothing and make you feel inferior for disagreeing with her. Avoid at all costs.", "rating": 1, "expected_grade": "", "created": "2023-12-21T18:31:45.111286Z"}, {"professor": "Wesley Lawson", "course": "ENEE200", "review": "I'm currently taking this class in Winter 2024, and I'm really not enjoying it.  I tried to adjust my rating for personal bias, but I just cannot compromise my final verdict based on many unfavorable factors.  From what I've heard, Lawson is about the best you're gonna get from ENEE200, so take what you will from this review.\r\n\r\nFirst on the list of personal biases, the class is 3 hours a day for 3 weeks.  ELMS lists 2 hours of lecture and 2 hours of discussion, but in reality it's 3 hours of Lawson's lecture per day, with a 15 minute break somewhere in between.  I have grown increasingly impatient to lectures over the course of college, and even with taking ENES197 last winter, this class is somehow even more of a slog.  Admittedly, there are some pretty interesting stories shared, and the class can get pretty interesting to engage with regarding certain topic discussions.  However, this is not enough to make the class not unbearably dull for me most of the time.  Furthermore, Lawson makes us have our cameras on unless there's a valid excuse, and he states that he retains the right to take off attendance credit for having cameras off.\r\n\r\nSpeaking of, the grading.  If you've had Lawson before, like I did for 205 this past semester, grading will be pretty familiar.  The grade is split into 5 equally weighted parts: participation, homework and a paper, quizzes, final exam, and group project.  One quiz and two homeworks are dropped, and the quizzes and final are theoretically closed book closed notes.  I have issues with three of those components.  Starting with participation, it's not really clear what constitutes a good or bad participation score.  I got a 9/10 for participation 2, and an 8.5/10 for participation 3, both of which are below the mean, and I have no idea why.  I think he mentioned vaguely mentioned some form of criteria on the first day, but there's no rubric, so I can't tell if it's because of internet issues potentially causing my camera to not display sometimes (it always displays on my screen), or if it's because I really struggle to pay attention in class, or what it is.  Regarding the quizzes, they're a mixed bag.  Quizzes 1, 2, and 5 are fairly straight-forward multiple choice affairs, where 5 questions are worth 20% of the quiz each.  3 attempts are given.  Quiz 3 is an open response on line drawing.  Quiz 4 is an open response on conflicts of interest.  Some issues.  I fundamentally disagree with the use of assessments in this course.  They made sense in 205, since each quiz had a corresponding homework.  While some quizzes did go beyond the homework content, we could generally gauge our progress on a quiz's topic from the corresponding homework's feedback.  That is not the case in this class.  I found the homeworks did not correspond well to either quiz 1 or 2, and nothing at all correlated to quiz 3.  Quiz 3 in particular went poorly, as the class average was pretty low (for transparency, I got lower than the mean), but we only got 2 examples of how to do a line drawing (one incomplete example from the slides, and one pretty bad example in lecture).  Yeah the quiz was probably pretty easy, but it's just testing on something where you either memorize a chart or you don't, and it seemed like there was no in-between.  Speaking of, for quiz 4, which I haven't taken yet, we have to memorize specific facts about one of the case studies, and regurgitate conflict of interest information about it.  I don't know how this will turn out, but this accomplishes absolutely nothing.  In fact, none of these quizzes do, and neither will the final exam.  Why are there examinations in an ethics class?  Sure, there are incorrect ways of analyzing a situation.  However, the mere presence of highly weighted examinations imply that there are objectively correct ways of analyzing situations, which is simply not true in any situation with any sort of complexity.  It boils down ethics into algorithms or correct/incorrect answers, which I believe is poor design.\r\n\r\nIn terms of the day-to-day work, there is homework due almost every day, and some of it can get pretty tedious.  However, it's not the worst thing to keep up with, and that's coming me who can't write to save my life outside of the last minute.  Some days are worse than others, but if I had to put a total, it's about an additional hour each day, give or take.  I haven't started my personal paper or group project yet, so that number could probably increase to 2 additional hours per day if you pace yourself well, but I'll probably have to take 3 or more per day this upcoming week since I'm rather behind on those assignments.  It's a winter course I guess.\r\n\r\nI really wanted to like this class.  I gave Lawson 4 stars for 205, and that was in spite of hating the labs.  However, this class is just tedious, and I disagree with his grading methods for this class on a fundamental level.  I realize that I'm writing this review before the end, but I'm at the point where I know this professor and I know this class well enough to know that I thoroughly hated this class.  I've unfortunately had multiple worse classes in the ECE department, but this was certainly not a highlight.  However, this is just my experience.  You may like this class because you like the way Lawson does things, the way he runs things clicks better with you, or simply because he sometimes has interesting stories to tell, and some of the classes have had interesting moments.  You may hate the class more than I do for different reasons than what I brought up.  All I know is that, in my opinion, ENEE200 is a sad state of affairs.", "rating": 2, "expected_grade": "", "created": "2024-01-14T11:13:58.603180Z"}, {"professor": "Christine Alexander", "course": "ENEE200", "review": "Christine is very sweet and accommodating! The class can be a lot of work, but honestly, if you just do the assignments, you're basically guaranteed to get an A. I'm a bit confused about all of these reviews as a lot of the curriculum for her class, while it may seem childish, is literally required curriculum for her to teach (aka it isn't her fault).", "rating": 5, "expected_grade": "A+", "created": "2024-02-13T23:55:41.523260Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "Reedy is goated. The labs can be hit or miss but if your TA is chill then you’re good. Lectures are pretty interesting and the professor is an engaging lecturer and very understanding on late assignments. You’re graded on a different system (grading contract) which I think is dumb as it is mostly pass/fail.", "rating": 5, "expected_grade": "A", "created": "2024-03-28T01:20:53.795193Z"}], "department": "ENEE", "course_number": "200", "name": "ENEE200", "title": "Technology and Consequences: Engineering, Ethics, and Humanity", "credits": 3, "description": "What makes a technology socially responsible?  At UMD, the Fearless Ideas campaign asks us to aim our enthusiasm for technology at big real problems. At the same time, we are coming to appreciate the increasingly complex nature of technological systems as they become integrated into all forms of infrastructure, we realize they may be unpredictable, interdependent on social and biological systems, and have unintended consequences. In this midst of this complexity, people make decisions with far reaching impacts. How then do we follow our passion for technology and innovation but also stay skeptical in a way that allows us to consider the potential and shortcomings of technology? Designed for both engineering and non-engineering students wishing to explore and assess the impact of engineering technology on society and the role of society in generating that technology.\n<i>Restricted to students in Electrical Engineering (09090) and Computer Engineering (09991) majors only. Non-majors interested in the course should get into the holdfile; Department will make seats available to students in the holdfile after December 8, 2021.</i>", "is_recent": true, "geneds": null}