{"average_gpa": null, "professors": ["Joseph Bailey", "Pamela Armstrong", "Pamela Armstrong", "Pamela Armstrong", "Pamela Armstrong", "Pamela Armstrong", "Benjamin Huffman", "Joshua Cocker", "Benjamin Huffman", "Christopher Troilo", "Joshua Cocker", "Benjamin Huffman", "Joshua Cocker"], "reviews": [{"professor": "Jose Suarez", "course": "ENES190H", "review": "Dr. Suarez is a really good speaker. He knows his stuff, and he presents it well. He has a HUGE ego and he talks about himself and how important he is, and everything he's done (he does know how to cover it by saying he's given up all that fame to teach... but yeah...). Anyway he does have some inspirational lectures and he does get you to think differently. ", "rating": 5, "expected_grade": "A", "created": "2008-12-26T23:32:00Z"}, {"professor": "Joseph Bailey", "course": "ENES190H", "review": "There is nothing not to love. Great professor! \r\nHe has a lot of experience, so he is extremely knowledgeable in probably anything he talks about. He makes lectures fun but manages to maintain the professional atmosphere. \r\nHe is really easy to talk to, always has a smile on his face, and is always willing to guide you in the right direction. \n", "rating": 5, "expected_grade": "A", "created": "2010-03-17T00:15:00Z"}, {"professor": "Joseph Bailey", "course": "ENES190H", "review": "He's the man.  Really good lecturer, funny, explains most things very well.", "rating": 5, "expected_grade": "A", "created": "2009-12-08T00:45:00Z"}, {"professor": "Joshua Cocker", "course": "ENES190H", "review": "This man is just about everything you could ask from a college professor. He cares about you doing well and he is smart enough to work with you and figure out your problem areas.", "rating": 5, "expected_grade": "A+", "created": "2024-01-24T21:50:05.399730Z"}], "department": "ENES", "course_number": "190H", "name": "ENES190H", "title": "Introduction to Design and Quality", "credits": 4, "description": "<b>Prerequisite:</b> Must be in the Quest program.  Cross-listed with BMGT190.\n<b>Credit only granted for:</b> BMGT190 or ENES190.\nQUEST students learn and apply design practices to design new products and services. Working in multidisciplinary teams, students use quality and process improvement methods to identify, analyze, and recommend solutions to real-world problems.\n<i>Restricted to QUEST program students. Cross-listed with BMGT190H.   Credit granted for BMGT190H or ENES190H.</i>", "is_recent": true, "geneds": null}