{"average_gpa": 3.7616224648985956, "professors": ["Ramsey Jabaji", "Sami Khan", "Natasha Chapman", "Darren Pierre", "Darren Pierre", "Darren Pierre", "Darren Pierre", "Darren Pierre", "Darren Pierre", "Darren Pierre", "Darren Pierre", "Darren Pierre"], "reviews": [{"professor": "Ramsey Jabaji", "course": "ENES317", "review": "Awesome class! Ramsey offers a lot of great advice in the leadership. He is very enthusiastic and engages the class very well. He is probably the most confident and poised lecturer I have ever had here. Class consisted of group presentations and activities pertaining to leadership. Ramsey sometimes gets distracted but he is very entertaining to listen to. The 2 1/2 hour classes are rarely boring. Its pretty much a guaranteed A since Ramsey is a very easy grader, unless you don’t show up to class and don’t do the assignments. ", "rating": 5, "expected_grade": "A", "created": "2014-05-08T03:06:00Z"}, {"professor": "Natasha Chapman", "course": "ENES317", "review": "The course was completely online and pretty structured, very rarely interacted with the professor at all. We had weekly discussion posts and quizzes, and a couple of short papers to write. However, there was an unnecessarily enormous amount of reading assigned every week, which sucked because the reading tended to cover redundant content.", "rating": 4, "expected_grade": "A+", "created": "2021-01-13T07:09:38Z"}, {"professor": "Darren Pierre", "course": "ENES317", "review": "He's really nice guy who's super passionate about what he's teaching.", "rating": 5, "expected_grade": "A+", "created": "2022-12-01T02:19:08.533437Z"}, {"professor": "Darren Pierre", "course": "ENES317", "review": "Dr. Pierre is very passionate about his leadership course. He is always full of energy during his presentations and is very knowledgeable of the topics covered. Most of the assignments in the course are very simple and straightforward, and the two quizzes we had were open-notes. You should note before taking his course that (1) he opted not to share his lecture slides, so you have to either take note or take pictures of the slides and (2) the class asks for quite a bit of involvement, so be prepared to do some activities during class. All in all, this is an easy course where you get exposure to different kinds of leadership models. I would recommend this course.", "rating": 5, "expected_grade": "A+", "created": "2023-05-25T14:16:20.444855Z"}, {"professor": "Darren Pierre", "course": "ENES317", "review": "This class is a joke when it comes to a grade. I got a 102.5% in the class. Dr. Pierre is extremely nice and really cares about each student and their well being. Class is an easy A I would recommend it or any class with Pierre to you.", "rating": 5, "expected_grade": "A+", "created": "2023-12-27T21:31:23.569492Z"}], "department": "ENES", "course_number": "317", "name": "ENES317", "title": "Introduction to Leadership in Engineering, Science, and Technology", "credits": 3, "description": "<b>Restriction:</b> Must be in the Minor in Global Engineering Leadership(#EN09).\n<b>Additional information:</b> Students not meeting restriction requirements should add themselves to the course holdfile. Restrictions DO NOT apply to winter and summer terms.\nDevelop a comprehensive overview and introduction to leadership and organizational development. Students will reflect on their own leadership experiences, develop a strong foundational knowledge of leadership theory, and advance their capacities in effectively leading teams. Students will connect leadership theory to practice by engaging in case study analysis and critique leadership practices enacted within engineering and technology settings. Students will complete self-assessments to better understand their own leadership strengths and refine their approaches to leadership by incorporating theories covered in this course.\n<i>Restricted to students in the Engineering Leadership Development minor (#EN04) and the Global Engineering Leadership minor (#EN09). All others may go on the holdfile.</i>", "is_recent": true, "geneds": null}