{"average_gpa": 3.438135593220339, "professors": ["Kuan-hung Lo", "Kuan-hung Lo", "Kuan-hung Lo", "Christine Alexander", "Christine Alexander", "Kuan-hung Lo", "Christine Alexander", "Dennis Frezzo", "Timothy Reedy"], "reviews": [{"professor": "Kuan-hung Lo", "course": "ENES200", "review": "An incredibly amazing and affectionate professor. Professor Kuan-hung Lo always shows a deep concern for both the course material and his students, always being open to feedback. What's more, he's refreshingly open about himself, creating a welcoming atmosphere that made it easy to have honest conversations after class or during asynchronous lectures. TMI: his research interests include robots in everyday life, ethics in robotics and artificial intelligence, and gender issues in technology. \r\n\r\nThe best part is that the class isn't about right or wrong answers since it focuses on ethics. Professor Kuan always encourages students to express their beliefs and perspectives, emphasizing the importance of respecting everyone's opinions regardless of differences. This mindset carries over into discussions, where we talked fascinating topics and engaged in interesting activities. All these activities aimed at fostering self-awareness. In conclusion, the course provided an inclusive and diverse environment. Moreover, there is no pressure about grade because the class doesn't use standard grade system but grade contract instead, which based on timely completion and decent work. So complete your assignment on time and do it with some genuine effort.\r\n\r\nPros:\r\n- Incredibly caring and amazing professor\r\n- Deep concern for course material and students\r\n- Welcoming atmosphere for honest conversations\r\n- Emphasizes respect for diverse opinions\r\n- Inclusive and diverse learning environment\r\n- Grading contract based on timely completion and decent work\r\n\r\nCons:\r\n- Weekly assignments: there are a lot of written assignments in the course. You should expect 2 written assignments per week (a short one: pre-lecture or exit ticket AND a long one: CEC or RR). Although the workload is distributed fairly, I usually struggle with writing because I overthink. So I sometimes got overwhelmed because of my other STEM courses. But if you are good with writing with supporting evidence then there is no issue.\r\n\r\nI definitely recommend this class. The contents are informative and everyone is respectful. ENES200 gives DSHU and SCIS and is easy A course.", "rating": 5, "expected_grade": "A", "created": "2023-05-26T00:26:53.934366Z"}, {"professor": "Hongyang Du", "course": "ENES200", "review": "GOAT TA! Love the lab. He is so nice and supportive. Gonna love him forever.", "rating": 5, "expected_grade": "A+", "created": "2023-10-10T15:34:20.247436Z"}, {"professor": "Christine Alexander", "course": "ENES200", "review": "If your main goal is to be in a class with disarray, lengthy and extremely childish activities, as well as being talked to like an elementary schooler then this is a great class for you. I will be honest and say that this class is good in terms of its grading scheme in which it is completion, but it gives next to no wiggle room or understanding for extenuating circumstances apart from for attendance. \r\n\r\nIf you are taking this class for any reason other than it being required for you, I strongly urge you not to, or at least to not take Christine. it is somewhat amusing to look at while not remembering that you are also graded for engagement, at which point you realize that you are paying hundreds to thousands of dollars this semester to be forced to make bird calls or dance during an engineering course. \r\n\r\nYou have several assignments required every week, required attendance, required reading/listening/watching every week amounting to hours outside of the class and no time in class to complete any of it. so for this reason, if you have a lot on your plate this semester maybe don't take it. \r\n\r\nenough with the cons, here's the pro's of taking the class / Christine:\r\n- easy to get an A if you dedicate a lot of time to the course and don't forget anything. \r\n- it's essentially a sociology class so if that's your thing just know if you don't get into any sociology classes, you can settle for this one. \r\n- you don't have to take any notes, there's no exams. just remember generally what was discussed in each class.", "rating": 1, "expected_grade": "A-", "created": "2023-10-23T03:50:11.539582Z"}, {"professor": "Christine Alexander", "course": "ENES200", "review": "Christine is a great professor as she is super nice and helpful. However, the class itself is hit or miss. \r\n\r\nLet me start with the pros:\r\nThe contract grading system is really nice. It is basically completion grades for hard work and reasonable answers, so it’s an easy A.\r\nThe TAs are really nice and chill\r\nThis class satisfies both humanities and I-series for Gen Ed credit\r\n\r\nCons:\r\nThere is way too much homework. Every week, there is at least 3+ hours of homework (2 pre-lecture assignments and a weekend assignment). While homework is obviously important, some of the assignments feel unnecessary or can be much shorter. This is a Gen Ed class and shouldn’t have as much work as major requirements. \r\nThere is a lot of busy work. The week reflection assignments don’t need to be 500 words and the final reflection seemed unnecessary given that we already had the final ethical analysis paper due that same week.\r\n\r\nIn short, this class is not for everyone. Some people will enjoy the class and all the activities while others won’t. Though if you need to satisfy Gen Ed requirements, this class is a fine choice. It’s an easy A but just beware of the workload.", "rating": 3, "expected_grade": "", "created": "2023-12-15T22:40:52.299586Z"}, {"professor": "Christine Alexander", "course": "ENES200", "review": "The Class Is Easy, and Christine is a nice person. But her class is pretty terrible. \r\n\r\nPros: There are virtually no grades. Put some mild effort into the (very simple) assignments and paper and as long as it's coherent you'll be fine. The TAs are usually on your side and will help you with whatever you need. \r\n\r\nCons: Pretty much everything already said. This class felt like elementary school. We did \"fun\" activities such as \"pretend to talk to inanimate objects around the room at different distances\", \"walk around the room impersonating words\", and \"diagram a person flipping a light switch.\" Required attendance (bc why else would anyone attend). My biggest gripe is that some of the info seemed very biased based on her views on politics, society, etc. \r\n\r\nOverall: easy gen ed just show up and write what she'd want to hear and you'll be fine but otherwise this is a waste of your tuition and brain cells", "rating": 1, "expected_grade": "A", "created": "2023-12-21T18:53:24.205421Z"}, {"professor": "Christine Alexander", "course": "ENES200", "review": "it was an easy A. but the class is annoying", "rating": 3, "expected_grade": "A+", "created": "2023-12-22T23:28:32.713533Z"}, {"professor": "Christine Alexander", "course": "ENES200", "review": "Christine is incredibly nice and accommodating person. She does seem to really to care about her students as she even goes as far as trying to learn everyone's names (there's like 50 people in the class too).  If you need more time or help on an assignment, she will bend over backwards to help. I don't know why so many people are giving her shit for the class content. It's the curriculum that she is forced to teach. Some of the overall content is actually pretty interesting too. For example, the class goes over some interesting case studies of engineering gone wrong, such as the challenger explosion or Boeing 737 max disaster. Some of in class activities and assignments are kind of silly though, and there are a lot of them. However, everything is literally just a completion grade and all you have to is show up and participate. Just go into the class with an open mind and try to have fun with it. It is an ethics class Afterall.", "rating": 5, "expected_grade": "A+", "created": "2024-04-01T11:03:21.303951Z"}], "department": "ENES", "course_number": "200", "name": "ENES200", "title": "Technology and Consequences: Engineering, Ethics and Humanity", "credits": 3, "description": "What makes a technology socially responsible? At UMD, the Fearless Ideas campaign asks us to aim our enthusiasm for technology at big real problems. At the same time, we are coming to appreciate the increasingly complex nature of technological systems as they become integrated into all forms of infrastructure, we realize they may be unpredictable, interdependent on social and biological systems, and have unintended consequences. In this midst of this complexity, people make decisions with far reaching impacts. How then do we follow our passion for technology and innovation but also stay skeptical in a way that allows us to consider the potential and shortcomings of technology? Designed for both engineering and non-engineering students wishing to explore and assess the impact of engineering technology on society and the role of society in generating that technology.", "is_recent": true, "geneds": null}