{"average_gpa": 3.4855443879389747, "professors": ["James Green", "Michael Pratt", "Cait von Schnetlage", "James Green", "James Green", "Michael Pratt", "James Green", "James Green", "Michael Pratt", "James Green", "James Green", "Michael Pratt"], "reviews": [{"professor": "James Green", "course": "ENES140", "review": "This guy thinks he is the smartest person in the world and everyone else is wrong. He changed an ELMS assignment 3 days before it was due, and when I emailed him about it I started receiving C's when I had previously been getting A+'s. He is not a good teacher and ignores student concerns. This class is online and it took me 4 emails to make contact asking what the syllabus was since it was never posted. ", "rating": 1, "expected_grade": "C+", "created": "2016-03-29T15:31:00Z"}, {"professor": "James Green", "course": "ENES140", "review": "The online course is a complete scam. Green does not teach. You \"watch\" videos and \"read\" slides and then submit assignments that are clearly graded by word count, not content. This course is an easy A for everybody (I missed out on an A- by .1%), and it honestly devalues the GPA here. This course should not be taught. Green requires everybody spends $30 on his own online textbook that is completely unnecessary. If you need a GPA booster, take the course. It will most likely help. But understand Green is profiting off your need for a high GPA by selling useless textbooks and not teaching at all. Do not email him either about grades, because it is automated and he does not care.", "rating": 1, "expected_grade": "B+", "created": "2018-01-02T00:09:53Z"}, {"professor": "James Green", "course": "ENES140", "review": "I personally signed up for his class for the easy A. There are weekly quizzes that can be found in the readings and the final project is a simple essay. You can't simply write nonsense in the essay, but as long as it makes sense and is coherent, you will get a good grade. I put little to no work in this class and I easily received an A.", "rating": 4, "expected_grade": "A", "created": "2018-03-26T23:18:13Z"}, {"professor": "James Green", "course": "ENES140", "review": "This class has been changed a lot from past years, DO NOT TRUST the reviews from previous semesters. The class is pretty simple, and you basically have to do a weekly online quiz and a writing. The writing is not solely off of words last last years, but there are actual TA's that check your writing. That being said, the material is pretty easy and just basic business stuff. The course has been changed, but it's still the easiest A on UMD campus.", "rating": 5, "expected_grade": "A+", "created": "2018-05-03T22:44:30Z"}, {"professor": "James Green", "course": "ENES140", "review": "Ayy lmao. The signature class of your boy James Green king of meme classes.  Pay $27 extra dollars (for the book code you have to buy) to take a class that is a guaranteed A/A- if you do all the work and aren't braindead.  Some assignment are randomly graded on a curve, since he knows a lot of people wont contest a B and hes tryna pull his average down a bit so that the class looks like less of a free A.  If you actually do the work, appeal all your random grades and you'll do well.", "rating": 4, "expected_grade": "A", "created": "2018-05-11T06:44:43Z"}, {"professor": "James Green", "course": "ENES140", "review": "So, everyone mostly takes this class because of its reputation of being an easy A. It is honestly still an easy A, but way harder than it’s been in past semesters. The word count for the analyses are 200 now. And we have a final group project now worth 18% of our grade which isn’t hard, but I’d rather just have an individual final project rather than meet up with people. \r\n\r\nI didn’t learn much while taking this class though. There’s no feedback on any of the written assignments besides the final project. Which is weird because how am I supposed to learn from my mistakes? And it felt like some grades were just assigned randomly.\r\n\r\nOverall, if you want an easy A, take this class. Just remember you actually have to try now because they’re skimming the analyses. But, if you want to learn, I wouldn’t recommend it. ", "rating": 3, "expected_grade": "A", "created": "2018-05-23T21:14:46Z"}, {"professor": "James Green", "course": "ENES140", "review": "This has probably been said before, but this man is running a scam. It's shameful. He sells tons of books every semester and turns a huge profit.\r\nWhat's worse is that there's nothing really to learn in this class. The only subject matter he is qualified to teach is con artistry.", "rating": 1, "expected_grade": "", "created": "2018-12-12T17:55:26Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "This class is usually an online class but I had to take it in person since I was in FC. It is a complete waste of time to show up to class since all the material is online.\r\n\r\nThe final group presentation sucks. I had lazy group members and did all the work bc I really wanted an A. Any analysis I did with my \"group\" was terrible. The other assignments are cake though. Don't slack on those quizzes as I did; aim for perfects so you don't have to worry much of your group analyses and presentation.", "rating": 4, "expected_grade": "A", "created": "2018-12-19T22:44:40Z"}, {"professor": "James Green", "course": "ENES140", "review": "Everyone is coerced into buying his fake textbook because that counts for 10% of your grade. Finished his class with an A last semester and learned nothing. The course is a joke.", "rating": 1, "expected_grade": "A", "created": "2019-03-08T19:17:07Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "The FC version is by far an easy A class, and you don't have to always show up to class, though sometimes he would assign attendance activities. You have to communicate well with your groupmates and spread out the work evenly. Almost everything after the first unit is group-based, so make sure your teammates know what they're responsible for and when you expect them to finish it. Everything is really easy in the class, but it's based on luck whether you're assigned to a compatible group.", "rating": 5, "expected_grade": "A-", "created": "2019-03-17T00:32:01Z"}, {"professor": "James Green", "course": "ENES140", "review": "This guy is an absolute scumbag. Not only is it a class just so thousands of students buy his trash 30$ textbook, but the class isn't even the easy A it's supposed to be anymore. You could learn more about being an entrepreneur from Shark Tank then this absolute joke. Even if you wanted to learn things in this class, it's not like the quiz grades are shown to you, so you can learn from your mistakes. \r\nThis guys is a waste of life and it's a massive disappointment that UMD allows this guy to teach at a school. The money I spent on the textbook for this class would've been better being spent on a random textbook, because at least with the random textbook I could beat James Green over the head for being a garbage human being. Congratulations Maryland, you've managed to outdo yourself with this hiring.", "rating": 1, "expected_grade": "B-", "created": "2019-05-01T21:31:24Z"}, {"professor": "James Green", "course": "ENES140", "review": "This guy is a fucking idiot. Some dude last semester basically told him the whole class copied so he made it way harder. Still not that hard of a class, but now the quizzes average are below 80%. He makes you buy this useless online textbook that you need for 12% of your grade. He's a scam and an absolute fuckhead.", "rating": 1, "expected_grade": "B-", "created": "2019-05-11T18:17:55Z"}, {"professor": "James Green", "course": "ENES140", "review": "No words to describe this class. I took ENES140 is get an easy A, but it literally became the HARDEST class I took this semester. James Green is an extremely rude person who never responds to any email sent to him. This guy wants you to buy a textbook for $30 which is a big SCAM. The textbook never helps you with any of the quizzes and simulation that take place for they cover outside detail that is never found in the textbook and CTRL F is completely useless now. I beg you, DO NOT TAKE THIS GENED CLASS. It is not an easy A like it used to be and it will screw you up unless you're up for a challenge.", "rating": 1, "expected_grade": "B-", "created": "2019-05-19T03:26:19Z"}, {"professor": "James Green", "course": "ENES140", "review": "This class is far from an easy A anymore. Oof. \r\n\r\nI particularly had a problem with the videos because it felt like he was just trying to fill up time. I wish he just got to the point.\r\n\r\nThe quizzes were also unfair. Especially for the modules that talked about entrepreneurship in action. If he at least gave us a video outlining the things we should have taken note of it would have been fair, but the quizzes essentially evaluate our analysis which is subjective.\r\n\r\nI barely know Professor Green, but the class was pretty hard.", "rating": 2, "expected_grade": "B", "created": "2019-05-23T20:40:04Z"}, {"professor": "James Green", "course": "ENES140", "review": "Your whole grade depends on these 5 point quizzes and 2 point \"simulations\" that are all impossible to 100% on so you end up getting 4/5 or less on each one, bringing your grade drastically down. I do the readings and use them while I take each quiz, but he words the questions so specifically that it's impossible to do well. NOT as easy as it looks", "rating": 1, "expected_grade": "B", "created": "2019-12-04T16:58:12Z"}, {"professor": "James Green", "course": "ENES140", "review": "Class is no longer an easy A. You must do readings to do well on quizzes. He wrote the book for the class and charges you $30 for it, making it seem as though the class is just a front for his book. I'd say if you're in need of an online class, this is ok but treat it like a class you go to lecture to and don't slack on it or else you won't do as well. My grade could have been far worse than it will be.", "rating": 3, "expected_grade": "B+", "created": "2019-12-10T19:20:35Z"}, {"professor": "James Green", "course": "ENES140", "review": "Class is no longer an easy A. Textbook is a scam, teaches nothing and is $25. Expect to have to read everything and watch all the videos (a lot) if you want to do well on the quizzes and get an A.", "rating": 1, "expected_grade": "B", "created": "2019-12-12T02:09:44Z"}, {"professor": "James Green", "course": "ENES140", "review": "The other comments hit the nail on the head. He sells his own textbook, which is literally useless then spews useless crap in lecture videos that he recorded 5 years ago.", "rating": 1, "expected_grade": "A", "created": "2020-02-08T04:27:22Z"}, {"professor": "James Green", "course": "ENES140", "review": "See other comments. This class is a joke. So much subjectivity in the quizzes, it shocks me. So little class work that each question on the quizzes and simulations cost roughly 1% of your final grade. Just shocking", "rating": 1, "expected_grade": "B+", "created": "2020-05-29T16:15:46Z"}, {"professor": "James Green", "course": "ENES140", "review": "Actively makes you buy his $28 textbook that he wrote, you must have an online official copy cause he grades off it and course is now 5+ hours a week of hollow readings and videos that teach you nothing", "rating": 1, "expected_grade": "", "created": "2020-09-02T16:56:46Z"}, {"professor": "James Green", "course": "ENES140", "review": "Material is pretty boring but the class it self is easy. Just read the given chapter with the quiz and your good. The final is also very easy. Just wrote enough for the word count basically. ", "rating": 5, "expected_grade": "A", "created": "2021-01-12T04:24:19Z"}, {"professor": "James Green", "course": "ENES140", "review": "The grading in his courses make little sense. The material is just a repackaged crap udemy course. He can be arbitrarily tough on one assignment and then laughably incompetent on others. For example, assignments that asked about partners, distribution channels, exits, I had personal experience with my startup (Acquired for 2 mil by Bitesquad - sorry I gotta flex) that I drew on and really tried.... I got like 50%. In contrast, on the final assignment doing the whole write up of like 10 paragraphs, I wrote 1 paragraph and copy and pasted it 10 times and got 100%. The entire minor is an exercise in bs", "rating": 1, "expected_grade": "A-", "created": "2021-07-24T19:49:07Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "You have to show up when final projects are being presented at the end of the semester, however, you don't before that. Prof Pratt is kind, the class is huge, recccomend.  ", "rating": 5, "expected_grade": "", "created": "2021-12-09T21:43:39Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "There is a textbook for this class and some self based quizzes (meaning no right or wrong answers) for each chapter. Prof Pratt goes through the textbook in his slides during class so you don't really have to show up to class until the end of the semester during the final projects. A majority of your grade depends on the project so make sure you pick a good group but the project is relatively easy. Also, use the review slides in the modules when you take the weekly quizzes. Good class for someone who needs easy credits and Prof Pratt has a lot of good network connections if you ask him about internships. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-27T18:47:24Z"}, {"professor": "James Green", "course": "ENES140", "review": "I took this as an easy elective, and it was, but I learned absolutely nothing in this class. I'm amazed that James Green gets paid to teach at this school because he literally does nothing. I assume he made all the content for this course years ago and all he has to do is upload an ELMs page with it every semester. Not only does he get paid for doing nothing, but he requires you to buy his textbook to answer his reading quizzes and do the evaluations. The final project is the only thing he has to \"grade\", but there is no way he reads everything due to the amount of kids in the course. Still, it was an insanely easy class. I would put in a maximum of 30 minutes of work every week for this class. You can finish an evaluation in a less than a minute by clicking through it. The reading quizzes were a bit tricker than everyone says they are. You can CTRL-F most of the answers, but there are some questions and are a bit tricky. I think I got like an 89% average on them and that was with not even reading the book, however. The final project is like 45% of your grade and I basically would just say random things from his textbook and I got a 100 on it. You have to write 2000 words, and it can take a little time, but it's not difficult. \r\n\r\nWhile James Green is barely a teacher and I learned nothing from this class, it was so easy. I'm even taking ENES210 next semester because I heard it was of similar difficulty and I needed to get my last DSSP credit. ", "rating": 2, "expected_grade": "A", "created": "2022-01-11T18:40:09Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Course is really easy, Mr. Pratt knows what he's talking about.", "rating": 4, "expected_grade": "A", "created": "2022-02-02T03:03:21Z"}, {"professor": "James Green", "course": "ENES140", "review": "do the work. easy A. good luck and thank you, Professor Green!", "rating": 5, "expected_grade": "", "created": "2022-05-18T00:33:55Z"}, {"professor": "James Green", "course": "ENES140", "review": "Easy A 3 credit class? Only need to spend ~10 minutes a week on the class? The essay at the end is a joke?(As long as you meet their word requirement and have something semi relevant) \r\nI came into the class having 0 expectations besides getting an A so I am satisfied.", "rating": 3, "expected_grade": "A+", "created": "2022-05-18T17:34:31Z"}, {"professor": "James Green", "course": "ENES140", "review": "You can at least get an A- if you do all the work. But I want to point out that an A/A+ is not guaranteed because the quiz questions are not clear to find. You can make 5 mistakes at most in the whole semester if you want an A. Each mistake in the quiz takes 1 point off from your total grade, which is terrifying. The final project/paper is fine and everyone can get 100/100.", "rating": 5, "expected_grade": "A", "created": "2022-08-27T19:03:37.293821Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Easiest A+ ever. It's actually interesting too, and Mr. Pratt knows his stuff- definitely recommend this course for an elective.", "rating": 5, "expected_grade": "A+", "created": "2022-10-21T18:09:56.038615Z"}, {"professor": "James Green", "course": "ENES140", "review": "lmfao thank you master james for the free A in this course. It's somehow easier than enes210. Free GPA boost very helpful for a premed like me.", "rating": 5, "expected_grade": "A+", "created": "2022-11-25T19:00:13.894140Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Course is easy. Mr. Pratt is good at teaching what needs to be taught and giving good personal anecdotes about his life. He let us out of class almost everyday after 40 ish minutes. The one big assignment you have is the group project for the final which you have the whole semester to work on. Definitely and easy A. Weekly quizzes but easy if you do the reading or have the book with you while doing it. Would definitely recommend taking this class", "rating": 5, "expected_grade": "A", "created": "2022-11-27T16:43:59.711211Z"}, {"professor": "James Green", "course": "ENES140", "review": "Easy A so if you want to take an elective that doesn't require that much work then go ahead and take this class. What sucks is how you have to buy the textbook though...", "rating": 3, "expected_grade": "A", "created": "2022-12-01T19:22:39.135866Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Course is super easy, as expected. The course is taught on an online textbook that costs $35, with some self-evaluations (no studying needed, likert scale questions). The quizzes posted on canvas sometimes have things that aren't covered in the book, as far as I could tell, but are overall pretty easy. You don't have to actually show up to class for a while, until you need groups for the group project.\r\n\r\nPratt just isn't a good lecturer though. He often prods for definitions of specific terms until he gets the one he's expecting, which can get tiring. He also can get pretty \"rambly/make it up as you go\" sometimes, since there isn't a ton of content to cover, but about half way through he usually lets out.\r\n\r\nThere's also times where he comes off pretty self-righteous. As an example, when someone was calmly walking out during class, Pratt repeatedly asked him \"am I boring you?\" multiple times, to which the student replied that he had a meeting. Pratt then said \"that's how you make a bad impression on your professor.\"", "rating": 3, "expected_grade": "A", "created": "2022-12-02T07:37:00.226514Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Course is easy. I was like .7 away from an A at the end of the semester and he said no to giving me extra credit or anything to help. That's the only bad thing I have to say- other than that he's a great person and his class is worth taking", "rating": 4, "expected_grade": "A-", "created": "2022-12-08T21:21:29.701821Z"}, {"professor": "James Green", "course": "ENES140", "review": "Typical james green class, easy, feel like part of a money landering scheme.", "rating": 5, "expected_grade": "A+", "created": "2022-12-12T02:30:24.694572Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Course was easy other than the final project which is a solid amount of work but you have plenty of time to do it.  After talking to friends in the asynch version I think this is definitely a better option.  Professor Pratt keeps things interesting with personal stories and although he sometimes rambles he definitely knows what he is talking about.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T04:56:16.786433Z"}, {"professor": "James Green", "course": "ENES140", "review": "Quizzes are kinda annoying cuz each question is like 1% of your grade or miss but it should still be a free A.", "rating": 4, "expected_grade": "A", "created": "2022-12-18T14:31:10.110047Z"}, {"professor": "James Green", "course": "ENES140", "review": "Quizzes are a hassle given how the answers are irritating to find on the venture book source. One point deduction on a quiz can greatly reduce your grade. The other assignments that are on the venture book is easy as you just answer the questions in any way and get free points. The final assignment was a pain since you need several cited sources and ensure that you answer each question in the range of 180 to 220 words, otherwise, you get a zero for that question. Regardless, as long as you have cited sources applied to the question and fill in the other assignment requirements for said question, you can get full points on the quiz. Moreover, it is best to do the quiz a few days before the due date/deadline because it takes like half a day to complete. Ultimately, this course is an easy A for everyone, but you are definitely not gonna learn anything useful.", "rating": 2, "expected_grade": "A-", "created": "2022-12-23T16:37:30.654010Z"}, {"professor": "James Green", "course": "ENES140", "review": "Do you learn stuff? Yes...but it is super basic stuff you can learn off google or a motivational video. Besides that, you pay $30 for an A. You could put in 1 hr of work every other week and get an A in this course. The people reviewing bombing him are probably mad they did not learn anything (understandable) or are salty they got bad grade because they have an IQ deficiency", "rating": 5, "expected_grade": "A+", "created": "2023-01-24T19:27:32.819742Z"}, {"professor": "James Green", "course": "ENES140", "review": "I don't understand why people hate on James. Free 3 credit A for at most 30 minutes of work per week. Love this man.", "rating": 5, "expected_grade": "A+", "created": "2023-01-24T21:31:34.846602Z"}, {"professor": "James Green", "course": "ENES140", "review": "A+ for 35$ and virtually no work, what more can you ask for?", "rating": 5, "expected_grade": "A+", "created": "2023-04-28T17:06:30.973461Z"}, {"professor": "James Green", "course": "ENES140", "review": "He is the best professor I have ever had.", "rating": 1, "expected_grade": "A+", "created": "2023-04-30T16:22:15.381931Z"}, {"professor": "James Green", "course": "ENES140", "review": "He is the best professor I have ever had.", "rating": 3, "expected_grade": "A+", "created": "2023-05-01T15:46:32.902276Z"}, {"professor": "James Green", "course": "ENES140", "review": "He is the worst professor I have ever had.", "rating": 5, "expected_grade": "A+", "created": "2023-05-01T16:00:52.084833Z"}, {"professor": "James Green", "course": "ENES140", "review": "Free A+, one of the most GOATED professors I've ever had! You learn so much.😃", "rating": 5, "expected_grade": "A+", "created": "2023-05-02T22:19:34.226803Z"}, {"professor": "James Green", "course": "ENES140", "review": "Nothing is really taught just very long winded passages in his 35 dollar textbook(that you buy) about common sense business practices.", "rating": 3, "expected_grade": "A", "created": "2023-05-05T07:05:14.866438Z"}, {"professor": "James Green", "course": "ENES140", "review": "Free A, just control F on the textbook and you get a 100. Dont learn anything, GOAT", "rating": 5, "expected_grade": "A+", "created": "2023-05-11T00:11:48.905691Z"}, {"professor": "James Green", "course": "ENES140", "review": "Not a free A. Its a 35$ A.", "rating": 3, "expected_grade": "A+", "created": "2023-05-11T21:16:06.438075Z"}, {"professor": "James Green", "course": "ENES140", "review": "It's probably the most useless course you'll take. You learn absolutely nothing. His textbooks are nothing burgers. If you wanna learn the contents of the course, it'll take you 10 minutes on youtube watching some entrepreneurship video. If you want an A this is the course for you. \r\nBeware, if you have a semi developed sense of ethics, you will be uncomfortable taking part in his scam of a course.", "rating": 1, "expected_grade": "A", "created": "2023-05-12T23:04:47.005948Z"}, {"professor": "James Green", "course": "ENES140", "review": "Easy A for a gen-ed, what more could you ask for?", "rating": 5, "expected_grade": "", "created": "2023-05-16T16:15:01.614389Z"}, {"professor": "James Green", "course": "ENES140", "review": "Should be a free A+, trolled a little bit and missed a week but the class is incredibly easy (5 minutes of reading/answering quizzes every week). Be wary of the final project and start a couple days early.", "rating": 5, "expected_grade": "B+", "created": "2023-05-17T05:03:19.436932Z"}, {"professor": "James Green", "course": "ENES140", "review": "I don't know what y'all expected, you knew this course was purely a GPA booster when you signed up for it. If you didn't, then that's on y'all. But this course does exactly what it's intended to do, do the work, get an A. Nothing to complain about here", "rating": 5, "expected_grade": "A+", "created": "2023-05-17T20:16:48.211774Z"}, {"professor": "James Green", "course": "ENES140", "review": "$35 for a free A? Hell yeah! The only thing I learnt from this course is that James Green is the real entrepreneur here.", "rating": 5, "expected_grade": "A+", "created": "2023-05-19T15:12:40.066953Z"}, {"professor": "James Green", "course": "ENES140", "review": "Real talk you only take this class when you need to fill up three credits on your schedule it's fully online no lecture and you only gotta write about your hypothetical business and answer a five question quiz based of the current textbook chapter. It's an easy A but it also costs 35$", "rating": 5, "expected_grade": "A", "created": "2023-05-20T01:10:11.219875Z"}, {"professor": "James Green", "course": "ENES140", "review": "Easy to keep up with the work and projects, objectives for the course were well laid out", "rating": 4, "expected_grade": "A", "created": "2023-06-01T15:10:18.078787Z"}, {"professor": "James Green", "course": "ENES140", "review": "Like all ENES classes, this was an easy A full of the one-of-a-kind James Green lecture videos...", "rating": 3, "expected_grade": "A+", "created": "2023-07-19T20:09:11.583693Z"}, {"professor": "James Green", "course": "ENES140", "review": "this guy is terrible and doesn't care about his students. stay away. makes you pay money for a useless textbook and quizzes are nothing like what you read about in the book. this guy  honestly sucks. from me to you, take a different class. this guy is a bad professor. would never recommend", "rating": 1, "expected_grade": "", "created": "2023-12-02T02:47:34.531037Z"}, {"professor": "James Green", "course": "ENES140", "review": "May or may not be the goat prof at UMD. Not sure if he's the worst or best professor ever. Pay 35$ for online book for an A in return. You can use chatgpt for almost all the quizzes. 10 mind of work per week with a 10 question, 1800-2200 written final paper.", "rating": 5, "expected_grade": "A", "created": "2023-12-07T18:57:06.618412Z"}, {"professor": "James Green", "course": "ENES140", "review": "Course: Pretty easy. I spent around 30 minutes a week on this course due to small quizzes each week. Take the quizzes seriously however because it is 5 questions, 5 points, and there are only 100 total normal points in this course, so every question wrong is 1% down in your grade. As long as you can CTRL F the textbook/video transcripts, ChatGPT (sometimes unreliable), or do quizzes with a partner (what I did), you will be fine. The Term project at the end is pretty easy, a bit long. I was able to just grind and complete the whole thing in 2 1/2 hours. You have to buy his textbook otherwise you can't do the class ($35). \r\nAssignment breakdown:\r\n- Evaluations (10), 10%, as long as you complete them in the textbook, you get the points. They're basically surveys. Screenshot your results to save them for the Term Project later on.\r\n- Quizzes (9), 45%\r\n- Term Project: Preliminary Phases (3), 6%, a few sentences at max for 3 parts. Easy.\r\n- Term Project: Final Phase (1), 39%, just grind it and you can complete it easily, doesn't take long.\r\n- OPTIONAL Peer Review of Project (1), +1%, just 4 write up questions about someone else's project. What me and my roommate did was just write our peer review for our own projects in each other's voices to save us time.\r\n\r\nProfessor: The ONLY thing good about him is that his class is online and asynchronous. He does NOT care for you, he does NOT care about your education, he does NOT care about your grade. If you email him, he will take at least a week to respond if it's just a question about the course, besides that, you will ghost you. Very unprofessional. Only reason why I would take him again is because I did not have to interact with him and the course was easy.", "rating": 1, "expected_grade": "A+", "created": "2023-12-10T17:52:07.050469Z"}, {"professor": "James Green", "course": "ENES140", "review": "As a teacher he sucks. Puts in zero effort and just profits off his book that you’re required to buy (only $35 tho). But in return you’re paying for 30 minute commitment a week max, no class, and a fairly easy final project. If you need an easy A with little commitment this is the class.", "rating": 3, "expected_grade": "A", "created": "2023-12-12T05:57:34.794918Z"}, {"professor": "James Green", "course": "ENES140", "review": "Quizzes were the bulk of the grade, and nothing in the quizzes had anything to do with the book that he makes you buy *that he wrote himself.* He figured out that people were taking this course because it was easy and he purposely made it harder. Take a different course if you want an easy elective. Stressing over quizzes is so stupid.", "rating": 2, "expected_grade": "A", "created": "2023-12-14T21:54:44.709154Z"}, {"professor": "James Green", "course": "ENES140", "review": "I absolutely hated this class. It's honestly one of the biggest mistakes I could've made in terms of course selection. Perhaps the other professor teaching this is better but James Green could not give one crap about his students. Honestly with 35 dollars a student (for the textbook) this guy has secured a fortune for himself. Everything is online, and before you think you can control F everything, the quizzes are different from what you'll find in the readings. So if you mess up a few quizzes your grade is screwed since they account for half of your grade (each quiz is out of 5...do the math). Do not take this class unless you're going to take the quizzes in groups or have the answers from someone. I can't say how much I hated this class.", "rating": 2, "expected_grade": "A-", "created": "2023-12-17T16:22:55.183878Z"}, {"professor": "James Green", "course": "ENES140", "review": "All the other reviews are right, buy the textbook, do the work and you should be good. I will add that the weekly quizzes can kinda be tricky!! and they are worth a lot of your grade so be careful. There's info on them from the textbook AND what he says in the lectures, but the lectures have a transcript you can search(command-F) through. Easy class and the more annoying part is the final which is just answering 10 questions. As long as you are within the word limit for everything you are good.", "rating": 4, "expected_grade": "A", "created": "2023-12-17T23:31:51.717815Z"}, {"professor": "James Green", "course": "ENES140", "review": "Obviously pretty easy class. Before the quizzes make sure you have watched all of the videos as most if not all the questions are asked from there.", "rating": 4, "expected_grade": "A+", "created": "2023-12-19T13:45:13.459595Z"}, {"professor": "James Green", "course": "ENES140", "review": "Free A+, use ChatGPT for the quizzes which are basically weekly. Only need to spend 5 min a week. The final is just an essay which you can do in 2-3 hours easily. You have to pay $35 for the textbook, but this class is essentially a free 3 credit DSSP for 5 min a week.", "rating": 3, "expected_grade": "A+", "created": "2023-12-20T18:34:36.691256Z"}, {"professor": "James Green", "course": "ENES140", "review": "I took Enes140 during the Fall 23 semester. It’s still $35 for a free A", "rating": 5, "expected_grade": "A", "created": "2023-12-20T23:54:13.143441Z"}, {"professor": "James Green", "course": "ENES140", "review": "The real entrepreneur here is James Green himself. He made over $185,000 in 2022 and still makes you pay $35 for an ebook he wrote. \r\n\r\nEasy class tho.", "rating": 1, "expected_grade": "A", "created": "2023-12-21T18:29:23.546510Z"}, {"professor": "James Green", "course": "ENES140", "review": "Even though I got an A+, this class felt frustratingly difficult compared to what I've heard from prior years. Not only that, the textbook and lecture videos were often unclear, there's no good way of connecting with him, and worst of all: this class is a complete scam. The things James is trying to teach in his $35 textbook lowkey sound like bad advice in a lot of ways. Take this course, but keep in mind that it's not a cakewalk and James can be a pain in the ass sometimes.", "rating": 2, "expected_grade": "A+", "created": "2023-12-25T01:28:39.919252Z"}, {"professor": "James Green", "course": "ENES140", "review": "If you get the textbook and do the work and preparation, it's a free A, not really too hard. You don't learn anything though.", "rating": 2, "expected_grade": "A", "created": "2024-01-01T19:17:05.988057Z"}, {"professor": "James Green", "course": "ENES140", "review": "Even though I did get an A+ the class was difficult, like it was not an easy A like everyone else said it was and for a while it was my lowest grade. I spent hours to make sure I did good on the quizzes and even then I rarely got a 5/5, but that's just me. He definitely made it more difficult so don't rely on control F because that will not help you. The only reason I got an A+ was because the last assignment was worth a lot of points and I got a 100 but I was really relying on that. So if you're taking this class for the easy A like I did, beware that it is not as easy as it seems and actually a lot of work.", "rating": 3, "expected_grade": "A+", "created": "2024-01-06T22:20:07.523511Z"}, {"professor": "Michael Pratt", "course": "ENES140", "review": "Take this class. If you're reading this review, consider yourself lucky. Take. this. class.", "rating": 5, "expected_grade": "A+", "created": "2024-01-07T20:46:59.683266Z"}, {"professor": "James Green", "course": "ENES140", "review": "I got an A but this class was kinda tricky because there's 5 point quizzes that make up almost all of your grade besides the term project. DO NOT wait until the last minute to do the term project, it took me about 4 hours and I turned it in late which was super stressful but I still got a 100%. This did help keep my GPA up, and I never really had to do work for this class throughout the semester other than Sunday nights when I'd read the chapter and do the quiz.", "rating": 3, "expected_grade": "A", "created": "2024-01-29T23:39:03.428841Z"}], "department": "ENES", "course_number": "140", "name": "ENES140", "title": "Discovering New Ventures", "credits": 3, "description": "<b>Additional information:</b> This course may count as an elective for a student at the University of Maryland, depending on the student's specific degree program. It cannot be counted towards the requirements for the Smith School of Business Entrepreneurship Fellow Program.\nStudents explore dynamic company startup topics by working in teams to design a new venture. This multi-disciplinary course helps students to learn the basic business, strategy, and leadership skills needed to launch new ventures. Topics include learning how to assess the feasibility of a startup venture, as well as how to apply best practices for planning, launching, and managing new companies. Students discuss a wide range of issues of importance and concern to entrepreneurs and learn to recognize opportunities, assess the skills and talents of successful entrepreneurs, and learn models that help them navigate uncertainty.\n<i>All questions regarding this course should be directed to mtecheducation@umd.edu.</i>\n<i>A Fearless Ideas Course from the Academy for Innovation & Entrepreneurship (AIE): http://ter.ps/iamFEARLESS  Click here for more information on the Fearless Ideas Courses.</i>", "is_recent": true, "geneds": null}