{"average_gpa": 3.6485686080947684, "professors": ["Jane Fines", "Lena Kavaliauskas Crain", "Brian Dillehay", "Kirsten Dabelko", "Kevin McClure", "Natasha Chapman", "Darren Pierre", "Darren Pierre", "Darren Pierre", "Darren Pierre", "Brian Dillehay", "Darren Pierre", "Darren Pierre", "Darren Pierre"], "reviews": [{"professor": "Jane Fines", "course": "ENES472", "review": "This class isn't bad as a whole. This class is a decent amount of work. There are essays, discussion board activities, online quizzes, a group paper and presentation, and final exam that all factor into the grade. You learn all sorts of various things about business cultures and how to deal with them. There are a wide range of majors represented in this class. The group project involves researching various aspects of a country one may do business in. The project isn't hard but be careful not to blow it off even though there are a lot of people in the group and it's easy to slack off your part. Also, there tends to be a pop quiz precisely on the day you don’t do the readings.", "rating": 4, "expected_grade": "A-", "created": "2014-05-08T03:09:00Z"}, {"professor": "Darren Pierre", "course": "ENES472", "review": "Really really friendly. Takes material seriously. If you do your work and display care, you'll succeed. He's super great to talk to and you can always ask him for advice or for help if you don't understand something or want some suggestions on how to do something. Great professor.", "rating": 5, "expected_grade": "A", "created": "2023-05-05T12:09:10.149155Z"}, {"professor": "Lena Kavaliauskas Crain", "course": "ENES472", "review": "boring, not accommodating", "rating": 1, "expected_grade": "A-", "created": "2024-01-25T21:32:44.893850Z"}], "department": "ENES", "course_number": "472", "name": "ENES472", "title": "Leading Global Teams and Engaging Across Cultures in Business, Engineering, and Technology", "credits": 3, "description": "<b>Restriction:</b> Sophomore standing or higher; must be a minor in Global Engineering Leadership (#EN09), Global Poverty (#AG06), Global Terrorism Studies (#BS07), or International Development and Conflict Management (#BS02).\n<b>Credit only granted for:</b> ENES472, SLLC471, or SLLC473.\n<b>Additional information:</b> Students not meeting restriction requirements should add themselves to the course holdfile. Restrictions DO NOT apply to winter and summer terms.\nDevelop global leadership capacities and an understanding of the cultural aspects pertaining to industry and international business. In a globalized world, the ability to work, lead and communicate in culturally diverse settings has become a core component to leadership. Through real-world examples, research, and simulations, students will increase their self-awareness and understanding of culture and how culture influences attitudes, behaviors, and practices at the individual, organizational, or societal levels. Students will develop the skills necessary to navigate, negotiate, and lead cross-cultural engagements and teams. The course content is relevant and applicable to anyone interested in developing cross-cultural leadership competencies and cultivating a global mindset.\n<i>Restricted to students with the minor in international engineering (#EN01), engineering leadership development (#EN04), and global engineering leadership (#EN09). Students in global poverty (#AG06), in terrorism studies (#BS07), or in international development and conflict management (#BS02) may request permission for the course by emailing globalengr@umd.edu. All other students can be placed on a hold file.</i>", "is_recent": true, "geneds": null}