{"average_gpa": 3.166476524791575, "professors": ["Ann Mason", "Ann Bracken", "Marybeth Shea", "Lindsay Jacoby", "Robert Schubert", "Cheryl Spinner", "Kevin Wisniewski", "Shannon Zellars Strohl", "Ruth Phillips", "Cheryl Kiken", "Jesse Brooks", "Cameron Mozafari", "Ruth Phillips", "Cameron Mozafari", "Jesse Brooks", "Anna Josephson", "Cameron Mozafari", "Heidi Scott", "Ruth Phillips", "Heidi Scott", "Jesse Brooks", "Ruth Phillips", "Heidi Scott", "Anna Josephson", "Jesse Brooks", "Heidi Scott", "Jesse Brooks", "Heidi Scott"], "reviews": [{"professor": "Marybeth Shea", "course": "ENGL398V", "review": "I've never enjoyed an english class before 398V. An english class without any books, the \"text\" is an online blog.  Writing assignments are geared for the work place and will turn out to be good writing samples for interviews.  She is very reasonable with extenuating circumstances in terms of turning in assignments.  Her main goal is to have you improve as a writer, not to make you jump through hoops.  \n\r\nI highly recommend this class and anything that MB Shea teaches.  I can't imagine a better junior english class.", "rating": 5, "expected_grade": "A", "created": "2010-04-10T17:39:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL398V", "review": "I enjoy this class, and it is easy. The writing assignments are useful, and we have many opportunities to rewrite them until they are good enough to be used as writing samples for interviews. I would agree, though, that she is disorganized. \n\r\nWe get to do a good amount of our homework in class. You don't have to be interested in the environment to take this class, it is only loosely environmental. \n\r\nI would recommend this class to anyone.", "rating": 5, "expected_grade": "A", "created": "2010-03-31T11:30:00Z"}, {"professor": "Ann Mason", "course": "ENGL398V", "review": "Absolutely an amazing professor! The things she teaches will significantly improve your writing. Writing for the environment can be tedious but she keeps it interesting. BUY THE BOOK! Not because you will need it but because it is worth reading. I am so glad I was able to take her class.", "rating": 5, "expected_grade": "A", "created": "2013-12-14T09:23:00Z"}, {"professor": "Ann Mason", "course": "ENGL398V", "review": "She is a very nice lady and is very helpful if you want to improve your writing. Most people take this class to graduate, but she improves your writing whether or not you are interested in the environment.", "rating": 5, "expected_grade": "A", "created": "2011-04-13T21:57:00Z"}, {"professor": "Kevin Wisniewski", "course": "ENGL398V", "review": "By far the best professor I've every had. He really understands his students and is very empathetic to the amount of work they put in for other courses. He assigns deadlines based on when he feels everyone in class is ready and is more than willing to push that deadline back if students are having difficulty. ", "rating": 5, "expected_grade": "A+", "created": "2019-04-10T16:14:34Z"}, {"professor": "Ruth Phillips", "course": "ENGL398V", "review": "Amazing instructor. Professor Phillips takes a huge amount of her personal time and energy to ensure that the class is run fairly and equitability, and aims to assist all students in getting the best grade possible. ", "rating": 5, "expected_grade": "A", "created": "2021-05-18T01:46:40Z"}, {"professor": "Ruth Phillips", "course": "ENGL398V", "review": "I really enjoyed taking this course. Professor Phillips attempts to get to know her students and encourages success in the class. She gives ample time to complete the different projects and will work with you to get the grade you would like.", "rating": 5, "expected_grade": "A", "created": "2021-12-08T21:26:22Z"}, {"professor": "Jesse Brooks", "course": "ENGL398V", "review": "I took this class in Fall 2021\r\n\r\nPros:\r\n+ Class is mostly pretty chill when an essay isn't immediately due. Classes mostly consist of discussing readings, but since there are no grades that rely on having you read the readings you don't really have to do the readings.\r\n+ Prof, all in all, is pretty chill. Even if you miss assignments, just talk to him and you can normally reach an arrangement\r\n+ Also I guess he's changed a lot from December 2017, he allowed us to have laptops in class\r\n\r\nCons:\r\n- Essays are very anecdote-based, if you're used to writing research papers, get ready for some whiplash", "rating": 5, "expected_grade": "A", "created": "2021-12-24T19:03:25Z"}, {"professor": "Jesse Brooks", "course": "ENGL398V", "review": "I loved him! I feel like my writing improved so much in this course, he focuses on straying from regular cut-and-dry rubrics (which was hard for me), but really helps with writing and expressing ideas/communicating in general. Really loved the content of this course, if you're looking for a professional writing course to take, I'd highly recommend 398V (especially with Jesse). Great course and great professor! Never talks down the class and really tries to relate and build connections with everyone (not in a cheesy way). ", "rating": 5, "expected_grade": "A", "created": "2022-02-14T23:37:19Z"}, {"professor": "Ruth Phillips", "course": "ENGL398V", "review": "I don't think she made this class necessarily the easiest, giving lots of busy work and activities, but never have I ever had a professor who genuinely probably put just as much (probably more) effort onto assignments as I have. This course doesn't really teach you writing (there are some snippets here and there) but is rather a broad class that sort of just lets you try and convince others to do a sustainable thing of your choice. It's an interesting class I don't mind going to every week and Dr. Phillips is always very nice and understanding. She does take the whole class time period though, which is my only peeve. She also does have a small assignment due each week but it's literally no stakes writing in which you just reflect for 20 minutes and you get a guaranteed 100%. ", "rating": 5, "expected_grade": "A", "created": "2022-04-05T06:03:23Z"}, {"professor": "Anna Josephson", "course": "ENGL398V", "review": "Anna is incredible! The course load is heavy, but she makes it significantly better. She provides in-depth comments/feedback on all assignments and genuinely wants her students to succeed. Anna makes note of common mistakes students have in their writing and provides helpful in-class examples of how to resolve them and improve our technique. My writing had improved tremendously because of this class.", "rating": 5, "expected_grade": "A", "created": "2022-12-06T18:46:08.149636Z"}, {"professor": "Ruth Phillips", "course": "ENGL398V", "review": "Professor Phillips has been one of my favorite professors over my time here at UMD, she really cares for her students and is super understanding of your situation. the class consists of :\r\nFinal Cover Letter           \t \t15%\r\nFinal Resume \t                \t15%\r\nFinal ePortfolio\t\t\t\t10%\r\nPress Kit and White Paper\t\t15%\r\nOral Pitch         \t \t\t\t15%\r\nthe class can be a bit busy at times, with a lot of outlines/drafts and peer review, but go through the motions and you'll be good! the press kit and white paper are about an environmental problem of your choosing and a hands-on solution/mitigation of your choosing. I personally am not an environmentalist, but did fine! professor phillips is very sweet and can be rather funny! i couldn't imagine taking another class instead of this one for FSPW", "rating": 5, "expected_grade": "A", "created": "2022-12-13T04:54:35.451530Z"}, {"professor": "Jesse Brooks", "course": "ENGL398V", "review": "He's a nice guy and all, and I'm sure his creative writing classes are great, but specifically for this class (ENGL398V) I am extremely disappointed in what he teaches us. This was advertised as a professional writing class, writing about the environment, but we aren't really doing any writing to prepare us for respective professional fields, unless you're maybe doing journalism or advocacy work where creative writing comes in handy. You can tell he really doesn't want to be teaching this and only really has us do creative writing assignments, so if you want to get something out of this class that will help prepare you for writing in an actual career, this prof/class is definitely not what you want to be taking.", "rating": 3, "expected_grade": "", "created": "2023-12-06T05:50:39.033267Z"}], "department": "ENGL", "course_number": "398V", "name": "ENGL398V", "title": "Writing About the Environment", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits.\nDesigned for those aspiring to work in a variety of fields that influence and are influenced by environmental science, including public policy, advocacy, science, and industry. Students learn to apply principles of technical writing to a range of scenarios and issues particular to the intersection of scientific knowledge and environmental policy. Writing audiences range from the public to decision-makers. The course emphasizes writing both within and across disciplines to enlist research for practical contexts.\n<i>\n<b>Prerequisite:</b> 60 credits and completion of ENGL101 or equivalent. This course satisfies the professional writing requirement.</i>\n<i>Click here for more course information.</i>", "is_recent": true, "geneds": null}