{"average_gpa": 3.419321202208137, "professors": ["John Matthews", "Scott Wible", "Katherine Oneill", "Robin Allen-Klein", "Nicholas Bujak", "Richard Reynnells", "Diana Friedman", "Marybeth Shea", "Paul Haynos", "Michelle Boswell", "Michael Schmidt", "Andrew Delfino", "Kate Wilson", "Robert Lucci", "Sajeela Yaqub", "Robin Allen-Klein", "Kate Wilson", "Katherine Oneill", "Richard Reynnells", "Sarah Dammeyer", "Katherine Oneill", "Richard Reynnells", "Robin Allen-Klein", "Sarah Dammeyer", "Katherine Oneill", "Marybeth Shea", "Richard Reynnells", "Robin Allen-Klein", "Sarah Dammeyer", "Robin Allen-Klein", "Aysha Jawed", "Katherine Oneill", "Richard Reynnells", "Anna Josephson", "Katherine Oneill", "Richard Reynnells", "Robin Allen-Klein", "Zoe Alsop", "Katherine Oneill", "Robin Allen-Klein"], "reviews": [{"professor": "Marybeth Shea", "course": "ENGL390", "review": "One of my favorite professors! Took Professional Writing for Science Majors with her, and I couldn't be happier with my choice. She understood that this english class was not topping our list of priorities when we all were in junior or senior-level science classes. She was okay with us coming in a little late, asking for extensions on assignments, or even missing class now and then as long as we let her know beforehand with an email. She really took the time to help anyone and everyone that she could in office hours, during class, or by scheduled appointment. \n\r\nDidn't require a textbook or any reading outside of class. The class webpage was not on ELMS, but on a casual blog that she updated before each class. Would recommend her to anyone. ", "rating": 5, "expected_grade": "A", "created": "2015-05-18T16:15:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390", "review": "Professor Shea is a great choice for students who (1) don't know too much about their major (i.e., never read about their field in their free time and don't volunteer or do research), (2) aren't good writers, and (3) don't care too much about improving their writing.  You won't get much more than an easy A out of this class, so if you value your time and money choose another professor.  But if your parents pay your tuition and you're just at UMd for the sake of getting a diploma, Shea might be a good choice because she expects so little of her students.\n\r\n1) Professor Shea has a habit of bringing up different students' academic interests, asking them questions, and then cutting them off.  Or she'll use one student's research as an example and misrepresent it.  This is incredibly annoying.  (Her knowledge of science is fairly broad but remarkably shallow.)  If you really have no idea what you want to do with your life -- if you're one of those \"I want to save animals\" or \"I want to make a living by doing something outdoors\" types -- you might benefit from the fact that she knows a bunch of people in the area and tries to help students out.  But if you know who you are and what you're talking about she'll drive you insane.  Oh, and if you do research or want to put your writing to use, watch out.  She once asked a student for permission to share his paper with her next-door neighbor, and 30 seconds later she said, \"Your paper is sitting on his desk.\"  She also makes you post some preliminary assignments online on her public website.\n\r\n2) She assumes that absolutely all of her students are horrible writers so she grades assignments based on how many times you use the word \"it\" and silly things like that.  She gives virtually no feedback -- she only corrects student work in the way that a proofreader would, which is especially bad since her own website is so full of typos.\n\r\n3) Professor Shea does not use a textbook.  She has a badly organized blog.  Her blog has lots of links to things you may or may not have heard of, that may or may not actually be interesting and/or funny.  She also yells loudly during class time, when we're supposed to be writing, about whatever scientific topic she's \"exited\" about.  (She gets really excited whenever she smells the opportunity to talk about her fancy scientist friends, or tell us how to think.)  Do not expect to learn.", "rating": 2, "expected_grade": "A", "created": "2012-09-10T19:30:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390", "review": "Professor Shea is great! She is VERY excited about science and makes the class a lot more fun than you'd think. This is not a hard class, as long as you do all the assignments and follow her guides. One criticism is that she sometimes wastes class time with unimportant material. Instead of going over the specifics of how to write an assignment, she'll spend the ENTIRE class period before it's due discussing argument theory. I sometimes felt that she didn't really explain certain assignments very well either. That being said, she's still very helpful and cares about improving your writing. Overall, she's a good junior English professor. I would definitely recommend her.", "rating": 4, "expected_grade": "A", "created": "2012-01-14T01:48:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390", "review": "She is very approachable and always willing to spend as much time as needed to help you improve your writing; she truly cares about her students. \n\r\nEven though sometimes she may not make good use of class time, the students will walk away with a handful of documents that give them practice with writing for the workplace.  \n\r\nI would recommend this class to anyone who wants a fun junior writing class with a laid-back teacher.  ", "rating": 5, "expected_grade": "A", "created": "2010-05-22T09:39:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390", "review": "If you can write going into this course (or have the ability to use any computer program and the internet), prepare to be frustrated in Shea's class. She likes dumbed down vocabulary, and gets more excited about visual formatting than the actual content of one's writing.\n\r\nI also agree with whoever said she is not organized. Some assignments were announce only mere days before they were due, and these were sometimes involved papers. She also often misplaces assignments. I had to hunt her down a few times because she never knew what she did with rough drafts that she had promised to hand back in class.\n\r\nRelatively easy to do well in this course, once you forget everything you know about writing well and figure out how to write exactly what Shea wants. ", "rating": 2, "expected_grade": "A", "created": "2010-03-06T09:52:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390", "review": "She's a great teacher, and uses new media in her assignments. They're fairly easy yet informative. Great class for science majors looking for an easy junior level writing class. ", "rating": 5, "expected_grade": "A", "created": "2009-06-23T09:50:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390", "review": "Great teacher, keeps your attention and is genuinely interested  in your work. Not very organized with giving assignments, but she has a great laid back style.", "rating": 4, "expected_grade": "A", "created": "2009-05-20T22:16:00Z"}, {"professor": "John Matthews", "course": "ENGL390", "review": "I am unsure why people are criticizing his grading style. He is very clear with his expectations. Also, the fact that 1pt=1% is pretty arbitrary... so I am not sure why someone is criticizing this aspect of the class. \r\nAssignment guidelines, in my opinion, are fairly clear. The actual assignment descriptions can be vague and lengthy, but he lists the grading criteria pretty clearly. If you pay attention to the grading criteria and the peer review questions you will be fine.\r\nI wouldn't say this is an easy class but it is possible for most people to get an A as long as you work hard. I spent a lot of time working on the major writing assignments but  it pays off -- I never considered myself a good writer but I did very well on the writing assignments. I believe this is because the class is very well designed.\n\r\nOverall, if you are looking to really improve your writing skills then take this class. If you are looking to get an easy A, then maybe do something else. \n\r\nAlso, I cannot speak to anything about lectures because I took this class online.", "rating": 5, "expected_grade": "A", "created": "2016-05-20T13:07:00Z"}, {"professor": "John Matthews", "course": "ENGL390", "review": "He's a good professor overall, but I highly disliked him. Having him as a professor so far in the semester, I have NEVER felt so uncomfortable in a classroom before! He will constantly stare at you when he's not teaching like a video or in class exercises. I make one move, like scratching myself or changing my seating position, he will just stare and watch you. He also gets irritated easily. My group would simply ask him for clarification, and he answers in a rude and disrespectful manner. Also, this class is not a difficult course, but it is difficult to get an A because of how many points this course would earn. There is only 108pts in the entire semester. The 8pts is participation, and you won't receive full credit if you don't show up for class, you're not present during an in-class exercise, or you don't turn in certain assignments on time for peer review. Sometimes he's bias about point distribution, but for assignments, you have to make sure you stay on top of things and keep track of the amount of points you're losing because in this course, 1pt = 1%. So if you lose 10pts overall, you're easily down to a 90%, and there is no extra credit in the course.\r\nSide note- this class is so BS. You don't need to read what he asks you to read in order to do well in the course. It's just so you can participate in discussions. The in-class exercise is really just busy work, and you would spend once a week doing it.", "rating": 1, "expected_grade": "A", "created": "2016-04-26T13:19:00Z"}, {"professor": "John Matthews", "course": "ENGL390", "review": "Don't take this professor. I unexpectedly went from a 97% to a 92% because of one assignment; he expected you to meet certain requirements that he didn't even mention on the assignment guidelines. Also, the way he speaks to students is very condescending and he thinks he's such a hot shot. His class is always awkward and going to class is such a waste of time. I am never one to shit on professors like this but he is an exception. Save yourself and do not take this professor.", "rating": 1, "expected_grade": "A-", "created": "2015-05-21T12:18:00Z"}, {"professor": "Katherine Oneill", "course": "ENGL390", "review": "very reasonable grader. If you do the work you should easily be able to get an A. Class its self is rather boring and a number of times she just had us do homework during class", "rating": 4, "expected_grade": "A", "created": "2018-12-03T19:38:09Z"}, {"professor": "Robin Allen-Klein", "course": "ENGL390", "review": "Mrs. Allen-Klein was easily the best professor I've had during this pandemic. She was super understanding of the fact that many of us were struggling with online university, plus she was definitely aware that a lot of us had to prioritize our major classes over this GenEd. We had multiple assignments get pushed back and she gave out extensions if you needed them, which was very much appreciated! That being said, this definitely isn't an easy A, you have to put the work in if you want to get a good grade.", "rating": 5, "expected_grade": "A", "created": "2021-01-11T23:47:55Z"}, {"professor": "Robin Allen-Klein", "course": "ENGL390", "review": "Robin was an awesome teacher!! She only had us meet once a week on zoom, but had about 2 hours of conferences the other day for people to drop in and get help. Her grading is very fair and she will help you however she can. She was extremely considerate and dropped a bunch of assignments from the schedule because she saw students were overwhelmed with online learning. Take her class if you can!!", "rating": 5, "expected_grade": "A+", "created": "2021-01-13T16:54:11Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "take him. that's the short answer. just take him. take him. take him. it will be the funniest and most comfortable class of your life. just look at the grade data. he is a great guy and will treat you with nothing but respect-- he got to know us all and made class seem like a get-together. you get out early if things move smoothly. take him. join his class. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-04T23:52:26Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "super duper lenient.. Just do the work and you'll end up with an A+", "rating": 4, "expected_grade": "", "created": "2021-07-10T20:34:49Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "Can't recommend him enough, super invested in teaching the class and very caring/understanding if you need any extensions...a bit eccentric but with all the extra credit opportunities he gives there's a reason that the majority of students get an A+ in his class, one of the most memorable professors I've had at UMD", "rating": 5, "expected_grade": "A+", "created": "2021-11-02T13:58:55Z"}, {"professor": "Katherine Oneill", "course": "ENGL390", "review": "To me, she comes off as distant and judgmental. She writes comments/annotations for your essays very bluntly.  She's not very talkative and pretty much reads off her slides in class. Boring as hell.", "rating": 2, "expected_grade": "B", "created": "2022-12-12T20:59:10.233332Z"}, {"professor": "Katherine Oneill", "course": "ENGL390", "review": "Give her a chance. At the start of the semester, I thought she was dry, blunt, and distant. As the course progressed, I came to realize she really did care about her students and wanted everyone to do well. She just doesn't tolerate when people don't follow directions. This class ended up becoming one of my favorites I've taken!", "rating": 4, "expected_grade": "A", "created": "2023-05-13T14:58:41.549430Z"}, {"professor": "Katherine Oneill", "course": "ENGL390", "review": "She's a fair teacher, but it's impossible to actually like get a 100%. She's the exact personification of the \"mean old high school English teacher\". The class is meaningless (she just reads from slides), and so are the assignments. She's a very \"my way or the highway\" teacher.", "rating": 2, "expected_grade": "A", "created": "2023-05-16T02:07:21.974281Z"}, {"professor": "Sarah Dammeyer", "course": "ENGL390", "review": "Generous, kind, and compassionate. Had her for ENGL390 online. There is a good amount of work, but very doable and she is also lenient on due dates if you need to get assignments pushed back.", "rating": 5, "expected_grade": "A", "created": "2023-05-22T01:30:49.705453Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "He's the sweetest person ever! You will love him. I don't regret taking the class with him. While he is great, the class is such a disrespect to to everyone's time. The class isn't hard but the assignments are so unhelpful and unnecessary. Not to mentioned, the class is about 3 hours long for no reason what so ever. Something that can be said in 5 minutes gets dragged for an hours. \r\n\r\nHate the content of the course but loveeeeeee the professor. He is the most understanding and compassionate person you will ever meet.", "rating": 4, "expected_grade": "A+", "created": "2023-10-28T23:45:05.182244Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "TAKE HIM PLEASE!! He is very nice and his class is very easy. It nearly impossible to get a B in this class. Just do the assignments and you will at least get a B. Only down side is that his class is long and just him talking about his slideshow. JUST TAKE HIM!!", "rating": 5, "expected_grade": "A+", "created": "2023-11-19T02:11:19.205736Z"}, {"professor": "Robin Allen-Klein", "course": "ENGL390", "review": "Dr. Allen-Klein was awesome for ENGL390. Yes, her classes are in-person rather than online, but she makes it worth your while. She's a fair grader on writing assignments, which is a big bonus. Class was also useful most of the time, so the in-person component can actually help you with your assignments. I recommend Dr. Allen-Klein as a professor for ENGL390.", "rating": 5, "expected_grade": "A", "created": "2023-12-10T02:45:23.051140Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "Literally only 2 downsides to the class - you have to turn in everything hard copy, and the lectures are super long and dry. The content is also super pointless for any moderately competent writer, but that's not his fault, most of the assignments are mandated in some fashion by the department. \r\n\r\nBut, you will get an A. Pretty much impossible not to as long as you put in like 10% effort to the class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-22T16:29:49.904225Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "I've literally never written a review but I just had to for Dr. Reynnells. He is one of the most approachable, understanding, and chill professors I've ever had during my time at UMD. All his assignments are not only incredibly useful in advancing in your professional career (ex. resumes, cover letters, letters of recs, proposals, etc.) but he also allows you to resubmit your work after you receive a grade/ feedback to earn points back. He is also someone who is willing to sit and talk to anyone who may be going though a tough situation and is incredibly accommodating and understanding. He is one of the few professors at UMD that I have been able to develop a connection with and he truly wishes to see all his students succeed! HIGHLY RECOMMEND!", "rating": 5, "expected_grade": "A+", "created": "2024-02-18T06:49:42.093811Z"}], "department": "ENGL", "course_number": "390", "name": "ENGL390", "title": "Science Writing", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits; and junior standing or higher.\n<b>Credit only granted for:</b> ENGL390 or ENGL393S.\n<b>Formerly:</b> ENGL393S.\nSpecifically designed for students interested in further study in the physical and biological sciences. Exposes students to the conventions of scientific prose in the genres of research articles and proposals. Students also learn to accommodate scientific information to general audiences.\n<i>Click here for more course information.</i>", "is_recent": true, "geneds": null}