{"average_gpa": 3.065878107457899, "professors": ["Marianne Conroy", "Oliver Gaycken", "Kelly Singleton", "Marit Knollmueller", "Paul Cote", "Brian Davis", "Steve Beaulieu", "Eric Zakim", "Mauro Resmini", "Lauren Flanigan", "Audrey Farley", "Caitlin McGrath", "Joseph Byrne", "Konstantinos Pozoukidis", "Kyle Bickoff", "Alexandria Nunn", "Jeffrey Moro", "Dominique Young", "Brittany Starr", "Valentina Rosales", "Porter Olsen", "Mauro Resmini", "Porter Olsen", "Chauncey Dennie", "Sara Faradji", "Emily Flamm", "Mehdy Sedaghat Payam", "Oliver Gaycken", "Brian Davis", "Alan Montroso", "Oliver Gaycken"], "reviews": [{"professor": "Marianne Conroy", "course": "ENGL245", "review": "The class is definitely fun and you only need the powerpoints from lecture to ace the exams. No need to buy the book. Only reason it's missing one star is because of the essays assigned in discussion. Don't know why, but my exam essays received far more points than those in disccussion. I'd like to say it was my TA, but she was really nice. Regardless, this is a CORE that you will actually enjoy.", "rating": 4, "expected_grade": "B", "created": "2012-07-27T11:35:00Z"}, {"professor": "Paul Cote", "course": "ENGL245", "review": "Honestly, I took this class because I thought it was going to be a joke. But, the class is basically analyzing films just like analyzing English literature. Basically, if you're good at English and love watching film, this is the class for you. Cote's lectures were discussion-based, but still enjoyable and informative, especially with film theory. As for the class's difficulty level, I would give ENGL245 with him a 3/5, since it's not necessarily hard, but work still needs to be put in to get a decent grade. ", "rating": 3, "expected_grade": "A", "created": "2019-01-29T14:29:38Z"}, {"professor": "Eric Zakim", "course": "ENGL245", "review": "He's good. Very personable and the class is discussion based. However, he is slower at putting grades in.", "rating": 4, "expected_grade": "B+", "created": "2019-12-18T12:36:42Z"}, {"professor": "Kyle Bickoff", "course": "ENGL245", "review": "Not a harsh grader at all, do your work and come to class and you'll do fine.", "rating": 5, "expected_grade": "A", "created": "2019-12-19T18:40:40Z"}, {"professor": "Eric Zakim", "course": "ENGL245", "review": "Extremely disorganized and doesn't grade assignments until the last possible second. Would NOT recommend ", "rating": 1, "expected_grade": "", "created": "2019-12-20T04:09:07Z"}, {"professor": "Eric Zakim", "course": "ENGL245", "review": "doesn't put in grades in a timely manner and has a very disorganized class", "rating": 1, "expected_grade": "B", "created": "2019-12-24T03:16:05Z"}, {"professor": "Eric Zakim", "course": "ENGL245", "review": "not an easy gen-ed. would not recommend ", "rating": 1, "expected_grade": "B", "created": "2019-12-24T03:16:36Z"}, {"professor": "Kyle Bickoff", "course": "ENGL245", "review": "Very good professor. Super considerate of students' needs and is not a harsh grader. Class work is very easy. Every week you watch a movie and write a 250-300 word paragraph based on the movie and its respective articles. All you have to do is put effort into these assignments and you will do fine. The final is also easy as well, as it goes over everything you learned throughout the school year. The majority of the questions can be answered using the internet. The other questions you can only really answer by making sure you do all the weekly assignments and pay attention to the lectures. Overall very easy class with a very nice professor.", "rating": 5, "expected_grade": "A+", "created": "2021-01-12T03:30:20Z"}, {"professor": "Brian Davis", "course": "ENGL245", "review": "Thoroughly impressed. Dude has a lot of passion for teaching and is really helpful. I kind of slacked off in the class a bit which I do regret because Davis definitely didn't deserve that, yet he still was incredibly lenient for late work and absences. Really kind professor, you're in good hands. ", "rating": 5, "expected_grade": "A", "created": "2021-12-12T23:45:56Z"}, {"professor": "Brian Davis", "course": "ENGL245", "review": "Brian Davis is to die for. He's witty, entertaining, and engaged. He truly cares for the class and his students. All assignments are online, open-note. His feedback is student-specific and helpful nonetheless. When he speaks, he ends the sentence with a tone that sounds like he's asking a question which I've enjoyed. I don't know if he does it on purpose. Best film class for students who know little to students who know a lot!", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T20:37:40.451915Z"}], "department": "ENGL", "course_number": "245", "name": "ENGL245", "title": "Film Form and Culture", "credits": 3, "description": "<b>Cross-listed with:</b> CINE245.\n<b>Credit only granted for:</b> ENGL245, CINE245 or FILM245.\n<b>Formerly:</b> FILM245.\nIntroduction to film as art form and how films create meaning. Basic film terminology; fundamental principles of film form, film narrative, and film history. Examination of film technique and style over past one hundred years. Social and economic functions of film within broader institutional, economic, and cultural contexts.\n<i>\n<b>Restriction:</b> Must not have completed ENGL245 or FILM245. Also offered as: ENGL245.\n<b>Credit only granted for:</b> CMLT214, CMLT245 or FILM 245.\n<b>Formerly:</b> CMLT214.\"</i>", "is_recent": true, "geneds": null}