{"average_gpa": 3.1254691689008047, "professors": ["Sharada Balachandran Orihuela", "Sarah Bonnie", "Keisha Allan", "Sarah Humud", "Kerishma Panigrahi", "Nancy Vera", "Kristofer Reed", "James Rankin", "Andrea Knowles", "Andrea Knowles", "Sarah Dammeyer", "Andrea Knowles"], "reviews": [{"professor": "Andrea Knowles", "course": "ENGL235", "review": "Dr. Knowles is probably the nicest and realest person you'll ever meet. I'll keep it short and simple though...\r\n-  She is a pretty easy grader, there are people who cannot write an essay, she gives them amazing grades, so if you try, you'll do amazing\r\n- I personally didn't take notes on everything, I slightly wish I would've (I'm forgetful, so if you aren't, then you'll be perfect)\r\n- Essays and paper prep she helps with! In class group work will give you time to find examples, make a thesis, etc in a google slide show that you can later use\r\n- There's a bit of group work, everyone in the class was really nice and loved having convos with eachother and her!\r\n- She's really smart, but she is tired, which is not her fault at all\r\n- Super sweet and if you talk to her, I promise she will help and be so nice\r\n- Weekly Reading Responses to your readings, keep up or skim the reading, most of the short ones are shown in class anyways\r\n- If you see her class, take it, I do believe she will be on maternity leave for Fall 2023, but besides that, amazing teacher", "rating": 5, "expected_grade": "A", "created": "2023-05-06T03:46:53.560026Z"}], "department": "ENGL", "course_number": "235", "name": "ENGL235", "title": "U.S. Latinx Literature and Culture", "credits": 3, "description": "<b>Cross-listed with:</b> AMST298Q.\n<b>Credit only granted for:</b> ENGL235 or AMST298Q.\nExamines the poetry, prose, and theater of Latinx communities in the United States from their origins in the Spanish colonization of North America to their ongoing development in the 21st century. Considers how authors use literary form to gain insight into human experience, including mortality, religious belief, gender and sexuality, war and peace, family, language use, scientific inquiry, cultural tradition, ecology, and labor. Also studies how Latinx literary traditions have shaped and been shaped by broader currents in American literature, as well as what connections exist between Latinx literature and social and artistic developments in other parts of the world, particularly Latin America and the Caribbean. Authors may include Alvar Nunez Cabeza de Vaca, Eulalia Perez, Juan Nepomuceno Seguin, Maria Amparo Ruiz de Burton, Jose Marti, Arthur A. Schomburg, Jesus Colon, Julia de Burgos, Cesar Chavez, Ariel Dorfman, Gloria Anzaldua, Junot Diaz, and Cristina Garcia.\n<i>Cross-listed with AMST298Q. Credit granted for ENGL235 or AMST298Q.</i>", "is_recent": true, "geneds": null}