{"average_gpa": 3.5577358490566042, "professors": ["Amy Kincaid", "Mrim Boutla", "Eric Thiel", "Roxanne Clements", "Maurice Boissiere", "Zahara Heckscher", "Katherine Robinson", "Gerard Holmes", "Eric Thiel", "Gerard Holmes", "Mrim Boutla", "Robert Harris", "Roxanne Clements", "Eric Thiel", "Mrim Boutla", "Roxanne Clements", "Eric Thiel", "Kathleen Orr", "Mrim Boutla", "Roxanne Clements", "Eric Thiel", "Mrim Boutla", "Roxanne Clements", "Alexandra Omogbadegun", "Anjula Batra", "Brandee Pettus", "Eric Thiel", "Mrim Boutla", "Roxanne Clements", "Eric Thiel"], "reviews": [{"professor": "Robert Harris", "course": "ENGL398B", "review": "This class is not hard if you keep up with the course but oh my god this man does not stop complaining. He once lectured the entire class for 30 minutes over how bad our writing was. Extremely tough grader. He seems like he would be really nice outside of a classroom setting but absolute horrible inside the class. He cannot take any criticism and just belittles and complains about students.", "rating": 2, "expected_grade": "B", "created": "2022-12-15T01:13:43.094680Z"}, {"professor": "Mrim Boutla", "course": "ENGL398B", "review": "Wonderful Professor. While the class itself may not be the most interesting. She is clear about assignments and how to do them. She is clear about the grading criteria. Additionally she will actually let you improve your grade if you improve your work by taking her comments and recommendations and resubmitting your assignments to be regraded. Just do what you’re supposed to for each assignment and the final paper will be super easy to write. All of the smaller assignments throughout the semester are a piece of the final paper. She is helpful in answering questions. Do show up though and don’t leave early. While she is understanding that things can come up, it became a trend in my class and it was clear she was frustrated once it was happening regularly with multiple students.", "rating": 5, "expected_grade": "A+", "created": "2022-12-17T19:07:06.440210Z"}, {"professor": "Eric Thiel", "course": "ENGL398B", "review": "Professor Thiel is one of the best professors I've come across in college. He teaches you real skills, makes the classroom environment super comfortable, makes assignments low stress. He really cares about his students succeeding and like I said, learning real communication skills. Anyone who doesn't give him 5 stars is insane. Take him for PW you will not regret it.", "rating": 5, "expected_grade": "A", "created": "2023-04-17T14:56:18.277907Z"}, {"professor": "Mrim Boutla", "course": "ENGL398B", "review": "Mrim Boutla is one of the most understanding and nice professors I have had in college yet. She treats all her students with respect, while still teaching a very interesting class. If you are going to take this class, HAVE HER AS YOUR PROFESSOR!", "rating": 5, "expected_grade": "", "created": "2023-04-19T22:40:10.438853Z"}, {"professor": "Eric Thiel", "course": "ENGL398B", "review": "Nicest man to walk the earth. This is a very easy professional writing class. All group work, you basically start your final project the first day of class and work out it throughout the semester. This makes it less overwhelming and easier to accomplish. I learned a lot from him I recommend this class.", "rating": 5, "expected_grade": "A", "created": "2023-08-09T14:35:37.417699Z"}, {"professor": "Eric Thiel", "course": "ENGL398B", "review": "Took this professor because he had great reviews and was recommended by a few people. Professor Thiel is a great guy, but I would not recommend him as a professor. He sends incredibly long voice memos as feedback which takes forever to translate into detailed notes. He also is very negative with his comments and expects way too much from his students. Nice guy, frustrating professor.", "rating": 2, "expected_grade": "A", "created": "2023-12-10T18:42:27.247978Z"}, {"professor": "Eric Thiel", "course": "ENGL398B", "review": "I'm giving Professor Thiel a five because he's an incredibly nice professor. However, this class is extremely tedious compared to most PFW classes. The final project makes it feel more like a business class. Throughout the semester, there's a lot of pointless assignments that don't really do much to your grade and just serve as busy work.", "rating": 5, "expected_grade": "", "created": "2023-12-15T17:08:24.260354Z"}], "department": "ENGL", "course_number": "398B", "name": "ENGL398B", "title": "Writing for Social Entrepreneurship", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits.\nDesigned for students who want to develop the skills needed to start a successful social venture--a start-up business with a social mission or a new nonprofit program. The course centers on a major writing project such as a business plan, a website design plan, a fundraising proposal, or a concept paper for a new nonprofit organization. Students produce other communication projects that social entrepreneurs use to develop their businesses and nonprofits, such as presentations or pitches to prospective investors/donors, marketing materials, and a job announcement. Students will learn from local social entrepreneurs who share their experiences of using writing to succeed in the field.\n<i>\n<b>Prerequisite:</b> 60 credits and completion of ENGL101 or equivalent. This c ourse satisfies the professional writing requirement.</i>\n<i>Click here for more course information.</i>", "is_recent": true, "geneds": null}