{"average_gpa": 3.642256961406937, "professors": ["Joshua Buursma", "Joseph Wappel", "Benjamin Baker", "Nathan Tillman", "Tom Hatcher", "Annie Kleykamp", "Kathleen Orr", "Brianne Friel", "Joseph Wappel", "Kelly Hebron", "Andrew Howard", "Kathleen Orr", "Kelly Hebron", "Joseph Wappel", "Joshua Buursma", "Kathleen Orr", "Khadijah Ali-coleman", "Sarah Goodson", "Joseph Wappel", "Kathleen Orr", "Kelly Hebron", "Khadijah Ali-coleman", "Sonney Wolfe", "Kevin Wisniewski", "Joseph Wappel", "Kathleen Orr", "Kevin Wisniewski", "Alexandra Omogbadegun", "Kathleen Orr", "Kevin Wisniewski", "Kathleen Orr"], "reviews": [{"professor": "Kathleen Orr", "course": "ENGL398C", "review": "Doc is great and cares so deeply for her class and students. I had her in her first semester at UMD and she was a bit disorganized but when it was brought to her attention, she did her best to correct it. After taking her class, I realized how much my writing had improved. She'll say it in class but use the writing center; it was really helpful. She grades by the rubric so follow it very carefully. If you have any problems, just talk to her because she will work to help you as best she can. She did such a great job at making sure her class was an inclusive environment and made sure everyone felt comfortable with each other. I made a lot of friends in the class and we all became acquaintances at the very least. She is a very lively person and helped wake me up for my 9:30 section (which not a lot of professors can do).", "rating": 5, "expected_grade": "A+", "created": "2021-12-08T19:41:27Z"}, {"professor": "Kelly Hebron", "course": "ENGL398C", "review": "Avoid Kelly at all costs- she is a terrible teacher, is unresponsive, and makes mistake after mistake with grading. You have to be constantly on top of her in order to make sure your grade is accurate, which is made even harder by how infrequently she responds to emails. She spends class time rambling on about random topics, and never actually teaches anything. Attendance is mandatory, so you have to go and sit there listening to her talk about her favorite Super Bowl ad for half an hour. She sprung random assignments on us at the last minute and called us rude and unprofessional when we complained. She's a fickle grader who doesn't really use a rubric, so you never really know what grade you'll get. ", "rating": 1, "expected_grade": "", "created": "2022-05-13T18:07:12Z"}, {"professor": "Sarah Goodson", "course": "ENGL398C", "review": "Absolutely awful prof. All communication (anything from emails to major assignment guidelines) is wildly unclear and always ridiculously and unnecessarily wordy. She grades unfairly, picks favorites, and is rude to students in front of the entire class. This class has been the biggest waste of time and money - I really wish I'd seen the numerous negative reviews left about her from her previous school. If I wasn't applying to grad school I would've withdrawn, despite needing the FSPW credit.", "rating": 1, "expected_grade": "A", "created": "2022-11-08T21:39:43.101059Z"}, {"professor": "Sarah Goodson", "course": "ENGL398C", "review": "The course is fine, but listen to these reviews - Prof Goodson is insufferable. She's relentlessly unclear and demanding of students. Someone needs to remind her that she's teaching a professional writing course lol. I ended up reporting her to the PWP department for being unprofessional and rude to students, as well as just being a useless professor overall.", "rating": 1, "expected_grade": "A-", "created": "2022-11-28T18:42:47.183639Z"}, {"professor": "Sarah Goodson", "course": "ENGL398C", "review": "Professor Goodson is the worst. Directions are unclear for every paper and she takes over a month to grade papers. I am convinced she did not read my last paper (2 pages) because she did not give any feedback other than \"pay attention to APA citing\". We had a paper due before break that was over 30 pages and our final paper is very long as well (around 15-20). I did not learn a single thing and was confused the entire class. There is a lot of busy work and half of the work is figuring out when stuff is due since no real syllabus is provided and assignment guidelines are always 4 pages. She never responds to emails and is rude to students when they ask questions. She also has favorites and is very clear about it. She is a terrible professor and this class was a waste of time and money.", "rating": 1, "expected_grade": "A-", "created": "2022-12-08T02:44:56.345385Z"}, {"professor": "Kathleen Orr", "course": "ENGL398C", "review": "Her class was very easy to follow. She was a great professor- very understanding and wants everyone to be comfortable in class. Required attendance, and if you didn't attend she (or the TA) will email you to make sure you were okay. Her class wasn't difficult, just pay attention and do the work early so you can ask questions if needed. I recommend to take her if you can!", "rating": 5, "expected_grade": "A", "created": "2023-05-17T19:46:27.047827Z"}, {"professor": "Sonney Wolfe", "course": "ENGL398C", "review": "I kept a 99.8% in the course. Highly recommend Sonney, as she is very understanding, takes time to go through feedback with you if you ask her.", "rating": 5, "expected_grade": "A+", "created": "2024-01-09T04:10:58.515351Z"}], "department": "ENGL", "course_number": "398C", "name": "ENGL398C", "title": "Writing Case Studies and Investigative Reports", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits.\nDesigned for students interested in becoming police investigators, educators, case workers, insurance adjusters, nurses, or program evaluators, or in entering branches of the social sciences that investigate cases and value reports based on accurate descriptions and compelling narratives. Such reports must be factual and yet useful to decision makers, unbiased and yet focused. Students study genres and language skills from careful summarizing to convincing storytelling.\n<i>\n<b>Prerequisite:</b> 60 credits and completion of ENGL101 or equivalent. This course satisfies the professional writing requirement.</i>\n<i>Click here for more course information.</i>", "is_recent": true, "geneds": null}