{"average_gpa": 3.2161564413345, "professors": ["Ann Bracken", "Robert Crane", "Danuta Hinc", "Melanie Faith", "Mark Fitzgerald", "Elizabeth McClure", "Catherine Bayly", "Kara Pleasants", "Lyra Hilliard", "Anna Szczepaniec-Bialas", "Justin Lohr", "Martha Thomas", "Kate Wilson", "David Miles", "Timothy Denevi", "Megan Callow", "Donald McNeilly", "Mark Forrester", "Pamela Gerhardt", "Robert Oliver", "Ann Mason", "Emily Lyons", "Joshua Weiss", "Daune O'Brien", "Michael Schmidt", "Paul Cote", "Radford Skudrna", "Erica Southerland", "Alexandra Calloway", "Kristofer Reed", "Tom Hatcher", "Justin Thompson", "Jesse Brooks", "Thomas Earles", "Christopher Crane", "Robin Allen-Klein", "Sabrina Islam", "Joshua Buursma", "Peter Grybauskas", "John Kim", "Aysha Jawed", "Peter Witte", "Alan Montroso", "Emilee Durand", "Virginia Butler", "Shannon Zellars Strohl", "Robert Lucci", "Benjamin Baker", "Andrew Delfino", "Kelly Tracy", "Andrew Delfino", "Catherine Bayly", "Daune O'Brien", "Mark Fitzgerald", "Kate Wilson", "Kathleen Orr", "Aysha Jawed", "Catherine Bayly", "Christopher Crane", "Daune O'Brien", "John Kim", "Kate Wilson", "Mark Fitzgerald", "Anna Josephson", "Benjamin Baker", "Catherine Bayly", "Christopher Crane", "Daniel Sidman", "Daune O'Brien", "Kate Wilson", "Kathleen Orr", "Marina Ellis", "Mark Fitzgerald", "Christopher Crane", "Justin Lohr", "Alan Montroso", "Brianne Friel", "Christopher Crane", "Laura Williams", "Liam Daley", "Alan Montroso", "Benjamin Baker", "Brianne Friel", "Christopher Crane", "Jesse Brooks", "Justin Lohr", "Laura Williams", "Benjamin Baker", "Christopher Crane", "Daune O'Brien", "John Kim", "Mark Fitzgerald", "Anna Josephson", "Daniel Sidman", "John Rendeiro", "Kate Wilson", "Kathleen Orr", "Benjamin Baker", "Amanda Fiore", "Catherine Byrne", "Alan Montroso", "Ariana Nash", "Christopher Crane", "Daune O'Brien", "John Rendeiro", "Christopher Crane", "Daune O'Brien", "John Kim"], "reviews": [{"professor": "Mark Forrester", "course": "ENGL391", "review": "Really swell guy,, i followed the reviews posted by these guys below and i dont regret it. He's a tough grader yes, but he is fair,,take him..always willing to help,, did i say he was a swell guy?", "rating": 5, "expected_grade": "A", "created": "2012-08-22T11:36:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391", "review": "I absolutely love Mark!  Not only he is an incredibly nice guy, he is also very funny in a subtle way.  He is invested in his students and in English, and he is always more than willing to help you perform to the best of your ability in his class. And he does learn your name quickly and is personable.  All-around great guy, great class...he tends not to give A's on assignments that often, but I like him so much that I can't hold that against him! Would highly recommend taking this class with him for your Junior English. ", "rating": 5, "expected_grade": "A", "created": "2010-05-08T19:15:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391", "review": "The class expectations are outlined extremely well in his syllabus. Just do the work and you'll get the grade you expect. He's somewhat of a tough grader when it comes to all the papers, but only because he wants you to actually try and not BS the work. Real nice guy, but talks forever. Easy class.", "rating": 4, "expected_grade": "B", "created": "2009-08-29T15:19:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391", "review": "I really enjoyed this class. You have to do a career portfolio, which includes a cover letter, a resume, and a personal statement, which can come in really handy for graduate programs. The rest of the course is devoted to coming up and writing about with a proposal to a problem that you could help solve. \n\r\nHe expects good work, but doesn't set the bar so high that it's impossible. You can tell that he enjoys teaching English and that he knows what he's talking about. He's super nice, learns your name very fast, and is readily available if you need to get in touch with him. ", "rating": 4, "expected_grade": "A", "created": "2008-04-30T18:29:00Z"}, {"professor": "Pamela Gerhardt", "course": "ENGL391", "review": "Great teacher. Fun, interesting, and very well taught class. Would highly recommend her for professional writing", "rating": 5, "expected_grade": "A-", "created": "2015-08-21T19:34:00Z"}, {"professor": "Pamela Gerhardt", "course": "ENGL391", "review": "I took it over the summer, and my writing has never improved so much in so little time. she is kind and smart, so take it with her!", "rating": 5, "expected_grade": "A", "created": "2013-04-22T17:30:00Z"}, {"professor": "Robert Crane", "course": "ENGL391", "review": "Professor Crane is great!  He is very through with not only his classroom instruction, but also his expectations.  He is humorous and is really devoted to helping students improve their writing abilities. I would definitely recommend him!", "rating": 5, "expected_grade": "A", "created": "2010-05-21T19:48:00Z"}, {"professor": "Robert Crane", "course": "ENGL391", "review": "Great professor. Would highly recommend him to anyone who has to take ENGL391.\n\r\nMy writing has improved a lot because of this class.", "rating": 5, "expected_grade": "", "created": "2010-05-11T08:56:00Z"}, {"professor": "Elizabeth Fixsen", "course": "ENGL391", "review": "This class consumed majority of my time. You have a 5-8 page paper due every week plus other assignments on top of that. She is very picky when she grades. She's kind of out there. Wouldn't recommend. ", "rating": 1, "expected_grade": "C", "created": "2009-06-28T23:44:00Z"}, {"professor": "Melanie Faith", "course": "ENGL391", "review": "I just started taking this class after having to drop another ENGL391 class. I switched into the class a week into the semester (not normally a big deal) but the second I emailed Dr. Faith about making up missed work in a timely fashion, she replied with a very rude and blunt email. I then showed up to class the second week and introduced myself before the class started and asked what I could do to get myself back up to speed and she, for lack of better words, \"embarrassed me\" in front of my peers by saying that I should have contacted her even before switching into her class and got caught up on a plethora of assignments before I came to the second class meeting when I was not even positive I was switching classes nor did she email me back useful information regarding makeup work. Then, she instructed me to talk to the TA about catching up after I apparently made her too frustrated (although I may have said about 10 words) to continue our conversation. The TA, did not have the ability to explain the work to me because he couldn't find all of the work to make up since the ELMS page is a mess and very hard to navigate. Although her grade distribution may be favorable, I already would not recommend taking this class with her unless you plan on getting shredded to pieces every time you miss a class or do not understand how to complete an assignment. ", "rating": 1, "expected_grade": "", "created": "2015-02-03T15:07:00Z"}, {"professor": "Melanie Faith", "course": "ENGL391", "review": "WORST PROFESSOR EVER\n\r\nThought I'd leave a review since there aren't any recent ones for her.  She was my junior English professor this past semester (Fall 2014).  Worst professor I have had in my 3 years at the University of Maryland.  I have honestly not had a professor or TA who came close to being as terrible as she was.  \n\r\nDidn't know how to use ELMs at all, or any technology for that matter.  She forced us to use online technology that she didn't have a clue how to use, such as Microsoft OneDrive and an online web site creator.  \n\r\nIn regards to ELMs, She set up her ELMs in the most confusing, nonsensical way possible.  We couldn't even view our grades, which didn't make a difference anyway as she graded about 80% of our assignments on Christmas Eve, including assignments from September and October... DID NOT HAVE A SYLLABUS!  She had one at first, did not stick to it at all, and then ended up deleting it from ELMs because as she said, \"some students were going ahead and doing assignments before they were due\" or in other words, they were being good students....\n\r\nAs other reviewers have said, she was also very rude and sometimes would yell at us when we were confused with her directions.  She made the most random due dates, with an assignment due almost every Saturday, Tuesday, and Thursday.  Also made a research assignment to be due the day after Thanksgiving, saying that we have to talk to our relatives at Thanksgiving dinner to learn about their careers or something...after a few students complained she moved the due date ahead two days to the day before Thanksgiving.  I failed to mention that she would not release assignments until a day or a few days before they were due, for no reason at all.\n\r\nWhile I received an A in the class, her grading was extremely strange, and seemed to be subjectively given.  For example, she would write a decent number of  criticisms on assignments and then give an A on the paper, while another paper would have one or two grammar errors and receive a C...\n\r\nDefinitely agree with the person below who said she pries into students' personal lives.  Completely unprofessional, and would also make rude comments on students who weren't in class, especially on their personal lives.  She would also be very rude to her TA.  One class the TA got the attendance wrong and after she left Faith spent 5 minutes talking trash about her and how the University doesn't offer good TAs for English.  \n\r\nWhile I feel bad giving her 1 star while receiving an A in the class, she is without a doubt the worst professor I have ever had or even heard of at the University of Maryland.  There would be times when she would give ridiculous explanations or when she would yell at us, and the class would be shaking their heads and looking at each other incredulously.  Seriously do not take a class with this professor.  ", "rating": 1, "expected_grade": "A", "created": "2014-12-26T16:07:00Z"}, {"professor": "Melanie Faith", "course": "ENGL391", "review": "Dr. Faith is one of the worst professors I have ever had. Do not take a class with her. Even though I am expecting an A, I don't think she should be teaching. She didn't post due dates until the day before, and was extremely disorganized. Her personality is very blunt and sarcastic. She actually screamed at our class one day because none of us understood what she expected of an assignment. Stay away! I promise that you will thank me later. ", "rating": 1, "expected_grade": "A", "created": "2014-12-09T22:58:00Z"}, {"professor": "Melanie Faith", "course": "ENGL391", "review": "I absolutely loved Dr. Faith. It breaks my heart to read these bad reviews because I honestly believe she cares about her students. She is a GREAT teacher. I learned so much from her that I actually needed to learn for the professional world. The class is also easy. Luckily I am pretty decent at writing, but if you are not then she will help you along the way. If you ask her for anything she will help you. She cares less about grading than she does about her students learning. She was also bullied by several students in my class for some really weird reason. I guess they did not like her but she handled it well and professionally. I LOVE Dr. Faith. Take this class with her! Easy A if you simply do the work or ask her how you can improve AND you learn really useful information.", "rating": 5, "expected_grade": "A", "created": "2014-07-14T12:39:00Z"}, {"professor": "Melanie Faith", "course": "ENGL391", "review": "STAY AWAY FROM THIS PROFESSOR!\n\r\nI agree wholeheartedly with the other reviews of Dr. Faith even though they are from years ago. I took this professor my last semester at UMD and it was horrific. Unlike all other professors, Dr. Faith does not have a completed syllabus ready at the beginning of the semester to predict future assignments and due dates. She literally makes it up as the semester proceeds. After the first maybe 2 weeks of her class, for all other assignments she expects not a single error in any writing assignment and trust me you WILL be writing the ENTIRE SEMESTER; if a holiday is around the corner, rest assure, YOU WILL NOT BE RELAXING, YOU WILL BE WRITING OR RESEARCHING!\r\nAnother issues is that Dr. Faith, not once has looked presentable as a professor. She will constantly wear velour  suits and ragged sneakers. She is repeated prying through her students' personal lives when they do not feel the need to share information. \n\r\nIf you are signed up for her class, word of advice, FIND A NEW PROFESSOR!", "rating": 1, "expected_grade": "A", "created": "2013-06-19T16:29:00Z"}, {"professor": "Melanie Faith", "course": "ENGL391", "review": "Great teacher once you really get to know her. Just do your work and do whatever she asks of you and the class will be fun!", "rating": 5, "expected_grade": "", "created": "2010-12-10T20:17:00Z"}, {"professor": "Melanie Faith", "course": "ENGL391", "review": "DO NOT TAKE ANY CLASS WITH THIS PROFESSOR!\n\r\nI will be very honest. I recieved an A in this class. However, I would have gladly gotten a C in this course if I could have had another professor. \r\nProf. Faith is a horrible teacher. She is not organized and often blames the students for her bad days. For example, she still had not changed her clock for daylights savings time even though it had been 3 days since daylights savings. Because of this, she missed one of the classes and so all the students, after waiting for almost 30 minutes for her to show up, went home. Next thing we know, we all get this scathing email from her in which she calls US irresponsible for not reminding her about daylights savings!!! Sorry...didn't realize it was the students' responsibility to make sure the teacher was aware of when to show up to teach. \n\r\nShe is also a very biased teacher/ grader. She picks on some students unnecessarily while ignoring others. She is never clear in her expectations for her assignments and often changes her mind about what she wants. And then she gets angry at the students for not doing the assignment like she had wanted it. \n\r\nI have never met such an irresponsible, unprofessional, and frankly, inept professor such as her. Like I said, I got an A in her class and I would still never take her class if I could do it over again. ", "rating": 1, "expected_grade": "A", "created": "2010-02-07T00:28:00Z"}, {"professor": "Melanie Faith", "course": "ENGL391", "review": "Professor Faith was rarely appropriate or helpful as an instructor. On the first day of class she told us that we were all probably in her Junior Engilsh class because we were too stupid to pass freshman english with an A. Those of us who were there because our English major required it were, needless to say, fairly offended. \r\nLater on the first day when she was calling roll, she mispronounced one of the girls names, the girl corrected her every day for the first two weeks. Faith proceeded to mispronounce her name every day for the rest of the semester.\r\nEverytime we were supposed to turn in a project,we would ask her what order things needed to be in, and every day for a week she would change her mind about how she wanted things. \r\nDespite the fact that I was there all but one day of class, and was a leader in our group project, she gave me a B as my participation grade. \r\nShe took forever to grade everything we turned in, and was even a day late for turning in our final grades to Testudo.\r\nDr. Faith had her funny moments, but mostly, she was a huge dissapointment as a teacher.", "rating": 2, "expected_grade": "A", "created": "2009-12-23T11:58:00Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL391", "review": "Terrible teacher. She's practically incoherent during lecture. She has no grade breakdown and can't even explain where points came off if you ask. I haven't learned anything in over 9 weeks over taking this course. She obviously favors the few students who talk to her after class the most and take multiple courses with her (she also teaches business writing and does work in the professional writing department with interested students).", "rating": 1, "expected_grade": "B-", "created": "2018-11-05T21:32:24Z"}, {"professor": "Mark Forrester", "course": "ENGL391", "review": "Best English professor ever. Assignments are reasonable and enough time is given to finish them. He doesn't grade harshly either and wants you to succeed. He realizes everyone is a junior/senior and that we're lazy so he actually makes class fun and not stressful. All assignments are connected and are about the same topic. They lead up to the final paper which combines all the work you already did throughout the semester. Most papers aren't more than two pages, last paper is around 10. He's not strict about page or word count either. Haven't gotten below a 95% on anything", "rating": 5, "expected_grade": "A+", "created": "2018-11-13T01:18:52Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL391", "review": "Terrible experience. Class time is wasted going over random things and just going on tangents. She has no grade breakdown so it feels as though she just bases grades on who her favorites are. I am average at English and was struggling to get a B just because she seemed to not like me as much as others. She is rude to her students and told another student that compared to my writing she was doing well....do not recommend taking her", "rating": 1, "expected_grade": "B-", "created": "2018-11-16T15:38:42Z"}, {"professor": "Melanie Faith", "course": "ENGL391", "review": "Melanie was super nice and an easy teacher. Take a little time the first few classes to establish a relationship with her and you'll have a great class", "rating": 5, "expected_grade": "A", "created": "2019-08-22T20:29:53Z"}, {"professor": "Sabrina Islam", "course": "ENGL391", "review": "Sabrina Islam is fine. It's an English class, so the professor doesn't really matter much. I skipped probably about half the lectures, and I'm still doing fine. If you can write decent papers, this class is easy. If you struggle with writing, then you might have some trouble.\r\n\r\nMy biggest complaint is that it takes forever for her to grade papers. Some of the assignment descriptions are kind of hard to get the hang of (maybe I should've gone to class more), so it was hard to tell sometimes if I was really writing about what the paper was supposed to be about. Since it took so long for the grades to come back, it kind of left me in suspense for a long time. Oh well, the grading itself is pretty lenient, or at least I think it was.", "rating": 3, "expected_grade": "A", "created": "2020-12-15T16:36:22Z"}, {"professor": "Sabrina Islam", "course": "ENGL391", "review": "Very kind and clearly passionate about English. Didn't do a great job making the class engaging in the online platform, but would take professional writing with her again if given the opportunity. I always felt encouraged and never walked away from a grade without great and constructive feedback.", "rating": 4, "expected_grade": "A", "created": "2020-12-26T01:22:47Z"}, {"professor": "Shannon Zellars Strohl", "course": "ENGL391", "review": "Prof Zellars Strohl was really helpful whenever I had questions about the major assignments. I found myself going to her (online) office hours a couple of times throughout the semester. However, I did find she graded a little harshly and left little comments about how to improve. I did a blended setting (so one day was synchronous while the other was not); I personally think the synchronous meetings were not productive for me to get anything out of it, but they were okay.", "rating": 4, "expected_grade": "A", "created": "2021-01-12T07:52:03Z"}, {"professor": "Daune O'Brien", "course": "ENGL391", "review": "Prof. O'Brien is super caring and practical. She noted how hard it was to complete quick turnaround assignments and is very lenient with extensions, barring a BS reason. She also accounted for pandemic time and cut down coursework significantly to help us out. She gives great feedback on writing, and really focuses on providing constructive suggestions. Definitely take a class with Prof. O'Brien if you can. ", "rating": 5, "expected_grade": "A", "created": "2021-04-12T16:23:39Z"}, {"professor": "Peter Grybauskas", "course": "ENGL391", "review": "Prof G. is the man!\r\n\r\nI didn't really know what to expect when I took ENGL391. I thought it would be your run of the mill English class with reading and writing. However it turns out the course was centered around food themes. Who doesn't like food?\r\nThe readings that were assigned were very engaging and surprisingly so were the assignments. He brought in some interesting speakers as well.\r\n\r\nConclusion: if I had to take an english class again I would take him as an instructor for sure.", "rating": 5, "expected_grade": "", "created": "2021-05-15T01:13:07Z"}, {"professor": "Benjamin Baker", "course": "ENGL391", "review": "Do not take this class. Stay away from the professor. Class averages for papers were Ds. He is a horrible professor who sets students up to fail his class. When I tried talking to him about my grades he told me he could deduct more points if he wanted to. When the class average is a D the professor is a failure not the students. Take any other professional writing course with any other professor", "rating": 1, "expected_grade": "B", "created": "2021-09-10T21:57:10Z"}, {"professor": "Thomas Earles", "course": "ENGL391", "review": "Really, really subjective about grading. Getting a rubric from him is like getting water from a stone. That said, he's pretty forgiving if you have decent grammar and mechanics in your paper. Funny guy too. Probably would recommend if you're already decent at writing because he doesn't necessarily *teach* a lot, necessarily. ", "rating": 3, "expected_grade": "A", "created": "2021-11-24T21:11:45Z"}, {"professor": "Kelly Tracy", "course": "ENGL391", "review": "She's a nice lady and she has clear guidelines. There's a lot of writing as expected. My main complaint is that she graded a couple of my assignments harshly.", "rating": 3, "expected_grade": "", "created": "2021-12-19T00:25:02Z"}, {"professor": "Peter Grybauskas", "course": "ENGL391", "review": "Prof. G is a really cool guy. Yeah he's quirky, but it works! Also, the food writing aspect of this class is TOP TIER. Other 391 classes have to write full on essays and stuff while we write recipes, interview chefs, and review restaurants. As a con, I guess he isn't always super clear on what he's looking for in his assignments. But if you just ask him questions in class he's always willing to guide you. Overall, I highly recommend his class.", "rating": 5, "expected_grade": "A", "created": "2021-12-21T00:01:58Z"}, {"professor": "Mark Fitzgerald", "course": "ENGL391", "review": "Avoid this professor if you can! Firstly he takes forever to grade, I would often be waiting 2 weeks or more for feedback on assignments. Secondly, he does not tell you why he takes certain points off, he just does under the guise of a \"flexible rubric\". Thirdly, this course has insane amounts of work, compared to other FSPW classes my friends are taking. Fourthly, the content of the course is absolutely awful in general, it's just reading about a bunch of spoiled rich people prance about the world living rich people fantasies, and is completely insufferable to read about constantly. DO NOT TAKE THIS ENGL391 WITH HIM.", "rating": 1, "expected_grade": "B", "created": "2022-04-20T03:49:07Z"}, {"professor": "Daune O'Brien", "course": "ENGL391", "review": "She's actually really nice. The workload is not that much it's managable. She provides great feedback on your projects and is very understandable when it comes to extension. I recommend you take her!", "rating": 5, "expected_grade": "", "created": "2022-04-20T18:49:55Z"}, {"professor": "Daune O'Brien", "course": "ENGL391", "review": "She's actually nice. The workload is manageable and she gives great feedback on your project on what you need to work on to improve and is very understandable when it comes to asking for an extension. I recommend you take her!", "rating": 5, "expected_grade": "", "created": "2022-04-20T18:55:56Z"}, {"professor": "Mark Fitzgerald", "course": "ENGL391", "review": "This professor talks so slow it makes me want to put him on 2x speed in real life. He appears to wing every class and does not actually have a formal plan. He gives students undescriptive rubrics and expects them to succeed. Does not offer one on one help with your writing and will not work with students on personal improvement. ", "rating": 3, "expected_grade": "A-", "created": "2022-05-13T20:52:07Z"}, {"professor": "Mark Fitzgerald", "course": "ENGL391", "review": "There was little to no formal direction with each assignment, so many of them consisted of guessing what he was looking for. He would not work one-on-one with students, and his feedback on papers was cryptic and usually boiled down to buzzwords. He sometimes lashed out at students during lectures for asking questions. This course was intended to be a general/argumentative writing course, and he changed the topic to travel writing without any indication of this during course registration. I would not recommend risking it with this professor.", "rating": 1, "expected_grade": "A", "created": "2022-10-09T03:35:40.615524Z"}, {"professor": "Peter Witte", "course": "ENGL391", "review": "Professor Witte is like that fun, chill dad everyone just likes. He teaches conversationally, encouraging you to speak (and write) your mind. The course is mostly made up of readings and weekly writing responses, which are about 1 page and again, allow you to say what you want without there being a right answer. And contrary to what Testudo says, the class is asynchronous one day a week and synchronous the other. The live in-person day is a casual class discussion that you’ll genuinely look forward to. Highly recommend Witte. An awesome guy and even better professor.", "rating": 5, "expected_grade": "", "created": "2022-12-08T19:28:57.154837Z"}, {"professor": "Catherine Bayly", "course": "ENGL391", "review": "Amazing professor who cares about her students and the class. Clearly outlines assignment expectations and grading and is flexible with deadlines as long as you communicate. The content of the class isn't tough and some of the projects were actually pretty interesting, but the number of assignments is definitely going to make you work. However, if you put in the work, you will get an A.", "rating": 5, "expected_grade": "A", "created": "2022-12-16T02:54:53.519120Z"}, {"professor": "Mark Forrester", "course": "ENGL391", "review": "One of the best professors I've had at UMD so far. Incredibly helpful and understanding. He explains all assignments clearly and gives plenty of examples of what he's looking for. If I could I'd take another one of his classes just for fun.", "rating": 5, "expected_grade": "A-", "created": "2023-01-11T16:58:25.234220Z"}, {"professor": "Peter Grybauskas", "course": "ENGL391", "review": "He is amazing. His food writing class in Italy is so much fun - literally the best study abroad program. He’s really intelligent and is a great teacher, and knows so much about Italian food and culture. If you want to go on vacation for 3 credits, this is your class.", "rating": 5, "expected_grade": "A-", "created": "2023-03-06T14:31:18.598992Z"}, {"professor": "Kate Wilson", "course": "ENGL391", "review": "Do not take her if you do not wish to be drowning in an unnecessary amount of work weekly. I have never written a review of anyone before and created an account to specifically beg you not to take her. Not only a tough grader, but assigns tedious work that takes hours. Compared to other professional writing classes (ENGL391), our class has much more work than other students enrolled in the same course.", "rating": 1, "expected_grade": "A", "created": "2023-04-03T14:46:41.701451Z"}, {"professor": "Benjamin Baker", "course": "ENGL391", "review": "A really enthusiastic, funny, and caring professor. Assignments were not hard at all, few and spread evenly across the semester. If you just attend class, engage in class, and put in the work, it really is an easy A", "rating": 5, "expected_grade": "A", "created": "2023-05-14T00:14:45.466747Z"}, {"professor": "Amanda Fiore", "course": "ENGL391", "review": "Such a hater bruh, if you just tryna take this as a Gen Ed then don't take her; be acting like this your only class sometimes she need to calm down.", "rating": 2, "expected_grade": "A-", "created": "2023-11-14T06:57:49.669465Z"}, {"professor": "Daniel Sidman", "course": "ENGL391", "review": "I take this class because it required for my major. I never went to his class after the first week and this dude is super chill about whether you go to his class or not, as long as you doing the homework, you will be fine, and he give generous grade. Workload is easy, I never struggled for his class. if you don't have time for the paper, trust me just write something and he will give a pretty good grade as long as you submit something. Very chill professor.", "rating": 5, "expected_grade": "A+", "created": "2023-12-04T01:40:33.894333Z"}, {"professor": "Amanda Fiore", "course": "ENGL391", "review": "I felt like I could never do anything right in this class. She wanted us to all write in the same formulaic way, so I changed my entire writing style to fit her examples, though my work was still no \"better.\" The grading for this class is ridiculous, the average on every assignment was way lower than it should've been for what this class is. For someone who loves writing and whose major is just a whole bunch of writing, the professor made me feel heavily discouraged and unconfident. The content itself was not a challenge, but paired with the professor... this may be one of the most annoying classes you take at UMD.", "rating": 2, "expected_grade": "A-", "created": "2023-12-12T22:05:28.191638Z"}, {"professor": "Daune O'Brien", "course": "ENGL391", "review": "O'Brien is amazing! Super sweet and provides everything needed. \r\nFirst major project can be done in groups, so I would recommend trying to take the class with people you know rather than a random group. Did not go well on my end going with a random group. However, you build onto it throughout the semester so it's not that bad at all.\r\nSecond major project is just you summarizing old projects, super easy and can be done in a day.", "rating": 5, "expected_grade": "A+", "created": "2023-12-16T12:22:35.778793Z"}, {"professor": "Peter Grybauskas", "course": "ENGL391", "review": "Prof G is easily the best professor I’ve had at UMD. Deeply passionate about what he’s teaching, very approachable & responsive when you contact him, and he’s understanding of personal circumstances. Classes themselves are always interesting too, really funny and engaging, and the work is challenging without being overwhelming.", "rating": 5, "expected_grade": "A", "created": "2023-12-22T23:56:02.876435Z"}, {"professor": "Peter Grybauskas", "course": "ENGL391", "review": "I took this course over the winter, so I went into it a bit concerned about the workload, but it ended up being very manageable for a 3-week course. This was a unique kind of professional writing course that was specifically held during the winter, where our writing assignments were based around the work of J. R. R. Tolkien. A good chunk of the workload was simply reading the Lord of the Rings, and our assigned writings were mostly creative assignments that were open-ended (no stressful research papers). Every assignment felt meaningful and relevant, and he was on top of responding to emails if we had questions about the assignments. We had a few zoom meetings where he enthusiastically talked about Tolkien's life and his writing, and where we also got a peak into a study abroad session in Oxford, U.K. I don't know if this course will be offered every year, but if it is being offered and you don't mind spending some extra money to knock out your professional writing requirement during the winter, I could not recommend it more. Even if you're not a book fan, you will definitely enjoy this course more than most other professional writing courses. He's also just a cool guy in general and would recommend him regardless of the class.", "rating": 5, "expected_grade": "", "created": "2024-01-26T05:30:45.861261Z"}], "department": "ENGL", "course_number": "391", "name": "ENGL391", "title": "Advanced Composition", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits.\nAn advanced composition course which emphasizes constructing written arguments accommodated to real audiences.\n<i>Click here for more information on professional writing courses.</i>", "is_recent": true, "geneds": null}