{"average_gpa": 3.1405052264808364, "professors": ["James Goodwin", "Elizabeth McClure", "Rachel Penman", "Collier Cobb", "John MacIntosh", "Nathaniel Underland", "Nicholas Slaughter", "Virginia Butler", "Lindsey O'Neil", "Amy Karp", "Nancy Stewart", "Robert Wakeman", "Hillary Roegelein", "Justin Thompson", "Aqdas Aftab", "Konstantinos Pozoukidis", "Shalom Rosenberg", "Kerishma Panigrahi", "Fredrick Cherry Jr", "Liam Daley", "Elizabeth Dinneny", "Katie Bramlett", "Emilee Durand", "Aaron Bartlett", "Elizabeth Dinneny", "Fredrick Cherry Jr", "Dylan Lewis", "Tyra Griffin", "Timmy Bridgeman"], "reviews": [{"professor": "Elizabeth McClure", "course": "ENGL265", "review": "I have to agree with the previous anonymous post. I wanted to like this professor - on the first day she seemed really nice and accomodating, offering extensions on assignments if a student has too much going on and so forth - but was an ultimate let-down. She was incredibly last-minute in regards to many aspects. I know I may be last-minute as well, but I am not the teacher of this course and even I found myself wondering where information was on Blackboard and why I my e-mail had not been responded to. She makes her assignments incredibly vague and confusing and, honestly, expects far too much from her students for a 200-level course. It seems as though she wishes she were teaching a 400-level Queer theory course when she is in reality teaching a 200-level literature course. This is especially annoying to me considering the fact that it is apparently not counting as requirements for my major, despite the fact that it is the most rigorous course I am currently enrolled in. If you are expecting this course to be anything like other minority literature courses through this university, you are advised to understand that this is not the case. It is more a psychological research course than anything else. Professor McClure, if you read this ever, just be aware that this is nothing personal. You seemed like a great person and that I would enjoy you as a friend were I in your age group, but you have far too high expectations for mostly underclass-students who think they are in for a course focused around literature discussion.", "rating": 1, "expected_grade": "", "created": "2012-12-08T22:33:00Z"}, {"professor": "Kerishma Panigrahi", "course": "ENGL265", "review": "The texts Kerishma picks out are really good if you are already interested in the subject matter, which I was. She is a pretty average grader, not too harsh, and she provides plenty of extra credit opportunities. There is one big 5 page essay, a short 2 page one, and an option for another big essay or a creative project for the final. There is no midterm or test final, at least for this semester. Overall, I loved having her teach!", "rating": 5, "expected_grade": "A+", "created": "2021-01-12T19:21:11Z"}, {"professor": "Elizabeth Dinneny", "course": "ENGL265", "review": "A wonderful professor that is obviously very enthusiastic about the material. She makes enough time for the class to really understand the readings because they can be a bit dense. Incredibly understanding when it comes to personal issues that can come in conflict with class time. They're very respectful to every student and doesn't treat the class as an obligation, but rather a passion. I highly recommend having them as your professor for any class. ", "rating": 5, "expected_grade": "A-", "created": "2021-11-17T17:24:30Z"}, {"professor": "Liam Daley", "course": "ENGL265", "review": "Professor Daley is likely the best professor I have had so far. He makes an effort to connect with his students in class, he is extremely funny, and although he tends to go off on tangents, all of his class discussions are thoroughly meaningful and relevant to the topics in class. The quizzes are easy if you have done the assigned readings before class and there are lots of opportunities on them for extra credits. \r\nThe major assignments in this class include two papers and one presentation, both of which he gave us extreme flexibility with on content and still managed to be relevant and thought-provoking. \r\nOverall, the class is extremely fun and everyone in it seems to enjoy it greatly as class participation is very high and enthusiastic. ", "rating": 5, "expected_grade": "", "created": "2021-11-18T04:41:46Z"}, {"professor": "Emilee Durand", "course": "ENGL265", "review": "Dr. Durand is fantastic! She's a great discussion leader- she makes every course text interesting to talk about, even when they're not very fun to read. She gets paper feedback & grades to you pretty quickly, and gives insightful comments about what to improve/what worked well. I didn't feel like she was a particularly tough grader, but maybe that was just me. Definitely would recommend her for any literature class.", "rating": 5, "expected_grade": "A+", "created": "2022-05-20T02:20:09Z"}, {"professor": "Liam Daley", "course": "ENGL265", "review": "He was a nice professor who provided engaging readings with broad topics; however, SUCH a harsh grader. He seemed to disapprove of the generic, repetitive academic writing style. This is clearly shown in his grading, which is fine but I wish he could have expressed that. Many professors often approve of this style but he is set in his ways. You just need to adjust to his expectations.", "rating": 3, "expected_grade": "", "created": "2022-05-31T17:43:30Z"}, {"professor": "Aaron Bartlett", "course": "ENGL265", "review": "I don’t actually know what my grade is because it’s the end of the semester and he has only put like 3 grades in and one of them is participation. I can’t tell if he’s not grading on purpose or if he’s just very lazy. It seems like he’s grading so late so that if you have any questions about your grade at the end, it’s already too late.", "rating": 1, "expected_grade": "B", "created": "2022-12-13T22:43:44.251887Z"}, {"professor": "Aaron Bartlett", "course": "ENGL265", "review": "Most aggressive grader I have ever had. He is pretentious and gives poor feedback. Not a fan", "rating": 1, "expected_grade": "B-", "created": "2022-12-15T19:22:58.561965Z"}, {"professor": "Aaron Bartlett", "course": "ENGL265", "review": "I took this class in Fall 2022, and I thought he did a great job with it.  The readings and the material in general were very interesting, and the class was structured to be guided more by student discussion than by an instructor's lectures, which was a great way to approach this material.  However, this means he does expect a lot of participation (it was part of our grade), so it was necessary to actually do the readings (which a lot of people didn't).  The assignments required effort but weren't too hard, and I thought his grading was fair.   I found this to be a fun and fairly low-stress course.", "rating": 4, "expected_grade": "A", "created": "2023-04-22T02:39:05.857479Z"}, {"professor": "Fredrick Cherry Jr", "course": "ENGL265", "review": "Great professor! The class was tough (as a non-english major, it was a lot of reading, and at a fairly high level), but it was super interesting and definitely worth it. His classes were primarily discussion based, so if you didn't read beforehand, you can't really participate. \r\n\r\nThe first assignment he had us read (An Inventory Of Shimmers) was a total weed-out reading and not reflective of how difficult the rest of the course would be. I almost dropped out of the course because of it, but I'm glad I didn't. Bear with it, it's worth it! \r\n\r\nSome of the texts though will really challenge you, especially some of the theory heavy ones, bordering on pretentious (like the weed-out paper), or at least seem that way to a non-major. However, not all of them are like this, and imo only two of the reading assignments were like that, really. To be totally honest, I still don't *really* know what affect theory is actually, as it is very (intentionally?) nebulously defined in class and in the texts we read. I'm not convinced that anyone else actually knows what it is either lol \r\n\r\nOverall though, I would still recommend you take one of his classes if you get the chance. I learned a lot, though if you take it, be prepared to do a lot of reading and writing. It is a literature class, after all, though, so that should be expected.", "rating": 5, "expected_grade": "A", "created": "2023-09-08T01:47:22.870222Z"}, {"professor": "Dylan Lewis", "course": "ENGL265", "review": "He was really nice! His class is a lot like a book club, honestly, and the assignments are creative and fun. He's really lax with deadlines and lets you take some late days with no issues. He was just a really informative, laid-back, and fun professor.", "rating": 5, "expected_grade": "A", "created": "2023-11-28T00:12:43.780649Z"}, {"professor": "Dylan Lewis", "course": "ENGL265", "review": "Great professor! He's so fun and easygoing, is really nice if you need to take some late days, and the assignments were pretty fun too! You have to like reading though lol.", "rating": 5, "expected_grade": "A+", "created": "2023-12-10T00:58:04.472602Z"}], "department": "ENGL", "course_number": "265", "name": "ENGL265", "title": "LGBTQ+ Literatures and Media", "credits": 3, "description": "<b>Restriction:</b> Must not have completed LGBT265.\n<b>Cross-listed with:</b> LGBT265.\n<b>Credit only granted for:</b> ENGL265 or LGBT265.\nA study of literary and cultural expressions of queer and trans identities, positionalities, and analytics through an exploration of literature, art, and media. We will examine historical and political power relations by considering the intersections of sexuality and gender with race, class, nation, and disability. Topics include the social construction and regulation of sexuality and gender, performance and performativity, intersectionality, and the relationship between aesthetic forms and queer/ trans subjectivity. Our interpretations will be informed by queer and trans theories.", "is_recent": true, "geneds": null}