{"average_gpa": 3.3412408759124093, "professors": ["Adam Lloyd", "Ruth Osorio", "Valerie Johnson", "Kathryn Frew", "Lyra Hilliard", "Porter Olsen", "Maria Gigante", "Travis Webster", "Aaron Dinin", "Elizabeth Ellis", "Kathryn Kaczmarek", "Daniel Kason", "Setsuko Yokoyama", "Paul Cote", "Emilee Durand", "Brittany Starr", "Roberto Leon", "Brian Davis", "Alexis Walston", "Brittany Starr", "Sarah Goodson", "Nasim DarouieHaghighi", "Sarah Goodson", "James Perla"], "reviews": [{"professor": "Brittany Starr", "course": "ENGL293", "review": "Britt was great for ENGL293, she only required short readings for every class and there are only 3 major assignments throughout the course. One of the best class I've taken at UMD.", "rating": 5, "expected_grade": "", "created": "2022-04-06T14:20:38Z"}, {"professor": "Brittany Starr", "course": "ENGL293", "review": "Amazing professor. She is super nice and grading is super chill. She just wants you to participate and it'll be an easy A. Wayyy easier than I thought an ENGL200+ class would be. I totally recommend her. She is a gem of a professor.", "rating": 5, "expected_grade": "A", "created": "2022-05-11T02:03:15Z"}, {"professor": "Sarah Goodson", "course": "ENGL293", "review": "Professor Goodson is one of the best profs I've ever had. You can tell she really cares about the course conduct and her students. Definitely take a class of hers before you graduate.", "rating": 5, "expected_grade": "A", "created": "2022-10-20T05:08:56.506540Z"}, {"professor": "Sarah Goodson", "course": "ENGL293", "review": "Professor Goodson is not a bad professor, but she is not a particularly great one either. The assignments she provides are often times very unclear, and her explanations do not help either. She places heavy emphasis on telling us that there is no proper way to write the assigned papers, which is good in theory, but leads to a lot of unnecessary confusion that shows when she grades the papers and provides feedback. I will say that her lectures are generally very engaging and she seems very excited to interact with the students when it comes to discussing the assigned readings. She generally does not respond to emails though, which is very anxiety inducing. Taking this class with this professor is not the worst thing, but do expect plenty of confusion when it comes to writing the papers and reading the homework.", "rating": 3, "expected_grade": "B+", "created": "2022-12-12T01:42:58.363102Z"}], "department": "ENGL", "course_number": "293", "name": "ENGL293", "title": "Writing in the Wireless World", "credits": 3, "description": "<b>Recommended:</b> ENGL101.\nA hands-on exploration of writing at the intersection of technology and rhetoric. Students will learn to read, analyze, and compose the kinds of multimodal documents--documents combining text, image, and sound--that constitute communication in our digital world.", "is_recent": true, "geneds": null}