{"average_gpa": 2.8873191489361703, "professors": ["Douglas Kern", "Zita Nunes", "Mary Washington", "Edlie Wong", "Lewis Gleich", "Abbey Morgan", "Emily Perez", "Laura Williams", "Delisa Hawkes", "Timothy Bruno", "Norrell Edwards", "Isis Semaj-Hall", "Christin Taylor", "Anna Steed", "Sarah Sillin", "Joslyn Bloomfield", "Sarah Humud", "Dominique Young", "Steve Beaulieu", "Keisha Allan", "Mike Kolakoski", "Andy Yeh", "Elizabeth Catchmark", "Chauncey Dennie", "Alexandria Nunn", "Elizabeth Catchmark", "Chauncey Dennie", "Fredrick Cherry Jr", "Tyra Griffin", "Fredrick Cherry Jr", "Anthony Batts", "Tyra Griffin"], "reviews": [{"professor": "Zita Nunes", "course": "ENGL234", "review": "She is a tough cookie. This class was very interesting but it was a ton of work. Lots of readings that were essential to passing the quizzes (twice a week) and papers that were graded so unfairly it was ridiculous. However, she is a very nice woman who made every effort to allow her students the chance to get an A. It just took a ton of work, which I didn't expect.", "rating": 4, "expected_grade": "A", "created": "2011-06-14T23:47:00Z"}, {"professor": "Zita Nunes", "course": "ENGL234", "review": "Very interesting lectures. 2 quizzes a week, one in lecture and one in discussion. A LOT of reading and you must read to do well on quizzes. Papers are graded toughly but tests are just old quiz questions. overall good class", "rating": 4, "expected_grade": "b", "created": "2008-11-14T01:11:00Z"}, {"professor": "Mary Washington", "course": "ENGL234", "review": "Professor Washington is a great professor! but absolutely DO NOT take this class if you dont want to read. We covered about 8 books in one semester! that was the most draining part. Her quizzes are very exquisite in detail, which makes it rather hard. but I learned a lot. Definitely recommend this class ", "rating": 4, "expected_grade": "B+", "created": "2011-12-06T14:41:00Z"}, {"professor": "Mary Washington", "course": "ENGL234", "review": "dont ever take this class unless you want to read a lot, listen to lectures about nothing, and fail the final regardless of the amount of reading or work you did for the class", "rating": 1, "expected_grade": "", "created": "2011-05-14T17:08:00Z"}, {"professor": "Mary Washington", "course": "ENGL234", "review": "Absolutely the worst class I've ever taken in my life. It is so unorganized and the material taught is normally random or far-fetched. Washington acts surprised by her own powerpoints and just rants for 45 minutes about god knows what. It is impossible to tell what is important and what's not. Please don't listen to the positive reviews on here as these were probably reviews by her own TA's. The grading is terrible as well and the quizzes are composed of multiple choice questions with about 10 different choices making them extremely hard. The reading is often boring and uninteresting. And if Morillo is your TA don't expect to know your grade on an assignment til about a month after its collected. And certainly do not expect to get a good grade.", "rating": 1, "expected_grade": "C", "created": "2011-04-27T12:23:00Z"}, {"professor": "Mary Washington", "course": "ENGL234", "review": "I have to say I really enjoyed Professor Washington's class. It was very intersting and she was very knowledgable and passionate about her class and managed to make me so too. The books we had to read were short and interesting and for the most part are the only 'homework' you get apart from the 3 papers mentioned below. She is funny and makes the class interact with her along the lectures and is always open to new ideas. She is very nice and sometimes is even lenient on postponing quizzes. There are MANY quizzes in lecture and discussion which require the stories to be read. I would recommend this class to anyone. It isn't loaded with work and you learn a lot of interesting things. I personally am very happy I took the class.\r\nThere are 3 papers and a final apart from the quizzes. The last 2 papers are a little difficult but you get plenty of time and plenty of help! To succeed in this class just go to lecture and listen. Hope this helps! ", "rating": 4, "expected_grade": "", "created": "2010-12-05T01:51:00Z"}, {"professor": "Mary Washington", "course": "ENGL234", "review": "I don't know what experience the other reviewer had on here - Professor Washington is one of the all time best teachers I've ever encountered, and most of the people in my ENGL234 class agree. She really knows her stuff, and she's clearly passionate about what she's teaching. Lectures are interesting, and often times don't just focus on the readings; the class isn't just about literature, but culture and history as well. \n\r\nI found the course to be extremely enlightening and interesting. The class includes three papers (the first is pretty easy, not really an essay), a fair amount of quizzes, and one final exam. Show up to lecture and read the stories (most of which are short and interesting) and you should get around a B range. Going into talk to TAs helps a huge amount with the papers.\n", "rating": 5, "expected_grade": "A", "created": "2010-11-15T02:02:00Z"}, {"professor": "Mary Washington", "course": "ENGL234", "review": "Do not take this class for core or for personal enjoyment. Take it with the other professor. Worst class I have ever taken. Also, if your TA is Bridgette Todd for this course run!", "rating": 1, "expected_grade": "B", "created": "2010-05-27T12:02:00Z"}, {"professor": "Fredrick Cherry Jr", "course": "ENGL234", "review": "great professor take him, would recommend him.", "rating": 5, "expected_grade": "B", "created": "2022-12-02T18:02:51.786895Z"}, {"professor": "Tyra Griffin", "course": "ENGL234", "review": "Tyra is an AMAZING professor and even more just a great person! I took her course as a gen-ed and loved it. She tells us that she teaches her students in a way that she would've liked to be taught as an undergrad. Almost all of the ENGL234/AASP298L classes were discussions based upon a reading that was for homework. With our readings there was also a digital journal that she had us keep where we took one/two quotes from the reading and deeply analyzed it (in 0.5-1 page) offering what we INDIVIDUALLY thought of it - it wasn't a review or a thesis-based thing; we had a lot of freedom as students in our writing. This was similar in our final paper/essay - we had freedom to write about any reading/text of our choice and deeply analyze it similar to the digital journal. I think this freedom that she gives us throughout the class allows us to explore some really deep and dense concepts. I was able to truly indulge with the text and grappled with some very amazing topics - I learned so much about African American history, literature, and culture in her course. I'm sure students will be able to take away a lot from any course that they take with her. She also completely understands that we procrastinate sometimes and life occasionally gets in the way...she's open to give extensions or offer academic support when students need it. There is a decent amount of reading in this course that I took with her (on average 40 pages twice a week so 80 pages) but that is expected with any english based course. Please take a class with Tyra if you can!! She is the best!", "rating": 5, "expected_grade": "A+", "created": "2023-05-04T15:38:43.460476Z"}, {"professor": "Tyra Griffin", "course": "ENGL234", "review": "I really liked how much freedom there was with writing assignments, but the class wasn't very well organized. I think this was just because it was one of her first classes, but grading took actually so long that I didn't have 3/6 of my grades in by the time finals were over. A lot of the time it was kind of unclear what she actually wanted from assignments, but she was very responsive to emails and stuff so its not hard to get clarification. She's also very engaging with her students and clearly cares about the subject a lot. Would definitely recommend, she's only going to get better as a professor.", "rating": 3, "expected_grade": "A+", "created": "2023-05-22T00:18:43.631225Z"}], "department": "ENGL", "course_number": "234", "name": "ENGL234", "title": "African-American Literature and Culture", "credits": 3, "description": "<b>Cross-listed with:</b> AASP298L.\n<b>Credit only granted for:</b> ENGL234 or AASP298L.\nAn exploration of the stories black authors tell about themselves, their communities, and the nation as informed by time and place, gender, sexuality, and class. African American perspective themes such as art, childhood, sexuality, marriage, alienation and mortality, as well as representations of slavery, Reconstruction, racial violence and the Nadir, legalized racism and segregation, black patriotism and black ex-patriots, the optimism of integration, and the prospects of a post-racial America.\n<i>Cross-listed with AASP298L. Credit granted for AASP298L or ENGL234.</i>", "is_recent": true, "geneds": null}