{"average_gpa": 3.7998963730569955, "professors": ["Yun Choi", "Cristina Risco", "Liang-Chun Wang", "Michael Egnoto", "Jennifer German", "Amy Voltz", "Ian Page", "Vivek Advani", "Derrick Yeo", "Sarah Racz", "Ashley Nazario Toole", "Patrick Killion", "Emina Herovic", "Nevine El-leithy", "Mohammad Fazelpour", "Kendall Bustad", "Kyungjin Yoo", "Amy Stonelake", "Carolina Marques Dos Santos Vieira", "Catherine Spirito", "Muge Karagoz", "Raymond H Tu", "Carolina Vieira", "Alexandra Jones", "Frances Clark", "Jonathan Goodson", "Thanicha Ruangmas", "Jessica O'Hara", "Benjamin Huffman", "Cherisse Hall", "Molly Goodfellow", "Azieb Kidanu", "Laura Drew", "Sharon Colvin", "Alexandra Jones", "Benjamin Huffman", "Carolina Vieira", "Catherine Spirito", "Cherisse Hall", "Cristina Risco", "Danielle Niu", "Halli Weiner", "Ian Page", "Jessica O'Hara", "Jonathan Goodson", "Laura Drew", "Marissa Hartwig", "Muge Karagoz", "Quira Zeidan", "Raymond H Tu", "Shabnam Jabeen", "Sharon Colvin", "Thanicha Ruangmas", "Yun Choi", "Benjamin Huffman", "Catherine Spirito", "Cherisse Hall", "Danielle Niu", "Halli Weiner", "Jaclyn Bruner", "Jessica O'Hara", "Marissa Hartwig", "Patrick McGurrin", "Quira Zeidan", "Randall Kania", "Robert Young", "Sara Strey", "Shabnam Jabeen", "Lena Johnson", "Benjamin Huffman", "Catherine Spirito", "Cherisse Hall", "Danielle Niu", "Elizabeth Massey", "Halli Weiner", "Jaclyn Bruner", "Jessica O'Hara", "Kristina Kramarczuk", "Lena Johnson", "Mary Chey", "Quira Zeidan"], "reviews": [{"professor": "Mohammad Fazelpour", "course": "FIRE120", "review": "Lectured straight from the slides, and not in a good way. Didn't provide help for the massive independent project. On the bright side, didn't grade harshly. If you follow the instructions you'll get an A, but don't expect to learn how to do research. I stuck it out because I wanted to join the researcher led FIRE teams. While the course is pretty much a joke for the most part, I would still say the difficulty is a 2/5, since the draft research paper did take a lot of time. ", "rating": 2, "expected_grade": "A+", "created": "2019-01-29T14:36:45Z"}, {"professor": "Yun Choi", "course": "FIRE120", "review": "Very condescending and negative. Your work will never be good enough and he will continue to drill the same points which have been corrected already. However, FIRE120 is a very easy class so it's still easy to get an A.  ", "rating": 2, "expected_grade": "A-", "created": "2019-12-15T22:49:05Z"}, {"professor": "Derrick Yeo", "course": "FIRE120", "review": "He is literally the funniest, most chill dude out there. He's always there to help you out and is very understanding, and he's very practical about the course material as well. ", "rating": 5, "expected_grade": "A+", "created": "2020-07-31T20:44:13Z"}, {"professor": "Mohammad Fazelpour", "course": "FIRE120", "review": "This class was an easy A+, but this professor is horrible. All attendance is mandatory, but you literally do nothing in the class! Had a good group, and you literally work on one project for the whole semester.", "rating": 1, "expected_grade": "A+", "created": "2020-11-24T14:10:35Z"}, {"professor": "Benjamin Huffman", "course": "FIRE120", "review": "Huffman is very nice. I know he's new to teaching at Maryland. FIRE120 is an easy course. So the class wasn't difficult at all. The classes were very much interactive and work with students a lot (especially since this semester was over zoom). He does try to make sure everyone talks in class and we get to work with as many different people as we can. The due dates of bigger projects were reasonable (1-2 weeks) and the smaller assignments were very easy. Overall, nice professor and I'm expected to take his stream (GDD) next semester.", "rating": 5, "expected_grade": "A+", "created": "2020-12-08T02:53:04Z"}, {"professor": "Catherine Spirito", "course": "FIRE120", "review": "Really nice and a good instructor! ", "rating": 5, "expected_grade": "A+", "created": "2020-12-11T23:51:52Z"}, {"professor": "Jonathan Goodson", "course": "FIRE120", "review": "Awesome guy. Super accommodating and understanding during fall 2020. Easy to talk to, fast response time, and overall made the class easier to understand. Gave solid feedback too.", "rating": 5, "expected_grade": "A+", "created": "2020-12-21T11:04:14Z"}, {"professor": "Cherisse Hall", "course": "FIRE120", "review": "Professor Hall is a pretty good teacher and is open to further explaining topics outside of class if you are confused. She seems a bit rude at first but overall she is a nice professor to have. The workload is light and you have plenty of time to complete projects and other assignments.", "rating": 5, "expected_grade": "A+", "created": "2021-01-24T20:03:37Z"}, {"professor": "Nitin Sanket", "course": "FIRE120", "review": "Super easy grader and very nice. Class is only once a week and one to two assignments per week. You should expect an A.", "rating": 5, "expected_grade": "A+", "created": "2021-12-08T07:52:11Z"}, {"professor": "Muge Karagoz", "course": "FIRE120", "review": "Nice teacher! Help you out if you need it.", "rating": 5, "expected_grade": "A+", "created": "2021-12-13T20:51:24Z"}, {"professor": "Laura Drew", "course": "FIRE120", "review": "FIRE120 is a super easy class in general and Dr. Drew upheld that. she was pretty prompt with grading all the assignments, a lot of them are menial but it's an easy A so i don't mind. straightforward in class, straightforward in meetings, straightforward in grading and gave straightforward feedback when things needed corrections. if you're taking the social science cluster for fire120 then i'd def recommend her!", "rating": 4, "expected_grade": "A+", "created": "2022-12-01T18:15:46.871295Z"}, {"professor": "Thanicha Ruangmas", "course": "FIRE120", "review": "I can't speak for 2nd and 3rd semesters yet, but FIRE 1st semester is super easy. I can't say I learned too much in this class, though maybe I would have if I didn't have research experience already. It's a 3 credit class that feels like a 1 credit class. Overall it was a positive experience and I'm excited for FIRE moving forward. She insists that you call her by her first name (because Ruangmas is hard to pronounce I think), which is a bit weird but whatever. She also struggles to communicate sometimes, but it's always brief. You'll get a randomly assigned long term group, and while I got lucky, I know that's not guaranteed. That and the communication thing are really the only reasons she's not getting 5 stars from me, I'd give 4.5 if I could.", "rating": 4, "expected_grade": "A+", "created": "2022-12-04T18:26:37.358766Z"}, {"professor": "Cherisse Hall", "course": "FIRE120", "review": "Do not recommend taking her for FIRE120. Harsh grader", "rating": 1, "expected_grade": "A-", "created": "2022-12-05T23:05:51.356370Z"}, {"professor": "Benjamin Huffman", "course": "FIRE120", "review": "An absolute golden retriever of a man. I loved him and loved this class. Huffman is so caring and always made class fun, even if the content wasn't really fun. Take him!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-12T21:35:35.017833Z"}, {"professor": "Laura Drew", "course": "FIRE120", "review": "I thought this class was very easy. It is very difficult to do bad in this class unless you do not do the work. There is also very little work outside of class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T03:01:22.983834Z"}, {"professor": "Thanicha Ruangmas", "course": "FIRE120", "review": "Great professor who will always answer questions if you ask.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T18:09:05.492577Z"}, {"professor": "Halli Weiner", "course": "FIRE120", "review": "Although I didn't enjoy the FIRE course, Professor Weiner helped me through the class and certainly contributed to my success. She wants her students to succeed and openly welcomes any connection or communication she can have with students. She also makes it known that she is a resource for things outside of class (ie. mental health) if students ever need anything. She gives detailed and specific feedback on work and is accommodating for many students.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T21:19:19.641158Z"}, {"professor": "Marissa Hartwig", "course": "FIRE120", "review": "Class is an incredibly easy A, but I don't feel like I got much out of it. I would only recommend taking FIRE if you have a stream you know you are interested in. As far as Dr. Hartwig, she is very nice and quick to respond to emails.", "rating": 4, "expected_grade": "", "created": "2022-12-15T01:07:39.219035Z"}, {"professor": "Marissa Hartwig", "course": "FIRE120", "review": "Pros:\r\n-Easy A.\r\n-basically no work.\r\n-It's 3 credits and satisfies a gened.\r\nCons:\r\n-You will learn absolutely nothing.\r\n-Some of the topics covered were a bit simplified and a little too political.\r\n-Pointless class.", "rating": 3, "expected_grade": "A+", "created": "2022-12-19T02:18:36.568957Z"}, {"professor": "Thanicha Ruangmas", "course": "FIRE120", "review": "Fair grading, easier than ENES140. Would def take if you can", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T21:36:59.713536Z"}, {"professor": "Shabnam Jabeen", "course": "FIRE120", "review": "Great professor, super kind", "rating": 5, "expected_grade": "A+", "created": "2022-12-20T04:44:16.781233Z"}, {"professor": "Cherisse Hall", "course": "FIRE120", "review": "Professor Hall provides really good feedback  on our team work that helps to improve our final work due later in the semester.", "rating": 5, "expected_grade": "A+", "created": "2023-01-03T19:04:08.602677Z"}, {"professor": "Thanicha Ruangmas", "course": "FIRE120", "review": "Super nice professor. Fair grader and outlined everything super clearly.", "rating": 5, "expected_grade": "A+", "created": "2023-01-11T00:41:44.961981Z"}, {"professor": "Thanicha Ruangmas", "course": "FIRE120", "review": "Very chill and easy class. Honestly spent like 15 minutes each week on hw for it, it was a breeze.", "rating": 5, "expected_grade": "A+", "created": "2023-01-21T04:55:15.372706Z"}, {"professor": "Marissa Hartwig", "course": "FIRE120", "review": "Definitely one of the worst professors to take for this. You don’t learn much. While she’s nice at a surface level, if anything goes wrong in your personal life (even being sick for a week) she thinks you not coming to class signals a lack of dedication.", "rating": 1, "expected_grade": "A+", "created": "2023-05-15T19:37:42.647870Z"}, {"professor": "Danielle Niu", "course": "FIRE120", "review": "Dr. Niu is such a kind, genuine person! FIRE 120 itself can be dull at times; reading scholarly papers on topics that you aren't passionate enough about to read a scholarly paper on can suck, but the assignments are pretty easy and don't take an enormous amount of time if you stay focused. That being said, I'm moving forward into FIRE 198 with project Greenhouse, which will hopefully be more engaging than 120, and I'm very happy that Dr. Niu is the one in charge of the project.", "rating": 5, "expected_grade": "A+", "created": "2023-11-29T21:33:51.859916Z"}, {"professor": "Sara Strey", "course": "FIRE120", "review": "she's nice, but honestly a little too nice at times. the grading in fire120 is set up in a way that you can get greatly penalized for having incompetent teammates (the \"team assignments\", which comprise a good chunk of your grade, are designed so that each person does a part and then you all submit together and all receive the same grade when almost every part of the assignments are meant to be done independently), and dr. strey is a bit of an enabler when it comes to bad teammates. she's refused to intervene when teammates don't pull their weight, stating that \"receiving an email can be jarring\" or that \"some students don't come into college ready to fly\". the teams in fire120 are randomly assigned, so if you get placed in a bad team, good luck. if not, then the class will be a breeze.", "rating": 4, "expected_grade": "A+", "created": "2023-12-12T00:06:07.464350Z"}, {"professor": "Lena Johnson", "course": "FIRE120", "review": "she’s a good professor (very fair grader, always willing to work with you), but the class overall felt so useless. the group project part of the better half of the semester felt super unnecessary and was generally not a fun experience. all of the parts of the group project definitely could’ve just been individual assignments. in general, your grade is based on the assignments (no tests or quizzes). if you have the option to take her for fire120, i'd do it.", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T02:31:20.478970Z"}, {"professor": "Jessica O'Hara", "course": "FIRE120", "review": "FIRE120 is a very easy 3 credit class. Overall, when you go to the class, it will probably be like an in-class activity that you have to complete with your group. In the beginning of the semester, you can choose where you sit, but eventually you will be assigned a permanent group that you'll complete the final group project with. The activities are really easy to complete too. However the majority of your grade is from the homework assignments and group projects. For the homework assignments, they were usually to read an article and write a few notes on it or something you learned, and took around 30 minutes to complete so it wasn't bad at all. The group projects took a little more time, but still less than an hour or an hour and a half. For the group projects, Prof. O'Hara graded a little more strictly than the homework assignments, but still was a fair grade overall. Plus, for one of the assignments she re-grades the group project, so it shouldn't be anything too harmful to your grade. The group assignment was basically being assigned a research question and then finding scientific articles related to the topic, and then analyzing a graph and summarizing the different components of the articles. At the end of the semester, the group will present for 4 minutes on the findings, but it wasn't anything too stressful or time-consuming. There was also no final or midterm. I think the benefits of the class is that you'll learn how to read a scientific article and learn how to summarize/present information, and Prof. O'Hara is a very approachable and kind person if you have any questions at all.", "rating": 5, "expected_grade": "A+", "created": "2023-12-29T23:32:33.258646Z"}, {"professor": "Jessica O'Hara", "course": "FIRE120", "review": "FIRE120 is a very easy 3 credit class. Overall, when you go to the class, it will probably be like an in-class activity that you have to complete with your group. In the beginning of the semester, you can choose where you sit, but eventually you will be assigned a permanent group that you'll complete the final group project with. The activities are really easy to complete too. However the majority of your grade is from the homework assignments and group projects. For the homework assignments, they were usually to read an article and write a few notes on it or something you learned, and took around 30 minutes to complete so it wasn't bad at all. The group projects took a little more time, but still less than an hour or an hour and a half. For the group projects, Prof. O'Hara graded a little more strictly than the homework assignments, but still was a fair grade overall. Plus, for one of the assignments she re-grades the group project, so it shouldn't be anything too harmful to your grade. The group assignment was basically being assigned a research question and then finding scientific articles related to the topic, and then analyzing a graph and summarizing the different components of the articles. At the end of the semester, the group will present for 4 minutes on the findings, but it wasn't anything too stressful or time-consuming. There was also no final or midterm. I think the benefits of the class is that you'll learn how to read a scientific article and learn how to summarize/present information, and Prof. O'Hara is a very approachable and kind person if you have any questions at all.", "rating": 5, "expected_grade": "A+", "created": "2024-01-09T18:52:48.620206Z"}, {"professor": "Cherisse Hall", "course": "FIRE120", "review": "This course should be an easy A+ just by submitting weekly assignments on time and going to class. Very few assignments are actually graded on the quality of your work, but make sure you take the time to read over your assignments before submitting regardless. A lot depends on the group you are placed into towards the middle of the semester, but just check other people's work if you are worried about them lowering your grade.", "rating": 5, "expected_grade": "A+", "created": "2024-01-13T19:56:09.511579Z"}], "department": "FIRE", "course_number": "120", "name": "FIRE120", "title": "FIRE SEMESTER 1", "credits": 3, "description": "<b>Additional information:</b> This is the first course in the FIRE (First-Year Innovation & Research Experience) program sequence.\nEngages the research process through the design, research, collaborative authorship and iterative review-based refinement of research proposals.  Students find and analyze primary literature, think creatively, author and communicate research proposals in a scholarly fashion and work collaboratively to solve scientific and societal problems using technology, delegation and productive team communication.", "is_recent": true, "geneds": null}