{"average_gpa": 3.00385450597177, "professors": ["Robyn Zeiger", "Patricia Fanflik", "Leigh Leslie", "Elise Resnick", "Mia A Smith-Bynum", "Stephanie Grutzmacher", "Samuel Allen", "Amy Morgan", "Jodi Cobb", "Laura Golojuch", "Laura Golojuch", "Tanner Kilpatrick", "Amy Morgan", "Laura Golojuch", "Tanner Kilpatrick", "Laura Golojuch", "Tanner Kilpatrick", "Amy Morgan", "Amy Morgan", "Tanner Kilpatrick", "Colton Kilpatrick", "Laura Golojuch", "Colton Kilpatrick", "Zeina Alkhalaf", "Colton Kilpatrick"], "reviews": [{"professor": "Robyn Zeiger", "course": "FMSC330", "review": "Dr. Zeiger must have changed the structure of her course since the previous review, because you do need the book. On her exams (which are all multiple choice), she has sections for her class material, sections from the textbook, and sections from the accompanying \"reader.\" It's a pain because she does not lecture based off of the textbook so you are basically studying double (well more like quadruple... there is a LOT of reading assigned). She does give like 20 questions that are on the exam prior to the exam date but she will not give you the answers. To be completely honest, I guessed on most of the other 80 questions on the exam and landed a B. Others were not so lucky, as everyone I talked to had gotten D's on the midterm. \n\r\nThankfully, there are two papers which she doesn't grade too harshly on. But her grades are only based off of those four assignments. So it is very tough to get an A. \n\r\nAlso, I took this class during the election time so every day Zeiger would talk about voting for question 6, which was pretty annoying. Oh and she will tell everyone to put away their phones every class. ", "rating": 2, "expected_grade": "", "created": "2012-12-06T17:03:00Z"}, {"professor": "Robyn Zeiger", "course": "FMSC330", "review": "Good professor, teaches alot of concepts, easy to understand, what isn't covered in lecture usually isn't given on the exam, and she gives you questions that will be on the exam!", "rating": 4, "expected_grade": "B", "created": "2008-08-11T16:40:00Z"}, {"professor": "Leigh Leslie", "course": "FMSC330", "review": "Dr. Leslie is fantastic.  She's very organized and approachable, and all of her lectures are interesting.  The material in the class is very practical and often covers things you encounter in everyday life, so it's not hard to participate in discussion.  There are two papers and 3 exams, plus readings for each class, but it's all very manageable.\n\r\nBest professor I've had at Maryland.  ", "rating": 5, "expected_grade": "", "created": "2011-04-11T12:40:00Z"}, {"professor": "Leigh Leslie", "course": "FMSC330", "review": "The tests might trip you up a little but they are fair. Moderate amount of reading.\n\r\nDr. Leslie is a fantastic professor. She is incredibly knowledgeable and friendly. She is each to talk to. I will actually take the things I've learned and apply them to my life. I highly recommend her.", "rating": 5, "expected_grade": "B", "created": "2010-12-18T01:00:00Z"}, {"professor": "Mia A Smith-Bynum", "course": "FMSC330", "review": "Very nice professor and an easy going class. Tests are mostly from power point slides and a little from the book. Other assignments include three short papers. Participation is based on \"clickers\" you use in class which makes getting participation points easy. I would recommend this class.  ", "rating": 5, "expected_grade": "A", "created": "2016-05-19T12:42:00Z"}, {"professor": "Samuel Allen", "course": "FMSC330", "review": " I loved this class! It was an elective for me and I'm so happy I took it. The content was really interesting and Professor Allen always made the lectures funny and gave so much content that I genuinely enjoyed learning about. Professor Allen was really inclusive and engaging, and you can tell he cares what he's talking about and loves interacting with us and hearing our opinions.", "rating": 5, "expected_grade": "", "created": "2019-05-23T15:03:51Z"}, {"professor": "Samuel Allen", "course": "FMSC330", "review": "Easily the best professor I've ever had. He really cares for his students and makes learning easy and engaging. Ended the class with a 98%.", "rating": 5, "expected_grade": "A+", "created": "2020-07-15T20:52:47Z"}, {"professor": "Amy Morgan", "course": "FMSC330", "review": "Amazing! Such a great lecturer and kind soul. Would recommend her so so highly. ", "rating": 5, "expected_grade": "A", "created": "2021-09-30T20:45:19Z"}, {"professor": "Amy Morgan", "course": "FMSC330", "review": "Dr. Morgan is an amazing professor! I highly recommend taking this class with her. She is very accommodating and understanding with her students. Her lectures are very interesting and applicable. The work in this class is fairly easy and is very interesting! Dr. Morgan made this a great class for all. She is by far my favorite professor at UMD!", "rating": 5, "expected_grade": "", "created": "2022-01-07T19:00:36Z"}, {"professor": "Amy Morgan", "course": "FMSC330", "review": "Dr.Morgan is my favorite professor at UMD. The transition back from online to in person was rough and she understood that. She is a great professor, knows how to teach while connecting it to real life examples and it's obvious she loves the subject. Nice discussions are had and I highly recommend her. Very kind, and that's hard to find now with professors.", "rating": 5, "expected_grade": "A+", "created": "2022-04-06T19:04:05Z"}, {"professor": "Tanner Kilpatrick", "course": "FMSC330", "review": "Great Professor very nice guy. Show up to class and do the work, and you will do just fine. I took it with him spring of 2023, and there was a group project, 1 online final, twice a week 321 assignment, weekly quizzes, and think that was all. Cannot recommend this class enough. The work is not too challenging, buy the textbook because you will need it sometimes for the quizzes.", "rating": 5, "expected_grade": "A+", "created": "2023-10-31T17:38:23.303934Z"}, {"professor": "Laura Golojuch", "course": "FMSC330", "review": "Dr. Golojuch is so wonderful. She's extremely passionate and knowledgeable. There are 3-2-1 prompts that are due each class that are based on the readings assigned, weekly quizzes & discussions, a group project, and a final exam. She is very responsive to emails and feedback. Grading is done in a timely manner and she gives meaningful feedback as well. The way she presents herself and teaches leads to engagement and easy comprehension of the material. I would love to take her class again!", "rating": 5, "expected_grade": "A", "created": "2023-12-19T17:05:09.857359Z"}], "department": "FMSC", "course_number": "330", "name": "FMSC330", "title": "Family Theories and Patterns", "credits": 3, "description": "<b>Restriction:</b> Junior standing or higher.\n<b>Credit only granted for:</b> FMSC330 or FMST330.\n<b>Formerly:</b> FMST330.\nTheory and research on the family, including a cross-cultural analysis of family patterns.", "is_recent": true, "geneds": null}