{"average_gpa": 3.259346126510306, "professors": ["Christine Schull", "Elise Resnick", "Christine Schull", "Christine Schull", "Christine Schull", "Christine Schull", "Christine Schull", "Christine Schull", "Christine Schull", "Christine Schull", "Christine Schull"], "reviews": [{"professor": "Christine Schull", "course": "FMSC460", "review": "Professor Schull is always late to class. She is really nice, but kind of dull. I liked her class and respect her as a teacher, but if you are looking for a super interesting class I would not pick this one. Her grades were very straight forward and she has a pretty good turn around time.", "rating": 4, "expected_grade": "B", "created": "2010-12-17T16:52:00Z"}, {"professor": "Christine Schull", "course": "FMSC460", "review": "She's an ok teacher. Nothing great and bad about her. There's literally no need to go to class either (except during your bookclub days and you can just be on your computer the whole time). All the quizzes open up at the beginning of the semester, and sometimes its 2-3 attempts and she'll forget to turn off the correct answer prompt, so that was really helpful lol. Even still, you can always just open up the slides on a new tab and the answers are always in her presentation. The only annoying part of this class are the papers (2 of them). They aren't hard and she's a very easy grader, but you just have to do them. You could spend a day or two before and grind it out even though she gives you two months and you'll still get an A on them. If you need a pretty chill gen-end, this is definitely one to take if you don't care about the two papers.", "rating": 4, "expected_grade": "A", "created": "2022-08-23T15:23:36.469291Z"}, {"professor": "Christine Schull", "course": "FMSC460", "review": "I really like Dr. Schull. Her lectures are interesting and engaging. Going to class definitely pays off because otherwise you have to do the work on your own time and it ends up being more work.", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T16:43:46.872266Z"}], "department": "FMSC", "course_number": "460", "name": "FMSC460", "title": "Violence in Families", "credits": 3, "description": "<b>Prerequisite:</b> SOCY100, SOCY105, or PSYC100.\n<b>Credit only granted for:</b> FMSC460 or FMST460.\n<b>Formerly:</b> FMST460.\nTheories of child, spouse, and elder abuse in the family setting. Emphasis on historical, psychological, sociological and legal trends relating to physical, emotional, and sexual abuse. Introduction to methods for prevention and remediation.", "is_recent": true, "geneds": null}