{"average_gpa": 3.4612667478684527, "professors": ["Elise Resnick", "Kimberly Van Putten-Gardner", "Kimberly Van Putten-Garnder", "Matthew Rodriguez", "Tanner Kilpatrick", "Tanner Kilpatrick", "Tanner Kilpatrick", "Tanner Kilpatrick", "Colton Kilpatrick", "Colton Kilpatrick"], "reviews": [{"professor": "Matthew Rodriguez", "course": "FMSC170", "review": "Prof. Matt is an extremely caring and nice person. There were a lot of guest speakers throughout the semester that were actually very interesting. I believe that Matt is somewhat new to teaching, if not entirely new to teaching his own class, and you could see that at times. A lot of classes were just reading off of slides, but I really can't complain too much about it as there was a system of showing what information was important for exams and what was more just extra learning. Matt is a really nice guy, lenient on grading, and is super open to talking to students if they want to talk to him. Overall a reasonably easy GenEd with a light amount of work, I'd just maybe suggest spicing up some of the non-guest lectures to be more engaging. ", "rating": 4, "expected_grade": "A", "created": "2021-12-10T05:19:38Z"}, {"professor": "Matthew Rodriguez", "course": "FMSC170", "review": "Professor Rodriguez is a super nice and approachable guy, he is easy to contact and helpful when you need it. You can definitely get away with missing his lectures, as they are mostly just a reading of Powerpoint slides that he posts on ELMS anyway. He assigns a lot of required readings but I don't think I read a single one, and I did well in his class. Definitely participate and don't be afraid to talk or ask questions, as there were a lot of awkward silences after he would ask a question. Overall, it's a cool and informative GenEd to take that requires little effort. ", "rating": 5, "expected_grade": "A", "created": "2021-12-21T00:44:22Z"}, {"professor": "Tanner Kilpatrick", "course": "FMSC170", "review": "Very chill professor. Doesn't give too much work. And is very lenient and understanding. Would definitely recommend.", "rating": 5, "expected_grade": "A+", "created": "2022-11-01T19:34:30.352175Z"}, {"professor": "Tanner Kilpatrick", "course": "FMSC170", "review": "Amazing teacher! Assignment are not difficult and as long as you complete assignments you will get a high grade. He is very understanding and is willing to answer any questions you have. He also responds to emails pretty quickly. I would definitely recommend taking this class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-08T22:32:20.937756Z"}, {"professor": "Tanner Kilpatrick", "course": "FMSC170", "review": "This guy knows his stuff. Gives plenty of time to complete assignments. I would take this class again if I could.", "rating": 5, "expected_grade": "A+", "created": "2022-12-11T03:45:11.623763Z"}, {"professor": "Tanner Kilpatrick", "course": "FMSC170", "review": "Great professor, As long as you do the work you will get an A.", "rating": 5, "expected_grade": "A+", "created": "2022-12-12T04:16:36.409797Z"}, {"professor": "Tanner Kilpatrick", "course": "FMSC170", "review": "Great guy, just do the work and you will get an A.", "rating": 5, "expected_grade": "A+", "created": "2023-03-01T21:34:51.382877Z"}, {"professor": "Tanner Kilpatrick", "course": "FMSC170", "review": "Dr. Kilpatrick is the sweetest guy out there. He teaches the topics very well and makes them super easy to understand. He is a very fair grader and cares about each student. I highly recommend him and this course!", "rating": 5, "expected_grade": "A", "created": "2023-12-04T17:24:17.613698Z"}, {"professor": "Tanner Kilpatrick", "course": "FMSC170", "review": "Professor Kilpatrick is as good as it gets he teaches and makes is fun and interactive. I would highly recommend him if you are considering this course. He also provides you with everything you need to pass the course.", "rating": 5, "expected_grade": "A", "created": "2023-12-05T04:04:25.219979Z"}, {"professor": "Tanner Kilpatrick", "course": "FMSC170", "review": "This guy is awesome. He is super kind, and very communicative. His class is very manageable and easy to succeed in. Put effort forth (especially in the papers) and you'll be rewarded.", "rating": 5, "expected_grade": "A+", "created": "2024-01-07T20:45:41.911782Z"}, {"professor": "Tanner Kilpatrick", "course": "FMSC170", "review": "The goat. Low workload and as long as you do the work you'll get an A. Does take attendance, but you don't have to pay attention in lecture, as there are no exams. Also a great guy. Highly recommend for an easy gen-ed/I-series.", "rating": 5, "expected_grade": "A+", "created": "2024-03-12T21:28:32.244780Z"}], "department": "FMSC", "course_number": "170", "name": "FMSC170", "title": "Modern Families", "credits": 3, "description": "<b>Credit only granted for:</b> FMSC170 or FMSC298F.\n<b>Formerly:</b> FMSC298F.\nExamination of current trends and controversial issues in family life, including issues of marriage, reproductive technologies, adoption, child custody, remarriage, and marital violence.", "is_recent": true, "geneds": null}