{"average_gpa": 3.494029850746269, "professors": ["Laura Drew", "Elisabeth Maring", "Sahra Ibrahimi", "Laura Drew", "Sahra Ibrahimi", "Sahra Ibrahimi", "Sahra Ibrahimi", "Elisabeth Maring", "Elisabeth Maring", "Sahra Ibrahimi", "Laura Drew", "Zeina Alkhalaf"], "reviews": [{"professor": "Elisabeth Maring", "course": "FMSC110", "review": "I'm taking the asynchronous version of this class during the summer. It bugs me that all she does in the lecture videos are read from her pre-written notes and go through some slides. The course doesn't seem well prepared. There are a lot of assignments that are due every day and the instructions given are not clear enough. Unless you have no other choice, I recommend not to take this class with Dr. Maring, and not to take this class in general in the summer. I don't know how Dr. Maring expects students to read two entire books AND watch all her lecture videos, all while doing at least two assignments per day and interacting with other students for almost 15 days. ", "rating": 1, "expected_grade": "", "created": "2022-06-02T16:15:33Z"}, {"professor": "Elisabeth Maring", "course": "FMSC110", "review": "What an interesting class. The class overall talked about both families and public health, but more public health. I could connect my learning to previous learning and it was so reinforcing. There were quizzes that were open note, lectures that were recorded, and a few assignments/discussions. We had a larger project where we interviewed a classmate and talked about our backgrounds. Great if you get a great partner!! Dr. Maring provides great and supportive feedback. The class will be challenging if you do not watch the videos, especially because the quizzes are based on them. The textbook/book wasn’t necessary in my opinion. Would take again & would take another class with Dr. Maring!", "rating": 5, "expected_grade": "A", "created": "2023-08-19T20:58:45.025527Z"}], "department": "FMSC", "course_number": "110", "name": "FMSC110", "title": "Families and Global Health", "credits": 3, "description": "Students will explore, define, and study global health, social determinants of health, health inequalities, gender inequality, family violence, and maternal and child health using a global perspective.", "is_recent": true, "geneds": null}