{"average_gpa": 3.100776914539401, "professors": ["Tracey Centorbi", "William McDonough", "Aaron Martin", "Kristi Engel", "Ricardo Arevalo", "James Dottin", "Tracey Centorbi", "Nicholas Schmerr", "Ricardo Arevalo", "Tracey Centorbi", "Alan Kaufman", "Nicholas Schmerr", "Sarah Penniston-Dorland", "Tracey Centorbi", "Tracey Centorbi", "Tracey Centorbi", "Sarah Penniston-Dorland", "Tracey Centorbi", "Mengqiang Zhu", "Tracey Centorbi", "Ricardo Arevalo", "Tracey Centorbi"], "reviews": [{"professor": "William McDonough", "course": "GEOL100", "review": "Very nice guy. Exams are very easy and homework/exam questions can be found easily online. Exam questions are often pulled from homework questions. \r\nWarning: for the first exam, he included a few questions that theoretically was not supposed to be on the exam (as per the syllabus) but that he did mention in class.", "rating": 4, "expected_grade": "A+", "created": "2014-12-08T14:45:00Z"}, {"professor": "William McDonough", "course": "GEOL100", "review": "Alright, so all lecture slides are put online. But when people did not come to class, he messed with the students. He would tell the students that came to lecture that extra lectures/chapters would be on the midterms and then not send an email out. He also changed the day of the midterm and did not tell students. He pretty much wanted to \"teach a lesson\" to kids who didnt come to lecture, when he put everything online. You can completely pass the class without going to lectures but the teacher was an a-hole. **ALSO, he removed ALL THE LECTURE SLIDES AND QUIZZES THE DAY BEFORE THE FINAL!!! .....interesting course but the teacher did not understand that were in COLLEGE. ", "rating": 3, "expected_grade": "85", "created": "2011-12-21T13:22:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Centorbi is one of the most incompetent professors I've had at Maryland. She told multiple students when asked if grades on ELMS were correct and weighted when it said that it was unweighted online. Even after she said all of this, now at the end of the semester she has changed everyone's grades to weighted and grades have dropped from 5-10%. I went from an A to a B. The only thing saving my A right now is the 5% extra credit field trip. \n\r\nThe class isn't too hard (she drops the lowest test, in-class activity, and homework/hw quiz grades), and she's changed her tests so they are all concept sketches with no multiple choice. However, she is a boring lecturer with a snarky attitude. I'm only taking this class for my science lab requirement but I have no idea how she has taught this class for so many years and can still be so uninformed and wrong when it comes to ELMS. \n\r\nSeriously disappointed in her lack of professionalism.", "rating": 1, "expected_grade": "A-", "created": "2016-12-08T20:31:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I really like her she teaches straight out of the textbook. You have your online homework and online quiz due each week for the chapter and then at the end of the section there is an in class exercise. SHE HAS RECENTLY CHANGE THE WAY TEST ARE GIVEN, for GEOL 100 they use to be online test and the other teachers still give the online tests but in her class each test is 4 chapters long and she gives you about 2 questions per chapter that relate to a visual that has been reviewed in the class. So for the tests on the day of the exam 2 of the total 8 sketches will be chosen at random and then you must draw the sketches from your memory. But they are all given ahead so you just have to prepare a lot and you will be fine because it's all memorization. Overall I enjoy her as and GEOL 100 and would recommend it    ", "rating": 5, "expected_grade": "", "created": "2016-11-16T13:30:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I had the pleasure of Tracey as a professor for GEOL100 and it was easily the best class I had taken.  Tracey's super nice, cheerful, and breaks all concepts down really well.  Students from all majors should be able to understand the topics, regardless of your background.  The topics were actually really cool and interesting as well.  The lab had a great TA and went pretty hand-in-hand with the chapters to give you that \"next-level\" feel for what you're discussing.  The extra credit field trip was a lot of fun too.  I've kept in contact with Tracey and keep her updated on how my semesters are going.\n\r\nAnd truthfully, I'm fairly shocked regarding some of the reviews on here.  But after reading through some, a lot sound like students who didn't read, didn't study, and wanted an easy A because they thought Geology would be the \"easiest science class.\"  If you keep up with the material, do light studying/reviewing regularly, use her lecture notes as guides along with your own, and actually try to care, you shouldn't have problems.", "rating": 5, "expected_grade": "A", "created": "2015-05-07T21:35:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Listen to the other reviews advising you to take another teacher! Seriously this teacher is the motherfucking devil. I took a 100 level class in rocks and it ended up being the class witht he most exhausting workload. \n\r\nThere are three online tests and one in class cumulative test. Her online tests she gets most of them from previous homework/quizes.and google. \n\r\nHer cumulative final though is ridiculous! She says it's easier because it's in person but it's not. This is not a 100 level class. \n\r\nI feel like I'm leaving this class with a PHD in rocks. ", "rating": 1, "expected_grade": "B", "created": "2014-12-09T23:29:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Centorbi is a wonderful person but an incredibly hard teacher.  I got an A in the class by recording her lectures and then typing down what she said verbatim and using that for the exams.  That is a LOT of work and I still only got by with an A (including the 5% extra credit trip).  A lot of people underestimate this class cuz its supposed to be the easiest lab - which it IS, but that doesn't mean it's easy.  must go to every class for clicker scores, do the geotours to cancel out a bad exam, and take awesome notes or be prepared to fail.  DO THE EXTRA CREDIT TRIP --- not only was it really fun but it seriously helps your grade!  ", "rating": 4, "expected_grade": "B+", "created": "2012-05-15T18:15:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I chose this course (along with GEOL110) to fulfill my lab credit core. Yes, it is not the easiest class, but for a science class, I don't think it could get much easier. The tests are tricky but really not as difficult as people say. Go to her lectures, write down everything she says and you will be fine. She is not some evil teacher, she is very fair. Her tests are online, you have to expect them to be kind of challenging or else this class would be too easy. There is an hour and 15 minutes to do 60 questions on each test, so there is plenty of time to look stuff up as long as you are organized. ", "rating": 4, "expected_grade": "A", "created": "2012-05-13T21:47:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Do not take this class. Seriously, I don't care what anyone tells you. It is not easy. My friends told me it was easy, but its not. Even if you think you can cheat and do the online tests with people, the tests are so convoluted with tricky questions and ridiculous diagrams that you can't possibly do well on them. You have to go to every class for clicker exams which you always fail b/c she expects you to pay attention the entire time and then understand exactly what she just taught you. Its a complete waste of time and brings down your GPA for no reason. She loves to trick you, she's fat, and she's a horrible teacher.  ", "rating": 2, "expected_grade": "B", "created": "2012-05-09T13:29:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I don't know why everyone is saying this class is hard, it's not. The class is clicker points, online homework, and online tests, and a huge extra credit assignment. Put in a little effort, and you'll get an A easily", "rating": 5, "expected_grade": "A", "created": "2011-12-02T18:48:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "This class is pretty difficult, but you'll learn a lot in a really short amount of time. Do the extra credit she gives you. You'll need it.", "rating": 3, "expected_grade": "A", "created": "2011-07-17T16:17:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "She is really not a good teacher at all. She is really mean and just really annoying. The class overall is easy. All the tests are online, including the final. You have to go to class though because she randomly gives in class exercises that are worth 10% of your grade. If you go on a field trip with her you get 5% added to your grade which is huge. Also, if 90% of people do course evaluations you get another 2% extra credit making an 83% an A. Take it, but don't expect to learn anything. ", "rating": 2, "expected_grade": "A", "created": "2010-12-13T02:45:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "This class was a waste of time. I wouldn't have taken it had I not needed a CORE lab science credit. Centorbi can be downright rude and has a bad attitude 75% of the time. Also, she moves way too fast during lecture. Printing lecture slides is a must because she does not give anyone time to write down information off of powerpoints during class. However, I refuse to waste all that paper and ink and therefore struggled with keeping up with her lectures.\n\r\nHer knowledge of geology is greatly apparent and she really does know what she is talking about. All exams are online which sounds awesome but in reality they are tough. I never scored above a C on one even though I did the 13 page review guide for every one. Attending lectures is a must because she randomly gives out in class assignments that are graded. Overall I really did not enjoy this class at all.\n\n", "rating": 1, "expected_grade": "", "created": "2010-12-12T17:39:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I loved this class! Most of the information was really interesting, but some was pretty dry. The class moves pretty fast, so you have to keep up.\r\nYou don't really need to go to lecture since she posts the slides on elms, but if you do, she does give many hints for upcoming exams.  Also, there's plenty of opporunities to get extra credit, like a field trip that can get you up to 10%!\r\nThe tests are online, which is good because you can use your notes, but she uses this testing system that shuts you out of the test if anything else is open.  You have to turn off all automatic updates and virus scans and everything, which was a big pain.\r\nBut overall, i took this class as an elective and it wasn't too bad.  Before all the exams, i printed out all the powerpoints and went through them using the book and did well on all three of the mid terms. the final had so many recycled questions, it wasn't bad.", "rating": 4, "expected_grade": "A", "created": "2010-05-23T21:56:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "*This is reviewing the course for online instruction*\r\ntl;dr This professor is NOT an easy A. 70% of each week was spent doing work for this class. She is the only professor in GEOL that used honorlock  anti-cheat software for exams (video, mic, and screen recording). \r\n\r\nFULL REVIEW:\r\nEach week we were assigned: 30-100 hw problems (100pts), a quiz (40pts), 8-10 lecture videos with participation quizzes through out (you must watch these lecture videos because the these quizzes are scattered throughout and alone are worth 20% of final grade). All in all I spent at least 10+ hours a week for this professor alone. Exam weeks easily make this go to 15+. This is an absurd amount of work for an 100 level course. \r\n\r\nEach exam covered 3 chapters. It might not seem like much but take my word, it's a lot. Of everything that could be on the exam, we were tested on the simplest things like identifying different kinds of rocks.\r\n\r\nI gave two starts because she's a really nice person, but a mean professor. Her expectations of the students were way too high for an 100 level course. ", "rating": 2, "expected_grade": "B", "created": "2020-10-19T15:19:22Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Makes the class really difficult and is not an easy A but gives 5% extra credit ON TOP OF FINAL COURSE GRADE at the end of the semester. ", "rating": 5, "expected_grade": "A", "created": "2020-12-27T21:37:10Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I took GEOL100 completely online in Fall 2020, and the class was entirely asynchronous. It wasn't the worst class and not too difficult in my opinion. She would publish a bunch of lecture videos each Monday that would range from 5 to 20 minutes each and were easy to follow along with, just extremely boring. Embedded in the lecture videos were quiz questions about the content of the lectures, and some weeks these questions were retakeable until you got them right, and sometimes they weren't, there was no pattern to it. You would also be assigned a chapter to read each week from the textbook, and the textbook was interactive so there was a grade for completing the questions for each chapter. Most weeks I didn't even read the chapter and just answered the questions until I got them all right (they were graded for completion). My biggest complaint about this class is that the quizzes we had each week were created through the textbook service, so the questions were based entirely off of the textbook and not the lectures at all. Luckily, the quizzes are open note and you get two tries on them. There was a midterm roughly every three weeks in this class, and the midterms were based off of the lectures. The midterms also felt very \"unpolished,\" there were often repeated questions, etc. Centorbi would also use a browser extension to prevent cheating on the exams that would film you the entire time. I would definitely study for the exams, but they weren't extremely difficult. She also had no TAs for this class, so the only way to contact her outside of emailing was her office hours that were only hosted once a week. Overall, not too difficult of a class, but definitely not an easy A if you don't have at least some interest in the subject.", "rating": 3, "expected_grade": "", "created": "2021-01-13T00:12:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "I took Tracey Centorbi's class in the fall of 2020. It was completely asynchronous. If you are willing to dedicate multiple hours every day studying, you'll pass. I used Quizlet, and it helped me survive the course's exams. Don't make the same mistake I did and spend too much time studying the textbook, I failed an exam this way. She says that she builds her exams mainly on the lecture videos she posts, the textbook material only factors a small amount into the exam. She also uses Honorlock. However, after discussions with the students, she removed all of Honorlock's predatory requirements.\r\n\r\nIn the final month, the class took a turn for the better. Due to the pandemic, the college allowed professors to make finals optional. The professor did, which allowed most of us to save our grades. If you think remembering hundreds of terms for one exam is rough, imagine studying for a cumulative final exam. She also posted an extra credit assignment, which added five points to your total grade.", "rating": 4, "expected_grade": "A+", "created": "2021-01-17T13:58:30Z"}, {"professor": "Nicholas Schmerr", "course": "GEOL100", "review": "He is a passionate professor and loves what he teaches, but sometimes the lecture outline gets confusing. ", "rating": 4, "expected_grade": "", "created": "2022-05-03T23:51:27Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Her lectures were very hard to understand and the in-class activities were very difficult as well, I do not recommend taking her class if you are not interested in geology because you will struggle. She wasn't the worst teacher but not the best, her extra credit opportunity did save me though so I would say she's alright. ", "rating": 3, "expected_grade": "A-", "created": "2022-05-17T17:09:47Z"}, {"professor": "Alan Kaufman", "course": "GEOL100", "review": "He is so boring but knowledgeable. I guess stay in the class, but I haven't learned anything?", "rating": 3, "expected_grade": "", "created": "2023-02-28T21:02:54.166855Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Take a different professor or plan to take the natural lab another semester, do not take this teacher. She has an air about her in which she thinks she's better than everyone. She calls out students for small things. She tries to come off relatable the first few lectures but its just an act. Her TA's were unhelpful and both she and her TA's graded way too harshly. I typically do well in the sciences and I had to struggle through this class to get the grade that I got. Her midterms and final were just completely ridiculous unless you wrote down word for word what came out of her mouth. I literally did extra research outside of the class for an exam and still did worse than I wanted. I've had worse teachers so I won't give her a one but she doesn't deserve more than that. As for the lab, we were not given the right resources to prepare for it, and most people in my section barely got higher than a C. Also, on the midterms, because she uses some randomized testing feature, you can get asked the same question 5-7 times and you will get points taken off for each one so good luck if you don't know the answer. She also refuses to listen to critiques of this testing system and you cannot argue points back if this happens to you. I would give her a one but I've had worse professors, however she doesn't deserve more than a two.", "rating": 2, "expected_grade": "A", "created": "2023-03-01T21:18:39.459871Z"}, {"professor": "Alan Kaufman", "course": "GEOL100", "review": "I haven't learned one thing. He also treats this class as NOT a beginner class. He could talk for hours about geology, but expects you to know too much!", "rating": 1, "expected_grade": "A-", "created": "2023-03-16T20:48:49.181276Z"}, {"professor": "Alan Kaufman", "course": "GEOL100", "review": "Attendance is mandatory, but even if you go the material is way to advanced for a gen-ed 100 level class. Exams were open note and online, and then somehow the final is closed note in person. Doesn't make much sense.  I would've been better off with another professor.", "rating": 1, "expected_grade": "B", "created": "2023-05-09T02:43:01.504456Z"}, {"professor": "Alan Kaufman", "course": "GEOL100", "review": "Overall this class was very standard. There were 3 midterms alongside a final. Your midterm with the lowest score was dropped. The exams felt fair and he gave practice exams beforehand. Lectures could be a little boring at times but I guess this really depends on how much you like geology. \r\n\r\nKaufman himself clearly enjoys the topic and that comes through in his lectures. He sprinkled in some references to his own work and threw in some jokes to break up the monotony a little. He did try to keep things interesting by teaching about forgotten members of the field such as woman and other minorities. \r\n\r\nWhat you think of this class will really depend on how interested you are in geology, but I would recommend Kaufman for someone who is indifferent to it like myself. This class does require some work but its very low stress.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T01:49:29.347216Z"}, {"professor": "Alan Kaufman", "course": "GEOL100", "review": "Boy do I have things to say about this man. But tl;dr, DO NOT TAKE ANY CLASSES WITH THIS INSTRUCTOR UNDER ANY CIRCUMSTANCES. \"It can't be THAT bad\" oh it can be and it was. \r\n\r\nTo be fair, the man is a professional geologist and is very smart in the world of geology and has made a lot of contributions to geology in research. And that's where the good stuff stops. It's clear that he very much enjoys his research, and conversely DESPISES teaching and would rather be out doing research. As such, especially for a class full of kids taking it for the GenEd, this does not bode well for an easy A or a well-structured class. He doesn't even use his own lecture material, and clearly doesn't look at it ahead of time; he would go to a slide and after a moment of trying to fabricate something of pure nonsense, he would audibly say \"Why is this slide here? It's useless.\" and move on to make up more balderdash. This only gets worse because the slides are programmed with clicker questions which are unfair or unclear more often than not, and all the clicker questions represent 20% of your grade. The \"homework\" assignments are horrifically long quizzes that are on McGraw Hill Connect, a worse version of Quizlet. These assignments were weekly and usually took me 2-3 hours each, and the worst part is that you get an automatic 100% as long as you get through the assignment, which means you don't really need to try and it just wastes 2-3 hours of every week. And together all of these are only 10% of the grade. He speaks in such a horribly boring way about geology while making it all up as he goes that it's impossible to stay focused. Class is not skippable because of the clickers. This class is a chaotic inferno of nightmares and I wouldn't wish such a horrible punishment on anyone. Never, ever, take a class with this professor. He's smart, but will make it the most counterintuitive and painful experience of your life. If I could give 0 stars I would.\r\n\r\nIMPORTANT: We went through the semester with 3 online asynchronous exams, which was admittedly nice (although the short answer questions were graded extremely harshly), and he failed to tell us until a MONTH before the final that the final exam would be IN-PERSON, ON PAPER, and CLOSED-NOTE. It was a horrible final exam and there's no way I did well on it.", "rating": 1, "expected_grade": "B+", "created": "2023-05-22T00:46:30.915516Z"}, {"professor": "Alan Kaufman", "course": "GEOL100", "review": "He makes the exams way harder than they should be for a 100 level geology class and switched format of his final mid semester he knows his stuff but if you are looking for an easy A, DO NOT TAKE", "rating": 1, "expected_grade": "C", "created": "2023-05-22T16:57:29.573990Z"}, {"professor": "Alan Kaufman", "course": "GEOL100", "review": "Kaufman is very knowledgeable in geology but that does NOT make you a good teacher. The study guides he tells us to review are general and then the exams are on the most specific niche little details. He is also so boring and talks monotone and nothing about the lecture is enjoyable. He doesn't release the right answers to online exams so you never know what you go wrong. He also gave us all online exams with open note but then all of a sudden the final was in person which did not prepare us at all for it. The other GEOL100 professor gave her students an online final, so it really just felt unfair. This class is also advertised for non STEM majors but if you don't like science don't take this class because he treats it as if everyone should be a geology major. I got a  C in it which is uncharacteristic of me so I think that says a lot. Steer clear of the the geology department! My lab was unenjoyable and poorly structured as well.", "rating": 2, "expected_grade": "C", "created": "2023-05-25T18:19:09.737696Z"}, {"professor": "Sarah Penniston-Dorland", "course": "GEOL100", "review": "class is so beyond boring but she makes it really easy to get a good grade", "rating": 4, "expected_grade": "A", "created": "2023-10-17T04:32:45.965797Z"}, {"professor": "Sarah Penniston-Dorland", "course": "GEOL100", "review": "She’s a sweet woman for sure, lectures are boring but all exams are online (including the final) which is super nice. You have to go to class to get participation points which sucks but other than that it’s insanely easy to get above a B in this class. Compared to other science Gen-Eds I’ve taken, this class is the most appropriately paced and challenging for a Gen-Ed by far. I would recommend.", "rating": 4, "expected_grade": "B+", "created": "2023-12-06T17:36:07.237002Z"}, {"professor": "Sarah Penniston-Dorland", "course": "GEOL100", "review": "Dr. Penninston-Doland is a great professor and you can tell she really loves geology. However, her way of lecturing is extremely boring. She basically reads off of her lecture slides each class but makes it difficult to miss class since she uses Clicker for participation so you kind of have to go to get that credit. Overall, she’s extremely kind but needs to work on her lecturing.", "rating": 4, "expected_grade": "A", "created": "2023-12-08T12:59:02.110530Z"}, {"professor": "Sarah Penniston-Dorland", "course": "GEOL100", "review": "She is such a good teacher! I am taking this for my major so I find it pretty interesting although as a gen ed it can be a little boring. She really knows what she is talking about and makes at least geol100 easy to pass.", "rating": 5, "expected_grade": "A+", "created": "2023-12-10T22:38:36.306950Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "The instructor was very nice and cracked some jokes here and there. Attendance is mandatory and will cost you participation points if you don't show up. Many people didn't show up and just asked others who were in class for the clickers code and did it from home to get participation points but that's against the honor code and if she finds out (and she will find out), she will write you up and give you an XF. So please just show up to class. There are 4 exams (3 mid terms + 1 final). Please do the practice exams and screen record your answers because many of them will be on the exam. P.S all the exams are online. Do the extra credit!!", "rating": 4, "expected_grade": "A", "created": "2023-12-17T04:14:06.279847Z"}, {"professor": "Tracey Centorbi", "course": "GEOL100", "review": "Professor Centorbi is an excellent lecturer. Her slides are really good. Professor Centorbi cares about her job and knows a lot about geology. She is also super funny. I took this class in Fall 2023 as an elective and received an A. The class overall is easy, however I did not take the lab. Each week you are required to complete a quiz about the material (it is graded on participation), as well as a short discussion post. What is nice about the class is that she drops one of the three midterm exams and one quiz. However, the only issue with the class and why I did not give the class five stars is that participation is required there are clicker questions. However, she drops the five lowest participation grades (so theoretically you can miss five classes). It is an all-around easy class and a good professor.", "rating": 4, "expected_grade": "A", "created": "2023-12-20T02:02:17.071632Z"}, {"professor": "Sarah Penniston-Dorland", "course": "GEOL100", "review": "Extremely easy class. The lectures were boring because I had no interest in the topics, I just needed the class to fulfill a gen-ed. Attendance is basically mandatory because she does clicker questions every class. The tests were beyond easy because they were open notes. The homework was a weekly McGraw Hill textbook assignment. She was understanding, nice and knew what she was talking about; she tried to keep the students engaged.", "rating": 5, "expected_grade": "A+", "created": "2023-12-27T21:55:11.829450Z"}], "department": "GEOL", "course_number": "100", "name": "GEOL100", "title": "Physical Geology", "credits": 3, "description": "<b>Credit only granted for:</b> GEOL100 or GEOL120.\n<b>Additional information:</b> CORE Distributive Studies Physical Science Laboratory Course only when taken concurrently with GEOL 110.\nA general survey of the rocks and minerals composing the earth, its surface features and the agents that form them, and the dynamic forces of plate tectonics.", "is_recent": true, "geneds": null}