{"average_gpa": 3.13435822352367, "professors": ["Sujay Kaushal", "Tracey Centorbi", "Saswata Hier-Majumder", "Tracey Centorbi", "Sujay Kaushal", "Tracey Centorbi", "Sujay Kaushal", "Tracey Centorbi"], "reviews": [{"professor": "Sujay Kaushal", "course": "GEOL120", "review": "Really nice guy but very quiet and very boring, which can be good or bad. He puts all of his lecture slides online so you don't have to take notes, nonetheless pay attention. Discussion quizzes are easy and the overall work is easy and not hard to understand.", "rating": 3, "expected_grade": "B+", "created": "2011-02-03T13:37:00Z"}, {"professor": "Sarah Penniston-Dorland", "course": "GEOL120", "review": "NOt that hard, at least it shouldn't be.  BUt the lectures are supremely boring...I found it interesting but it is hard.  You HAVE to study for those tests and take advantage of the extra credit trip. On midterms and final I got in the 70s, but I went to every discussion where there are always graded assignments....", "rating": 3, "expected_grade": "B", "created": "2009-05-05T22:36:00Z"}, {"professor": "Sarah Penniston-Dorland", "course": "GEOL120", "review": "This was a good non-lab science class and proved interesting as well. Professor P-D is a clear, effective teacher and she is very approachable if you need help. \n\r\nAssignments included 3 tests over the course of term that were based entirely on her lectures, you didn't have to bother with the book except for one discussion assignment, and a final exam. She dropped one of the midterm tests. There were busy work assignments weekly for discussion and an environmental resume assignment, too, but it was easy to do well on. \n\r\nYou do have to come to class, she does participation points, but if you show up and care at all, you should do well. She's easy to understand. ", "rating": 4, "expected_grade": "", "created": "2008-12-30T19:25:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "The reviews saying she is an awful teacher have to be coming from people who skip class or don't study for the exams. Centorbi is a great teacher; she thoroughly reviews everything in the book to the point where I stopped reading the chapters and still felt very informed. It's easy to do well on the test if you take notes in class and review them beforehand, but she makes it even easier since the tests are open notes/textbook/internet. She's a very nice person and I recommend sitting in the first few rows as she often interacts with people and may give you hints on the clicker questions. The only complaints I would have is that discussions are work-heavy and the TA is kind of an asshole, but even he grades super loosely. It's easy to get an A in this class if you attend regularly and do the in-class activities assigned. You're also permitted to miss four days before she starts docking off participation points since the lowest four clicker grades are dropped.\n\r\nBottom line: Not a hard class if you pay attention, teacher is great, interesting content aside from rocks.", "rating": 5, "expected_grade": "A", "created": "2015-11-12T18:37:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "So, I have never written one of these reviews but this was probably my worst class in my 4 years at the school so instead of studying for the final, I am writing this. I am taking geol120 as my core requirement and not only is Centorbi HORRIBLE, but this class is more demanding than any of my other upper level classes. The only way to do somewhat ok in this class is to go to every lecture and record every single thing she says. Even then- you probably won't do well on her tests. Her tests are online, but even so I got 60's on the tests. Her power points are useless, as is the book. You haven't seen half the stuff on the tests before. She is rude, condescending, and takes her 100 level class WAY to seriously. Without the extra credit field trip and discussion board to replace your lowest test grade, the class is almost impossible. The discussions also have quizzes so you cannot miss any of them, and the TA's are just as unhelpful as her. The final is also (in-person) 100 questions cumulative on the entire class- and you are allowed 1 notecard. This cheat sheet would make sense for a math class, not for a class testing you on the entire text book. This is by far the worst class I have taken at this university and I wish someone would have warned me when I signed up. ", "rating": 1, "expected_grade": "B", "created": "2013-12-19T23:03:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "The class isn't hard but graded harshly and there's a lot of work involved. She's a cool person, but takes the work and class way too seriously. The TAs made up for it (they were really cool, laid back, an funny).\r\nThe information is straight-forward and she does a good job explaining concepts, but the work load is ridiculous and discussions are pointless.\r\nThe textbook is cheap (ten dollars) because she uses not the latest edition.\r\nThe tests are made with trick questions rather than comprehensive or factual questions. If you try to tell her your answer was directly written from the textbook used for the class, she'll discredit it.\r\nThe clickers are good idea but poorly executed. She grades them and half of the time they are questions out of no where. \r\nThe extra credit was an interesting trip and worth it to go(5% extra) but there's a worksheet to fill out which takes up the entire trip so you can't enjoy actually being there.\r\nDiscussion involves reading news semi-relevant articles and memorizing random facts for a 3 point quiz. Then we do worksheets that are relevant. \r\nOverall, the class was not worth taking. ", "rating": 2, "expected_grade": "A", "created": "2013-11-09T21:26:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "This teacher is the worst, the class is the worst, but it's an easy A. \r\nIf you want to actually learn things about geology, look elsewhere. If you want an easy CORE class with a self-important ***** for a teacher, look no further. \r\nTeacher is the typical example of a person who takes herself too seriously, she is the worst. She's an unhappy person and, naturally, she enjoys the \"power\" of being a professor. \r\nIn conclusion, she is the devil.  ", "rating": 1, "expected_grade": "A", "created": "2012-10-21T17:59:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "NOT AN EASY CORE CLASS AT ALL. Her tests are online, but impossible to take. You'll have to read between the lines to understand the stuff she talks about, very vague. You also have to go to every lecture because she uses stupid 'clickers' to give participation grades and if you get a question wrong in the participation you get 50% for that question. Also she has a \"no excuses\" policy so if you're sick or dying and do an assignment you get a zero. Which is complete BULLSH@T. If I'm sick in the hospital hooked up to IVs and feel like shit, you're telling me I can't have an extension on the assignment?? BULLSH!T", "rating": 3, "expected_grade": "B+", "created": "2011-12-11T12:33:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "This class is so hard. I always went to lecture, wrote down what she said, and took notes on the book chapters. The tests are online, which sounds great, but they're ridiculously hard. She only gives you an hour and fifteen minutes to complete them but it could easily take me 2 hours to find all the answers. DON'T TAKE THIS CLASS. I'd much rather take an in class test that is easier than taking this course online.", "rating": 1, "expected_grade": "B", "created": "2011-04-29T18:26:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "This was a really tough class.  Although I got an A, it was with a lot of difficulty and hard work.  You will have to go above and beyond for this class, but its relatively little assignments that you just have to keep up with, not really huge papers or assignments besides the three exams, which are online.  Do the discussion board, do the extra credit.  Also, i suggest taking notes on your laptop or else you will miss typing down half of the information she puts on the test.  \r\nBasically, type down everything she says, and everything that is on the powerpoints and videos.  It will come back on the exams", "rating": 3, "expected_grade": "A", "created": "2011-01-13T19:04:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "I don't know half the people who wrote the reviews below, but they must be geology majors. This class was awful, easily the worst class ever. When you first get to the class and she tells you the tests are online, you get excited, but they are not based off the textbook at all. My first test I got a 75 with just studying off the book. The next 2 I just studied off of what she said in lecture and the slides and did better. I would recommend doing the discussion board because it is easy and to do the extra credit which is now only worth 5%. Also she is just a miserable *****. I have had teachers get mad at students for leaving class early, and even calling them out, but she would go on for a few minutes about why you shouldn't leave early. ", "rating": 2, "expected_grade": "A", "created": "2010-12-13T23:08:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "Class isn't hard if you do the work (not much), online exams mean you can use your notes and textbook, lecture is boring and but informative. She takes lectures straight out of the textbook and adds her own stuff. Many test questions come word-for-word from sentences in the book. You HAVE to go to discussion if you want to pass because almost half your grades come from there, but it is super easy if you do the (one-page) readings for the quizzes and if you work fast you can get out half an hour early most days. Also you get a day off from lecture whenever there is an online test, which is pretty nice.\n\r\nProf. Centorbi does a pretty good job. She seems nice enough in person, but she randomly becomes rather bitter and pessimistic in her lectures. She has a \"NO EXCEPTIONS FOR ANYTHING EVER\" policy which gets pretty ridiculous. She's also one of those profs who calls out students for texting and talking in class. But the class is easy so it's hard to fault her too much.\n\r\nBoring class, kooky prof, pretty standard for UMD.", "rating": 3, "expected_grade": "A", "created": "2010-12-10T15:24:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "This class was honestly annoying and I did not benefit from taking it. Even though the exams are posted online, they are hard and the questions she asks are sometimes not even in the notes or lecture. What was even more ridiculous was that there were no exceptions on making up an exam and she even posted on our syllabus…\r\n\"There are NO makeup exams for any reason!! Not if you are sick, not if there's a death in the family, not if your boyfriend/girlfriend ends up in the hospital, not if you have a car accident, not if you forget because you fell asleep after turning in your paper for another class. Complete it by midnight on Friday or take the zero.\"\n\r\nhonestly… thats just downright mean. Also if you miss discussion you get an automatic zero on an activity which is worth 35-45 points and you get a 0 on a 3-5 point quiz. \n\r\nI was bored to death in her lectures and had to struggle to keep myself awake most of the time. If you want to take GEOL120 i would suggest taking it with another professor. ", "rating": 2, "expected_grade": "B", "created": "2010-12-10T02:32:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "GEOL120 Powerpoint style with all the slides online. The tests are online but you can't do well on them on just the slides alone, you have to attend lecture. In lecture there are in class activities that count towards your grade. You have reading due for every discussion and a short 3 question quiz about the reading. Then there are activities in discussion. Some of the activities are very time consuming and sometimes aren't really related to class. There are 2 opportunities for extra credit: one field trip, and participation on the discussion board which will replace your lowest test grade. If you attend lecture and take good notes and do the extra credit you should get an A, I didn't do these things.  As a teacher though she is nice but the material is very boring. ", "rating": 3, "expected_grade": "C", "created": "2010-11-30T14:51:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "If you decide to take this course, make sure you go to lecture, since she says A LOT of stuff that isn't in the book. The exams for this course were weird. I felt a lot of the questions were neither in the book, nor were they mentioned in lectures, so I found my self guessing answers. \n\r\nDiscussion sections are really important too, even though most of what you do in discussion really don't help you much on any of the exams. The exercises will help your grade a lot.\n\r\nAs for the professor herself, I thought she was cool/ok at the beginning of the semester, but as the semester went on, she was just unnecessarily a jerk to people.\n\r\nThe best thing about this course is the extra credit field trip. It's worth 10% of your grade, and it's a fairly easy exercise which isn't graded harshly, so it's easy to get a 100% on. Whatever you do, MAKE SURE YOU GO ON THE TRIP! It really paid off.", "rating": 3, "expected_grade": "A", "created": "2010-05-19T14:00:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "The first thing you should know about this class is that it is top 5 most boring classes available at Maryland.  She posts her slides online, but she always says stuff that isn't on the slides that goes on the exams.  You don't really need to go to lecture (like 1/2 our class), but if your too honest to skip lecture, bring something to entertain yourself with.\n\r\nHer exams were all online, but they were all very difficult.  One good thing about this course is that there is a lot of extra credit chances to make up points.  If you post on the weekly discussion board, you get graded on your posts and that grade replaces your lowest exam grade.  Also, theres a extra credit field trip that added 10% to your final grade.  So if you had an 80% you would have a 90% and an A.  \n\r\nDiscussion sections are easy points that make up 25% of your grade, but the work can be time consuming.  All in all, this was an annoying class that required a lot of work, but in the end, if you put in the work, you should do ok.", "rating": 3, "expected_grade": "A", "created": "2010-05-11T21:19:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "So much to say!\r\nA- I hated this class. If it was not the easiest of the Cores that it fulfills, no one would take this class. The class does not teach you anything that you wouldnt already know.  Her lectures are full of crap like \"Global Warming is bad for people, the animals, and  the environment.\" Really? I didnt know that? On the other hand, her class is so easy. Study from her PP and you should easily get A's on the tests.\r\nB- I hate this teacher. I had her last year and she is a miserable person and an even worse teacher. I emailed her a picture of my hospital bracelet WHILE I was still in the hospital and she wouldnt believe that I couldnt take the test because I was ill. I had to take her to the Dean and he eventually made her let me retake it. When I retook it I scored like a 90% on the multiple choice but surprisingly scored a 70% on anything that she graded and was subjective. She constantly made up lies about things I supposedly told her, and she was not at all understanding about my condition.\r\nThis teacher is a b*tch, the class is a joke, but its an easy A.\r\nCentorbi- if you're reading this, you got what you deserve!  ", "rating": 1, "expected_grade": "A", "created": "2010-03-21T07:47:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "I feel like GEOL120 is actually one of the classes that I've learned a lot in. Nothing that I would apply to my life really but interesting facts about the planet and natural disasters. The exams are in-depth but if you attend lectures and pay attention, it shouldn't be a problem. Discussions are a pain but easy points to your grade. Grades seem unreasonable at first but it works at towards the end.", "rating": 4, "expected_grade": "A", "created": "2009-06-02T00:51:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "Prof. Centorbi's lectures are great and you must attend them to pass the course. The information is very interesting.  Her exams are in-depth and difficult usually consisting of 40 mc and 2-5 short answers.  They require a lot of study time. You are required to attend the discussion sections which are large portion of your grades. You go over two chapters a week and the chapters are long. I took the course expecting another decently easy freshman course.  I was wrong, so do not make the same mistake. Overall it is a good course and you are forced to learn a lot. 4 stars for a tough but fair professor.  ", "rating": 4, "expected_grade": "", "created": "2009-04-13T15:57:00Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "Centorbi was very straightforward and helpful as much as a professor in college should be. I noticed that most students expect college professors to tend to all their concerns but you have to realize that that's not the case.\r\n\r\nIn GEOL120, Centorbi covered a chapter or two from the book each week (which you really have to read if you want to ace the exams and final), and after four chapters there would be an exam that consists of 2 out of 8 potential concept sketches. It's very easy to study for the exams as they are just diagrams you can prepare and consult with her about prior to the test.\r\n\r\nOverall, the course was a very achievable A but not an easy one. You actually have to work harder than you did in high school to get the grade you deserve (shocker!) With that, she really is nice to those who put in the effort and try to fully understand her subject.", "rating": 5, "expected_grade": "A", "created": "2019-03-17T00:42:29Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "This is a pretty straightforward class but there is a heavy work load. Quizzes every week, HW that takes an hour, random in class assignments. Discussion has quizzes every time you meet. There are 4 exams and a final. If she likes you she'll bump you up to the next grade like from and A- to an A. Try to get on her good side. Don't take this if you are a senior looking for an easy A.", "rating": 4, "expected_grade": "A", "created": "2019-03-27T18:05:42Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "Do not take this class unless it's in your requirements! Tracey is mono-toned and condescending. She introduces herself very well but it's misleading. she can be rude at times and always threatens the class by saying she'll assign us a quiz if we don't participate. The exams are online but they are extremely difficult as half the content we don't go over in class nor is it present in the textbook. Discussions are also every friday and theres always a quiz and graded classwork in the 50 minutes provided. The subject itself is very interesting and fun but the professor did not provide a great class experience. This was not an easy class by any means but you work for what you get! Do not recommend ", "rating": 1, "expected_grade": "B-", "created": "2019-12-06T00:33:01Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "She is pretty monotoned, but she is good at answering all questions during lectures. She is very informational, but her lectures are boring and she does not really care about certain people in the room. ", "rating": 3, "expected_grade": "B", "created": "2019-12-06T14:50:55Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "She is a great teacher if you pay attention. She lectures the entire class, letting out at most 15 minutes early. One hour of homework each week and a quiz to follow. Quizzes are online, you are allowed to use google, and most of the questions she pulled from quizlet so they aren't that hard. She know what she is talking about so be sure to copy the slides in addition to what she says. It is a lot of work but I enjoyed the class despite of this. For a level 100 you can definitely find another class for your NS or lab that wall be much less work. She offers a 5% extra credit at the end, and I highly recommend doing this. This call is a lot more fun if you find friends to study with. I expected an A, and I got one, but not easily this class does require work.  ", "rating": 5, "expected_grade": "A", "created": "2019-12-17T00:14:11Z"}, {"professor": "Sujay Kaushal", "course": "GEOL120", "review": "Great professor. He's a bit quirky, monotone, and gets easily distracted. The course itself is pretty easy so don't worry. He also genuinely cares about his students which is always a plus.", "rating": 4, "expected_grade": "A", "created": "2020-09-01T02:05:33Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "This class when taken with the lab (geol110) is HELL. If I could give it 0 stars or negative stars I would. I don't know if it's because it's all online, but I have more work in these classes than I do in any others combined - AND IT'S NOT EVEN FOR MY MAJOR. I had to take a required lab science and I made the mistake of picking this one. Don't waste your time you will be miserable", "rating": 1, "expected_grade": "", "created": "2020-09-25T02:28:53Z"}, {"professor": "Sujay Kaushal", "course": "GEOL120", "review": "Great prof and seems like a really nice guy who cares about his students. Not sure how his classes are in person compared to online but this was the easiest class I've ever taken. He drops the lowest exam, and the exams are really easy to begin with. Im pretty sure the class average is like a 96%", "rating": 5, "expected_grade": "A+", "created": "2021-04-29T18:28:50Z"}, {"professor": "Sujay Kaushal", "course": "GEOL120", "review": "Professor Kashul was one of my favorite teachers from this semester. Even though this is not a class I was particularly excited to sign up for, as it is not related to my major/interests, Sujay was always positive, inviting, and energized about teaching us, making me want to come to class. He was very good at connecting the things we were learning to real life, as well as to our personal lives, so this class can be relevant to anyone, regardless of their major. The content is interesting and can teach you a lot about the world around you. He was also really inspiring and I could tell that he really cared about his students and wanted us to succeed. There is a LOT of chances for extra credit during in-class extra credit quizzes, so if you show up to class, it it easy to do well. This is a great class to take for Gen-ed Natural Sciences credit and Sujay is an incredible professor. ", "rating": 5, "expected_grade": "A", "created": "2022-05-12T00:54:10Z"}, {"professor": "Sujay Kaushal", "course": "GEOL120", "review": "Sujay is a great lecturer and person. His lectures are very engaging and whats on the lectures directly correspond to the exams (I think he just copy and pastes whats on the slides onto the exams). Class is laughably easy though. Basically gives extra credit every class. My grade right now is literally 126%. The TAs Joe and Sydney are great too. The class has a such a fun vibe", "rating": 5, "expected_grade": "A+", "created": "2022-05-12T23:39:08Z"}, {"professor": "Sujay Kaushal", "course": "GEOL120", "review": "Sujay is a very fun and engaging professor and lecturer. This was easily one of my favorite classes from this semester. I am not even really interested in Geology or Science whatsoever, but I took this class as a gen-ed requirement and was pleasantly surprised by how much I enjoyed this course. If you are looking for an easy course to fill your schedule or if you're looking for a Natural Science gen-ed requirement, this is your class. Sujay gives extra credit basically every class and wants everyone to succeed. I had well over a 100% even after the final. This course has 4 exams - 3 midterms and a final. Don't sweat them - he sets you up for success by adding funny questions and answers. He also gives out a study guide for each exam. \r\n\r\nHe posts the slides on ELMS, so I made a habit of not going to lecture, but that clearly didn't affect me much. As long as you put the time in to take notes and go over the review guides, you will be just fine.\r\n\r\nThe TAs Sydney and Joe were very helpful and their discussion sessions were fun and engaging as well. A 5 question quiz and a short and to-the-point worksheet every week grants you participation points and more smaller grades to boost your grade up. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-24T14:52:52Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "Tests were hard but if you studied and know how to quickly read a textbook you should do fine. Lectures felt like a waste of time but skipping them would impact your grade. Overall the class was very intuitive (what global warming is bad?!?!) which made the lectures being mandatory even more painful. Also I do not love her attitude it felt like she felt better than everyone else which like she isn't.", "rating": 3, "expected_grade": "A-", "created": "2023-01-08T23:52:09.315537Z"}, {"professor": "Sujay Kaushal", "course": "GEOL120", "review": "Is a little bit disorganized. Quizzes are generally easy for the class but there will be random trivia questions sometimes. Exams are fair for the most part, although trivia questions may appear. No extra credit paper for Spring 2023 semester so do not bank on that.", "rating": 4, "expected_grade": "A+", "created": "2023-04-19T21:58:03.096802Z"}, {"professor": "Tracey Centorbi", "course": "GEOL120", "review": "Not a bad lecturer. Exams were mostly fair. Attendance is required though. Slides kind of don't make sense unless you are in class to hear her talk about them. I didn’t like her sense of humor or how she talked. Don’t take unless you are interested in Geology.", "rating": 3, "expected_grade": "A", "created": "2023-04-29T14:08:03.925611Z"}, {"professor": "Sujay Kaushal", "course": "GEOL120", "review": "Great gen-ed to take as a non-STEM major like myself. You don't have to go to class but I feel like it always helped me. One review said that there was no extra credit paper for Spring 2023, but that was not true - and it is worth 20% of a midterm grade. You can always rely on Sujay to give extra credit to those who show up and give it their best try. Sujay also makes class fun by bringing his dog or singing with his guitar. He really wants all of his students to succeed.", "rating": 5, "expected_grade": "", "created": "2023-05-01T03:31:37.153991Z"}, {"professor": "Sujay Kaushal", "course": "GEOL120", "review": "Super chill and easy class while also very interesting. Sujay is an A+ professor who is genuinely interested in his field and wants to share it with his students. Although I'm a CS kid and chose this class for an easy A, I enjoyed going to his class and hearing about his occasional random stories. W professor", "rating": 5, "expected_grade": "A+", "created": "2024-02-01T16:40:59.656338Z"}], "department": "GEOL", "course_number": "120", "name": "GEOL120", "title": "Environmental Geology", "credits": 3, "description": "<b>Credit only granted for:</b> GEOL100 or GEOL120.\nA review of geologic factors underlying many environmental problems and the interactions between population and physical environment: geologic hazards, land-use planning, conservation, mineral resources, waste disposal, land reclamation, and the geologic aspects of health and disease. The course is aimed at lower division students in education and liberal arts, and should be useful to any student concerned with geologic perspectives of environmental problems.", "is_recent": true, "geneds": null}