{"average_gpa": 3.8891443167305235, "professors": ["Jason Farman", "Jarah Moesch", "Krista Caballero", "Jason Farman", "Jessica Lu", "Jessica Lu", "Damien Pfister", "Damien Pfister"], "reviews": [{"professor": "Krista Caballero", "course": "HDCC105", "review": "Krista is a good instructor. She teaches well and is verrrrry artsy, so if you work that to your advantage, you're golden.", "rating": 4, "expected_grade": "A", "created": "2018-02-15T02:22:47Z"}, {"professor": "Jason Farman", "course": "HDCC105", "review": "Great professor, very well-spoken, knowledgeable, and passionate about the subject matter.\r\nFun, informative class on design and current issues concerning design, cultures, and creativity.\r\nSometimes writing rubrics were unclear on how much elaboration on a particular piece of criteria was necessary to achieve full marks.", "rating": 4, "expected_grade": "A-", "created": "2019-01-21T16:54:51Z"}, {"professor": "Jason Farman", "course": "HDCC105", "review": "Very energetic and enthusiastic. Very well read (has even written a book or two himself). He is always open to discussing class topics further after class or in office hours, or discussing how everyday events and design parallel the course material. The one caveat is he does not always respond to emails quickly and is usually slow on grading.", "rating": 5, "expected_grade": "A+", "created": "2020-03-25T16:55:44Z"}, {"professor": "Jason Farman", "course": "HDCC105", "review": "He does a good job with teaching us to focus on \"philosophical\" discussions and encourages conversations in class. Slow grader, but it's not too big of a deal. Personally, I'm not a fan of his big class discussions, but I can appreciate what he's teaching us. He is  pretty good with responding to emails, but I know some people disagree.", "rating": 4, "expected_grade": "A", "created": "2020-12-01T19:16:33Z"}, {"professor": "Jason Farman", "course": "HDCC105", "review": "Prof. Farman wants to individually connect with all of his students. He is reasonable, fair, and easy to talk to. He gives engaging, thought-provoking lectures that make the time fly by. Be prepared to read! While the course doesn't explore topics in depth, it covers a wide range of topics. I strongly recommend taking Prof. Farman's class.", "rating": 5, "expected_grade": "A+", "created": "2022-01-23T17:18:25Z"}, {"professor": "Jessica Lu", "course": "HDCC105", "review": "She's a really good and kind professor. She cared about her students and tried to connect to students in many ways. The assignments in this class weren't too hard and she made expectations clear. Her presentations for her lectures were always pleasing to the eye and relevant to today's culture. She made learning fun and created a welcoming environment. I was glad I started off my college experience with her as a professor!", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T05:01:54.190982Z"}, {"professor": "Jessica Lu", "course": "HDCC105", "review": "She's an ok professor. Honestly, this class was an afterthought for everyone, so there are no strong opinions either way. If you hate professors who spend most of the course talking about their personal lives... do not take her. I know more about her family than I know about what I'm supposed to be learning in this class.", "rating": 3, "expected_grade": "A-", "created": "2022-12-10T02:15:28.240334Z"}, {"professor": "Jessica Lu", "course": "HDCC105", "review": "She's an ok professor tbh. This class is the definition of an afterthought. She assigns readings but you don't have to do them, and she just talks about her personal life 75% of the time. Don't know what I was supposed to learn in this class but the course engagement grade at the end was the worst part. She grades you on if you were memorable in her class of 60 people which is dumb. I only go for attendance and to do other work.", "rating": 3, "expected_grade": "A-", "created": "2022-12-10T02:19:53.761838Z"}, {"professor": "Jessica Lu", "course": "HDCC105", "review": "She spends the first 30 minutes of every class talking about her personal life. I like when professors talk about their personal lives but I feel like 1/3 of each class is too much. Also, she gives a participation grade at the end of the semester, and apparently participating often in class and having perfect attendance is not good enough for an A. Other then that, Dr. Lu is a nice professor and the assignments in this class were fun and a good way to unwind. She drops 2 of the 6 total offerings and gives two weeks after the due date to resubmit offerings.", "rating": 3, "expected_grade": "A", "created": "2022-12-10T19:17:58.690492Z"}, {"professor": "Jessica Lu", "course": "HDCC105", "review": "Dr. Lu was an ok professor. She spent so much time on her personal life that I feel like could have gone into teaching the lecture instead. She seems as though she needs a therapist and not a class. She assigns readings every so often and then does knowledge checks on them which are for completion so it is kind of confusing. The readings do not seem to have a huge impact on the class though. The worst part is the engagement grade at the end of the semester. She graded us on how much of an impact we made in the class which in my opinion was unnecessary and added nothing. As someone with anxiety I felt as though the engagement grade was a terrible add on to the class. She is nice as a person and someone to talk to about problems but as a professor I would not recommend if you have a choice.", "rating": 3, "expected_grade": "A-", "created": "2022-12-12T19:32:48.861939Z"}, {"professor": "Damien Pfister", "course": "HDCC105", "review": "Loveeeee Damien, his energy is so fun and you can tell he genuinely wants to engage and interact with you (he memorized all 65 of our names within a week). This was his first time teaching HDCC105 and a lot of us came into DCC with stories about Dr.Lu's teaching style and we were thrown off by Damien's. It is really awesome to look back and see how much we accomplished despite not really putting in much time outside of class. My one star off is that he would move from huge project to huge project really fast and most of the time we had overlapping group projects with not enough time and it made it hard to really commit to anything. Also one star off because too much AI, i understand why its important to discuss this but i wish this wasnt the topic for the whole semester and everyone in dcc agress with that", "rating": 4, "expected_grade": "A+", "created": "2023-12-01T13:23:18.787850Z"}, {"professor": "Damien Pfister", "course": "HDCC105", "review": "I had so much fun in this class, with all the group projects. The grading was super lenient and you can tell that he genuinely enjoys teaching this class!!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T20:28:30.019490Z"}, {"professor": "Damien Pfister", "course": "HDCC105", "review": "Overall: Damien is a great professor, and you're lucky to be taking this class with him! You get as much out of it as you put in, so take advantage of the freedom and creativity you get in this class!\r\n\r\nPros:\r\n- Very evident how much he actually cared about students, reflected this in every class (getting to know names/people, talks about your interests)\r\n- Lots of creative group work/independence so you could tailor projects to your specific interests and get to know people\r\n- Lenient and understanding grader (made it clear he did not want to stress out students)\r\n- Not much time needed to be spent outside of class time\r\n- Projects were nice, and you had something to show for your effort (podcast, paper, website, dance video, baking etc.)\r\n\r\nCons:\r\n- Overlapping group projects made it a bit overwhelming\r\n- Topic of AI was fun and unique at first, but began to feel repetitive (would appreciate more variety in topics)\r\n- Fun traditions got cut from the syllabus which was a bit of a letdown", "rating": 5, "expected_grade": "A", "created": "2024-01-20T05:50:31.823520Z"}, {"professor": "Damien Pfister", "course": "HDCC105", "review": "Pros: Relatively engaging lecturer, grades reasonably, flexible, open to fun ideas and activities\r\nCons: Changed the syllabus and major projects multiple times, often unclear on expectations, often seemed unprepared for class, generally not there for support often. The TA's were a huge help", "rating": 3, "expected_grade": "A", "created": "2024-01-26T19:30:57.563571Z"}], "department": "HDCC", "course_number": "105", "name": "HDCC105", "title": "Introduction to Design Cultures and Creativity I", "credits": 3, "description": "<b>Restriction:</b> Must be in the Design Cultures and Creativity Honors College Living/Learning program.\nHistory, concepts, and technologies of creative design expression, coupled with an introduction to development for particular platforms and devices.", "is_recent": true, "geneds": null}