{"average_gpa": 3.6296422487223166, "professors": ["Alison Robey", "Jared Novick", "Katie Von Holzen", "Dina Tbaishat", "Alison Robey", "David Martinez", "David Martinez", "David Martinez", "Meghan Hersh", "Seongsil Lee", "Jared Novick", "Meghan Hersh"], "reviews": [{"professor": "Jared Novick", "course": "HESP214", "review": "Dr. Novick is absolutely the best. He is super clear in his lectures and made the class super easy to understand even if you have little to no science background (I'm a business major). I loved this class, it was an easy class that got me thinking differently than the rest of my core classes! ", "rating": 5, "expected_grade": "A+", "created": "2019-10-29T17:02:23Z"}, {"professor": "Jared Novick", "course": "HESP214", "review": "Amazing professor! Truly cares about his student's success. I took this course while it was online and it took up maybe 1-2 hours max a week. So worth it!!", "rating": 5, "expected_grade": "A+", "created": "2020-12-20T19:21:27Z"}, {"professor": "Jared Novick", "course": "HESP214", "review": "Took online and asynchronous. He always made sure that students knew he was there for us. The class itself can be hard if you're not experienced in reading and analyzing scientific papers. Read a couple web articles a week and a scientific paper ~every 2 weeks. Workload also includes writing summaries for 4 scientific papers. Final is a paper reflecting on what you learned.", "rating": 5, "expected_grade": "A", "created": "2021-05-25T22:06:58Z"}, {"professor": "Alison Robey", "course": "HESP214", "review": "Professor Robey is such an open professor, allowing you to contact her as much as you need with questions about assignments. There are no tests in this class, only 4 major writing assignments based on in-class discussions, one group presentation, and a final reflection which are straightforward. Honestly, she did a really good job making the media and empirical pieces be applicable to many students and I felt like I actually learned something in this class. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-14T02:43:54Z"}, {"professor": "David Martinez", "course": "HESP214", "review": "Fantastic professor! He taught the material in a fun and interesting way, and he guided the discussions well.  He was an extremely easy grader and if you do the assignments, you will get a good grade.", "rating": 5, "expected_grade": "A+", "created": "2022-12-08T17:42:44.381384Z"}, {"professor": "David Martinez", "course": "HESP214", "review": "Amazing professor, really enjoyed his class and was genuinely interesting. You can't miss class (due to quizzes/discussions) but you won't want to. The grading was very fair, and no busywork, assignments were genuinely useful.", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T04:19:33.155033Z"}, {"professor": "David Martinez", "course": "HESP214", "review": "One of my favorite classes, He genuinely seems interested in teachings and always made the lectures engaging I ended up learning the content really well and he was really flexible grades wise. There are daily quizzes which he often drops at least 1 or 2 questions from and a discussion with discussion question each day of class but if you put at least a little thought into them you should be fine.", "rating": 5, "expected_grade": "A+", "created": "2022-12-12T16:40:40.105720Z"}, {"professor": "David Martinez", "course": "HESP214", "review": "Great professor that loves he content he teaches and makes classes interesting. No need to worry about grades as almost everything is pretty straightforward, and you'll most definitely get an A as long as you do your work. Very fun class with interesting topics.", "rating": 5, "expected_grade": "A+", "created": "2023-01-29T14:51:47.237265Z"}, {"professor": "David Martinez", "course": "HESP214", "review": "I took this class on a whim, but I am really glad I did. Professor Martinez made the class really enjoyable and by the end it became my favorite class of the semester. The discussions are really engaging and Professor Martinez does his best to make it fun. The class itself is discussion based, but there are quizzes almost every class. So don't skip, but also why would you want to! Take this class if you want a really easy and interesting Gen Ed. Martinez is definitely the way to go", "rating": 5, "expected_grade": "A+", "created": "2023-05-02T19:22:25.657410Z"}, {"professor": "David Martinez", "course": "HESP214", "review": "Took him during the Spring 2023 semester as a gen-ed (also because I thought this would be an interesting class to take) and I have NO REGRETS. If he taught more courses (that I, a CS major, could take) I would definitely take it. Dr. Martinez makes this course super fun and the coursework is honestly very light (I would often finish any assignment during class). Quizzes are very easy as they are based on the readings, and the class has NO midterms, just a final presentation. This class is by far one of my favorites, I learned a lot and was genuinely interested in all the topics covered in class. Not only this class is interesting and fun, the class is very engaging and thought-provoking. I could tell Dr. Martinez is passionate about what he is teaching, and it honestly makes this class more enjoyable. I HIGHLY recommend taking this course WITH Dr. Martinez. If you are here for an easy A, you will not only be left with an A+, but you will 100000% have a happy and satisfied learning experience.", "rating": 5, "expected_grade": "A+", "created": "2024-02-22T19:51:14.117358Z"}], "department": "HESP", "course_number": "214", "name": "HESP214", "title": "The Research Behind Headlines on Words, Thought, and Behavior", "credits": 3, "description": "<b>Cross-listed with:</b> HNUH278A.\n<b>Credit only granted for:</b> HNUH278A or HESP214.\nHow does the human mind use language? Type \"Language Science News\" into your Google search bar. Among the more than 3 billion hits, headlines like \"What is love? It depends what language you speak\" and \"Science's English dominance hinders diversity\" invite you to think about the impact of words on thought and behavior. These are stories about how humans acquire and use language, but they ultimately address big questions about how we experience knowledge itself. In a world of unprecedented access to science journalism, did you ever read a headline about human behavior and wonder: How do we know? This class takes up the elegant ways cognitive scientists design experiments to answer crucial questions about language and thought, brain and behavior, that have no intuitive answers. Students will dive deep into the media coverage of their favorite claims about what we know, debate the psychological science behind these claims, and develop transferable critical-thinking skills in the process.", "is_recent": true, "geneds": null}