{"average_gpa": 3.1628531727651694, "professors": ["Tess Wood", "Johanna Tigert", "Michelle Morrison", "Shameka Johnson", "Ilina Kachinske", "Sunhee Kim", "Thomas Conners", "Daphney Denerville-Davis", "Arifi Waked", "Ilina Stojanovska", "Anne Flood", "Karen Mulak", "Jose Ortiz", "Kathleen Skinker", "Dominique Mwepu", "Melissa Licata", "Karen Miranda", "Dominique Mwepu", "Dominique Mwepu", "Dominique Mwepu", "Emily Lord", "Dominique Mwepu", "Dominique Mwepu", "Emily Lord", "Dominique Mwepu"], "reviews": [{"professor": "Karen Mulak", "course": "HESP120", "review": "She improved over the course of the semester, following a review from the department head. Moves really quickly through her slides making it a little hard to take notes and get everything down, though she does post slides. Exams lean on the harder side but definitely aren't impossible, though studying is a must for her class. So is reading - read before class and keep up with the reading or she will move too quickly to keep up with. She does give pop quizzes based on the readings and those can really hurt grades. \r\n\r\nThe class is really interesting as long as you can keep up. Form a small study group - this is the kind of class where you can be really good at one thing and totally not understand another. \r\n\r\n2 exams + cumulative final, 2 opportunities for extra credit, 6ish medium length homeworks for a lot of points (varying difficulties), and 6ish pop quizzes. ", "rating": 3, "expected_grade": "", "created": "2019-02-08T17:25:56Z"}, {"professor": "Michelle Morrison", "course": "HESP120", "review": "Michelle was the BEST teacher I've ever had at the university. Her office hours were always so helpful and a great way to get to know her. I have ZERO complaints about this woman because she is really the best. She gives so many opportunities to keep up a good grade but really teaches you the material so that you remember it for the future. Highly recommend ", "rating": 5, "expected_grade": "A", "created": "2019-04-29T01:57:39Z"}, {"professor": "Jose Ortiz", "course": "HESP120", "review": "Great professor. Exams are exactly what is on the slides. He works well with you if you need to reschedule any exams. He also gives extra credit if needed. Goes a bit quickly through the slides but posts them after class.", "rating": 5, "expected_grade": "A", "created": "2020-04-09T02:32:54Z"}, {"professor": "Jose Ortiz", "course": "HESP120", "review": "Spunky and fun! knows the material better than anyone I've ever met and genuinely is passionate about it and wants you to be too. I think he was an absolutely fantastic professor and was incredibly fair with all assignments. He even dropped our lowest test grade out of the three tests to help out students who weren't doing well.  Jose is the man and I'd take any of his classes in a heart beat ", "rating": 5, "expected_grade": "A+", "created": "2020-05-04T17:46:51Z"}, {"professor": "Michelle Morrison", "course": "HESP120", "review": "Dr. Morrison is a great professor. She is super sweet and tries really hard to make boring material interesting. There are a lot of homework assignments that are like 5-7 pages long, but she makes sure you know how to do them through practicing in class with her and the TAs. The tests are big but very, very fair. She posts a great study guide and makes them similar to the homework. She has endless opportunities for help and is just an easy person to talk to and listen to. Definitely recommend her as a professor. ", "rating": 5, "expected_grade": "A", "created": "2021-04-25T18:29:12Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "The actual worst. I could not understand his lectures, and me moved through the material at lightning speed. Took this class because I am a HESP major. If you do not do well don't get discouraged. Other professors in the department are great. You need to do the readings and the homeworks to do well. I am a good student and the homeworks are HARD. I even went to office hours and his explanations did not help. NOT AN EASY A. My hardest class I took both semesters of freshman year. The final project is fun and that is what boosted my grade. Second half of the semester is easier than the first! Good luck everyone. ", "rating": 2, "expected_grade": "A-", "created": "2022-03-02T17:39:59Z"}, {"professor": "Michelle Morrison", "course": "HESP120", "review": "Super helpful and very kind to her students; she really cares about her work and making sure everyone understands it!", "rating": 5, "expected_grade": "", "created": "2022-05-03T23:42:25Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Dr. Mwepu is one of the worst professors I have ever had. He goes through the material extremely fast and gives little time to ask questions. When you do ask questions he finds a way to not give you the right answer. Definitely the hardest class I have taken. DO NOT TAKE AS A GEN-ED. This class is not worth your time with Dr. Mwepu. ", "rating": 1, "expected_grade": "B", "created": "2022-05-10T18:55:03Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "TLDR: nice, funny, quiet professor with a tendency to ramble. The class is easy if you read the textbook and go to lecture. It would probably help if you already had an interest in linguistics/languages.\r\n---\r\nI was originally planning on majoring in HESP, but I switched to LING because of Dr. Mwepu (and some other factors, ofc). He is a bit introverted and sometimes takes a while to answer questions. However, he is really funny and understanding of his students. Lecture can get kind of dry when he's speed running through the powerpoint slides, so it helps to sit in the front of the class to pay attention.\r\n\r\nThe class was structured so that we studied, in order: phonetics, phonology, morphology, syntax, semantics, pragmatics, psycholinguistics, then social/developmental linguistics. This follows the textbook EXACTLY, so I highly suggest you READ THE TEXTBOOK. The class will be insanely hard if you don't. Some quiz/homework questions are also answered directly in the textbook. The practice questions at the end of each chapter in the textbook are also similar to exam questions. There are 6 homework assignments (but he drops your lowest score), a few pop quizzes (go to class), 3 non-cumulative exams, and a final group project.", "rating": 5, "expected_grade": "A+", "created": "2022-05-18T01:09:28Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Dr. Mwepu is one of the greatest professors I've had. He has a genuine love for linguistics and his students and his class is engaging and pretty easy. I don't understand why there are some bad reviews here, I truly have nothing bad to say about him!", "rating": 5, "expected_grade": "A+", "created": "2022-11-19T15:31:36.229464Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Dr. Mwepu was an amazing professor! He is very approachable and is very willing to help his students. He is also very encouraging and you can tell that he wants his students to do well. This class was probably my favorite class out of all the classes I've taken. I will say that you will need to work hard in order to do well. However, if you read the textbook, take good notes, and go to lectures you will understand the concepts fairly easily. He does give study guides for exams and if you follow along and review the concepts on there, you will do fine. Make sure you are really familiar with the IPA chart.", "rating": 5, "expected_grade": "A+", "created": "2022-12-10T02:44:38.122943Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Would definitely recommend his class, was super interesting. It does go a little fast at times, but there are opportunities to get help in office hours. You don't really need to do the readings to get a good grade as his lectures cover most everything you will be quizzed on (at least in hesp120) but I do recommend doing so anyway if you can find the time. He is a lenient grader on the exams.", "rating": 5, "expected_grade": "A-", "created": "2022-12-15T01:05:02.015748Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "This professor gave me such a love for linguistics and I am truly excited to go to class. He always has something kind to say and he genuinely is so proud of his students when they get something right. The coursework is balanced and if I ever had questions, he was quick to respond with an answer that really made me think. Need to go to class, he explains most things that would otherwise be difficult. Two pop quizzes but never got grades for them. He is so funny unintentionally and I wish he taught more classes. He is a lenient grader and gives a lot of partial credit and extra credit. Grade breakdown is nice, exams aren't weighted too heavy. Textbook is not needed lectures have everything.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T17:48:08.790528Z"}, {"professor": "Emily Lord", "course": "HESP120", "review": "Since it's an intro class, this class isn't particularly difficult as long as you put some effort in. If you take the time to prepare for each exam, you'll do perfectly fine, and if you ever need the grade boost, she offers a lot of opportunities for extra credit. Her slides are comprehensive and she also has several other resources provided to further help with studying and homework assignments. If you want a higher grade in this class, you'll have to attend lecture, since she has surprise participation assignments that are worth 10% of your grade; there aren't very many of them so missing even one can have an impact.\r\n\r\nShe is a bit awkward at times, though I can't entirely fault her since the students didn't have much energy and only a handful of people participated. In office hours, she's quite helpful and kind, and she explains concepts well, whether they've been covered in class or not. If you aren't interested in linguistics you probably won't enjoy this class, but if you are, she's a solid professor to take.", "rating": 4, "expected_grade": "A+", "created": "2023-05-17T04:04:37.670260Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Dr. Mwepu is great! His lecture slides are pretty straightforward, and he is very good at answering questions. He is very passionate about linguistics, which is what makes the class so engaging. He is also very funny, which is another reason behind why the class is engaging as it is.", "rating": 5, "expected_grade": "A-", "created": "2023-09-05T18:23:46.407700Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Dr. Mwepu is a super engaging professor who is very passionate about linguistics. However, this class is not the easiest. The workload is pretty hefty as we have weekly homework (that take a lot of time), quizzes, exams, and a group project. He does move through the material fairly quickly, but he's always willing to answer your questions. Attendance is mandatory. Only thing that was kind of annoying was towards the end of the semester he gave out \"pop\" quizzes every class and they were graded, but besides that he was a pretty good professor. Just study and work hard and you'll be fine.", "rating": 4, "expected_grade": "A-", "created": "2023-12-11T16:54:40.916628Z"}, {"professor": "Dominique Mwepu", "course": "HESP120", "review": "Dr Mwepu is a really great professor! His lectures are engaging and interesting. But, he sometimes moves very quickly through the powerpoint notes. You need to put in the work to do well on the tests and homework assignments, but it is definitely not too much work to handle. I really enjoyed his class and I would recommend it.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T19:31:16.866701Z"}], "department": "HESP", "course_number": "120", "name": "HESP120", "title": "Introduction to Linguistics", "credits": 3, "description": "<b>Additional information:</b> HESP120 is required for HESP majors. HESP majors may not substitute LING200.\nAn introduction to the scientific study of natural language with focus on the basic concepts of phonology, syntax, semantics and pragmatics, with subsequent attention to the applied aspects of linguistic principles.", "is_recent": true, "geneds": null}