{"average_gpa": 3.713461538461539, "professors": ["Sarah Croco", "Sarah Croco", "Sarah Croco"], "reviews": [{"professor": "Sarah Croco", "course": "HGLO101", "review": "First thing: this course has a lot of reading, but you are reading actual books rather than textbooks, so it's not that bad. Also a lot of coding in R - this course is basically an introduction to using data science for politics/government. She does not teach the coding in class, but she does record tutorials and its especially not that bad if you know how to use Google. \r\n\r\nCoding assignments were once a week making a graph from a dataset. Aside from coding assignments, all other work was very easy, just a paragraph reflection and meme based on the readings for that week. Lectures were fun and she is very entertaining, definitely recommend especially if you're interested in data, but even if you're not.", "rating": 5, "expected_grade": "A+", "created": "2022-12-01T23:05:27.348995Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "If you are in Global Communities read this review carefully. Shes the only teacher who teaches this course. We were the first class to ever have her and take this course and thought it felt disorganized at times, it was a great class. Dr Croco is incredibly kind and passionate about what she does and comes to dorchester events to meet the students. She is the best. People really just hated on her because the course had coding assignments (which are so easy...and I HATE computer science). The class is literally so easy. We have a weekly reading that you have to write a 250 word reflection, a meme assignment, and a mini coding assignment (which is again...so easy). Love Dr Croco. There is no exams for this class nor is there a final.", "rating": 5, "expected_grade": "A+", "created": "2023-01-19T19:09:34.087682Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "If you like coding in R and reading PoliSci books then this class is for you. If not this is a great class to do HW in. Dr. Croco uses her time to repeat verbatim things you read that week. Each week you must write a reflection and create a meme, both of which are easy. If Dan is your TA you will be in luck, an amazing guy who is super helpful on all R assignments. The code can be hard to get the hang of and made me want to drop Honors but once you get over the learning curve you'll realize that Dr. Croco is right about all the benefits of knowing R.  \r\n\r\nDr. Croco does try to incorporate student input and make her classes more engaging. This was the first year so I'm sure it will only get better. Attendance is not required and there are no tests. The final project is also very easy.", "rating": 3, "expected_grade": "A+", "created": "2023-04-26T02:28:26.192773Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "I did not like Dr. Croco at first, but she has grown on me this past year. HGLO101 forces you to learn how to code with R, and Dr. Croco does not give much instruction on what to do. She posts some video walkthroughs and assigns readings but there are not really any lectures devoted to learning R. But, as a member of HGC, I was prepared for GVPT201 since I learned R from HGLO101. Dr. Croco really cares about her students and is very willing to help.", "rating": 4, "expected_grade": "A+", "created": "2023-05-12T16:47:48.883781Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "I had Dr. Croco during my first semester of college (Fall 2022). It also was the first semester this class was taught. She was an excellent professor. This class' content was easy, and it was graded fairly. All around good and easy class.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T20:04:10.843343Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "Dr. Croco is a really nice and understanding professor who really cares for her students. She is very engaging and friendly and it is very obvious that she actually loves what she does. \r\nRegarding the class, the work load wasn't hard when it came to the reflections and readings. The books were not that bad although some were very boring reads. My BIGGEST complaint about this class was learning R and the coding assignments for it. When I tell you they are bad, THEY ARE BAD. If you are not into tech, it will be a huge struggle. Dr. Croco was great at teaching everything BUT R. She didn't know how to explain the work and when you asked her for help, she would tell you to either collaborate with others are look it up online (which didn't help because R code you would find online is too advanced for this class). I feel if a professor is recommending you to use Chat GPT then something is wrong with how the class is being taught. \r\nI would say this class overall is 3/4 stars just because of how bad the R assignments were.", "rating": 4, "expected_grade": "A+", "created": "2023-12-15T17:29:11.779278Z"}, {"professor": "Daniel Tuke", "course": "HGLO101", "review": "At first, I wasn't a fan of Dan because of how he taught. He was very laid back, but in an \"idc about anything\" kinda way. But after the first couple weeks, I started to really like him. This form of teaching actually helped when it came to discussion topics because a lot of what we learned in HGLO101 is about the current state of the world. He is very real about what is happening and isn't afraid to call out and speak up against what we read. He is very entertaining and understands college students well which makes it really easy for him to connect with us. He is really funny and in the end, I liked the way he taught. I purposely took the specific GVPT201 section next semester so he would be my TA.", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T17:42:31.769545Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "Dr. Croco is a great person and she is so sweet outside of class, so this review is not against her as a person, just her teaching style.\r\nFirst of all, the books we read and the reflections we had to do with them were very easy, that was never an issue. Sometimes she would assign like 200 pages of reading a week, which was annoying but that was so easy compared to the coding.\r\nIf you have never coded before, this class is going to be very difficult for you. Dr. Croco is very bad at teaching R. She doesn't give any support and expects us to know a lot right from the beginning. The pace we move at is so unbearable, and often Dr. Croco doesn't even know stuff. She tells us to use ChatGPT and google a lot, but those offer such immense resources that it is difficult to even know what to Google. The coding assignments are due on Wednesday which makes it very difficult to keep up with. Overall, find people in the class who have coding experience and work together with them because it will be so difficult if not.", "rating": 3, "expected_grade": "A+", "created": "2023-12-15T17:44:33.198014Z"}, {"professor": "Tristan Hightower", "course": "HGLO101", "review": "Tristan is not a very good TA. He is a very nice person but does not aid with R work very well. In discussions, he will talk about coding assignments that are due in 2 weeks... which I can guarantee no one has even opened yet. He also very much picks favorites in class and only calls on them and engages with them, which is fine by me cause I didn't want to volunteer but I could tell it was annoying for other students. He was pretty uninformative about the coding assignments too.", "rating": 2, "expected_grade": "A+", "created": "2023-12-15T18:01:58.237420Z"}, {"professor": "Sarah Croco", "course": "HGLO101", "review": "Professor Croco is incredibly kind, easygoing, and funny. There is not a professor that is better than her at being personable and helpful. On the other hand, the class is slightly boring. The books are boring and get worse as the semester goes on. You will hate R at some point just because. I promise. However, to resolve any R issues, just ask her or either of the TAs because they are always there to help.", "rating": 4, "expected_grade": "A+", "created": "2024-01-03T22:10:46.443075Z"}, {"professor": "Tristan Hightower", "course": "HGLO101", "review": "He was a super chill TA who helped us a ton with coding and made sure we didn't get lost in assignments. Always willing to answer our questions and he was quick on the email replies… like a few hours tops. R coding is a bit of a challenge. No hiding that. Especially if you haven’t coded before. If you're not into putting in the time and effort, maybe think twice about being in HGLO. The person below must not have been feeling the whole honors class workload (or they’re lying about getting a high grade). Everyone I knew ended with solid A's or A+'s and liked him. If you are going to do HGLO, I recommend getting him as a TA.", "rating": 5, "expected_grade": "A+", "created": "2024-01-18T04:59:30.408400Z"}], "department": "HGLO", "course_number": "101", "name": "HGLO101", "title": "Globalization", "credits": 3, "description": "Is globalization sustainable? This course is an interdisciplinary exploration of globalization and anti-globalization through analysis of its impact on economic, political, social and environmental affairs. It introduces different frameworks for evaluating whether contemporary globalization is sustainable in its current form.", "is_recent": true, "geneds": null}