{"average_gpa": 3.5479468599033814, "professors": ["Michele Lamprakos", "Jeremy Wells", "Paula Nasta", "Hannah Cameron", "Hannah Cameron", "Stefan Woehlke", "John Sprinkle"], "reviews": [{"professor": "Hannah Cameron", "course": "HISP200", "review": "Definitely the easiest A I've gotten and the topics itself were pretty fun to learn. My TA was really laid back and it was great. You don't have to go to class unless its for the quizzes which were also pretty simple. The projects were fun and great feedback was provided. Discussion activities were pretty fun. The lectures itself were simple and interesting only sometimes, but all read from the slide so no point in going. Overall, great, nice, and easy.", "rating": 5, "expected_grade": "A+", "created": "2022-10-20T19:47:54.969739Z"}, {"professor": "Hannah Cameron", "course": "HISP200", "review": "A very easy class that covers 3 gen-ed requirements. You don't even have to attend class every time and you will still be fine. 100% worth it.", "rating": 5, "expected_grade": "A+", "created": "2023-06-02T17:25:31.524803Z"}, {"professor": "Hannah Cameron", "course": "HISP200", "review": "This is exactly how a gen-ed should be. Dr. Cameron is so kind and is obviously very passionate about her subject. The TAs were all nice and I enjoyed doing independent research projects to learn about where we live. I really enjoyed learning about the history of local areas and it made me think differently about the streets I walked on. If you are lucky enough to take this class, take it!!! It was so so so so so easy but still interesting.", "rating": 5, "expected_grade": "A+", "created": "2023-07-05T17:21:40.163873Z"}], "department": "HISP", "course_number": "200", "name": "HISP200", "title": "The Everyday and the American Environment", "credits": 3, "description": "Jointly offered with HISP615.\nAn introduction to the theories of the everyday within the context of the American built environment. Focuses primarily on the American experience of underrepresented, minority, and/or immigrant communities; both historical and contemporary. Attempts to challenge what is meant by American in describing the American everyday built environment.", "is_recent": true, "geneds": null}