{"average_gpa": 2.4009975062344138, "professors": ["David Sartorius", "Shari Orisich", "Alejandro Caneque", "David Sartorius", "David Sartorius", "David Sartorius"], "reviews": [{"professor": "David Sartorius", "course": "HIST250", "review": "This guy is brutal. If you want a lot of reading and a douche bag professor then take this class. More reading than a 400 level class. ", "rating": 1, "expected_grade": "C", "created": "2010-11-10T02:52:00Z"}, {"professor": "David Sartorius", "course": "HIST250", "review": "He's a very squared guy. Treats course as a 400 series history class. Very passionate about the subject. Harsh grader. It's unclear what he is asking for in his exam. ", "rating": 2, "expected_grade": "C+", "created": "2019-12-17T21:59:00Z"}, {"professor": "David Sartorius", "course": "HIST250", "review": "Professor Sartorius's HIST 250 class offers a unique opportunity to understand how society works with history as context to \"hegemony\" which is the main theme of the course. This is not an easy lower level history course! It was harder than one of my 300 level history classes. He is strict and does not take well to eyes on computer screens, and phone usage. He can also get flustered if there is not sufficient participation from numerous students. However, if you show up on time, go to all classes, participate and do all your assignments to the best of your abilities, there is no reason why you should not walk away having passed the course. While he was strict and had high exceptions, your writing significantly improves throughout the course. I would lastly recommend, an interest in the Latin American region as a precursor to this course. I would give this class a 3.5 but that is not possible with this rating system. ", "rating": 3, "expected_grade": "A", "created": "2021-12-18T14:58:29Z"}, {"professor": "David Sartorius", "course": "HIST250", "review": "The professor is a strict but fair teacher. It is true that he does not like screens, interruptions, and he can be intimidating. However, just by following a few rules like being on time and turning your phones off, the class becomes quite enjoyable. I honestly did not like history before I took this class, but now I’m getting a minor in colonial Latin America. As long as I did my work, I enjoyed the professors little quips and passion to teach his favorite subject. Don’t get me wrong, his class is hard and can frustrate some students, but through his office hours, and notes I believe anyone taking this class will be fine. You just need to put in the work and adapt. If you are not the student to work hard and learn from this class, I suggest you take an easier one. This class challenged my writing, reading, time management, and critical thinking skills every single time, and while it was not always fun, I believe it was worth it. I believe that he often times gets a bad rap due to his demeanor but once you get into the groove of the class, his little jokes and love of history can make the class enjoyable.", "rating": 4, "expected_grade": "B+", "created": "2022-12-15T04:17:39.824488Z"}, {"professor": "David Sartorius", "course": "HIST250", "review": "At the beginning of the semester, I only took this class as a “easy” gen-ed without really caring at all about history. However, this class was far from easy. There is a lot of homework and it takes a lot of self initiative to do it well. It is true that the professor insists on being early to class, go to the bathroom before class, and have phones turned off, but is it really that difficult to follow these rules? He does have a little temper but he got better throughout the past semester. I believe that most students who don’t like him came with different expectations for the class and would have preferred better communication. That’s how I felt.  However, I went often to his office hours and he helped me understand and learn what I should be looking for. This class is for someone who wants to greatly improve their writing, reading analysis, and their critical thinking skills. It is not for those who want to “breeze” by. I am now reaching for a LACS minor and while it was difficult, and filled with many late nights, I would take this class again. The syllabus is key to understanding structure and being prepared by reading ahead.", "rating": 4, "expected_grade": "B+", "created": "2022-12-15T04:30:23.996254Z"}, {"professor": "David Sartorius", "course": "HIST250", "review": "Professor Sartorius was an amazing history professor with enormous talent for teaching. I took the class in my first semester of freshman year, and I was thrilled that his teaching style combines English and history together. The class involves many hours of close reading - sometimes more than 100 pages - along with weekly mini-essays (but you do not do one every week, you choose which seven to do throughout the year). If you do the class, be prepared for lots of readings, improving your writing, including developing your own argument in everything you write, and participating in class. \r\n\r\nSartorius takes attendance and puts class participation as part of your grade. The readings in the course are argumentative essays by historians and primary sources that contradict each other. You will need to synthesize these sources together and think very critically when you write. \r\n\r\nIf you come to class and stay engaged, it is a lot of fun, but be wary of using electronic devices, which he is picky about. I used paper notes and printed out readings the entire year.", "rating": 5, "expected_grade": "A", "created": "2023-10-18T23:58:13.267575Z"}], "department": "HIST", "course_number": "250", "name": "HIST250", "title": "Colonial Latin America", "credits": 3, "description": "<b>Cross-listed with:</b> LACS250.\n<b>Credit only granted for:</b> LASC250, HIST250, OR LACS250.\n<b>Formerly:</b> LASC250.\nIntroductory survey of the history of Latin America from pre-Columbian Indian cultures to the beginning of the wars for independence (ca. 1810), covering cultural, political, social, and economic developments. Major themes include conquest, colonialism, indigenous culture, African slavery, religion, race and ethnicity, and gender ideologies.", "is_recent": true, "geneds": null}