{"average_gpa": 3.101836734693878, "professors": ["Robert Chiles", "Miles Bradbury", "Ira Berlin", "Richard Bell", "Christopher Bonner", "Rachel Walker", "Donald McNeilly", "Paul Gibson", "Christina Larocco", "Jeffrey Coster", "Holly Brewer", "Nicole Mahoney", "Caitlin Verboon", "Howard Smead", "Richard Bell", "Robert Chiles", "Howard Smead", "Robert Chiles", "Robert Chiles", "Robert Chiles", "Holly Brewer", "Howard Smead", "Howard Smead", "Richard Bell"], "reviews": [{"professor": "Holly Brewer", "course": "HIST200", "review": "The absolute worst lecturer. Assigns readings that make ZERO sense, we come to close and all bomb the clicker questions. If 68% say the answer is true but false is actually the right answer, that should be an issue for her??? Interesting this class is required for education students when the only thing I have learned is how to create an actual lesson plan and to teach effectively. Her lectures are extremely disorganized, her powerpoints are in no way helpful so all the students have left to do is fail. When the exam rolled around, we were not given a study guide and told that \"we should know what terms are important\" when in reality, our class study guide of important terms had NO OVERLAPS to what was on the exam. Let's also not forget the TA grades with decimals, I just received a 16.75 on the exam, one would think that would just be a 17 but not Dr. Brewer! Spare your sanity and wait to take this class with Chiles. ", "rating": 1, "expected_grade": "B", "created": "2019-04-06T19:55:59Z"}, {"professor": "Holly Brewer", "course": "HIST200", "review": "Absolutely terrible teacher. DO NOT take her if you can help it. Required for Ed majors, but just wait to take it with someone else!! Class is extremely boring and irrelevant, she just rambles on and goes on tangents. Only a few vaguely assigned and harshly graded essays and tests. DO NOT take this class with Holly Brewer!", "rating": 1, "expected_grade": "C+", "created": "2019-04-11T14:14:41Z"}, {"professor": "Holly Brewer", "course": "HIST200", "review": "Actually the worst professor I've had so far. Her lectures are confusing and irrelevant, and she's not understanding or adaptable to the class's needs. Her TA is the only reason I have any idea what is going on and I think he is confused by her too. An absolute mad woman, take this course with someone else. ", "rating": 1, "expected_grade": "A-", "created": "2019-04-17T17:55:00Z"}, {"professor": "Matthias Fischer", "course": "HIST200", "review": "He's my TA for HIST200 with Dr. Brewer, and I honestly like him a lot. The biggest drawback is that I can't stand Dr. Brewer and her lectures are awful, but Matt tries to make up for them in his discussion section, but there's only so much you can do in 50 minutes. He's actually a very understanding and helpful TA from my experience and I'm sure if I could follow anything that happens in lecture, I would give him 5 stars. ", "rating": 4, "expected_grade": "A-", "created": "2019-04-17T18:00:18Z"}, {"professor": "Holly Brewer", "course": "HIST200", "review": "i regret taking this class on campus when i would have gotten an A+ online. She is one of the worst professors i have ever had- she literally fell asleep in class last week??? also majority of the class fails every clicker question quiz...if only 38% of the class gets the answer correct, shouldn't that be alarming for her??? OR, why are there TWO correct answers for a question!!! she also never posts grades so we won't actually know how were doing until final grades are in so thats great. the TA looks so utterly confused the whole time as well but never says anything. she goes on tangents about god knows what and pressures us to answer questions that we do not know and gets mad when the class does not get them correct. this is a required class so wait to take it w chiles- its worth it.  ", "rating": 1, "expected_grade": "B", "created": "2019-05-07T13:47:30Z"}, {"professor": "Richard Bell", "course": "HIST200", "review": "Bell is awesome. The class atmosphere is fun and his lectures are interesting. He knows his stuff and is a great guy. The class though stinks. A lot of reading, two difficult essays and a big final. He is awesome though and almost makes the class worthwhile. If you like history, this is the class for you. If you want an easy A, this is not. ", "rating": 5, "expected_grade": "", "created": "2019-12-13T07:43:30Z"}, {"professor": "Robert Chiles", "course": "HIST200", "review": "Very knowledgeable and the course load was expected. He is very animated and makes learning about history enjoyable. You can tell he is passionate about what he is talking about. During fall 2020, he held only asynchronous lectures. It would have been nice to have a real zoom meeting with him every now and then, but overall it was a solid class.", "rating": 4, "expected_grade": "A-", "created": "2020-12-21T11:17:34Z"}, {"professor": "Christopher Bonner", "course": "HIST200", "review": "I was surprised to not see more reviews for Professor Bonner, he is an amazing lecturer, and is extremely approachable on any matter, his class is interesting and he records his lectures so you can go back and watch! I highly recommend this class!", "rating": 5, "expected_grade": "A+", "created": "2021-12-06T21:37:47Z"}, {"professor": "Holly Brewer", "course": "HIST200", "review": "Not sure if it's just because these reviews are old but she's really not that bad!  Our only assignments are three papers throughout the semester and an oral presentation as the final.  She is very knowledgeable about the material but it's kind of hard to take notes in her class.  She is not super great but not bad.  I would ask our TA for help and she was better at explaining things than Dr. Brewer.  I put in very little work for this class and have an A.  I see people in comments below talking about quizzes and doing clicker questions but we don't have those!  The TA has graded our papers so far and takes kind of long but it's not a huge deal for me.  My biggest drawback for her is lectures but I really don't think she's that horrible like all these comments say, just kind of boring and hard to follow.", "rating": 3, "expected_grade": "A", "created": "2022-04-14T20:21:06Z"}, {"professor": "Holly Brewer", "course": "HIST200", "review": "She is the worst teacher I've had so far at UMD. Her lectures are very unorganized and she always skips through the slides with words very quickly but stays on the slides with the pictures for a long time. Her lectures are very disorganized and she rambles about the smallest irrelevant details of the event we were discussing. During one lecture she went from Native American and settler relations to the Salem Witch Trials. The only reason grades are up to date is because the TA grades everything and tries her best to pick up the mess Professor Brewer left. ", "rating": 1, "expected_grade": "A", "created": "2022-05-03T23:45:24Z"}, {"professor": "Robert Chiles", "course": "HIST200", "review": "Professor Chiles is a great lecturer! While most of us took American History in high school, HIST 200 goes into greater depth on the founding of America through the Civil War period. Some of the material was familiar, but other bits of information came as a surprise. \r\n\r\nFair warning, Professor Chiles speaks quickly during lectures. If you're stressed about taking notes, don't be. Chiles posts all his lectures on Canvas Elms. Even better, Professor Chiles hands out study guides for all his exams, so you know what to study for. The TAs are very nice, but discussion sessions were boring at times. Assignments include two exams, one paper, and weekly discussion board posts. ", "rating": 5, "expected_grade": "A+", "created": "2022-08-05T21:44:45Z"}, {"professor": "Robert Chiles", "course": "HIST200", "review": "Echoing most of the other reviewers, Dr. Chiles is probably one of the most charismatic, passionate, and dedicated instructors at UMD. It's honestly embarrassing for the University that he isn't tenured. However, if you're going to register for one of his lectures, I would recommend not scheduling a class immediately after on the other side of campus. Lectures routinely went 1-3 minutes over their scheduled end time. It's a testament to Chiles' lecturing skills that almost no students even began to pack up until he remarked that the class was nearly over. Absolutely would recommend any of his classes.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T20:43:41.408673Z"}, {"professor": "Howard Smead", "course": "HIST200", "review": "Professor Smead is such a passionate lecturer, which makes his class engaging. I was not expecting to enjoy attending this class because I find that learning about history can sometimes be a bit boring, however, he made learning about these topics very interesting and exciting for someone who is not very passionate about the subject. There were two exams, the final, and one discussion post a week responding to a question. I never once felt overwhelmed by the work given in this class. He would always describe his exams as essay questions, but he really just wanted however much you felt it took to answer the question.\r\nTo be completely honest, I never read either textbook (American Yawp and Voices of Freedom) because everything I needed to complete each discussion post was already covered in the lecture. He tends to get sidetracked and often did not finish the slides as he intended, but since my class had a weird 45-minute class time with an additional hybrid component, we were able to cover everything in online recorded lectures that he would post.", "rating": 4, "expected_grade": "A-", "created": "2022-12-20T17:04:01.943279Z"}, {"professor": "Robert Chiles", "course": "HIST200", "review": "Dr. Chiles is a great professor! You can tell how much he loves teaching. As someone who is not too interested in history, lecture definitely was a little boring at times. But overall a super easy class with only one paper and the study guides for the midterm/final are very similar to what is on the exam. A great class to take for a gen-ed!", "rating": 5, "expected_grade": "A", "created": "2022-12-21T03:07:57.494007Z"}, {"professor": "Howard Smead", "course": "HIST200", "review": "Great professor, and work load is quite small. Lectures are straightforward and interesting", "rating": 5, "expected_grade": "A", "created": "2023-09-26T16:35:25.710529Z"}, {"professor": "Holly Brewer", "course": "HIST200", "review": "DO NOT TAKE THIS COURSE!! The Dr.Holly Brewer is definitely passionate about history but is bad at explaining the course content and staying consistent with the presentations. She gets distracted easily and veers off course talking about something unrelated. She also makes you participate and makes students talk about the material, even though she assigns heavy workloads of reading for quizzes that are worth only 10 points. Many students are often lost in this class and its high effort for a Gen ed.", "rating": 1, "expected_grade": "C-", "created": "2023-12-06T20:18:02.250630Z"}, {"professor": "Holly Brewer", "course": "HIST200", "review": "The worst professor I had this semester, but she is still bearable. Her lectures are somewhat disorganized and she will go off on tangents. She goes over slides with a lot of text very quickly but will sit on a slide with an image for what may feel like years. Also, the lectures have very little to do with the actual work in the class, the only reason to attend is so she can't put you on the spot in the discussion. (Also to take notes you could possibly use for the final, which is an oral exam) She also does not grade things with any particular haste. It is currently December 9th, 3 days away from reading day and she has about 11 assignments per student to grade. The best thing I can say about her is definitely that she is pretty nice and extremely passionate about history and being a historian, she seems very accomplished and I actually respect her for that.", "rating": 2, "expected_grade": "A-", "created": "2023-12-09T18:27:32.081975Z"}, {"professor": "Holly Brewer", "course": "HIST200", "review": "This was a very unenjoyable class. Her lectures have nothing to do with the material being learned and she moves at a very fast pace. She is very unorganized and spends a lot of time going on different tangents. She is also very behind on grading and you get little to no feedback on your papers.", "rating": 1, "expected_grade": "B", "created": "2023-12-11T21:43:42.143675Z"}, {"professor": "Holly Brewer", "course": "HIST200", "review": "She is not a good teacher. Her lectures are extremely un organized and she skips from slide to slide without teaching the information at all. I do not recommend this class. Weekly written quizzes that are graded harshly, and essays that are graded harshly. The syllabus with information is not clear either. Do not take this class, I repeat do not take this class!", "rating": 1, "expected_grade": "B", "created": "2023-12-15T01:58:49.518761Z"}, {"professor": "Holly Brewer", "course": "HIST200", "review": "Dr. Brewer is a very kind professor who is very passionate and educated in history. In terms of her teaching style, it is not for everyone. Her slides in lectures were often very unorganized and often hard to follow. Many times, we didn't even finish the slides that she had prepared in class and would have to continue into the next one. Overall, this isn't a very difficult class to pass, but it depends on who your TA is. They will grade all of your work, and review the readings in the discussion section. There is a 10-point quiz every week, with around 4-5 questions. They are based on the readings that you are given for that week. There are two 3-5 page papers, \"primary source analysis'.\" These had to be written using all of the readings you were given, as well as scholarly articles you could find offline. There was one during midterm week and one right before Thanksgiving break. Finally, there is an oral final, meaning you are asked two questions which you have to answer. Honestly, if you like history this class shouldn't be too bad. Otherwise, you'll just be having a lot of busy work. Don't let the other reviews scare you, just make sure that you have a good TA! If you are taking this class as a gen-ed, get it out of the way as soon as you can!", "rating": 3, "expected_grade": "B", "created": "2024-01-02T05:03:18.761992Z"}, {"professor": "Holly Brewer", "course": "HIST200", "review": "Prof. Brewer is very nice and is very educated in history. Yet, her lectures had nothing to do with any graded materials and were pointless to attend. We had short quizzes every week on assigned readings, and reading the readings and taking the quiz took HOURS every week,and the total of them was only 15% of our grade. It was a crazy amount of time to spend on one small assignment but it had to be done every week which felt pointless and annoying.", "rating": 2, "expected_grade": "B+", "created": "2024-01-27T21:21:39.953101Z"}], "department": "HIST", "course_number": "200", "name": "HIST200", "title": "Interpreting American History: Beginnings to 1877", "credits": 3, "description": "<b>Credit only granted for:</b> HIST156 or HIST200.\n<b>Formerly:</b> HIST156.\nThe United States from colonial times to the end of the Civil War. Establishment and development of American institutions.", "is_recent": true, "geneds": null}