{"average_gpa": 2.5284271284271287, "professors": ["Antoine Borrut", "Ahmet Karamustafa", "Rachel Schine", "Rachel Schine", "Rachel Schine"], "reviews": [{"professor": "Antoine Borrut", "course": "HIST120", "review": "Borrut is a solid professor. He is very knowledgeable, is easy to talk to, and is good about communicating with the class via elms/email. However, he can be hard to understand, due to his accent and constant voice cracks, and expects too much from his students in a lower level, lecture hall class. ", "rating": 3, "expected_grade": "B+", "created": "2012-12-27T01:10:00Z"}, {"professor": "Antoine Borrut", "course": "HIST120", "review": "One of the best (if not the best) history professors at UMD. Keeps you engaged in lecture and is very helpful during office hours. He is invested in seeing his students do well and has a good sense of humor. \n\r\nHIST120 has a good bit of reading and a lot of dates. Building a chronology is pretty much essential to doing well in the class. However, the material is incredibly interesting and I learned a significant amount about Islamic culture because of it.\n\r\nEasily my favorite class so far at Maryland and highly recommended.", "rating": 5, "expected_grade": "A", "created": "2012-09-24T19:31:00Z"}, {"professor": "Antoine Borrut", "course": "HIST120", "review": "I took HIST120 my freshman year and fell in love with Islamic history all because of Professor Borrut. He is one of the top professors at Maryland. Not only does he know what he's talking about, but he passes on that knowledge in an interesting and clear way. He wants you to learn, and it shows. He is extremely available and helping his students excel is his main priority.\n\r\nHIST120 is a basic introduction to early Islamic history, and is not too hard. There are 3 essay exams, but you review in discussion, so you have no reason to be unprepared for the questions. Discussion is mandatory, and you discuss certain readings. You can guess which reading is going to be discussed so you do not need to read them all.\n\r\nI loved Professor Borrut's class so much that I decided to take HIST429Y with him. This class was much more difficult than 120, but it was very interesting and we were able to discuss topics in depth which was great. The readings can be hard to keep up with, but as long as you do 2 of them or are good at bs-ing in class you'll be fine. The papers are only based on that week's readings so don't worry about keeping up with each article in depth. The papers are long but not so difficult. I would recommend giving in a rough draft beforehand for him to look at so you can edit to make it what he is looking for. I'm a business major, and got A's on all of my papers.\n\r\nOverall, if you don't want to work, don't take his class. But if you're looking to learn a lot from an intelligent and attentive professor then I would highly recommend taking a class with Professor Borrut.", "rating": 5, "expected_grade": "A", "created": "2012-03-21T23:35:00Z"}, {"professor": "Antoine Borrut", "course": "HIST120", "review": "You can tell he loves the subject. He presents all of the information really clearly and is as balanced as possible. He's also really easy to talk to and is always willing to answer any questions. ", "rating": 5, "expected_grade": "A", "created": "2011-01-15T10:32:00Z"}, {"professor": "Antoine Borrut", "course": "HIST120", "review": "He is an awesome professor. He is also very approachable, responds back to emails quickly and is always there to help during his office hours. ", "rating": 5, "expected_grade": "", "created": "2009-11-05T01:10:00Z"}, {"professor": "Antoine Borrut", "course": "HIST120", "review": "This class is SUPER interesting. I think the structure of the class with prerecorded lecture videos taking the place of one class was effective, and I enjoyed that in-person classes only reviewed material from readings and videos. \r\n\r\nWith all of that said, there is quite a lot of reading assigned each week. You definitely do not have to do all of it to get As on every assignment, but the less reading you do as it is assigned, the harder the assignments become. I would not recommend taking this for the Gen-ed (as I did) unless you are very interested in the subject (like I am).\r\n\r\nThere are two quizzes, one paper, and three essays throughout the semester. I highly recommend going to discussions because you get points for participating, and the TA will go over the important parts of the primary sources during this time and you can just skim them in advance.", "rating": 4, "expected_grade": "", "created": "2021-12-26T22:18:32Z"}, {"professor": "Rachel Schine", "course": "HIST120", "review": "Dr. Schine was a great professor, and the class itself wasn't too difficult either. All of the assignments (which included a map quiz, definition quiz, midterm, and final paper) were graded fairly and related directly to the course material. As long as you put effort into the assignments, an A is definitely achievable. Dr. Schine's lectures were very easy to follow and contained a lot of interesting information. Attendance in lectures isn't crucial as she posts the slides to ELMS, but I would recommend attending still as she's a great lecturer, and attendance is taken for discussion. Dr. Schine is also very sweet and understanding, and very knowledgable about Islamic history, so I would definitely recommend taking her for this course.", "rating": 5, "expected_grade": "A", "created": "2023-01-07T08:53:10.885652Z"}, {"professor": "Rachel Schine", "course": "HIST120", "review": "She is a nice teacher and a nice human. She is super understanding regarding assignments but I needed that understanding because the structure of the class is not great. Lectures feel just like the teacher is talking at you and provided slides are super hard to follow and badly formatted. Many times I feel like I am behind in the class and truly just have to self study the material. Also, the structure of the class is weird and I am always confused on information such as structure of exams. Only interesting if you already have an understanding of Islamic history, otherwise it is hard to follow.", "rating": 3, "expected_grade": "", "created": "2023-10-02T16:22:28.186526Z"}, {"professor": "Rachel Schine", "course": "HIST120", "review": "Genuinely very nice but does not know how to teach students. Her slides have way too much information and literally looks like abstract art with pictures and long paragraphs in tiny font. She just talks for the full 50 minutes and expects us to be able to follow what's going on the whole time.  If you're gonna lecture the whole time, at least have slides that summarize main ideas. Assignments are easy enough to get a good grade, but anything I ever learned from this class I taught myself or learned in discussion with the TA (who is very knowledgeable and great in general).", "rating": 3, "expected_grade": "A", "created": "2023-10-02T16:24:12.551100Z"}, {"professor": "Rachel Schine", "course": "HIST120", "review": "This class is EASY AS HELL if ur Muslim. Took the class and only went to lecture like 5 times and still got an A+. Prof is super chill and supports Palestine too <3", "rating": 5, "expected_grade": "A+", "created": "2023-12-09T20:39:48.794413Z"}, {"professor": "Rachel Schine", "course": "HIST120", "review": "Dr. Schine speaks very quickly which makes the lectures a bit difficult to follow. She also assigns an impossible amount of reading for a 100 level history course. However, you don't really have to do the reading to do well in the class. Also, she does not take attendance at lectures.", "rating": 3, "expected_grade": "A+", "created": "2023-12-18T21:16:15.739285Z"}, {"professor": "Rachel Schine", "course": "HIST120", "review": "(Please approve this review, I am trying to share documents that will be useful to future students so they can make informed decisions like syllabuses I have no interest in spreading computer viruses)\r\n\r\nI took HIST120 : Islamic Civilization with Dr Rachel Schine and TA Tobin Johnson over Fall 2023.\r\n\r\nSYLLABUS: \r\n\r\nHere is our class syllabus: \r\nhttps://drive.google.com/file/d/1-NNgcVjCKmoeWvMdaGQWs8NrriOUxtRE/view?usp=sharing\r\n\r\nThis was a good class and I would take it again.\r\nIt was pretty interesting, Dr Schine was an excellent professor and Tobin Johnson was also an excellent TA.\r\n\r\nI took this class for the history minor because there is a requirement to take a course from at least two different geographic fields.\r\nBut it also gives some gen-ed requirements so you might want to look into that as well.\r\n\r\nHere is the history minor form: \r\nhttps://docs.google.com/document/d/1eptoRdAroUeR9dU3eAq3K2OKxhA5o7_a/edit?usp=sharing&ouid=115474565583495284649&rtpof=true&sd=true\r\n\r\nHere is also the list of all the different \"fields of study\" / how History courses at UMD get divided up into different courses and all that:\r\nhttps://drive.google.com/file/d/1rP2kWy1TuT8xZepXuHr3SHD0G38pjSlb/view?usp=sharing\r\n\r\nSo Islamic History is vastly different from the usual American History that I would take, so I took Islamic instead.\r\n\r\nOriginally I was going to take HIST111: The Medieval World with Christopher Halsted.\r\nI tried both classes and liked the subject matter, the TA, Dr Schine, the assignments, smaller class size more (the map quiz etc seemed easier than that class) so I took this class instead.\r\n\r\nInitially I was concerned about the workload before I added this class, but the workload was minimal and very easy.\r\n\r\nHere was the entire real workload: \r\n\r\nMap Exercise: 10%\r\nID Quiz: 10%\r\nMidterm: 25%\r\nTerm Paper: 35%\r\nParticipation: 20%*\r\n\r\n*BONUS READING: For extra credit (good for +5 points on any other assignment), at any point in the semester, read and write a 1-2 page reflection on Kevin van Bladel’s article, “A Brief History of Islamic Civilization from Its Genesis in the Late Nineteenth Century to Its Institutional Entrenchment” (https://www.middleeastmedievalists.com/wp-content/uploads/2021/01/UW-28-Van-Bladel.pdf) as it relates to our class.\r\n\r\nAttendance to lecture did not factor into participation, only attendance to discussion did.\r\nSo I stopped going to lecture, and only went to discussion.\r\n(Most other people also stopped going to lecture and did fine, Schine actually had to send out a message asking people to start coming to lecture again because attendance was so low).\r\nBasically for most of the semester this class only took up 50 minutes of my time every week, which was great.\r\n\r\nAll expectations of the class were highly reasonable (show up to Discussion and participate, submit things on time).\r\n\r\nThe TA Tobin Johnson was excellent and one of the best TAs I've had across all departments at UMD.\r\nExtremely knowledgeable, responded fast to emails, accommodating.\r\n\r\nDr Schine was basically so qualified and knowledgeable to teach this class, she was basically over-qualified.\r\nShe is fluent in Arabic so listening to her you will get all sorts of extra material because of her pronouncing things in the actual Arabic way.\r\n\r\nThe composition of this class as a whole was also great and beneficial, since it was Islamic history it attracted a lot of practising Muslims but also others who were just interested in ancient history and the history of religion.\r\n\r\nLaptops / technology was allowed in lecture and discussion.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T19:26:14.190496Z"}, {"professor": "Rachel Schine", "course": "HIST120", "review": "I absolutely adored Professor Schine's teaching style. I went into HIST120 not entirely sure what to expect (it was my second choice for a gen ed) and found that I had accidentally struck gold. If you're interested in history, even if you know nothing about the Islamic world, I can almost guarantee you will enjoy this class. Lectures are a solid 50 minutes of Professor Schine enthusiastically teaching you about that day's topic. She often had so much to say that we wouldn't finish the slides, but that was totally fine, because none of the assignments or exams relied on you being able to know every bit of information, and it never seemed like she was rushing any of the core aspects of the course. I personally loved just absorbing as much information as possible, especially when she would go on small tangents and give you fun facts. She is clearly passionate about teaching and enjoys lecturing, and is super friendly and approachable. Assignments and exams were never too hard (although they did involve some studying to be confident on), and the only part of the course I actively disliked was the term paper. Even that, though, was interesting in its own right, as I got to do research on a topic of my choice. Overall 10/10, will be looking to take a class with her in the future.", "rating": 5, "expected_grade": "A+", "created": "2024-01-30T22:04:31.202979Z"}], "department": "HIST", "course_number": "120", "name": "HIST120", "title": "Islamic Civilization", "credits": 3, "description": "Cross-listed with RELS120.\n<b>Credit only granted for:</b> HIST120 or RELS120.\nIntroduction to society and culture in the Middle East since the advent of Islam: as a personal and communal faith; as artistic and literary highlights of intellectual and cultural life; and as the interplay between politics and religion under the major Islamic regimes.", "is_recent": true, "geneds": null}