{"average_gpa": 3.341210795040116, "professors": ["Sharon Desmond", "Robert Feldman", "Sylvette La Touche-Howard", "Tracy Zeeger", "Mary Garza", "James Butler", "James Butler", "James Butler", "James Butler", "James Butler", "James Butler", "James Butler"], "reviews": [{"professor": "Sharon Desmond", "course": "HLTH391", "review": "Dr. Desmond is an amazing professor who really cares about her students and wants them to do well. She's very easy to talk to and she keeps the class entertaining. She has so much experience in the field so she knows what she is talking about and she can make the information clear by giving multiple examples. She is super funny and goofy, but that's what makes the class so entertaining! It's definitely one of those classes you actually look forward to attending because of her. Granted, her exams (1 midterm and 1 final) are pretty difficult because it doesn't just require memorization. You have to know your stuff and be able to apply it for any situation. Her exam format is multiple choice, short answer, fill in the blank and definitions, and 1 long essay. I suggest starting to study for exams WAY before the actual exam day. Other points (the health fair, poster presentation, timely topic, etc.) help make up for points though.", "rating": 5, "expected_grade": "", "created": "2012-01-31T23:03:00Z"}, {"professor": "Robert Feldman", "course": "HLTH391", "review": "Great professor! Makes material interesting.", "rating": 1, "expected_grade": "", "created": "2010-12-30T02:25:00Z"}, {"professor": "James Butler", "course": "HLTH391", "review": "Dr.Butler is truly one of the best professors I have ever had. He is very considerate about the circumstances in this pandemic & cares about all of his students", "rating": 5, "expected_grade": "", "created": "2020-12-08T17:43:53Z"}], "department": "HLTH", "course_number": "391", "name": "HLTH391", "title": "Making a Difference: Applying Community Health", "credits": 3, "description": "<b>Prerequisite:</b> SPHL100, HLTH124, HLTH140, HLTH200, HLTH230, EPIB301, EPIB315, BSCI170, BSCI201, and HLTH302. Students must have completed or be concurrently enrolled in HLTH364.\n<b>Corequisite:</b> HLTH420 and HLTH490.\n<b>Restriction:</b> Must be in a major within the SPHL-Behavioral and Community Health department.\nThe exploration and application of community health concepts including theoretical models, advocacy, cultural competency, asset mapping, and needs assessment. Includes planning, implementing and evaluating a community health program with a designated community partner.", "is_recent": true, "geneds": null}