{"average_gpa": 3.492204899777283, "professors": ["Robert Gold", "Sandra Saperstein", "Amara Channell Doig", "Olivia Kachingwe", "Azieb Kidanu", "Amara Channell Doig", "Amara Channell Doig", "Azieb Kidanu", "Olivia Kachingwe", "Melissa Coaxum"], "reviews": [{"professor": "Amara Channell Doig", "course": "HLTH264", "review": "Very sweet professor. Gives great feedback on the semester-long project and other assignments. Also listens to your concerns for the class.", "rating": 5, "expected_grade": "A", "created": "2019-12-21T18:10:38Z"}, {"professor": "Olivia Kachingwe", "course": "HLTH264", "review": "A nice professor and approachable but she can be a ~slightly~ hard grader. For example, my group would be very detailed in our social media project but she would take off points if she didn't understand something. Most parts of the project should be graded on completion (even though my group would put in a lot of work and detail in each part to get full points) but then she would take off points for something that is not really worth taking off points esp. since it did not take away from the purpose/main idea of the assignment. I believe she got better at not taking points off as the project/semester continued.\r\n\r\nShe teaches this class with Amara and they created a midterm and a final for this class (I signed up for this class because a former teacher for this course didn't have either or/and I heard it was super easy). Both were slightly hard (you have to memorize a lot of terms that you'll never use in the future) but they curved both of the exams. Honestly, the semester long project and the final vlog/presentation should have been counted as our final.", "rating": 4, "expected_grade": "A", "created": "2019-12-21T18:19:58Z"}, {"professor": "Amara Channell Doig", "course": "HLTH264", "review": "Wonderful professor that seems to care for her student's success. The class was very engaging and interesting, and bulk of it involved creating a social media campaign within a small group of your choice on a public health issue. I learned a lot, and would definitely recommend this gened to anyone who is interested in social media!", "rating": 5, "expected_grade": "A", "created": "2023-01-16T21:49:39.101149Z"}], "department": "HLTH", "course_number": "264", "name": "HLTH264", "title": "Tweets & Likes: Digital Health & Social Media", "credits": 3, "description": "<b>Restriction:</b> Must not be in the Community Health program.\nExamines the current and potential use of digital health and social media to influence public health. Provides an overview of knowledge, skills and terminology necessary to optimize the effectiveness of these technologies to contribute to the enhancement of individual and community health.", "is_recent": true, "geneds": null}