{"average_gpa": 3.685737976782754, "professors": ["Dina Borzekowski", "Juliette Christie", "Sacha St-Onge Ahmad", "Dina Borzekowski", "Dina Borzekowski", "Dina Borzekowski", "Sacha St-Onge Ahmad", "Sacha St-Onge Ahmad", "Sacha St-Onge Ahmad"], "reviews": [{"professor": "Dina Borzekowski", "course": "HLTH234", "review": "Professor Borzekowski is easily the best teacher I have had at UMD. Not only is she one of the most genuinely nice people I have ever met bet is super passionate about what she teaches. She makes an effort to get to know each student individually. At the beginning of the semester she stressed to us not to worry about our grades and to instead try to learn and take away something from the class and that is exactly what I did. Lectures can sometimes get boring but she does let us out early almost every class. Highly recommend to ANYONE.\r\n\r\nPS: She bought lunch for me and a friend when we had a meeting for which she wanted to get to know us better and also offered to buy us ice cream at the end of the semester.\r\nSuper Awesome Professor!!!", "rating": 5, "expected_grade": "A", "created": "2019-08-22T22:07:12Z"}, {"professor": "Dina Borzekowski", "course": "HLTH234", "review": "Reviews for Dr. B were somewhat misleading. I expected to see \"the best teacher I have had at UMD,\" yet I was absolutely relieved when the semester ended. College classes should be challenging, but this class was unnecessarily stressful. While I got an A+, I dreaded going to class each week. Also, HLTH234 is centered around a SEMESTER-LONG group project. Make of that what you will...", "rating": 3, "expected_grade": "A+", "created": "2021-06-21T20:56:34Z"}, {"professor": "Dina Borzekowski", "course": "HLTH234", "review": "She said when we started the class \"I'm going to treat you like grad students\" Ma'am I am a whole freshman please don't. Class revolved around a huge, tedious, research-based group project. I enjoyed it a lot as a bio major! I got lucky with mostly good groupmates and enjoyed my project topic. She was very lenient with grades. I told her \"I've had a bad week-\" and she interrupted me then gave me a week extra on an essay. If you're a bad essay writer though, don't take this class, the 5 big grades are essays between 800-600 words long on a topic you have to research on your own. If you're worried about the length of the class, she'll always let you out early. She brought snacks when she could, and gave detailed feedback on assignments. The class was unnecessarily stressful, but having her as a professor made it a little more okay. ", "rating": 4, "expected_grade": "A-", "created": "2022-01-11T02:32:16Z"}, {"professor": "Dina Borzekowski", "course": "HLTH234", "review": "Dr.B is really sweet and really cares about her students!  She takes you out for coffee or ice cream just to get to know you, and you get points for going!  She is a very experienced and established woman and really knows what she is talking about!  The class revolves around a group project but you can BS most of it and get away with it.  Hand in assignments on time for the project and individual assignments and you should be fine!  She's really chill, fun, and understanding!  I like taking a class with her but I don't particularly love the class.  Also apparently this class fulfills 3 gen-eds which is awesome!!  I give Dr.B a rating of 5, but I am bringing it down a notch just because of the class itself.  If you're going to take this class, I think that Dr.B would be a great choice!", "rating": 5, "expected_grade": "A", "created": "2022-04-14T20:12:31Z"}, {"professor": "Dina Borzekowski", "course": "HLTH234", "review": "She is a nice professor but likes to brag about her life a lot. She wasn't too tough of a grader and did provide insightful feedback. The semester long project is kind of a pain and can be annoying if you get a bad group but overall was easy to just BS. Class never was the full time slot and we always ended early. I  would suggest using the class note sheets she makes every class and you will do well on the final.", "rating": 4, "expected_grade": "A+", "created": "2022-12-12T14:38:11.391487Z"}, {"professor": "Dina Borzekowski", "course": "HLTH234", "review": "Nice teacher but she does brag a lot. If you do your work and attend class it honestly is an easy A. She says almost everyone gets an A or B for the course. The semester long project is kind of annoying and pointless in my opinion, but is easy to BS and fine with a good group. Class was never the full time slot either.", "rating": 4, "expected_grade": "A+", "created": "2022-12-12T14:47:59.885566Z"}], "department": "HLTH", "course_number": "234", "name": "HLTH234", "title": "Global Health Messages: Understanding Exposure & Impact", "credits": 3, "description": "<b>Restriction:</b> Must not be in the Community Health program.\nUsing a global perspective, this course teaches students to be critical consumers of current and historical health communication interventions. It also provides students with the skills to develop media interventions that target specific and general populations. Students will discover the array of diverse media messages that influence the health and well-being of individuals and communities.", "is_recent": true, "geneds": null}