{"average_gpa": 3.606666666666667, "professors": ["Cy Keener", "Cy Keener", "Alyssa Ryan", "Cy Keener"], "reviews": [{"professor": "Cy Keener", "course": "IMDM150", "review": "Extremely interesting professor who is super knowledgeable about his field. He is really accommodating and wants his students to succeed. IMDM150 was pretty discussion based and Cy created a really welcoming environment where people felt comfortable participating. I'm definitely glad I got to have him. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-20T03:04:16Z"}, {"professor": "Cy Keener", "course": "IMDM150", "review": "He has a lot to say. Very knowledgeable man, and a not-too-harsh grader compared to his co-instructor. He is pretty approachable and accommodating, and although I disliked the annotating rules on Perusall, I guess it helped me in the class. Discussions in class are pretty boring and you WILL inevitably fall asleep if you sit in the back, so just sit in the front and interact with the activity slides lol . Overall, Kenner himself is a nice guy, but the class can use some innovating. I know many aspiring IMD majors who took this class and dropped the major like a hot potato :')", "rating": 4, "expected_grade": "A-", "created": "2023-05-26T06:30:35.992565Z"}, {"professor": "Cy Keener", "course": "IMDM150", "review": "Cy is a very laid back professor, forgiving and kind, but as always be communicative of your needs. I had him for IMDM150, and in class we had great conversations on the reading material and state of tech. Class time and such meaningful discourse were greatly aided by the two TAs Charlotte Richardson-Deppe and Maggie Letvin. To succeed: get on Perusall (the reading platform) early and be engaged with the course content. There are very few actual assignments, so just stay up to speed. Glhf", "rating": 5, "expected_grade": "A", "created": "2023-06-08T13:14:36.211777Z"}, {"professor": "Cy Keener", "course": "IMDM150", "review": "Definitely knowledgeable about his field but overall a semi-boring class depending on the person. It's described as the 'English course' of the IMD major so take that as you will. Super easy and some of the material read is interesting. The whole class structure is to do the readings, discussion about the readings, do a project unrelated to the readings, then rinse and repeat.", "rating": 5, "expected_grade": "A", "created": "2023-06-21T05:59:09.826423Z"}, {"professor": "Charlotte Richardson-deppe", "course": "IMDM150", "review": "A very nice person. You can't really go around bsing with her though; she will take points off.", "rating": 4, "expected_grade": "A", "created": "2023-10-08T20:55:56.030409Z"}], "department": "IMDM", "course_number": "150", "name": "IMDM150", "title": "Digital Media Theory and Culture", "credits": 3, "description": "<b>Restriction:</b> Must be in the Immersive Media Design program.\nAn introduction to the fundamental structures and themes of digital culture in contemporary society. This course will provide you with a theoretical grounding in which to understand the current landscape of digital media culture, design and art. As an introductory course for the Immersive Media Design major, the focus will be on contextualizing immersive digital media such as virtual reality, augmented reality, immersive projection, and electronic art installation through reading, writing and discussion. Students will have opportunities to experience a range of these technologies first hand.", "is_recent": true, "geneds": null}