{"average_gpa": 3.7039189900052607, "professors": ["Anthony Pagnotti", "Edward Priola", "Jim Golden", "Jo Ellen Barnhart", "Gerald Powell", "Eric Dunning", "Amy Fisher", "Robert Ballenger", "Michelle Molinaro", "Kristen Willett", "Glori Hyman", "Nina Latassa", "Samuel Rubin", "Heather McHale", "Larisa Cioaca", "Chelsea Mays-Williams", "Shala Larson", "George Kurtzweil", "David Gormong", "Lori Sefton", "Amy Fisher", "Chelsea Mays-Williams", "David Gormong", "Eric Dunning", "George Kurtzweil", "Heather McHale", "Lori Sefton", "Robert Ballenger", "Samuel Rubin", "Amy Fisher", "Chelsea Mays-Williams", "David Gormong", "Eric Dunning", "George Kurtzweil", "Heather McHale", "Lori Sefton", "Robert Ballenger", "Samuel Rubin", "Amy Fisher", "Chelsea Mays-Williams", "David Gormong", "Eric Dunning", "George Kurtzweil", "Lori Sefton", "Robert Ballenger", "Samuel Rubin", "Amy Fisher", "David Gormong", "Eric Dunning", "Amy Fisher", "Amy Fisher", "Chelsea Mays-Williams", "Amy Fisher", "Chelsea Mays-Williams", "David Gormong", "Eric Dunning", "George Kurtzweil", "Lori Sefton", "Robert Ballenger", "Samuel Rubin", "David Gormong", "Amy Fisher", "Chelsea Mays-Williams", "David Gormong", "Eric Dunning", "George Kurtzweil", "Lori Sefton", "Robert Ballenger", "Samuel Rubin", "Amy Fisher", "Chelsea Mays-Williams", "David Gormong", "Eric Dunning", "George Kurtzweil", "Lori Sefton", "Robert Ballenger", "Samuel Rubin"], "reviews": [{"professor": "Eric Dunning", "course": "INAG110", "review": "Entertaining and very reasonable workload", "rating": 5, "expected_grade": "A", "created": "2018-04-05T01:45:37Z"}, {"professor": "Edward Priola", "course": "INAG110", "review": "GOAT professor of my time at UMD so far. Effectively teaches the content and is a cool guy. He can seem a bit strict at times and will poke fun at students but he does it to everyone and it's always in kind faith. Definitely a good option for a comms class.", "rating": 5, "expected_grade": "A-", "created": "2018-04-17T02:38:22Z"}, {"professor": "Anthony Pagnotti", "course": "INAG110", "review": "Best teacher ever. Really clear about what he wants.", "rating": 5, "expected_grade": "A+", "created": "2018-04-17T03:39:03Z"}, {"professor": "Kristen Willett", "course": "INAG110", "review": "Dr. Willett is a lovely person and a good teacher who does a wonderful job engaging the class. I hate public speaking but Dr. Willett makes it bearable.", "rating": 5, "expected_grade": "", "created": "2018-04-25T14:37:46Z"}, {"professor": "Jo Ellen Barnhart", "course": "INAG110", "review": "What you came to read: \r\nHer class is really easy and straightforward. Easy grader. Easy A. Low workload. Speeches not difficult but still need preparation. Important participation points for going to classes.\r\n\r\nWhat you should also know:\r\nDr. Barnhart is one of the kindest and genuine professors I've ever had. She really creates a warm and friendly atmosphere in her class which makes it enjoyable to go to. Classes are actually fun, interesting, and enjoyable. Her class doesn't make you want to kill yourself like many other classes. One of the best professors I've ever had and highly highly highly recommend. ", "rating": 5, "expected_grade": "A", "created": "2018-05-08T06:49:58Z"}, {"professor": "Anthony Pagnotti", "course": "INAG110", "review": "dope af", "rating": 5, "expected_grade": "A-", "created": "2018-05-16T19:36:08Z"}, {"professor": "Edward Priola", "course": "INAG110", "review": "Very strict and most days seems to pull facts out of thin air (statistics, studies, etc.) just to back up some claim he made. Made us take a rather difficult midterm and final, which were all from the textbook. If you don't want to read the textbook cover to cover, I would not recommend this professor.", "rating": 3, "expected_grade": "A", "created": "2018-12-11T23:15:17Z"}, {"professor": "Jo Ellen Barnhart", "course": "INAG110", "review": "Probably the easiest A ever. The speeches are straightforward, even if you have difficulties public speaking she cares about you and does not grade harshly. As long as you try your best you will get an A on the class.", "rating": 5, "expected_grade": "A+", "created": "2018-12-13T16:03:37Z"}, {"professor": "Edward Priola", "course": "INAG110", "review": "As long as you come to class, participate, and practice your speeches, you will earn an A. As a professor, Ed is much stricter than other comm teachers and assigns a lot more. However, he is fun-loving guy and enjoys what he does. ", "rating": 4, "expected_grade": "A", "created": "2018-12-15T20:51:22Z"}, {"professor": "Edward Priola", "course": "INAG110", "review": "Well worth the credit. Don't be mistaken you'll have to work for an A but the skills you get while going for an A are invaluable! Highly recommend. ", "rating": 5, "expected_grade": "A-", "created": "2018-12-17T19:53:26Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Easy class. Good teacher. Fair grader", "rating": 5, "expected_grade": "A", "created": "2018-12-22T17:04:31Z"}, {"professor": "Michelle Molinaro", "course": "INAG110", "review": "What can I say its a silly, easy class that most people only take for the comm credit. It's been a year and I genuinely have forgotten everything I learned when taking it. If I ever need to put into practice communication skills in any setting I can just watch a youtube video or read a book instead of wasting my money on a class like this.", "rating": 1, "expected_grade": "B+", "created": "2019-01-24T15:36:23Z"}, {"professor": "Michelle Molinaro", "course": "INAG110", "review": "Perhaps the greatest professor I've ever had at UMD. Her lectures are interactive (as opposed to most) which kept me engaged with the material. The bulk of the grades were based on speeches instead of remembering definitions and principles. She graded speeches fairly and gave genuine feedback which dramatically helped my public speaking ability", "rating": 5, "expected_grade": "A", "created": "2019-04-25T00:42:28Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Eric Dunning is absolutely the best professor to take for INAG110. His lectures are fun, and if you have him on Tuesday/Thursday for the hour and fifteen minute time, you will always get out early. He likes to come in, get things done, and get out. \r\n\r\nThere are a lot of in-class exercising that are simple, goofy and fun to help with public speaking and speech structure skills. His grading of speeches is straightforward and he will always give you feedback if you want it. The lowest grade on any speech in my class during the semester was a 92, so you will do well.\r\n\r\nHe does have a midterm and a final, which are basically extra points, They are based on the chapters from the book which are super simple and it is basically a glorified vocab test. Most people studied the day or or the night before and did great.\r\n\r\nHe does have pop quizzes for the readings, so going to class is important, but you can also predict when they are going to be, but class is fun so you might as well go. For the pop quizzes, if you look over the vocab at the end of the chapter right before class, you will be set.", "rating": 5, "expected_grade": "A+", "created": "2019-05-07T14:38:41Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is a treat. Possibly one of the best instructors that I have had. He is also very willing to help on his time if you need it. Definitely recommend him.\r\n\r\nThe course should be a fairly easy A as long as you prepare for the exams and rehearse your speeches. Remember eye contact! that gets a lot of people.", "rating": 5, "expected_grade": "A", "created": "2019-05-12T18:48:03Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Very easy grader when it comes to speeches. He gives pop quizzes, often at very inconvenient times (for our semester, he gave a pop quiz before the midterm, and after the midterm), so make sure that you're ready for those. The quizzes are just vocab, so if you read through the chapters, and learn the vocab, you should be fine (he pulls from headers and bolded words FYI). I ended up getting caught off-guard by a couple quizzes, so if you find yourself in this situation, Dunning will give extra-credit if you wright an essay for him, so it's still not so bad. Otherwise, he's very engaging and fun to take, so I highly recommend", "rating": 5, "expected_grade": "A", "created": "2019-05-26T23:09:07Z"}, {"professor": "Jo Ellen Barnhart", "course": "INAG110", "review": "What a lovely person. Possibly the nicest professor I have met on this campus. One of the only Gen-Eds I have taken where I felt that I actually learned a lot and was able to get an easy A. Barnhart is an angel; if you get the opportunity definitely take her class.", "rating": 5, "expected_grade": "A", "created": "2019-05-27T21:20:08Z"}, {"professor": "Edward Priola", "course": "INAG110", "review": "You must attend every lecture (obviously) and don't be surprised if he calls on you during class. You should be fine if you read ahead and memorize key terms from every chapter. The midterm and final are quite easy if you skim the entire book. For presentations, I'd recommend rehearsing your speech as much as possible. ", "rating": 5, "expected_grade": "A", "created": "2019-06-09T21:50:37Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "I hate public speaking but George is able to make class fun and relaxed. He also manages to make the content interesting. Great teacher and easy grader!!", "rating": 5, "expected_grade": "A", "created": "2019-09-19T23:03:03Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is pretty quirky but makes our class really fun and chill. Easy grader, speeches are the biggest grade but he gives out tons of other points with little writing assignments every week. Def take his class if you get the chance its the easiest way to get through that comm get ed", "rating": 5, "expected_grade": "A", "created": "2019-10-07T05:31:11Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Professor Mays-Williams is great. For one, she don't want you to fail the class. She tells you the first day of class what you need to do to get an A. She's very fair while grading the speeches and if you ask her she'll explain how you can improve.\r\nShe loves, loves, loves participation in class. I think it makes a bit sad when we don't participate. She keeps the class interesting with little games sometimes. I really don't like public speaking but prof mays makes the class bearable.\r\nAll in all, i'll advice everyone to take her class.", "rating": 5, "expected_grade": "", "created": "2019-11-26T16:36:05Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "He is literally the most thoughtful human being ever and he actually cares about his students. Class was always engaging and I was so grateful to have had him for INAG110. Take a course with George!!!!", "rating": 5, "expected_grade": "A+", "created": "2019-12-18T13:52:33Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "TAKE THIS PROFESSOR! He is so nice and makes public speaking easy even though I hate it. He grades easy and is so fun. You will not regret taking this for you OC gen ed.", "rating": 5, "expected_grade": "A", "created": "2020-01-27T04:21:29Z"}, {"professor": "Jo Ellen Barnhart", "course": "INAG110", "review": "MUST TAKE IT WITH HER! She has become my favorite teacher and she is absolutely amazing, she is an angel. There are really less professors who would genuinely care about you and would want you to do well. She is very lenient, I messed up one of my speeches and had anxiety, she let me retake my speech she is that nice. I am so glad i got take it with her. \r\nAlso go to her Office Hours just to talk, she is my go to person to talk to whenever I feel low. ", "rating": 5, "expected_grade": "A", "created": "2020-04-02T13:46:23Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "The class is easy, but she is not really a good teacher. She is extremely vague on assignment details/due dates and often contradicts herself. It also seems like she constantly just pulls assignments out of her ass, as a lot of them are assigned last minute and don't make much sense. That being said, it is still easy to get an A, especially if you know how to b.s. for those stupid assignments or when she calls on you in class discussion.", "rating": 2, "expected_grade": "A", "created": "2020-04-05T17:47:53Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "This course comes with an easy A and a little bit of insanity. I'd say Sam is sort of crazy.", "rating": 4, "expected_grade": "A-", "created": "2020-05-05T04:07:16Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam can be aggressive at times. But if you can handle that, this class should be an easy A assuming you're putting in the work.", "rating": 4, "expected_grade": "A-", "created": "2020-05-06T19:51:00Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "To her credit, Prof. Mays-Williams is very kind and seems very knowledgeable about the content of the textbook she teaches. However, to put it simply, she is not good at teaching. She often gives incredibly vague instructions for assignments, and when asked to clarify, either gives a more confusing answer or contradicts herself. Also, she very clearly pulls assignment ideas out of thin air, which results in a lot of our assignments being not well thought out and therefore tough to complete properly. That being said, if you're willing to just keep your head down and power through the confusion, it's not very difficult to get a good grade.", "rating": 1, "expected_grade": "A", "created": "2020-05-07T23:46:58Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "I thought this class was going to suck but George actually made it fun. Fair grader and super nice guy", "rating": 5, "expected_grade": "A+", "created": "2020-05-15T19:02:38Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Mays-Williams is such a caring and nice professor and really fun to talk to! Her assignments can be a little confusing but she's an easy grader. ", "rating": 5, "expected_grade": "", "created": "2020-09-03T01:51:50Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "The other reviews are right in saying that Mays-Williams has pretty confusing assignments/instructions sometimes but our discussions in class are always interesting and she's an easy grader. I'd advise you to take this class if you're willing to power through the confusion of the assignments and she's a really understanding and nice person! ", "rating": 4, "expected_grade": "", "created": "2020-10-06T22:57:34Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is absolutely, without a doubt, the most amazing instructor I've ever had (and I'm a senior)!  You will NEVER be bored in his class and you'll learn things that will follow you through your whole life!  He's available to help 24/7 and wants everyone to succeed.  Take his class and have the time of your life!  You won't regret it!", "rating": 5, "expected_grade": "A", "created": "2020-10-25T15:52:27Z"}, {"professor": "Michelle Molinaro", "course": "INAG110", "review": "Michelle was a great professor for this class. I took this course to get the comm credit and was expecting it to be really boring, but Michelle knew most of us were in that boat and tried to keep the material engaging. Most of your grade comes from your speeches and she is a pretty fair grader who gives helpful feedback for you to improve next time. She's approachable and normally very nice in office hours as well. ", "rating": 4, "expected_grade": "A", "created": "2020-11-02T20:26:39Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is amazing and one of the most caring teachers I have had. Warning: He has no filter and makes some off-colored jokes but they are all with good intention so if you can handle that then go for it. He invites his class every year to his house for thanksgiving in case they have nowhere to go. 100% Reccomend", "rating": 5, "expected_grade": "A", "created": "2020-11-11T13:46:32Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "Great teacher and very easy grader. The workload is also extremely light. Best way to get gen ed credit. ", "rating": 5, "expected_grade": "A+", "created": "2020-11-15T07:11:35Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Dr. Dunning is a really chill professor. He's laid back, a little funny, and seemed to adapt well to online learning. There isn't much work in the class, but you do have to read the textbook, or at least skim it, as there are pop quizzes based on the reading. If you have to take an FSOC class(which you do), I wouldn't tell anyone not to take him.", "rating": 5, "expected_grade": "A", "created": "2020-11-19T02:31:50Z"}, {"professor": "Shala Larson", "course": "INAG110", "review": "She's a great professor and she doesn't grade harshly. She's very straightforward with her assignments and there are a couple of chapter quizzes and weekly discussions. However the exams and quizzes are open note so it's easy. \r\nShe gives very detailed feedback for oral speeches and all the speeches are extemporaneous style with just an outline. I definitely recommend her for this course. ", "rating": 5, "expected_grade": "A", "created": "2020-12-15T00:41:51Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "He's pretty wild, but leads an extremely enjoyable class if you're able to handle his insanity. Everyone grew to love him and everyone in the class gets to know each other well. Unlike any other prof I've had!", "rating": 5, "expected_grade": "A+", "created": "2020-12-19T16:31:33Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "She is not a very effective teacher in that, because of COVID, we didn't have any lectures and she didn't do a great job explaining assignments before they were due. I got most of my answers from the class groupme instead of from the Professor, which is not great, but it is also not a very hands on class.\r\nI took this class with her because the grading distribution was good and I thought I could just get an easy A for my GenEd. That's exactly what happened. The discussions are definitely interesting, but she was not too involved in them except asking a few questions. There are only a few assignments, she is an easy grader, and generally it is not hard to get a good grade in the class with a medium amount of effort. I'd recommend for anyone looking to knock out their oral comm credit ", "rating": 3, "expected_grade": "A", "created": "2020-12-20T04:25:45Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Very relatable and nice professor that gives an expected workload. She sometimes has miscommunications about assignment due dates and grading, but aside from that, I would recommend her for INAG110.", "rating": 4, "expected_grade": "", "created": "2020-12-27T19:19:42Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "Very fun class, we didn't meet that often and it was a very light load. George is also a very fair teacher.", "rating": 5, "expected_grade": "A", "created": "2021-01-11T22:24:42Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Absolutely crazy dude, in the best way. Sam managed to give an online class the feel of an actual in-person class, proving that you don't need to be insanely tech-savvy to pull off online teaching if you care and are willing to put in the work. He does make some not so politically correct comments, though, so if that bothers you, maybe stay away.", "rating": 5, "expected_grade": "A+", "created": "2021-01-12T03:07:24Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Great guy and professor. I felt like I learned a lot from his class, and he made the class engaging and interactive. He's a bit tougher grader than some other OC professors (a.k.a. you're going to have to work a bit for your grade) but the payoff is a great speech learning experience. Would def recommend his course", "rating": 5, "expected_grade": "A", "created": "2021-01-12T17:21:14Z"}, {"professor": "Shala Larson", "course": "INAG110", "review": "Overall she's a very nice and good professor. If you take her class you can definitely get an A. She gives good feedback on speeches and is a fair grader. However, for the first few weeks it was hard to find the zoom links and sometimes the discussion posts wouldn't be posted until a day or two before the due date. Again, overall she's a good professor, but a bit unorganized at times.", "rating": 4, "expected_grade": "A-", "created": "2021-01-16T22:00:25Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Are you tired of boring professors that put you to sleep?  Do you finally want to get over your fear of public speaking?  If so, then fasten your seatbelt and get ready for the experience of a lifetime!  Sam is a one-of-a-kind instructor--he is energetic, engaging and over the top hilarious (he is also an easy A)!  Best of all, you will get to know everyone in the class!  100% recommended--take him! ", "rating": 5, "expected_grade": "A", "created": "2021-01-20T18:47:31Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Prof. Ballenger handled online classes and teaching very well. He is very approachable during and outside of class. The speeches make up the majority of the grade with a few participation assignments. He grades pretty fairly and gives constructive comments for improvement. This class is one of the few ones I enjoyed during Zoom University. ", "rating": 5, "expected_grade": "A", "created": "2021-04-28T02:33:45Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Fantastic professor and a fantastic person. Super high energy and makes online zoom classes something to look forward to. I personally struggle with social anxiety and doing oral presentations and I feel much more confident and comfortable after taking INAG110 with Sam. Super funny and understanding and I can only imagine how much more fun his class would be in person compared to online. The class should be an easy A if you prepare well for the speeches. Absolutely recommend his class!", "rating": 5, "expected_grade": "A+", "created": "2021-05-04T17:33:43Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "Dr. Fisher is great!! Apart from the speeches there is very little work. She is extremely lenient with grading which makes public speaking less stressful. She's also a good lecturer so class was usually interesting.", "rating": 5, "expected_grade": "", "created": "2021-05-21T17:15:09Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam's alright. He can be aggressive, and repeats the same jokes, which can get annoying. Final grade comprised of informative, persuasive, and professional speeches, three exams, and a bunch of reading quizzes that can be completed by skimming the text. Prepare for speeches and use feedback Sam and your classmates give, and you should be fine.", "rating": 4, "expected_grade": "A", "created": "2021-05-25T22:14:36Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "There is no way to describe a class this incredible!  You must go through it yourself to fully understand how engaging and unique it is.  Of all my courses, this is the one where I learned and grew the most.  I also finally got to know everyone in there.  If you want an unforgettable experience that will change your life, Sam is your man!  100% recommend!", "rating": 5, "expected_grade": "A", "created": "2021-05-27T03:31:31Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Very easy class, but quite boring if I'm being honest. It was so formal for a public speaking class with very silly assignments. There was so much emphasis on outlines which is kinda weird I guess. Very easy but if you can take someone more exciting then I would.", "rating": 3, "expected_grade": "A", "created": "2021-06-01T16:54:26Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Genuinely nice teacher. Class is easy, small, and engaging. Everyone feels like they have a personal relationship with this professor. It is a fun class and an easy A. You give 4 speeches and take a midterm and a final. The textbook readings are simple, I just listen to the audio version from a PDF file. The midterm average was an A too. Definitely a nice relief from the giant lecture halls. She also provides great feedback on your speeches and helps you structure them well. ", "rating": 5, "expected_grade": "A+", "created": "2021-10-25T14:37:31Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Very kind and helpful professor. The class consists of 4 major speech presentations, a midterm, and a final. The class itself is small and you get to know everyone well which is nice. There is a minimal amount of homework, the main homework comes from reading basic chapters, and at times completing reflections. The class is very beneficial and fairly easy. I would definitely recommend this professor to everyone. ", "rating": 5, "expected_grade": "A", "created": "2021-11-30T21:42:19Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "He is a must-take for this course. He made every class engaging while still holding us to a standard. He is also very chill about most things. Definitely recommend his course!", "rating": 5, "expected_grade": "A", "created": "2021-12-02T01:35:27Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "I really enjoyed taking this class with George. He is super chill, and managed to make the class super enjoyable! The class is not too much work either. I would definitely recommend that you get your communication gen ed credit with him!", "rating": 5, "expected_grade": "A", "created": "2021-12-07T20:26:40Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "This is literally the worst teacher I've ever had. He completely invalidated my thoughts and opinions 100% of the time and treated me with blatant disrespect in front of my class. Do not under any circumstances take INAG with him.", "rating": 1, "expected_grade": "A+", "created": "2021-12-09T01:08:32Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "Amazing teacher. I didn't think one of my favorite classes would be a subject I generally hate, but George made it really nice. He's super chill, super funny, and just generally makes class enjoyable. The workload for the class is pretty light, pretty much the only big thing is the actual speeches. There are some occasional reading checks that are basically free points. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-09T22:50:59Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is a very fun, kind, and relaxed professor. Our class always had a very light workload under him and for the few assignments we did get, he was a very fair grader (in my opinion, you'll really have to try to fail in order to get a bad grade in his class). Prof. Kurtzweil always let our class out early and was very understanding when it came to having to reschedule assignments.\r\n\r\nIf you have the option to, TAKE GEORGE KURTZWEIL!\r\nYOU WILL NOT REGRET IT!!!", "rating": 5, "expected_grade": "A+", "created": "2021-12-11T20:23:41Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Since this was his first semester teaching at this university, he followed the curriculum that he was given rigorously and did not allow much leeway. We have 5 total speeches (4 individual, 1 group - tho this speech was a breeze). While he knows his stuff, he is kind of boring. He does not post his PowerPoint online as he believes this will cause students to slack off in his class. You are expected to take notes by hand unless you are excused by UMD to use an electronic device. What I found most annoying was two things. He gives pop quizzes on the occasion and while they are worth 5 points, they can be unexpected and hurt your grade a little bit. The other thing is that when you are giving a speech, and you go even a second above or below the time limit, he will deduct 3 points from your final grade. If you are giving a speech worth 50 points, those 3 points mean the difference between a letter grade. Plus when you are giving a speech, you have no way of knowing the time so you really have to practice to get within a certain time frame. I will say, he did not grade that harshly on speeches and he is approachable if you have a problem. He is a nice professor and you will learn a lot in this class. You get weekly reading quizzes which aren't too difficult, and a weekly video response which if you put the minimal work in on those, you will get 5/5. There are definitely better professors out there for this course, but Professor Gormong is new so he is getting used to the culture here at UMD. ", "rating": 3, "expected_grade": "A", "created": "2021-12-12T20:33:19Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Pros: \r\n1.) Friendly & easy to approach. He smiles a lot and respects his students. He's not one of those professors who would stare at you blankly if you told a joke.\r\n2.) You can tell that he's very passionate and enthusiastic about the subject that he teaches. If a professor hates their job, the students probably will hate the subject.\r\n3.) His assignments are very easy.\r\n4.) Lenient on grades for speeches. \r\n5.) When you're presenting your speech, he gives his full, undivided attention and occasionally nods (which personally makes me feel less nervous).\r\n\r\nCons\r\n1.) Speeches are worth 60% of your grade so if something random occurs and you miss any...you're pretty much doomed. I know this class is supposed to prepare you for public speaking, but even 40% would be reasonable. The midterm and final need to be worth WAY more. Or maybe he can incorporate other assignments...for example projects. \r\n2.) Though his assignments are easy, with other classes college can be overwhelming. There is no leeway for late work at all. You don't even get 50% of the credit. \r\n3.) I never understood why we couldn't have electronics in class (even for notes). We're adults. If someone gets carried away on Instagram, that's their problem.\r\n4.) Pop quizzes\r\n\r\n", "rating": 4, "expected_grade": "", "created": "2021-12-14T03:03:50Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "simply the coolest. take him at all costs, take the course later if you have to. the only dull parts of his class are the ones that is explicitly shoved down his throat by the curriculum. he is the man!", "rating": 5, "expected_grade": "A", "created": "2021-12-15T20:19:39Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "This professor is very nice tho a bit awkward at times. I feel like someone else perfectly summarized his teaching style but let me reiterate that he is new and because of this I feel like it is the reason for why he is so strict on following the curriculum to a tee. One thing that did make me hesitate to give him a higher score was that he does give pop quizzes sometimes, although on some of them, he allows you to collaborate with your fellow peers. However, twice he gave a matching quiz and once you get one wrong, you basically get two wrong and these five points, although small, can have a huge impact on someone's grade. I feel that he is a lot more harsh than some of the other INAG professors I've heard about from my friends when it comes to grading your speeches. He really cares about your movements in your speech, along with your hand gestures and make sure you practice at least two nights in advance because he will take off points if you look at your note cards too much. Other than the speeches, I feel that the other assignments are just busy work and can be completed in thirty minutes or less. He doesn't allow electronics but people in my class constantly go on their phones and he doesn't say much about it (this didn't really bother me because I have other classes that also don't allow electronics but it might be an issue for someone who doesn't like to write out their notes). He really does care about his students and their opinions but also just making sure that all of us understand the content that he is presenting. As long as you work hard, prepare well for each speech, and listen to/attend class lectures (also he does not post his powerpoint slides or recordings of his class lecture because he thinks this will make his students think they can just skip his class), it should be easy to get an A in his class. ", "rating": 4, "expected_grade": "A", "created": "2021-12-17T05:49:54Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is the best professor I've had this semester as a Freshman here at UMD. As long as you treat George with respect, he'll respect you. Not only is he hilarious, he's more than fair with his grading and wants to give every single one of his students a chance to succeed. \r\n\r\nIf you have to take INAG and can take his course, please do so. The workload is light and he is willing to work around YOUR schedule. Not many other professors are willing to make amends, especially if you missed a speech or need to move it to another day. He is one of the few professors that understands that we as students have our own struggles and schedules; his course bottoms out towards finals with practically no work. \r\n\r\nGeorge is a champ. You'll probably love his course if you take it, especially since he's so chill about everything.", "rating": 5, "expected_grade": "A+", "created": "2021-12-17T19:34:28Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is awesome! This class is definitely one you can BS your way through; very minimal work required besides speeches. In my opinion, he's a bit critical of speeches but overall a fair grader. He is also super understanding. I highly recommend taking George for INAG.", "rating": 5, "expected_grade": "A-", "created": "2021-12-18T01:25:19Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "This was his first year teaching so I assume that's why he took the course so seriously. My friends had other INAG professors and, in comparison, Gormong graded the harshest and took off points for the littlest things which did add up. His midterm and finals were also both LockDown browser, closed-book, and made us come in-person for it while other profs allowed you to take it home and open-note. If you take INAG with him, you actually have to put in a little more effort than if you were to take the other profs so if you were looking for an extremely easy A, take any other professor. Other than that, it is very doable to get an A with him as long as you use gestures (he takes those super seriously) and practice your speech often. I am very relieved that his class is finally over and, if I could, I would have taken a different professor.", "rating": 3, "expected_grade": "A", "created": "2021-12-21T16:23:11Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "This class was pretty nice, Professor Fisher led it well and had a fun energy. It wasn’t too difficult, the speeches do require some preparation though. Great way to cross off that communications gen ed.", "rating": 5, "expected_grade": "A", "created": "2021-12-22T22:27:14Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "Mrs. Fisher was a great professor. Very kind and understanding. She communicates frequently and well. This class isn't terribly difficult, however, you must put in the work to do well. The speeches require time and practice. Have fun with this course and remember that the final is only 10% of the grade. ", "rating": 5, "expected_grade": "A", "created": "2021-12-28T02:00:12Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Very relatable professor. We asked her to clarify instructions for certain assignments and she gladly explained everything to us in class. Once she realized that instructions were unclear for several assignments, she began going over all assignments that were due. She also created a weekly assignments announcement at our request. As for the class itself, it's not too difficult, especially since Mays-Williams is an easy grader. The only issue I had was that the first 3 weeks had an insane amount of work for me to do. It dies down after a while, but I spend those first few weeks only doing work for this class. ", "rating": 5, "expected_grade": "A", "created": "2022-01-02T00:24:06Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Eric Dunning is a great professor. Just by the way he lectures, it is clear to see he is well qualified to teach a course about public speaking. He gives a few easy quizes on readings and the midterm and final are multiple choice. The course load is low, but you really need to spend your own time outside of class prepping for your speeches. He also usually lets the class out a little early.", "rating": 5, "expected_grade": "A", "created": "2022-01-04T11:50:44Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Take this class!! I was dreading taking a public speaking course and it turned out to be my favorite class. I don't usually write reviews but Sam deserves one. He cares so much about his students. The workload is extremely manageable and you get to pick your topic for the speeches. Although speeches can seem intimidating, Sam walks you through everything so you don't have to stress about it. I've made so many genuine friendships because of this class. Taking Sam's class is an experience that everyone reading this review should have. Go sign up for it!!", "rating": 5, "expected_grade": "A", "created": "2022-01-14T03:06:27Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Extremely easy class. As long as you attend class and go to office hrs while writing your speeches you will get a A. She's fairly lineant with grading speeches and focuses more on the structure of it. \r\n", "rating": 5, "expected_grade": "A+", "created": "2022-01-15T17:14:09Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Extremely straightforward class. As long as you attend class and office hours prior to the speeches you get an A. The speeches are graded fairly leniently. The midterm and final are extremely easy and can be studied for in a day. ", "rating": 5, "expected_grade": "A+", "created": "2022-01-15T17:16:22Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "I took this class based on these reviews and I'm really glad I did. This was by far the most interesting and fun class I took in the fall semester and I'm glad for once that we have to take a comm gen ed. Similar sentiments as others where public speaking can be hard for me but this class was still my favorite. I saw a big improvement by the end of the course not only on my speaking but also with my pre-speech anxiety. I honestly spent a lot more time and stressed more for the first one than I did on my last one. A good amount of people seemed to not enjoy the lecture parts in the first half of the semester but I actually really liked them because I enjoy this content and its a break from what I learn as a STEM major elsewhere. He also tells us what to write down for notes which I enjoyed. He honestly is a great guy and you can tell he truly cares about his students. He's a little eccentric which can be annoying on days you feel tired but I wouldn't have had it any other way. Since class size is so small and we spend time learning about others, by the time class ended it really felt like a family (cheesy ik but I mean it) and I was actually kind of sad when it ended. His wife also makes baked goods for us the first week of each month.\r\n\r\nOnly \"complaint\" I have is that since he kind of teaches his own way you do have to look at the textbook for the midterm and final even though we never use it before then. We also got short take home quizzes that were things we didn't cover in class but the textbook had. I don't believe comm107 has exams so if that's a huge dealbreaker for you take comm instead but inag exams are fairly simple (I studied way more than I needed to and finished the midterm in 5 minutes and got a 98 on it) but comm107 will just be another gen ed you have to take and nothing like the experience inag gives you. Inag exams also are worth very little, mid term is 5%, final is 10%, speeches are the bulk, and he's a pretty lenient grader in my opinion. Some of my other friends took inag with other professors some of which seemed WAY harsher and another that I heard was maybe chiller than Sam (he has a few things he's strict on but they're very easy to follow and he reiterates them all the time), but none of them understood the connection we left the class with (and I say this as someone who didn't talk as much in class). ", "rating": 5, "expected_grade": "A", "created": "2022-01-18T01:30:42Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "The final and the midterm were all multiple choice and as long as you read the textbook, you’ll do great. You’ll do fine even if you didn’t read honestly. Dr. Sefton makes class interesting and engaging. Just make sure to practice the speech beforehand and you’ll do great, the speeches are graded pretty leniently. This was honestly my favorite class during my first semester. Oh another thing, make sure you follow directions when creating your outlines ", "rating": 5, "expected_grade": "A+", "created": "2022-01-24T22:24:51Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Super chill professor. Lectures are informative and entertaining. 10/10 would take again. Quizzes are worth a lot of your grade but aren't worth many points so definitely need to do all the readings. Other than that his grading on speeches is very reasonable and class activities are engaging and fun.", "rating": 5, "expected_grade": "A-", "created": "2022-01-25T04:06:46Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "This professor is the WORST. If you’re looking for a class that is less intense and less demanding, I would not even consider this. She is super strict, doesn’t accept late work no matter the circumstance. She is also difficult to work with as a teacher. She doesn’t seem to have many students’ best interest because she would rather fail you. She also doesn’t recognize students’ efforts and if you did an assignment wrong you will get a 0, and she will not allow you to redo it. Basically, you cannot make mistakes in her class because she will just give you a zero and not look back. She is rude to her students and comes off very strong and not friendly.", "rating": 1, "expected_grade": "", "created": "2022-02-03T04:49:28Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "She made a super stressful class enjoyable for me! I agree that some of the assignments can be confusing, but she will clarify in class if there are any questions. She gets to know her students and doesn't give an insane amount of work. Weekly reading quizzes and group discussions. She provides helpful feedback and allows us to pick speech topics that are actually interesting. I definitely recommend her!", "rating": 5, "expected_grade": "A", "created": "2022-02-04T17:35:53Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Very harsh grader for no reason. Very strict about the ways she wants her assignments. Expects way too much for a dumb gen ed. Take any other inag professor. ", "rating": 1, "expected_grade": "", "created": "2022-03-05T22:33:47Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "She's very nitpicky in her grading and will look for any opportunity to give you a lower grade. She is not someone that's willing to work with you, preferring to just straight up give you a 0 if you are late. You have to write outlines prior to each speech, and she notes any small details to just subtract points from your grade. The speeches themselves aren't the worst as she isn't too harsh on the grading, but otherwise, she's very hard to impress. To ensure you get an A, I'd suggest you take another professor if possible. \r\n\r\nJust so you know how seriously she takes communication, she has a bachelor's, master's, and Ph.D. all in communications. ", "rating": 2, "expected_grade": "", "created": "2022-04-03T22:15:36Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "Amazing teacher, with excellent communication skills, lots of energy, easy to contact, and clear rubrics and grading for everything. Oftentimes, unless we are presenting speeches, she would let us off early or straight-up cancel class/post the lecture online. Classwork and hw assignments were all very easy and quick to complete. Midterm and final are multiple-choice online quizzes taken in her class. There are 4 speeches all with very clear rubrics and grading criteria. She does not require us to dress up like some of the other comm teachers. Literally if you prepare your speech the day before and have adequate notecards and tried, you should have an A in this class", "rating": 5, "expected_grade": "A+", "created": "2022-04-08T04:01:06Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "Great teacher, easy workload besides from preparing for speeches. As long as your speech follows the worksheet, you won't lose points. Highly recommend.", "rating": 5, "expected_grade": "A", "created": "2022-04-21T23:35:57Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Would not recommend if you're genuinely not good at public speaking or have anxiety ", "rating": 2, "expected_grade": "B+", "created": "2022-04-22T06:24:59Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Had her for INAG110 last semester and found it very straightforward. Very engaging in each class lecture and makes you work in groups with other srudents. By the end of the semester, it is likely you will know everyone's names (especially as it is a smaller class). While she can be somewhat of a harsh grader (especially once you reach a 90), an A or B is still obtainable with some effort. Would recommend taking it with her!", "rating": 5, "expected_grade": "A", "created": "2022-04-28T18:29:35Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Don't take this class. She's a harsh grader and is so knit-picky in the way she grades her assignments. ", "rating": 1, "expected_grade": "", "created": "2022-05-03T20:02:34Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Okay for starters Gormong is a very nice professor and he really does care about teaching us important communication skills. The way he grades presentations is ridiculous. He talks points off for every little thing and make sure you hit the time or you'll get a lot of points off. The way he grades is directly out of the book and he doesn't let anything slip. Also when you go to ask him a question about the grading he gets super defensive and almost rude. He gives a lot of homework throughout the semester, but don't get me wrong it's easy homework. For the amount of homework he gives there is almost like no point because it doesn't effect your grade at all. The midterms and finals are dumb because you have to take them in person and with a lock down browser, when you should be able to take those online and not in class because that's what other professors do. Overall, he is a nice person but a tougher grader for an oral communications class that is just supposed to be an easy GenEd. I mean in my opinion everyone should be getting a 85+ automatically if they are getting in front of the room and talking about the topic. Honestly the class wasn't that hard and the presentations weren't that bad but I would suggest to take a different professor if you can. ", "rating": 2, "expected_grade": "A", "created": "2022-05-06T22:03:26Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "One of the harshest graders I have ever had in my life, all for what was supposed to be an easy gen ed class. She goes through every effort to try to make your grade.\r\n\r\nOh and another thing, we had these exams during the semester that contained questions about the most obscure things about communication that were most definitely not covered in class, even though they may have been in the textbook, they were in the side diagrams and small footnotes. The tests are 50 multiple choice questions and are not easy in the slightest unless you studied for a week beforehand. \r\n\r\nLastly, she made us do a final business presentation and ON TOP OF THAT, take a final exam. Literally just stupid and I've talked with my friends and they said their teacher never did that.\r\n\r\nIf you can take any other professor for the class, do it. If she is the only professor left for INAG, just take COMM, it is NOT WORTH dealing with this demon for a semester.", "rating": 1, "expected_grade": "B", "created": "2022-05-11T20:09:36Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "This was his first year teaching at UMD, so he followed the curriculum to a tee and was very very strict at grading. Lectures were insanely boring, and most of them had a quiz worth 5 points. He allows you to collaborate with students after so that you get a 5/5, but if you miss class, the 0/5 can really hurt your grade. He was by far the harshest INAG professor, grading speeches extremely harshly. The midterm and final exam were both in person, closed-book, and on a lockdown browser. I had an 89.9 that he refused to round up, but he assigned an extra credit final essay worth .48 points, so you could do that if you were within .48 of a letter grade. With other INAG professors, this wasn't the case. He was so insanely hard for absolutely no reason, avoid if possible because he will make your life and INAG experience so much harder than it needs to be. ", "rating": 2, "expected_grade": "A-", "created": "2022-05-13T20:07:53Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Graded very harshly in comparison to other INAG teachers. Follows the curriculum too seriously and doesn't allow any electronics and doesn't post lectures. He also is very strict with the speeches and if you are not a perfect speaker immediately you will get a lot of points off. Takes points off for very small things. Expects way more commitment than is needed for this class. Honestly take any other teacher. ", "rating": 1, "expected_grade": "A-", "created": "2022-05-14T05:18:06Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam's INAG class was a blast, and this is coming from a huge introvert who always gets nervous when it comes to public speaking. Boring parts are not what he chooses to do but what he has to by the curriculum and he makes it tolerable through stories and letting us introduce ourselves in this early part of the class. One slight downside is that he doesn't teach the difficult parts of the midterm + final exams very well, but the majority of questions are easy (4/5 easy questions, last fifth was strange questions) and these are a small part of the total grade anyway. He is a very lenient grader for speeches, giving as many opportunities as possible to give more points if he can, and as someone who had many issues with stuttering, he gave me more points than I think other instructors would have given. On days we don't present we get to sit back and review one other person's presentation for the day, which meant it was a nice time to chill but also learn from others. I got to know about other people, from their names to interests to ideas, which is more than I could say compared to basically all my other courses at this campus. In short, this class is amazing and Sam is one of the best instructors for the course! Try to get his class because the experience is unlike any other class.", "rating": 5, "expected_grade": "A", "created": "2022-05-16T13:28:16Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Great teacher, made a class I was stressed about doing enjoyable. She's a very nice person and very responsive to emails. The class could be unorganized at times but other than that it was fine. I would 100% recommend her in your plan on taking an Oral Comm class. ", "rating": 5, "expected_grade": "A", "created": "2022-05-16T20:18:35Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Look Lori's a nice person and is willing to help you but not the best in terms of teaching. She is a very harsh grader and will take off points for many little things with your speeches. She is very uncompromising in terms of how assignments are done and its either her way or no way. She does not accept late assignments whatsoever even if it is a minute after the deadline unless you have a University approved excuse. And just about INAG110 in general, there is a midterm and a final and a lot of the information just seems useless. If you can I would take COMM107 instead as to my knowledge there is no midterm or final or try and find another INAG professor. ", "rating": 3, "expected_grade": "", "created": "2022-05-17T19:38:53Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "If you are on this website, you are most likely looking for the best professor for this class with the best grading breakdown. If you want an easy A, do not take Gormong. He grades harshly on the four speeches for the class with major deductions for your grade if you are a second over or under the time requirements. Homework is easy but doesn't really affect your grade. Exams are harder than other sections and he makes the class use a lockdown browser in person to take them. Our average on the final exam was 78%. All the speeches we had had about an 85% average score. This being said, He is a very genuine and good person and is passionate about the course that he teaches. He tries very hard to keep the class engaged and knows about communications. However, this may be the reason he takes the class way too seriously. Unlike other professors in INAG, he does not offer extra credit in any form except for a .48% increase to your grade at the end of the semester. Take any different section if you want to raise your GPA with an easy comm credit. ", "rating": 1, "expected_grade": "A-", "created": "2022-05-19T00:37:07Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "At the beginning of the term, nobody understood what the assignments meant, but she clarified them and we all eventually figured it out. Mays-Williams would have class in Hornbake Plaza if the weather allowed. She is nice enough, and very forgiving with issues. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-20T21:22:10Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Pros:\r\n- Sam makes what is normally a boring Gen-Ed course much more interesting\r\n- You can tell he cares very, very much about his students and oral communication in general\r\n- Everyone sees a noticeable improvement in their public speaking skills after taking his class\r\n- Easy exams, extra credit, and some pass/fail speeches that are easy 100s\r\n\r\nCons:\r\n- Lectures can be kind of contrived, he likes things being done in a very specific way\r\n- Very easy to lose lots of points on speeches if you make small mistakes/don't read the directions (i.e. a 70 point deduction for being >5 seconds under the minimum time limit. I believe this is more strict than other INAG/COMM professors are but I may be wrong)", "rating": 4, "expected_grade": "A", "created": "2022-05-23T20:05:31Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Lets get right to the point.  Sam is the best INAG 110 instructor and professor at UM.  Passionate, hilarious, knowledgeable and super high energy.  He makes himself available 24/7 because he really cares and wants to see all his students succeed.  No matter how afraid you are of public speaking, he will make you alot better and feel more confident. \r\nThis is also the first time I got to know everyone in my class and learn something about them.  Sign up to meet the gen ed requirement but really take it for a once in a lifetime experience.  Trust me, you won't regret it and, most of all, you will never forget it!", "rating": 5, "expected_grade": "A", "created": "2022-05-27T14:43:13Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "Fisher is the absolute best for this class. There may be others who are also really good, but I think Fisher tops all of them. She's incredibly lenient with how she grades, and if you mess up anything on accident such as incorrectly reading the directions to homework, she will fix your grade assuming you make the proper corrections even past the submission deadline. She doesn't take that many points off during speeches assuming you follow everything in the rubric. The exams are also super duper easy as it should take you at most 20 minutes each for the midterm and the final. The only thing I dislike about this class is the required attendance. I get that it's necessary for graded in-class activities, speeches, or exams but sometimes she presents slides covering textbook material in class which I think is a waste. Nonetheless, I still think she's the best INAG teacher. ", "rating": 5, "expected_grade": "A", "created": "2022-05-31T02:12:17Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "No one wants to take INAG110, but since you have to make sure to take it with Mr. B. He is such a down to earth and caring professor. He wants everyone to do well and grades relatively easy. I do not like public speaking but Mr. B made lectures engaging and had a class environment that it was easy to make friends in. You have to do 4 speeches, but get notecards for all of them and the midterm/final is so incredibly easy it's not even funny.", "rating": 5, "expected_grade": "A", "created": "2022-06-08T01:32:38Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is great -- very chill, teaches with personality, makes expectations for speeches clear, and doesn't make the class any more work or more complicated than it needs to be. ", "rating": 5, "expected_grade": "A", "created": "2022-07-01T05:00:27Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Nice person, but a harsh grader. Getting an A would be far easier if you take this course with another professor.", "rating": 3, "expected_grade": "A-", "created": "2022-11-07T03:09:56.301551Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Honestly I was not looking forward to this class and I went in super stressed about giving speeches, but I absolutely loved my experience in their class. They grade very leniently; coming from someone who is not a good public speaker and definitely messed up a lot in my speeches, I got either 100 or a point or two off on all major speeches in the class. The workload is super manageable, and although the first few weeks are filled with assignments, after that there's nothing except practicing for speeches. They're also very kind and understanding of any problems, and I genuinely enjoyed coming to class. If you're also someone who hates public speaking and has bad anxiety, take your oral communications credit with Mays-Williams.", "rating": 5, "expected_grade": "A+", "created": "2022-11-10T22:36:18.040109Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Gormong helped me get better at speech/presentations. Class has very easy HW (sometimes just 1 question HWs or MC straight from the textbook), assignments are super easy, he grades the speeches very lightly, light quizzes that he gives you the answers for. The class is fun for the material he has to teach, he’s a nice guy and will make you better", "rating": 5, "expected_grade": "A", "created": "2022-11-22T06:52:11.069518Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Coming into this class being a public-speaking hater, I was not excited to give speeches. But her class environment was very comfortable, and the grading was very lenient. Would definitely recommend her if you have speech anxiety.", "rating": 5, "expected_grade": "A+", "created": "2022-11-26T05:53:06.492602Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "Definitely the best professor for this class. The speeches aren't really graded hard. Basically if you do them and meet the requirements you will get a 100. Super easy workload, just prepare for your speeches some when you have them and you will cruise to an A. She is also super understanding and tries to not keep us in class unless she has to.", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T04:06:50.606123Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "listen, lori is a strict grader, however, she makes it very clear and communicates exactly what she wants. she posts rubrics for each speech and gives great feedback. her feedback is not meant to criticize you, it's meant to help you become a better communicator. its honestly impressive that she can notice and comment on small details in such short amounts of time when you're giving your speech. she genuinely wants you to do well and tries to get to know each student. she is also a great lecturer and her slides are always online and very clear. there is a midterm and a final which are both 50 mc, but lori does in class review and posts study guides and its really easy. her energy during class is always so excited and it shows how much she loves teaching. just show up to class and pay attention.", "rating": 5, "expected_grade": "A", "created": "2022-12-10T01:15:51.143536Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Dr. Sefton is a great lecturer, she knows what she is talking about. She genuinely wants her students to do well and tries to get to know everyone making it a great learning environment. She makes it very clear on what she expects on speeches and provides specific clear feedback to help you improve. There is a midterm and final exam but it is all multiple choice and very easy since she does in-class review and provides study guides. This class focuses on application of content through worksheets and just talking it out with classmates. Homework is assigned maybe once every two weeks and is like three questions from the textbook. I would not recommend skipping class all the time since she does have classwork usually for a few points. Overall, her class is very engaging and always goes by fast. She is definitely someone you can talk to.", "rating": 5, "expected_grade": "A", "created": "2022-12-10T01:16:22.850579Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is by far the best INAG instructor out there. He really makes an effort to make lectures/classes enjoyable and he ensures that you can succeed at public speaking. This was the first gen ed that I truly enjoyed because Sam turned a boring subject into an interesting and fun class. The environment is different from the traditional classroom, so if you're someone who likes repetitive lectures or serious content don't take this class. Definitely take Sam's section if you want to grow as a speaker, learn something new about yourself, and are able to thrive in a creative atmosphere.", "rating": 5, "expected_grade": "A", "created": "2022-12-12T03:59:28.148226Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "I was very stressed about this class but the environment that they created made it not only easy, but fun as well. The grading was very lenient and they are very understanding about stage fright and never deduct points because of it. Additionally, the workload is very manageable and they are willing to adjust to each individuals persons/the classes needs.", "rating": 5, "expected_grade": "A", "created": "2022-12-13T23:22:27.858196Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "They do an amazing job making the course engaging, fun, and light. The coursework is generally easy and the final/midterm do not have much weightage. Highly reccomend them if you're looking to take this course.", "rating": 5, "expected_grade": "A", "created": "2022-12-14T13:36:59.555966Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Great professor. Sam is entertaining and keeps you engaged. Speeches are not that hard, just make sure to practice them. Great guy. All assignments are easy and take home. You can get an A pretty easily in here while enjoying yourself.", "rating": 5, "expected_grade": "A", "created": "2022-12-16T07:42:03.998285Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "honestly shes so chill and acts like a friend in a good way! my tip is do well on your speeches! if your speeches are a high grade you can fail the final and midterm and still end up with a B or low! Not a class you need to go every time but I would say easiest gen-ed ever, I got ended with a 82% which is pretty good bc i did not try with my speeches but if i did try i bet i wouldve ended up with an A. Also make sure to make friends in the class bc the first week there's like a small group project (leading a discussion)", "rating": 4, "expected_grade": "B", "created": "2022-12-16T16:37:20.398425Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "honestly shes so chill and acts like a friend in a good way! my tip is do well on your speeches! if your speeches are a high grade you can fail the final and midterm and still end up with a B or low! Not a class you need to go every time but I would say easiest gen-ed ever, I got ended with a 82% which is pretty good bc i did not try with my speeches but if i did try i bet i wouldve ended up with an A. Also make sure to make friends in the class bc the first week there's like a small group project (leading a discussion)", "rating": 4, "expected_grade": "B", "created": "2022-12-16T16:37:20.426960Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "My favorite professor by far. They create such a welcoming and entertaining environment. The class work is extremely light. They are the kind of professor that wants you do to well, so there are a lot of extra credit opportunities and they are a lenient grader. The class itself was very rewarding. We had amazing discussions and the speeches were so entertaining, to do and to watch. Professor Mays-Williams is honestly just a pure, fun soul whom fosters great relationships with their students. If I could, I take more classes with them.", "rating": 5, "expected_grade": "A+", "created": "2022-12-17T16:18:41.496912Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "I took Mrs. Fisher based on reviews here and she most definitely surpassed all my expectations. A hilarious professor who genuinely cares for the well-being of her students. She keeps lectures entertaining and is very fair with her grading of speeches and other assignments. Highly recommended to everyone!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T15:05:09.749647Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Literally the best professor. He makes his class enjoyable and is extremely passionate about teaching. He turns public speaking into something pretty fun and he grades really fairly. His classes are about 19 people so you really get to know the people there. He creates the opportunity to let you improve as a speaker and is overall an amazing person\r\n\r\nTake his class", "rating": 5, "expected_grade": "A", "created": "2022-12-20T06:12:21.910960Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam's a really fun and entertaining guy. I had a really wonderful time in his class, and he obviously cares about his students and wants to see them succeed. He's really energetic and brings more \"fun uncle\" vibes than \"communication professor\" vibes. My only qualms with the course are that there's not much to learn - I don't feel like I learned anything from the course that isn't already obvious (\"meanings are in people, not words\", \"nonverbal communication can be more effective than verbal\", etc) and most of the feedback he gives for speeches are cookie-cutter; you hear the same feedback given to basically every single person and he speaks as if he's filling in the blanks of a premade template. Overall though, fun guy and easy class.", "rating": 4, "expected_grade": "A", "created": "2022-12-20T19:02:22.563169Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "I was skeptical at first, but this guy is the best INAG teacher there is. But I am going to list the cons first. He grades speeches probably the harshest out of the other inag professors. As someone mentioned being like 5 seconds under a 5-minute speech will result in 70 points off of on speech. But I dont believe he actually gave someone 70 points off on a speech as someone in my class was 10 seconds under, he just silently urged them to keep on talking. He is a strict grader when it comes to presenting in general. He also has strict harsh rules, but these rules are just there to make sure you are doing your presentation correctly. People rarely ever fall outside of his rules like they are just common sense with his own twists on it basically, it's meant to encourage us to do our best. Sam is so energetic when it comes to speaking it brightens my boring day. He is always telling jokes our forcing us to tell jokes as everyone in the class must say 1 joke. (I've said 3 jokes). He seriously doesn't want you to fail and its scary the length he'll go for you just so you dont fail. At first, I thought he was doing this so that we would have no excuses when it came to our assignments. But he really just wants us to pass the class as INAG should be an easy A. It is really the exams that may hit peoples scores. I honestly never studied for them cause the questions were common sense. And I scored like 80-82 which was fine since it was above average lol. He gives us so many extra credit opportunities its crazy. The environment in his class is very comforting. The way he sets up the seats brightens my day. We can present our speech topics on anything as Sam loves creativity. He really is \"Sam the Man\" as I cannot see any teacher that can have a bigger impact than he did. If you are looking for a fun class to actually better your speaking skills take Sam. If you are just looking for a class to just get a grade and dip, take anyone else. I hate public speaking, but I can definitely say I learned a lot from this class. I have seen improvements from my first speech to my last speech. INAG is not a hard class in general. So don't be afraid of taking Sam because he is a harsh grader.", "rating": 5, "expected_grade": "A", "created": "2022-12-20T23:48:18.519606Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Dr. Sefton was a great teacher and knows what she is doing when it comes to public speaking. 60% of our grade was based on our speeches and although she was a tough grader she gave great feedback and acknowledges when you improve. She also genuinely cares about her students and was very reachable. The workload was very manageable and she provides lots of classwork to help improve your grades. You definitely have to work for your grade which was a little annoying considering this was just a gen-ed but I learned a lot so it was worth it in my opinion!", "rating": 5, "expected_grade": "A+", "created": "2022-12-21T03:13:55.806995Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "I'm very glad I chose them as a professor. I was not looking forward to public speaking, but Mays-Williams created a comfortable environment for every student to succeed. I could tell that they made an effort to get to know each student. The grading was also lenient in my opinion. I gave speeches that I personally thought were bad, but I would only get a few points off, never to the point where it significantly impacted my grade. The midterm/final were just multiple choice questions that were easy to answer if you just paid attention during the in-class lectures and reviewed vocab a bit. Would totally recommend Mays-Williams for this class.", "rating": 5, "expected_grade": "A", "created": "2022-12-21T04:55:56.715131Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Overall, Dunning is a great choice for INAG 110. He's super laid back and will be pretty entertaining. He actually cares about teaching so he'll infuse the lectures with his personality but he is very chill with grading. Make sure to prepare your speeches ahead of time and write it exactly to the rubric but other than that, you'll really be fine. \r\n\r\nVery important: The reading quizzes are super valuable and have very few questions so you really can't mess them up. I bombed a couple and fumbled an A in this class, don't repeat my mistakes. Do the reading, use quizlet, just make sure to get perfect scores on those reading quizzes and the rest will fall into place. This class isn't a lot of work, just nail the quizzes, be passingly engaged in class, be competent in your speeches, and everything will be ok.", "rating": 4, "expected_grade": "A-", "created": "2022-12-22T02:05:16.621231Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Very chill professor. His chapter quizzes are kinda annoying because it means you can't skip class, but they're pretty easy and straightforward. The midterm and final are basically the same as the chapter quizzes but, just, longer; be sure to study for them using Quizlet, though. His lectures are pretty fun and entertaining, but that said, there's some content he covers that you just don't need for any quizzes or exams, so be sure to actually read the textbook.  As for speeches, he's a very lenient grader, so long as you look at the rubric and specifically tailor your speech to them.", "rating": 5, "expected_grade": "A", "created": "2022-12-24T00:42:16.467289Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Very nice, personable teacher with super generous grading policies. Would 100% recommend taking INAG110 with her, or any other courses she offers as well.", "rating": 5, "expected_grade": "A", "created": "2022-12-24T14:13:27.809825Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Seriously just take his class for your communication gen ed. He genuinely is a great teacher and person and truly cares about everyone in his classes.", "rating": 5, "expected_grade": "A", "created": "2022-12-24T16:33:24.404007Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "At the beginning of his class, he makes it seem like it’ll be much harder than it is — especially if you’re on the quieter side like me. But don’t be intimidated by that, he’s much more encouraging than he comes off at first, and he’s a great teacher and person. His feedback gets a bit repetitive at times, but he’s always available for further instructions and help if you ask. Definitely take this class for a comm credit!", "rating": 5, "expected_grade": "A+", "created": "2022-12-25T03:48:20.029081Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "Love her!! She made me excited to go to class, even though I’m a bit shy and don’t like public speaking. Midterms and finals are the easiest thing ever and is on Google Forms. She does helpful Kahoot reviews before those. All of us got an automatic 100% for the first speech if we did it. Very caring and loves to talk to people. Amy sometimes tweaks people’s grades if they didn’t get the one they wanted. She excused the homework for my friend and got him to a 93 for an A! Would definitely take her again!!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-25T17:36:44.392919Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is the GOAT (Greatest of All Time)!  If you need a communications class for the gen ed requirement, this is the guy to take it from.  It's like no class you've ever had and you'll never forget it.  He's a very fair grader and an easy A!  Also, you'll get to know everyone in there, learn so much and have a lot of fun.  100% recommend because Sam is the man!", "rating": 5, "expected_grade": "A", "created": "2022-12-26T14:50:50.305475Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "Amazing lecturer that creates a good environment to learn in and grow. The class is very easy and she does not stress over little grades; as long as you show effort, you will get almost a perfect grade. Her Kahoot reviews before exams are basically what shows up on the exam and she is very clear on what she wants from the speeches (which makes up the greatest portion of your grade); just hit those pointers are they are all 100s.", "rating": 5, "expected_grade": "A+", "created": "2023-01-03T07:15:13.455547Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Super chill professor - Prof Mays may come off a little disinterested/stoic at first, but once she opens up, she's such a funny and lovely soul. She is very accommodating towards students and I can't stress that enough. If there is something going on, just go talk to her and she will make things work. Class workload was manageable - you have 4 speeches, 1 midterm and 1 final. Public presenting is difficult but she makes the small class environment a warm and welcoming one so you won't ever feel embarrassed to go up there.", "rating": 5, "expected_grade": "A+", "created": "2023-01-08T17:03:55.477846Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Good professor overall, kind to students. 4 main speeches + group speech, grading isn't too harsh, pace may seem aggressive at first but pays off later in semester. Weekly textbook readings + MCQ HW, quizzes he gives you the answers for. Midterm and final are just like HW. No curves but shouldn't be necessary cause of speech grading. Some controversial topics at times but was generally respectful. Definitely helped me be more confident with speaking.", "rating": 5, "expected_grade": "A", "created": "2023-01-27T16:37:56.948477Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Grades very harshly, but pushes you to become a better public speaker. Does not easily give 100s on speeches, but will give you an A as long as you practice. Does give quizzes often in class, but he gives you the answers so its really just attendance", "rating": 4, "expected_grade": "A+", "created": "2023-02-06T19:19:52.795850Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Dr. Sefton is very nice and supports all students through all problems they might have. 60% of the grade comes from 4 key speeches which you have to prepare on your own however, the speeches are not much longer than 5 minutes and you can go to office hours with and outline and she will help find everything wrong with it and help you improve it. this pretty much guarantees you don't get a bad grade on the content of the speech. the presentation alone is not worth much. She is strict with her rules but will always tell you what the rules/rubrics and expectations are far in advance, (they also aren't that hard). Unfortunately, she does teach the class like it is a middle school class and gives out a worksheet almost every single class but the homework is limited to 2 short assignments per week if any at all.\r\nEssentially, just attend class and take your outlines to office hours to review for an easy grade.", "rating": 5, "expected_grade": "A+", "created": "2023-04-03T14:53:58.117204Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "I probably don't even need to write much here; the other reviews sum it up pretty well. There are sometimes weekly textbook readings/quizzes, but these are mostly vocabulary, and they don't take long if you just have the book open while you do them. The speeches are the biggest part of this class. I'm usually annoyed by Gen-Ed type classes, but I think being able to speak in front of an audience is an extremely important skill, and throughout the semester I felt myself getting more confident for the speeches. With George, this class is very chill, and you'll probably make a new friend in class.", "rating": 5, "expected_grade": "A", "created": "2023-04-27T22:52:35.379961Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "I had really low expectations coming into this class, but I ended up LOVING it. There are 4 speeches and then one little group project at the end, and honestly they’re really not that bad. Talking for 8 minutes (the last speech) sounds really hard, but you just have to pick something you really like to talk about and it will come naturally, as well with the shorter speeches.  There are weeklyish homeworks about the textbook, but just use ctrl-f and they shouldn’t take you longer than 15 minutes. There are quizzes, but he literally goes along with us in class and makes sure we all get 100 lol.  Looking at  earlier reviews, I am confused because Professor Gormong is great. He’s super friendly and seriously wants everyone to succeed and do well. His grading is fair to easy - I completely bombed my second speech yet he still gave me an A. He really promotes the whole class getting to know each other, so that helps take away a lot of the jitters before giving your speech.  I cannot recommend taking inag110 him enough!!", "rating": 5, "expected_grade": "A+", "created": "2023-05-03T19:43:54.512558Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "If you need to take a credit for your comms gen ed, definitely take INAG110 with Professor Gormong!  He legitimately wants all of his students to succeed and he is pretty lenient with grading.  I was terrified of public speaking prior to this course, but now I feel so much more confident.  He's also just a really nice guy and super easy to talk to, so I really recommend him!", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T16:09:43.673628Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "He is a great guy and really not that hard if youre willing to learn to talk to people in a new and more constructive ways.", "rating": 5, "expected_grade": "A", "created": "2023-05-08T17:10:21.922522Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Gormong is super nice and friendly. Speeches weren't graded too harshly unless you went over/under the timeframe that was posted on the rubric ahead of time. Most of the time you can get a good grade on your speeches if you just check every box. We had a lot of weekly homework quizzes that were based off of a chapter in the textbook, but they weren't really difficult at all. They offer a lot of extra points if you preform well and outside of class there wasn't too much work. He lets you choose when to sign up for speeches so you can give yourself as many or as little days as you need to prepare. The only thing is that during speeches he doesn't let you take a timer up with you or give any indication if you're talking too long or too short which was sometimes difficult because you wouldn't know unless you asked someone for your time or waited until the speech was graded. Overall, great professor and would recommend.", "rating": 5, "expected_grade": "A", "created": "2023-05-08T17:11:57.004914Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Wrote me a cover letter in a super short notice for a scholarship. Went to a performance with him and his wife and a few classmates supporting a student in the class. Very nice & you'll learn a lot.", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T22:21:39.244959Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "If you're a student who just wants to get the oral communications gen-ed out of the way in the easiest and simplest way possible, George is your guy, no questions asked. Super chill and laid-back guy, and he understands that students don't exactly prioritize his class over their other classes. In fact, he does not even want you to expend a large amount of time to his class compared to, for example, hard STEM classes. George was more of a friend than a lecturer to his students, and he holds a great presence. All weekly assignments take no more than half an hour total, and the speeches are not even that hard to prepare for. The midterm and final are also absolutely nothing to worry about, and I mean that literally because I don't think anyone will study for that for anything more than 10 minutes honestly. Classes are not mandatory, but you might miss a participation grade or two if you miss a day on a group activity day. I feel like I only went to like 50% of the Friday classes in all honesty. If you do go to class, George does lecture well and straight-forward. Overall, this guy is the absolute best professor I've ever had.", "rating": 5, "expected_grade": "A+", "created": "2023-05-09T18:50:19.008698Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "simply put, an amazing professor AND mentor", "rating": 5, "expected_grade": "A+", "created": "2023-05-11T19:38:29.785055Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Professor Gormong is truly great at his job. He makes class fun, makes an effort to get to know his students, and actually cares about making you become better at public speaking. His grading was not as harsh as everyone made it out to be in previous semesters--as long as you make a genuine effort you'll be fine in this class. 4 individual speeches, weekly MCQ HW based on the textbook, and a group presentation at the end of the year plus in-class quizzes that he reviews the answers for before submitting.", "rating": 5, "expected_grade": "A", "created": "2023-05-12T19:11:22.944797Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Came to this class hating public speaking, still dont like it but I feel like my skills have improved thanks to the learning environment that Mr. Ballenger created.", "rating": 5, "expected_grade": "A+", "created": "2023-05-12T19:39:29.801301Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Mays-Williams is a great person and professor. She is very understanding and wants everyone to do well.", "rating": 5, "expected_grade": "A+", "created": "2023-05-13T15:30:34.139669Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Great teacher! You definitely learn a lot in class, which is very helpful for making slides and crafting speeches for other courses. 60% of your grade is speeches (4). Her rubrics show EXACTLY what she is looking for- so go to office hours! She is very helpful and will tell you what exactly what you need to fix to boost your chance of getting a good grade. Midterm is 5%, final is 10%. All you need to know if vocabulary and how to apply it.", "rating": 5, "expected_grade": "A+", "created": "2023-05-15T15:22:03.499513Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is the GOAT, no questions asked. So great, so chill, so many good stories. I felt comfortable in this class and really enjoyed it. Take George!!!", "rating": 5, "expected_grade": "A+", "created": "2023-05-15T16:00:20.633297Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Absolutely baller professor. Grades very lightly on speeches (there are 3). Please take him.", "rating": 5, "expected_grade": "A", "created": "2023-05-15T23:05:44.773923Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Bombastic man. Pretty easy A, just do all the assignments and practice for your speeches. He really cares about everyone and is really charismatic, but that can be a little much for some people.", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T04:40:35.149804Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Really engaging professor. Take advantage of going to office hours-- she will help you write out your outline and tell you exactly what you need to do to pretty much get an A. Her rubrics are VERY clear, and tell you exactly how to get the grade you want. Very nice and approachable, and I recommend taking her.", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T14:31:22.982393Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "Mrs. Fisher is awesome--one of those professors that actually feels like a real person and has a life outside of the classroom (unlike literally like everyone in the math dept...)\r\n\r\nIf you do everything you are supposed to do on the speeches you will get an A and the two exams are super easy. Even as an already confident speaker, I feel like I actually took some stuff away, especially about visual aids and professional speaking.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T16:14:33.089124Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam was the perfect professor for a INAG110 course. He kept us excited about learning, engaged, never bored, and was very motivating when speeches were looming on the horizon. He was honest yet Light-hearted and always willing to talk to you outside of class as well if you had any questions or needed extra guidance for a personal issue or the course itself. I definitely recommend to anyone willing to take him for this Gen Ed credit! :)", "rating": 5, "expected_grade": "A", "created": "2023-05-19T03:09:48.901645Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Super funny, really understanding, genuinely cares about you, and creates an atmosphere where you end up coming to class willingly because you don’t know what he’s going to do next.", "rating": 5, "expected_grade": "A", "created": "2023-05-19T12:29:37.682931Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Great professor for INAG110. Highly recommend!", "rating": 5, "expected_grade": "A+", "created": "2023-05-21T19:52:42.408106Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "Amazing professor, makes class interesting and is the easiest A ever please do yourself a favor and take this man!", "rating": 5, "expected_grade": "A", "created": "2023-05-27T01:31:26.205622Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "TAKE SAM RUBIN. Sam will turn a class that could be very boring into something amazing. He is the funniest prof I've ever had and has the most engaging lectures possible. He entertains you throughout all of his classes by sharing stories and telling jokes. His grading is also very fair, and he will help you out if you are struggling. He truly wants to see everyone succeed and have a great time. This man doesn't do this for the job, he does it because he loves it. He will take care of your grade and you will get an A provided you put in the effort. \r\nOverall, he gives you a FUN class and a good grade, so 100% recommend him.", "rating": 5, "expected_grade": "A", "created": "2023-06-02T17:17:02.158704Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Great professor, very generous and understanding when it comes to due dates. Very funny and takes her teaching serious without being harsh. Definitely would recommend.", "rating": 5, "expected_grade": "A", "created": "2023-06-28T20:50:59.351865Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam was an amazing professor. I’m really not a fan of public speaking so I went into the class thinking it was just one of those icky gen Ed’s I’d have to take to get my degree. I was so wrong. Sam made inag fun and exciting. I looked forward to his class every day and genuinely learned so much from him. He has a strict attendance policy but I didn’t have an issue with it because I wanted to go to his class. I highly recommend taking Sams class. It’ll be unlike any class you take in college in the best way possible.", "rating": 5, "expected_grade": "A", "created": "2023-07-03T04:53:41.324531Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "I hate public speaking. I was extremely anxious and scared but Sam makes the class so warm and welcoming that it felt easy to go up and present. He also brings baked goods on the first of every month that his wife makes!! (and if you have any dietary restrictions he makes sure to accommodate for those) He is honestly one of the best professors I’ve had and bumped me to an A when I was on the very edge because I lowkey failed the final lol. He loves his job and as long as you put in a little effort into the class you will have a great time!", "rating": 5, "expected_grade": "A", "created": "2023-07-19T15:36:35.545175Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "Amy is really nice and makes INAG super easy to get a good grade while still learning stuff about communication and presentations. She's pretty forgiving with several things, but make sure you don't turn in late work! It's very easy to not do so though, as at least in the summer class, as she releases all assignments at the beginning of the class and you can work on them whenever. Honestly, I've spent less time on this class per week average than I have on many of my semester classes despite the condensed schedule. The midterm and final are super easy at least right now, as they are all open note from the textbook, although she is getting rid of the textbook in the fall so I don't know how that will change things.\r\nThe only mild thing I would suggest if Amy ends up seeing this, is that although you get 100 for following instructions, I would still appreciate feedback on where to improve, as I know I am not always the best speaker. Still not enough to lower the grade though. \r\nI like her because she understands that students may not all have the same background in public speaking, and that many of us are just doing this because it is a gen ed, but she wants us to do well anyway.", "rating": 5, "expected_grade": "A+", "created": "2023-08-16T15:14:03.532088Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Take this class with literally anyone else. You will probably have better luck with a TBA comm professor.", "rating": 2, "expected_grade": "A-", "created": "2023-11-09T02:17:39.605719Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "super chill. Chapter quizzes on canvas but he provides the textbook and the quizzes are open note and you can retake them, plus they are only due by the end of the semester. Other than that three speeches (plus a short intro-get-to-know-me like 2 minute thing at the beginning). grading is very realistic and his lectures are actually really entertaining. would def recommend. no final or midterm.", "rating": 5, "expected_grade": "A", "created": "2023-11-09T15:31:36.055599Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is nice. Though the class can get tiring, he is a good person at heart who is willing to extend his kindness in many ways, like cookies or inviting us over for Thanksgiving if we have nowhere else to go. He is funny and lenient. You will get an A in this class.", "rating": 4, "expected_grade": "A", "created": "2023-11-17T00:18:28.367650Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "She's amazing! She tries to make the class engaging, gave out a lot of good tips for speaking, and helped me with interview tips. She is pretty nitpicky with her grading on speech days, but she is a very good person and you can always go to office hours to discuss speech grades. Honestly would HIGHLY recommend this professor.", "rating": 5, "expected_grade": "A-", "created": "2023-11-30T03:41:09.974067Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Amazing prof, she made class enjoyable and made me want to wake up for the 9am class with no hesitation. She doesn't take attendance minus for the one week of the last set of speeches for audience credit. As long as you fulfill the speech requirements, she's giving you a 100% on everything. The quizzes are really easy (and two tries), just command+f the online textbook. Impromptu speeches are completion so don't stress about them. I went in reluctant about a comm gen ed but she made me so much more of a confident speaker - especially for longer durations and I loved that we could choose our own topics. BTW she loves pumpkins. Participate because class is only fun that way and when you participate, others usually follow and the students can lowkey make or break the experience (my class had very engaged students and she even said we were her fav class because we were actually engaged and participated, she def reciprocates the energy we give her). I recommend her to anyone needing to take INAG", "rating": 5, "expected_grade": "A+", "created": "2023-11-30T04:12:08.135749Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is a very easygoing and interesting guy. He made the lectures engaging and would crack some jokes to lighten to mood. He is a relatively easy grader but can be picky about the introduction and closing of the speech. I would recommend him if you need to fulfill your communications gen ed.", "rating": 4, "expected_grade": "A", "created": "2023-11-30T18:25:21.175491Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "The Goat. Funny with his dry humor, makes you feel better about speaking. Grades fair and understanding, nice guy. Makes you feel more motivational and his level of calmness makes you speak better.", "rating": 5, "expected_grade": "A", "created": "2023-12-04T17:09:45.692654Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam Rubin is THE MAN!  If you have to take an oral communications class, he is the one to take it from. You will not be disappointed.  The class is a total blast!  His love of teaching and care for the students is second to none.  Even if you are an introvert (like I am), he will make you feel so comfortable that you won’t even realize what’s happening.  This is the first class I actually knew all of my classmates and their first and last names!  I think all professors should learn how to teach from him.  He’s fair, compassionate, funny and always available (24 hours a day) for you to contact him either through email or by phone.  You can even contact him to discuss anything other than the class, if something’s on your mind.  Take Sam Rubin!  You won’t be sorry!", "rating": 5, "expected_grade": "A", "created": "2023-12-04T17:21:35.408633Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "I don't know what these 1 star reviews are talking about Professor Gormong! He is amazing. Actually the sweetest man I have ever met. His class is extremely easy and all he wants is for his students to be confident. There is no final exam and the speeches are very clear. It is literally impossible to fail this class. There's a quiz once a week but they are so easy. If you have the choice to take him do it!! He is AWESOME!", "rating": 5, "expected_grade": "A", "created": "2023-12-04T21:49:43.960472Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is a great professor and an even better person. He makes class entertaining and is an understanding professor. He knows that students have other priorities besides INAG110, so the workload is pretty light. The main assignments are 4 speeches throughout the semester. George is a fair grader and I definitely recommend taking comm with him, you won’t regret it and I actually looked forward to attending class because of him", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T01:52:30.432643Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Dr. Sefton is very passionate about what she teaches and makes every class engaging. The material we learn is useful in the future and outside of the class, I've used the steps for writing/giving a good speech in other classes already. She is very approachable, welcoming, and easy to talk to, and makes the class a comfortable environment in a class that can be nerve-wracking normally. Her rubrics and assignments are extremely clear and she goes over exactly what she's looking for, and gives reminders of assignments several times every class period to make sure that everyone knows about them. We also had a lesson that had to do with psychology, and I found it really interesting and a nice change from just practicing writing/giving speeches. She is also very available for office hours, I would highly recommend her.", "rating": 5, "expected_grade": "", "created": "2023-12-05T21:32:25.064201Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "I loved Professor Gormong. His class does require more work than other comm courses, but I definitely recommend him. This was a very easy A. He grades extremely leniently and there are easy participation points each class. I would definitely take him if you have the chance!", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T17:20:07.056757Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is the goat. Laid back and barely spent much time preparing for speeches. Take George to get this gen ed out the way stress free", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T19:08:46.867480Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Very good at what he does, as long as you do your stuff and complete your assignments on time, you're going to get an easy A in the class. Do not believe the other reviews that say he is hard, or mean, genuinely one of the nicest professors you will ever have.", "rating": 5, "expected_grade": "A", "created": "2023-12-07T06:17:34.544393Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Although Professor Gormong made it so that we had weekly work that can seem pointless, at the end of the class you realize that the work was helpful to your improvement. Your grade depends on how much work you put into the class, but it is very easy to just pay attention and you will be successful. Overall he grades pretty easily until the last speech and by then you already are a better speaker so it should be easy.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T16:14:36.080339Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Take his class!! Professor Gormong is a very nice person and I think grades very fairly. He creates a fun and very not intimidating atmosphere to present speeches. Your public speaking will improve a lot this semester and course load is pretty light. There are weekly practice speeches with quizzes and 4 big presentational speeches- very manageable.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T16:15:42.715216Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Dr. Sefton is extremely approachable and knowledgable about communications. She makes class engaging and gets to know students on an individual level. She isn't very lenient about grading but her rubrics are super straightforward. I really liked her!", "rating": 5, "expected_grade": "A", "created": "2023-12-07T17:22:58.171547Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Absolutely amazing teacher! Connects with his students and really cares. 100% recommend him to anyone and everyone.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T17:44:36.949244Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "He really wants you to have a good grade in the course but he does narrow down the rubric for speeches really specifically. And is strict with attendence and rules. But he is very nice and you will get an A.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T17:45:13.606606Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Teacher mad calm", "rating": 5, "expected_grade": "A-", "created": "2023-12-07T17:46:31.249449Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "I loved Prof. Gormong for this class! I know some other reviews said that he graded harshly, but I asked him about it and he said that his old boss required this stricter grading, but his new boss does not. He graded my class very leniently. The rubrics for the speeches were really clear and you'll get a good grade if you follow it. We also had weekly quizzes based off of the textbook, but I just did control F for all of the topics and took like one note each topic and got a 100 on almost all of the quizzes.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T17:58:30.089617Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Professor Gormong is so kind and genuinely cares so much about his students. This class could be really annoying but he really tries to make it as painless as possible. He made us do a lot of practice which may seem annoying at the time but it actually really helped me improve. I feel like my public speaking skills really improved a lot and I got a lot more confident. Theres four big speeches which get progressively a little harder, but he prepares us really well and as long as you follow the rubric you should be totally fine. There are like maybe 10 small quizzes based on the textbook but they're really easy and you don't usually need to read the textbook in depth. Definitely try to get Gormong if you can!", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T21:15:06.069143Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "At the beginning of the year, I did not expect to like Dr. Sefton at all but I ended up loving her. Yes, she is a hard grader and overall doesn't mess around (no phones in class, no headphones, etc. etc.) but you can tell she cares about her students. Yes, speeches are hard and scary but that's something you'd get with any communication class. Also, this class sounded like a lot less work than some of my friends' communication classes so keep that in mind. Outside of the time I spent writing speeches (which was only once and a while), I spent virtually NO time doing homework in this class. We had readings but I never read any of them and it never mattered. The best way I can describe Dr. Sefton is comparing her to a stern mom, tough love but makes you respect her and succeed in the course.", "rating": 5, "expected_grade": "A", "created": "2023-12-07T21:31:39.791895Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is the absolute GOAT.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T02:46:00.366469Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "In my opinion, she is an exceptional professor who consistently offers assistance whenever required. There have been various instances where her guidance during office hours proved invaluable in clearing up all of my uncertainties and worries. Despite coming across reviews criticizing her grading style as overly strict, I must respectfully disagree. Based on my experience with her class, she is a fair grader.", "rating": 5, "expected_grade": "A", "created": "2023-12-08T15:14:11.604933Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Professor Gormong is a great teacher. He very clearly truly cares about his students and tries his best to ensure his students succeed not only in his class but in life in general. Super friendly guy. The class itself is easy if you do the work and he offers plenty of extra credit opportunities.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T19:12:36.028947Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Amazing professor! I recommend anyone who has to take a Comm class to take Professor Gormong's class. He is very understanding and wants you to succeed. He truly cares about his students and takes the time to make personal connections.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T19:13:19.472920Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Professor Gormong is a caring and dedicated professor who genuinely cares about helping his students improve.\r\n\r\nThere are 3 graded speeches, a group presentation, and a final presentation. A lot of class times are dedicated to short practice speeches which are graded by participation. Sometimes there are quizzes based on the info from the textbook but it's mostly common sense. Just show up to class to continue collecting participation points.\r\n\r\nA lot of the reviews here state that he doesn't give much extra credit, but he has changed his policy and offers 4 extra credit opportunities over the semester.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T19:18:27.260450Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Please, please take this class with Dr. Sefton! She is very, very passionate about what she does and makes the class incredibly engaging. I did not ever utilize her office hours, but I heard from fellow classmates that she was very helpful and essentially made sure that they couldn't do anything OTHER than get an A on their speeches. \r\nYour grade in the class will depend mostly on four key speeches, which grow in point value as the semester goes on. If you follow the rubric and get help if you need it, you will do well. She is a tough grader, but not completely unfeeling—ask for help and you will get it. Take advantage of her office hours, and don't be afraid to talk to her in general! I thoroughly enjoyed this class. \r\nShe is NOT lenient with assignments turned in after the 24hr grace period without communicating with her prior, which makes sense, but just be aware of that. Don't be afraid to email her to let her know what's going on, either. She is as accommodating as possible and will do what she can to make your life easy. She's great!", "rating": 5, "expected_grade": "A", "created": "2023-12-10T00:59:14.216781Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Very very nice professor who is understanding and very accommodating. I highly recommend taking him for this course because he does help teach motivation and get you prepared for public speaking. This class would not have been my first choice by any mean, but I am glad that I took it with Mr B because he did help a lot with my public speaking comfort.", "rating": 5, "expected_grade": "A", "created": "2023-12-10T22:27:14.283635Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is an amazing Professor. He is very generous with grading speeches, and treats this class like the 100 level class its supposed to be. He builds good relationships with his students and creates a positive learning environment every day. There are four speeches which make up the majority of your grade, but if you practice you will be fine. George is there to help you overcome any anxiety you may have. Attending this class is genuinely enjoyable. Take George for this required Gen-Ed, trust me.", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T20:25:41.463419Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "The reason Professor Gormong's ratings are so low is because they are from when he was a harsher grader/instructor which is no longer true. I took this class completely uncomfortable with any form of public speaking but he really made the class welcoming, comfortable, and inclusive. The class consists of weekly practice pass/fail speeches, weekly (easy) quizzes, and 5 big speeches. As long as you put in effort and show that you tried you will get good grades in this class. (the lowest grade on our big speech was an 84). Professor Gormong really cares about his students and is extremly accommodating because of it. He gives you all that you will need to be successful in his class, and makes it fun and lighthearted at the same time. This class was a refreshing break from my harder classes and gave me a chance to breathe. I really recommend this professor for INAG110.", "rating": 5, "expected_grade": "A", "created": "2023-12-12T03:12:33.395332Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "One of my favorite professors ever. She is genuinely so kind and friendly. For all your speeches if you write your outline before the due date, you can email her and she will provide feedback that pretty much ensures you get 100% on the structure part of the speech rubric. There were textbook readings we were supposed to read before class but there was no need for you to read them since there were no tests or quizzes on the textbook and she would repeat the same stuff in her lecture that day. There were 4 recorded assignments throughout the semester that were very easy and didn't take too long, and other than that the only work for her class was preparing for the speeches. I didn't find her to be a tough grader and if she noticed the majority of people missed some component of the speech she would not take points off anyone for it and instead called it an error of her teaching. She randomly partners you up with people in class which might seem scary but made you more comfortable with everyone in the class and made speaking in front of them far less intimidating.", "rating": 5, "expected_grade": "A+", "created": "2023-12-13T02:45:21.904255Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Great professor, understands that this is an easy class that most students are taking to cover their comm credit. Doesn't grade harshly, even if you don't like public speaking, very accommodating and offers extra credit, both assignments and for participation. We had three speeches, with a few more really minor ones, and our \"final\" was a simple creative project, but we got to vote for it, so might be different in other classes. Additionally, Prof. Mays-Williams is really kind and friendly, loved her as a person. Plus, class size was small (15-20 students), so overall chill, friendly atmosphere, and made speeches much less nervewracking in front of a small audience. Would definitely recommend!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-13T03:07:07.776960Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Just the best teacher. Didn't care that my presentation were obsessively about cars (240sx)", "rating": 5, "expected_grade": "A-", "created": "2023-12-13T04:23:30.295798Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "If you're someone who thrives under very specific direction you will love Dr. Sefton. She lays out expectations very clearly: structure for your speech outlines, notecards, speech structure, even body language.  You can practically know what you'll get on a speech or assignment before even doing it if you just follow the rubric and especially if you go to office hours (she's very willing to help). However because the directions are so specific there is not much room for error with her grading. There are assigned textbook readings but tbh you do not need to read any of them, she covers the topics fully in class. Definitely recommend, I feel like I will actually be using a lot of the things she taught in my future presentations", "rating": 5, "expected_grade": "A+", "created": "2023-12-14T14:24:50.483182Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "She's a pretty standard professor, not hard to do well in the class if you put in the time. Class was basically mandatory as there were small assignments every class. There were four major speeches in which you could basically talk about whatever you wanted (not hard), but her grading could be a bit harsh considering. Topics covered in class were interesting enough and useful in a communications setting. Overall she was fine.", "rating": 3, "expected_grade": "A", "created": "2023-12-15T02:40:27.101145Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "I hate speeches, but love George. Ends class early often, and sometimes cancels. The lecture feels more like a conversation cuz it's so chill. Just practice your speeches a couple of times and you're good.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T07:07:47.099793Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Professor Gormong is one of the best professors I have had during my academic career at UMD. Not only does he grade fairly, but he makes the class easy with his quizzes, worksheets, and speeches. Regardless, of the previous reviews from a year ago up to now. I assure you he is one of the best INAG-110 professors on this campus. If you put in the work and effort YOU will pass. So please take his class as he grades very fair and cares about every single one of his students. Please do not judge a book by its cover this review should be the most current as of why you should take his INAG-110 class. His quizzes require you to read the online FREE version of the textbook, but at max it takes 20-30 minutes to review the content. So expect a tiny bit of the work to be put into that. Practice speeches are quite easy if you put in the time and effort only taking 10-15 minutes of my time to do. Please take this class, great professor, great takeaways from public speaking, and an easy A if you put the work into it.", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T20:16:13.784772Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "I loved George, and he was super laid back, the work was at times non existent for this class. Great guy, and made class fun. Please take him!", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T07:34:35.736310Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "I loved INAG110 with Dr.Dunning. Though the class is lecture-based, taking notes is not required since the majority of the learning is done through practicing the different speech structures you'll learn in class. Dr. Dunning is hilarious and finds ways to apply all the concepts in the course to our daily lives. This class is an easy A (so long as you \"don't reinvent the wheel\" and follow the rubric). This semester the final was a video you could pre-record where you explained how to give a speech. I loved this class! It's my favorite gen-ed yet!", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T16:12:21.460670Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam the man is an absolute G. Class was a cakewalk and actually fun to go to. For one of the three speeches we did, I did not practice at all and managed to get an A on it somehow. The guy wants you to succeed and makes it impossible to fail. You just need to go to class and do all of the work the way that he tells you to do it. He even brought in his wife one day and she even made us treats for the beginning of every night.", "rating": 5, "expected_grade": "A", "created": "2023-12-18T05:48:41.744413Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "Awesome. Take her. Warning: She does not accept late work. Besides that, take her!!!!!!! As a stem student, this class was very refreshing. Nice to actually see an A for once.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T11:28:26.243676Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Like many other reviewers, I have to say that Dr. Dunning's lectures were very engaging. His class was also pretty easy. There were three speeches, an introduce-yourself talk (free points), a final project (explain how to write a speech), and open-book quizzes on Canvas (no due date, and you can take 'em twice.) If you're naturally confident and like public speaking, this is an easy A. It took me about a hour and half to whip up each speech and only minimal practice to deliver them. If you're newer to public speaking, I would still highly recommend Dr. Dunning's classes--there's a lot of practice speaking spontaneously in classes, and he is very helpful in office hours as a sounding board for your speeches. Plus, the speeches are graded pretty leniently as long as you adhere to the structure he teaches in class and the rubric he gives you.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T15:24:32.639014Z"}, {"professor": "Amy Fisher", "course": "INAG110", "review": "Amy is probably the best professor you could take to fulfill your communication credit. She understands that a comm class isn't the focal point of your education, and she designs the course that way. There are only 4 speeches throughout the whole semester, and those are basically the only grades. She grades very leniently, so as long as you put effort into the assignments, you'll get an A. She's also incredibly nice and is a joy to be around. You should 100% take this course if you need to fulfill your FSOC credit.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T23:41:11.636800Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Take another comm professor at the end of the day, regardless if they're rude or not as long as u get that A. Honestly shes is a very sweet professor and I've learned a lot going to her class but shes is very nitpicky about minor details and it adds up in the end. I ended up getting a B+ and was on the edge of an A and she refused to round up. Her class is very dependent on attendance and speeches, so if your not good at presenting or refuse to show up to class... womp womp", "rating": 3, "expected_grade": "B+", "created": "2023-12-20T00:48:01.158312Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "One of the best professors I've ever had. His teaching style can be a little quirky and he has a clear no-phone policy (you get extra credit at the end if nobody uses it though). Still very engaging!", "rating": 5, "expected_grade": "A", "created": "2023-12-20T02:36:59.855201Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Great person all around.  If you meet all of the requirements for your speech, she will give you full points.  Any comms class will push you out of your comfort zone if you're not accustomed to public speaking, but she makes it doable for her students.  Her class has a very light workload.  There are 4 total speeches, ranging in time requirements from 1.5-10 minutes, a handful of open-book take-home quizzes (free points), small assignments here and there, and a few extra credit assignments.  My class had no midterm and a final assignment.  In all, Prof. Mays-Williams is such a kind, understanding, and intelligent professor that will make your comms class a breeze :)", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T02:08:33.915471Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Going into this class I was expecting to not do well. I was really bad at public speaking and I just took the class to fulfil the general education requirement. The class was certainly a challenge if you don't have a lot of public speaking experience. However, the challenge is completely manageable because there are no surprises. For each speech the professor goes over exactly what is expected of you and as long as you do what your asked you will get a good grade. The class schedule is generally easier than COMM107. However, the last presentation is quite a step up in difficulty from the rest of them. If you're bad at public speaking (like me) the class will require a good amount of prep work before each speech. I know this might all sounds bad but I promise that the class is more than fair. Dr. Sefton is an incredible professor. She is so supportive and understanding.  If you need help with any of the speeches or have any questions she will always help at her office hours. She lets students restart their speeches if they messed up and tries her best to make sure everyone understands that its ok to make mistakes. The learning environment was so supportive, even from the classmates. It felt like we were all a team that was suffering through the pain of public speaking together. This class and Dr. Sefton helped me grow so much as a public speaker. This is why I would recommend this class to anyone. With a little bit of effort you will easily pass this class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T18:40:07.548641Z"}, {"professor": "Chelsea Mays-Williams", "course": "INAG110", "review": "Course: Course was public speaking with other assignments focusing more on interactions with others and inclusivity. Quizzes you can CTRL F the textbook pages. Speeches progressively get longer as the year goes on. I finished with a 100.04%\r\nBreakdown:\r\n- Speeches (4), 60%, these go Introductory, Informative, Persuasive, and Professional. The times go from 1-2 minutes, 4-5 minutes, 6-8 minutes, 8-10 minutes, respectively. It sounds intimidating but if you choose a topic you are actually interested in, it goes by pretty fast. The last two have visual aid slideshows. These get easier as you have more practice, and as long as you prepare well, then you should be fine.\r\n- Assignments (11), 35%, these include chapter quizzes, speech reflections, and impromptu speeches. Chapter quizzes are pretty easy as long as you can find it in the textbook, speech reflections should take no longer than 15 minutes to complete, and impromptu speeches are kind of like pop up speeches on the fly, but are really easy. Just talk about something that you like about for 1 ½ - 2 minutes and you will get points.\r\n- Final, 5%, this is really easy. You get to vote as a class as to what you want your final assignment to be, and ours was to create an advertisement. I finished it in 20 minutes virtually asynchronous and got 100%.\r\n\r\nProfessor: SHE IS THE BEST! She is very understanding of the fact that public speaking is a hard skill and a very big fear of many people, and makes the class a very warm and welcoming environment. She WANTS all of her students to end with an A+, and those who came to class and put in minimal effort ended up with an A. She is super nice, cares about every single person, and she felt more like a very knowledgeable friend rather than my professor. I would recommend anyone to take her for a communications class, if they’re ok with earlier classes (class starts anywhere from 8:00 - 10:30 AM). If there is only 8 am left, take it, it's worth it!", "rating": 5, "expected_grade": "A+", "created": "2023-12-26T16:53:00.876550Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "All the reviews saying that he was a harsh grader no longer apply. He explained to my class that he had been required to do so in the past due to his old boss, however he has since changed his teaching style. He gives you all you will need in order to be sucessful in the class, as well as provides good feedback to help you do better on your next speech. The class consisted of weekly pass/fail practice speeches, reading quizzes (super easy), and 5 big speeches. This class can truly help you become a better public speaker as Professor Gormong truly cares about the success of his students.", "rating": 5, "expected_grade": "A+", "created": "2024-01-03T21:03:58.194093Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "This was a pretty easy class and attendance was not mandatory. He provides a clear rubric to follow, and everyone pretty much gets a 90-97 on every speech (based on canvas highs-lows). He said that \"mandatory\" class activities factored into our final grade, but I don't think he ever ended up putting them in. It's still nice to go to class and hear his lectures/participate in activities because they tend to be fun and he gets to know you better (and might give you a higher speech grade if he recognizes you).", "rating": 5, "expected_grade": "A", "created": "2024-01-13T20:00:19.249945Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Dr. Sefton was a really enjoyable professor. There were 4 speeches that made up the majority of your grade. Each were a a little longer than the last but nothing difficult. You can choose what to talk about. She goes over everything needed to get a good grade and explains each part thoroughly. She always offers extra help and responds quickly. There are some recorded assignments but none are difficult. There are many readings assigned but they aren't necessary to do as she goes over each chapter during lectures. In class she lectures about the chapter each week and has you do some small 5 point assignments that do add up but aren't worth much of the grade. The fourth speech is done in the last weeks of class. The final is a recorded submission. Overall, Dr. Sefton is a great professor and wants to help you succeed. Her class gives you valuable skills you are guaranteed to use in the future and I would recommend taking INAG110 with her.", "rating": 5, "expected_grade": "A", "created": "2024-01-18T21:26:38.544769Z"}, {"professor": "Lori Sefton", "course": "INAG110", "review": "Awesome professor! She cares a lot about students and is always available to help with anything you need. As long as you go to class you'll be fine, the only homework is writing speeches for the most part.", "rating": 5, "expected_grade": "A", "created": "2024-01-19T17:47:19.078874Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George was a great professor that actually cares about his students' wellbeing. Not only was he an understanding grader but he truly made you feel heard and supported. I would take him again if I could. He makes every class enjoyable and understands that students have heavy workloads. He responds to emails super fast and is really attentive in class. I felt like I actually learned how to be a better speaker without all the stress of public speaking.", "rating": 5, "expected_grade": "A", "created": "2024-01-31T21:02:39.261910Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is amazing, great teaching style and enjoyed his class!!", "rating": 5, "expected_grade": "A", "created": "2024-02-02T20:03:37.675161Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Prof Dunning is the best. He makes his lectures fun and engaging. He grades relatively lightly on the speeches. Easy A. Take him if you can.", "rating": 5, "expected_grade": "A", "created": "2024-03-01T01:20:33.403975Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Professor Gormong is one of the best professors in my opinion. He is the sweetest person out there and very understanding. He doesn't grade harshly at all and is very fair. I would recommend him to anyone! The one downside to the class is having to do mini speeches each class but everyone gets a 100% on them so it helps if you don't do as well on a quiz or actual speech. He really cares about each of his students and takes the time to get to know everyone!", "rating": 5, "expected_grade": "A+", "created": "2024-04-09T18:28:19.439082Z"}], "department": "INAG", "course_number": "110", "name": "INAG110", "title": "Oral Communication", "credits": 3, "description": "<b>Credit only granted for:</b> COMM107, COMM200, INAG110, JOUR130, THET285.\nA study of how perception, self-concept, and verbal and nonverbal communications affect the communication process as it emerges in the workplace.  The course provides skill training in speech writing, public speaking, group communication, interpersonal communication, listening, and responding.", "is_recent": true, "geneds": null}