{"average_gpa": 3.4885004599816005, "professors": ["Jessica Vitak", "Sarah Gilbert", "Shawn Janzen", "Daniel Greene", "Nicol Lee", "Sydney Triola", "Chad Doran", "Philip Piety", "Jason Aston", "Galina Madjaroff", "Francesca Polito", "Francesca Polito", "Jesse Klein", "Chad Doran", "Amelia Gibson", "Travis Wagner", "Chad Doran", "Amelia Gibson", "Jaumarro Rose", "Jesse Klein", "Yue Xin", "Alia Reza", "Angela Rodgers-Koukoui", "M Sauter", "Travis Wagner"], "reviews": [{"professor": "Daniel Greene", "course": "INST466", "review": "Extremely close minded - don't take this course if you want to think freely. Extremely hard and frequent readings, tries to come off as a cool person - but is extremely mean, and not considerate at all.", "rating": 1, "expected_grade": "B+", "created": "2019-09-26T16:26:22Z"}, {"professor": "Sydney Triola", "course": "INST466", "review": "Professor carries a far-left social justice political bias, which can be scary. The class is generally easy, but the course is constantly about being oppressed as a person of color and how women are treated the worst. This class is generally easy, but a lot of the research you will deal with will result in backlash due it not fitting her “bias”.", "rating": 1, "expected_grade": "B", "created": "2020-01-30T20:38:08Z"}, {"professor": "Sydney Triola", "course": "INST466", "review": "This professor pushes a far-left, social justice agenda and is generally biased to people who may disagree or remain as a \"centrist\". The professor pushes leftist agenda and constantly speaks about oppression of colored people and women and how technology has harshly affected them. The class is generally easy, but it shows lots of bias in the context of the teachings in the class. Biased news articles are always used as reference points, etc.", "rating": 1, "expected_grade": "B", "created": "2020-01-30T21:14:50Z"}, {"professor": "Sydney Triola", "course": "INST466", "review": "Terrible. One of the worst professors I have ever had in my life. She pushes her agenda on the students and hates when people disagree with her. She corrects students on a daily basis even when she is wrong. She shouldn't be teaching until she learns how to not be biased as hell and push political narratives on all her students. She doesn't deserve a job here. HORRIBLE.", "rating": 1, "expected_grade": "B", "created": "2020-02-27T16:29:51Z"}, {"professor": "Sydney Triola", "course": "INST466", "review": "Absolutely garbage. Worst professor I have had at this University, hands down. At one point, she gave our paper a 42% because she didn't 'like our idea' even though she gave us a good grade on the rough draft. Complete psycho. Only thing that saved me was spending hours each week on extra credit assignments. ", "rating": 1, "expected_grade": "A+", "created": "2020-10-26T02:13:14Z"}, {"professor": "Galina Madjaroff", "course": "INST466", "review": "This class is very forward and straight to the point, and simply an easy A+. You typically have one blog post every other week and then you're mostly getting your points for the class by participating in discussions in class. We talk about the various aspects of technology, culture, and society. Dr. G is a great professor, she wants you to do your best and she is always there for help. ", "rating": 5, "expected_grade": "A+", "created": "2021-11-03T14:36:07Z"}, {"professor": "Jason Aston", "course": "INST466", "review": "Great professor, passionate about his teaching, and always reasonable with expectations. Highly reccomended.", "rating": 5, "expected_grade": "A-", "created": "2021-11-15T17:34:45Z"}, {"professor": "Philip Piety", "course": "INST466", "review": "Had piety for 335 and 466, terrible experience that comes with constant nagging and personal criticism from him. Will waste your time and give you busy work assignments.", "rating": 1, "expected_grade": "B-", "created": "2022-03-07T19:10:45Z"}, {"professor": "Philip Piety", "course": "INST466", "review": "These reviews speak for themselves. If you can, please do not register for any of this mans classes. It will save you a lot of unnecessary stress. Would give 0 stars if I could. ", "rating": 1, "expected_grade": "", "created": "2022-05-12T02:13:55Z"}, {"professor": "Chad Doran", "course": "INST466", "review": "Recently took this course over the summer and currently taking another one of his courses in the fall. Great professor with fast and efficient communication. Weekly discussions, one final project, and small reports here and there. 100% recommend taking any course he offers.", "rating": 5, "expected_grade": "A+", "created": "2022-09-11T18:29:16.051557Z"}, {"professor": "Travis Wagner", "course": "INST466", "review": "Professor Wagner overall was a great professor and made sure everyone was learning in the class. The class consist of weekly readings, book reports, group project, and other assignments. Overall this class was not hard it was very simple and laid back would definitely recommend to others.", "rating": 5, "expected_grade": "A+", "created": "2023-05-11T20:08:10.776873Z"}, {"professor": "Jesse Klein", "course": "INST466", "review": "She is genuinely a cool person and I really enjoyed her class for it being a discussion based one. Every class was like a conversation (rather than a boring lecture) about how technologies interact with society, but it was fun and interesting! If you participate the better your experience will be, as the discussions are engaging when you pay attention, and rather than saying correct answers it’s about asking questions and stating opinions. There are weekly writing assignments, but they’re pretty simple and straightforward. Recommend!", "rating": 5, "expected_grade": "A+", "created": "2023-12-20T22:28:34.684677Z"}, {"professor": "Jesse Klein", "course": "INST466", "review": "Very down to earth professor that runs her class through conversation rather than lecture and does it really well. She's very in touch with topics and current events. Workload was pretty small, with there being a couple weekly readings and then a group project at the end. Take her if you can!", "rating": 5, "expected_grade": "A", "created": "2024-01-31T18:09:43.681861Z"}], "department": "INST", "course_number": "466", "name": "INST466", "title": "Technology, Culture, and Society", "credits": 3, "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (INST201, INST301).\n<b>Restriction:</b> Must be in the Information Science program.\nIndividual, cultural, and societal outcomes associated with development of information & communication technologies (ICTs), including pro- and anti-social factors. Unpacking how gender, race, ethnicity, sexual orientation, disabilities, and political affiliations affect consumption and production of online experiences. Unpacking how structures of dominance, power and privilege manifest at individual, institutional and cultural levels.", "is_recent": true, "geneds": null}