{"average_gpa": 3.1682634730538917, "professors": ["Yoram Peri", "Moran Stern", "Joseph Ringel", "Eran Eldar", "Shay Hazkani", "Paul Scham", "Paul Scham", "Paul Scham", "Paul Scham"], "reviews": [{"professor": "Moran Stern", "course": "ISRL342", "review": "Honestly, Moran is a good instructor. He is more than willing to help his students succeed in his class. He does not tolerate any nonsense in class so do not slack off. To be successful, you must READ and ask for help. If you put in effort, he will go above and beyond to help you. If you slack off, you're on your own. ", "rating": 5, "expected_grade": "B-", "created": "2018-06-11T19:25:18Z"}, {"professor": "Shay Hazkani", "course": "ISRL342", "review": "Prof. Hazkani is a good teacher but a very demanding one. He's certainly a goldmine of info and is certainly an interesting lecturer but his teaching style leaves something to be desired. He's not very good at responding to emails so all your communication with him will probably happen during or after class. Sometimes, you'll have to keep asking the same thing to get the answer you want. I took his class in Spring 2020, but he did not at all adjust to pandemic circumstances - he demanded that we keep our cameras on and there were no exceptions for late work.", "rating": 4, "expected_grade": "", "created": "2021-05-03T13:33:08Z"}, {"professor": "Paul Scham", "course": "ISRL342", "review": "Hes very knowledgeable, but has some sort of medical condition that makes it difficult for him to be an good lecturer. The class itself is very interesting. It is very reading heavy, so be prepared to read a lot and discuss them in class. ", "rating": 3, "expected_grade": "A", "created": "2021-12-13T22:28:44Z"}], "department": "ISRL", "course_number": "342", "name": "ISRL342", "title": "History of Modern Israel", "credits": 3, "description": "Cross-listed with HIST376.\n<b>Credit only granted for:</b> HIST376 or ISRL342.\nHistory of modern Israel since the beginning of the Zionist settlement in 1882. Attention to different interpretations and narratives of Israel's history, including the historical and ideological roots of Zionism, the establishment of the State of Israel, ideological forces, wars, and the triumphs and crises of democracy.", "is_recent": true, "geneds": null}