{"average_gpa": 3.6345291479820627, "professors": ["Kevin Klose", "Christopher Hanson", "Sohana Nasrin", "Jacoba Incollingo", "Miranda Kennedy", "Sara Browning", "Christopher Hanson", "Christopher Hanson", "Christopher Hanson", "Christopher Hanson", "Christopher Hanson", "Christopher Hanson"], "reviews": [{"professor": "Christopher Hanson", "course": "JOUR456", "review": "Pretty long and boring class. You have weekly readings which are interesting then you have a roughly 2-hour discussion about them. You have to lead one eventually (he picks which day). The grades come from participation, leading a discussion, and a short essay plus the final. The short essay is a few pages and the final is 2,000-2,500 words and is based on a book you choose from a list. I am a science major and I took this bc I thought it was gonna be easy which it was in a way, but pretty boring to me. I ended up skipping a few classes. I don't love writing but it wasn't too bad. Probably would liked it more if you are an actual journalism major.", "rating": 3, "expected_grade": "A+", "created": "2021-12-03T03:17:49Z"}, {"professor": "Christopher Hanson", "course": "JOUR456", "review": "Great class if you contribute to discussions and the rest of your class is also willing to. Hanson is a decent guy and interesting to listen to. He answers a lot of his own questions, but try to contribute as he really appreciates it. Also, do the readings -- they are genuinely good and varied reads. He doesn't ask for much except for participation & the class never goes for the full time on Testudo, so don't worry about that. Midterm is a paper, final is a paper -- both require minimal time/energy. He is a pretty cool dude, with extensive experience in reporting, not sure if it's totally relevant to how the news goes these days though.", "rating": 4, "expected_grade": "A-", "created": "2023-12-13T06:29:45.369366Z"}], "department": "JOUR", "course_number": "456", "name": "JOUR456", "title": "Literature in Journalism", "credits": 3, "description": "<b>Credit only granted for:</b> JOUR456 or JOUR673.\nFrom Truman Capote's In Cold Blood to Mark Bowden's Black Hawk Down, students will examine how literary works can help writers approach a subject in a different way than more traditional forms of journalism, including the advantages and limitations of the style.", "is_recent": true, "geneds": null}