{"average_gpa": 3.567289719626168, "professors": ["Maxine Grossman", "Maxine Grossman", "Maxine Grossman", "Maxine Grossman"], "reviews": [{"professor": "Maxine Grossman", "course": "JWST171", "review": "I have very mixed feelings about Professor Grossman. I think she is nice and the class itself isn't hard. I am just personally not a big fan of her grading methods. The entire course is just weekly response assignments, a research paper, and a final paper. The response assignments are all 120 words where you pick one sentence from the readings and write about it. It's difficult because she wants you to go to deep detail and make connections to other readings but limits you to 120 words and gets mad when you go over. Nothing is ever really good enough for her regarding the response assignments. The research paper is a topic of your choice and it's paced through the semester which I like. The downside is she's very unclear about what she wants for the research paper. She emailed the whole class after we submitted our sample paragraphs saying that most of them were C- material and not once did she think \"hmm maybe I'm the problem instead of the entire class.\" In the end, it's not a hard course and it fulfills a lot of credits so I say take it but be prepared to be annoyed by a lot of things. Oh and the structure of the class was full attendance for the lecture on Tuesday and on Thursdays half the class meets for the first 40 minutes and the other half meets for the last 40 minutes for discussion.  ", "rating": 3, "expected_grade": "", "created": "2021-04-25T18:19:49Z"}, {"professor": "Maxine Grossman", "course": "JWST171", "review": "Overall a solid class with a focus on thinking over getting \"correct\" answers like is seen in stem classes. Dr. Grossman is generally very interested in what students have to say, and is passionate about what she teaches. She handles difficult topics well and is a fair grader. There were weekly assignments based on readings and in-class discussions, as well as three papers (including a final paper). If you have questions, she is accessible and makes time for her students. A fair bit of work for a GenEd, but worth it.", "rating": 5, "expected_grade": "A+", "created": "2023-12-26T15:26:35.548373Z"}, {"professor": "Maxine Grossman", "course": "JWST171", "review": "Super nice, friendly, and cares for the students. If you do the readings and pay attention to her lectures, you should do well in the class. Definitely one of the more interesting gen eds to take!", "rating": 5, "expected_grade": "A", "created": "2024-01-31T02:47:56.247187Z"}], "department": "JWST", "course_number": "171", "name": "JWST171", "title": "Is Judaism a Religion?", "credits": 3, "description": "<b>Cross-listed with:</b> RELS171.\n<b>Credit only granted for:</b> JWST171 or RELS171.\nJewish identity can be framed in terms of ethnicity, culture, and religious practice, but also in terms of more contemporary social constructions including social action, political engagement, and intellectual pursuit. In the context of such diverse social and individual frames, what does it mean to identify Judaism as a religion? Attention to Jewish society in historical and global perspective will provide a backdrop for a particular focus on contemporary Jews in the United States and Israel.", "is_recent": true, "geneds": null}