{"average_gpa": 2.879411764705882, "professors": ["Lauren Strauss", "Marsha Rozenblit", "Marsha Rozenblit", "Marsha Rozenblit"], "reviews": [{"professor": "Marsha Rozenblit", "course": "JWST141", "review": "I wish I could write a positive review for Professor Rozenblit. Unfortunately, JWST141 is not an introductory level class and nor is it worth the effort. I attended close to every lecture, took thoughtful notes, and submitted assignments on time. In a separate course in the same semester, I earned A's and B's on papers. In Marsha's class, I was lucky to get a C, and with four assignment's throughout the semester, that does not leave much room for improvement. I took the class as an elective, hoping to expand my Jewish learning and to embrace Jewish history in America. Instead, I received my lowest grade in my undergraduate career. And this is coming from someone who has taken intro Biology and Chemistry.", "rating": 1, "expected_grade": "", "created": "2021-03-04T16:16:18Z"}, {"professor": "Marsha Rozenblit", "course": "JWST141", "review": "Professor Rozenblit is a traditional lecturer. This may be a bit of an adjustment to first-year students, but if one takes good notes and asks thoughtful questions in class, they will succeed. She is very knowledgeable about her field and presents the information in an organized way, usually giving an overview of every lecture's content before delving in. She assigns readings that more reinforce what she teaches, as the meat of the content is in her lectures. To succeed on exams, a lot of prep and memorization of details is necessary, but it's an easy A if the time is spent.", "rating": 5, "expected_grade": "A+", "created": "2021-09-12T14:31:12Z"}, {"professor": "Marsha Rozenblit", "course": "JWST141", "review": "JWST 141 is just not it if your looking for an easy elective course. This class pretty much only has four grades that you have to spend a lot of time on so you don’t screw your final grade. I’ve taken other history classes and I’ve done really well in and gotten A’s but taking this class I’ve gotten C+ at best. She nitpicks everything and requires you to be incredibly specific with examples from her lectures which have too much information at times and are incredibly monotonous. ", "rating": 1, "expected_grade": "", "created": "2021-12-16T15:54:39Z"}, {"professor": "Marsha Rozenblit", "course": "JWST141", "review": "Do not take this class if you want an easy A. It only has 4 assignments and they are all somewhat difficult for this being a 100-level class. Take something else.", "rating": 1, "expected_grade": "C", "created": "2023-12-13T22:30:07.860856Z"}], "department": "JWST", "course_number": "141", "name": "JWST141", "title": "American Jewish Experience", "credits": 3, "description": "Cross-listed with HIST106.\n<b>Credit only granted for:</b> HIST106 or JWST141.\nHistory of the Jews in America from Colonial times to the present. Emphasis on the waves of migration from Germany and Eastern Europe; the changing nature of the American Jewish community and its participation in American social, economic, and political life.", "is_recent": true, "geneds": null}