{"average_gpa": 3.0175637393767705, "professors": ["Ronald Mower", "Brandon Wallace", "Ronald Mower", "Brandon Wallace", "Ronald Mower", "Ronald Mower", "Ronald Mower", "Ronald Mower", "Ronald Mower", "Ronald Mower", "Ronald Mower"], "reviews": [{"professor": "Brandon Wallace", "course": "KNES225", "review": "He is an excellent teacher, and his subject is fascinating. In his class, he has two main papers and one project. All of the tasks are easy. I would encourage everyone to attend this class because not only is he an excellent teacher, but I didn't realize there was so much to learn about black manhood in sports.", "rating": 5, "expected_grade": "A", "created": "2021-12-08T21:14:45Z"}, {"professor": "Ronald Mower", "course": "KNES225", "review": "I took this class as a last-minute class because it satisfied a gen ed code for me and sounded interesting, and I'm really glad I did. Dr. Mower is so passionate about what he teaches and genuinely cares about each and every one of his students. He keeps his students engaged all class and doesn't just assign useless work. Each week he gave us interesting readings (sometimes videos) and we would have to do a discussion post and article annotation. At first, they took time, but once you get in the groove they are really easy. There are 3 mini-essays, which I found actually to be enjoyable which are accompanied by 3 quizzes. The quizzes are open notes but can still be challenging because they ask very specific questions about the readings and lectures. There is also 1 media-text project which I enjoyed but it was very time-consuming. I really enjoyed his class and would definitely take another one with him. His TA Emilio is also great, and grades really fairly. If you need an easy gen-ed I would definitely recommend this class.", "rating": 5, "expected_grade": "A-", "created": "2023-01-23T19:11:08.009334Z"}, {"professor": "Ronald Mower", "course": "KNES225", "review": "A bit of reading, but very interesting class and on the easier side of classes.", "rating": 5, "expected_grade": "A", "created": "2023-12-07T03:29:55.173197Z"}, {"professor": "Ronald Mower", "course": "KNES225", "review": "Good professor! You can tell he’s passionate about his work! He is understanding and doesn’t assign too much. Drops a good few assignments at the end of the semester and the content is really interesting! Class could get a bit dry at times but maybe it was the time of day (my class was later in the evening). I recommend! Had a media text project at the end that I found fun as well!", "rating": 4, "expected_grade": "A-", "created": "2023-12-30T19:04:38.601158Z"}], "department": "KNES", "course_number": "225", "name": "KNES225", "title": "Hoop Dreams: Black Masculinity and Sport", "credits": 3, "description": "<b>Credit only granted for:</b> KNES289R OR KNES225.\n<b>Formerly:</b> KNES289R.\nHas sport disadvantaged African American males? This course critically examines sport as a site where notions of black masculinity are publicly debated, critiqued, challenged, celebrated, and also transformed. Utilizing an interdisciplinary approach, this course explores how sport has been invoked across the political and ideological spectrum to interrogate a number of issues impacting the life chances of young, African Americans males including educational attainment, poverty, social mobility, racism, cultural production, and notions of masculinity.", "is_recent": true, "geneds": null}