{"average_gpa": 3.3103603603603604, "professors": ["Tim Kiemel", "Tim Kiemel", "Tim Kiemel", "Tim Kiemel", "Tim Kiemel"], "reviews": [{"professor": "Tim Kiemel", "course": "KNES226", "review": "The class is pretty average. He reads right off the power points and goes through the slides so fast it's hard to write notes. But he posts the power points after class, which was helpful. The exercises are pretty easy, and we get to take our quizzes twice, which is nice. ", "rating": 3, "expected_grade": "A-", "created": "2021-12-19T00:45:47Z"}, {"professor": "Tim Kiemel", "course": "KNES226", "review": "The way that Dr. Kiemel grades the class makes it impossible to get lower than a B in the class if you just do the work. If you put a little effort into studying for the exams, an A is super attainable in this class. Overall, the lectures are boring, but I would highly recommend this class if you want an easy A.", "rating": 3, "expected_grade": "A", "created": "2021-12-23T03:26:27Z"}, {"professor": "Tim Kiemel", "course": "KNES226", "review": "He's a nice guy class is pretty straightforward. You can fail all the exams and still get a B in the class. I took this for the gen ed and didn't really put much effort into it and still pulled a B. If you put any effort into the class you can easily get an A. As a teacher, he's kinda boring since he basically reads off slides, which kinda made it hard to go to lectures. I would recommend this class though for easy an gen ed.", "rating": 3, "expected_grade": "B", "created": "2022-05-16T20:22:20Z"}, {"professor": "Tim Kiemel", "course": "KNES226", "review": "course is structured so you pass if you put little effort. It's challenging for an A or better. weekly discussions require you to present to the class biweekly which can be a hassle at times, the lectures can be really dry depending on the topic. For an A you must pass 10/12 quizzes, 5/6 present, and 90%+ avg on all 3 exams (2 exams being 25q and final being 50), finals cumulative and the final tries to trick you a good amount. The TA can be a bit harsh on grading weekly discussion assignments, but you'll still pass if you put in some effort, they're just nitpicky \r\n", "rating": 2, "expected_grade": "A-", "created": "2022-05-20T02:43:30Z"}, {"professor": "Steven Kahl", "course": "KNES226", "review": "this was a TA for knes226, honestly really nitpicky when grading your work, you're likely still to pass the assignments, but he would show up late, nitpick your work for small errors ", "rating": 2, "expected_grade": "A-", "created": "2022-05-20T02:45:09Z"}, {"professor": "Tim Kiemel", "course": "KNES226", "review": "Good professor, easy to understand and class is very structured, if you show up and do the work you should do well.", "rating": 5, "expected_grade": "A+", "created": "2023-01-23T18:17:24.112982Z"}, {"professor": "Tim Kiemel", "course": "KNES226", "review": "Great prof, easy class. A nice guy and explains the content clearly. The class is very structured, being pretty much the same thing week after week. You can have fun with the homework exercises and the homework quizzes are easy, as well as the midterms. Both all multiple choice, covering the main topics of the course.", "rating": 5, "expected_grade": "A", "created": "2023-11-12T21:26:09.186855Z"}], "department": "KNES", "course_number": "226", "name": "KNES226", "title": "The Cybernetic Human", "credits": 3, "description": "<b>Credit only granted for:</b> KNES289W OR KNES226.\n<b>Formerly:</b> KNES289W.\nCan the profound and rapid technological advances experienced in the 21st century change what it means to be human or the nature of humanity? Emergent technologies, new materials, increased computer power, engineering innovations, and groundbreaking work in the sciences of cognition and action provide myriad opportunities for repairing and enhancing the human body and brain. Examines the ethical, social, and technological implications of an increasing synergism of technology and the body in sports and the arts, at work or home, rehabilitating the body and the brain, and society at large.", "is_recent": true, "geneds": null}