{"average_gpa": 3.0753894080996877, "professors": ["Elizabeth Brown", "J Carson Smith", "Evan Brody", "Jay Goldstein", "Elizabeth Brown", "Elizabeth Brown", "Jay Goldstein", "Elizabeth Brown", "J Carson Smith", "J Carson Smith", "J Carson Smith", "J Carson Smith", "Elizabeth Brown", "Jay Goldstein", "Elizabeth Brown", "J Carson Smith", "Elizabeth Brown", "Jay Goldstein"], "reviews": [{"professor": "Elizabeth Brown", "course": "KNES350", "review": "Dr. Brown is one of the most kind, fun, and interesting professors I have had the pleasure to take classes with at UMD. I would take anything she teaches. Not only does she try to give all her students the best possible grades, but her classes are actually enjoyable. Make sure you take notes from her lecutres. They're mostly composed of personal stories so she asks questions about them on her exams.", "rating": 5, "expected_grade": "", "created": "2012-07-14T12:47:00Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "Very sweet woman. Subject matter is interesting, but attendance is pretty much mandatory. There are ways to find past notes online for her class, but solely relying on those is probably a bad idea. She makes the class fun and interesting. She also lets the class out early a lot, which is also a plus. ", "rating": 5, "expected_grade": "A", "created": "2012-05-19T18:43:00Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "Definitely one of the best classes I have taken at UMD.  Dr. Brown is hilarious and so engaging.  You would be silly not to take this class!", "rating": 5, "expected_grade": "A", "created": "2011-02-05T11:05:00Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "Dr. Brown is great. Friendly, outgoing, dynamic - her lectures were funny and enjoyable. All you need to do is write. Write down everything! write. down. everything. she. says. Word for word. All stories and examples. Just write for the entirety of the hour and twenty minute lecture each day. Also, she normally lets us out at least 20ish minutes early. She's really a great teacher and loves getting to know her students. ", "rating": 5, "expected_grade": "A", "created": "2010-12-23T23:55:00Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "Dr. Brown is the best professor I have ever had! She truly wants to see her students succeed. Her class is entertaining, and extremely fascinating. She is very engaging in her lectures, and students really enjoy being there. Her tests are all multiple choice or T/F and very very straightforward. Straight from class discussions and lectures. She tests on the most random things, just to make sure you were in class and listening, but her test averages are usually mid 80's. Overall she is probably the best teacher I have ever had and would certainly suggest taking her for anything she teaches! ", "rating": 5, "expected_grade": "A", "created": "2010-12-19T05:30:00Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "One of the best teachers in Kinesiology. Shes funny, gets to know the class on a personal level. Tests are easy- all you have to do is go to class (which is always engaging and fun) and study for 1 hr at most. TAKE 350 WITH DR. BROWN shes awesome!", "rating": 5, "expected_grade": "A", "created": "2009-04-29T02:29:00Z"}, {"professor": "Jay Goldstein", "course": "KNES350", "review": "From what I've heard KNES350 is suppose to be an easy A, however I would not recommend this professor and take the other professor (forgot the name), he grades harshly on everything, makes the class a lot harder with so many weekly busy work assignments. Makes the final exam a competition and the final barely boosts your grade at the end if your boarderline. Honestly his voice is really annoying too. I never felt the need to go to class b/c it was a waste of my time. We had a lot of group work and somehow we put our full effort and somehow barely get a B. Don't take this professor I hated him! Save yourself from the effort and time.", "rating": 1, "expected_grade": "B+", "created": "2022-12-13T06:40:33.966940Z"}, {"professor": "Jay Goldstein", "course": "KNES350", "review": "Dr. Jay is an ok professor, but the way he organizes the class makes the class itself suck. Dr. Jay is easy to contact, understanding, and helpful as a professor. The reason why I am rating this class poorly is solely based on the way he teaches. The classroom style is flipped, so you won't have any lectures during class, but rather you watch pre-recorded videos and take quizzes online. Class itself is comprised of group work and group quizzes. So a major flaw to this class is that if you get a bad group, you either have to do lots of work on top of your individual assignments, or have your grades suffer. The workload can be alot, depending on how much effort you put into the online portion. If you want to learn sports psychology and are willing to put an unproportional amount of work, this class is for you. If you want an easy A or relax, this class is not for you.", "rating": 2, "expected_grade": "A-", "created": "2022-12-23T00:26:27.484782Z"}, {"professor": "Jay Goldstein", "course": "KNES350", "review": "I loved Dr. Goldstein! I took him in Fall 2022 and had a great experience. The entire class is group work besides the weekly online quizzes. The classroom is flipped so in class, you do the group assignments and at home you watch lectures. I found the class to be extremely straightforward and easy to follow. If your group wins in your league, you do not have to take the final which is great. It all comes down to your group (they are randomized), so if you get a bad group or even one bad person in the group, LET HIM KNOW! He is very understanding and will work with you so you can succeed. 10/10 recommend.", "rating": 5, "expected_grade": "A-", "created": "2023-03-27T18:52:52.917843Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "Best professor I've ever had. She teaches by telling really interesting real life stories and relates them back to the current topic. You have to go to class since she has no slides but her humor actually makes you want to go... you will never be bored. During class take notes on everything including details of the stories and she will also point out what to write. Exams will be easy as long as you have good notes.", "rating": 5, "expected_grade": "A+", "created": "2023-03-30T16:01:16.665456Z"}, {"professor": "J Carson Smith", "course": "KNES350", "review": "Professor Carson was always willing to help and answer questions. He created a comfortable learning environment where students felt encouraged to participate and engage with the material. His lectures were okay, not over the top. \r\n\r\nHowever, my main concern was with the exams. The questions were highly specific, often requiring knowledge of specific articles or details that were challenging to memorize. While I understand the importance of critical thinking and application of knowledge, the level of specificity on the exams felt overwhelming, especially when preparing for the final exam. It would have been helpful to have a clearer emphasis on key concepts and a broader understanding of the course material.", "rating": 2, "expected_grade": "B+", "created": "2023-05-15T14:08:49.247279Z"}, {"professor": "J Carson Smith", "course": "KNES350", "review": "Dr. Smith is a great guy. But, I cannot say the same about his teaching. Exams are all online, but that does not make it any easier. Exams are brutally challenging for a class that should be an easy A. His notes were unorganized and all over the place.  Take Elizabeth Brown's class if you have the opportunity.", "rating": 2, "expected_grade": "B+", "created": "2023-05-15T14:10:22.461938Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "Dr. Brown is by far one of the best professors I've ever had. Her style of lecturing takes some getting used to, as she just talks without any lecture slides or material on the board. However, she is one of the most caring professors I've had the opportunity to learn from. Considering her exams are open note, as long as you take notes on everything she says, you will pass the class with an A, no question. She doesn't talk very fast, so typing notes on my laptop were not ever an issues. She also tends to repeat important stuff and spell out names . She is an amazing professor and I would absolutely recommend her for any course she teaches.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T00:27:04.667542Z"}, {"professor": "J Carson Smith", "course": "KNES350", "review": "Exams reflect the quizzes and lecture slides. Not difficult, but showing up is critical if you want extra credit because he does not round grades at the end of the semester. Overall good professor for the course.", "rating": 4, "expected_grade": "B+", "created": "2023-05-17T02:53:13.154081Z"}, {"professor": "Elizabeth Brown", "course": "KNES350", "review": "i can't believe she's still teaching. the content we did in class was so repetitive and she would spend a lot of time rambling about her daughters and sharing personal anecdotes that weren't related to sports psych. it is definitely an easy A but I dreaded this class. the 100 question exams would have repeat questions and the formatting was so inconsistent", "rating": 2, "expected_grade": "A", "created": "2023-12-22T13:55:38.948906Z"}], "department": "KNES", "course_number": "350", "name": "KNES350", "title": "The Psychology of Sports & Exercise", "credits": 3, "description": "An exploration of personality factors, including but not limited to motivation, aggression and emotion, as they affect sports participation and motor skill performance.", "is_recent": true, "geneds": null}