{"average_gpa": 3.264478114478114, "professors": ["Julie Enszer", "Jessica Vooris", "Roberto Manuel Benedicto", "Avery Dame", "Alexis Lothian", "Justin Sprague", "Ivan Ramos", "Anna Storti", "JV Sapinoso", "Alyssa Samek", "Sydney Lewis", "DB Bauer", "Melissa Stevens", "Damien Hagen", "Jaime Madden", "Danielle Laplace", "Caitlin Leach", "Amira Lundy-Harris", "Adreanna Nattiel", "Jaime Madden", "Jaime Madden", "William Mosley", "Rahma Haji", "William Mosley", "Jessica Mathiason", "William Mosley", "Sayan Bhattacharya", "Alexis Lothian"], "reviews": [{"professor": "Ivan Ramos", "course": "LGBT200", "review": "Interesting readings but a lot of reading. Fair grading. ", "rating": 5, "expected_grade": "A-", "created": "2017-11-19T21:45:51Z"}, {"professor": "Damien Hagen", "course": "LGBT200", "review": "Really chill professor. Very minimal effort needed, just make sure you participate. Had 2 exams and 2 5-page papers. ", "rating": 5, "expected_grade": "A", "created": "2020-07-24T14:58:01Z"}, {"professor": "Jaime Madden", "course": "LGBT200", "review": "LGBT 200 had a lot of writing assignments, such as two \"Daily Question\" assignments due a week, where we had to reflect on the assigned reading material of that day. There were also 3 essays assigned throughout the semester that needed to be a minimum of 3 pages; along with a few other projects.\r\n\r\nOverall, if you don't mind writing frequently, this class will be a piece of cake and an easy A. Sometimes weekly writing assignments, such as the \"Daily Questions,\" can be annoying and an inconvenience, but they aren't necessarily difficult to complete. Also, Dr. Madden was sweet and answered emails quickly. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-21T19:38:57Z"}, {"professor": "Danielle Laplace", "course": "LGBT200", "review": "She is ok. Unclear instructions. Not a fan tho. ", "rating": 3, "expected_grade": "B+", "created": "2022-01-20T17:21:09Z"}, {"professor": "Jaime Madden", "course": "LGBT200", "review": "Dr. Madden is probably the most professional professor I have worked with. \r\n-I have taken classes with \"organized\" professors before, but Dr. Madden has installed her own home page into the ELMS ticker with working links and shortcuts to assignments. \r\n-She features guest speakers and encourages ways you can get involved and attend historical events around the university\r\n-This is an intro class, with a lot of different backgrounds, so she has the somber job of introducing people to their first exposure to some pieces of writing/media about hard-core discrimination, and pieces with radical voices. She'll ask you to reflect on these, but she handles everything with seriousness and respect. \r\n-Dr. Madden handles class emergencies very well\r\n-Her teaching style is engaging, and her assignments are not too demanding.\r\n\r\nIdk, I couldn't really ask more from a class and with a lot of experience taking STEM classes here, this class was a gem. ", "rating": 5, "expected_grade": "", "created": "2022-03-11T02:39:37Z"}, {"professor": "Jaime Madden", "course": "LGBT200", "review": "Dr. Madden is an incredibly respectful and kind professor. Very careful and deliberate with her words and instruction, she makes sure to create an environment that is accepting of everyone and acknowledges everyone's experiences. She encourages class discussion and invites students to voice their opinions and experiences to contribute to the discussion, while guiding the overall progression of the class. She is very methodical and organized in her instruction, and is one of the most structured professors I've had. There are frequent daily questions, which are not too bad to complete (about a paragraph each). I found that she is a very lenient and easy grader, and accommodates situations as they arise. The class is not too demanding or difficult, but does require frequent readings (for those that may be unaccustomed to that). There are frequent videos and films that are also assigned, which helps add variety. There was a class emergency at one point, and she engaged and handled the incident expertly and with a profound kindness. Overall, she is incredibly thoughtful and a great professor to teach this intro class. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-19T16:55:02Z"}, {"professor": "Damien Hagen", "course": "LGBT200", "review": "The course is generally easy. You need to read and write things every week. Final paper is not very easy and I got around 83/100, a bad score. If you want to get an A, be careful and try your best to write good articles.", "rating": 5, "expected_grade": "A-", "created": "2022-05-26T04:11:12Z"}, {"professor": "Amira Lundy-Harris", "course": "LGBT200", "review": "Very easy class, great for the history Gen Ed requirement. The professor was very kind and helpful. Most of the articles we read in class were short and interesting. Mostly discussion based class where you discuss opinions on the text in a small group. Your grade is based on a few papers and class discussions. There are very few quizzes and it's mostly to check if you understand the material. This course is great for learning and discussing LGBT history.", "rating": 5, "expected_grade": "A", "created": "2022-05-31T00:11:43Z"}, {"professor": "Jaime Madden", "course": "LGBT200", "review": "Professor Madden was one of the best instructors I've had. I took LGBT200 as an gened requirement and pretty much hope all of my geneds are structured like her class was. She's very sweet and organized. There's small assignments due before each class and a few essays as well but they were not too hard. She does keep track of attendance. Discussion is a big part of class but I really enjoyed how that went. There's a good amount of reading involved for the assignments. Overall I really liked her class and would definitely take another class of hers again.", "rating": 5, "expected_grade": "A", "created": "2022-11-10T20:43:31.723434Z"}, {"professor": "William Mosley", "course": "LGBT200", "review": "He has a nice demeanor but the course is not what you'd expect from a 200 level course in terms of reading. We're talking 40-50 page readings expected twice a week from the student, which for an introductory level elective is a bit silly. The class also presupposes a certain level of political and cultural knowledge that coming in you were trying to get to begin with. The discussion is nice but be prepared for a disorganized class structure you will have to cope with and trial and error your way to success because the syllabus doesn't agree with the most common type of assignment's instructions. I get this was his first time teaching this class at UMD but he's taught it many times else where, it just seems like a bullshit excuse and I know things could be much more well put together than they are here.\r\n\r\n(Also make sure to attend class, 3 classes missed drops a letter grade which wasn't specifically listed in the syllabus in Fall 2022)", "rating": 2, "expected_grade": "A", "created": "2022-11-23T00:06:58.767987Z"}, {"professor": "William Mosley", "course": "LGBT200", "review": "Professor Mosley is a very cool person and this is not an attack on their character in any way. However, this class was a bit of a mess. For one, the readings during the first few weeks were around 50 pages each and some days there would be up to four of them. For a 200 level that was already a lot. Additionally, the grading system for our weekly assignments wasn’t clarified until over halfway into the semester. I liked the discussion style classes a lot, but oftentimes for me and other classmates I talked to, it felt like if you were saying anything that disagreed with Professor Mosley the environment would get a bit hostile. If you take this class be prepared that they are very opinionated and often present these opinions as facts. I also would’ve liked a bit more diversity when it came to lessons, as we spent a lot of time talking about the black-queer experience, but only one say on the Latinx experience, and didn’t discuss any other intersectional identities.", "rating": 2, "expected_grade": "A", "created": "2022-12-12T16:53:36.443904Z"}, {"professor": "William Mosley", "course": "LGBT200", "review": "big agree with the first review. by far the most reading out of all my classes which is weird especially considering on the first day, he agreed with students saying they were hoping it would be a light/fairly easy INTRODUCTORY class. Confusing expectations for the main assignment - weekly papers since he doesn't grade them and we never met the TA. a 500 word limit but everyone would usually go over 500 words because there was just so much content and readings to cover/analyze. The class discussions were genuinely interesting and i learned a lot from them but i just wish we didn't have to go through a mountain of reading and a professor with a bad attitude at times. he seems better to talk to as a person but as a professor.......no. i remember one time when people were hesitant to start discussing a really difficult reading, instead of asking more guiding questions or trying to break down the text for us, after about a minute of silence he said \"y'all need to get your shit together\" and went on about how we were not taking the class seriously enough, this was in the 4th week of class like late september. then people spoke up but it was really awkward. literally called us his guinea pigs since this was his first time teaching at UMD. some changes were made throughout the semester so i can only hope he gets better from here. proceed with caution.", "rating": 2, "expected_grade": "A", "created": "2022-12-12T21:11:30.420395Z"}, {"professor": "William Mosley", "course": "LGBT200", "review": "This professor created a wonderful environment for conversation, and I learned a lot from my peers and the discussions we had that took up nearly every class time. However, they were very disorganized and unclear about lots of deadlines and grading criteria. They expressed halfway through the year a different attendance policy than what was on the syllabus. They also graded attendance based on their 'memory' which was kind of unusual. Though it did not effect me personally, most students were upset.", "rating": 4, "expected_grade": "A", "created": "2022-12-14T01:13:15.711765Z"}, {"professor": "Rahma Haji", "course": "LGBT200", "review": "I really enjoyed taking LGBT200 with Rahma. It’s not a lot of work, but she takes her time thoroughly explaining the readings and makes sure that there is no confusion among students. She is incredibly caring and understanding and creates a great environment in which to learn. Definitely recommend", "rating": 5, "expected_grade": "A", "created": "2023-04-12T14:23:45.515598Z"}, {"professor": "Rahma Haji", "course": "LGBT200", "review": "For a 200 level class, this was a lot of work in my opinion. Three discussion posts a week based on long readings due super early in the morning, plus the midterm and final require an excessive amount of sources. This class was a waste of time, I don’t feel I have really learned much. She asks for feedback but I don’t feel like she really changes anything. She’s nice enough but if you’re looking for a laidback class, this isn’t it.", "rating": 2, "expected_grade": "A", "created": "2023-04-24T14:12:00.009314Z"}, {"professor": "Jaime Madden", "course": "LGBT200", "review": "Professor Madden was very nice and understanding. You can tell she knows what she is talking about and is passionate about it. The only criticism i have is that she only had one grade in even as late as finals week. The assignments are all fairly easy, but no feedback is provided promptly. Attendance is pretty crucial as well because participation is 200 points. Still a good class to take but not if you need immediate feed back and grading.", "rating": 3, "expected_grade": "", "created": "2023-05-18T17:06:31.930065Z"}, {"professor": "Jessica Mathiason", "course": "LGBT200", "review": "Great course and love Dr. Mathiason! I learned more in this class than I did in any other class. It was very engaging and I would recommend taking it if you're interested in this subject and need an easy gened.", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T16:05:39.681156Z"}, {"professor": "William Mosley", "course": "LGBT200", "review": "Prof Mosley is a really cool person who seems to care for his students. He does events like the costume ball where we dress up and compete in groups for Halloween which was fun, and we also did Tarot card readings during class which I also enjoyed. As much of a great person he is, he sucks as a teacher. He really picks favorites and would always value one classmate's opinions over everyone else's. Participation is important, but I rarely got a chance to speak due to him picking the same people consistently. \r\nI would also email him to genuinely ask for advice on assignments, and he would brush me off and tell me to ask my TA instead, which felt like a punch to the gut since I wanted to hear what he had to say. We had five response assignments due over the semester as well as a midterm and final paper. The response assignments are graded out of five, but some classmates got sixes and sevens, which made no sense because we were never told that was even a possibility. He also announced these scores to the class while a department head was there so it felt superficial when we were asked to clap for our two classmates and it appeared as though he was doing it to make himself look good. He also told us to fill out our student feedback survey for his class and If the feedback was bad he would consider switching schools. Maybe consider learning from the feedback first sir???\r\nFun guy, not so fun professor.", "rating": 2, "expected_grade": "C", "created": "2023-12-05T21:23:38.857610Z"}], "department": "LGBT", "course_number": "200", "name": "LGBT200", "title": "Introduction to Lesbian, Gay, Bisexual, and Transgender Studies", "credits": 3, "description": "<b>Credit only granted for:</b> LGBT200.\nAn interdisciplinary study of the historical and social contexts of personal, cultural and political aspects of LGBT life. Sources from a variety of fields, such as anthropology, history, psychology, sociology, and women's studies, focusing on writings by and about LGBT people.", "is_recent": true, "geneds": null}