{"average_gpa": 2.901254180602007, "professors": ["Margaret Antonisse", "Tonia Bleam", "Christopher LaTerza", "Michael Gagnon", "Tonia Bleam", "Margaret Antonisse", "Naomi Feldman", "Margaret Antonisse", "Naomi Feldman", "Tonia Bleam", "Tonia Bleam", "Margaret Antonisse", "Tonia Bleam"], "reviews": [{"professor": "Margaret Antonisse", "course": "LING240", "review": "Dr. Antonisse is a decent lecturer, but sometimes explains straightforward concepts in a more complicated way than necessary (she's reasonably accessible for out-of-class clarification). Regardless, the content of 240 is awesome- the concepts are interesting, useful, and helpful in understanding modern human communication. Prof could be better, TAs were average, but the class is great.", "rating": 4, "expected_grade": "A", "created": "2012-08-08T12:22:00Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "LOVED this class! so interesting, fun and easy. def take this class if you can!", "rating": 5, "expected_grade": "A", "created": "2014-01-07T14:39:00Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "I like her. She is very nice as a professor. The only downfall I see to this course is that even though you may understand something fully, you can still fail a quiz if you don't understand her format. The test are well put together, just watch out for the multiple choice. I also think there are too many exercises, there were times when I felt like I needed a break. It's like you relive the high school experience of homework, but they do help you learn. Other than those few things, you will learn a lot from this course. If you're not a linguistics major, you will come in thinking the subject is pointless and another version of hooked on phonics, but she does give you an insight to how it fits into our real world.", "rating": 4, "expected_grade": "C", "created": "2011-10-23T18:39:00Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "I’ve had Dr. Antonisse for several classes now. She’s fantastic. Very friendly, very good at explaining things overall, though occasionally she can be a little unclear. The only other issue is that she occasionally has trouble getting a slightly confused class back on track. But overall Dr. Antonisse is one of the best profs I’ve had at UMD.", "rating": 4, "expected_grade": "A-", "created": "2017-11-19T22:28:58Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "Tonia is an amazing professor, and LING240 is an awesome class. She's super nice, always willing to help, and definitely let me off more than enough times for not coming to lecture because I had other CS classes :/\r\n\r\nNot the easiest elective because of all the exercises/homeworks, but super fascinating subject material. Midterm was actually kinda tough for me, but I'd say medium difficulty overall (you have to memorize linguistics concepts and phonology as well as do syntactical analyses of fake languages).\r\n\r\nPretty good choice for an elective! DEFINITELY take the class with Tonia, and you've a good chance of getting an A/B.", "rating": 5, "expected_grade": "B", "created": "2017-12-14T19:06:37Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "(I took this class completely online.) Dr. Bleam is an amazing professor and LING240 is such an interesting class! She's an excellent teacher and her lectures are engaging and helpful. You will need to read articles/studies/experiments for this class but they are always interesting and understandable. The exams match material discussed in lectures and on exercises and homeworks, both in content and difficulty. They definitely supplemented my learning and did not feel like busywork or a waste of time. \r\nI honestly found the class to be easy and scored very well on the assignments and exams with minimal effort. HOWEVER, my classmates said they found the exams to be somewhat difficult and that the TAs were picky graders, so maybe it depends on whether or not you have a knack for this kind of thing. Either way, getting an A or B is totally doable if you are willing to put in at least a moderate amount of effort. My best piece of advice is to take notes during class AND on the readings. Nothing exhaustive but make sure you have all the key points and some examples. \r\nI highly recommend this class, especially if you're genuinely interested in linguistics. ", "rating": 5, "expected_grade": "A", "created": "2020-12-22T02:31:02Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "Dr. Antonisse is a great professor who cares about her students and wants you to do well. She carved out time before and after each class to answer questions and chat. Online classes were sometimes rough with technical difficulties and she usually went over time by at least a few minutes. Not a huge deal, but worth considering if you have a class directly after. Attendance was marked with clicker quizzes (marked for participation, not accuracy). Homework and other assignments didn't take too much time. Exams were fair and not too difficult. A great, interesting class with a good professor.", "rating": 5, "expected_grade": "A", "created": "2021-05-19T13:55:53Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "Makes this courses harder than it should be. Treats it like we’ll all majors in linguistics. Would not recommend for any easy elective.", "rating": 1, "expected_grade": "", "created": "2022-04-13T01:29:22Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "Worst class / teacher ive ever had. Course work harder than any 400 level course at UMD ive taken. Seems like this woman has no life and expects us to have no life too besides her class, to learn about irrelevant phonetics. Very bad at technology as well.", "rating": 1, "expected_grade": "B+", "created": "2022-05-16T21:41:33Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "This is NOT an easy A class! Dr. Antonisse is a very nice prof and the material is pretty easy to understand but her exams are ridiculously hard and the TAs all grade inconsistently so random points are always taken off. Everything is weighted really heavily so once your grade drops it's really hard to bring up. ", "rating": 1, "expected_grade": "", "created": "2022-05-19T00:50:21Z"}, {"professor": "Naomi Feldman", "course": "LING240", "review": "Good lecturer who is clearly very knowledgeable and passionate about linguistics. This class was a new version of LING240 that included computational linguistics, which I thought was very well integrated into the course. Not much work outside of class (you can get away with skimming the readings) and the midterm and final were both fairly easy if you went to lecture.", "rating": 5, "expected_grade": "A", "created": "2023-05-18T01:57:10.511637Z"}, {"professor": "Margaret Antonisse", "course": "LING240", "review": "I'm going to give the most honest and comprehensive review I can give.\r\nFirst the good: Dr. Antonisse knows what she is teaching and is knowledgeable. A lot of topics are covered, so do keep track and don't miss a lesson or you'll definitely be behind. If you're passionate about the field of linguistics, she is definitely helpful. \r\n\r\nWhat I disliked:\r\n1- Homeworks and assignments are weighted HEAVILY. A slight drop in your score and your grade will go whoosh and it is VERY DIFFICULT to raise it again. A+ cutoff was 99%, even though the GPA is the same for an A as an A+, I just found it strange.\r\n2- This class is not an easy elective, especially if you have no prior knowledge of linguistics: DON'T take the course unless if you're really passionate about it and be prepared for it to be very abstract.\r\n3- Her demeanor with students: this fluctuates. When it comes to something besides questions about the course or material, she is nice and understanding. But to me, and for many of my classmates, her reaction when you ask a question can sometimes feel degrading and make you feel stupid.\r\n\r\nThis is my own experience, just my raw opinion without sugarcoating. I was honestly fooled by the 5-star reviews and I'm genuinely confused, maybe they got the professor name wrong, but this felt like a 400-level class and extremely stressful. But if you choose to take her, some might find her enjoyable and perhaps you might as well.", "rating": 1, "expected_grade": "B-", "created": "2023-05-20T02:50:16.131642Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "Extremely kind and understanding and passionate about what she is teaching. The class is engaging both because of its interesting material and Prof. Bleam's enthusiasm for teaching it.", "rating": 5, "expected_grade": "A+", "created": "2023-11-06T20:52:19.956247Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "Kind and engaging professor. Lectures and class content are very interesting.", "rating": 5, "expected_grade": "A", "created": "2024-01-02T17:47:14.983992Z"}, {"professor": "Tonia Bleam", "course": "LING240", "review": "Dr. Bleam is a super super nice professor, super understanding and willing to help and accommodate students, and also very passionate about linguistics! I would consider LING240 itself to be an easy A, and it was never boring, so it was a nice break from my harder STEM classes. You learn about lots of cool stuff in a chill welcoming environment. Definitely recommend you take Dr. Bleam because she is so lovely and also LING240 was a fun and interesting class with an easy workload.", "rating": 5, "expected_grade": "A+", "created": "2024-01-24T22:12:01.278507Z"}], "department": "LING", "course_number": "240", "name": "LING240", "title": "Language and Mind", "credits": 3, "description": "<b>Additional information:</b> Required for Linguistics majors and recommended for students in related fields.\nThe study of language as a cognitive phenomenon. Focus on mastering the concepts and technical skills required for further courses in linguistics. Ways of representing people's knowledge of their native language, ways in which that knowledge is attained naturally by children, and how it is used in speaking and listening. Additional topics may include: animal communication, language and the brain, language and thought.", "is_recent": true, "geneds": null}