{"average_gpa": 3.075491525423729, "professors": ["Casey Cremins", "Heyrim Cho", "Tobias von Petersdorff", "Tamas Darvas", "Jakob Hultgren", "Shelby Wilson", "Todd Rowland", "Scott Preston", "Lutian Zhao", "Scott Preston", "Todd Rowland", "Lutian Zhao", "Todd Rowland", "Giovanni Forni", "Hussain Ibdah", "Lutian Zhao", "Kendall Williams", "Todd Rowland"], "reviews": [{"professor": "Heyrim Cho", "course": "MATH135", "review": "She is a super smart and nice person, but not the greatest at teaching her material. the quizzes and projects are super easy, but her tests are pretty tough and there may not be a curve instituted, depending on the class average. ", "rating": 2, "expected_grade": "A", "created": "2018-12-18T20:19:03Z"}, {"professor": "Casey Cremins", "course": "MATH135", "review": "Reads off slides and does examples directly from textbook. Chooses the hardest questions for his exams, but are not too hard overall. Learned majority from textbook, not from him or the TAs. ", "rating": 2, "expected_grade": "A", "created": "2019-01-05T20:54:28Z"}, {"professor": "Heyrim Cho", "course": "MATH135", "review": "She’s a very sweet person and obviously very smart, but is not a very good teacher. Hard to follow lectures and exam questions are all over the place ", "rating": 2, "expected_grade": "B", "created": "2019-04-26T03:53:20Z"}, {"professor": "Laura Iosip", "course": "MATH135", "review": "Best teaching assistant ever! quite literally would not be getting through math 135 without her. So sweet and uploads the worksheets and answer keys to a website and that becomes super helpful around exam time. She makes everything so clear and does example problems before the quizzes. I wish she could be the professor instead of Casey Cremmins. ", "rating": 5, "expected_grade": "A-", "created": "2019-11-20T21:11:49Z"}, {"professor": "Laura Iosip", "course": "MATH135", "review": "Learning is easy with her\r\nAlways does practice problems before quiz\r\nUnderstanding\r\nReally teaches the material so you understand\r\nAn awesome person. She is so nice and helpful.", "rating": 5, "expected_grade": "A", "created": "2019-11-25T22:43:45Z"}, {"professor": "Casey Cremins", "course": "MATH135", "review": "Cremins gets such a bad rap. He is boring, but about halfway through the semester he began to become more engaging. He stopped reading off the powerpoint and began trying to engage the class and did problems on the board and explained them better. The exams are not awful if you do the homework (exam problems tend to be similar to the homework). He is actively trying to become a better professor. ", "rating": 4, "expected_grade": "A-", "created": "2020-03-24T23:31:33Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Dr Rowland is a super nice guy and it pains me to say this, but he’s not a very good teacher. His entire class this semester seems very confused about topics that seem relatively simple. He presents the material using some weird program that has a lot of unnecessary code around the text. His notes are sloppy, disorganized and very hard to interpret. For the most part, the TAs were better at explaining the concepts in a lot clearer manner. However, he is willing to go out of his way to try to help you if you ask, and the grading is very lax. It’s probably difficult to do poorly in this class even if you don’t understand what is going on", "rating": 2, "expected_grade": "", "created": "2020-10-27T07:34:33Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Cool guy but did not teach well and was mostly a self taught class. The TAs carried the class this year and they were actually super helpful. Doing the practice exams were the best form of studying for me and the workload was decent but the worksheets were a little confusing although TAs explained most of it pretty well during discussions. Sorry Todd.", "rating": 2, "expected_grade": "B+", "created": "2020-12-09T21:30:24Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Amazing professor who stays after in office hours to make sure students understand. ", "rating": 5, "expected_grade": "A-", "created": "2020-12-10T19:06:15Z"}, {"professor": "Jakob Hultgren", "course": "MATH135", "review": "super nice guy. teaching abilities are ok. You might need to go to office hours every now and then. He gave out practice tests this semester the week of each midterm and they were almost identical to the actual tests. Would recommend over Rowland. This is corona so he taught us how to calculate everything with google sheets and wolfram...just plug and chug and you'll get it:)", "rating": 4, "expected_grade": "", "created": "2020-12-17T21:55:11Z"}, {"professor": "Jakob Hultgren", "course": "MATH135", "review": "He is a really nice guy and is super approachable. He was also really organized when teaching the class online. His lectures are decent, so I would still use them as a resource to just get an introduction to the material. They're not really helpful in getting an in-depth understanding of the material so I would not rely solely on it. He had one synchronous lecture every week which was not recorded and I did not attend that at all. For discussion, we were able to either choose to attend a synchronous discussion or watch an asynchronous recording. The times on the quizzes/exams were super flexible -- we always had a 24 hour window to complete the quizzes and the exam window was very fair (I think about 1.5 hours something like that). For the final exam, he gave us about a 34-hour window to complete it which I thought was really nice.  The textbook really helped the most -- especially the practice problems. We had quizzes once a week which were pretty difficult at times and it matters to do well because that is a section of your grade that will help you in the end. We were assigned into groups of 2/3 to complete a worksheet every week. This also matters to do well on because of the weight on your final grade. I found that at the beginning they were a breeze but they became super difficult. The best method I used was going to discussion sections on Friday to get help from the TA. Then there are \"oral exams\" every four weeks with your worksheet partner in which you attend your assigned discussion section and the TA will ask you one or two questions based on the worksheet that you did. It's really nothing at all to worry about and most of the time the questions are not math-related. They just ask about applications to the real-world. You should definitely get a 100% on all of them if you just have something to say, even if it's wrong. There is no curve in the class but this is because he drops a lot of assignments at the end which is actually a godsend. I got a D on the first midterm, B's on the next two midterms, and an A on the final. I had a high B/ low A average on the quizzes/worksheet section. I ended with an A- in the class (I had 89.56% and he rounded it without me asking!!). Overall, as you can see with my stats, if you start off a bit slow and do average on the other assignments you should end up with a good grade. The practice exam is identical to the actual exam. As for the material, it really is not bad at all and is way better than calculus.  ", "rating": 4, "expected_grade": "A-", "created": "2021-01-08T01:44:47Z"}, {"professor": "Jakob Hultgren", "course": "MATH135", "review": "I love Jakob, he's so kind. I took the class entirely online in Fall 2020 and it was a mixture of asynchronous and synchronous. His lectures were pretty good, he goes through every step of a problem and provides a lot of examples. There were some times that he would seem to skip a step and he'd write something on his lecture slide that I personally had no idea where it came from, but for the most part I felt that his lectures were really organized and made sense. He had weekly quizzes on Wednesday that were usually pretty ok, sometimes they would pull some out of pocket questions at you. My word of advice would be to do the practice textbook problems. They weren't graded but they were extremely helpful for the quizzes. The only issue with the textbook problems is that Jakob never went over them himself and his TAs would go over them in both a synchronous discussion and a published video the day of the quiz. These were probably my least favorite part of the course, just because it felt like there was a significant disconnect between Jakob and the TAs sometimes; the TAs would often explain how to solve a problem in a way that Jakob didn't teach and not go over all of the problems / go over ones that weren't assigned. There was also a weekly worksheet that was done with a group due Saturday morning, and these worksheets were very hit or miss. Sometimes they were really easy and sometimes they were extremely difficult, there was no way to predict it. They also didn't always align with what Jakob had taught that week, but there was a live discussion on Fridays to go over the worksheet before it was due. The oral exams in that class were also VERY easy, every single time. For the exams, Jakob would publish a practice exam that was usually very nearly identical to the structure of the actual exams, so the exams weren't too difficult. He would also give a lot of time for them and make them open all day. Overall, not too difficult of a class at all, even for someone who's pretty bad at math. Would absolutely recommend Jakob as a professor, aside from how he is as a teacher, he just seems like a really great person--I wish I had the opportunity to have him in person.", "rating": 4, "expected_grade": "", "created": "2021-01-13T00:00:00Z"}, {"professor": "Scott Preston", "course": "MATH135", "review": "I have very mixed feelings. I did well in this class, but there were some things about this professor that made it hard to do so. Overall, I think he is a nice and funny guy who loves math, but he is quite unorganized. A lot of problems had numerical typos and that made it 10x harder to understand the homework and tests. The tests are also worded in a ver confusing manner. But, he drops an exam and either one or two homeworks. If you go to class and ask for help, it's easy enough to do well. Sometimes his dry humor can come off as condescending, but he is helpful if you really need it. The homework and tests did not need to be as confusing, time consuming, and difficult as they were made to be. Overall, nice guy, alright class, but took up a ton of my time for what should be an easier class.", "rating": 3, "expected_grade": "A", "created": "2021-12-01T00:20:48Z"}, {"professor": "Scott Preston", "course": "MATH135", "review": "WORST PROFESSOR I HAVE EVER HAD AT UMD!\r\n\r\nI REPEAT: WORST PROFESSOR I HAVE EVER HAD AT UMD!\r\n\r\nWhile he was sort of a nice guy, he was the worst professor.  He gave zero review for exams, his exams were extremely difficult and unorganized, and do not get me started about his lectures.  \r\n\r\nPreston rambles on during his lectures, hoping eventually he will find what he wants to say.  He writes out his notes with his sloppy handwriting, and messes up his own examples!!! He makes no sense at all whatsoever.  \r\n\r\nDO NOT TAKE ANY MATH WITH PRESTON!", "rating": 1, "expected_grade": "", "created": "2021-12-06T00:53:04Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Professor Rowland is the epitome of great guy, but not so great teacher. You really have to pay attention in class to understand some of the harder problems because he can make it very hard to follow and his work tends to be all over the place. I recommend going to office hours if you have a legitimate question so he can explain it to you one on one. That being said, it is possible to get an A in this class, and he makes an effort to get to know everyone and their names which is a lot more than I can say for most professors at UMD.", "rating": 3, "expected_grade": "A", "created": "2021-12-19T21:13:20Z"}, {"professor": "Scott Preston", "course": "MATH135", "review": "Preston was a good teacher as long as you show up to the lectures it should be easy. His exams are somewhat tough but if you go over his notes you should be fine.", "rating": 3, "expected_grade": "", "created": "2021-12-31T07:04:05Z"}, {"professor": "Scott Preston", "course": "MATH135", "review": "He was a very sweet professor and was willing to help when you needed it. However, as others have said, he's very unorganized. Once, he forgot all of his notes and had to leave class for 20 minutes to go get them. His exams always had some sort of issue(but he'd never blame it on us, he'd just get rid of the question or correct it midtest), the workload was also unnecessarily large in my opinion, he wouldn't teach some things in lecture but they'd be on the homework, and his final grading system wasn't correct in ELMS, which isn't bad but wasn't my favorite. However, I got an A easily because he gave me all the resources to succeed. Don't skip lectures, try to show up to as many discussions as possible, and actually do the homework, don't just copy it. He'll make exam questions identical to the homework!!!!!! ", "rating": 3, "expected_grade": "A", "created": "2022-01-11T02:13:07Z"}, {"professor": "Jakob Hultgren", "course": "MATH135", "review": "Hakob (as he likes to call himself) is a silly little man and honestly this class is really easy. He lets you have formula sheets for all your tests, so you can get away with not studying for an exam if you have a good formula sheet (I managed to score a 97 on one of my tests without studying because of this). He's a really bad lecturer though so that's the only downside but as long as you understand the material it's definitely an easy A.", "rating": 4, "expected_grade": "", "created": "2022-05-05T14:15:23Z"}, {"professor": "Jakob Hultgren", "course": "MATH135", "review": "Really nice person, practice exams are pretty identical to the actual exams which was nice and even lets you have a formula sheet. The oral exams were pretty easy, just make sure you are present on that day. Worksheets were kind of random, some were easy, some harder but if you go to the discussions they pretty much can answer your questions and show you how to do the problems. Overall not as much stress with this class considering its a math class compared to others. ", "rating": 5, "expected_grade": "", "created": "2022-05-11T18:36:47Z"}, {"professor": "Jakob Hultgren", "course": "MATH135", "review": "If you are taking MATH135 take Hultgren. He is a great professor and is very chill. He makes the class very easy and allows a formula sheet (front and back) for every exam and the lowest exam gets dropped. He also allows 4 formula sheets for the final. He's very accommodating and always is happy to answer questions. He also creates a practice exam and it's almost exactly the same as the actual exam. The material isn't too hard to understand and as long as you understand it you'll do well in the class. ", "rating": 5, "expected_grade": "", "created": "2022-05-15T15:04:49Z"}, {"professor": "Scott Preston", "course": "MATH135", "review": "Extremely disorganized. Your job as a student was to take these rambling, convoluted styles of math problems that were 9 sentences long and form them into complex, multi-step graduate-level math problems (Eigenvectors, Leslie Matrices). He liked to treat them like a puzzle and give you only 30% of the info you needed, expecting you to draw tables and charts and use red yarn to figure out the rest on your own. Then he expected you to set up your own math equation from this bs, then solve it in several steps. This would be like, 20% of an exam grade. The rest were the same way. \r\n\r\nThe book was different than what was on his midterms.\r\nThe lectures were different than what was in the book.\r\nAlmost nothing connected, and there's nothing online to help you, and he wrote so fast and jumped around on his slides, that you would be writing notes for the wrong page without realizing it. A total nightmare that almost cost me my mental health. Don't take his class.", "rating": 1, "expected_grade": "P", "created": "2022-10-03T17:06:05.708958Z"}, {"professor": "Scott Preston", "course": "MATH135", "review": "Fairly unorganized, and you could get pretty much all the information you needed for the class out of the textbook. Wasn't a great lecturer, but the exams were manageable, and curved when the average was too low.", "rating": 3, "expected_grade": "A", "created": "2022-11-07T03:15:46.556919Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "He is a sweet guy who teaches with many examples but the class is not always comprehensive material-wise and you don't really know what the topics are until near test review days. In my opinion, this is a self-teach class but the topics he tests are very surface level so don't get too hung up on not understanding the textbook. The homework is straightforward and the tests mirror the study guide almost completely.", "rating": 4, "expected_grade": "A+", "created": "2022-11-19T20:48:51.887143Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "Such a charismatic and lively professor. Always tries his hardest to make sure the students understand; his hands are almost always completely covered in chalk at the end of class because of how much he writes on the board to make sure the students understand every step of the process. Excellent, actually the best professor I've had, in terms of responding to emails and problems that I have had. Makes the practice tests almost identical to the actual tests, which really helps you know what you need to study for. The TA's did their best to teach the material, but both of mine have never taken college biology courses so they were unfamiliar with a lot of the terminology the course covered; they tried their hardest to teach us the content so I thank them anyways. Interesting twist on classical mathematics and always looked forward to the lectures :)", "rating": 5, "expected_grade": "A+", "created": "2022-11-28T22:47:56.425180Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "lutian \"slay\" zhao—he's a really kind person. in addition to his profound kindness, his practice exams are almost identical to his actual exams. with that in mind, this is already a significant proprietor as to why you should select him as your professor. it's really no joke how his practice exams are just the actual exam but with different numbers. he's also really funny. his examples in class are straightforward and going to him for office hours is never intimidating. literally math is my worst subject and i always got horrible grades in math in high school but i am expecting an A in this class. also, just like most math classes, this class does not do + or -. meaning, it's equivalent to an A+, B+, C+, etc. in the grade book. the homeworks are also straightforward but it really just depends on your TA and how useful they'll be. he also drops 50% of your lowest midterm (which is typically the first exam but don't worry it's only hard because of the high school to college transition). also, if you're choosing between professors, PLEASE choose zhao. don't make the same mistake my other friends made. another tip—if you took AP stat in high school it's gonna help you on the third exam.", "rating": 5, "expected_grade": "A", "created": "2022-11-29T19:13:46.455617Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "He is a really good guy and the practice exams are exactly like the midterms. The homework are pretty easy and this class overall does not take up much time outside of lecture. You can tell how much he cares about his students' success and is always happy to help students out.", "rating": 5, "expected_grade": "A", "created": "2022-11-30T03:11:58.661873Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "This guy is great, he is very funny and truly cares about his students. This was his first time teaching this course and he did a great job. The practice exams are almost exactly like the exams and I never had to use the textbook at all. This can be a self-taught class if you'd like it to be, I found this easiest because the content was hard to absorb in the large classroom. However, if the large classroom doesn't bother you at all you could just go to lectures, not have to do GSS or office hours, and be totally fine. (Discussion is mandatory)", "rating": 5, "expected_grade": "A", "created": "2022-12-01T20:22:57.280102Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "My favorite professor I had this semester. One of the liveliest, hard-working people I have met. For lectures, he makes sure to write out every single step of the problem to make sure we all understand what is happening. He is so dedicated and tries his best to make us understand everything. He always responds immediately to emails and is very responsive and helpful to questions in class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T14:41:11.325250Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "He is an icon and he is THE MOMENT. literally could not have asked for a better math professor.", "rating": 5, "expected_grade": "", "created": "2022-12-12T23:09:51.106677Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "Lutian is great!! Cares about his students and emails back so quickly. Midterms are also almost identical to practice midterms. Take him if you can.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T22:08:44.796684Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "He is passionate about teaching us this subject. He wants everyone to succeed and is very helpful in office hours. The TAs often clarified things if the lecture was hard to understand, but he is a great professor! The practice exams are very similar to the actual exams so exam prep is pretty easy. I recommend taking his class!", "rating": 5, "expected_grade": "A", "created": "2022-12-15T20:12:49.637667Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "He has really good reviews because he's a nice person, but that's it. Sure, the class is easy A but only because the midterms are practically identical to the practice exams, and the weekly homework assignments aren't bad either. However, the class is very disorganized and chaotic. Nothing makes sense until right before the exam. He doesn't explain things very well, he mostly just does practice problems. The textbook is also very vague. You do good on exams by teaching yourself how to do the practice exam, not by actually learning the material if that makes sense. The TAs also cannot explain things very well. They just do problems with their backs facing the class and expect you to understand. Even though I have an A, this class was very frustrating.", "rating": 2, "expected_grade": "A+", "created": "2022-12-15T20:26:47.911784Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Do not take MATH 135 with Dr. Rowland. Like everyone else says, he's really nice, but not a good professor. His teaching is so scatterbrained and impossible to follow. The exam averages were in the 60s and 70s. This is a 100-level class.. how does that make sense?? People have said that his exams are close to the practice exams.. well, not anymore. We had 1 exam that was close to the practice exam, and that was it. He tests us like he is a good enough teacher to warrant tests that expand on what we learned in class. I don't think it is impossible to get an A, but we all have other classes and commitments, too. I, for one, had too demanding of a schedule to put hours of work into this class every week in order to just teach myself the material, let alone study it. Take this class with Zhao instead. Everyone in that class had much better things to say (and I would assume better grades too) than people with Rowland.", "rating": 2, "expected_grade": "B", "created": "2022-12-15T22:52:53.566834Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "Not the best teacher, but it is an easy class. I didn't go to lectures because i would learn anything in them, but i was still able to learn the material. The practice midterms are identical to the real midterms with a few numbers switched. If you can get a good grade on the practice midterms then you'll do fine on the midterms. \r\n*The final is written by the department and is much more difficult than the midterms.", "rating": 4, "expected_grade": "A+", "created": "2022-12-16T04:10:15.016095Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Very nice professor. You can tell he wants his students to do good and understand the material. He always has a review session before each exam and holds office hours where he helps you with things like homework and overall clarity on the material. As said by others, his lectures are indeed all over the place and sometimes it was hard to understand. He had \"surprise\" quizzes every Friday and would always help out on answering them and allowed us to work with others. He also never had slides, just a doc. I personally found it harder with the doc to follow through but you could still understand. The class, overall, is pretty easy so you won't have a hard time. He drops half of the lowest midterm and his practice exams were kinda similar to the real exams. Just don't use the practice exam as your only way of studying because I did that once and on the real exam there was a whole section I didn't know how to do. Know the material itself and you will do fine.", "rating": 4, "expected_grade": "A", "created": "2022-12-16T15:50:38.564462Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "-This is a very easy class as long as you take notes. Homework questions consist of examples he had gone over during lectures with different values so make sure you take notes.\r\n-Practice midterm: STUDY THEM. His exams are outlined and styled after the practice midterms, only with different numbers. \r\n-At the end of the semester, he also gives a curve. (Which I personally think it is unnecessary since class average is really high)", "rating": 5, "expected_grade": "A+", "created": "2022-12-17T11:09:20.384266Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "First, the pros. Dr. Rowland is a nice man, will explain anything to you in office hours, responds to emails very fast, and tries to learn everyone’s name. The cons: he is an extremely bad lecturer and gets lost in the middle of his examples in class. His practice exams are meant to be what you should study from but he makes his exams much harder than the practices and includes problems you likely haven’t seen before. Avoid taking him if possible. I really liked him as a person but I wish I’d gone with the other professor.", "rating": 2, "expected_grade": "A", "created": "2022-12-18T22:21:28.753482Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Very nice and caring person, but not the best teacher (however, not the worst). His lessons can be a bit all over the place and the notes he posts are written notes, so they can be kind of hard to understand. As long as you pay attention in lecture, he usually goes over all of the equations you'll need to use (math TA will go over everything during discussion which is super helpful so good to go to discussion just for reinforcement). Weekly homeworks are on Canvas, so super easy to complete and he ended up doing a lot of them in class anyway. Gives practice midterms but really hit or miss about whether they are true to the actual exam. Going to office hours can help if you have specific questions. I personally have not touched the textbook this entire semester, but I've heard from some people that they teach themselves the material using that, so could be helpful for some people. Overall, biggest thing is just to create a connection with him and go to office hours if you need help with the homework or understanding something on a practice test. Also, I'm pretty sure he does not do + or - when it comes to grading, so 90-100 is an A, 80-89 a B and so on.", "rating": 4, "expected_grade": "A", "created": "2022-12-19T03:50:56.527739Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "Professor Zhao is such an amazing professor. His exam guides very accurately represent his exams, and he is one of the nicest human beings. Definitely take him if you can because he's a great person and professor. His class is not at all difficult if you go to lectures and discussions, but honestly, as long as you understand the practice midterms, you should be fine.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T04:22:33.638253Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Not very flexible. Unfunny as well.", "rating": 1, "expected_grade": "B", "created": "2022-12-20T23:09:24.222958Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "This man is one of the best and funniest profs at UMD. His lectures are fairly disorganized, but he provides more than enough resources to earn a good grade in this class!", "rating": 5, "expected_grade": "A", "created": "2022-12-21T18:05:21.196866Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "As other people have said, he is a nice guy but his teaching style is not beneficial. To do well in this class, you had to do a lot of self-teaching outside of the class. On top of keeping up with other courses, it definitely becomes a lot. The TAs were somewhat helpful, but sometimes the topics also got confusing when they tried to explain them. The first practice exam was very similar to the actual exam, so it was helpful. The last few though have been fairly different, so studying off of the practice exams became less helpful. If you have a packed schedule, I would suggest avoiding taking him because you will spend a lot of time reviewing material outside of the class in order to do well.", "rating": 2, "expected_grade": "B", "created": "2022-12-22T17:41:27.908583Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "This was one of the best professors I’ve ever had. He is so kind and cares about his student’s understanding the material. Sign up for his classes right now!!", "rating": 5, "expected_grade": "A", "created": "2022-12-29T17:33:49.844340Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "He's a very nice guy and does his best for his students. The class itself was chaos - the TAs weren't very helpful in discussion and sometimes taught things completely differently from Zhao, the lectures were often more confusing than helpful, and the textbook was hardly relevant. However, the midterms were straight from the practice ones (like literally just different names and numbers), and he took time to clear things up on exam review days, so the disorganized class structure didn't affect exam scores too much. As long as you complete the assignments and make sure you understand the practice exams, you can get a good grade. Also, the lowest exam score was weighted at 50%. The final definitely had some curveballs because it was written by another professor alongside Zhao, but with the midterms you'll probably have a cushion for your grade. \r\n\r\nThat being said, I don't even know what I learned from that class. It was a mix of basic algebra, sequences/functions, and statistics, so I don't know how helpful it would be for someone who actually wants to learn math. For bio majors who just want the credit, though, Professor Zhao is an easy A.", "rating": 4, "expected_grade": "A+", "created": "2023-01-25T02:27:07.389574Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "If I was rating Professor Zhao on how nice he is, it'd be an easy five stars. But I'm sorry, he was just not a good lecturer. He treated lectures like office hours, often helping individual students one at a time while leaving the other one hundred of us to sit and wait. Maybe he stopped doing this later on in the semester, but honestly I stopped going after a few weeks because it felt like such a waste of time. He was all over the place when it came to lecturing, and he didn't explain concepts well. The textbook was barely relevant to the subject of the class, the TAs were unhelpful, and the class felt chaotic all semester. That being said, it's definitely an easy class. The exams were almost identical to the practice exams, so if you know those practice exams inside and out, it's almost a guaranteed A. Zhao also responds to emails quickly, which is nice. And really, he is such a nice guy, just... not amazing at teaching.", "rating": 2, "expected_grade": "B+", "created": "2023-02-03T01:47:56.780261Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "TAKE HIM. literally the best. He made me love this class. He is really kind and really wants to help his students. It was his first time teaching this class and he did phenomenal. His lectures are really straightforward, he introduces the topic, explains it, gives examples. He has an accent but it was not a problem for me. As for discussion, it’s a lot of busy work because many of the worksheets aren’t on the exams but the TA’s I had were good and easy graders. Especially TA Omar, he is amazing. As for exams, Zhao’s reviews are great, he covers everything on the exam and is great at answering questions. The practice tests are very very similar to the actual test as someone said in another comment. They are not impossible tests, he covers everything in lectures, you just need to go to lecture, take notes, review two days before and you will get an A. MORAL OF THE STORY: TAKE THIS PROF. My class average was an 87 if that isn’t proof enough.", "rating": 5, "expected_grade": "A+", "created": "2023-02-15T23:46:27.992686Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "He is so kind and very accommodating. I enjoyed his lectures, and he always is very transparent about what will be on the exams. This class can be an easy A as long as you go to the bio discussions and do the homeworks. The bio discussions were the most difficult part in my opinion, and even then it wasn't that bad and he was always very willing to help. I'd highly recommend this professor!", "rating": 5, "expected_grade": "A+", "created": "2023-05-02T01:04:41.650531Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "Lutian Zhao is super nice and very funny. If you want a good grade, I recommend this class. The practice exams are exactly like his exams. This class was pretty easy. Although class and the math discussion are optional, I would highly recommend going. They were instrumental in me understanding the concepts. The bio discussions are not optional and you can not get the homework if you do not go. Do the practice exams, and you will pass.", "rating": 5, "expected_grade": "A+", "created": "2023-05-06T05:28:04.146511Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "Im terrible at math and ill say that now. However he may not be the best professor but the class is very easy. The topics are easy to grasp and the test are identical to what you do in class and the practice midterms (usually practice midterm B). Also go to your math discussion as well as your bio discussion. Almost nobody shows up to the discussion on Monday (math) since it is not mandatory so it is practically a private tutor session with your TA who explains what you will learn all week. Not a bad class not a bad professor overall.", "rating": 4, "expected_grade": "B+", "created": "2023-05-09T19:09:52.074132Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "TAKE THIS CLASSSSS HE'S SO NICE AND ANSWERS QUESTIONS THROUGHLY", "rating": 5, "expected_grade": "A", "created": "2023-05-11T16:26:41.812121Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "Zhao was nice, but kind've hard to follow. I learned to do his problems rather than understand his content. Practice exams were basically the exact same as the actual exam. Final was slightly harder because he pulled questions from other professors, who may have worded it differently. Bio discussions are once a week and mandatory, but I felt like it was a useless session. Overall, this was an easy A class.", "rating": 4, "expected_grade": "A+", "created": "2023-05-13T21:20:33.100200Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "This man is simply a legend. Great teacher, gives great resources for exams and is very approachable and kind. He explained a complex problem to me over email once. He is genuinely a fantastic teacher, and the TAs were also great so shoutout to them. Thank you, Professor Zhao!", "rating": 5, "expected_grade": "A", "created": "2023-05-13T23:29:42.351617Z"}, {"professor": "Tyler Simmons", "course": "MATH135", "review": "This man was legit the best TA I have ever had for any of my classes. Thank you Tyler I genuinely appreciate you for your help and incredible discussion sections.", "rating": 5, "expected_grade": "A", "created": "2023-05-14T23:39:16.808601Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "If you are thinking about taking this course instead of Calc 2, I encourage you to do so. This course is manageable and teaches you important topics in biology. Prof. Zhao is a clear lecturer. He covers necessary material in class and doesn’t go on tangents or get off-topic. Exams are fair and will not throw in any surprise questions. You will not regret 135 with Zhao.", "rating": 5, "expected_grade": "A+", "created": "2023-05-15T03:34:54.364400Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "I came into this class with general mathematics knowledge with iffy knowledge from AP Calc because it was COVID year, and I'd say everything was very manageable. \r\nPeople hating on this guy for no reason. Chillest professor, super nice and understanding, as well as accommodating for student's real-life circumstances. \r\n\r\nHe is a bit over the place for the lectures but he gives good practice for exams, office hours are very helpful, and his class structure points wise is very student friendly (Drops 3 lowest HWs, 2 lowest classworks, half of your worst exam (example: 70/100 becomes 35/50)). \r\n\r\nDo beware of the second exam, this is designed to bring down the class average. First and third exams should be a breeze, as well as the final. His practice final was very similar to the actual final!! \r\n\r\nNote that all of this applies to MATH136 as well. Great human, could be a bit better as a lecturer, but I believe the guy is probably too experienced to be teaching an entry-level calculus class anyways.", "rating": 5, "expected_grade": "A", "created": "2023-05-15T09:53:52.019810Z"}, {"professor": "Lutian Zhao", "course": "MATH135", "review": "His exams are really easy because his practice exams are just like the actual exam but I wish he had let us solve problems in class on our own instead of working out everything on the board so quickly. leaving everyone confused. He also gives the TA too much power. A lot of them do not properly grade the bio worksheets that we get during discussions, so when you got to him, he is very hesitant or unwilling to regrade it for you because he gave the TA power to grade how they want to grade.", "rating": 4, "expected_grade": "A", "created": "2023-06-04T21:02:09.973241Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "He's a super nice and funny professor, but I feel like his teaching style does not help me learn at all.  I do not often attend lectures because I feel like I struggle to learn anything from it.  The textbook also doesn't really help because the course material is usually a bit more difficult or slightly different from the textbook.  However, the exams are definitely fair and the discussions are helpful.", "rating": 3, "expected_grade": "A-", "created": "2023-11-14T15:53:36.801085Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "He is a nice guy just not the best lecturer. He does not teach well during the lectures and will often go on tangents for a singular problem/question during the whole class. Sometimes I question whether I should go to lecture or not because it's repetitive and counter-productive. I will say though, he is one of the most accommodating and caring professors. He really makes an effort to get to know everyone in his lecture (even though they are SO big). I would recommend not to take him if you have the option not to. Good luck everyone!", "rating": 2, "expected_grade": "A", "created": "2023-11-17T18:36:39.970723Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "I'm going to start this review by saying he is a very nice professor. He makes a substantial effort in getting to know his students that attend lecture and is overall one of the nicest faculty members on campus. However, when it comes to his ACTUAL teaching, he is subpar. He rants about the most little things, often gets distracted while teaching a concept, and does not thoroughly explain important things for his course. The notes he posts on ELMS are VERY confusing, and the class averages on exams are always in the 60s-70s despite the course being less difficult than MATH140 or MATH141. He does not curve his exams; however, he will drop half of the lowest exam grade. I'd say invest time into the textbook and/or a tutor if you want to be successful in this course. However, you can still get low B's/high C's on the exam and manage to hold an A in the course (like me!). I feel alright going into the final but I would suggest that anyone taking to not expect him to make the course a breeze. Attending discussion sessions is mandatory if you want to be somewhat prepared for his exams. His class is manageable but good luck if you do not like teaching yourself concepts.", "rating": 2, "expected_grade": "A", "created": "2023-11-21T05:15:11.973689Z"}, {"professor": "Tamas Darvas", "course": "MATH135", "review": "I just don't think he was meant to teach a lower-level math to mostly life science students. I can see him being a blast in courses that are higher level and filled with actual math majors, but he just doesn't break things down clearly enough, or over complicates well-known biological theorems. I am sure he would be wonderful, just not to a struggling bio student", "rating": 3, "expected_grade": "B+", "created": "2023-12-01T16:39:09.603267Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Dr. Rowland is a character. He definitely cares about the students and he tries to answer everyone’s questions. He’s not the best lecturer…he gets a bit off topic sometimes and that makes it hard to understand some of the material. He doesn’t record his lectures but he writes clearly on the chalkboard. He uploaded a lot of resources for practice and there’s plenty of HW/ in class assignments that help boost your grade. Overall nice guy and I’d rather take his class again than do Math140 lol.", "rating": 3, "expected_grade": "C", "created": "2023-12-06T20:23:40.414502Z"}, {"professor": "Tamas Darvas", "course": "MATH135", "review": "Tamas is funny and enjoyable, however overcomplicated many topics. His exams are similar to the homework and practice exams. There are two 75 min lectures per week and two 50 min discussions per week so be prepared to spend a lot of time with this course. DIS and hw were the main reason for my grade in the class.", "rating": 3, "expected_grade": "A", "created": "2023-12-08T20:32:43.161546Z"}, {"professor": "Tamas Darvas", "course": "MATH135", "review": "Tamas clearly knows the content of 135 very well and teaches it in a manner that worked very well for me. He does go kind of fast during lecture when reviewing concepts but does take the time to make sure that he answers any questions that students have. You get one lecture quiz a week, as well as one quiz and one worksheet in the discussion sections. Overall I enjoyed having him and I learned a lot from this class although 135 is not a very difficult course. Take him!", "rating": 4, "expected_grade": "A-", "created": "2023-12-12T14:14:05.722360Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Professor Rowland as a person is quite endearing. He takes the time to get to know his students, initiates conversations with you, and cracks sardonic jokes. He's very encouraging and accommodating toward his students. Take note, however: once he knows your name and becomes comfortable with you, he will call you out and ask you to answer questions in front of the class. This sometimes involves solving a problem on the front chalkboard. Of course, if you decline, he won't force you, but this is just something he does that might concern some. It's usually the people in front he targets but once in a while he will make his way to the back. The questions are usually easy to answer, though, so don't stress about this. \r\n\r\nProfessor Rowland as a teacher, however, can be challenging, but the content itself isn't. Lectures are usually composed of content material, practice problems, and questions. When covering content, he tends to go off-topic, but when he's taking questions, he often goes through homework and in-class quizzes and gives the answer to you (worth attending for this reason). He provides notes for each topic, and while they can be helpful, they can be equally confusing. If you want organization, it's better to go by the textbook for definitions, relationships, examples, etc. If you ask him a question, his explanations are a hit-or-miss. For explanations, it's better to show up to the discussions and have the TAs explain it to you; I definitely do not recommend skipping the discussions for this class. To get ready for each exam, he provides 2 old exams + answer keys, an online practice exam, and also holds a Zoom review session the night before. The exams are fair and not too hard; grading for partial credit is generous. There is quite a bit of teaching yourself in this class but as long as you put in a decent amount of effort, you should be able to keep an A. Good luck!", "rating": 3, "expected_grade": "A", "created": "2023-12-14T02:13:55.551434Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "DO NOT TAKE THIS CLASS!! He's probably the sweetest professor I've ever had and is a great guy, but his teaching style is not it. I've never been in a more disorganized class. The lectures aren't really \"learning,\" it's more like someone asks questions and he goes over them for the entire class period. Also, the practice midterms are not like the real exams so be prepared to have a random question thrown your way. I had to do a lot of self-studying for this class and it takes up a lot of work.  Btw, don't depend on the half-dropped midterm, it almost does nothing for your grade", "rating": 1, "expected_grade": "A", "created": "2023-12-14T05:28:35.566533Z"}, {"professor": "Tamas Darvas", "course": "MATH135", "review": "Professor Darvas is a really nice guy and great professor. He genuinely cares about his students and wants them to succeed. The class isn’t hard, mostly statistics and his exams are very fair (the averages are always pretty good). The midterms are very similar to past exams and practice problems we do in class. Overall a great teacher and you should take him.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T00:30:06.347133Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Dr. Rowland is a nice, caring person. He attempts to learn everybody's name and he tries hard to explain the content. He is also very open to questions and walking the class through challenging problems. However, his lectures are somewhat unorganized and honestly a little useless. I went to every lecture, but I hardly paid attention to them because of this. The good news is that this course is super easy, so Dr. Rowland doesn't really need to be that good of a teacher. I mainly used the textbook to write my notes as his notes were kind of all over the place and not very helpful. On the other hand, the discussions were beneficial and were much better at explaining the content than the lectures were, so I would recommend going to discussions over lectures. To prepare for exams, I just completed the practice exams on ELMS and read over my notes. The coursework is hardly time-consuming and I only spent about 2 hours studying per midterm (and 3 hours for the final), with most of that time dedicated to going over the practice exams. Dr. Rowland also usually hosts an online exam review session the night before exams, which I didn't really use, but he basically just answers people's questions and goes over any problems from the practice exams that people wanted help with. The exams themselves are not hard and are pretty similar to the practice exams. As for grading, it's fair, he drops half of your lowest midterm, doesn't use +/-, and is not heavily weighted toward exams. All in all, this is a fairly easy course with plenty of resources and a mediocre, but kind, professor.", "rating": 4, "expected_grade": "A", "created": "2023-12-16T00:07:54.081766Z"}, {"professor": "Tamas Darvas", "course": "MATH135", "review": "If you have the option to take this class with Darvas then go for it. As long as you keep up with the homework and pay attention in discussion then you'll get an A. Homework isn't graded so it's hard to remember or want to do it. I learned more from discussion than class but he did his best to make sure the class was following along and understanding the topics. Its probably for all of math135 but know that there is a quiz once a week and a graded worksheet once a week, but its pretty easy to get full credit on those. The TA's were really helpful and you could ask for help during the quiz/worksheet. Darvas provides practice exams that are exactly like the upcoming exams and thats extremely helpful when studying. The final isn’t hard but you just need to make sure you really know the material from the exams. I also took this at the same time as bio and chem and it was pretty easy to focus on those and keep this in the background.", "rating": 5, "expected_grade": "A", "created": "2023-12-16T00:54:39.034369Z"}, {"professor": "Tamas Darvas", "course": "MATH135", "review": "If you can, take this professor, he was super sweet and understanding. Although there were certain topics he didn't explain very well (mostly the biological aspects of the class) there was a lot of other support. The TA's were very helpful in discussion so if you're feeling lost after a lecture or two it's pretty easy to catch up. There is homework in the textbook but it's not graded and there are quizzes and worksheets in discussion that can help stabilize your grade although they aren't worth much so it probably won't boost it by a lot. Before every exam he provides practice exams from previous years that are pretty much identical to the actual exams so they aren't too difficult if you study those. So sad he won't teach me again.", "rating": 5, "expected_grade": "B", "created": "2023-12-16T00:58:54.573854Z"}, {"professor": "Tamas Darvas", "course": "MATH135", "review": "very helpful and funny, gives a lot of pop quizzes during lectures (only one question) and very easy. however, a lot of self teaching because he doesn’t really explain some of the concepts", "rating": 4, "expected_grade": "B-", "created": "2023-12-16T08:44:48.884191Z"}, {"professor": "Tamas Darvas", "course": "MATH135", "review": "HE IS FANTASTIC, FUNNY, KIND, AND CARING! He is such a good lecturer. He goes through the textbook examples in class and explains each steps one at a time. His lectures were done at a good pace and his funny personality made the class very enjoyable. If you're not strong at math, take his class!", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T05:01:10.040386Z"}, {"professor": "Tamas Darvas", "course": "MATH135", "review": "Tamas is great. Easy class as long as you show up to lectures since they aren't posted or recorded. Your grade is heavily weighted by other assignments, and his midterms are easy. Just don't expect any curve. Highly recommend him.", "rating": 5, "expected_grade": "A", "created": "2023-12-18T17:10:21.527434Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Dr. Rowland is very kind and can be funny sometimes. He’s a great person but not the best professor. He goes on long tangents that barely make sense and takes too long to answer simple questions. But he is a really easy grader and makes the midterms and final quite easy. Also, most quizzes and homework have 2 attempts.", "rating": 3, "expected_grade": "A", "created": "2024-01-04T02:00:02.155863Z"}, {"professor": "Todd Rowland", "course": "MATH135", "review": "Let me start this review by saying that this is probably one of the nicest professors I've ever had. Super considerate, funny, and overall just a nice guy. He is just not a very good teacher. He can be very confusing and tends to spend his lectures answering questions about the homework instead of teaching the subject. The quizzes and homework are very easy: he usually goes over those in class, but the exams can be very difficult and hard to study for. Be warned: the practice midterms seldom match the real one.", "rating": 2, "expected_grade": "A", "created": "2024-01-12T13:40:57.113737Z"}, {"professor": "Tamas Darvas", "course": "MATH135", "review": "Tamas was a fairly good teacher and listened to student feedback. His lectures became easier to follow as the semester went on. He is not the best with technology but is very nice and accommodating. If given the choice between him and Rowland, TAKE TAMAS", "rating": 4, "expected_grade": "B+", "created": "2024-02-05T19:40:19.326788Z"}], "department": "MATH", "course_number": "135", "name": "MATH135", "title": "Discrete Mathematics for Life Sciences", "credits": 4, "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH115; or must have math eligibility of MATH140 or higher; and math eligibility is based on the Math Placement Test.\n<b>Restriction:</b> Must be in the Biological Sciences or Neuroscience major; and not open to students majoring in mathematics, engineering, or the physical sciences.\nBasic discrete mathematics, with emphasis on relevant models and techniques to the life sciences.", "is_recent": true, "geneds": null}