{"average_gpa": 3.5081604426002766, "professors": ["Karol Soltan", "Rashawn Ray", "Robert Koulish", "Robert Koulish", "Robert Koulish", "Robert Koulish"], "reviews": [{"professor": "Robert Koulish", "course": "MLAW100", "review": "Very unorganized teaching method. Not receptive to students concerns. Very ineffective teaching method. His teaching method will just make you more confused than before. Had to teach myself most of the course.", "rating": 1, "expected_grade": "A", "created": "2021-12-08T18:38:48Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Dr. Koulish is a great guy, but not the best lecturer. His slides are not the easiest to understand, and when you expect him to explain them, he seems to go off topic. The final assignment (7-8 page essay or 15 minute podcast) is too long in my opinion. If he wanted us to do an essay, I wouldn't have a problem if it wasn't so long.", "rating": 3, "expected_grade": "A", "created": "2022-12-08T03:06:08.270044Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Smart man and interesting to talk with but his lectures are just him rambling and his tests are confusing and poorly worded. He gets about 2 slides into the 25 slide powerpoint before getting off topic and then you have to teach yourself that material. Your TA will be doing almost all of the grading and actual teaching.", "rating": 2, "expected_grade": "A", "created": "2022-12-24T07:28:49.244276Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "MLAW100 was the dumbest class I’ve ever taken. Don’t recommend 😀", "rating": 1, "expected_grade": "A", "created": "2023-01-12T00:24:45.259495Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Terrible class and professor. Would give zero stars if could.", "rating": 1, "expected_grade": "", "created": "2023-02-09T23:35:34.026154Z"}, {"professor": "Monica Cardenas Guzman", "course": "MLAW100", "review": "I had Monica as a TA for MLAW100 during the Fall 2022 semester. She does most, if not all of the grading for the class. She is WAYYYY better than Dr. Koulish, and covers whatever we didn't get to during class in our discussion sessions (Dr. Koulish rambles a lot during lecture, and she understands that). She's honestly an AMAZING TA, and I'm sure she would be an AMAZING lecturer. Tbh I would give her 6 stars if I could.", "rating": 5, "expected_grade": "A", "created": "2023-05-11T02:01:42.635756Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "He is very disorganized. He is also biased against students who hold different political views from him. My interest in law still stands, but I would not recommend taking a class with him if you can.", "rating": 1, "expected_grade": "", "created": "2023-05-15T18:12:06.259802Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Dr. Koulish is a really nice guy who I had for MLAW100 during the Fall 2022 semester, but lecture starts with a few slides, then he starts rambling about things completely off topic. Also, his quizzes are very poorly worded, and the grading of assignments literally takes FOREVER. After I completed the final assignment, I didn't receive a grade for it until January, which is well after Final Exams for the Fall Semester.", "rating": 2, "expected_grade": "A", "created": "2023-06-01T01:28:32.066472Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "He's okay, what I didn't like was that sometimes would read slide and then talk about other things not going through the rest of the slides. test weren't bad but you'd have to read all the articles remember dates, authors, and sometimes what you remember isn't even on the exam. No final exam only a 8 page 2000 word essay (it's do-able, but don't be like me who did it 4 hours before it was due :( This course doesn't leave you with home-work so you don't have to focus on it as much compared to other classes. but definitely take opportunities of the JLT scholars program!", "rating": 3, "expected_grade": "B-", "created": "2023-12-14T20:57:58.122028Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Dr. Koulish is very disorganized, and it hurts the quality of the class. As the other reviews say, he is prone to tangents and lets discussions between students in lecture go on for too long; there was one class where we did not move past the title slide of his presentation because of discussions between students. Additionally, in these kinds of back-and-forth discussions, one sometimes gets the sense that, despite his claims to the contrary, Koulish wants us to come away with his specific view on the law. All of this would be fine if the class was primarily about discussions, but the components of the grade are attendance, service hours/events, two exams which test mostly from the slides, and a final paper that you don't really need discussions to do well on. The total effect of this is that the class is frustratingly paced, and lectures are extremely unhelpful (but still required!!) to prepare for exams. Also, the materials (slides, etc.) often are not posted, posted super late, or of very poor quality. On the positive side, Dr. Koulish is very accessible and willing to work with students. All in all, I really can't recommend this class.", "rating": 2, "expected_grade": "A", "created": "2023-12-21T19:53:27.556629Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "Do not take Koulish if you can help it. I had him for MLAW100, and he made me want to drop scholars altogether. His lectures consist of him rambling about topics hat are only very very loosely related to his powerpoints, making his exams very difficult to study for. The TA makes or breaks the class. Although he's an intelligent person, he is a horrible professor, and I don't feel I learned as much as I could've from this class.", "rating": 1, "expected_grade": "A-", "created": "2023-12-23T07:35:33.483002Z"}, {"professor": "Robert Koulish", "course": "MLAW100", "review": "He is a nice professor but his teaching style is very disorganized. The lecture slides made almost zero sense, and he only got through a couple slides each class before going off topic anyway. Also, he constantly assigned things that weren't on the syllabus, and his criteria for major papers and exams were extremely vague. That being said, the class itself isn't terribly difficult only if you put in the work and study. The exams are hard but not impossible.", "rating": 2, "expected_grade": "A", "created": "2024-01-13T18:21:27.192693Z"}], "department": "MLAW", "course_number": "100", "name": "MLAW100", "title": "Justice and the Law", "credits": 3, "description": "<b>Restriction:</b> Course enrollment is restricted to students in the College Park Scholars Justice and Legal Thought Program (CPJT).\nAn exploration into the relationship between justice and law, including psychological, philosophical, political and legal approaches to justice, as well as an analytical framework for understanding human rights.", "is_recent": true, "geneds": null}