{"average_gpa": 3.097063492063492, "professors": ["Jared Kenlon", "Eric Pazdziora", "Bradley Green", "Bryce Fuhrman", "Michael Fili", "Dominic Ellis", "John Leszczynski", "Jonathan Graybill", "Joel Pierson", "Mark Nowakowski", "Henry Wixon", "Douglas Welcome", "John Boatright", "Quinn Dizon", "Alexander Devereux", "Michael Oberhauser", "Rachel Raphael", "Rizgar Ismael", "Isador Miller", "Johannes Visser", "Jiheng Bi", "Isador Miller", "Jiheng Bi", "Isador Miller", "Isador Miller", "Richard Drehoff", "Sean Klink", "Sean Klink", "Jiheng Bi", "Jiheng Bi", "Sean Klink", "Richard Drehoff", "Sean Klink"], "reviews": [{"professor": "Dominic Ellis", "course": "MUSC140", "review": "Dom is a really nice dude. He's only here for 2 years or so (he's a masters student in composition) so take this class with him while you can. Legitimately makes theory fun and accessible.", "rating": 5, "expected_grade": "A", "created": "2018-04-11T22:32:14Z"}, {"professor": "Quinn Dizon", "course": "MUSC140", "review": "He is an easy professor!", "rating": 5, "expected_grade": "", "created": "2019-06-16T21:48:57Z"}, {"professor": "Alexander Devereux", "course": "MUSC140", "review": "it will be very difficult if u don't have music background do not recommend it is definitely not easy gen ed.", "rating": 2, "expected_grade": "B+", "created": "2020-01-17T21:32:11Z"}, {"professor": "Alexander Devereux", "course": "MUSC140", "review": "if you have a background in musical instruments and specifically reading sheet music, this class will be a breeze for you. if not, then I do not suggest you take this class. alexander was not really patient with those struggling so it is best if you take this class if you have prior knowledge.", "rating": 4, "expected_grade": "A+", "created": "2020-05-20T18:39:51Z"}, {"professor": "Alexander Devereux", "course": "MUSC140", "review": "I liked him. I have a semi-strong musical background, and it made the class really enjoyable for me. He adjusted to the online learning environment very well. I think the class was fair, but there is probably a huge learning curve if you're new to reading sheet music.", "rating": 5, "expected_grade": "", "created": "2020-11-22T21:07:15Z"}, {"professor": "Rizgar Ismael", "course": "MUSC140", "review": "Very solid dude. Class was pretty easy, and there was not a heavy course load. A little bit of a dry sense of humor, but still.", "rating": 4, "expected_grade": "A+", "created": "2020-12-18T17:15:22Z"}, {"professor": "Rachel Raphael", "course": "MUSC140", "review": "Honestly, the best professor I have had so far at UMD and I don't think I will ever have a professor as amazing as Rachel. She is super sweet and thoughtful, she wants all of her students to pass her class. She is willing and able to help every one of her students anytime throughout the week if they need it.  She takes your thoughts into consideration and really cares for her students. I hope anyone who is ever thinking about taking a class with her please do she is awesome. I suggest going for help in the major projects such as the composition and listening room project, she is really good at helping you get a good grade on them. I'm not good at music at all and have zero background in music but I would 100% take it over again with her as my professor because I really enjoy her class. Definitely my favorite class throughout my whole fall semester.", "rating": 5, "expected_grade": "A", "created": "2021-12-10T06:30:04Z"}, {"professor": "Rachel Raphael", "course": "MUSC140", "review": "Ms. Raphael is an amazing professor. She helps her students so much while going through the content, and she gives them so much support. If you have the option to take her class, take it.", "rating": 5, "expected_grade": "B", "created": "2022-02-02T03:06:04Z"}, {"professor": "Rachel Raphael", "course": "MUSC140", "review": "Really sweet professor. Course does give a lot of busy work and she understands that. She also devotes a lot of time to her students, going outside of office hours to make sure her students understand the material. ", "rating": 5, "expected_grade": "B+", "created": "2022-02-05T06:56:16Z"}, {"professor": "Richard Drehoff", "course": "MUSC140", "review": "Grades Prospectus: B\r\nWhy a B rating despite me getting an A-? Simply put this class has a HIGH workload for an intro class. Certain assignments can take a few hours, and this is coming from someone who has previous music experience with piano. If you are someone who has 0 music experience before this course you will not do well at all. It is unrealistic and to be honest impossible to keep up with the pace if so. Workload is still high even if you have experience as it is majority busywork from the sheer length of your weekly / daily homework.\r\nExams are not bad however, and Prof. Drehoff is very very lenient with late work (as in end of the semester lenient) so if you are dedicated enough to do every assignment, you can achieve an A/A+ albeit the time commitment is large. \r\n\r\nEnjoyability Prospectus: A+++\r\nProf. Drehoff is an absolutely phenomenal professor. Extremely knowledgably, crazy friendly, and just a general all around joy to have. I believe this is one of his first semesters here when I took this course and I certainly hope he continues teaching here. This guy is just one of the most fun and best experiences I've had while here so far.\r\n\r\nOverall this course was fantastic fun and enjoyable for anyone with interest in music, even those with experience, however the sheer homework workload and busywork drags the rating down a little. If you must take this course, try to aim for Prof. Drehoff. Absolutely phenomenal prof.", "rating": 4, "expected_grade": "A-", "created": "2022-12-15T08:10:40.197725Z"}, {"professor": "Richard Drehoff", "course": "MUSC140", "review": "This course is not hard, however, it can get very confusing at times for someone who may not have taken a Music Theory course before. I do highly recommend the class as Prof. Drehoff is amazing. You should always stay on top of work, however, if you ever feel overwhelmed with the material he is willing to work with you to ensure that you do well in the class. The workload is very high and it is a majority of worksheets and pdfs (one is assigned every lecture). Other than that, try your best and your grades will show the result! \r\nEnjoyability A+++++++++++++", "rating": 5, "expected_grade": "B-", "created": "2022-12-18T19:36:39.198896Z"}, {"professor": "Isador Miller", "course": "MUSC140", "review": "this guy is a complete nuthugger to traditional western music theory principles (no pARaLlEl fiFtHs, no going down the scale in harmonic minor, etc.); whenever he hears something that he doesn't like, he will directly insult you in front of the whole class by saying \"it's weird, don't do that\"; even though nobody would agree with him after he backtracks and asks for the class's opinion; extremely closed-minded grader in assignments, and no sense of creativity whatsoever when it comes to composition (we listened to one of his pieces and it was bland and lacking in every possible way); absolutely disgusting professor", "rating": 1, "expected_grade": "A", "created": "2023-05-18T00:14:15.802809Z"}], "department": "MUSC", "course_number": "140", "name": "MUSC140", "title": "Music Fundamentals I", "credits": 3, "description": "<b>Restriction:</b> Must not be in any of the following programs (Music (Professional Program); Music Education).\nIntroductory theory course. Notation, scales, intervals, triads, rhythm, form and basic aural skills.", "is_recent": true, "geneds": null}