{"average_gpa": 3.2415051740357477, "professors": ["Fernando Rios", "Melanie Pinkert", "Cheryl Tobler", "Julia Topper", "Nicole Powlison", "Nicole Powlison", "Fernando Rios", "Nicole Powlison", "Nicole Powlison", "Nicole Powlison", "Nicole Powlison", "Nicole Powlison"], "reviews": [{"professor": "Fernando Rios", "course": "MUSC210", "review": "This class was extremely boring. The lectures were helpful though, because he would basically tell you exactly what you needed to know for the exams. A study guide would be released before the exam with \"study questions\" that were basically copied onto the exam. Therefore, going to lecture was important. The only grades were 3 exams (the final is not cumulative), 2 papers (5 pages each), and participation. The papers were extremely hard to write because the topics were kind of dumb. It also all depends on the TA you get, because they grade all of the exams/papers/participation. Overall, the class was easy just EXTREMELY boring.", "rating": 3, "expected_grade": "A", "created": "2015-01-05T15:23:00Z"}, {"professor": "Fernando Rios", "course": "MUSC210", "review": "Rios is probably the best teacher I have had yet at Maryland. He is kind, charismatic, reasonable, and engaging. MUSC210 is a great gen-ed: easy, interesting, and different than anything else you will take at Maryland. I am an engineering major, and music is not really my thing. But this class was so well designed that I couldn't help but enjoy it and do well. Rios picks case studies that  emphasize the point he is trying to make: the close relationship of music and culture. By the end, he creates a bigger picture that really stays with you. If you go to class most of the time, spend a little time listening to the music before the exams, you will have no trouble getting an A. Absolutely take this class and do so with Professor Rios. ", "rating": 5, "expected_grade": "A", "created": "2014-12-26T15:55:00Z"}, {"professor": "Fernando Rios", "course": "MUSC210", "review": "As a lecturer, Rios is alright and the class can get really boring. However, taking this class is totally worth it because it gives you two geneds and is easy.  As long as you look at his outlines before the exam, you should be fine. From what I know, the TAs grade the exams, which is probably why my first two exams were graded pretty leniently. \r\n\r\nAlso, a lot of people don't even attend class, so I don't believe that attendance is necessary to get a good grade, but I still recommend going to class and listening.", "rating": 5, "expected_grade": "A-", "created": "2018-05-03T03:35:38Z"}, {"professor": "Fernando Rios", "course": "MUSC210", "review": "The course is fairly straightforward and pretty easy. His teaching style is usually interesting, with guest lecturers throughout the semester mixed in. We had quizzes each week in discussion which kept me going and it was honestly worth staying to go over everything with the TA.", "rating": 5, "expected_grade": "A+", "created": "2018-05-19T18:05:00Z"}, {"professor": "Fernando Rios", "course": "MUSC210", "review": "Professor Rios was a wonderful professor and really knows the topic. The exams are fair; if you come to class you should do well. My TA Mariangel Villabos was absolutely wonderful. A great class. I recommend to all!", "rating": 5, "expected_grade": "A", "created": "2019-12-11T21:12:16Z"}, {"professor": "Fernando Rios", "course": "MUSC210", "review": "If you want an easy A, by all means DO NOT take this course. The concepts and ideas were very simple but the grading was very subjective to the extent that some TA's found a lot of difficulty finding a justifiable reason and would end up giving some points back (only if you review your exam individually with them). They graded harshly for no reason especially at the beginning, so when they realized the ending average would be terrible, they completely loosened their grading style. Stay away from this course by all means if you do not want a lot of extra work.", "rating": 2, "expected_grade": "B", "created": "2019-12-22T18:23:57Z"}, {"professor": "Nicole Powlison", "course": "MUSC210", "review": "idk i mean musc210 got pretty dry at times but it was easy. she's nice and knowledgeable but i don't vibe that well this kind of content, just took it because it's an easy A. if she's teaching it definitely take it", "rating": 5, "expected_grade": "A", "created": "2020-05-13T00:57:40Z"}, {"professor": "Fernando Rios", "course": "MUSC210", "review": "This class was very easy and the work was easy to keep track of. That being said, the professor was extremely lazy. The writing prompts for each week towards the end of the semester got extremely repetitive which made the content less engaging. Another thing to note is the class became less and less about music, and more and more about stereotypes, and struggles of different races, cultures, and ethnic backgrounds. Towards the end of the semester, the lectures had less focus on the music, and eventually, the writing prompts did not even mention music. ", "rating": 2, "expected_grade": "A+", "created": "2020-12-28T17:44:52Z"}, {"professor": "Fernando Rios", "course": "MUSC210", "review": "Overall, really enjoyed this class. It's not exactly what it sounds like. When you hear \"the impact of music on life,\" you think more about psychology and emotions and sociology, but this course was very much an ethnomusicology (music/anthropology) course. Also your experience in the course will really depend on the TAs, as they grade exams, and papers. Dr. Rios is a great lecturer and the only negative thing I have to say about him is that halfway through the semester, he stopped using pretty much any text in the slides, only keeping the examples (music/videos). I think he did this because of low lecture attendance. It was frustrating because your notes were literally the only resource left to study for exams. Exams were easy if you pay attention (especially to the review sessions), so can't complain too much.", "rating": 4, "expected_grade": "A+", "created": "2022-01-01T03:28:01Z"}, {"professor": "Nicole Powlison", "course": "MUSC210", "review": "I took this class spring 2022. Dr. Powlison is a super nice professor, probably one of my favorite ones I've had! Her and the TA's were very responsive to student concerns and accessible for feedback. You can get away with skipping lecture sometimes but she did make them fun. Attending discussion was mandatory for participation and we had a discussion post due each week. You definitely need to at least skim the textbook for the weekly online quizzes (open note though) and for the final exam but overall a decently easy A as long as you study and start the final project early!", "rating": 5, "expected_grade": "A+", "created": "2022-09-28T15:24:00.072815Z"}, {"professor": "Nicole Powlison", "course": "MUSC210", "review": "Dr.Powlison is super nice but this is not an easy gen ed. The tests are so specific and on topics such as Music in Bali or other complex music topics you wouldnt think you would need to know for a gen ed. There is one major assignment at the end of the semester which has many assignments leading up to it. But overall, the tests are not easy and you must study very specific topics that are randomly thrown in the slides in order to get a good grade.", "rating": 3, "expected_grade": "B+", "created": "2022-11-30T18:18:10.268139Z"}, {"professor": "Nicole Powlison", "course": "MUSC210", "review": "DO NOT TAKE THIS COURSE IF YOU WANT AN EASY GEN ED. Please save yourself the stress. This is not an easy A. There are in-class QR codes to scan which are graded for participation. There is a musical interview which includes the actual interview of someone, a contextual bibliography, a few smaller related assignments, and then a 1500-2000 word final paper. There are 2 mid-term exams and one final exam.", "rating": 2, "expected_grade": "C+", "created": "2022-12-08T03:17:48.717286Z"}, {"professor": "Nicole Powlison", "course": "MUSC210", "review": "Dr. Powlison is a very nice person, but I wouldn't recommend this course if you're not passionate about the different topics of music. There are A LOT of terms and definitions that you need to memorize, and the exams are not easy because the questions could be about a range of terms that were said during any of her lectures. This is not an easy A, so don't expect to breeze through this class without at least putting some effort into studying or reviewing the lectures. There is a check-in for every lecture, which you have to take during class to get credit. There is one music experience interview, which is about 1,500-2000 words. There are 3 exams, which you will not pass unless you actually study the content that she lectured about. Her study guides basically just list every topic and term she discussed in all of her lectures, which is pointless when it comes to knowing what will be on the exam. Discussions really just depend on your TA, and mine was very chill fortunately. Not a horrible class, but definitely something I don't recommend if you aren't very passionate about the culture and history of music.", "rating": 3, "expected_grade": "A", "created": "2022-12-12T01:12:51.380000Z"}, {"professor": "Nicole Powlison", "course": "MUSC210", "review": "This class is not easy what so ever and very boring if you don't have an interest for cultural music. The tests were very hard and I spent about 10 hours studying for each test and hardly got above a B average on all them. These assignments make up your grade pretty much. There is also a course long interview project with hardly any instructions. I would never take this course again and it is my lowest grade of all 16 credits I am taking.", "rating": 2, "expected_grade": "A-", "created": "2022-12-14T20:05:58.268539Z"}, {"professor": "Nicole Powlison", "course": "MUSC210", "review": "Interesting course, you don’t need to go to lectures besides to get a check in point. The URL to check in was the same each week with the date changed. Frustrating that attendance is required for a lecture when the slides have almost all the information needed.\r\nExams are hard but if you do the other assignments (mostly graded on completion) it’ll balance out and your overall grade will be good.", "rating": 4, "expected_grade": "A", "created": "2022-12-27T18:34:13.925961Z"}, {"professor": "Fernando Rios", "course": "MUSC210", "review": "Frustratingly, a lot of people around me did really well but I just could not understand HOW. the lectures are boring. and the wrong TA can make this even worse. my TA was not helpful at all and didn't seem to teach cohesively with the class. Avoid this if you want an easy A", "rating": 3, "expected_grade": "B", "created": "2023-02-18T05:52:36.460198Z"}, {"professor": "Nicole Powlison", "course": "MUSC210", "review": "Please do not take this class if you want an easy gen ed. I truly mean it from the bottom of my heart. I am a stem major trying to study for all of my stem classes for finals and there is NO reason that I should be trying to study for this class with her six page study guide when I have an orgo exam the same day. The class itself is not terrible content wise and Dr. Powlison is a good professor BUT there is in class participation points that are required to attend and the midterms are very hard and in person. Im sorry, but this is not it.", "rating": 1, "expected_grade": "", "created": "2023-05-14T06:52:29.387619Z"}, {"professor": "Nicole Powlison", "course": "MUSC210", "review": "Nice person, extremely boring lecturer, extremely boring class. Major grades are participation (lecture and discussion) and a project that isn't too bad. Exams suck though. Way too much granular information and terms you need to memorize to do well. Class is fairly easy but I wouldn't recommend unless you are deeply interested in ethnomusicology. Professor is fine at best.", "rating": 2, "expected_grade": "A", "created": "2023-05-14T23:11:01.499238Z"}, {"professor": "Nicole Powlison", "course": "MUSC210", "review": "She is a very nice person, but she knows most people are taking her class to get their gen-ed out the way. She can be a little awkward and passively upset that some people aren't paying attention and are just there for the participation check (you have to go to class to earn participation, it's part of your grade). She does her best to try and engage the class, but it's just tough when the content is so obscure most of the time. If you are at least somewhat interested in various music genres this could be fine, but it is not that easy of an A. There is a mid-term and a final, both are about hyper-specific material mentioned in lecture, and a project which is a majority of your grade that you are supposed to work on over the course of the semester. Do not take this class if you are trying to do nothing, you definitely will have to put in some work for an A.", "rating": 3, "expected_grade": "A", "created": "2023-05-19T01:51:54.291464Z"}, {"professor": "Nicole Powlison", "course": "MUSC210", "review": "Professor Powlison is a very nice person but this class was pretty hard for no reason. As someone who is a musician through hobby and needed a gen ed I thought I would really like this class but I regretted it so much after. She has a mid term, a final, and a crazy long final project. She also grades attendance through qr code check-ins which is extremely annoying. The content is also pretty boring as it was mostly cultural music from many years ago. It's relatively an easy A but some work has to be put in.", "rating": 3, "expected_grade": "A", "created": "2023-12-06T01:39:46.525492Z"}, {"professor": "Nicole Powlison", "course": "MUSC210", "review": "I really liked Dr. P! She was really nice and understanding. A lot of people, including me, took this to fulfill GenEd requirements and I would say it is worth it, but it definitely depends on how much you are interested in world music and music history. If you don't care about music that much, you probably won't like this class. We had quizzes on the textbook and I would control f them all and get 100 percent. The midterm and final were kind of hard, but not worth that much of your grade, and the majority of your grade is an interview project that takes a while to do.", "rating": 4, "expected_grade": "A+", "created": "2023-12-07T18:53:28.542806Z"}], "department": "MUSC", "course_number": "210", "name": "MUSC210", "title": "The Impact of Music on Life", "credits": 3, "description": "<b>Credit only granted for:</b> MUET210 or MUSC210.\n<b>Formerly:</b> MUET210.\nMusic as a part of culture. Materials drawn from traditions throughout the globe to illustrate issues of historical and contemporary significance, including the impact of race, class and gender on the study of music.", "is_recent": true, "geneds": null}