{"average_gpa": 3.670722433460076, "professors": ["Hilary Bierman", "Hilary Bierman", "Hilary Bierman", "Hilary Bierman", "Hilary Bierman", "Hilary Bierman", "Hilary Bierman"], "reviews": [{"professor": "Hilary Bierman", "course": "NEUR405", "review": "I enjoyed the lab portion for this class, but the lecture was long and wasn't helpful. It is a bit of busy work, but the class itself was not hard", "rating": 3, "expected_grade": "A", "created": "2023-05-15T21:29:05.584427Z"}, {"professor": "Hilary Bierman", "course": "NEUR405", "review": "Was told this was an easy A and it was, but not for everyone. Grading is nearly entirely done by your TA, and some are much harder on grading than others. Class has no curve, so if you get a harsh TA in terms of grading, you will likely struggle to get an A. It is unfair that your grade for each group assignment is a group grade despite each person writing their individual contributions on every assignment, you do not get graded based on your portions only. This sucks because your grade could be bad because of your group members mistakes and your grade does not reflect your own work. Assignments are not difficult but can be time consuming.", "rating": 2, "expected_grade": "B", "created": "2023-05-20T21:53:57.866985Z"}, {"professor": "Hilary Bierman", "course": "NEUR405", "review": "This class is so much work. Every week you have a prelab quiz, post-lab worksheet, pre-lecture reading, a four hour lab, in lecture worksheet, and a lab report due. The groups are divided up unequally. Some people have groups of five, which end up having way less work. If you are in a group of three people, you are basically cooked. You have to do so much more work with the same deadlines, and the grading does not reflect this. None of the experiments are going to work, so you have to pull everything out of your %. Everthing about this class is frustrating. She is also so condecending when you talk to her or ask for feedback. She is so uneducated at everything besides neurosceince. For the final project, she expects your research to be as good as a one year research project. If you have a chill TA, getting an A is not that difficult if you do all the work. However, if your TA is %, you are not getting an A. The lab reports are all going to be 30-40 pages long, and the TAs don't really grade the reports. They just look for reasons to take points off and specefically look for tiny wrong details just so to say they graded that. Also, my TA had no style. Dr. Bierman was also heavy.", "rating": 1, "expected_grade": "A-", "created": "2023-12-12T18:37:32.041933Z"}, {"professor": "Hilary Bierman", "course": "NEUR405", "review": "I got an A in this course but please listen to these reviews, they are all accurate. This truly was the worst class I've taken at UMD. It's upsetting, because the grade distribution makes it seem great. Even the actual labs are interesting, but the structure, workload, and TAs in the course completely ruined my experience. It really is a shame because you get to do really cool experiments in this course. \r\n\r\nMy TA took off insanely ridiculous exact decimal points for small details, despite working HOURS on the labs, attending all possible office hours, and emailing the TAs (by the way, they don't respond). The amount of work I put in for the class was insane. The TAs are not helpful, and you have to go to different TAs for different things which is frustrating. The lab reports are like 25% lecture TA content which your lab TAs have no idea how to do, and the rest is from the lab. The troubleshooting takes forever, which was expected, but the annoying part is how rude and passive aggressive the TAs and Dr. Bierman can be when you ask for help. My group and I were genuinely scared to ask for help because of how rude our TA would be when we asked. Be prepared for a rough semester. The weekly lab reports, quizzes, in-lab worksheets, and in-lecture worksheets are a lot. \r\n\r\nBut the last two weeks of the course was something else. You submit a proposal paper for an experiment you design yourself. After three weeks of data collection for that experiment (with weekly quizzes, weekly in-lab worksheets, and weekly lecture mini-presentations), you have to submit a research poster presentation in one week, present it in lab that same week, then a week later you have the cumulative lab report due, including another assignment where you are responding to comments that you got when you were being interrogated during the in-lab poster presentation. Then you present your poster in lecture. Then there is a final exam a few days later. The solution to this course is to make it 6 credits. \r\n\r\nI thought it was just me suffering in this course, until I started asking people how they felt and we were all suffering. Try to get a good lab group. Read the other reviews. There were only three reviews in before the Fall 2023 semester, now there are a bunch. Good luck.", "rating": 1, "expected_grade": "A", "created": "2024-01-27T02:50:14.813763Z"}], "department": "NEUR", "course_number": "405", "name": "NEUR405", "title": "Neuroscience Laboratory", "credits": 3, "description": "<b>Prerequisite:</b> NEUR306 or BSCI353.\n<b>Recommended:</b> NEUR305.\n<b>Cross-listed with:</b> BSCI455.\n<b>Credit only granted for:</b> PSYC401, NEUR405, BSCI455 or BSCI454.\nStudents will utilize neurophysiological techniques to examine fundamental principles of  neurons and neural circuits. This course will reinforce content from prerequisite NEUR courses. Students will also strengthen skills in experimental design and scientific writing.", "is_recent": true, "geneds": null}