{"average_gpa": 3.1215974519171876, "professors": ["Seong-Ho Lee", "Wen Hsing Cheng", "Hee-Jung Song", "Nadine Sahyoun", "Shaik Rahaman", "Thomas Castonguay", "Margaret Udahogora", "David Lei", "Hee-Jung Song", "Seong-Ho Lee", "Shaik Rahaman", "Hee-Jung Song", "Nadine Sahyoun", "Seong-Ho Lee", "Shaik Rahaman", "David Lei", "Hee-Jung Song", "Seong-Ho Lee", "Shaik Rahaman", "Margaret Udahogora", "Margaret Udahogora", "Margaret Udahogora", "Hee-Jung Song", "Nadine Sahyoun", "Seong-Ho Lee", "Shaik Rahaman", "Hee-Jung Song", "Margaret Slavin", "Margaret Slavin"], "reviews": [{"professor": "Thomas Castonguay", "course": "NFSC100", "review": "Dr. Castonguay was one of the lecturers for this course. His style of delivery was either very repetitive or too... simple. With how information intense the exams are, he could have covered much more ground in lecture instead of re- and over-emphasizing already-clear points. ", "rating": 2, "expected_grade": "B", "created": "2009-02-11T02:22:00Z"}, {"professor": "Robert Jackson", "course": "NFSC100", "review": "Hardest class in the game, and for god's sake it's a 100 level course.  Forget it, take it with another professor.  Discussion saved me not getting a D.", "rating": 2, "expected_grade": "C", "created": "2010-12-21T17:27:00Z"}, {"professor": "Robert Jackson", "course": "NFSC100", "review": "This class is tough, hands down. Dr. Jackson clearly knows what he is talking about but does a poor job explaining it to his students. The tests are extremely hard as some of the questions on there weren't covered at all in class. My best suggestion is to not take this class unless you like challenges. If you have no choice, then I seriously recommend doing the readings in the textbook. Some of it may be excessive but there are things I found that were questions on the test from the textbook that were never mentioned in lecture. ", "rating": 2, "expected_grade": "C", "created": "2009-12-26T16:32:00Z"}, {"professor": "Robert Jackson", "course": "NFSC100", "review": "do not take this class if it's just for a CORE. it's much less interesting than you would think, and a lot of work. it's definitely not an easy A, or even an easy B", "rating": 1, "expected_grade": "", "created": "2009-10-11T15:26:00Z"}, {"professor": "Robert Jackson", "course": "NFSC100", "review": "This man should definitely be doing something else with his time. It seems like this class is too simple for him and he tries to dumb it down, but the exams dig deeper than he lets on by his demeanor.\n\r\nThe homework, in-class quizzes, and extra credit definitely saved the day.\n\r\nThe class isn't very fun to sit through (and you have to if you want extra credit stuff). He must've gone over this stuff so much that he's bored with it now and doesn't offer much enthusiasm.\n\r\nThe TAs are pretty helpful and the non-Exam grades are definitely worth putting effort into to keep your grade afloat.\n\r\nPersonally, I basically never read the book and managed to pass; although I think it would've helped if I did.\n\r\nFor a level 100 class, the reading seemed a bit excessive and the time spent on certain projects was a little beyond what one should do for a 3 credit class at that level.\n\r\nBe careful taking this as a CORE if you are not into the basics of Chemistry/Biology. It can be pretty rough without a lot of reading/memorizing.", "rating": 2, "expected_grade": "B", "created": "2009-08-19T14:46:00Z"}, {"professor": "Robert Jackson", "course": "NFSC100", "review": "He is a really boring professor despite how interesting he could make the course material if he wanted to.  His test questions are also really weird and unrelated sometimes.  The good thing is that he pretty much only tests from the lecture notes.  So I just memorized them. I only read three chapters out of the book the whole semester-- and that was just out of interest, I don't think it actually helped.  Make sure you do well in discussion and go to lecture for the bonus points!! They really end up adding up and could make a huge difference.", "rating": 3, "expected_grade": "A", "created": "2009-05-23T16:45:00Z"}, {"professor": "Robert Jackson", "course": "NFSC100", "review": "The man hates his life. He lectures about information that is useless on tests. He takes his miserable life out on his students. 3 Exams and Final worth 450 and the Discussion is worth 200. Final is hard, there will be no curve on anything. Class avgerage on all three tests was below a 70 and he thought that was fine? Bottom line unless you have to take this class avoid it!!!", "rating": 1, "expected_grade": "B", "created": "2009-05-16T12:37:00Z"}, {"professor": "Robert Jackson", "course": "NFSC100", "review": "This was pretty tough. I enjoyed the material but wished the expectations would have been more clearly laid out. I'm not expecting any hand-holding here, but too much of the lectured material never made it onto any of the exams. The essay questions on the exam are probably the hardest part of the entire class--if you're asked to describe a process or a sequence of events, know EVERY step. If you're not doing terribly well in the class, the final project is ridiculously easy compared to the exams; do well on that and it will help. ", "rating": 2, "expected_grade": "B", "created": "2009-02-11T02:27:00Z"}, {"professor": "Robert Jackson", "course": "NFSC100", "review": "Very difficult class.  The exams were very tough and he asks questions about material that you don't even feel was covered in lecture.  He clearly knows what he's talking about, but he's not good as a teacher.\n\r\nThe homework and projects aren't too bad and will probably save your grade.\n\r\nAs a freshman Food Science major already having taken NFSC112 (Intro to Food Science), I barely got a B- in NFSC100.", "rating": 2, "expected_grade": "B-", "created": "2008-06-18T21:46:00Z"}, {"professor": "Robert Jackson", "course": "NFSC100", "review": "DO NOT take this teacher or this class. YOU WILL FAIL just like myelf and the rest of my class did.", "rating": 1, "expected_grade": "", "created": "2008-01-07T12:07:00Z"}, {"professor": "Shaik Rahaman", "course": "NFSC100", "review": "One of the worst lecturers I've ever witnessed. He's probably a very smart dude, but terrible at giving a decent lecture. He was one of 4 lecturers for my class.", "rating": 1, "expected_grade": "B", "created": "2019-02-28T15:13:14Z"}, {"professor": "Nadine Sahyoun", "course": "NFSC100", "review": "She was a very nice professor. Not the best professor, but out of the 4 professors I had, she was the \"best\". Presented her slides well and answered questions well.", "rating": 4, "expected_grade": "B", "created": "2019-02-28T15:14:59Z"}, {"professor": "Nadine Sahyoun", "course": "NFSC100", "review": "It really doesn't matter what professor you have in this class because you will be taught by all 4 of them. They all do the same thing where they just read off the lecture slides, which are posted online before class. However, it is important to go to class because there are a total of 5 pop quizzes that are extra credit that will boost your grade a lot. This is a pure memorization class, so the exams can be tricky. It almost all multiple choice that's 2 point each, so it's easy to loose points quickly if you don't pay attention to every little detail on the powerpoints. They do posts study guides for the exams, but those only cover a portion of what will be on the exam. To study for exams, its best to do the study guides and memorize the slides by making quizlets. Sometimes nobody gets a 100% on the exams, but the class is not curved, so whatever you get is the real score. There are a good amount of discussion worksheets that will help with your grades and there is a term project at the end of the semester that isn't hard. Overall, I would just make sure you get all the points you can get and find ways to memorize the powerpoints.", "rating": 3, "expected_grade": "A", "created": "2019-12-21T18:15:51Z"}, {"professor": "Margaret Udahogora", "course": "NFSC100", "review": "My Gosh, how I regret paying an additional fee to take this class during the Winter!!!! It is just a slide reading, you must pay $95 for an e-book (which access is valid to July 2022 only), otherwise you cannot answer some quizzes (they are linked). Trying to reach the teacher by email? Well, good luck with that! And once she replies, it is in a very rude manner. I had some concerns throughout the course, and every time I tried to reach her I either had no reply or an unclear answer. It seems she is doing a favor to you. Very disappointing and frustrating. I was so excited, because I do really enjoy the subject (I was even considering nutrition for my major) but after that, I won't pursue it anymore. ", "rating": 1, "expected_grade": "", "created": "2022-01-22T17:13:42Z"}, {"professor": "Margaret Udahogora", "course": "NFSC100", "review": "Well, let's start off with Dr.U... probably the worst teacher I have ever had. First of all, whenever you have questions or concerns, just email your teacher... right? Well, good luck with that! Because with her, you can email her as many times as you want, and she will probably not answer your email. And if by some unexpected miracle she decides to respond to you, she responds in an extremely rude way; and not only that, she simply doesn't answer your questions and concerns!  COMPLETELY UNPROFESSIONAL! Let's talk about the lectures themselves, shall we? She literally doesn't teach you. All she does during the ENTIRE LECTURE is read slides WORD BY WORD. I don't need teachers to do that for me... I think I could handle reading slides by myself, instead of having someone read them for me. She made a course, in which I was excited to learn about and super interested in COMPLETELY BORING. If you ask me right now \"what have you learned throughout the course\", my answer would be NOTHING, even though I tried hard in the course and did everything I could to try to pay attention to her utterly boring and senseless lectures. When taking exams/quizzes, questions were worded completely strangely and made no sense, just like the teacher. We would do assignments in triads( I was lucky to get a good group), and she would take points off for EVERYTHING! We would do our work, add not only what she was asking for, but also extra stuff because everyone in the group was tired of getting points off, and she still would find a way to take off some points because she was unable to give us 100% on assignments. Dr. U is COMPLETELY UNORGANIZED as well. I can't wrap my head around HOW A UNIVERSITY LIKE UMD CAN ALLOW HER TO BE A TEACHER THERE! TERRIBLE TEACHER AND COMPLETELY UNPROFESSIONAL! Made people who already had copies of the book pay $95 dollars to buy another book just to use for a week, including me. I told her I only needed access to the questions she wanted us to answer by reading the book... her answer \" I explained to everyone how to buy the book\". If you have a choice, and still decide to go with her, I don't know know what you are doing...", "rating": 1, "expected_grade": "", "created": "2022-01-23T18:20:35Z"}, {"professor": "Margaret Udahogora", "course": "NFSC100", "review": "I felt like the exams were pretty fair. If you listen closely in lecture, Dr. U tells you what concepts to highlight which helps to know what is certainly going to be on the exams. There is a lot of content, but for a winter class, I felt it was manageable. The extra credit assignments are very helpful. I think the critique here is pretty harsh, I felt Dr. U was a fair professor and cared a lot about the material she taught. If you do the work, you'll be fine as it's a very straightforward course. ", "rating": 5, "expected_grade": "A", "created": "2022-01-24T04:56:58Z"}, {"professor": "Shaik Rahaman", "course": "NFSC100", "review": "Rahaman explains concepts in great detail, is friendly toward students, and is super knowledgeable. However, he can be very difficult to understand in both his delivery and the information he's presenting. His slides often go into detail beyond a 100 class. Thankfully, the exams omit almost everything Rahaman says because it's well beyond the class, but that means his lectures are somewhat boring and pointless - with a few interesting, understandable facts thrown in.", "rating": 3, "expected_grade": "A", "created": "2022-05-12T23:39:40Z"}, {"professor": "David Lei", "course": "NFSC100", "review": "Lei's asynchronous NFSC100 videos are verbatim what you read in the required textbook. The only addition is Lei's voice which is ideal if you need to fall asleep quickly. Between not teaching in-person despite Testudo saying so and creating voice recordings of the textbook readings, Lei is about the most unengaging professor you will take. Silver lining is NFSC100 isn't the most dense course and the videos do highlight what from the textbook will be on each exam.", "rating": 1, "expected_grade": "A", "created": "2022-05-12T23:43:02Z"}, {"professor": "Hee-Jung Song", "course": "NFSC100", "review": "An annoying class. While it is nice not having to go to a lecture, pretty much all the interactions are with the TAs, who are hit or miss. It was also more difficult than I expected, but I'm also not a STEM person. I wouldn't recommend this class, solely because I have not once spoken to any of the professors. And yes, there are like four professors for this class who take turns making lecture videos, some of whom are difficult to understand or are just boring lecturers.", "rating": 2, "expected_grade": "A-", "created": "2022-12-16T01:28:38.646881Z"}, {"professor": "Hee-Jung Song", "course": "NFSC100", "review": "I don't even know what to say for this class to be honest. Don't take my rating as a sign of it being hard or something, cause it's not. It's actually really easy, there's barely any homework and you have one little discussion worksheet that is simple enough to finish with your group by the end of the discussion. Exams are EXACTLY like the review guides, almost word for word. However, I am giving this class a poor rating because of the teaching. There are like a billion professors who teach this course which makes it hard to get used to it since they're all different, they only read directly off of slides, and they ALL have such thick accents that I have no idea what they're saying and eventually stopped showing up to lectures (this is NOT an exaggeration). Attendance is not mandatory and frankly no one really shows up even though it's in a huge lecture hall, but they do have 4 pop quizzes spread out through the semester for extra credit, so yeah they'll help your grade a little bit (not thaat much) and if you don't take them it won't affect your grade at all. There are 3 midterms that are all multiple choice, and one final that is NOT cumulative (thank god). If you must take this class don't worry it's easy as heck, but if you don't have to take it maybe consider taking something more entertaining at least.", "rating": 3, "expected_grade": "A+", "created": "2023-05-09T15:37:04.549262Z"}, {"professor": "Seong-Ho Lee", "course": "NFSC100", "review": "This class has 4 professors teaching the lectures. There are five random pop quizzes that are for extra credit so you go to lecture. Exams are really easy. If you make flash cards for the questions to ponder you will do well.", "rating": 5, "expected_grade": "A", "created": "2023-05-20T15:54:56.384808Z"}, {"professor": "Hee-Jung Song", "course": "NFSC100", "review": "This class is not super challenging. The lectures were pretty straightforward, however if you are not interested, it can get boring. They were taught by multiple professors & one professor was solely asynchronous. The homework is done online through a textbook & it is a completion grade. The exams are okay, I did not study much besides for the final and I averaged a B on each exam. Discussions were easy. Extra credit is awarded three times throughout the semester, and it is a comprehension check at the end of class. These are random.", "rating": 3, "expected_grade": "B+", "created": "2023-08-19T20:32:54.353973Z"}, {"professor": "Hee-Jung Song", "course": "NFSC100", "review": "Great class, awesome prof", "rating": 5, "expected_grade": "A", "created": "2023-09-17T16:32:44.670488Z"}, {"professor": "Hee-Jung Song", "course": "NFSC100", "review": "Dr. Song is really nice and helpful especially during office hours, make sure to keep up with the homework and lecture slides", "rating": 5, "expected_grade": "A+", "created": "2023-09-17T16:38:43.681146Z"}, {"professor": "Nadine Sahyoun", "course": "NFSC100", "review": "Lecturers for this class are all hard to understand. I'd honestly say you can skip lectures and purely go off of the smartbooks. Class is really easy to get filler grades in and exams don't hold too much weight overall.", "rating": 3, "expected_grade": "A", "created": "2023-12-07T18:55:55.477648Z"}, {"professor": "Hee-Jung Song", "course": "NFSC100", "review": "Didn't do as well as I hoped but Dr. Song was great", "rating": 5, "expected_grade": "B+", "created": "2024-02-28T16:16:49.710574Z"}], "department": "NFSC", "course_number": "100", "name": "NFSC100", "title": "Elements of Nutrition", "credits": 3, "description": "Fundamentals of human nutrition. Nutrient requirements related to changing individual and family needs.", "is_recent": true, "geneds": null}