{"average_gpa": 2.9909959072305594, "professors": ["Rachel Singpurwalla", "Kelsey Gipe", "David McElhoes", "Kyley Ewing", "Michael McCourt", "Christopher Masciari", "Rachel Singpurwalla", "Rachel Singpurwalla", "Rachel Singpurwalla"], "reviews": [{"professor": "Rachel Singpurwalla", "course": "PHIL310", "review": "Professor Singpurwalla was amazing. There are very few professors that not only know their stuff, but are actually good at teaching it. She is one of them. She explains the material in such a thorough way that there is no way NOT to understand. She also reviews at the beginning of the next class so if you're not there, you can know what you missed, but if you were there its a nice reminder. If any effort is put into the class, and you know how to write, you will get a good grade. ", "rating": 5, "expected_grade": "A", "created": "2009-02-02T00:14:00Z"}, {"professor": "Michael McCourt", "course": "PHIL310", "review": "Amazing professor. Super welcoming and accommodating and really wants to teach. Extremely fair grading. ", "rating": 5, "expected_grade": "B+", "created": "2019-12-18T02:25:21Z"}, {"professor": "Michael McCourt", "course": "PHIL310", "review": "its great to see somebody so happy to teach what theyre teaching. great prof", "rating": 5, "expected_grade": "B+", "created": "2019-12-18T03:27:44Z"}, {"professor": "Rachel Singpurwalla", "course": "PHIL310", "review": "You SHOULD take PHIL310 with Rachel.\r\n\r\nRachel is the best philosophy teacher I've had and one of the nicest and more understanding professors I've had. \r\n\r\nStructure - Every week you read a text and answer reading questions, write a 300 word discussion post, and respond to a discussion post. There were quizzes after each unit (Socrates/Plato/Aristotle, etc.) which you could find the answers in the slides if you just crt-f. No midterms and the final was just writing a paper that goes more in depth into a topic. The paper could be a podcase/Socratic method paper/or pretty much just anything you want and was really easy. You should be getting an A in this class and you can always asks for an extension if something comes up.\r\n\r\nLectures - The actual content of the class is really interesting and she does a really good job at explaining it. You really end up learning a lot. ", "rating": 5, "expected_grade": "A+", "created": "2022-01-28T19:14:36Z"}, {"professor": "Christopher Masciari", "course": "PHIL310", "review": "Fantastic class. Mr. Masciari is super understanding and is gonna do what he can to help you learn. Fair grader, fair workload, fair expectations, and is just a good guy. You will learn a lot from this class. I recommend going to lectures and discussions as they really help you understand the material and it will elevate your grade if you do so. Some of the concepts can be hard to understand if you try to crunch them all in toward the end of the semester or when big assignments are due.", "rating": 5, "expected_grade": "A", "created": "2022-12-19T00:27:26.365372Z"}, {"professor": "Christopher Masciari", "course": "PHIL310", "review": "Not a great professor. While he's very laid back, which guarantees you at least a B for any decent effort, I was expecting more. He gives bad and lazy feedback, takes forever to post slides, and then randomly gives bad grades on essays/exams with barely any feedback to show for it. He's a nice guy at heart, but I wish he was a bit more professional.", "rating": 3, "expected_grade": "A", "created": "2022-12-22T03:41:37.433631Z"}, {"professor": "Christopher Masciari", "course": "PHIL310", "review": "Good lecturer and laid back. Is a tougher grader but not out of line at all. Weekly quizzes, a term paper, and short answer style midterm/final. I skipped almost every discussion section and a number of lectures and still felt that I had a good understanding of course material (he almost always recaps the previous lectures material at the beginning of class). I think he might be leaving UMD after this semester.", "rating": 4, "expected_grade": "A-", "created": "2022-12-23T06:06:31.207731Z"}], "department": "PHIL", "course_number": "310", "name": "PHIL310", "title": "Ancient Philosophy", "credits": 3, "description": "<b>Prerequisite:</b> Must have completed 6 credits in philosophy or classics.\nA study of the origins and development of philosophy and science in ancient Greece, focusing on the pre-Socratics, Socrates, Plato, and Aristotle.", "is_recent": true, "geneds": null}