{"average_gpa": 3.2283643892339544, "professors": ["Christopher Morris", "Sungwon Woo", "Quinn Harr", "Daniel Blair", "Daniel Blair", "Daniel Blair", "Daniel Blair", "Shen Pan", "Shen Pan", "Daniel Blair", "Daniel Blair", "Daniel Blair"], "reviews": [{"professor": "Daniel Blair", "course": "PHIL203", "review": "Blair is an easy-going and understanding teacher. He answers questions, likes to engage with the students, and is responsive to emails. PHIL 203 is an easy course so long as you attend the discussions. Discussions are where you learn the content more specifically that helps prepare for the midterms. Each discussion had a 2 point quiz which was easy if you pay attention in the discussions. Blair requires you to have the textbook, but 95% of the time, you can not read the required sections and be okay for exams if you attend lectures and discussions.", "rating": 5, "expected_grade": "A-", "created": "2021-12-27T18:17:32Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Funny, engaging, uber-knowledgeable - can't be bored by Professor Blair. He presents relevant topics in an easy to understand style, summarizing key readings and doing something most Professors can't do: making you think, not just answer. Readings are fair in length and comprehensibility, and as long as you read, go to lecture, and study well in advance of the exam, you'll do just fine. Very quiz-heavy grading, but quizzes are short and ace-able, completed in a laid back discussion section environment. Plenty of opportunities to build up your grade throughout the semester, and if you get to know Blair, he's one of the coolest Professors you'll meet at UMD.", "rating": 5, "expected_grade": "A", "created": "2022-05-26T15:48:42Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Dan Blair himself is a good guy but not the best professor. His lectures are all over the class. The slides do no match the readings at all. I passed this class because of the wonderful TA. This is not an easy A type of class.", "rating": 1, "expected_grade": "A", "created": "2022-11-09T19:36:48.394280Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "definitely not an easy A. he is a great guy but all over the place with his lectures. the tests are 5 short essay questions that ask such vague questions. its like a hit or miss whether or not you will do well. The only reason I have an OK grade is because of the TA. But it shouldn't be a hard class. The material I have to say is kind of thought provoking and interesting, he just does not do a goof job at explaining or preparing you for the exam at all", "rating": 2, "expected_grade": "B+", "created": "2022-11-30T18:24:28.825358Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "If you want an i-series/gened that is an easy A, this is NOT the course to take. Two midterms, each worth 20% of your grade, one final worth 30% and 3 point weekly quizzes that overall make up 30% of your grade. If you get one question wrong on the quizzes it impacts your overall grade significantly. The lectures are disorganized and hard to follow, and do not prepare students for the exams well at all. The tests themselves consist of 5 vague questions (which are actually 3 sub-questions each) that you are expected to write 2-3 paragraph answers for, in the course of 50 minutes. Overall, the content of this course is interesting and thought provoking, but I would not recommend taking the class if you're looking for a manageable gened.", "rating": 2, "expected_grade": "B+", "created": "2022-12-16T20:20:20.798906Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "I'm not sure why the other reviews are complaining when he literally tells you the exam questions before hand during the exam review. He's obviously not going to be like \"What is the definition of __?\" part of the point of the class is know what the questions are asking and what ideas he's referring to. Philosophy is not a math class where everything is straightforward. The class itself is not hard if you go to class, but most people just don't. His slides definetly match the readings and his lectures. Take him. He's funny and understanding and his exams are very fair. TAs are incredibly helpful and the weekly quizzes are basically free points. I loved the course and always looked forward to lectures.", "rating": 5, "expected_grade": "A+", "created": "2022-12-20T03:30:54.108230Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "The people are right who say this class is not an easy A, the lecture slides are really disorganized and he takes forever to upload them. However, the content is really interesting and my TA was incredible.", "rating": 3, "expected_grade": "A-", "created": "2022-12-22T03:38:29.118156Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Not an organized professor but if you take the time to study the material and go to discussion you're good. However there are easier classes to take to get an A.", "rating": 3, "expected_grade": "A", "created": "2022-12-24T03:46:36.214260Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "As far as lecturing, he is not very good at being organized. The teaching is sometimes more of a conversation between him and a certain few students and it feels like he rambles all over the place. However, I'll have to disagree with the reviews saying its not an easy A. I didnt attend lecture or any review sessions after around the first month, but I did attend each discussion section since it is basically required for the quizzes. The powerpoints may not be very detailed but they are helpful enough to answer the exam questions, along with the TA's teaching in the discussion section. On top of that, the exams are all taken online on canvas which makes it even easier.\r\n\r\nsome advice: at least show up to each discussion question and try hard for each quiz so that it will serve as a form of review, and also each quiz is worth about 3% of the final grade (there are 10 quizzes about 3 points each), so you dont want to slip on them since an A in this class is a 94% or above.", "rating": 3, "expected_grade": "A", "created": "2022-12-24T03:51:05.519599Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "I really like Professor Blair and this class.  If you ever have to fulfill a gen ed or have extra space in your schedule, I would definitely recommend this course if you're interested in this sort of thing at all (ie. topics of abortion, war, animal rights, etc.).  Exams aren't too difficult and quizzes are a decent percent of your grade, so make sure to do well on them weekly.", "rating": 5, "expected_grade": "A-", "created": "2023-05-06T15:12:32.401013Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Professor Blair is not a good prof to take if you are not a philosophy major. If you love arguing then this is the class for you but if you're taking this as a gen ed don't do it. Prof Blair spends 50 mins of class speaking the whole time without actually saying anything. He is also not at all accommodating,  I sit writing this review in the ADS testing office bc he forgot to open my final exam on elms. He also leaves his diet soda bottles uncapped sitting in a warm classroom while teaching", "rating": 1, "expected_grade": "A-", "created": "2023-05-17T17:06:50.495142Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Blair is a very sweet guy and teaches a fascinating course. His goal is, regardless of your prior views on a given subject, to make you question those beliefs, and he does a pretty good job. The philosophers and their arguments are very thought-provoking. He spends a lot of time sort of getting side-tracked by some of the more outspoken students, but these tangents are, if not productive, generally entertaining. He very generously posts his slideshows, which were very helpful in preparing for the exams - the best thing you can do to prepare is attend the lecture right before a test because he goes over what kinds of questions will be covered in pretty great detail. One important thing to understand is that, as he puts it, you are not supposed to be editorializing your own ideas on the tests. You are \"manifesting competency of the subject.\" Basically, you are proving you know the arguments from the material (he's not terribly concerned with memorizing who said what, just what the arguments are and how to interpret them).\r\n\r\nAs for the class structure, it's 30% quizzes (10 three-point quizzes in the weekly discussion sections, so you do need to attend these to get the quiz prompts), 20% each for two midterms, and 30% for the final. There is no homework, and no graded work in the lectures, which are not mandatory. Exam grading can depend on who gets it; for me, my TA seemed harsher than Blair. Our averages were 85% for the first midterm and 89% for both the second midterm and final. Blair and the TAs note who participates and give a small boost to this group (basically if Blair knows your name or the TAs remember you participating in discussion you'll get this). Besides that, there is no curve, and an A is a 94%. It's not an easy A, but you can get by without going to many lectures, and it was way more interesting than most other gen-eds I've taken.", "rating": 5, "expected_grade": "A", "created": "2023-05-21T01:38:50.803086Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Super intriguing class if you read the readings and like to think about complex issues. Professor Blair is also a really nice guy and steers your thought process in the right direction to provoke interesting thoughts. Unfortunately, the rest of his lectures just aren't good when you consider the class objectives. He rambles and beats around the bush in class in a way which makes it extremely hard to understand what the main points hes trying to make about certain arguments are. He never once clearly stated the premises and conclusion of an argument. This made the class extremely hard as basically your entire grade is based off of being able to regurgitate these arguments from different philosophers. Also a very harsh grader considering he doesn't make what you need to know in the class clear. It's like he wants you to play hide in seek in the lecture notes (which he posts in an unorganized manner) to find the right answers to potential exam questions. Also he did not monitor TA grading at all. TA grading was very inconsistent. Overall, interesting class, but at the end of the day the fundamentals of the class are lacking when considering how they allow you reach class objectives of learning/knowledge.", "rating": 1, "expected_grade": "A-", "created": "2023-05-24T03:09:05.121753Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "The lectures are pretty pointless, and he does tend to ramble on tangents for a while. It makes discerning the main point behind different readings extremely difficult.\r\n\r\nThat being said, the intention of the class is that you do the readings yourself outside of class. This adds a TON of work to the curriculum, but will allow you to get a better feel for course content. Just would have been a lot better of a class if he actually went over the main points in lectures. \r\n\r\nAlso discussion sections were incredibly pointless. Probably was just my TA, but he went over literally nothing even remotely related to what we were learning.", "rating": 3, "expected_grade": "A", "created": "2023-12-22T16:25:38.415225Z"}], "department": "PHIL", "course_number": "203", "name": "PHIL203", "title": "The Rights and Wrongs of Killing People", "credits": 3, "description": "<b>Credit only granted for:</b> PHIL209J or PHIL203.\n<b>Formerly:</b> PHIL209J.\nVirtually everyone thinks it's permissible to kill people only in special circumstances. But why is killing usually wrong? Is it ever acceptable to kill an innocent human being intentionally? This course raises these and related questions and examines cases such as terrorism, suicide, abortion, euthanasia, the death penalty, war. Except for a brief discussion of animals, all the controversies considered deal with killing and causing death to human beings.", "is_recent": true, "geneds": null}