{"average_gpa": 3.6032418952618452, "professors": ["Kristin Cipriani", "Eric Boyle", "Blair Coleman", "Gretchen De Silva", "Alyssa Brooks", "Sharon Barrett", "Chandria Jones", "Shaun Edmonds", "Elizabeth Bell", "Ellesse-Roselee Akre", "Kendall Bustad", "Hillary Kelbick", "Nancy Smith", "Samuel Clevenger", "John Calhoun", "Allison Hanley", "Kevin Glasz", "Jennifer Hodgson", "Liz Bell", "Dana Reiss", "Carmen Booker", "Christopher Howard", "Laura Drew", "Maria Amador", "Ebony Toussaint", "Adam Binkley", "Adam Binkley", "April Mccoy", "Ashley Pantaleao", "Aysha Jawed", "Carmen Booker", "Daniel Marthey", "Elizabeth Bell", "Kendall Bustad", "Kevin Glasz", "Paul Levy", "Stephen Roth", "Adam Binkley", "Aysha Jawed", "Kendall Bustad", "Kevin Glasz", "Lakeshia Watson", "Lakeshia Watson", "Ann Truelove", "Aysha Jawed", "Carmen Booker", "Eric Silfen", "Jenna Burnett", "Kendall Bustad", "Kevin Glasz", "Lakeshia Watson", "Maushami DeSoto", "Paul Levy", "Lakeshia Watson", "Ann Truelove", "Aysha Jawed", "Jennifer German", "Kevin Glasz", "Lakeshia Watson", "Ann Truelove", "Aysha Jawed", "Carmen Booker", "Catherine Sapp", "Darya Soltani", "Eric Silfen", "Jennifer German", "Kendall Bustad", "Kevin Glasz", "Lakeshia Watson", "Ann Truelove", "Jennifer German", "Kendall Bustad"], "reviews": [{"professor": "Adam Binkley", "course": "PHSC497", "review": "He is one of the best capstone professors out there. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-30T21:39:13Z"}, {"professor": "Kendall Bustad", "course": "PHSC497", "review": "I have several friends taking PHSC497, and the course grades are entirely inconsistent. My friend in a different teacher's section said that the average grades on their assignments tends to be around 85-90 percent, in our class the average grades on assignments is like a 70 percent. Professor Bustad is an impossible grader, and her standards are impossible to keep up with. This may be the worst professor to take for this class. This shouldn't be tanking student's GPAs right before they graduate....", "rating": 1, "expected_grade": "B-", "created": "2022-10-26T18:28:49.531508Z"}, {"professor": "Paul Levy", "course": "PHSC497", "review": "If you have Paul for your capstone, you'll be fine and get through the course, but it will be a frustrating class. He's a nice guy but disorganized and not good at communicating. Our syllabus wasn't published until the second week of class, and it became immediately inaccurate because he ignored assignments on the syllabus and added new ones with no notice. \r\nHe splits up the capstone paper into 4 benchmarks, but he will not give the due dates until a few weeks before. Do not ask for an extension because he will not grant one. He does not use rubrics for his class, so he takes off points, and you have to email him and ask why. Speaking of email, he is AWFUL at responding. Do not expect a response for at least 3 days if not a week.\r\nThe class is online which gives a lot of flexibility, and we have never gone the full 2.5 hours which is really nice. He also does not give filler assignments or busywork aside from a few quick and easy assignments in the first few weeks. \r\n\r\nAgain, he's not completely awful, and I don't think he intends to be difficult, but he has a separate 9-5 job, and you can tell that job is his priority, not this class.", "rating": 2, "expected_grade": "A", "created": "2023-04-03T20:34:28.987647Z"}, {"professor": "Maushami DeSoto", "course": "PHSC497", "review": "AVOID AT ALL COSTS. She is the worst teacher in the school of public health I have ever had. She favors students in the class, treats all of us like 5-year-old children, grades all assignments very harshly, is extremely unorganized (the rubrics for assignments do not correlate with the actual assignment and she never answers emails), and takes forever to grade assignments. I am a straight-A student and getting a B+ in her class due to her lack of professionalism and teaching ability sucks.", "rating": 1, "expected_grade": "B+", "created": "2023-05-01T21:43:23.008468Z"}, {"professor": "Lakeshia Watson", "course": "PHSC497", "review": "Dr. Watson is a great professor for PHSC497, the course is pretty straightforward. She’s very sweet and understanding, and will help you with any questions you might have throughout the capstone paper. She also had some classes over zoom due to her schedule conflicts and our presentations were given over zoom as well. I can’t speak for how the other professors are for PHSC497, but I would highly recommend Dr. Watson!", "rating": 5, "expected_grade": "A+", "created": "2023-05-04T16:10:05.681713Z"}], "department": "PHSC", "course_number": "497", "name": "PHSC497", "title": "Public Health Science Capstone", "credits": 3, "description": "<b>Prerequisite:</b> Must have completed the professional writing requirement with a C- or higher; and minimum grade of C- in MIEH400.\n<b>Restriction:</b> Must have earned a minimum of 100 credits; and must be in Public Health Science program; and must be in the final semester of undergraduate study.\n<b>Credit only granted for:</b> SPHL498F or PHSC497.\n<b>Formerly:</b> SPHL498F.\nThe capstone course is the culminating experience for Public Health Science students and must be taken only in the final semester of study. The Public Health Science capstone course is designed to challenge students to integrate the five core areas of public health in investigating, researching and addressing public health issues. Throughout the semester, students will be required to evaluate, analyze and synthesize scholarly works as they research and propose solutions to a variety of public health issues. By the conclusion of this research based course, students will understand how the various public health perspectives can combine in addressing and informing public health practices.", "is_recent": true, "geneds": null}