{"average_gpa": 3.56017094017094, "professors": ["Suresh Tonwar", "David Buehrle", "Marguerite Tonjes", "Shabnam Jabeen", "Theodore L Einstein", "Jennifer Radoff", "Paul Hutchison", "Eric Kuo", "Matthew Bobrowsky", "Kerstin Nordstrom", "Vashti Sawtelle", "Oscar Greenberg", "Prabal Adhikari", "Arpita Upadhyaya", "Hannah Sabo", "Linda Hembeck", "Peter Shawhan", "Laura Lising", "Shabnam Jabeen", "Arpita Upadhyaya", "Laura Lising", "Arpita Upadhyaya", "Laura Lising"], "reviews": [{"professor": "Laura Lising", "course": "PHYS115", "review": "An amazing professor who made the class seem very relevant and made sure you were actually learning the material. ", "rating": 5, "expected_grade": "A", "created": "2021-12-08T21:28:28Z"}, {"professor": "Laura Lising", "course": "PHYS115", "review": "She’s a great teacher. I loved her teaching style. She thoroughly explains things and makes sure you can understand the material while also giving you insight on the teaching side of it.", "rating": 5, "expected_grade": "A+", "created": "2021-12-18T02:56:41Z"}, {"professor": "Laura Lising", "course": "PHYS115", "review": "I love Prof Lising!  She is a really great teacher and makes sure that all of her students understand what is being taught!  She really likes to have fun with the class and is always circling the room helping people out with their work!  Exams were open note and notes were based off of these packets she gave us.  Everything was straightforward and she was great!  i highly recommend Professor Lising!  This class is only available in the fall so make sure you plan around that!", "rating": 5, "expected_grade": "A", "created": "2022-04-14T19:59:14Z"}, {"professor": "Laura Lising", "course": "PHYS115", "review": "Laura Lising is a great professor! The other reviews are pretty accurate- she really cares about her students and will go above and beyond to help (as long as you ask, of course). The only (very small) drawback to this class is that it is 2 hours long so sometimes it drags on. Also, her exams are open note and she will do her best to help you if you need clarification on a question. And if you have accommodations, she is flexible and understanding!", "rating": 5, "expected_grade": "A-", "created": "2022-10-07T20:11:53.572075Z"}, {"professor": "Laura Lising", "course": "PHYS115", "review": "Professor Lising was a good teacher for this particular course. She spends lots of time going over each lesson and walks around to make sure everyone understands the lesson. I did think that sometimes her teaching methods were a little confusing, because she would be very hypothetical and would make us do a lot of work before actually explaining the concept. Class was 2 hours long so boring at times but overall not difficult, especially since exams were open note.", "rating": 3, "expected_grade": "A", "created": "2022-12-21T03:05:04.633773Z"}, {"professor": "Arpita Upadhyaya", "course": "PHYS115", "review": "PHYS115 was one of my required classes. At first, I was weary about taking this class, but it's not that bad or difficult. There is homework (basically lab reports) due after each class, three exams, and a final presentation, and your lab notebook gets graded. Professor Upadhyaya is a good professor, and she does want each of her students to succeed. That being said she is a bit unorganized, and demeaning at times. We didn't have a TA for half of the year, so the grading was VERY slow, and she would question you if you were confused. Overall this class and professor were not bad at all, and don't hesitate to take the class if you need to.", "rating": 4, "expected_grade": "A", "created": "2023-12-20T16:32:51.476604Z"}, {"professor": "Laura Lising", "course": "PHYS115", "review": "When I told people I was taking physics, they all thought I was crazy however I'm glad I did. This class is not super difficult because you know more than you think, and Professor Lising pulls out your own knowledge. In class there is a lot of partner activities with your lab partner. The experiments are not all boring, matter of fact one of the things we did in class was make ice cream with heavy cream, sugar, and liquid nitrogen. We also attempted to light a lightbulb with pickles. Professor Lising is so helpful if you need help. She will stay after class or come early to go over with you what you are confused about. She is also very good with on the spot questions. The best thing Professor Lising did was allow us to resubmit our final for a higher grade and that made all the difference for me. If you're an education major and looking for a physical lab science PHYS115 is a great option ONLY WITH Professor Lising!!!", "rating": 5, "expected_grade": "A-", "created": "2024-01-10T00:45:00.302368Z"}, {"professor": "Arpita Upadhyaya", "course": "PHYS115", "review": "Pros: reasonable expectations, easy-ish workload, open-notebook exams, pretty lenient grading\r\nCons: sometimes disorganized and messy teaching style, not always patient\r\nOther notes: in every class you do a lab with your partner and submit a lab report (sometimes finished in class, sometimes not)", "rating": 4, "expected_grade": "A", "created": "2024-01-25T16:31:02.925153Z"}], "department": "PHYS", "course_number": "115", "name": "PHYS115", "title": "Inquiry into Physics", "credits": 4, "description": "<b>Recommended:</b> High School Physics.\n<b>Restriction:</b> Must not have completed PHYS117; and must be in one of the following programs (Elementary Education; Early Childhood Education; Middle School Education).\n<b>Credit only granted for:</b> PHYS115 or PHYS117.\nIntended for students majoring in neither the physical nor the biological sciences. Use of laboratory-based and inquiry-based methods to study some of the basic ideas of physical sciences.", "is_recent": true, "geneds": null}