{"average_gpa": 2.7775052374301676, "professors": ["Michelle Girvan", "Theodore Kirkpatrick", "Sergio Picozzi", "Daniel Lathrop", "Frederick Wellstood", "Hailu Gebremariam", "Theodore L Einstein", "Rabindra Mohapatra", "Eun-Suk Seo", "Andrew Smith", "Maissam Barkeshli", "Kara Hoffman", "James Lavine", "Sharon Roosevelt", "Daniel Hertz", "Gary Pennington", "Michael Rapport", "Richard Ellis", "Arthur La Porta", "David Buehrle", "Howard Milchberg", "Raymond Fermo", "Lance Boyer", "Matthew Severson", "Vladimir Manucharyan", "Matt Severson", "Andris Skuja", "Wendell Hill", "Andris Skuja", "Rabindra Mohapatra", "Erin Sohr", "Shabnam Jabeen", "Andris Skuja", "Erin Sohr", "Hailu Gebremariam", "Rabindra Mohapatra", "Shabnam Jabeen", "David Buehrle", "Andris Skuja", "David Buehrle", "David Buehrle", "Hailu Gebremariam", "James Drake", "David Buehrle", "Rajarshi Roy", "Hailu Gebremariam", "Howard Milchberg", "James Drake"], "reviews": [{"professor": "Theodore L Einstein", "course": "PHYS260", "review": "I don't pay attention in class much and I generally get by with discussion and with the textbook. I also had friends in the class to study with. \n\r\nI had to go to his lectures because he does clicker-like attendance. I'm mostly giving him a bad review because I didn't like that policy. ", "rating": 2, "expected_grade": "A-", "created": "2015-12-07T21:33:00Z"}, {"professor": "Theodore L Einstein", "course": "PHYS260", "review": "He's nice and tells bad jokes but even our TA admitted he was a horrible lecturer. He mumbles and his handwriting is illegible so he's definitely not ideal for a lecture class with 200+ people.", "rating": 2, "expected_grade": "", "created": "2015-05-19T21:24:00Z"}, {"professor": "Xiangdong Ji", "course": "PHYS260", "review": "Probably the best professor I had of the three physics classes I had to take.  His exams were fair and a generous curve was given on each one.  He taught the material clearly and tried to do so without boring anyone.  ", "rating": 4, "expected_grade": "A", "created": "2009-01-14T04:37:00Z"}, {"professor": "Xiangdong Ji", "course": "PHYS260", "review": "i liked him a lot, he was a good prof and tried to make the class somewhat enjoyable, which was nice cuz i hate sitting through long boring classes.", "rating": 4, "expected_grade": "", "created": "2008-11-19T14:46:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS260", "review": "Very bad lecturer and professor in general. Spends the first 20 minutes of every lecture giving a terrible recap of all of the information from the previous 5 lectures and gets absolutely nowhere. Handwriting is atrocious and is hard to read even at the front of the room. Hard to understand in a large lecture as well. He does nothing but derivations which are nearly impossible to follow and his examples are equally if not more hard to follow because he literally makes them up as he goes. By the far the worst professor I have had thus far and do not recommend at all. Theodore, your grading system is awful as well. There's no way to tell if you are passing until the end of the semester when it's too late to fix anything ", "rating": 1, "expected_grade": "", "created": "2016-10-05T17:03:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS260", "review": "Dr. Kirkpatrick is overall a good professor and very reasonable. Yes he derives many equations using sometimes complex math but he is very willing to explain anything over and over until you get it. Also, this is physics so expect derivation in with any of the other professors. \n\r\nExams are not very difficult, do not be afraid. If you study lecture notes a little each day(go to TA or his office hours if you don't know a concept) and actually GO TO CLASS (which many people didn't after a while being a night class) you will be fine. He drops lowest test and gives a curve. 80's were around an A- to A. \n\r\nOverall, do not try to avoid, he is perfectly fine professor if you put a little work into the course.\n\r\nSide note: if you want to get the highest grades in the class then type in any subject gone over in class such as \"Capacitors\" into google with MIT lecture notes and then review those notes, you will get one of the highest grades. ex. \"capacitors MIT lecture notes\" good luck", "rating": 4, "expected_grade": "A", "created": "2014-01-06T00:05:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS260", "review": "He is not as completely awful as the other reviews make him seem. His homework is not on mastering physics which makes it easier. He tells you most of the questions that will be on the tests and lets you have a notecard...hence you can write down the problems. He also is a nice guy in office hours. Overall he is not terrible.", "rating": 2, "expected_grade": "B+", "created": "2012-12-21T12:28:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS260", "review": "He teaches a lot of senseless differential equations and proofs. He is boring, but he knows what he is teaching and is fair.\n\r\nHis tests are easy due to the fact that he tells us what is going to be on the test and we can use a note card. Most people cramp everything in the note card and get a decent grade on the exams. The quizzes in discussion were pretty hard at first, but then they just got to the point when it was easy math and plugging into equations.\n\r\nI believe he is blind from one eye, so if you sit on the left side of the lecture hall he will not see you. (I'm guessing his right eye is blind)\n\r\nHis experiments in class are really fun and you will probably learn a lot from them.", "rating": 3, "expected_grade": "C", "created": "2011-01-26T15:34:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS260", "review": "Dr. Kirkpatrick may use some complicated math in 260 lecture that a quarter of the class will know what it is, but he never requires any of it on the exams. The homeworks and quizzes aren't too bad, provided you study, and there are no pop quizzes so no surprises. He's incredibly knowledgeable and a nice guy. When people asked questions in class he was always willing and able to re-explain himself in order to help the students understand. All in all, he's a good professor; not great, but by no stretch terrible!", "rating": 5, "expected_grade": "C", "created": "2010-12-10T21:16:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS260", "review": "He was a pretty bad teacher, and I usually left his lectures a little more confused than when I entered, but the class wasn't so bad.  His tests didn't really cover any material you can't get out of the textbooks, and he pretty much gave away 1 or 2 questions on each test.  I just studied from the textbook all semester and got an A.", "rating": 3, "expected_grade": "A", "created": "2009-12-18T02:24:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS260", "review": "I didnt think he was nearly as bad as the other reviews made him seem.  For starters, the class before a test, he basically tells you half the questions that will be on the test, so no excuse there.  While he talks about diff eq, i never needed it.  He asked for a proof here or there, but thats only because to prove it, you had use one of the concepts/equations in the chapter, so its fair game at that point. i never had to prove any of the fundamental equations in the chapters.  oh, and he drops a test grade.  ", "rating": 3, "expected_grade": "A", "created": "2009-12-08T00:40:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS260", "review": "HORRIBLE! taught with a lot of random proofs that are hard to follow since he used Diff Eqs extensively even though they were not required for the course. \n\r\nMassive curve at the end however. I flat out bombed the second test and final and still managed a B. Take anyone else.", "rating": 1, "expected_grade": "B", "created": "2009-09-12T16:54:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS260", "review": "He's a horrible professor who lies to screw you over. Each lecture was 75 minutes of him writing cryptic proofs on the board that nobody understood because it contained a crap load of differential equations, which isn't even a prereq for the class. Like the other person said, he told us that we didn't need to understand the proofs just the general concepts, but the first question on the first exam asked for a series of proofs on oscillation. He also purposely designed the tests to be difficult so the class averages could be low. The test averages were in the 50s to low 60s. The book doesn't help either because his test problems aren't even like the book problems, even though he told us the test would have book-type problems. I don't know how I managed to pull off a B+ in the class but I wouldn't be surprised if I got a C because he purposely wanted people to do badly. Try to avoid him if you can. ", "rating": 1, "expected_grade": "B+", "created": "2009-04-16T12:27:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS260", "review": "Agree wholeheartedly with person below me. terrible, terrible teacher. did a bunch of proofs involving god knows what, put one on the test and at least half the class got an F (not exaggerating). has the most ridiculous grading policy. purposely and knowingly makes his tests aggravatingly difficult (avg~60) and then expects to curve it to make it better. dont believe it. i got above the average on 2/3 tests, and he drops one; i did every homework/quiz and got an A in the lab class which is folded into your lecture grade. i ended up getting a C!!! biggest load of BS. and b/c of stupid phys dept policy, that means i got a c in the lab too. do not take him. i dont know who else you can take, b/c they all pretty much suck. oh and he's never in his office hours. the only plus is he doesnt use masteringphysics.", "rating": 1, "expected_grade": "C", "created": "2009-04-14T02:10:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS260", "review": "The other two reviews for this class were right on point.  He put a proof on oscillators on the first exam which no one could do being that differential eqns is not a prerequisite.  I too got way above the average on 2/3 exams (like 70-80) and an A on the lab and still managed to pull a C.  Definetly dont take him but between him and hill kirkp is the better choice.  TRUST ME.  Other than hill take any other professor over kirkp", "rating": 2, "expected_grade": "B", "created": "2009-04-12T00:22:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS260", "review": "Don't take his class!! Seriously, this class was such a bad experience. Kirkp spent most of the time doing weird proofs with differential equations that no one really followed. When asked if they were important he said that the class didn't need to know them...this turned out to be a complete lie because the first question of the first test was a paragraph asking for proofs using differential equations (which isn't even a prerequisite for this course). He read everything straight off of these yellow note sheets that he carried around and, when asked questions about what he was writing, occasionally would squint at them and then respond with an indifferent \"I don't know.\" Learning out of the book isn't even an option because his test questions usually involve proofs that he does in class.", "rating": 1, "expected_grade": "", "created": "2008-12-09T19:34:00Z"}, {"professor": "Frederick Wellstood", "course": "PHYS260", "review": "Wellstood might be the best lecturer I've had in college so far, but the problem is that he seems to cover significantly less in lecture than the other professors do. Everybody in our sections thought the combined final was impossible, but the others thought it was easy.", "rating": 4, "expected_grade": "A", "created": "2011-12-24T20:11:00Z"}, {"professor": "Frederick Wellstood", "course": "PHYS260", "review": "The best part of Wellstood's class is that it is taught by a reasonable physics professor- meaning that his expectations of busy engineering students are fair. He prepares the class well for all three exams. The final was hard, but he gave us fair warning and offered a review session.", "rating": 5, "expected_grade": "A", "created": "2011-05-25T19:26:00Z"}, {"professor": "Frederick Wellstood", "course": "PHYS260", "review": "By far one of the best professors in thy physics department...he goes the extra mile to ensure that his students understand the important concepts of physics.  Dr. Wellstood also includes in-class experiments to supplement the material; all were very interesting, especially once the electromagnetism units were covered.  This is not an easy class, but Dr. Wellstood is definitely one of the greatest professors I have had thusfar", "rating": 5, "expected_grade": "B+", "created": "2011-01-03T01:17:00Z"}, {"professor": "Frederick Wellstood", "course": "PHYS260", "review": "one of the best physics professors in the school. explains concepts clearly and has very straightforward exams. he's willing to spend as much time with you during office hours as you need and puts your needs first. if you go to lecture, quizzes are easy since he gives the answers right after he asks the questions. if your not happy with your exam, he always gives makeups. pretty much, he gives you every opportunity in the world to do well.", "rating": 5, "expected_grade": "A", "created": "2010-05-22T15:17:00Z"}, {"professor": "Frederick Wellstood", "course": "PHYS260", "review": "Professor Wellstood is an absolutely awesome physics teacher. Every lecture, he presents information in a clear, organized, and thorough fashion, taking the time to explain why things are how they are, and how they are useful to you. He is very approachable and understanding, and he actually responds to e-mails, even when they're about really stupid things. Tests are challenging, but definitely fair, and there is a review session for each one. There are also sample exams which may not be entirely representative as to the difficulty of the actual test, but are great practice. There were even make-ups for the first two midterms. Homework is a huge portion of the grade, so it's important to start it early to make sure you don't get stuck when it's too late to ask questions. There's also some material on the masteringphysics assignments that isn't covered in class because it's not important enough to be on a test.\r\nTrust me, if you take Wellstood and go to every single lecture, you will really learn the material, and even get to watch some pretty sweet demos.", "rating": 5, "expected_grade": "A", "created": "2010-05-21T11:28:00Z"}, {"professor": "Frederick Wellstood", "course": "PHYS260", "review": "The professor explained the concepts well and engaged the class even though I don't particularly like physics. His examples are quite useful in understanding the material. His tests are fair in that he tests main concepts and not strange obscure problems. In fact I took him for both phys161 and phys26o because he is much better than the other physics professors. His tests reviews are extremely helpful.", "rating": 5, "expected_grade": "", "created": "2010-04-27T22:11:00Z"}, {"professor": "Frederick Wellstood", "course": "PHYS260", "review": "Dr. Wellstood is an amazing professor. He's the best physics professor I've had, not only does he know the material, he is capable of getting the important points across to his students (which is no mean feat for science and math classes). \n\r\nHe really cares for his students and does everything possible to help us. Go to his office hours and he's very willing to give you his time to explain the things that you might not understand. His syllabus is set in a way to give you the best chance of getting an A in his class he puts a lot of weight in the homework and attendance.  \n\r\nHis exams are challenging and many people have a difficult time getting the hang of them. But go to lecture, do your home work, and go to review. He has a habit of putting things on there are test whether or not you understand the material and are able to apply it, not if you can redo problems that you've seen. So it really depends on how much effort you are willing to put in to actually learning the material. \n\r\nBasically, take him if you want a little challenge and want to LEARN the material. ", "rating": 5, "expected_grade": "", "created": "2009-05-15T17:54:00Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "The most horrible teacher you will ever have. Just HORRRRRIBBBLLLE. Never take him, he should be fired from teaching.", "rating": 1, "expected_grade": "C", "created": "2009-05-05T18:05:00Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "I have found professors in the physics department to be some of the worst professors I've had and Professor Hill was no exception.  He taught the basic concepts in lecture, but then the tests were impossible proofs that could not be finished in the time given.  There was a lot of homework every week (masteringphysics) and it didn't really help on the tests at all.  There were also quizzes every week in discussion.  If at all possible, avoid Hill.", "rating": 1, "expected_grade": "C", "created": "2009-04-20T01:16:00Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "Professor Hill did not treat students with respect and should not be teaching.  His teaching style is abysmal.  He refused to use a microphone although the class was in the large physics lecture hall.  He repeatedly yelled at students to leave his class and would never start on time.  After forcing students to buy clickers at the beginning of the semester, he stopped using them after 2 weeks of class. (I wanted my 50 dollars back, but the bookstore would not do a refund, sounds like a scam to me.)  His powerpoint presentations were the bare concepts of physics 2 without any real explanation or examples.  His exams, of course, were completely opposite, with detailed problems that were impossible to finish in the time of the exam.  He even stated that our first exam was not possible to finish in the time he gave us, I guess thats why the average was a 40 and the high was an 85%.  He barely did any example problems in class and gave us roughly 10 hours of homework a week, which was only 15% of our grade.  ", "rating": 1, "expected_grade": "A", "created": "2008-12-13T18:50:00Z"}, {"professor": "Rabindra Mohapatra", "course": "PHYS260", "review": "He was the sweetest man. I always went to his office hours because he would spend time with me, explain things to the best of his ability and truly care if i learned the material. Now I was not very good at physics but he def curved fairly and somehow had me pass", "rating": 4, "expected_grade": "C-", "created": "2018-10-06T03:44:49Z"}, {"professor": "Michelle Girvan", "course": "PHYS260", "review": "She's kind of hard to follow when doing examples since her writing is kind of small and disorganized. She also hands out pretty hard exams. That said, she's pretty nice and cares for her students. ", "rating": 3, "expected_grade": "B", "created": "2018-12-21T03:07:16Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "The course material was not difficult, but the lectures sometimes were pretty hard to get through because they were pretty dry and his tests were quite a bit more difficult than the homework. He does curve though in his class, which helped quite a bit.", "rating": 3, "expected_grade": "A", "created": "2019-05-24T16:58:51Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "By far one of the worst professors at UMD. He teaches via PowerPoints and uses the simplest examples in class, and then when the exam time comes nothing is the same. The exams are much more difficult than anything offered in this course, although you can expect a 10%+ curve at the end of the semester. nevertheless, I would not suggest you take him unless you have to!", "rating": 1, "expected_grade": "B", "created": "2019-05-24T20:34:12Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "Hailu is a fantastic professor and I definitely recommend taking his class. He is very careful in explaining complex topics accurately and makes few mistakes in lectures. His exams were incredibly easy (except for the final, which was not as much difficult as it was time-consuming). If you pay attention in lecture and try to understand the content, you should have no problems.", "rating": 5, "expected_grade": "A+", "created": "2019-06-09T03:31:03Z"}, {"professor": "Rabindra Mohapatra", "course": "PHYS260", "review": "Really bad lectures. Very nice guy but seems out of touch. Tell you something that will be on a test and the test will have something completely different.", "rating": 2, "expected_grade": "B-", "created": "2020-05-22T20:01:47Z"}, {"professor": "Andris Skuja", "course": "PHYS260", "review": "Avoid at all costs! Lectures were absolutely useless but you still had to go to them every week because he gave us two quizzes every single week. We had two lectures and one discussion per week and in two of those we had a quiz. We didn’t have time to learn anything new before being quizzed and getting the same things wrong again and again. ", "rating": 1, "expected_grade": "", "created": "2020-09-05T04:01:48Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "I had Hailu for 161 and i loved him, however this year for 260 his setup is a little different due to covid and Im struggling a bit. Hes a very understanding prof and is so helpful if you have questions but the lecture videos are sooooooo boring i can barely get through them. ", "rating": 4, "expected_grade": "B", "created": "2020-11-05T18:43:51Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "Dr. G is a very fair professor. His lectures are monotoned and slow, but his lecture videos are simple and easy to follow. The homework goes well with the lecture content but may get stuck on a few which is normal. Dr. G's quizzes are very fair and relate to the previous lecture content as well. He provides the equations and contents needed, so as long as you complete the homework (or most of it) before the quizzes, and are caught up on the lectures you are in good shape.\r\n\r\nExams are fair, but studying with book problems does help. Book problems are more challenging than exam problems but are a good tool for understanding the content more. ", "rating": 4, "expected_grade": "B+", "created": "2020-12-30T01:20:23Z"}, {"professor": "Rabindra Mohapatra", "course": "PHYS260", "review": "Mohapatra is a really sweet old man, and I'm sure he would've been a great lecturer had we been in-person. Unfortunately, he's simply not a very effective teacher online, and teaches off PowerPoints with the most atrocious formatting you've ever seen. He attempts to show solutions to example problems but it just isn't the same effect as seeing one being solved handwritten. Gives quizzes and exams that I would say were mostly fair.", "rating": 4, "expected_grade": "A+", "created": "2021-01-13T07:24:32Z"}, {"professor": "Rabindra Mohapatra", "course": "PHYS260", "review": "His lectures didn't cover everything in the textbook, but I think they were easy to follow. He tried to make sure every person understood each concept, and seemed excited to teach and enjoyed talking to students. His quizzes were fair and he usually would give hints as to what questions and topics were on them, and they were usually similar to the example problems he showed during lectures.", "rating": 4, "expected_grade": "B", "created": "2021-01-20T00:33:58Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "Hailu is absolutely awful. His lecture videos are mind-numbingly boring and his ego is off the roof. Don't bother emailing him unless you want a snarky response that makes you feel stupid. His final exams are also incredibly hard, leaving everyone to wait anxiously for the curve to save their final grade. Save yourself and find a different prof", "rating": 1, "expected_grade": "", "created": "2021-01-25T18:35:37Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "He is very nice and the class is straightforward. Exams and quizzes were fair. Lectures were monotone and mostly examples, just makes sure you actually pay attention.", "rating": 5, "expected_grade": "", "created": "2021-05-21T17:19:00Z"}, {"professor": "Andris Skuja", "course": "PHYS260", "review": "Yup. Most of the reviews you're reading are 100% accurate. His lectures are done through PowerPoint and formatted horribly so you learn nothing. He talks super slow and becomes out of breath within 2 slides. There's literally no point going to lecture except for the quiz every Wednesday. Just read the textbook, watch Organic Chemistry tutors Physics playlist, and do all the end of chapter textbook questions. His quizzes are hit or miss, sometimes they're really easy, sometimes not so much. He drops 2 quizzes and 1 homework as well as an exam.\r\nHis exams are usually based on the end-of-chapter textbook problem so if you do those problems you're probably going to get a 100 on his exam. (Yes he's that lazy, also he falls asleep while proctoring exams...) The homework is on expertTA also. The final exam wasn't too bad especially since it was standardized across the whole physics department therefore more competent professors were able to put questions on the final that made some sense. We got a 10% curve. Expect anywhere between 10-20%.", "rating": 1, "expected_grade": "A", "created": "2021-06-24T20:39:26Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "Hailu is decent, pretty boring, but decent. He goes very slowly through the material, so we wound up around two weeks behind the syllabus by the end of the semester. The slides are usually easy to follow, but he'll occasionally go off onto a separate screen and start deriving an equation or something, which we often don't need to know. He spends a lot of time going through example problems in lecture, which is somewhat helpful but wastes time since he goes so slow.\r\nThere are weekly homeworks on Expert TA with 10 or so problems, usually a couple of which are quite hard. He doesn't take off points for incorrect attempts though, which is great. There are also weekly quizzes in discussion which are really easy, save for a couple hard ones, but you'll always get the equations and constants you need. Discussions themselves aren't that helpful, the TA will just go through a bunch of problems from the textbook and that's it. Most people just left after the quiz was over.\r\nThere were only two midterms which were not bad at all, and you get to make your own formula sheet for them. The averages were in the high 70s/low 80s. With the homeworks, quizzes, and midterms all being pretty manageable, you could build up a strong grade buffer for the final exam. The final was slightly more challenging than the midterms, but still doable. There were 6 questions, but we only had to do 5 of them, so you could just skip whichever one looked the hardest. All 260 professors use the same final, which made me quite worried since Hailu was pretty far behind schedule, but there wasn't anything on there that he didn't cover. \r\nOverall, Hailu is fine and he makes 260 straightforward, but he's just a bit dull.", "rating": 4, "expected_grade": "A", "created": "2021-12-18T19:21:19Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "most boring prof ever. Spends half of class deriving a single equation no one cares about just to show us what the equation is right after. Gives no practice to study for midterms or finals and final was based on nothing we ever learned.", "rating": 1, "expected_grade": "", "created": "2021-12-24T23:44:19Z"}, {"professor": "Erin Sohr", "course": "PHYS260", "review": "Great teacher especially for physics. I struggled through physics 1 but am doing fairly well in her class (probably getting around an a depending on the final exam and curve) with honestly not too much effort. She’s super nice, great at giving help for homework and preps well for exams. She usually says what’s on the exams sometimes down to the exact problems you’ll see, doesn’t give as hard problems as there can be for this class and will review with similar problems, if they’ve not already been seen on homework or quizzes. First few weeks were a bit rough as she adjusted to teaching but she’s since gotten more organized and become receptive to what the class needs such as going over homework or doing problems rather than strictly lecturing. In the end, I actually feel I understand Physics to a certain extent and found it easy to learn from her and do well in the class, despite originally absolutely dreading having to take physics and expecting to fail. ", "rating": 5, "expected_grade": "", "created": "2022-04-27T18:27:13Z"}, {"professor": "Erin Sohr", "course": "PHYS260", "review": "She is a new professor, and definitely shows signs of it. Some of her lectures are definitely unorganized and she had to rely on the TAs sometimes to get the information across. However, in the end, we got it and I can see she is getting the hang of it. She moved deadlines all the time when we asked her too. She will go over things repeatedly, and make it clear what is on the exams and what's not. Definitely a good option for this class.", "rating": 3, "expected_grade": "A-", "created": "2022-05-06T02:47:58Z"}, {"professor": "Shabnam Jabeen", "course": "PHYS260", "review": "Prof Jabeen is not very good at lecturing, to the point that I would rather watch youtube videos instead of attending lectures because of how confusing the lectures can actually be (which I did). The saving grace is that the homeworks are graded very leniently (20 tries on each problem, even the multiple choice ones), and the quizzes are homework problems verbatim, and exams are also very similar to the homework problems and very fair, probably because they were often straight up lifted from the textbook. She is a very nice person, but if you want someone else to teach you choose another professor if you can. If you can get by with teaching yourself this course should be no problem because the assignments are very fair, but know that it is a LOT of content that keeps piling up so you should try your best not to fall behind. And as she will tell you, try to do a lot of practice problems.", "rating": 2, "expected_grade": "", "created": "2022-05-13T03:30:10Z"}, {"professor": "Andris Skuja", "course": "PHYS260", "review": "By the end of the semester, in a class of 60 something, there was on average 6-7 people still going to his lectures. He's probably a nice guy, but good grief is he a terrible professor. He spends his time mumbling through lecture slides while never really engaging with the class. His \"examples\" Typed out Google Docs sheets that never explain how he got to those steps (some of them aren't even complete). He spends the same amount of time on a lecture slide about Maxwell Boltzmann the person as he does about applications to the Maxwell Boltzmann constant. \r\nQuizzes are hit or usually, miss. Class averages were usually around 4. Exams are based off textbook problems, just do those and you'll be okay.\r\n\r\nThe worst thing about him however is his stance on Homework and Mock Exams. His mock exams are somewhat confusing, and not only is he the reason that solutions to these problems are never posted, but also the reason these solutions are never posted for any other PHYS260 professor, regardless of who you have. The ExpertTA questions are long and annoying, but there's even worse in that you only have 5 tries, and he has enabled it in that you lose points(as much as 25%) for each attempt.\r\n\r\nSo far the worst professor I've had at UMD. Avoid at all costs.", "rating": 1, "expected_grade": "", "created": "2022-05-18T04:24:07Z"}, {"professor": "Andris Skuja", "course": "PHYS260", "review": "He does not care about the students and will not explain concepts well. He reads off slides, and class is very unorganized.", "rating": 1, "expected_grade": "A", "created": "2022-11-30T23:35:12.003499Z"}, {"professor": "Erin Sohr", "course": "PHYS260", "review": "So glad I took PHYS260 with her. She was super nice, took time to explain everything, and overall easy. She can be a bit scatterbrained during lecture, but rest assured she knows what she's doing and will make sure you know it. Very fair with her tests and allows equations sheets. Highly reccomend,", "rating": 5, "expected_grade": "A+", "created": "2022-12-01T01:17:28.813729Z"}, {"professor": "Erin Sohr", "course": "PHYS260", "review": "Dr. Sohr is extremely caring and a friendly person in general. She is very lenient when it comes to deadlines and quiz makeup. Lectures weren’t the greatest but it was barely enough to lightly introduce you to the material.  They were mostly off of power-points. So get ready to put in some work to truly understand the material. The lecture experience was 10x awful because the class was online. \r\n\r\nDiscussions:\r\n\r\nMy TA, Lisal, was god sent! He reviewed content every week which saved our quiz grades in multiple occasions.\r\n\r\nThe good thing is all the TAs and the prof were extremely easy to reach out outside of class.", "rating": 3, "expected_grade": "B", "created": "2022-12-06T09:35:55.279313Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "Hailu is okay, and you'll learn the material you need to if you can manage to pay attention. He's incredibly boring (literally spent most classes trying not to fall asleep), but his practice problems in lecture are relevant. However, he does tend to derive formulas which sucks up a LOT of time, and makes you feel very confused. Furthermore, he often goes over formulas that are NOT in his power point slides posted online, so you really do need to attend class for those formulas and lecture examples.\r\n\r\nOverall, so long as you attend class and ask your TAs questions early and often, you'll be fine. He could be better, but could be WAY worse.", "rating": 3, "expected_grade": "A-", "created": "2022-12-11T00:22:46.201781Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "If you want to have a professor with thorough and easy-to-follow lectures, Professor Gebremariam is not the professor to take for PHYS260. His lectures are almost pointless, as they are tough to follow and are seemingly all over the place. There is very little to no review material for exams and your grade is highly dependent on how good your TA is. I was lucky to have an amazing TA who saved my grade and gave amazing review material for the final. Professor Gebremariam is a great person, but I found myself struggling to attend lectures due to their lack of practicality.", "rating": 2, "expected_grade": "B", "created": "2022-12-19T15:10:53.157490Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "A good, if not a bit slow, professor. A lot of the class is learning a concept, learning an equation, and doing a few fairly easy practice problems with it. This style took a lot of time, and not much material was covered in each individual lecture which is good if you need a thorough overview, and hate professors who blitz through lectures. This did become a bit dull, and I admit I zoned out on my phone for most lectures and then caught up on anything I missed via the textbook. The exams were fair, although do not expect to be given any practice or old exams to study off of. I found the best way to study was doing old HW problems, as the exams were about as hard, if not very slightly harder, than the HW problems. Which is to say not really all that hard if you know which equation to use. Knowing which equation to use is basically two-thirds of the class. Thank god you get a formula sheet.", "rating": 5, "expected_grade": "A-", "created": "2022-12-20T23:30:11.967953Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "A very slow and boring professor. There is never a curve and you'd be better off skipping class and just reading the textbook because Hailu makes no sense whatsoever and will send you to sleep in a matter of minutes.", "rating": 1, "expected_grade": "", "created": "2022-12-23T20:48:09.426356Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "Regardless of which professor you take, PHYS260 is just a hard class. I enjoyed having Hailu as a professor, however, his lectures are extremely boring. Coming from someone who has never fallen asleep in class, Hailu will almost certainly put you to sleep. The practice problems in class are great and extremely relevant to homework and the exams, however, the formula derivations are confusing and unecessary (just don't bother trying to understand them, you'll do fine not knowing derivations). The homework was usually okay. The quizzes are either extremely difficult or extremely easy. There is no in-between so be prepared for either. Overall, you should do fine with Hailu if you come to lecture, take good notes, and do practice problems before exams.", "rating": 4, "expected_grade": "B", "created": "2023-01-03T02:28:11.327830Z"}, {"professor": "Shabnam Jabeen", "course": "PHYS260", "review": "I heard mixed opinions about Jabeen's lectures, but I found them informative and at times entertaining due to her animated teaching style. She was also very nice and wanted her students to succeed, and would give extensions and small curves if necessary. Great professor.", "rating": 5, "expected_grade": "A", "created": "2023-01-28T21:43:17.460794Z"}, {"professor": "Andris Skuja", "course": "PHYS260", "review": "I have to learn by myself. His lectures are boring and unorganized.", "rating": 1, "expected_grade": "C+", "created": "2023-02-01T16:06:52.746310Z"}, {"professor": "David Buehrle", "course": "PHYS260", "review": "If you are the type of student who has to be walked through examples as you learn the material, Buehrle likely is not the professor for you. I have had a lot of problems with retaining physics information specifically because of this. He does a good job dumbing the concepts down to a conversational level, but the way he lectures makes it difficult to really understand the theories and math behind the physical concepts, which is what a lot of physics exams revolve around. It's especially difficult because he does very few practice problems in class. He usually has the work for the problem pre-written and presents it during class, which doesn't help me at all because I don't understand the steps he took to get there.\r\n\r\nThe layout of the class is like this:\r\n- ExpertTA homework assignments every Monday, Wednesday, and Friday (lowest homework score is dropped I believe)\r\n- A weekly quiz due every Sunday on ELMS\r\n- Three midterm exams, lowest score is dropped\r\n- One final\r\n\r\nThe homework assignments are usually way more difficult than what he covers in class, and the TA I have hasn't been much help in learning the material either. He allows a little leniency for the homework due dates, so if it's a day late you can still potentially get full credit. He doesn't make his own practice problems for exam studying, he only provides textbook practice problem answers, which have helped a bit, but I would prefer personal problems. After having Hailu for 161, I would say Buehrle is actually harder to deal with due to my learning style. Every previous review says the curve is generous, which I'm hoping for, but generous or not the struggle in finishing the class almost isn't worth it.", "rating": 2, "expected_grade": "", "created": "2023-04-17T02:49:38.314388Z"}, {"professor": "David Buehrle", "course": "PHYS260", "review": "Lots of homework, assigns 3 ExpertTA homeworks and a quiz every week. Some of the homeworks are quite hard or long but others are short and straightforward, it varies a lot. Assigned 3 very challenging homework assignments over spring break for some reason. Exams questions were moderately difficult, but we were allowed a formula sheet which made them much easier. Also exam curves were pretty forgiving and he drops the lowest exam grade. Skipped most lectures so can't say much about his lecturing skills but I didn't find it too hard to do decently well in the class.", "rating": 4, "expected_grade": "B", "created": "2023-05-03T18:35:32.343640Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "It might be because he hasn't taught lecture in a while but he isn't as bad as the other reviews make him out to be. Sure, he still isn't the best professor to go to but he definitely is passionate.\r\n\r\nHomework-\r\nOne ExpertTA assignment per week and sometimes paper assignment along with it (Paper meaning they're textbook problems that you upload your work for). The amount of time you spend on it depends on how well you know the content and calculus. He likes integrating a lot. HIGHLY SUGGEST DOING HOMEWORK HIS EXAM IS BASED ON THEM. \r\n\r\nLecture-\r\nThis is a mixed bag. 260 in general is difficult to understand and Hill has a tendency of making mistakes and having to go back and correct things. This hurts because he likes spending most of class deriving equations and we only get through a handful (2-4) questions per class. However, he strongly encourages questions and wants us to speak. The good part of lecture is when he brings in contraptions and tools to visualize what we are learning in class (candles for sound waves, vacuum chamber, etc). He does expect everyone to be an engineering major though so if you're not... Well it's not too hard to understand notations but it will be slightly different.\r\n\r\nDiscussion-\r\nProbably depends on the TA you get but the one we got was wonderful. We get a 10 minute quiz every week.\r\n\r\nExams-\r\nIt's hard but fair, but he doesn't curve. Like other physics classes (at least for 1 and 2), you get 1 exam out of 3 dropped. He strives for an average of 70% which the first two exams did reach or almost reached. He usually gives a day of review before the exam. Exams are generally based on homework questions, one of them was straight up ripped from a paper assignment. His exam format has changed every exam though, gauging how the class wants to work with it. \r\n-First exam he provided the formula sheet and it was a few multiple choice and a few written questions.\r\n-Second exam he allowed us to write a formula sheet because the class voted for it and it was also multiple choice and written questions\r\n-Third exam no multiple choice. We got 4 questions and could choose 3 to do (and everyone failed anyways)\r\n\r\nExtra Credit-\r\nThis works a bit weird, he gave us a bonus question on exam 1 and 2 but the 10 possible points you can get from each do not directly count in the exam but instead, on the side. He also give lecture quizzes (only 2 this semester though) which are supposed to count as extra credit? The reasoning he gave was along the lines of \"if you are on the border of a grade and need that extra boost, then the extra credit gives me an excuse to bump your grade up\"\r\n\r\nOverall, he's ok. Easy to zone out but that's mostly the topic than the professor.", "rating": 3, "expected_grade": "B-", "created": "2023-05-10T13:46:20.250398Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "Every single class he just focuses on deriving equations instead of explaining concepts. Most of the time he gets them wrong too, so you have to study for everything by yourself. I stopped going to lecture because it wasted my time and instead just learned everything from the TA. Don't take his class unless you absolutely need to. Find another professor because Hill will not help you at all.", "rating": 1, "expected_grade": "B", "created": "2023-05-11T01:44:43.280936Z"}, {"professor": "Andris Skuja", "course": "PHYS260", "review": "He makes easier exams than other PHYS260 professors and he curves the average for all of the exams to an 81 as well as dropping the 2 lowest quizzes and the lowest exams. The only drawback is that he teaches off slides but if you have the discipline to stay on course then you can get a good grade in the class. The averages for all 3 exams were 72-75 so I am happy I took him rather than other professors. Other things to note are that he gives quizzes and class participation in class so it's kind of mandatory. He also accommodates students if they can't come for quizzes and have to make it up. He does have his shortcomings in terms of teaching but if you can get around that his grading policies can get you a good grade in the class", "rating": 4, "expected_grade": "A", "created": "2023-05-11T19:53:56.694818Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "Exams were a but wacky and long. Spends the whole lecture deriving an equation and his slides are not very helpful. Often times he gets lost during his own lectures and is just a difficult class. The homework also took for ever The experiments were pretty cool, I will admit, but I reccomend taking another professor.", "rating": 1, "expected_grade": "", "created": "2023-05-11T20:12:14.987148Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "He's not a great professor but definitely not as bad as these reviews are making it seem. I'll list the pros and cons of him.\r\nPros\r\n- He will stay after class with you if you don't understand something. One class I was really confused and he stayed 30 minutes after lecture with me going over problems until I understood\r\n- Discussion quizzes are a good grade boost\r\n- Offered a makeup exam before the final that would replace your lowest exam score if you scored higher\r\n- Only grades 2 exams and the other 1 (or 2) get dropped \r\nCons\r\n- Lectures are often very confusing. He'll overcomplicate concepts for no reason.\r\n- When going over problems in lecture, he likes to write out the first step or two and then tell us to \"turn the crack\", which is his way of saying that he won't solve it and we need to figure it out by ourselves\r\n- He often made mistakes during lectures and either gets corrected by students pretty often or just solves the problem completely incorrectly\r\n- The whole class didn't understand what we were learning by the end of the semester and the extremely low exam scores and standard deviations for them that were through the roof proved that", "rating": 3, "expected_grade": "B", "created": "2023-05-14T17:46:29.132694Z"}, {"professor": "Wendell Hill", "course": "PHYS260", "review": "He's a pretty solid lecturer, very average for the physics department. He explains derivations in class and assigns homework for practice problems based on those concepts. Sometimes there's demonstrations in lecture, which explains adequately enough, or exam review lectures, which he does okay. Hands down the most mediocre physics professor, you'll be neither falling asleep nor wide awake during lecture, and you'll be neither completely lost nor completely understanding the content by the time the course is over.", "rating": 3, "expected_grade": "A+", "created": "2023-05-14T22:12:12.265174Z"}, {"professor": "David Buehrle", "course": "PHYS260", "review": "This class was not a walk in the park. Three homework every week, and almost weekly quizzes. Midterms were pretty hard, but you could definitely succeed in this class. The final was super hard and not like the midterms at all. If you can do good on two midterms and not miss any homework or quizzes you could get an A, but it requires you to put in the time and effort.", "rating": 4, "expected_grade": "A-", "created": "2023-06-05T00:50:54.599689Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "He's a nice professor in terms of how he responds to students and the grading but that does not make up for his confusing lectures and insanely difficult HW problems", "rating": 2, "expected_grade": "", "created": "2023-09-13T18:16:05.396436Z"}, {"professor": "Howard Milchberg", "course": "PHYS260", "review": "He is the most unorganized professor I have ever had. His lectures are very unorganized as well as the way he runs his class. He writes everything on the chalkboard, does not use a microphone but speaks really softly, and is not easy to work with if you have accommodations. His \"curve\" in his class is nice but it is not worth having him as a professor. I would not recommend taking him for any class.", "rating": 1, "expected_grade": "", "created": "2023-10-05T22:41:51.240108Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "The homework is very difficult to do without any help from TAs or previous knowledge and his lectures are really confusing and hard to read even if you're close to the front.", "rating": 2, "expected_grade": "", "created": "2023-10-11T00:40:17.386491Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "ill keep this short and simple. cool guy terrible teacher. impossible homeworks insanely confusing lectures.", "rating": 2, "expected_grade": "", "created": "2023-10-11T20:31:25.959325Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "James Drake is a nice man, in general. However, he is not a good teacher at all. His knowledge of the subject is very apparent, but he does not explain the course material or homework expectations well at all. While most physics courses use ExpertTA, Drake has us work on problems from the textbook to submit for an accuracy grade. The homework is exponentially harder than the unclear examples he gives in class. If you are a physics major, or graduate student, by all means, take James Drake. Otherwise, save yourself the trouble and just don't.", "rating": 1, "expected_grade": "", "created": "2023-10-12T03:15:48.280467Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "I do not recommend James Drake. I typically make very good grades in my classes, because I work hard. However, Drake makes it impossible to succeed in his class. No matter how hard you try in this class, YOU WILL NOT DO WELL.", "rating": 2, "expected_grade": "C", "created": "2023-10-12T03:17:26.021175Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "please save yourself the trouble and dont sign up with this professor. Im warning you now. take at your own peril. or if you are a physics genius then youll have a blast maybe. His teaching and the text book do overlap but he takes a lot of prode in his teaching style without any regard for whether the students are actually learning anything. From the first unit to unit period more than  half the class still remains confused about what in gods holy name is going on. youd be better off just reading the book for basic understanding but at the same time he will make you derive a formula rather than how it can be applied. maybe he assumes we aspire to be theoretical physicists or something but i dont think he gets that we are busy college students who thrive on straightforward teaching (tell me what i need to know, the tricks and caviats and move on). Anyways, I would not recommend, if you can avoid please do.", "rating": 1, "expected_grade": "C-", "created": "2023-10-17T04:08:13.354768Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Cares about his students, has frequent office hours. Asks for student feedback often. Knows his stuff, passionate about the subject and explains well and clearly. class was well organized. An overall nice guy trying his best. Don't hate on him just because physics is hard. Id take him again.", "rating": 5, "expected_grade": "B", "created": "2023-10-18T23:28:54.496404Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Dr. Drake is absolutely amazing! This is his first time teaching this class, but it is very clear he cares and tries really hard for his students. He makes his own lecture notes based on what he thinks is important for the students to know so that they do not have to read the textbook. He assigns homework problems slightly harder than the exam problems, and makes sure the homework problems match the kind of topics on the exam, so that we are well prepared and have those for an effective review material. He also writes out his own in depth solutions for the homework problems and has review sessions covering all of the topic we need to know the day before the exam (with it explaining how to do problems very very close to those on the real exam) and review sessions for each homework that are completely informal and inviting. He also posts a practice exam for us, and the real exam is very fair. He responds to emails quickly and is ALWAYS willing and happy to talk to students in office hours. It honestly upsets me seeing these low-scoring reviews for him because, if you compare him to the other professors who teach this class, he is the nicest of all professors. I have heard horror stories about the other professors, like how they do not care for their students and their learning and how they do not teach the right lesson plan for the final exam so they learn irrelevant material then have to speed through the actual class material (that is already a lot to learn in one semester). Dr. Drake cares so much about his students and it is abundantly clear. He is worth an 8am class.", "rating": 5, "expected_grade": "B-", "created": "2023-10-26T22:03:15.068658Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Overall confusing lectures that no one learns in, convoluted homework assignments for which the lectures do not help, and just a passive aggressive professor. Off the bat the class started on a confusing note and at a different section of the textbook than all the other classes. Very low exam averages with no curve in sight. Avoid at all costs.", "rating": 1, "expected_grade": "B+", "created": "2023-11-13T06:12:51.917115Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "every review is right just wanted to say that because this semester is when the class got restructured we did not get any practice mids. So effectively we only had expertta hwk and textbook problems(which was actually pretty good) for practice. 2 midterms , 1 final, quiz almost every week, and hwk every week.", "rating": 2, "expected_grade": "", "created": "2023-11-29T22:00:18.578718Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "I feel like some things about Hailu's class are really good and some are really bad, and whether you should take him depends a lot on what you personally like in a professor.\r\nGood: Lectures are very organized. He doesn't dwell too long on theory and spends most of the time doing problems. He writes on his iPad and uses colors which is nice because you can see what's going on easily. The weekly discussion quizzes are generally not that difficult and I think they do help you learn. Expert TA homeworks could be a little tricky but you got 5 attempts per problem+hints and feedback without point deductions. If you have an issue he's pretty accommodating and communicates well over email.\r\nBad: This man will put you to sleep. He has the most monotone voice ever. Also, his midterms this semester were super hard. He's generally known for having relatively easy exams so it may have been an issue with the course redesign. We also didn't get any practice material for the exams because of the redesign, which really sucked.", "rating": 3, "expected_grade": "B+", "created": "2023-12-02T00:39:50.390455Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Basically spends lecture just doing derivations on the board and giving you like five different equations that all solve for the same thing. Then when you try to do the homework, it's barely connected to what we did in lecture so the homeworks tend to be kind of time-consuming. Organic Chemistry Tutor saved me.\r\nThere's one homework per week, each worth ten points, two midterms, and the final. No quizzes or anything else. He gets a star because the exams are EXTREMELY similar to the sample exams he posts on Canvas, if you want to do well on the exams just memorize the sample ones and go to the review sessions he holds before the exam.\r\nThe other star is because he seems like a really nice and smart guy who cares about his students, he just isn't that great at teaching physics at a lower level. He holds office hours and if you can't make those you can talk to him and he'll set up a time.\r\nHe's not too bad, but I can't really say I learned much in this class because I basically just waited for the sample exams and memorized those.", "rating": 2, "expected_grade": "A", "created": "2023-12-06T06:50:43.264051Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "This man is passionate", "rating": 5, "expected_grade": "XF", "created": "2023-12-09T02:01:55.091365Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "Aura. Confidence. Passion. Vigor. Tenacity. \r\n\r\nThese are some of the words my fellow students and I have used to describe Dr. Hailu Gebremariam. When he takes the podium in the lecture hall I am ready to be captivated for the next 75 minutes. The man could sell ice to an eskimo, his communication method is nothing short of immaculate. I am purely in awe hearing him break down R-L circuits, and his lecture notes on electric potential belong next to the Mona Lisa. Work. of. Art. \r\n\r\nHailu is a good professor. Hes very straightforward and if you show up to lecture, participate in discussion, and practice with textbook you are bound to succeed.", "rating": 5, "expected_grade": "B", "created": "2023-12-09T02:07:25.150728Z"}, {"professor": "Howard Milchberg", "course": "PHYS260", "review": "I would not recommend this professor for PHYS260. He was very unorganized, wrote illegible notes on the chalkboard, spoke softly, and did not use canvas at all. The most redeeming factor that prevented me from giving him a 1 star was that the practice exams he sent out were very similar to the real exams. This being said, his exams were still extremely hard with averages in the mid-60s for each one. He also did not cover all the material for the course, we hardly made it through half of the syllabus. Hopefully, we will not need anything from this class for future courses, since we didn't cover much at all. I do like how he drops your lowest exam, but that is basically standard in the physics department. Overall, if you want to gain anything from taking PHYS260, I would avoid Milchberg at all costs.", "rating": 2, "expected_grade": "B", "created": "2023-12-10T01:48:53.839212Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "The sweetest guy ever!! His exams are very similar to his practice exams. Yes, his lectures are a bit confusing. But, if you memorize how to do the practice exams you will be fine. He is the best choice out of all the physics professors for sure.", "rating": 5, "expected_grade": "B-", "created": "2023-12-14T03:26:00.867763Z"}, {"professor": "Howard Milchberg", "course": "PHYS260", "review": "Milchberg is not very good, and the only reason he gets 2 stars is for his excellent exam policy where he will drop your lowest midterm or even replace both midterms with your final exam grade if it is higher. Otherwise, he just writes things down on the chalkboard while explaining things in a scatterbrained way which makes it hard to follow the examples. He also doesn't use a microphone and will be almost impossible to hear unless you sit in the front rows of the class. Nothing he does in lectures is really interesting enough to warrant the class's attention, and yet he somehow manages to be frustrated by the lack of engagement even though he isn't doing anything to fix it. He seems to expect too much from students, as he would commonly write something down on the board, ask if everyone knows what it is, and receive no response. Milchberg's teaching style is just not suited to an undergraduate course, and it makes the class so much more of a drag as a result. Avoid him if you can unless the other options are absolute trash.", "rating": 2, "expected_grade": "", "created": "2023-12-15T16:23:43.020686Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "I would say that Hailu is very organized with his lectures but his monotone voice will bore you and make it harder to pay attention in class as time drags on. Also, since this semester the course was restructured there were no practice exams, which made studying for the course challenging. I did okay since he based his problems of the slides but I think I could have done a bit better if had given more practice material. Overall, a decent professor who teaches pretty well and gives hard but fair exams.", "rating": 3, "expected_grade": "B-", "created": "2023-12-16T22:05:43.107974Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "He is a great guy. He is nice, has a good personality, and is personable. He is great to have a conversation with. However, he cannot teach. You will not pass unless you already come in with a great knowledge of physics. His exams are extremely hard compared to the other professors.  The homework is long and tedious. Regarding the final, we had two extra chapters on our final compared to Hailu's class. We do not use numbers and calculators in his class, so you can expect the exam questions to be very conceptual. For exams, we cannot bring our cheat sheets. He provided us with a handwritten (yes handwritten) formula sheet of his own. It is unfortunate because he is a great guy ... but this is your warning.", "rating": 1, "expected_grade": "C-", "created": "2023-12-19T11:22:59.751169Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Drake is a nice professor and it seems like he really cares that all of his students do well. His tests are pretty challenging, but he gives practice exams that are fairly similar in content and question style. His lecture aren’t that engaging, but he makes good lecture notes from the textbook chapters, so the textbook readings are that necessary. His homework are tricky, but they were from the textbook, so you could always find answers online. The grading scheme is really forgiving if you mess up an exam. I would recommend Drake is you’d like. Professor who cares. He was organized and communicative, but not so tech savvy.", "rating": 4, "expected_grade": "C+", "created": "2023-12-20T01:14:47.303316Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Pretty good professor. His lectures are pretty much the same as the notes he gives out for each week. The notes are based on things that he think is important for you to know for the exams and are similar to the textbook. His lectures are not that useful to me since I never learned about physics electromagnetic and magnetic field topics so it was kind of confusing to grasp. But after reviewing all the notes, his exam review session is very helpful because you would pretty much see the same topic or problems that are going to be on the exam. Overall he is a pretty good professor and is willing to help students pass his class.", "rating": 4, "expected_grade": "B-", "created": "2023-12-20T23:29:43.639133Z"}, {"professor": "Howard Milchberg", "course": "PHYS260", "review": "If you are a physics major, or someone who is generally interested in the more theoretical side of physics, I would one hundred percent recommend taking a class with him; however, if you are like me and are a non-physics major who really wants to learn more applicational problems, he is probably the worst teacher you can have. Oftentimes, the class would divulge into random tangents which no one would understand, and the subject matter was often too complicated to understand, and was unnecessary to learn as it would have served us better to have more application problems that applied to our majors.", "rating": 1, "expected_grade": "C+", "created": "2023-12-21T18:54:24.712568Z"}, {"professor": "Howard Milchberg", "course": "PHYS260", "review": "Milchberg is an extremely poor lecturer and I got nothing out of attending lectures. He is very disorganized and skips over concepts and just goes into the math. I gave him 1 more star though because he drops 1 out of 2 midterms (I mean who does that) and the final could replace most of your grade. He also just frequently gave us 100%s on homeworks because why not.", "rating": 2, "expected_grade": "B+", "created": "2023-12-21T19:21:23.255196Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "This semester's PHYS260 class with Hailu was harder than it should've been; a course redesign resulted in no practice exams being given out for the midterms and finals, with the averages for these being around a 60% on each exam. In the end, the class ended up being curved as specified on the syllabus. Overall, it was a very stressful experience that I would prefer to not repeat, and could've been prevented if he had provided additional practice material for the exams; after all, the purpose of a redesign is to improve the course for students.", "rating": 1, "expected_grade": "C+", "created": "2023-12-22T03:45:40.163419Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "His ratings have drop significantly since I initially registered for him but I believe that is unfair. Dr. Drake is a great professor when it comes to going out of his way for his students. He is always more than willing to schedule time to meet with you to discuss homeworks/concepts/exams. He also holds weekly review sessions on previous weeks material and before exams he holds a massive review session going over his sample exam. \r\n\r\nHe isn't perfect of course. I found that I was often lost in his lectures, partly due to the difficulty of the material and I felt like he didn't prep us enough before delving straight into the material which caused a snowball effect of confusion. Keep in mind that this professor focuses on the conceptual stuff. All the exams are purely conceptual and will not be asked to calculate a single number. Sorry guys, you can't plug and chug your way out of this class. If you can grasps the concepts then you'll be fine but if you are more of a numbers person than you might want to consider a different professor or put in the effort to understand the theory and logic. His exams are somewhat similar to his sample exams and there are really no surprises. He also makes sure it's graded where you get the maximum partial credit. ie. if you get part a wrong and part b needs the solution to part a, you can still get full credit for part b using part a granted that you follow the correct steps.\r\n\r\nThis semester the physics department really screwed over everyone with suddenly changing the curriculum causing professors to change their lecture materials. Due to this, we all had our own finals which I think worked in everyone's favor since all the 260 professors covered different material. Drake drops a midterm or half of the final and there was still an additional curve to the class. \r\n\r\nI genuinely do hold the opinion that Dr. Drake goes above and beyond for his students, it is just up to you to take advantage of that.", "rating": 4, "expected_grade": "C", "created": "2023-12-22T04:23:19.486309Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "I do not believe he is a bad person or professor, in hindsight of this past semester (Fall 2023).\r\n\r\nHis lectures are mainly derivations/algebra on the chalkboard, which can be difficult to see at times. However, his exams are similar to the sample exams he provides, which is a lot more conceptually-focused than anything else; if you truly understand what is going on in class, you will be able to do well in the class, but you do need to study/practice a bit, as his sample exams are not similar to the homeworks he provides.\r\n\r\nThe homeworks in the class are definitely challenging. They come straight from the textbook, but you'll need to take your time on them. Textbook solutions are not always accurate, meaning once again, if you don't really understand what is going on in lecture, you may feel like the homeworks are too much. However, if you skim through the textbook, you can find formulas that can help you solve the problems you're assigned, and Dr. Drake is willing to help you understand the material and complete the homeworks (he hosts weekly review sessions as well as separate exam review sessions). \r\n\r\nHis grading structure is pretty lenient too; he drops either one of your two midterms, half of your final, or all your homeworks. He also seemed to curve a little at the end of the class (I think ~3%).\r\n\r\nDuring the semester, this course was definitely challenging, especially as a lot of us didn't really know what was going on in lecture and didn't fully understand the homeworks, but if you actually take your time and study the content outside of lecture and discussion (besides doing the homeworks), you'll perform well in his class.", "rating": 4, "expected_grade": "B", "created": "2023-12-22T20:31:33.078792Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Don't get me wrong, Drake is an extremely kind and down to earth man and he is clearly passionate about physics. He genuinely wants his students to succeed and gave a super generous curve at the end of the semester. However, I have not learned a single thing in his class. Drake is a terrible teacher and the only reason I survived was by memorizing his practice exams because that's all you can really do since they're somewhat similar to the actual exam. His lectures are extremely confusing and the homework's are impossible to do without help. The whole class felt like a theoretical physics class. If you're a physics major you'll love this guy, if not, save yourself the suffering and choose another professor.", "rating": 2, "expected_grade": "C", "created": "2023-12-23T22:32:23.376929Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Really great guy. The class is hard because of the material; not him. If I had a different professor I probably would not have done nearly this well. This sentiment is all coming after I got my final grade, and is probably a more accurate rating of Dr. Drake than the other reviews that were written before the second (for some even the first) exam scores were even posted.", "rating": 5, "expected_grade": "B", "created": "2023-12-26T02:19:21.440364Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "This professor has gotten a lot of negative reviews which a lot of them are correct but overall I think he taught the class very well, especially compared to the other professors you get as an option to take. I took Drake for phys260 and Hailu for phys161 and James Drake is much better than Hailu. A lot of James Drake's lectures could be pretty confusing but he posts his notes ahead of time which is nice. Also the big reason why I think he is great is because his practice exams are very very similar to the actual midterms. I am not a physics genius and I am usually pretty bad at physics but I was able to get an A in the class. When he teaches his material it can be confusing, after almost every lecture I would have no idea what is going on but the key part about his class that made me get an A is that before each midterm and the final he would have a review session where he went over in depth the practice exam. So I would just memorize how to do the practice exam and understand the concepts on the practice exam and then I would do well on the midterms as the midterms were almost exactly the same but different questions. The homeworks are really hard and useless (I just found the answer key online and never really understood most of the hws and still got an A). Also once a week he has workshops that are really helpful as well. Also you can actually listen to him where Hailu I would literally fall asleep in class because of how bland his voice was.\r\n\r\nTLDR: If you want to learn and fully understand the concepts then he might not be the right choice but if you want to get an A then I would take him and just only understand the concepts on the practice exams and go to his workshops and review sessions. HWs are hard and useless (can easily find answers online though). Also, I was supposed to end the class with a B+ but he curved the final  (which brought me to an A-) and then he curved my overall grade to an A. So go to his review sessions and do the practice exams and the class won't be bad. Most of the reviews were posted before final grades came out, he ended up curving a lot which was very nice.", "rating": 5, "expected_grade": "A", "created": "2023-12-27T21:53:36.864785Z"}, {"professor": "Howard Milchberg", "course": "PHYS260", "review": "He places a big emphasis on actually understanding the material rather than just memorizing formulas. His class and lectures are disorganized but a large part was also due to the curriculum change with PHYS260 this past semester. His tests focus on derivations and conceptual understanding rather than plug and chugging equations, which is better for understanding the material. If you show up to every lecture and take notes, you will do well. He is also very accommodating if you go to his office hours or speak to him personally. His exams frequently cover questions used on previous practice exams/HW or concepts gone through during lecture, so review them well. Take him if you want a strong foundation in fundamental physics. His only downside is that his lectures can be difficult to follow as he jumps around the board a lot and can write messy.", "rating": 4, "expected_grade": "A", "created": "2024-01-06T01:08:46.372546Z"}, {"professor": "Howard Milchberg", "course": "PHYS260", "review": "This class was the hardest class I have taken so far at UMD. Every time I go to lecture, I think I'll learn something but I leave more confused. Words cannot describe how stressed this class has made me. Thoughts of switching majors or even dropping out have occurred because of Physics 2. Milchberg is a very intelligent man but he expects us, sophomore students barely into our majors, to grasp the information right away. He goes on and derives formulas on the chalkboard and most of the students have no idea what he is talking about. He also wants us to base things off his lectures and not the textbook.\r\n\r\nGrades consist of 20% textbook problem sets, 25% midterm 1, 25% midterm 2, and 30% final. He emphasizes improvement; if you do better on test 2, it could count for 50% of your grade. Similarly, if you do better on the final than the midterms, that score would be 80%. One tip is don't do the problem sets the night before (guilty), space them out over the weeks. He typically gives you two weeks to do 20 problems, and drops the problem sets that are right before a test. His tests are incredibly difficult but he lets you bring a cheat sheet. Pay attention to practice problems and problem set questions. He's sometimes a funny guy but his teaching style was really hard for me. I never got my final score back, but people that have see that the average was a 26/100. Milchberg mentioned that there was a grade cutoff change instead of an assignment curve which was the only reason many of us passed.", "rating": 2, "expected_grade": "B-", "created": "2024-01-12T16:04:46.614160Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS260", "review": "Getting mad at hailu is like getting mad at a textbook, all the information is right in front of you but its not all that interesting to learn and its even less engaging because of how its delivered. I fought hard to not fall asleep in class. Please go to office hours and do your due diligence with practice problems from the textbook.", "rating": 3, "expected_grade": "C+", "created": "2024-01-24T21:48:31.008072Z"}, {"professor": "Rajarshi Roy", "course": "PHYS260", "review": "TAKE HIM!!! Best physics professor, super sweet and accommodating. His first two exams were open notes and open internet. If you go to his office hours he will spend the time to walk you through the content. I did find his lectures a little confusing and redundant so I mainly learned from the textbook but when he is teaching you can tell he is genuinely passionate about the subject. HIGHLY reccomend!", "rating": 5, "expected_grade": "A-", "created": "2024-04-01T17:46:43.778480Z"}], "department": "PHYS", "course_number": "260", "name": "PHYS260", "title": "General Physics: Vibration, Waves, Heat, Electricity and Magnetism", "credits": 3, "description": "<b>Prerequisite:</b> PHYS161 and MATH141.\n<b>Corequisite:</b> PHYS261.\n<b>Credit only granted for:</b> PHYS142, PHYS260, or PHYS272.\nSecond semester of a three-semester calculus-based general physics course. Vibrations, waves, fluids; heat, kinetic theory, and thermodynamics; electrostatics, circuits, and magnetism. PHYS260 and PHYS261 must be taken in the same semester.\n<i>If purchasing used books additional software may be required.</i>", "is_recent": true, "geneds": null}