{"average_gpa": 2.7111111111111112, "professors": ["Sylvester Gates", "Sylvester Gates", "Sylvester Gates"], "reviews": [{"professor": "Sylvester Gates", "course": "PHYS235", "review": "This class was an unorganized mess. We didn't even get the syllabus until the second week. The course is an awkward mismatch of history from the late 1800s to WWII and surprisingly advanced nuclear physics. The math and science part was not taught well, especially in a class with students with no physics experience. The lectures were essentially Prof. Gates muttering to himself (he doesn't know what a microphone is) about random history and science things (a lot of which were irrelevant to the course). The TA seemed nice but was very awkward and was not good at teaching us the math we needed. We also have no way of knowing our actual grades since they're not posted accurately on elms or by his office. The only good thing about this class was that the grading was pretty fair. I still wouldn't take this class though.", "rating": 1, "expected_grade": "A-", "created": "2022-12-16T20:16:13.310679Z"}, {"professor": "Sylvester Gates", "course": "PHYS235", "review": "I cannot overstate the respect I have for Dr. Gates. He knows so much about everything he talks about, and he comes across as a very compassionate professor. That being said, the lectures in this class were not particularly captivating. There's a lot of history in this course that I wasn't anticipating--I thought it would be a lot more science based. Dr. Gates clearly has a passion for both history and science. He's so knowledgeable about both, but he doesn't seem to realize that the rest of us are so far below his understanding, so most of the information goes in one ear and right out the other. Overall, this gen ed is way more stress and work than its worth, and I would not recommend it unless you're incredibly interested in WWII and the Manhattan Project. If you only like nuclear physics and aren't a fan of any of the history (like me) I would not recommend it.\r\n\r\nAlso, Dr. Gates will often post test material on Canvas with the expectation that we print it, which is kind of inconvenient if you don't have a printer. The library printers can be a little sketchy. We're allowed to make a formula/cheat sheet for most quizzes and the midterm exam (there's only one midterm). Dr. Gates said that the cheat sheet likely won't help us no matter what we put on it, and he's right--the quizzes are on the most random stuff that was either briefly mentioned during the lectures or not mentioned at all. When we ask what we should study for each quiz/exam, he directs us toward all of the lecture notes from the semester, which are often unclear. The averages were usually low Cs or high Ds. Good luck!", "rating": 3, "expected_grade": "B+", "created": "2023-11-29T21:56:10.904266Z"}, {"professor": "Sylvester Gates", "course": "PHYS235", "review": "This is a surprisingly hard class. I'm a humanities major, so the history was easy for me. But the physics was rough! However, my STEM classmates would say the opposite: the history is terrible whereas the physics is easy. The lectures can easily put you to sleep and he doesn't have the microphone on half the time. The TA will be your lifesaver as they will be the ones to actually help you with the practice problems. Expect the quizzes and exams to be difficult, and study accordingly.", "rating": 2, "expected_grade": "B+", "created": "2023-12-06T22:24:30.585908Z"}, {"professor": "Sylvester Gates", "course": "PHYS235", "review": "Professor Gates is an alright professor. He is passionate about the teaching the content to students. Problems occur with his administration of the class. His assessments contain unexpected and difficult material. I attended every lecture and every discussion, and there was stuff that I had never seen before on tests and quizzes. He is not very organized, and the TA was not very helpful. This class is way too difficult to be a GenEd.", "rating": 2, "expected_grade": "B", "created": "2023-12-12T19:27:38.262338Z"}, {"professor": "Sylvester Gates", "course": "PHYS235", "review": "As others have said, I have nothing but respect for Dr. Gates as a physicist. It's clear he knows his stuff when it comes to this course, and he clearly understands both the historical stuff and mathematicial stuff that he's teaching. That being said, there's a lot more history than physics in this course (something I wasn't really expecting) and the homework assignments that we get almost exclusively cover the math/physics concepts while we were tested on mostly the historical parts (including some stuff we didn't cover in lecture — you had to be on top of the readings from Richard Rhodes' \"The Making of the Atomic Bomb\"). With such a wide breadth of material, tests were pretty difficult for a GenEd, and this wasn't helped by the fact that outside of midterm grade updates I had no idea what my grade was in the class. From what I've heard from the non-STEM majors the mathematics aren't exactly easy for people not already familiar with electricity and magnetism (though no actual calculus was required), and our T/A, while nice, wasn't good at explaining stuff (half of a discussion section was arguing with people whether the cross-section of a sphere had surface area 2πr^2 or πr^2). The term paper is fair but a little irrelevant to the course material (it's basically \"did you read the Rhodes book\", the assignment). I wouldn't recommend this course unless you were extremely interested in WWII, and even then you might find lectures swinging from \"too much info all at once\" to \"tangents so odd that I don't know what to take notes on\".", "rating": 2, "expected_grade": "B+", "created": "2023-12-13T04:31:41.108103Z"}, {"professor": "Sylvester Gates", "course": "PHYS235", "review": "I took this class purely out of interest for the subject and I really enjoyed it. Professor Gates is probably one of the most knowledgable professors I've encountered at UMD and it shows through the content of the class and the way he teaches. You can tell he genuinely enjoys teaching this class and expects his students to be interested in it as well. The class definitely could have been organized better but personally I think Professor Gates' teaching made up for the disorganization. Overall I'd say this class is definitely not easy or light work so make sure you're actually interested in the content (nuclear physics AND wwii history). Professor Gates knows so much and you will learn a lot but be prepared to be engaged and interested in what he's saying. Great class but not for everyone. Great opportunity to learn from a world renowned physicist.", "rating": 4, "expected_grade": "A", "created": "2023-12-15T23:07:17.647881Z"}, {"professor": "Sylvester Gates", "course": "PHYS235", "review": "Prof Gates is extremely knowledgable about what he is teaching however he is not able to communicate the information in an effective manner. His lectures are confusing and all bounce all over the place. He posts the slides, but they are almost impossible to interpret. The slides are packed full, containing at least 200 words per slide in a variety of different colors, sizes, and fonts. He also does not release accurate grading. I'm writing this review just before the final and I know that I got a 77/100 on the midterm. However, he grades are based off an average, which he does not release. So I don't know if that grade is a C or an A. The same goes for quizzes. There's also a term paper, so be prepared for that, but he won't release information about assignment effectively. The topic can be about essentially everything, meaning he gives no guidance for what to write about and he provides no format for the style the paper should be written in. This leads to students emailing him individually and then sending screenshots of his reply into the class GroupMe. Overall the class is a disorganized mess and I do not suggest you take it.", "rating": 1, "expected_grade": "A-", "created": "2023-12-17T21:48:32.417107Z"}, {"professor": "Sylvester Gates", "course": "PHYS235", "review": "His slides/lectures were awful (large chunks of the slides would be repeats, material would be covered out of chronological order, his 'lectures' were just him rambling). It felt more like he was talking at us than teaching. There were multiple instances where we were tested on history not covered in class (either because we hadn't gotten to that material yet or because it was irrelevant to the class's overall focus and was, at most, mentioned offhand during a lecture). There was no real way of practicing the science aspect of the class outside of the homeworks, which were poorly written and frequently required information not covered of briefly covered in class.\r\nThere was also basically no way to know what your grade in the class was. Homework grades would be put directly into canvas while quiz/midterm grades would be sent to you by the TA. Except none of the assignments are weighted correctly in canvas, so you'd have to manually calculate your overall grade. Except he curves the quizzes/midterms heavily (because of how poorly everyone does), but never publishes what this curve actually is. And he sometimes just doesn't tell you your grade on certain assignments so you are left guessing what your overall grade is. \r\n25% of your grade is a term paper he does not give you an actually rubric for and just gives you a vague bullet point list of what he wants included (no word on font/font size, citation format, how many sources he wants, spacing). There are no other written assignments in this class, so there is no way to have prior knowledge about how he will grade it.\r\nIt felt pointless showing up to class because how poorly taught the material was. I would rather chew glass than take any class taught by him again.", "rating": 1, "expected_grade": "B-", "created": "2023-12-22T20:24:36.777453Z"}, {"professor": "Sylvester Gates", "course": "PHYS235", "review": "Very little direction provided, especially when it came to exams. Grading was confusing. It's mentioned that there is a curve; if there is, I never figured out it out. The lecture slides are very unorganized. Our final grades were delayed by a few weeks because of repeated errors in the grading algorithm. Many people had their final grades changed 3-4 times. He also did not disclose this to students, leading to a lot of panic when you would wake up and see your grade changed yet again. I would not subject myself to this experience again.", "rating": 1, "expected_grade": "B+", "created": "2024-04-01T19:48:54.226702Z"}], "department": "PHYS", "course_number": "235", "name": "PHYS235", "title": "The Manhattan Project", "credits": 3, "description": "Introduction to some critical ideas of nuclear physics and a review of some key historical developments starting at the end of the 19th century.  Chronological development of nuclear physics from the discovery of radioactivity by Becquerel in 1896 through to the discovery of fission in Germany in 1938 followed by an examination of the programs to develop nuclear weapons in the United States, Britain and Germany.  Extensive study of political, ethical, scientific, military, social, and economic issues surrounding the Manhattan Project.", "is_recent": true, "geneds": null}