{"average_gpa": 2.955910968945755, "professors": ["Thomas Antonsen", "Min Ouyang", "Hailu Gebremariam", "Rabindra Mohapatra", "Wendell Hill", "Peter Shawhan", "Shabnam Jabeen", "Sergio Picozzi", "Bei Lok Hu", "Marguerite Tonjes", "Andrew Smith", "Konstantinos Papadopoulos", "David Buehrle", "Victor Yakovenko", "Matthew Severson", "Howard Milchberg", "Hsing-Hen Chen", "Xiangdong Ji", "Eun-Suk Seo", "Matt Severson", "Drew Baden", "Drew Baden", "Drew Baden", "Eun-Suk Seo", "Drew Baden", "Hailu Gebremariam", "David Buehrle", "David Buehrle", "Drew Baden", "Eun-Suk Seo", "Hailu Gebremariam", "Michael Crescimanno", "Drew Baden", "Eun-Suk Seo"], "reviews": [{"professor": "Thomas Antonsen", "course": "PHYS270", "review": "This guy isn't that bad when you get down to the root.  This is his first semester teaching this course, so I don't know if he will teach it in the future.\n\r\nDr. Antonsen is actually from the Electrical engineering department, so what he is really good with in this course is explaining circuits.  That was one of the concepts that I understood very easily, especially because he was able to explain it in such a clear way.\n\r\nExams were moderately difficult, just about as hard as a physics exam should be.  The problems aren't plug and chug, but also aren't super difficult (though quite a few people found them hard)\n\r\nBasically, read your textbook, go to class (sometimes I doze off given the driness of the subject), and do some practice problems, and you should be fine.\n\r\nOverall, he's a great guy.", "rating": 4, "expected_grade": "A", "created": "2011-04-04T17:44:00Z"}, {"professor": "Theodore Kirkpatrick", "course": "PHYS270", "review": "I thought these reviews were a little misleading. He is not at all as bad of a teacher as everyone here claims. Yes, lectures sometimes involve proofs and derivations which can be difficult. However if you write down what he does on the board and just listen to what he says you will learn something. The tests can be really hard if you don't go to class or the review. In class he does examples which he warns may appear on the test in almost identical form. Going to the review also gives you almost everything that you need for studying including at least one identical problem.\n\r\nI enjoyed this class and I liked him as a teacher more than my other two physics teachers I had here. I'm done taking physics classes but if I had to take another one I would try to get in his class again.\n", "rating": 3, "expected_grade": "", "created": "2010-05-21T00:38:00Z"}, {"professor": "Rabindra Mohapatra", "course": "PHYS270", "review": "Dr. Mohapatra is a fine lecturer and teacher, but he's not really given much to work with - the material covered in PHYS270 feels disjointed and would likely be difficult regardless of the professor. Our class was apparently two weeks ahead of the other one, so I'm thankful for that. There appears to be a hefty curve in the class.", "rating": 3, "expected_grade": "A", "created": "2011-12-24T19:56:00Z"}, {"professor": "Rabindra Mohapatra", "course": "PHYS270", "review": "Mohapatra is an average lecturer, and class notes were either somewhat disorganized or not thorough. However, he's really nice and helpful in office hours. The weekly quizzes he gave were fair for the most part, and helped to indicate what topics were most important.\n\r\nTests were not too difficult, but don't expect to get anywhere without reading the book. The Mastering Physics assignments ranged a bit in difficulty, but were probably the single most useful part of the course. Doing well in this class is all about practicing a variety of problems, and Dr. Mohapatra didn't assign a bunch of single bar problems like the other teacher (Bantu) did.\n\r\nI personally found his accent entertaining and very easy to understand, and I also thought he was pretty funny. He's very responsive by e-mail, and is extremely understanding about grading concerns. You probably won't find much better teachers for PHYS270.", "rating": 3, "expected_grade": "A", "created": "2010-12-03T02:44:00Z"}, {"professor": "Ellen Williams", "course": "PHYS270", "review": "Seems like a nice person, but makes a lot of mistakes during lecture (writing equations, doing examples, etc.)  Focuses a lot of time on experiments and has them on tests so you should definitely go to lecture to know her experiments.  Some of the questions were ridiculous, like the name of someone who came in to help with an experiment.  Other than that, pretty ridiculous curve for C, so don't sweat it too hard if your grades look low, you'll still pass.", "rating": 2, "expected_grade": "C", "created": "2009-06-17T15:13:00Z"}, {"professor": "Wendell Hill", "course": "PHYS270", "review": "Dr. Hill is by far the worst teacher I have ever had. If I could really rank him, he would be negative. NEVER EVER EVER take his class. His exams were impossible, the material is class was worthless. He has no respect for his students. He was awful to deal with, never responds to emails. ", "rating": 1, "expected_grade": "", "created": "2014-01-26T19:38:00Z"}, {"professor": "Thomas Cohen", "course": "PHYS270", "review": "Quite possibly the best physics professor I've had so far in UMD. \r\nThe tests on the other hand are extremely easy. Throughout the entire semester, I've been to lecture at most 5 times, read the book before the day of the exam, and still managed to pull As on my tests. \n\r\nThe only bad thing I would say about Cohen is the heavy weight he puts on Homeworks (20%) and Discussion Quizzes (5%), though this may work for you if you actually do your homeworks.\n\n", "rating": 4, "expected_grade": "B", "created": "2009-05-19T22:15:00Z"}, {"professor": "Thomas Cohen", "course": "PHYS270", "review": "Tom Cohen is a pretty cool guy as far as physics teachers go. He tried really hard to make boring material seem at least vaguely interesting and his tests looked a lot like the practice tests. He was very open to meeting with students, discussing concerns, and going over material outside of class. Overall he's a very approachable guy who just wants students to have a painless physics experience.", "rating": 4, "expected_grade": "", "created": "2009-05-19T01:23:00Z"}, {"professor": "James Drake", "course": "PHYS270", "review": "Dr. Drake is a great professor.  Gives very clear and informative lectures with very good notes.  If you go to lectures and take the notes he writes up on the board you can get an A without ever opening the textbook.  Exams and assignments ask fair questions that are representative of the material covered in the lecture and are graded fairly as well.  Dr. Drake personally holds a review session before every exam and the final and is more than happy to meet with students outside of class to help them.  It is very easy to make a time to meet with him as he is in his office very regularly.  If you need help go talk to him and he will help you.  If you miss a lecture go talk to him and he will copy his lecture notes for you and go through them with you.  Take a class with Dr. Drake if at all possible.", "rating": 5, "expected_grade": "A", "created": "2008-05-18T15:24:00Z"}, {"professor": "Konstantinos Papadopoulos", "course": "PHYS270", "review": "Not going to lie, most lectures were pretty boring.  He posts all his powerpoints online so obviously it is very difficult to find the motivation to go to class.  However, he would include questions on his exams that were solely taught in class and not on the powerpoints.  His review sessions would usually include a problem or two that would be on the exam and the review documents he posted on his website were very similar to some of the exam problems.  Average exam scores were very low, however, there were huge curves for all all of them including the final. Overall, not bad at all for engineering-physics.", "rating": 3, "expected_grade": "A+", "created": "2010-07-28T14:24:00Z"}, {"professor": "Konstantinos Papadopoulos", "course": "PHYS270", "review": "Really boring, tests are pretty difficult,  but curve is nice. Takes most of exam problems from what he says in class. ", "rating": 3, "expected_grade": "", "created": "2010-05-09T21:05:00Z"}, {"professor": "Konstantinos Papadopoulos", "course": "PHYS270", "review": "Not a great professor. He can't really teach and has an accent. Just try to learn from the book, doing MasteringPhysics, and discussion class. ", "rating": 2, "expected_grade": "", "created": "2009-11-25T16:37:00Z"}, {"professor": "Konstantinos Papadopoulos", "course": "PHYS270", "review": "It only requires V5 but actually uses V3,4 and5. Does not make sense to buy 3 books. Try the full volume(ISBN:0805389601)! It will be a lot cheaper.", "rating": 3, "expected_grade": "", "created": "2009-01-24T16:25:00Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "Bantu makes PHYS270 a decent experience.    There are two midterms, each worth 12% of your grade, which is nice because most of the PHYS270 professors do 3 midterms.  Overall, they were pretty easy, with a few of the questions being very similar, or even direct questions from the homework.  \n\r\nLab is 25%, but that is the same regardless of your professor. Lab was, in my opinion, the worst part of the class.  There are only 4 labs (plus the culminating lab), but they all pretty much took the full 3 hours and were pretty tough.  Your experience is going to depend entirely on who your lab TA is.  If you get a good one, lab shouldn't be bad. \n\r\nQuizzes are 10% of your grade, and there is one at the end of each chapter.  He does not announce the quizzes beforehand, but if you follow his lectures and the schedule, you should know about when they will be.  They are almost always very easy and require only basic knowledge of the chapter.  Write down the equations as he is teaching, or start the homework before he finishes the chapter, and quizzes will be simple.\n\r\nHomework is 21%, with 14% being masteringphysics and 7% being written.  The written is just to do 3 of the masteringphysics problems by hand on paper and turn it in, so it's not really extra work.  The masteringphysics tends to be pretty easy, so the homework isn't a huge burden. Do check often if there is an assignment though because he does not announce when he posts them.  Do not copy from the solutions manual because they are watching for that and a large portion of the class did just that on the first homework.\n\r\nThe exams were each 3 problems and were usually pretty simple.  The only issue is that since they are only 3 problems, if you are completely lost on one question, you already lost a large portion of your grade.  Study hard for these, redo the masteringphysics, and you'll be fine.\n\r\nThe final exam was a common final across all the sections, and was actually pretty easy.  It's hard to say if he curved the class because we did not get our final exam scores back, but I have a feeling that he did.", "rating": 4, "expected_grade": "A", "created": "2012-05-19T13:14:00Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "This guy isn't that bad, but he isn't that good. He should illustrate some more example problems. Instead, he primarily just uses Power-Point slides which are identical to the book, so if the book confuses you Bantu won't help that much. Also, I didn't like that he gives no sample exams whatsoever; on Fri. before a Mon. exam he just tell us \"3 problems 1 is on Chap 35, 2 is on 36, 3 is on 37\". However, his exams were really straightforward, everything was an example in the book or an assigned homework problem - no curve balls. ", "rating": 3, "expected_grade": "B", "created": "2010-03-03T19:03:00Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "Bantu is a really nice guy and a decent lecturer, although he can be kind of boring. He goes through the material pretty slowly, which means his tests end up covering less material than usual for 270, so they are not very difficult in general.\n\r\nHe grades very fairly and I think there was a curve at the end of the semester.\n\r\nHe usually does one pop quiz a week, but the questions are so easy (as long as you have the equations written down).\n\r\nThe Mastering Physics hw is not too bad, especially since he gives you 5 chances to answer each question correctly, with no loss of credit until the last chance is used up. \n\r\nThe only really annoying thing about Bantu was that he never emailed us when he posted assignments, so you basically have to check Blackboard constantly to see if there is a written assignment and you have to check MP to see if there is a new online assignment.\n\r\nOverall, Bantu is definitely one of the better physics professors.", "rating": 4, "expected_grade": "A", "created": "2009-12-28T20:34:00Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "Dr. Bantu is a very nice, easygoing professor who made PHYS270 a relatively easy experience. He's a rather dry lecturer, but he cracks jokes in lecture occasionally to wake up the many sleepy, bored students. \n\r\nHowever, his class was not too hard., especially compared to the other professor, Jenkins. The tests were straightforward (except maybe the second one, which almost no one finished), and the final was not even cumulative! MasteringPhysics was the homework system used and there was always help available if you knew where to look. There were quizzes in lecture at the end of each chapter, but most of the time you did not really have to go to lecture since he posts lecture powerpoints online. Also, discussion is useless. My TA always went on tangents that usually ended in him talking about Maxwell's equations, which was irrelevant to most of the topics we were covering.\n\r\nThe worst part of this class is the lab which counts for 25% of the 270 grade. Fortunately, we only had it every other week, but my experience was awful since no one knew what he or she was doing and the TA couldn't speak a word of English and explain anything!\n\r\nOverall, definitely take Bantu over any other PHYS270 professor!", "rating": 4, "expected_grade": "A", "created": "2009-12-23T14:36:00Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "It only requires V5 but actually uses V3,4 and5. Does not make sense to buy 3 books. Try the full volume(ISBN:0805389601)! It will be a lot cheaper.", "rating": 3, "expected_grade": "", "created": "2009-01-24T16:23:00Z"}, {"professor": "Matthew Severson", "course": "PHYS270", "review": "Severson was a good professor. His exams are extremely straightforward. Most of the problems were just plugging variables into equations, so as long as you make a good formula sheet, you'll get an A. He doesn't spend too much time deriving equations and gets straight to the point. He did a great job of teaching physics to engineering majors. ", "rating": 5, "expected_grade": "A", "created": "2018-01-02T16:20:32Z"}, {"professor": "Howard Milchberg", "course": "PHYS270", "review": "Milchberg is a decent lecturer and a great/hilarious guy. Homework was straight out of the textbook for 270, and the exams were pretty insane, but his grading is dependent on progress. The departmental final for 270 meant that after his exams the final was a cakewalk and almost everyone in the class walked away with an A. \r\n\r\nJust wish I could take him for 420, but they switched up the professors on me. ", "rating": 5, "expected_grade": "A", "created": "2018-12-18T23:19:25Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "In my experience in all 3 general physics classes here, I thought Hailu was the most well-rounded when it comes to teaching the material and going through examples in class. Although the first exam is pretty hard, he lightens up the second and third exam. He also curves the class on average 2-3%. ", "rating": 5, "expected_grade": "A", "created": "2018-12-22T21:36:00Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "Whatever you do please don't take this professor. Three exams, doesn't drop any, doesn't narrow down on topics covered in the exams he will say to \"study everything\" which is no help at all. His lectures are super boring but he does do a lot of example problems which help a little at first but definitely doesn't prepare you for the exams. His exams are such curve balls there's aways one problem that will throw you off and he gives like 2 problems, so if you screw up one, you fail. He curves a lot at the end but you gotta have at least a 70% or higher to get a B. Which isn't bad but his exams are bad so that might be hard to get. The course isn't bad as long as you read the textbook and do practice problems, but just make sure you have a good professor. ", "rating": 3, "expected_grade": "C", "created": "2019-05-28T08:25:25Z"}, {"professor": "Xiangdong Ji", "course": "PHYS270", "review": "Extremely fun to talk to and observe in class. He is very intelligent and his tests are exactly taken from the homework sets.", "rating": 5, "expected_grade": "B", "created": "2019-12-17T16:41:25Z"}, {"professor": "Xiangdong Ji", "course": "PHYS270", "review": "Professor Ji was among the most enthusiastic teachers I have ever had. His excitement and passion for physics made the class truly enjoyable. He was also able to clearly and effectively answer any and all questions I had about the material.\r\n\r\nThe main criticism I have heard is that people do not think his exams are hard enough to prepare students for the final. (When I took his class in fall 2019, the exams were almost exact transcriptions of the homework assignments.) Frankly, this is nonsense. If you know what you are doing and have a good, comprehensive formula sheet going into the exam, you will be fine.", "rating": 5, "expected_grade": "A+", "created": "2020-02-26T04:37:47Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "Professor Gebremariam is one of those professors that you can just tell that he is being forced to teach students, which is clear when you email him, as he talks down to his students and acts like he is gods gift to physics. His lectures are mind numbingly boring and pointless. To make it even worse, the TA that i had was somehow has worse Hailu. Would stay away from this professor if possible.", "rating": 1, "expected_grade": "B", "created": "2020-05-23T17:07:02Z"}, {"professor": "David Buehrle", "course": "PHYS270", "review": "Buehrle was great. Online lectures were helpful and frequently ended early. OH were helpful and he was cool. Exams were standardized and on ExpertTA", "rating": 5, "expected_grade": "A", "created": "2020-12-04T23:06:43Z"}, {"professor": "Howard Milchberg", "course": "PHYS270", "review": "I would say Milchberg is an above average lecturer. In his lectures he spends time deriving formulas and explaining concepts. He will include a few examples but not too many. His reviews before the final and midterms were helpful where he could do more examples and summarize concepts. The homework is time consuming but you get roughly 2 weeks per assignment to complete it. He also uses an improvement grading style where only your best midterm is counted and if your final exam grade is higher than your best midterm then that counts for both your final exam grade and midterm grades. Usually on midterms and the final he will include a problem that's similar to the homework. Overall Milchberg is a nice professor and wants to help his students.", "rating": 5, "expected_grade": "A-", "created": "2021-01-05T23:29:02Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "The most cold-hearted and cruel professor that I have met so far. He even made the expectations of us learning online being higher than in-person settings. For some weeks, he made the HW problems extremely difficult and he didn't care if most people are immensely struggling. Instead he always would say that these problems are easy and made people feel even worse. He basically doesn't know how to show empathy towards his students and. If he would help us out, then everyone could be benefited that way! \r\n", "rating": 1, "expected_grade": "", "created": "2021-05-23T20:01:45Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "Some may say his lectures sound monotonous. This is true and he speaks so incredibly slowly—still, I think they were good quality lectures that were easy to understand and had plenty of examples. His quizzes are easy and exams are fair. He typically will curve the final grades to a B- average, but since our class average was already doing this well, we didn't get a curve this semester.", "rating": 4, "expected_grade": "A", "created": "2021-06-26T14:23:33Z"}, {"professor": "David Buehrle", "course": "PHYS270", "review": "Buerhle explains every single concepts very clearly and concisely in his lectures, and even taking the course over the summer, he always host office hours regularly and he won't even mind to meet students at times other than office hours. He addresses every question very well, and once when I got stuck on a problem for hours, he and I spent 30 minutes together and we figured it out. Exam questions formatted a lot like the homework questions, perhaps there may be one question that threw people off especially on the third midterm or the final exam, but I promise you will learn a lot from his lectures and the class as a whole. \r\nIf you are planning on taking PHYS 270 over summer, even when it definitely will be in-person next summer, still, do it! I guarantee it will be the best experience! ", "rating": 5, "expected_grade": "A", "created": "2021-07-21T23:22:16Z"}, {"professor": "Drew Baden", "course": "PHYS270", "review": "Dr. Baden kept the lectures informative and catered to engineers as opposed to physicists, which made the class, in general, a bit easier. It was his first time teaching the class, and while he did a wonderful job, there were a few confusing aspects. Firstly, he never posted student exams to grades, and just showed a grade distribution which made it harder to ascertain my final grade. This said, the exams were all straightforward with generous partial credit. They got more challenging as there became more concepts to cover in the exam, but a well-studied student could manage this without difficulty. I would highly recommend Dr. Baden if you have the option.", "rating": 4, "expected_grade": "B+", "created": "2021-12-23T15:55:33Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "I literally could not make it through Hailu's lectures without falling asleep because he speaks in a monotone and is so disinterested in his own words. Eventually, I stopped going to lecture and taught myself the material. I actually was doing better in the class this way until I bombed the final because it was a common final exam and was completely different from Hailu's midterms, quizzes, and homeworks. There was no good way to prepare for midterms or the final because students are given no practice problems, no old exams, no feedback on anything you submit, nothing at all to give any vague idea of what an exam problem might look like.\r\n\r\nAlso, I had to speak with Hailu on two different occasions about special circumstances that affected my ability to do work, and he was cold and unsympathetic, providing the bare minimum accommodation of one make-up quiz, then not telling me what the quiz would be on so that I ended up with a zero on it because I had no idea what to study. ", "rating": 1, "expected_grade": "C+", "created": "2021-12-24T17:53:05Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS270", "review": "I'll admit I didn't attend most lectures. She talked really quite, so combined with her accent, it made it difficult to follow lectures. She lectures from slides which I'm not usually a big fan of but that's just my preference. Homework's were done online with expertTA and were fairly easy, and would help reinforce concepts with easy questions that tended to lead to somewhat more challenging questions. However her tests were quite a bit more difficult than the homework's, and would sometimes test on material not found in the homework which I found difficult to study for. There were review worksheets which were somewhat helpful, however. The key to this class is a good equation sheet. Really try to cover your bases because one obscure missing equation can really trip you up in an exam. Overall not bad I just wasn't super impressed by the way the class was set up, but it is still completely possible to do well in this class and get an A.  ", "rating": 3, "expected_grade": "B+", "created": "2021-12-25T15:07:15Z"}, {"professor": "Drew Baden", "course": "PHYS270", "review": "Professor Baden is definitely one of my better experiences in the Physics department. He's notably passionate on showing how physics relates to modern applications, and he's a pretty nice guy. His lectures are not the most beneficial, most of them consisting of him deriving expression, but he at least works through stuff instead of reading off of a PowerPoint. My main plus about his course is that his exams were very straightforward (similar format to HW problems), and he and the TA's were fair about partial credit. He also implemented a curve (a bit confusing but I can't really complain) and dropped the lowest exam (3 exams total). Homework was about the same level of difficulty as the other physics pre-reqs, and I used the formulas from it for my exams, which proved to be very helpful. My TA was also very helpful, offering practice problems that covered topics on the homework and exams.\r\nOverall, I would recommend this professor, since you will probably have a better experience than many of the other options for this course.", "rating": 4, "expected_grade": "B", "created": "2022-01-25T02:24:39Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "You know he is a good teacher the problem is you might fall asleep in his lectures.", "rating": 4, "expected_grade": "C+", "created": "2023-04-14T20:35:53.688615Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "His lectures are pretty boring and hard to follow, but sometimes he draws diagrams and those are pretty helpful.", "rating": 3, "expected_grade": "A", "created": "2023-05-12T04:19:57.843446Z"}, {"professor": "Drew Baden", "course": "PHYS270", "review": "The only truly great physics professor at UMD in my (limited) experience. His exams aren't necessarily easy, but they're direct and worded well so that if you understand the proper concepts you will succeed. Helpful guy overall with a keen sense of humor and the passion to make otherwise lackluster content seem interesting enough to learn. Only slight on him is that he doesn't update canvas nearly as much as he should, but otherwise is the best bet by far if you want a good experience in Physics 3.", "rating": 5, "expected_grade": "A-", "created": "2023-05-16T18:17:35.657265Z"}, {"professor": "Drew Baden", "course": "PHYS270", "review": "A breath of fresh air in the UMD physics department. His exams are well worded, direct and do a good job of fairly assessing whether or not you fully understand the material. He shows a great deal of passion towards engineering and physics concepts, which make the otherwise semi-dull content easier to pay attention to and understand. He makes good jokes, constantly asks students if they have any questions, and is overall a professor who has compassion and an understanding of his students. This course isn't necessarily easy, but with Baden it has been a much smoother ride than in my past Physics courses. My one slight on him is that he rarely, if ever, updates canvas, but he hands back exam grades in class so you will always have a rough estimate of your grade at all times. Overall great guy, great professor and great for his students sanity.", "rating": 5, "expected_grade": "A-", "created": "2023-05-16T18:24:00.590305Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "Hailu is pretty boring, but if you go to lecture and somewhat pay attention to the practice problems he does, you will do well in the class.", "rating": 4, "expected_grade": "A-", "created": "2023-05-25T03:25:24.543464Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS270", "review": "I don't know why Professor Seo has such bad reviews. I was worried about this class at the start of the semester, but she has done a great job teaching it. She's very smart so sometimes she does gloss over topics that should be explained a little more but overall she does a great job preparing us for exams. Overall I'd say her class is very fair and there's reason to avoid her as a professor.", "rating": 5, "expected_grade": "A-", "created": "2023-11-15T02:35:07.951372Z"}, {"professor": "Howard Milchberg", "course": "PHYS270", "review": "Physics is a really boring class at times. Milchberg is never boring. His only flaws are that he goes into too much detail and can be a little disorganized. If you like physics or math or are majoring in one of those you will love his class. He really knows his stuff and he is very nice and is also fair and listens to his students. He asks questions to the class and if you have a questions he will really try to get you an answer, he wants you to succeed and learn. If you are an engineering major you may struggle a bit. His lectures will bog you down with fine details and things that you may not have to care about or may not apply to you. His lectures are also almost entirely conceptual which can be hard for engineers who are used to building things and using numbers physical literal examples. His grading scale is very generous, the homeworks are textbook problems that you have 2 weeks to do and while his exams are hard, he will only count your higher midterms and if you do better than either midterm on the final he will use your final exam grade as 80% of your total grade. This class isn't a lot of work and honestly if you show up and take notes and pay attention you will be fine.", "rating": 4, "expected_grade": "B+", "created": "2023-11-16T02:05:17.705293Z"}, {"professor": "Drew Baden", "course": "PHYS270", "review": "Baden made phys270 a great and enjoyable class to be in, the concepts were never too hard and the exams were very easy but he made sure that we knew the underlying concepts with more depth than was required for the class so we could actually learn them. As a physicist, he emphasized learning these concepts not just to apply them but also to influence how we think (he himself admitted that relativity and quantum mechanics was not something most of us would use anyway, but that it was still important to learn them). His lectures are engaging and interesting, and he could always answer student questions immediately and with great clarity that brought insight to the topics. The only complaint I ever had from his class was that he would consistently go 2-3 minutes over time at the end of class to finish explaining his topic, which is certainly a lot less of a complaint than most professors at UMD. It goes to show how good Baden is that lectures always had very good attendance even though he never really made lecture attendance graded.", "rating": 5, "expected_grade": "A+", "created": "2023-11-29T13:44:04.129444Z"}, {"professor": "Drew Baden", "course": "PHYS270", "review": "Excellent lecturer, and a really nice guy. His exams are fair and surprisingly easy. I always had fun going to lecture since he made every concept super interesting.", "rating": 5, "expected_grade": "A", "created": "2023-12-16T19:44:04.206712Z"}, {"professor": "Hailu Gebremariam", "course": "PHYS270", "review": "ONE OF THE WORST PROFESSORS EVER. Not only is he boring, but his lectures are composed of copied slides from somewhere else and writes messy stuff. He should be fired. I DON'T UNDERSTAND HOW HE STILL HAS A JOB.", "rating": 1, "expected_grade": "", "created": "2024-02-09T19:57:34.465989Z"}], "department": "PHYS", "course_number": "270", "name": "PHYS270", "title": "General Physics: Electrodynamics, Light, Relativity and Modern Physics", "credits": 3, "description": "<b>Prerequisite:</b> PHYS261, MATH241, and PHYS260.\n<b>Corequisite:</b> PHYS271.\nThird semester of a three-semester calculus-based general physics course. Electrodynamics, Maxwell's equations and electromagnetic waves, geometrical optics, interference, diffraction, special theory of relativity, and modern physics. PHYS270 and PHYS271 (lab) must be taken in the same semester.\n<i>If purchasing used books additional software may be required.</i>", "is_recent": true, "geneds": null}