{"average_gpa": 2.78544776119403, "professors": ["Douglas Hamilton", "Paulo Bedaque", "James Drake", "Gregory Sullivan", "Luis Orozco", "James Williams", "Richard Greene", "Michael Fuhrer", "Jordan Goodman", "Eun-Suk Seo", "Srivatsa Tata", "Rajarshi Roy", "Kaustubh Agashe", "Jordan Goodman", "Michelle Girvan", "Rajarshi Roy", "Rajarshi Roy", "Michelle Girvan", "Richard Greene", "Michelle Girvan", "Richard Greene"], "reviews": [{"professor": "Carter Hall", "course": "PHYS272", "review": "Excellent professor. Comes prepared for the lectures and the recitation sections are actually useful to go to, since the exam questions are very similar. You finish the course knowing the material, and the exams are usually very straightforward, since they test the concepts. ", "rating": 5, "expected_grade": "A", "created": "2008-12-18T13:47:00Z"}, {"professor": "Carter Hall", "course": "PHYS272", "review": "He is a very good and patient prof. answers all your questions in class and will make time to meet you outside of class if you want. \n\r\nhomework is a bit long, but easy enough that you can do it without going to lecture.\n\r\nhis tests are very straightforward. no calculators, or notes. he will provide an equation sheet which isn't' that help full... but if  you know the material you will do fine. cause all the questions ask about concepts and rarely about little details. the only bad thing is that they are always out of 20-30 points, so you better get everything right....", "rating": 4, "expected_grade": "A", "created": "2008-05-02T14:15:00Z"}, {"professor": "Douglas Hamilton", "course": "PHYS272", "review": "First, this review is for Douglas Hamilton, the physics teacher (not the astronomy or math teacher). His lectures were not the most interesting thing most of the time but he had enough demos to keep my attention. Plus the homework was pretty easy and he ended up curving the class a lot. But most importantly, he was an incredibly nice teacher and was always happy to meet with me (and I would assume other students) if I had questions about the class (or anything else).", "rating": 5, "expected_grade": "B", "created": "2012-04-06T01:25:00Z"}, {"professor": "Douglas Hamilton", "course": "PHYS272", "review": "He's a rather enthusiastic professor though he may not seem like it. If you ask for help, he'll always help you and try to understand your situation. His teaching skills are not excellent but he tries to make up for it by making tests doable and solvable. He'll curve according to the bell curve and adjust accordingly. Fair grader!", "rating": 4, "expected_grade": "B", "created": "2011-12-27T01:05:00Z"}, {"professor": "James Drake", "course": "PHYS272", "review": "Dr. Drake is one of the best physics professors I've ever had. He is extremely knowledgeable in regards to his subject matter and has a sincere desire to see his students do well. The review sessions he holds before the midterms are extremely helpful. I highly recommend you attend all of them. He is very accommodating, and he doesn't have any issues talking with you one on one outside of class. I would definitely recommend taking a class with Dr. Drake.  ", "rating": 5, "expected_grade": "A", "created": "2013-12-02T16:57:00Z"}, {"professor": "Luis Orozco", "course": "PHYS272", "review": "Orozco is by far my favorite professor. He is so excitable and interested in Physics and your personal involvement with Physics as well. He is extremely knowledgeable about it all. I was in the section with the other reviewer here and don't know why s/he didn't know his/her grade; I could always tell what it would be...though most of us waited until the last day to in the week to do the homework assignments, which was fine if you had a few hours set aside and knew a few other people who were as big of procrastinators as you.\n\r\nI genuinely adore this professor and about half of the reason I was going to take a class was if he was teaching it but he may be going on sabbatical--well deserved, but still :(", "rating": 5, "expected_grade": "", "created": "2010-05-05T22:33:00Z"}, {"professor": "Luis Orozco", "course": "PHYS272", "review": "great lecturer and very interesting. threw pop quizzes thruout the year and i had no idea of his doing this until the last day or two of class. also i found his grading method on the first exam, which resulted in me geting a 10% on it. he basically just grades the answers and the occasionally grades the work. if i didnt have the right answer i never got credit for a problem. this is rough when you have 4 problems on a test and there equally weighted. i can only suggest to do homework before the last day, as i normally forgot to do it.", "rating": 3, "expected_grade": "", "created": "2008-12-21T22:19:00Z"}, {"professor": "Richard Greene", "course": "PHYS272", "review": "Amazing professor! He made a hard class easy to understand, and covered topics in a way that kept me constantly engaged. ", "rating": 5, "expected_grade": "A-", "created": "2019-12-20T01:35:04Z"}, {"professor": "Richard Greene", "course": "PHYS272", "review": "Probably the first teacher to make super complicated ideas seem so simple and then make them really hard on the test again if you do not study properly. Otherwise he is an amazing professor that makes the subject actually interesting!", "rating": 5, "expected_grade": "B-", "created": "2020-12-16T01:30:41Z"}, {"professor": "Rajarshi Roy", "course": "PHYS272", "review": "Excellent professor, and very kind too. He curved generously and accommodated students' needs.  Be sure to take the homework seriously as it featured heavily in the exams and was used in extra credit \"quizzes.\"", "rating": 5, "expected_grade": "", "created": "2022-01-13T21:42:37Z"}, {"professor": "Rajarshi Roy", "course": "PHYS272", "review": "Professor Raj is the best physics professor I've had YTD. He's a very kind guy, very accommodating, and does fun demonstrations during his lectures. If you just show up to class and do the homework (without putting in much more work), you can easily expect a B in 272. With regard to exams - he has a unique and refreshing take on them. He cares much more that you understand stuff conceptually than he does your ability to plug stuff in or recite formulas. Because of that, all of his exams, quizzes, etc. were open note/textbook/internet. Professor Raj would pick one question from your homework set and offer it as an extra credit quiz every Friday. I cannot stress how awesome of a professor he is.", "rating": 5, "expected_grade": "B+", "created": "2022-12-09T22:39:22.926002Z"}, {"professor": "Rajarshi Roy", "course": "PHYS272", "review": "The most pure human being I have ever met. He truly cares about students and even memorized all our names! His demonstrations are also very fun. The main downside of this class for me was that I pretty much had to teach myself everything. Dr. Roy didn’t do as much barebones teaching of the material, so there were definitely some gaps in learning. His TA was also pretty useless, so I actually ended up learning everything from the textbook, which Dr. Roy made sure was very accessible! Overall I’d recommend his class but be prepared to do some self-teaching.", "rating": 4, "expected_grade": "A", "created": "2022-12-20T20:49:24.151021Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "Every lecture is the same. She goes through 40+ lecture slides without working through a single problem on the chalkboard. And because there are so many slides, she moves far too fast to be able to take adequate notes within the class period", "rating": 1, "expected_grade": "B", "created": "2023-09-29T16:38:13.452812Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "I really like how she teaches. She simplifies the textbook material and includes a few practical problems in every class. She's also caring and good at answering questions.\r\n\r\nShe gives tough exams and tells us she's aiming for a 70% average, but she'll curve them. I actually prefer the harder exams. Some people may not like them being tough, but I don't get why. We're paying a lot for our UMD courses, and it's important for us to be held responsible for learning the material.", "rating": 5, "expected_grade": "A+", "created": "2023-11-09T03:15:32.001027Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "God help you.\r\n\r\nProfessor Girvan cares a lot for her students. She is a very nice person. She is very talented. She will want to help her students succeed, and she will smile as her class beats you into the dirt like a sledgehammer. The homeworks are 10 questions that can go up to part m. They are so unimaginably difficult that many graduate students cannot solve them. I've been to tutoring, and it has taken people in doctorate programs days to solve them. It will take at the very least 4 hours to do a single homework. The quizzes are from the homework questions, and are almost always the hardest and most impossible of the already difficult homeworks. They're every week, and there's no formula sheets allowed (for some reason). Only a single homework/quiz is dropped, compared to Multi-Variable Calculus which drops 3.\r\n\r\nThe lectures range from ok (I guess?) to completely incomprehensible. Problems are gone through in minutes on the slides, and she spends time on bizarre substitutions and derivations for the entire class before chucking you into the deep end. Problems and variables are substituted so much that if you look back at the slides you won't be able to even see what happened. Nothing is explained in a legible or understandable way, important and critical steps and explanations are skipped with the assumption you can just figure it out, and you often leave the class in a daze trying desperately to figure out what just happened.\r\n\r\nThe tests are impossible. Literally, she said she designs them to be ridiculously hard. The only silver lining is they're based on the slides. She says \"Oh don't worry guys there's a big curve!\", which ranges from either half-true to a downright lie. Some tests do indeed have a curve, a curve so small it barely changes anything. Some she just won't curve at all.\r\n\r\nThis is the worst class I've ever taken. No class has made me feel worse, even Math141 seems like a gen-ed compared to this. 95% of the energy you spend in your semester will be on this class. If you ever have the misfortune of being forced to take this teacher, all I can tell you is this. God save you, for no one else can.", "rating": 1, "expected_grade": "", "created": "2023-11-27T19:29:58.393087Z"}, {"professor": "Richard Greene", "course": "PHYS272", "review": "Whoop whoop! Dr. Greene is amazing! We do so many demonstrations which ranged from launching soda cans to microwaving light bulbs and CDs. The exams aren't always super easy, but they're very fair, and there's adequate study material to prepare with. People like Dr. Greene justify my love for physics, and I'm very grateful to have been in his class. If anyone's on the fence about what professor to take a class with and Dr. Greene is an option, choose Dr. Greene.\r\n\r\nThe homework can take a bit of time, but it's really not bad at all--especially for a physics class.", "rating": 5, "expected_grade": "A", "created": "2023-11-29T22:02:43.334737Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "Realistically you should do everything that you can to avoid taking this class. Dr. Girvan cares about her students, but that's about where the positives end. She does not write on the board at all, she teaches from slides made by pearson and skips steps throughout. She goes way way too fast, and her homework assignments on expert ta take several hours. There is a quiz every friday on the homework material, and these quizzes are literally horrible. She also promises curves that never really happen, and overall seems like she wants her students to fail. It really makes no sense to me why a professor would make quizzes and exams difficult to this extent. She told us from the very first day that her exams are very hard, and she did not lie. Even if you have to take this class in a different semester, it is worth putting off. You should do anything that you possibly can to take a different professor.", "rating": 1, "expected_grade": "B+", "created": "2023-12-05T16:27:34.755651Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "All I have to say is don’t take her. This class is way too hard, way too stressful, and 1000% not worth it. Weekly expert ta assignments, weekly quizzes, and quizzes and exams are really hard. Please do yourself a favor and do not take this class..", "rating": 1, "expected_grade": "B+", "created": "2023-12-05T22:29:21.090566Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "This has been by far the worst course I've taken at UMD. The exams are nearly impossible, and the professor wants nothing but the worst for her students. She said word for word that she gives hard exams and that she shows no mercy. She essentially caters this course towards people who have already taken an E & M course and doesn't care about the students who are struggling to keep up. The lectures were very hard to follow, and often there would be mistakes on the slides. No extra credit, and she only drops one quiz. We were not allowed a formula sheet or index card on the quizzes, which I could understand, but it's not consistent with the course when we're given a formula sheet on exams. \r\n\r\nAnd to the person who gave her a five-star review, maybe I don't want impossible exams because I'd like to not go insane. This class nearly made me drop my major because of how bad my mental health got from the stress of it. It's physically impossible to be successful in this class when the professor wants the absolute worst for you. I studied for HOURS for the second exam to find out that she wasn't going to curve the exam because the average was where she wanted it. That's only because the people who already took E & M are carrying the class average, and if you're below the average, you're screwed because it's nearly impossible to keep up with the course. \r\n\r\nThis professor would be better suited for graduate-level classes, but not for a lower-level physics course. I'd honestly learn a lot more from just teaching myself the textbook. The TA carried this course so hard, someone give him a raise.", "rating": 1, "expected_grade": "", "created": "2023-12-12T21:01:25.486970Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "God cannot help you. You should register for other professor, delay this class, or time travel back to high school and take ap physics. \r\nIn short, Girvan purposely makes everything harder than what is supposed to be. Quiz may be similar setup as one of hw question, but derived more parts that are hard and few are unsolvabley hard. Girvan ensures all exam average to be strictly below 80 by purposely making irrationally hard exam, including but may not limiting to a question end up at a integral unable to solve. This indeed happened on one of the midterms. That is, if there exist people taken ap physics and you have not, \r\nthen you certainly is the lower quartile. There may exist a curve, but this semester only one of two midterms is curved. Do not trust it at all. As previously stated, Girvan ensures exam average is strictly below 80 (even if after curve). \r\nGirvan does know how to do things, and she can work out a understandable process if you go to office hours and ask for it. However, Girvan clearly expects significantly more than a 200 level 3 credit stem class should (both time commitment and self study ability). And lecture slides is almost a mess. Some have equation list, but not all equations needed. One will have to dig into messy sketchs to find the useful thing. Agreed with previous, \"homework may go up to part m\", and this is not rare occation at all. It is taking equvalent (and may be more) time than a 400 level math. \r\nI took it only because schedule and cannot delay. I can pass this class because and only because Girvan has a very good TA. The TA does teaching much better and comprehensible, even if it is merely over email.", "rating": 1, "expected_grade": "C+", "created": "2023-12-12T21:07:24.822882Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "Albeit I haven't taken the final, I feel professor Girvan did a sufficient job teaching the material and going over core concepts. People seem to be complaining because its a hard class and they want to blame professor Girvan but I mean physics is one of the hardest majors for a reason and its not because of the professors... If you go into the class expecting the professor to do everything for you then good luck buddy, but if you put in the extra work outside of class you'll be fine. Also, I 100% support the harder exams this class isn't supposed to be a cakewalk it should test your knowledge on the material that is taught and that can't be done with easy exams. She also responds well to emails and is very caring for her students. I would recommend taking Girvan for this class if you know how to study and you can get over the fact that she doesn't work out problems in person (she has arthritis).", "rating": 4, "expected_grade": "A", "created": "2023-12-15T03:14:54.206421Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "If you put time into studying the class should be a breeze. The expectations she has are very reasonable and she gives you all the resources you need to succeed however, it can be up to you to learn for yourself. I find that her lectures are ok but I do the majority of learning on my own.\r\n\r\nThe quizzes are problems from the homework, some of the exam problems are directly from the lecture, and the weekly homework takes about 3 hours. I will say that If you are having so much trouble with this rudimentary course, you might want to consider switching out of a physics major.", "rating": 4, "expected_grade": "B+", "created": "2023-12-16T15:11:07.871525Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "Dr. Girvan puts makes it seem like she really cares, but as the year went on I came to realize this isn’t really true. It seems like she really wants to fail us, and I myself thought I was gonna fail the class at multiple points. I truly don’t recommend taking her. This class was torture. Do yourself a favor and take a different professor, and if you can’t take this class a different semester.", "rating": 1, "expected_grade": "B-", "created": "2023-12-28T21:15:42.733132Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "The reviews and rating speak for themselves.. but to put it simply, I truly do not recommend taking this professor. I will admit a large portion of our class had taken it before, which made it extra difficult for those who hadn’t, but unless you have a very strong foundation of the material covered in the class, do yourself a favor and don’t take this class. It has put me through more stress than any other class I’ve ever taken.", "rating": 1, "expected_grade": "B-", "created": "2024-01-06T02:38:18.462220Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "Navigating through this physics course feels like trying to find dark matter with a flashlight – elusive and leaving me in the dark! If only our professor's explanations were as illuminating as a glow-in-the-dark supernova, we might all become physics wizards instead of feeling like we're lost in a black hole of confusion!", "rating": 1, "expected_grade": "B", "created": "2024-01-12T03:59:15.497772Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "She is by far the worst teacher I have ever had the displeasure of enduring for an entire semester. The lectures give no real value other than copied textbook passages, she never uses the chalkboard, she is always drinking a redbull throughout class which feels very unprofessional and seems like she doesnt care at all about the lectures. She promised a class curve that would be around 3% which by itself is low (The other professor teaching the same physics course during this semester curved by over 10% and taught better) but then she only curved 0.5%. She put an impossible to solve integral on an exam. She has tough quizzes and while she claims to want to challenge her students, thats ALL she does when she should also want them to succeed instead.", "rating": 1, "expected_grade": "B", "created": "2024-01-12T04:42:50.088828Z"}, {"professor": "Richard Greene", "course": "PHYS272", "review": "Professor Greene is my favorite teacher at UMD so far! He makes the classes fun and engaging, and he does a lot of cool demos. I can see that he cares about his students, and wants to see them learn and improve at physics. Professor Greene is kind, intelligent, and funny. He is always willing to help you as long as you are willing to ask questions, and he explains topics in an easy-to-understand way.\r\nIn terms of the class (PHYS272): The structure is flipped, so most of the learning is done outside of class, and then the class itself is about reinforcing topics and solving problems. Whether a flipped format is good or not is a matter of personal preference. The workload is relatively substantial, but this is necessary given the difficulty of the topics; the best way to learn physics is to practice. There are weekly quizzes on the same day that the weekly homework is due, but both the homework and quizzes aren't worth that much in terms of your final grade (and he even drops your 2 lowest quizzes). The tests are what's important, but a lot of the questions are similar to what you have already seen through practice questions/practice tests he provided (though they are not nearly as easy as the quizzes). The grading for the class is lenient as Professor Greene is understanding and there is a substantial curve (the total class average is curved to a B-). He will even give you extra time on tests if you need it, because he wants to assess your knowledge of physics and does not want to make the tests a question of speed. Overall, this class was very useful and I am so grateful to have had Professor Greene as my teacher for it. Do not hesitate to choose him as your professor!", "rating": 5, "expected_grade": "A+", "created": "2024-01-14T23:36:46.087725Z"}, {"professor": "Michelle Girvan", "course": "PHYS272", "review": "I don’t recommend taking this professor. Lots of stressful weeks taking tough quizzes that were hard to fully study for. Exams were really hard and not really curved. So many hours went into studying for this class. If you have a busy workload try and take this class with a different professor if you can", "rating": 1, "expected_grade": "", "created": "2024-01-28T22:10:08.881277Z"}, {"professor": "Richard Greene", "course": "PHYS272", "review": "Dr. Greene is one of the best professors I ever had. I walked into that class with no knowledge on E&M, and walked out with a deep and conceptual understanding of all the concepts. Dr. Greene makes his class interesting and engaging with demos. He also cares about his students success more than grades. He wants you to learn the material, so he gives very conceptual questions and extra time on all his exams because he wants to test your physics knowledge not formula regurgitation. There are weekly quizzes, which make sure that you stay on top of the material and understand what will be put on the exams. Overall, I highly recommend you take Dr. Greene for any physics class especially PHYS272 if you get the chance.", "rating": 5, "expected_grade": "A+", "created": "2024-02-23T14:26:45.050026Z"}], "department": "PHYS", "course_number": "272", "name": "PHYS272", "title": "Introductory Physics: Fields", "credits": 3, "description": "<b>Prerequisite:</b> PHYS161 or PHYS171; and MATH141; and must have completed or be concurrently enrolled in MATH241.\n<b>Credit only granted for:</b> PHYS142, PHYS260, or PHYS272.\n<b>Additional information:</b> CORE Distributive Studies Physical Sciences Laboratory Course only when taken concurrently with PHYS275.\nSecond semester of a calculus based general physics course. Universal gravitation, electric and magnetic fields and potentials, simple circuits, Maxwell's equations in integral form. Continues the application of mathematics to conceptual models, now with more abstract components.\n<i>Cross-listed with PHYS272H. Credit granted for PHYS272 or PHYS272H.</i>", "is_recent": true, "geneds": null}