{"average_gpa": 2.9117913832199545, "professors": ["Sarah Eno", "Suresh Tonwar", "Andris Skuja", "Johnpierre Paglione", "Peter Shawhan", "Carter Hall", "Wendell Hill", "Frederick Wellstood", "Arpita Upadhyaya", "Anton Peshkov", "Manuel Franco Sevilla", "Ellen Williams", "Min Ouyang", "Alicia Kollar", "Manuel Franco Sevilla", "Min Ouyang", "Simone-Gunde Kulin", "Alicia Kollar", "Manuel Franco Sevilla", "Simone-Gunde Kulin", "Wendell Hill", "Wendell Hill"], "reviews": [{"professor": "Steven Anlage", "course": "PHYS375", "review": "Professor Anlage is excellent. Really helps you out when things are going wrong in the lab, and is very patient about it too. He is a good lecturer - explains things well and answers any questions you can have. Definitely recommend him.", "rating": 5, "expected_grade": "A", "created": "2010-11-25T01:58:00Z"}, {"professor": "Steven Anlage", "course": "PHYS375", "review": "I've had Dr. Anlage for two classes now, 375 and 402. He's the man. Real cheerful, and does a great job teaching the material. You might want to think about looking ahead in the book before going to lecture though, because he tends to move pretty quickly.", "rating": 5, "expected_grade": "A", "created": "2009-11-17T23:42:00Z"}, {"professor": "Alicia Kollar", "course": "PHYS375", "review": "This professor was very absent. She was rarely in class and did not hold true to her office hours. Many students have asked her for in person appointments, to which she said no. The grading criteria was also ambiguous, and she did not explicitly state where people would get points off for the lab reports. Furthermore, her general response to people's concern is just \"this course is a more advanced course\". Would avoid in the future.", "rating": 1, "expected_grade": "", "created": "2022-06-28T20:01:44Z"}, {"professor": "Wendell Hill", "course": "PHYS375", "review": "This guy is a BUM. Thank goodness the labs were run by the TA's (who were absolutely delightful, I might add), otherwise I would have had a completely miserable experience. Here's a breakdown of all the problems I had with Hill's 375 class:\r\n\r\n-There were several homeworks in this class. And they were TOUGH. I was showing up to office hours every week because this dude would barely give any equations or examples in class and then would expect us to write PhD dissertations on the homeworks. I found myself using Google and finding random papers or textbooks to figure out how to solve the homework problems. Lectures were USELESS. On the bright side, the homeworks were graded by a TA who was super generous. It's just crazy to me how my lab homework was harder than my main physics classes. \r\n-The class had two lectures a week, which I learned absolutely nothing from. People quickly realized lecture was useless and soon enough over the class stopped showing up. Hill started giving pop quizzes just to get people to show up to his lectures. \r\n-SOOO many typos on assignments. You would think this would be a nitpick, but there were multiple times there were unsolvable questions on the HW because of typos. \r\n-Thank goodness, Hill did not grade lab notebooks, pre-labs, or homeworks. The stuff he did grade, however (the lab report, for example), he made sure to grade as harshly as possible. For the first draft of the lab report, mans gave no guidelines and then flunked just about everyone's papers. What the heck, man. \r\n\r\nIf you can afford to wait another semester to take this class with a different professor, I would. If not, just pray the TA's are good because you aren't gonna learn anything from this guy.", "rating": 2, "expected_grade": "", "created": "2023-11-29T18:38:01.123967Z"}, {"professor": "Wendell Hill", "course": "PHYS375", "review": "He's not a good lecturer, not an awful one, but I feel his lectures generally left me not understanding the material better than had I just picked up the textbook myself. If you could take the class with another professor, it would be optimal, but it's not so bad you should delay your graduation over it. His lecturing style mostly consists of throwing an equation up on the board and trying to explain it, he doesn't get caught up in derivations too often but when he does it is a stalling point for the class. To his merit he will try to help students when they ask after class, but if it should take too long, or should he not see a clear way to answer the student he tends to brush it aside and keep moving. Overall, very dispassionate and sterile as package, which is workable but clearly detrimental.\r\n\r\nKey Points:\r\n-Medicore and dispassionate lecturer, to the point it feels detrimental to understanding.\r\n-Homework is often incongruent with lecture, this could be because he doesn't reach his objectives in lecture, or it could be that they were simply taken from various textbooks and plastered together because they were vaguely on topic in lieu of making more apropos coursework. This is in addition to asking for derivations we did not even approach in class as \"original\" problems of his.\r\n-Assignments were often unclear in their guidelines (due to typos or a complete lack of direction), we did not get a decent picture of what he wanted from the semester lab report until after the first draft, and even then, things were quite murky. He does not communicate his expectations well on project-based work, to the point the first draft of the report's average grades were dreadful.\r\n-Labs were with the TAs and went generally fine, with the expected tedium of having to handle things like lenses with your hands. \r\n-The TAs this semester were absolutely amazing which may bias my rating of Professor Hill positively as I might not be able to fully understand the shortcomings I might have experienced in the hands of less astute TAs.\r\n-To his credit his exams are fair, he went open-note for them this semester, but they are verbatim the material covered on homeworks and in class.", "rating": 2, "expected_grade": "", "created": "2023-12-10T02:51:24.926725Z"}, {"professor": "Wendell Hill", "course": "PHYS375", "review": "This guy is just not cool. Super disrespectful. Says you can ask him for help, but when you do he just says, \"well you should know how to do this\" and leaves it at that. Grades hard based off nothing. Homeworks were really difficult, and were often extended by the TAs because of that. Avoid if possible, it feels like this guy wants to spite you a little bit for taking his class.", "rating": 1, "expected_grade": "A", "created": "2024-01-06T14:58:39.680456Z"}, {"professor": "Wendell Hill", "course": "PHYS375", "review": "Greatest professor of all time! Stays in the lab the whole way and is extremely caring and kind. Very engaging lecturer and he ignited the spark of physics in me.", "rating": 5, "expected_grade": "A+", "created": "2024-03-26T22:24:14.633903Z"}], "department": "PHYS", "course_number": "375", "name": "PHYS375", "title": "Experimental Physics III: Electromagnetic Waves, Optics and Modern Physics", "credits": 3, "description": "<b>Prerequisite:</b> PHYS276 and PHYS273.\nThird course in the three-semester introductory sequence. Methods and rationale of experimental physics. Experiments chosen from the areas of electromagnetic waves, optics and modern physics.", "is_recent": true, "geneds": null}