{"average_gpa": 3.01447963800905, "professors": ["Erica Glasper Andrews", "Erica Glasper", "Anna Li", "Ana Navarro Cebrian", "Adam Brockett", "Anna Li", "Adam Brockett", "Anna Li", "Anna Li", "Anna Li"], "reviews": [{"professor": "Adam Brockett", "course": "PSYC304", "review": "Honestly the best professor. If you're interested in anything bio psyc/neuroscience (or even if you need it as a thematic course) take him!! His lectures are very informative and straight to the point and as long as you study his slides well, you'll do good in the course. The only reason I didn't get an A was because I didn't take it so seriously in the beginning, this is also a difficult subject that requires your effort!! Nonetheless, he's great at teaching for being so new and I'd take him again if he taught another course! :)", "rating": 5, "expected_grade": "B+", "created": "2022-12-15T23:18:59.800376Z"}, {"professor": "Adam Brockett", "course": "PSYC304", "review": "Very clear lectures, great slide design with helpful diagrams and illustrations. Gives a whole class period for exam review and questions. His project was also fairly broad (choose your own topic related to class) and was graded leniently. Would definitely recommend!", "rating": 5, "expected_grade": "A", "created": "2022-12-26T14:23:35.192569Z"}, {"professor": "Adam Brockett", "course": "PSYC304", "review": "Very kind and funny professor. Class was structured as 4 multiple choice exams that followed the slides exactly. Also had a video assignment that was worth more than an exam that was basically free points if you did the work on time. The subject matter is the most interesting of any class I have taken so far. Highly recommend.", "rating": 5, "expected_grade": "A-", "created": "2022-12-27T14:36:39.012633Z"}, {"professor": "Anna Li", "course": "PSYC304", "review": "My first lecture for this class, I was intimidated because Professor Li described the class to be difficult. However as time went on I found the class to be very fair and enjoyable! There is a lot of content to learn especially if you havent taken NEUR200 beforehand, but this was my introduction to neuroscience and I found the workload to still be manageable despite that. Exams are all multiple choice which makes it easier to handle, and Professor Li did study guides and an example Kahoot with practice questions for each exam. The one thing I would warn is that Professor Li does tend to post some videos for concepts OUTSIDE of lecture that will come up on the exam. The amount of content in these videos is pretty small (usually just an anatomical view with some brain structures to remember) but will surprise you on the exam if you don't watch the videos she posts. Overall, PSYC304 is a class that will keep you busy but interested!", "rating": 4, "expected_grade": "A+", "created": "2024-01-11T03:31:17.250328Z"}], "department": "PSYC", "course_number": "304", "name": "PSYC304", "title": "Biological Psychology", "credits": 3, "description": "<b>Prerequisite:</b> PSYC100, BSCI170 and BSCI171; or equivalent.\n<b>Credit only granted for:</b> PSYC301 or PSYC304.\n<b>Formerly:</b> PSYC301.\nBiological Psychology is the study of the physiological basis of behavior. In this course, we will first cover the basic principles of brain organization and neural transmission. We will then introduce traditional and modern research techniques in the field of behavioral neuroscience.  The last portion of the course focuses on specific topics including psychopharmacology, learning and memory, emotion, stress, drug of abuse, neurological disorders (e.g., Alzheimer's disease and Parkinson's disease) and schizophrenia.\n<i>Restricted to PSYC (major code: 20010/2001S) students only.</i>", "is_recent": true, "geneds": null}