{"average_gpa": 3.4429768917082013, "professors": ["Charles Stangor", "Richard Yi", "Edward Bernat", "Catalina Kopetz", "Anna Sheveland", "Tracy Tomlinson", "Stephanie Ruppen", "Amanda Chicoli", "Ana Navarro Cebrian", "Amanda Chicoli", "Ana Navarro Cebrian", "Tracy Tomlinson", "Tracy Tomlinson", "Tracy Tomlinson", "Amanda Chicoli", "Ana Navarro Cebrian", "Jacob Coutts", "Jacob Coutts", "Tracy Tomlinson", "Amanda Chicoli", "Ana Navarro Cebrian", "Jacob Coutts"], "reviews": [{"professor": "Charles Stangor", "course": "PSYC300", "review": "stangor is NOT as bad as everyone makes him out to be. there are a bunch of small things to boost your grade (weekly lab activities, weekly 5 Q quizzes, extra credit). project 1 was annoying and time consuming but not impossible. project 2 is a group project where you create a replicated experiment and do a quick 5 min presentation (wasnt bad). FOLLOW APA TO THE LETTER. you lose a ton of points if you screw up apa format. lecture slides are posted and all material comes from his textbook. hes a good professor and knows the material really well. I asked some Qs after class and he was very helpful. he tried to get to know the students, he knows a bunch of peoples names.  overall not a bad class.", "rating": 4, "expected_grade": "B", "created": "2012-12-09T17:46:00Z"}, {"professor": "Charles Stangor", "course": "PSYC300", "review": "Avoid taking this class with Stangor at all costs! The material is pretty straight forward, and I am a straight A student. However, the class is extremely unorganized and Stangor's assignment of grades is completely irrational and unfair. Example: I got a C on the first research paper - when the TA gave our papers back, he said: \"If you followed the textbook guidelines for APA format, then you definitely got a lot of points deducted.\" STANGOR wrote the textbook! So basically, if you take this class, I'm just warning you that you will likely be held accountable for the misprinted information in a textbook that you were required to buy, and that the professor wrote. Stangor also uses class time extremely inefficiently and is extremely unresponsive to student concerns. Take my advice, DO NOT TAKE THIS CLASS WITH STANGOR- literally the worst teacher I've ever had in ANY course, not just psychology.", "rating": 1, "expected_grade": "", "created": "2012-05-19T19:27:00Z"}, {"professor": "Charles Stangor", "course": "PSYC300", "review": "he is an idiot!!!!! do not take this class with him. its boring and dry enough without having a dumb professor. he has no clue what he's doing, he thinks he knows everything, he doesn't know how to answer questions and its just so frustrating to sit in his class. so not worth it.", "rating": 1, "expected_grade": "", "created": "2012-04-30T14:52:00Z"}, {"professor": "Charles Stangor", "course": "PSYC300", "review": "The worst professor I have ever had. Confusing, disorganized, vague (especially on exams). Always seems to be making up assignments as he goes along. You can't win. Wait to take this course form someone else.", "rating": 1, "expected_grade": "B", "created": "2010-12-20T15:48:00Z"}, {"professor": "Tracy Tomlinson", "course": "PSYC300", "review": "I had her for PSYC200 and thought she was a good teacher there, but getting to PSYC300 it was substantially worse. The material is dry and the course moves so slowly, she spends half the time repeating information from the last class but she doesn't explain things well so it doesn't lead to a better understanding at all. The lab is frustrating, my section stayed the entire 2 hours every time just going over the things we went over twice already in class but other sections were only there for half an hour. The homework assignments are also extremely unclear, especially as it got to the end of the semester, the syllabus was not helpful so it was just having to check ELMS every week to see what was due. Very dull class that does not need to be 4 credits. I would suggest trying to take it with the other professor.", "rating": 2, "expected_grade": "A", "created": "2018-05-01T15:41:22Z"}, {"professor": "Edward Bernat", "course": "PSYC300", "review": "What a cutie, can’t get enough of him. His pony tail is very adorable. He uses multiple slide shows instead of using one, which is strange. But it works. ", "rating": 5, "expected_grade": "A-", "created": "2018-09-05T15:24:52Z"}, {"professor": "Tracy Tomlinson", "course": "PSYC300", "review": "Poor research examples for students to conceptualize the larger concepts. Prof. Tomlinson is condescending and giving lectures seems like a chore for her.", "rating": 1, "expected_grade": "", "created": "2021-03-07T06:00:34Z"}, {"professor": "Tracy Tomlinson", "course": "PSYC300", "review": "I have heard of people who are not huge fans of Tomlinson as a professor. Personally, I think she is fine. Nothing stands out about her (positively or negatively). I personally preferred her in PSYC300 to PSYC200. Although there is a relatively heavy workload (it is a 4 credit course), it has been easy to get good grades in this course. Exams are straight forward, labs are easy if you attend, and attendance is mandatory. Overall, she is a very standard professor. She cares about her students, has passion for the class, and does not give extremely challenging work. ", "rating": 4, "expected_grade": "A+", "created": "2022-04-20T02:19:32Z"}, {"professor": "Tracy Tomlinson", "course": "PSYC300", "review": "This class is extremely hard and a lot of work, most of which consists of the weekly apa reports. I really was not a huge fan of Dr. Tomlinson when taking 200 but I much preferred her this semester. The 8am class is still brutal, but she makes an immense amount of effort to not only make sure her students understand the material, but are also well prepared way after taking her class. The sheer amount of topics that I can add to my CV after taking this class is seriously insane and even though I may not have wanted to wake up and go to class everyday, I am very grateful for what this class was able to provide me. As long as you put in the work and manage your time it really is not that bad. ", "rating": 4, "expected_grade": "A", "created": "2022-05-14T20:02:43Z"}, {"professor": "Tracy Tomlinson", "course": "PSYC300", "review": "If you have to take psyc 300 take it with any other professor that offers it. Literally anyone! Dr. T is very educated in her field and passionate about research, but she is extremely difficult to work with. She is inconsiderate of the lives and struggles of her students. I wish I never took the class with her, and am glad I passed the course for the sole reason of never having to take a psych class with her again.  ", "rating": 1, "expected_grade": "A-", "created": "2022-05-18T15:24:45Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "Dr. Chicoli has VERY HIGH expectations of her students. The class content is excessive, even for a 4-credit course, and will easily require 5-6+ hours outside of class per week. Dr. Chicoli does little to help students through this process and often makes things more difficult with publishing graded assignments day-of to complete. Dr. Chicoli is also extremely inflexible and condescending for extensions or absences. Anytime I needed an extension, I felt belittled and upset after talking with her. I would not recommend taking this professor.", "rating": 2, "expected_grade": "A-", "created": "2022-12-04T14:52:26.623968Z"}, {"professor": "Tracy Tomlinson", "course": "PSYC300", "review": "I had her for PSYC200 and now for PSYC300 and found her classes to be so enjoyable and enriching. Yes, PSYC300 is a lot of work, but it is that way regardless of the professor you have. It's a 4 credit lab class that focuses on research methods, of course there's going to be a little learning curve and work might take longer than expected sometimes. Dr. Tomlinson makes it manageable, though. We had a lot of amazing TAs as well, and altogether the class was much better than I thought it would be. She makes you do some certificates throughout the course, and while they may take some extra time, they are extremely beneficial to have professionally. The actual lectures are engaging, and she takes her time going through course content. I've emailed her and TAs throughout the semester, and they all seem to respond in a timely (1-2 days) manner. When reading reviews about Dr. Tomlinson I would urge you to consider that the actual class/class content (PSYC200/300) is a difficult and demanding one, and that much of that is not Dr. Tomlison's fault. Overall, all of my and my friends' interactions with Dr. Tomlinson have been pleasant, and I think she is truly one of the better psychology professors and an excellent lecturer. You learn so much about research methods, ethics, the scientific method, and design your own research throughout the semester, which makes the whole thing pretty new and exciting.", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T00:42:54.622493Z"}, {"professor": "Tracy Tomlinson", "course": "PSYC300", "review": "This professor isn't as bad as I once thought she was. Like what some of the reviews say, I originally thought that she was inconsiderate and doesn't really care about her students. However, I came to realize that its the opposite. Yes, the class has a lot of work and you will always have some sort of paper to write every week. Yes, the start times are really crappy. And yes, sometimes the content can be really boring to listen. However, Dr. Tomlinson is actually aware of these problems and is always asking for student feedback to make the course better. She understands that the class is a lot of work and was asking students on ways to improve it. She even said it herself that noy many people enjoy taking a research lab course and that the lecture times are awful. I recall her saying that if she could change them to a different time, she would. Also, I'm pretty sure that the amount of work she gives out for the class isn't even her doing as well. I'm pretty sure its the Psych Departments idea and this is like the standard PSYC300 cirriculum. (I know that other PSYC300 professors give out very similar work with a similar workload but I could be wrong about it being the departments fault).  I feel like she really takes the time to help address the problems that her students have and try to make the course as interesting and engaging as possible. The research examples that she use in her lecture are pretty interesting and easy to understand.  She really cares about her students and wants all of them to succeed. The assignments she gives out aren't hard but they are time consuming. If you ever need help, she will try her best to do so. For exams, she creates a practice quiz, offers a review session, and there is a discussion board where people can ask questions about the exam. She even adds extra credit to the exams and I believe she sometimes gives students points back on an exam on a question that almost everyone got wrong. She's a great professor and really isn't as bad as people think. I really recommend that you give it a shot with her class.", "rating": 5, "expected_grade": "", "created": "2023-05-22T15:42:45.494490Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "One of the most considerate and accommodating professors I have ever had. Dr. Chicoli always went out of her way to make sure students felt comfortable and never said no when I needed an accommodation. I will say, however, her one flaw was that she took an incredibly long time to grade assignments (some times assignments that we needed feedback for before beginning the next one). There definitely is a lot of work in this class, but Dr. Chicoli makes it very manageable by breaking things down into smaller steps, and allowing rough drafts for ever assignment that are graded on completion.", "rating": 5, "expected_grade": "A", "created": "2023-11-05T22:01:40.753152Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "Dr. Chicoli is an interesting professor in my opinion. Surprisingly I have now reached the end of the semester and had a grade that I am satisfied with and think reflects the amount of effort that I put into this class, but my god I put too much effort into this class. If you aren't fond of scientific writing or someone who is more of a typical narrative writer then this class will be your hell. Never in my life have I been so tired all the time of doing the same repetitive boring crap every week and honestly feeling no satisfaction at all from doing work. It's busy work that requires too much effort and I think if they wanted students to care more about the content of this class they would stop drowning them in 20 hours of work a week for this class. I put effort in to get my grade by the end of the semester and didn't care about how any of my research studies or experiments went, I just wanted the grade so I could stop suffering and move on with my day. Lectures are ok, but she goes a little too quick for my liking and makes collecting notes hard because her lectures repeat a lot of the same content and the overlap gets super confusing. One week I'm doing and observational survey and then the next week I am flipping that empirical paper into an experimental design. The class is messy and super overwhelming if you have to take this class I recommend taking a light semester around this class or you will suffer. I literally had to type an essay over Thanksgiving Break, that's how much work this class is. Otherwise, Chicoli not a terrible professor, I just think the course needs to be organized a lot better and directions need to be super clear, I know were are adults but we can read minds so send an announcement out every once and a while to clear up what the plan for that week is because this class has way too much content for such a small period.", "rating": 3, "expected_grade": "A-", "created": "2023-11-20T18:35:21.753524Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "Dr. Chicoli was very passionate about what she taught but it translated to her students weirdly. She was VERY VERY accomadating but the class itself was extremely boring (which there isnt much to do about when its a psyc requirement). Because she was so accomadating and this class was a requirement I gave her four stars, but I did not love her as a teacher. She was very all over the place and did not focus on one thing at a time.", "rating": 4, "expected_grade": "A-", "created": "2023-12-06T21:01:23.871816Z"}, {"professor": "Jacob Coutts", "course": "PSYC300", "review": "Literally one of the best professors I've had so far at UMD. I've never felt the need to write a review about a professor on here until now. I took his class virtual, but I can tell that he is super understanding and actually cares about his students. He's always willing to help and if you can take PSYC300 with any professor, take it with Dr. Coutts.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T23:52:41.198713Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "The workload for this class is manageable but very difficult to improve on if connecting to other assignments. Feedback for draft assignments are never released until after the final draft was already do. I still do not have most of my grades back on assignments from over a month and a half ago and it is currently finals week. I have no idea where I am at in the class since I do not have most of my grades back. Lecture slides are extremely hard to follow. Slides on average have 60 slides posted filled with repetitive examples or duplicate slides my notes consist of 3-4 pages of relevant information even though the slides are much longer. Overall, the class is interesting but very hard to follow Dr. Chicoli's teaching methods and slides while also trying to understand where you are in the class.", "rating": 1, "expected_grade": "B+", "created": "2023-12-12T22:37:04.260454Z"}, {"professor": "Jacob Coutts", "course": "PSYC300", "review": "I don't see any reviews for Dr. Coutts so I thought I'd start it off. If you have to take PSYC300, please take his class! Dr. Coutts is such an amazing professor. He is passionate and truly cares for each and every student. His personality makes students feel comfortable and he is very receptive if a student is struggling with the material or in general. During my time at UMD, I've never had a professor quite like him and he has made this semester very memorable. Just take his class - you won't regret it!", "rating": 5, "expected_grade": "A", "created": "2023-12-13T03:33:46.685480Z"}, {"professor": "Jacob Coutts", "course": "PSYC300", "review": "PSYC300 has a reputation as a moderately hard and workload intense course. Dr. Coutts did his best to lessen how much work we had to do. His lectures were interesting and there were only 14 in the entire course, almost all are around 40 minutes each. We got lots of drops for papers, he gave lots of opportunities for extra credit, and made the lab not too difficult. The use of R in this course is minimal, and he provides tutorials that make it very easy to learn. One of the best UMD professors I have had, and certainly the best psyc professor. If you can take PSYC300 with him, do it.", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T01:52:18.409293Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "This professor definitely cares a lot about psychology and research, so it's nice to have someone passionate about the subject, but otherwise I didn't like this class at all. It was so much work, and I recognize it's a 4-credit class but I still did probably twice as much for this class as any other class. There were reports due weekly that took a lot of time, and were graded harshly, but also not graded for so long. Sometimes we would do drafts and not get feedback on those drafts until a couple hours before the final draft was due which isn't that helpful. Additionally she's kind of condescending and just seems like excited to answer questions but then disappointed that we didn't already know the answer, if that makes sense. Also I turned in a report 5 minutes late and a month later when it was finally graded I got 10% taken off of it which like it's technically fair because it's in the syllabus but come on.", "rating": 3, "expected_grade": "B+", "created": "2023-12-16T23:37:22.564417Z"}, {"professor": "Ana Navarro Cebrian", "course": "PSYC300", "review": "Compared to NEUR200, PSYC300 was pretty much disastrous. Exam questions were super confusing and often unclear. The final exam is fairly cumulative despite her saying no exams would be cumulative. The good thing is that she's very responsive to feedback. The third exam was a complete disaster and points were awarded right after the exam, not to mention extra credit on top of that. She's a good lecturer, but sometimes can be unclear. Some of her slides have errors and she doesn't post lectures (she did but for some reason they all disappeared...?), and she adds more details in lectures. The exams were just poorly written.", "rating": 3, "expected_grade": "A", "created": "2023-12-17T03:05:33.567930Z"}, {"professor": "Ana Navarro Cebrian", "course": "PSYC300", "review": "Compared to NEUR200, PSYC300 was pretty much disastrous. Exam questions were super confusing and often unclear. The final exam is fairly cumulative despite her saying no exams would be cumulative. The good thing is that she's very responsive to feedback. The third exam was a complete disaster and points were awarded right after the exam, not to mention extra credit on top of that. She's a good lecturer, but sometimes can be unclear. Some of her slides have errors and she doesn't post lectures (she did but for some reason they all disappeared...?), and she adds more details in lectures. The exams were just poorly written.", "rating": 3, "expected_grade": "A", "created": "2023-12-17T03:08:09.082933Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "genuinely kind of insufferable? didn’t seem like a particularly bad person but came across as kind of condescending on occasion when i’d go to her for accommodation things. an okay lecturer - i’ll be honest i didn’t make more lectures than i did because the class already had a frankly egregious course load and i got into the habit of just skimming the recordings she would post. pretty awful course structure but definitely not undoable. just make sure you’re allocating the necessary amount of time for this class", "rating": 3, "expected_grade": "A-", "created": "2023-12-30T17:25:54.767830Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "The structure of PSYC300 this semester felt very disorganized between lecture and lab. Lectures would try to match lab content but often did not follow a logical flow (sometimes we'd jump back to old content for an entire lecture out of nowhere, then jump back to the actual lab content the next lecture which became very confusing). My TA while sweet seemed to be just as unsure what we should be doing in our assignments as we were. I was lucky to have a section later on in the week but other students I met with earlier sections would mention that at points labs would do activities on topics that would not be introduced in lecture until later in the week. I received contradictory information from my professor and my TA on multiple occasions and had to put extra effort into communicating with both to make sure I wasn't being told the wrong thing. Although my personal experience with this class was frustrating-- Professor Chicoli is a good lecturer, and I will say that she was very accommodating to the unfortunate loss we had this semester and some of the changes she made to the schedule to accommodate may have been a cause for some of this disorganized feeling. \r\n\r\nBesides the lack of organization which may have just been semester-specific; Grading in this class would take excessively long, which is an inconvenience for some assignments but genuinely a problem for research papers, where the course is designed to have students make a rough draft and update it through the feedback they receive. \r\n\r\nUnfortunately, this class felt much harder than it had to be considering the actual content of the course was not that advanced.", "rating": 2, "expected_grade": "A-", "created": "2024-01-11T03:52:13.057951Z"}], "department": "PSYC", "course_number": "300", "name": "PSYC300", "title": "Research Methods in Psychology Laboratory", "credits": 4, "description": "<b>Prerequisite:</b> PSYC200.\n<b>Restriction:</b> Must be in Psychology program.\nA general introduction and overview to the fundamental theoretical, conceptual, and practical issues in psychological research in both the laboratory and the field.\n<i>Click here for course syllabus.</i>", "is_recent": true, "geneds": null}