{"average_gpa": 3.3664399999999994, "professors": ["Nazish Salahuddin", "Elizabeth Sauber", "Sarah Piontkowski", "Aylin Kaya", "Jennifer Brady", "Monica Kearney", "Monica Kearney", "Monica Kearney", "Monica Kearney", "Monica Kearney", "Monica Kearney", "Monica Kearney"], "reviews": [{"professor": "Nazish Salahuddin", "course": "PSYC336", "review": "Love Dr. Naz! Recommend taking this class as an upper level elective (i'm not a psych major but made friends in the class who were psych majors so i could study with them)\n\r\nmake sure you attend lectures to take notes as the exams are almost all solely based on lecture material. They are multiple choice exams but can get tricky so make sure you study\n\r\nAn A in the class is very doable", "rating": 5, "expected_grade": "A", "created": "2014-01-16T04:57:00Z"}, {"professor": "Nazish Salahuddin", "course": "PSYC336", "review": "course material is dry at beginning of the semester, similar topics as social psych so it was boring. 2nd half of the semester was much more interesting. we had SARPP presentations (google them immediately if you havent heard of them). \n\r\noverall a good class, she is open to student concerns and is the material is not hard. tests were tricky because she asks very open ended questions, that combined with multiple choice didnt make test Qs easy. discussion board posts are easy (5 of them). papers (2 pages each, 4 of them) were easy. 1 group presentation, wasnt hard.\n\r\nclass discussions (when they occurred, like 5 times this semester unfortunately...) were interesting. lecture was informative. i think this was an off semester for her but i would definitely recommend her!!", "rating": 4, "expected_grade": "B", "created": "2012-05-21T02:01:00Z"}, {"professor": "Nazish Salahuddin", "course": "PSYC336", "review": "As another reviewer says, psyc336 can be incredibly raw. The only thing I disliked about this class is that Naz was too nice when these topics came up and asshole men in the class decided it would be a good time to say how Disney princesses *should* be drawn the way they are, and even harder things like overt victim-blaming.", "rating": 5, "expected_grade": "A", "created": "2012-05-11T20:16:00Z"}, {"professor": "Nazish Salahuddin", "course": "PSYC336", "review": "TAKE THIS CLASS.\r\nbest teacher\r\ninteresting subject\r\ninvolves students in interesting discussions\r\ngives good notes\r\ntests coordinate properly with what she teaches\r\nnot hard material", "rating": 5, "expected_grade": "A", "created": "2012-02-08T00:41:00Z"}, {"professor": "Nazish Salahuddin", "course": "PSYC336", "review": "Overall the course is very interesting and can be a very good application of other psych classes information, most notably psyc221.\r\nBut, I will give a word of warning, a majority of this classes material is not easy to swallow and is depressing. You will spend around 50% of the semester learning about how the media, culture, domestic violence, sexual abuse, and rape, are all very serious problems affecting women. \r\nHowever, that being said, I will admittedly say that this class is not difficult. In fact the average grade is an A-. So, if you need a relaxed upper level elective or a diversity credit, go for it. ", "rating": 5, "expected_grade": "A", "created": "2011-12-19T17:32:00Z"}, {"professor": "Nazish Salahuddin", "course": "PSYC336", "review": "This class is awesome. I will definitely suggest that all psyc majors and all wmst majors take this. Naz is awesome and great to talk to. If you ever have any problems with any of your grades like on an exam or on any of the papers just go talk to her about it, she really is great about speaking to students. The class is also pretty straight forward. Just write exactly whats asked for the papers and you'll get full credit. The exams, just do the study guide and you'll have zero problems. Definitely a great upper level to take!", "rating": 5, "expected_grade": "A-", "created": "2011-06-01T14:30:00Z"}, {"professor": "Nazish Salahuddin", "course": "PSYC336", "review": "Love her! Dr. Naz is not only really pretty but she's also very nice and cares about her students. She encourages discussion in class and always provides us with online lectures in addition to videos to help us remember the material. She offers extra credit and her tests are straightforward. We had guest speakers as well. I think this is a good psychology course to take because it is not difficult if you study and come to class. It's also informative and you will never feel overwhelmed by the workload. Just do it!", "rating": 5, "expected_grade": "A", "created": "2010-12-25T14:02:00Z"}, {"professor": "Nazish Salahuddin", "course": "PSYC336", "review": "She's so adorable!  Her lectures are interesting and she shows really intriguing videos/clips to help further understanding of the material.  Take her for any class if you get the chance to :)", "rating": 5, "expected_grade": "B+", "created": "2010-11-30T14:54:00Z"}, {"professor": "Monica Kearney", "course": "PSYC336", "review": "Dr. K has a great personality, but she's not the best lecturer. Her slides are posted online, which I appreciate (a very skippable class, BTW). In class, she provides examples and context for her slides, but it's NBD to skip IMO. The four papers are honestly not that bad (only 2-4 pages each). What I don't like are the discussion posts. I feel like they're not very helpful or relevant. Overall, take the class if you want, but choose another psych class if you can.", "rating": 3, "expected_grade": "B-", "created": "2022-12-12T20:38:42.777970Z"}, {"professor": "Monica Kearney", "course": "PSYC336", "review": "I enjoyed her class. She is a good lecturer, and approachable out of the class room.  She will always give you an extension for work. But the work load for this class is ridiculous. I get her intentions with the assignments she gives but its TOO MUCH WORK. There is a semester long project we are assigned called the GEP. For this you pick a part of society where you believe women are misrepresented and you have to create tangible change in society. If there isn't tangible change you WILL get points taken off. How do you expect college students to create  tangible change for things like sexism in social media or unjust laws. This project takes up so much time outside of the class room. I spent about 3 HOURS EACH WEEK  on the project ( meeting with classmates, doing the assignment and trying to create tangible change). Also there is three papers. They are doable but hard. You get LITTLE GUIDANCE  even if you go to office hours. They expect the students to include a lot of information but have strict page guidelines. I did good in this class because I work really hard. Overall, take the class if you want, but choose another psych class if you can. It's not really worth all the hard work.", "rating": 2, "expected_grade": "A-", "created": "2022-12-19T18:21:59.759009Z"}, {"professor": "Monica Kearney", "course": "PSYC336", "review": "Dr. K is an engaging lecturer and understanding of personal struggles that affect academic performance. PSYC 336 is insightful into women's issues and I appreciated the intersectionality with which Dr. K. approaches all topics. The Gender Empowerment Project (GEP) is a group project and is manageable but requires advance planning and meeting with your group once a week. I would recommend leaving 11:00AM-11:50AM open in your schedule on Fridays to make it easier to meet weekly with your group. Dr. K. recommends this, but it was not announced until class started, so just something to think about in your schedule planning. Also make sure to structure your three critical thinking papers according to the rubric i.e., a paragraph per rubric section. I made the mistake not to in one paper, and lost 15+ points for that paper because of the lack of clarity and thorough discussion. I highly recommend Dr. K. and the class; I found all the material to be worthwhile to my study of psychology and my everyday life.", "rating": 4, "expected_grade": "A", "created": "2023-05-19T13:30:36.569813Z"}, {"professor": "Monica Kearney", "course": "PSYC336", "review": "This class is very interesting and teaches immensely important topics, which is why I decided to take it. Dr. Kearney is a very understanding and kind professor whom I had no issues with. The reason this course is so awful is because of the TA's and their incredibly unfair grading. I thought people were exaggerating it from previous reviews but taking this class has made me realize how awful it actually is. They will take points off for genuinely any little thing that they possibly can, even if you ask them during class if what you are writing is correct. They gave people B's and C's on a paper that was suppose to be written about THEMSELVES, which I find absolutely insane because why are you taking so many points off for a paper about culture and our personal identities? It also took the TA's 2 months to grade a 3-4 page paper just for them to absolutely crap on everyone's paper worse than the first. The grades people have been receiving is an utter reflection of how poorly this course sets you up for success. Points in this class are already so low, which means when the TA's take off even 3 points from an assignment, that determines whether you get an A or a B- on it. Major changes need to be made for this course structure because I am absolutely saddened that it was not as enjoyable as it could have been. The course material and teachings are extremely important but this class is ruined by its structure.", "rating": 2, "expected_grade": "A-", "created": "2023-12-11T02:59:06.982784Z"}, {"professor": "Monica Kearney", "course": "PSYC336", "review": "I have mixed feelings about this professor and this class. Kearney was kind, passionate, and energetic. The lectures weren't bad but some of the discussions were too long for the material given the class was only 50 minutes. The assignments were kinda aggravating. I love that she wanted to do a real life engaging project. There's one large group project in which you have to show tangible change. The concept is great but it was stressful at times because the check ins required a lot in a short period of time. I found the project to be less enjoyable because it was stressful to keep up with. The grading was super harsh and nitpicky for the content.", "rating": 3, "expected_grade": "A", "created": "2024-01-02T05:12:17.013113Z"}], "department": "PSYC", "course_number": "336", "name": "PSYC336", "title": "Psychology of Women", "credits": 3, "description": "<b>Prerequisite:</b> PSYC100.\n<b>Cross-listed with:</b> WGSS336.\n<b>Credit only granted for:</b> PSYC336, WMST336 or WGSS 336.\n<b>Formerly:</b> WMST336.\nA study of the biology, life span development, socialization, personality, mental health, and special issues of women.\n<i>Students will be expected to meet face-to-face during class time to complete small groupwork on 5-6 Fridays during the semester.</i>\n<i>Click here for course syllabus.</i>", "is_recent": true, "geneds": null}