{"average_gpa": 3.1822297893807545, "professors": ["Dylan Selterman", "Jennifer Wessel", "Ryan Curtis", "Dirk Parham", "Meg O'Neill", "Charles Stangor", "Rachel Venaglia", "Nadya Teneva", "Linda Zou", "Colleen Kase", "Joshua Ryan", "Adam Factor", "Dirk Parham", "Dylan Selterman", "Molly Ellenberg", "Abigail Nicolas", "Dirk Parham", "Rachel Vandaalen", "Abigail Nicolas", "Linda Zou", "Dirk Parham", "Dirk Parham", "Fanita Tyrell", "Yi Wei", "Dirk Parham", "Abigail Nicolas", "Dirk Parham", "Joseph Barnet", "Joseph Barnet", "Linda Zou", "Abigail Nicolas", "Dirk Parham", "Joseph Barnet"], "reviews": [{"professor": "Charles Stangor", "course": "PSYC221", "review": "Stangor is kind of a weirdo. He's very dry humored and doesn't get very involved with his students. He's weird about answering questions. He's REALLY smart, though and extremely involved in the field. He writes his own books for his classes and they're pretty well-written and definitely prepare you for the exams. I feel like this class could have been more interesting but he made it boring. Not a BAD professor, just.... \"different.\" Exams are tough but fair. Stangor makes sure every question is fair and well written. He curves the test or takes out questions if he feels like he didn't word them well enough or if EVERYONE got one wrong. He's a TOUGH grader when it comes to research reports but I have to say I learned a lot through him.", "rating": 4, "expected_grade": "A", "created": "2011-11-07T09:17:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "The material in the class was very interesting, but Stangor was not very engaging. His teaching style is very convoluted, and his textbook was confusing (even though it was free).\n\r\nSo, take this class. But wait for another professor. ", "rating": 2, "expected_grade": "A-", "created": "2011-08-04T21:35:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Let me just say this class was horrible. It seemed decent at first because of the way the class was set up - exams multiple choice, two papers, and extra credit opportunity and the material seemed somewhat interesting. However, the grading and expectations by Stango and the TA's was so ridiculous I could not believe this was a 200 level class. It was extremely frustrating to have A's in 300 and 400 level classes and put in so much time and effort into the class only to receive D's on all my assignments. Since the class was doing so horrible he gave us the opportunity to rewrite our first paper and drop the lowest test grade (which did not help much thanks to the vagueness and horrible grading of assignments and lectures). Also when I approached the TA's about my paper that was extremely well written, concise, well supported, and included all areas of the paper all they could tell that it did not address topics that were not even mentioned in the rubric. Lesson be learned: DO NOT TAKE THIS CLASS. ", "rating": 1, "expected_grade": "", "created": "2011-07-01T11:15:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "I don't even know where to start with Stangor. I'm a psych major and in ALL of my other psych classes I've recieved A+ but somehow through this class I got a C. I studied and wrote and reworte my papers and still coudn't get above a C on anything. Luckily I did the extra credit which helped my grade SOME but not enough to get me a B. So my advice would be to avoid Stangor at ALL COSTS. This class material is very interesting but I hated the class and getting a C when I'm an A student does not sit well with me. I agree with the other posters that he's very vague and often doesn't answer questions completly or even the answer you were looking for. I thought I could take this class and follow the rubric and be fine but that isn't the case. If you have a photographic memory and can regurgitate everything Stangor says then you'll be fine. This is in NO WAY an easy class which really stinks because it could've been so great. DO YOURSELF A FAVOR AND TAKE THIS CLASS WITH SOMEONE ELSE.", "rating": 1, "expected_grade": "C", "created": "2011-06-01T12:52:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Too many haters right now. Maybe Stangor changed his teaching habits recently but I thought he was a very smart teacher, very accommodating to student needs but a bit unorganized. His exams were real easy and he even dropped one of the exam grades along with adding an extra credit online activity.  He did everything he could to help his students get an A.\n\r\nYou don't really need to go to lecture because he wrote the book he used so everything is out of there.  If you were to study strictly the vocab out of the book (which he encourages) you could manage a B on every exam. So anything beyond that and you are sitting pretty for a high B or A.\n\r\nHis paper grading is real harsh but he offers a re-write where you can get points back.\n\r\nThere are a lot of haters, but Stangor is a smart professor that knows his stuff.  His lectures are usually not that bad either and his exams, at least when I took him, were simple.", "rating": 4, "expected_grade": "A", "created": "2011-05-23T15:55:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "He is not at all a clear teacher. The notes he gives in class are very vague, leading you to believe the exams will be as well, which affects how you study. Instead they were all specific, which easily threw off my grade (though admittedly I'm sure there were some students who still did well). The papers are also graded very harshly, as many of my peers showed proficient knowledge of the topics covered but still received low grades. Avoid this professor. PLEASE!", "rating": 1, "expected_grade": "C", "created": "2011-05-17T14:03:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Straight to the point: Stangor is terrible. Grades are extremely unfair.\n\r\nMy biggest problem was with how he and his TAs grade. They take off significant points for grammar, even if the grammar mistakes do not detract from the overall meaning of your work. The most ironic thing is that Stangor's book and his tests are SO full of typos and grammatical errors!\n\r\nAfter we got our first paper grades back you could literally feel the tension in the class because people were so pissed off. It doesn't matter how well you understand the material and how well you describe it. If you do not say EXACTLY what Stangor happens to have in his head you will get points off.\n\r\nThere are rules for his papers about how certain paragraphs cannot be longer than \"x\" number of sentences. Yet you can write the max number of sentences and get marked off for \"not enough information.\"\n\r\nI got a 100% on an online assignment, then wrote a paper which for part of it asked the exact same questions as the online assignment, so I wrote the same answers. Yet I got those same questions marked wrong on the paper that I had gotten right on the online assignment. Other people had this same problem. Stangor explained to the class that just because you get 100% on the online assignment doesn't mean those answers will be correct on the paper. What?!\n\r\nStangor thinks very highly of himself. He doesn't listen to students' questions during lecture and routine cuts them off to answer what he THINKS they are about to ask. \n\r\nExpect to write a great paper and then get it back with a C+.\n\r\nGreat material, very interesting class. DO NOT TAKE 221 WITH STANGOR! OR ANY CLASS WITH HIM!", "rating": 1, "expected_grade": "", "created": "2011-05-15T23:11:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "At first the class seemed very interesting. Stangor started the first few lectures on interpersonal relationships, I found it one of the more interesting topics of the class. The material that the class covers is interesting. However, it is very frustrating that Stangor lets his TA's run the class and hardly has (if any at all) anything to do with the grading. They grade the papers solely based on grammar so if you take this class, make sure your paper has flawless grammar, punctuation and the exact number or required sentences. I would recommend that you find PSYC221 with another professor.", "rating": 2, "expected_grade": "B", "created": "2011-05-06T13:13:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "If there has been one thing I could go back about college so far, it would be this class. If you care about your grades and want to take good classes...DO NOT TAKE THIS CLASS WITH STANGOR. Wait until another teacher is teaching it.\n\r\nI spend countless hours studying for this class and get mediocre grades. The online assignments are graded extremely harshly and it is very hard to get a good grade on them. It's hard to know what is going to be on the tests because he doesn't let you know. The papers are graded terribly and no one does well on them. They're pretty much just a big waste of time.\n\r\nOverall, Stangor knows what he's talking about but he's a terrible teacher. His textbook isn't grammatically correct and is agonizing to read. And lectures aren't much better. Sometimes I walk out not having learned a thing. DON'T TAKE STANGOR.", "rating": 1, "expected_grade": "", "created": "2011-04-26T02:53:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Stangor's really boring. His lectures are mind-numbing and he's not exactly what you'd call an engaging speaker.\n\r\nThe exams are designed haphazardly so it's difficult to predict what they're going to test, and the only source of informations aside from lecture is his horrible, horrible unedited textbook, which you can only get online. They're the kind of tests that you're likely to get a B on unless you've committed his (horrible, horrible) textbook to memory.\n\r\nThere are two very long papers that you have to write for the class. The guidelines are unnaturally specific and the grading is very harsh (and often wrong, but I suppose that's a problem for the TAs). I suppose they're intended to teach you how to write professionally, but they fail in spectacular fashion. These time-consuming wastes essential consist of reviewing psychology papers.\n\r\nIn addition to the papers, there are three exams, a final, and six online assignments (of which he counts the highest five). Grading is pretty inconsistent (and wrong again) across all of these, but I suppose that's another TA problem.\n\r\nStangor's a bad teacher and his class is an exercise in maximizing workload while limiting learning. Don't take him.", "rating": 1, "expected_grade": "B", "created": "2011-04-25T20:31:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "DO NOT TAKE A CLASS WITH DR. STANGOR!!!!!\n\r\nI am a psychology major and just being in this class makes me hate psychology more and more every day. He mumbles and clears his throat after every other word. Maybe know knows what he is talking about but he just can not get it out, and it takes him more than 45 minutes to even get a point across.\n\r\nHe is the harshest grader I have ever come across. He uses the same grading TA every semester and if the paper does not say the exact wording that is asked of you, then points are taken off. It is impossible to get an A on the paper. The material for each exam is never ending, again it is almost impossible to do well. \n\r\nThis class is miserable and Dr. Stangor makes this easy and understandable material almost impossible to follow and he makes it extremely uninteresting. So again, DO NOT TAKE THIS CLASS WTH DR. STANGOR.", "rating": 1, "expected_grade": "C", "created": "2011-04-25T15:46:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "If you value your GPA, don't take this class with Dr. Stangor.  Hardest graded class I've ever taken in college (and I'm a Junior).  \n\r\nHe's very knowledgeable in social psychology and the material is interesting, but the assignments are graded very harshly.  They're graded almost like we're taking a graduate level class.  HELLO, THIS IS A LOWER LEVEL COURSE!", "rating": 2, "expected_grade": "", "created": "2011-04-23T14:42:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Definitely wait to take with someone else. The other 1-star/2-star reviews sum the class up well. This is by far the worst class I have ever taken. It's not difficult, but the teaching quality is horrible. ", "rating": 1, "expected_grade": "B+", "created": "2011-04-11T15:38:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "This teacher is absolutely RIDICULOUS. He's constantly vague, even when you ask direct questions. He makes a point of you participating in online discussions and when he answers questions or gives input, he gives you links to other places to find everything youself. I have no idea how many times he's said, \"It's in the syllabus, I believe,\" instead of just answering a question. He's pugnatious in emails and often comes off as rude. He has slides, but he goes too quickly. Often asks for extremely minute details from one lecture slide out of nowhere. There was literally a question on the exam where you had to fill the blanks of the missing sections of a chart he showed once in class while he rambled. More than half the class is online. Even if you read the textbook, you're grades don't improve because he tests on about 4 chapters and gives you no idea what he's going to be asking about. Way too many videos to watch that are way too long. The TA's were generally unhelpful and show up late to their office hours. I also received about a million emails from the teacher- receiving about two to three every time I log in. The class was time consuming and superfluous. I should NOT have chosen this as an elective.", "rating": 1, "expected_grade": "C", "created": "2011-04-10T02:52:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "HORRIBLE PROFESSOR!!  Very ineffective at communicating the material, and the way papers and tests are graded is absolutely ridiculous!  I'm in honors and on the first paper I got a 79%, despite following all of the instructions for the paper.  He takes off points in random areas for no reason, or is SUPER picky about things that are just unimportant.  Moral of the story -- Don't take 221 with Stangor unless you absolutely have to.", "rating": 1, "expected_grade": "", "created": "2011-04-04T16:37:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Horrible Professor. The material is actually really interesting but he is just SO BAD at teaching it. He is very disorganized and not good at explaining concepts. He doesnt give you any idea of whats on the exams and the papers are graded VERY harshly. If there is any way you can avoid taking this class you should!! ", "rating": 1, "expected_grade": "", "created": "2011-04-04T16:08:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Horribly boring, he mumbles a lot and isn't effective in getting the information across. The class is kind of a lot of work - exams, papers and many online responses. The textbook was awful but you need it. I'm sure he knows what he is talking about he is just really bad at teaching. ", "rating": 2, "expected_grade": "B", "created": "2010-12-16T22:44:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Psyc221: Do not take this class unless it is required for your major! And even then try to take it with a different professor. Stangor doesn't seem like a bad guy but he mumbles a lot and doesn't get the information across well, along with being horribly boring. The worst thing was his forcing you to pay for his illiterate, ungrammatical, and just plain bad textbook. Furthermore, he grades papers hard and takes off points for vague reasons. I definitely do NOT recommend this class.\n\r\nPsyc300: Having this guy for yet another semester illustrated his ineffectiveness at teaching even more so. For this class he also wrote his own textbook, but this one is much better and more professional than his social psych one (although very expensive). His lectures are boring but okay, the real problem is his horrible communication skills and his lack of professionalism. His tests are worded horribly and he puts in questions that aren't even in the reading. He also does not respect his students at all. Overall an okay course information wise but I would suggest trying to take the class with another professor. Also, there is a 2 hour lab besides lecture that is pretty pointless. ", "rating": 1, "expected_grade": "B", "created": "2010-11-10T18:24:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Stangor is definitely passionate about what he teaches EXCEPT he is horribly monotonous and doesnt always explain his lecture slides well. \r\nThe book is a preliminary edition which cost a pretty penny with many typos and missing figures/charts. Its quite repetitive and scattered. Its written as if you already were supposed to know certain parts because it will say as in Chapter 8 the concept of XYZ is etc etc etc. Problem is, youre reading a much earlier chapter in the book which isnt always clear. ", "rating": 3, "expected_grade": "", "created": "2010-05-20T03:14:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "This class was pretty interesting. I have no negative feelings toward this class. Here's a quick overview:\n\r\nThe class consists of 6 online assignments, 2 papers, 3 exams, and a final. Seems like a lot right? Well it is actually very manageable if you try. \n\r\nHe does 5 online assignments and then one at the end to make up for all of your lost points so as long as you get 30 points on the first 5, you'll get 50/50 on the online assignments.\n\r\nThe papers are very long, but with some effort it is not hard to attain good grades (I got As on both with some effort)\n\r\nThe exams can be kind of tricky and you really have to read and understand the material. Overall the material is not that difficult. A lot of memorization and understanding concepts which is pretty easy. \n\r\nAs far as the class itself, it can be boring at times. To me, the material was interesting so even though the class could be somewhat boring at times, I was able to pay attention. He tries to do examples of what he teaches using clickers to help you better understand the material which sometimes helps.\n\r\nOverall, if you put the effort in, you'll get the grade you want. ", "rating": 4, "expected_grade": "A", "created": "2010-05-19T00:07:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Dr. Stangor is extremely knowledgeable about the field of social psychology.\n\r\nHe wrote the textbook for the class which is extremely long, boring, and convoluted. While it may be tempting to skip lecture and just read the book since he wrote it himself, I highly recommend not doing this. The textbook is actually much, much more detailed than the lectures so you will definitely be doing yourself a favor by attending the lectures. The lectures will let you know what information you actually have to know from the book and what information you do not. \n\r\nAs long as you attend the lectures, you should have no problem with the exams. They actually get easier as the semester goes on so do not get discouraged by the first one. In addition, definitely do the homework and extra credit as they will both boost your grade. The papers are a pain to write but overall not a huge issue. \n\r\nOverall not my favorite professor in the world, but when it came down to it, he definitely taught me a lot about Social Psychology. He is big on the \"themes\" of Social Psychology so as long as you understand those, it will be easy to predict the kind of information he will ask you on exams. As long as you do your work, it will not be hard to succeed in his course.\n\r\nGood Luck!", "rating": 4, "expected_grade": "A", "created": "2010-05-12T03:34:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "An OKAY class. I always walk out from the exam thinking I did well, but I receive a C. His wording on the exams are a bit vague. Just be careful. Two papers to do. Otherwise, fairly easy class.", "rating": 3, "expected_grade": "B", "created": "2010-04-30T11:36:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "221 is an important class for learning principles about social psychology. Things that I learned in this class have come to help me in certain upper level classes.  However, the class is ALOT of work for a 200 lvl.  Some 300 in psychology where much easier.  \r\nThe papers were graded in a ridiculous way since they were looking for everyone to write more or less the same paper.  Also like others have said the multiple choices are tricky and in many situations the TA's were unsure of how to clarify the questions because even they didn't understand the questions!\n\r\nIt is true stangor is not around too much, but this didn't bother me that much.\n\r\nYou must attend lecture and read the book to do well in the class.  It wasn't fun to take, but looking back I value what I learned in the class.", "rating": 3, "expected_grade": "A", "created": "2010-04-13T22:45:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "I would not take this class with Stangor unless it is required for your major. It is a lot of work and he doesn't grade papers easily. Even if you know all the material from class and the book, he still tries to trick you with his questions on the exams. It shouldn't be too hard for anyone to get a B, but I would recommend taking this class with a different teacher.\n\r\nAlso, he wrote the book, and it is actually pretty interesting to read, but for some reason he decided not to have someone edit/proofread the book, so there are mistakes everywhere, which is pretty annoying.", "rating": 3, "expected_grade": "", "created": "2009-10-11T15:33:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "The class workload was manageable. I honestly did not find the material too interesting. He wrote the book which has several errors in it and is written strangely. ", "rating": 3, "expected_grade": "B", "created": "2009-05-30T18:22:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Prof. Stangor is obviously enthusiastic about Psyc and wants to share his knowledge.  The lectures are pretty interesting and he explains terms well and gives real-world examples which helps a lot.  However he wastes lecture time whining about people coming in late in a 450 person lecture- useless. Also uses clickers.  Extra credit is offered- not too hard to get the points you need for an A.  Weekly online assignent require work however as well as two papers.   One main negative is that he forces students to post questions on the elms Discussion Board instead of individually adressing them, but then he often does not answer the questions- even crucial ones before due dates so be warned.", "rating": 4, "expected_grade": "A", "created": "2009-05-26T22:28:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Meh, he is all right, but honestly you don't see much of him outside of lecture (and he has his head TA do a lot of the lectures anyway). Class is interesting but grading can be a little more difficult than you expect. The MC exams try to trick you by asking questions Stangor briefly mentioned in lecture, and things straight out of the book that weren't mentioned in class, so watch out. If you're really into psychology and can deal with a huge class/occasional annoying TA's, go for it cuz the material is pretty interesting. But otherwise, don't take this as an elective, it's not worth it.", "rating": 2, "expected_grade": "A", "created": "2009-05-10T13:31:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Professor Stangor is extremely enthusiastic about his lectures. You can see it on his face. At first, this had me pretty excited about this class.\n\r\nHowever, as a 450-person lecture, there are obvious problems. Stangor will often allow his TA's to run the class and not show up at all. Usually when this happens, I feel like I'm being babysat, and the truth is that it's not interesting material - that's probably why Dr. Stangor didn't show up. The book is useful, but he wrote it and it's a preliminary edition that's largely unedited, which is annoying, because the text will refer to figure # __ and the figure won't be there...\n\r\nWe also have to write two papers that are basically written for us. The topic is pre-selected, and there is a very strict rubric. \n\r\nFor Psych majors: this class is requirement, you have to take it. Read the book, study, don't skip and follow the rubric on the papers! You'll be fine :D but it does get old...", "rating": 3, "expected_grade": "A-", "created": "2009-04-29T22:58:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Stangor is never at the lecture instead he has his TA's give the lecture which is pretty much common sense. I only go to class because of the clicker points. ", "rating": 2, "expected_grade": "A", "created": "2009-04-23T22:22:00Z"}, {"professor": "Charles Stangor", "course": "PSYC221", "review": "Professor Stangor obviously knows the material really well (as he wrote the textbook) but it is hard to see that from his lectures. The textbook was definitely more valuable than lecture. Professor Stangor constantly tries to get the class to answer open ended questions which often results in never getting a direct answer. Overall, he was a decent professor and the class was fairly easy.", "rating": 4, "expected_grade": "A", "created": "2008-12-12T18:44:00Z"}, {"professor": "Ryan Curtis", "course": "PSYC221", "review": "I agree that Ryan is a good professor.  The main problem that I had with him is that he takes a LONG time to post grades.  When questioned about grades, he blames it on his TA's and has many excuses why things aren't done on time.  Also, he assigns a lot of things throughout the semester, but they aren't impossible to complete.  ", "rating": 4, "expected_grade": "B", "created": "2010-12-17T20:59:00Z"}, {"professor": "Ryan Curtis", "course": "PSYC221", "review": "Easily my favorite class, just because of the subject matter.\n\r\nBut Ryan was great!\n\r\nHe keeps the lectures interactive (he takes clicker points everyday for attendance) and interesting.\n\r\nHe loves corn dogs, snickers, and whatchamacallits.\n\r\nTests are really not that difficult if you 1) go to class and 2) pay attention in lecture and review notes.\n\r\nThree writing assignments, slightly difficult, but not impossible.  One group presentation related to the two papers you have to write, although the papers are individual assignments.\n\r\nWeekly multiple choice \"worksheets\" on Blackboard for each chapter that we focus on.  Questions can be tricky.", "rating": 4, "expected_grade": "", "created": "2010-11-20T03:05:00Z"}, {"professor": "Ryan Curtis", "course": "PSYC221", "review": "Going into this class, I thought it would be pretty boring, and I thought that the teacher might not be able to handle the class, as he was just a grad student. However, Prof. Curtis rose to the occasion, and was a very impressive speaker. He gave very accurate, concrete examples of the material we were covering. He was easy to connect with, and approachable. He was knowledgeable and professional. An all-around nice guy. The workload was decent; three exams, weekly assignments that weren't too difficult as long as you had the textbook, and a group presentation. Also, discussion attendance is taken, and that is where the group presentations are done, so you should go. A good class, and fairly easy.", "rating": 5, "expected_grade": "", "created": "2008-04-08T16:41:00Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "People have a lot of bad things to say about Selterman, I'm not sure why. Sure he's a little cocky, but he's a fine teacher, and knows what he's talking about mostly. As for the horrible blended learning assignments everyone talks about, of the 3 out of 4 I did, I got a perfect score on 2 and a couple points deducted on one for not doing hanging indentions in my bibliography. They are really not that difficult if you just make sure they are formatted perfectly. Also, exams are a little tough but he literally lets you retake them and get points back two days later, THE EXACT SAME EXAM. So don't let people scare you lol, if you do the bare minimum you will get at least an A-, and a lot of extra credit is offered.", "rating": 5, "expected_grade": "A", "created": "2016-05-12T18:21:00Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "Dr. Selterman thinks he's a good teacher, and thinks he's \"on our side.\" But really, he is so against you. He does not want to work with his students in any way. He doesn't accept late work, due dates are ridiculous, like May 1st at 12:01am instead of April 30 at 11:59. So many people in my class was confused by this and missed the deadline and he had no sympathy and didn't accept late work. Never answers emails. TA's are sarcastic and think you're dumb. He leaves everything up to his TA's including grading. All he does is walk in, lecture, walk out. Doesn't like to answer questions and almost gets offended when you ask questions. DONT TAKE THIS CLASS WHATEVER YOU DO. Also, the grading and syllabus make 0 sense. ", "rating": 1, "expected_grade": "", "created": "2016-05-05T17:04:00Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "He really isn't all that. In his syllabus he says he is really open to talking about grades but in reality he wont change a thing. There were multiple occasions that I thought a grade was unfair and yes he was open to discuss it but the whole time he was very stubborn and i knew nothing i was going to say was going to change his mind. Also he gives a few extra credit assignments and on elms they are not dated so it makes it seem like you can turn it in whenever because he also never brings them up in class but you have to look at the syllabus because it will have a due date in there. That was annoying because nobody really knew about it and ended up missing the opportunity, so read his syllabus even though its so long. Over all he isn't a bad teacher, just a pretty harsh grader and doesn't really budge when asking for a grade change.", "rating": 3, "expected_grade": "", "created": "2016-04-26T18:45:00Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "Professor Selterman is an egotistical teacher and I would not recommend his class to my worst enemy. His lecture slides are not easy to read, he cannot explain terms for his life and his exam questions, BLA essays and busywork assignments are graded unfairly and harshly. Not to mention the lack of email response, and when he finally does response, he is not helpful, in fact I was completely offended by the harsh and rude tone of the reply. Although the content covered in class is not difficult, Prof. Selterman does not explain the material very well and he always brings the lecture back upon himself. If you want to get to understand D-Money (as he calls himself) and his life experiences, then by all means this is the class for you. However, if you want to take a course that will educate you, this is NOT the course for you. In addition, there was one article in particular that he assigned for the reading that was offensive. The article was called, \"– Is There Anything Good About Men?\" Not only was this article offensive, explaining that feminism is the reason for the wage gap in America, but this article has absolutely no connection to the material learned in class. It was an article that just shows his student what a patriarchal jerk \"D-Money\" really is. Not only was this article offensive, but his \"I know better than all of you\" attitude really disabled a good learning environment throughout the class. All in all, if you want to be taught by a know it all jerk who thinks way too highly of himself, this is a class for you. ", "rating": 1, "expected_grade": "A", "created": "2015-11-23T11:12:00Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "Professor Selterman is very pretentious. Although he's nice and tries to make the lectures interesting, it was overall not a pleasant class. The Blended Learning assignments killed everyone's grade (including mine) although that is more the fault of the TA's than him (which is why I gave him three stars). They were entirely too much effort for the grades received regardless of how good the papers turned in were. As a Psychology major, I did not expect the class to be this difficult. The content was not but the way it was handled and assessed made it so. I took a 300-level psychology class last semester and was taught more about writing and APA format which makes no sense since this is basically an introductory level class. When I went to his Office Hours to request personal help on improving my Blended Learning grades, he rushed out at the end telling us he had somewhere to be…it would have been nice of him to warn us at the beginning of the hours so we would know. When I did have my one-on-one meeting with him, he did not do much to help and once again, was in a rush because he had somewhere to be.\r\nI would definitely not recommend Dr. Selterman for a GenEd class. If you want to hear about how he apparently knows everyone in the social psychology world and all of their research, this is the class for you.", "rating": 3, "expected_grade": "", "created": "2014-05-22T22:05:00Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "AWESOME PROFESSOR! I absolutely loved going to class simply because Selterman made everything so easy to understand, I'd even say it was fun! The class itself was pretty interesting.\n\r\nMy only complaint was this class was a 'Blended Learning' course. Meaning every other Friday, half of the class wouldn't come to class but have an online assignment due by Sunday and the other half would come to class and complete an assignment based off of what was discussed in class. Every Friday the groups would switch. The TA's graded the online Blended Learning assignments EXTREMELY HARSHLY! They took off a good portion of points for the littlest things such as citations and references. \n\r\nOther than the BL assignments, grading was very fair. The tests are easy if you thoroughly fill out his study guides. He gives lots of extra credit opportunities as well :)", "rating": 5, "expected_grade": "", "created": "2013-01-07T18:46:00Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "I took this class looking at the previous reviews and I wish I had dropped it during the add/drop period. Psych221 is awful Selterman just lectures to the class and the blended learning assignments are very frustrating because the TAs will randomly change the rubric without telling the students and you will get points off for no reason. Selterman does not understand that everyone in PSYC221 is NOT a psychology major, especially since it is a CORE class, not a psych major requirement class, and refuses to help students who are having difficulties with the assignments. It's almost as if he has a vendetta against non-psych majors. Don't waste your time on this class it is not worth it. Exams are fairly easy and you get a lot of extra credit opportunity but trust me it is not worth the headache. ", "rating": 1, "expected_grade": "", "created": "2012-12-23T19:42:00Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "Dr. Selterman is that young lad who worked really hard during his college years, got his doctorate and now thinks he is the infallible expert of social psychology and writing. When you talk to him there is this aura of 'I am better than you, just look at my big fancy degree'. \n\r\nHe assigns you papers and grades it as if you were writing for the Journal of Social Psychology. I am an English major and I consistently got B's on his ridiculous writing assignments. Points would be deducted for a missing comma or improper use of a colon. If I wanted to take an English class, I would have taken an english class! \n\r\nThere is also the material. It starts out very interesting until you realize your entire job in the class is to memorize definitions. To study for the final you literally just sitting down at your desk open wikipedia and your glossary and read through it until your mind is numb.\n\r\nHis exams are also the most inconsistent I have ever seen. Exam one will be a walk in the park, but all of a sudden if he thinks you're getting just a bit too smart he will write the second exam with failure in mind. It was still passable, but for an introductory, 200-level class, it was completely unfair.\n\r\nSo, if you are willing to put up with the worst possible system for grading papers, constant reading to keep up with the mountain of materials you will have to memorize and probably the most incompetent group of TAs then take Selterman, in fact, I encourage it. But if not, take Curtis....or talk to a squirrel on the mall. \n", "rating": 3, "expected_grade": "A-", "created": "2012-12-14T10:12:00Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "Awesome guy! Really interesting teacher with fun anecdotes. Very fair, gives extra credit; if you have any problems just email him and he's more than happy to help! If you go in to his office hours for help or just to chill he gives you extra credit. just saying. \n\r\nHis exams are relatively straight forward with extra credit opportunity on the exam. Exams are half multiple choice and about 6 short answer (meaning REALLY short answer. like 2-3 sentences) and doesn't usually take the whole class\n\r\nI personally never really read the book for this class; just go to lecture and make sure you listen to what he says because the stuff on the slides are just topics for most of it; he elaborates a lot more during lecture. He also does spot check participation during class...so go to lecture!", "rating": 5, "expected_grade": "A", "created": "2012-01-30T11:50:00Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "-really nice guy, definitely cares about his students' concerns\r\n-gives out many opportunities for extra credit\r\n-posts ppt slides right before the class starts\r\n-slides aren't the most helpful slides I've ever seen since they don't give as much important information compared to what he says and what the books says, so READ THE BOOK and listen to him\r\n-grades fairly; exams are fair", "rating": 5, "expected_grade": "A", "created": "2011-12-26T15:50:00Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "Dr. Selterman is the only professor I've had this semester that has been reasonable, efficient, and responsive to student concerns. Unlike many others he is actually focused on his students learning material in a way that will allow them to use it in their own lives. \n\r\nHe's pretty good with having information about assignments and grades online on time, and is more than happy to help out whether it's during office hours or not.  \n\r\nSelterman doesn't make you feel like you have to do everything perfectly--he makes it clear that so long as you work hard and put in effort, you will get a good grade, and he actually follows through with that. \n\n\r\nHe is able to admit when he makes a grading mistake and fixes it on time. \r\nClass was fun and he isn't unreasonably harsh if you need to skip a few times for legitimate reasons. \n\r\nThis class is the only one I even feel motivated to study hard for the final because I know it will pay off.\n\r\nAlso, he gives pretty good life advice", "rating": 5, "expected_grade": "A", "created": "2011-12-13T09:03:00Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "He's not understanding or ethical. You can study his ppts, but the tests are more focused on the readings. He words questions on the test alot harder than they need to be. He doesn't even go over them. Essay assignments are also graded pretty harshly. It's alot for just a 200 class. Please take Curtis if you want to take this course", "rating": 1, "expected_grade": "A", "created": "2018-08-15T13:39:07Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "Professor Selterman is a pretty solid professor. He is organized with the schedule of the material we learn and he emphasizes how he wants his class to be manageable. The only issue I had with him was his resistance to accommodate my learning differences in needing to be seated in the front. He treated my accommodation as a sort of inconvenience that wasn't really important to him. Otherwise, he's pretty easy to talk to and friendly. ", "rating": 4, "expected_grade": "B+", "created": "2018-11-24T17:52:27Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "I don't understand why a lot of people seem to hate him? His lectures were very clear and he posted recordings on them on ELMS. The readings were also pretty straightforwards, but they were also long so I used an audio app to make it read it to me while I did other stuff. The tests were okay, but for every exam other than the final, you had the chance to take it again with your notes for possible extra credit points. Speaking of which, he offers A LOT of extra credit, I finished the class with a 103 (originally a 93 before EC was added). My only complaint was that his TA was really strict with commas on writing assignments.", "rating": 5, "expected_grade": "A+", "created": "2019-01-13T02:50:05Z"}, {"professor": "Jennifer Wessel", "course": "PSYC221", "review": "She didn't require a textbook for the class and taught concepts very well. Her teaching was really thorough and easy to understand. Her exams are easy and for psyc221 it was exactly based on her guided lecture notes. She drops one grade per category including exams. I'd say she is an excellent professor.", "rating": 5, "expected_grade": "", "created": "2019-03-14T03:32:56Z"}, {"professor": "Jennifer Wessel", "course": "PSYC221", "review": "An amazing professor, definitely one of my favorites at UMD. She explains concepts in a very understandable way and is very approachable if you have questions. She does a great job at facilitating conversations in lecture and discussion. Her exams are very straightforward and if you study her guided lecture notes and do the practice problems provided, it's hard not to get a good grade.", "rating": 5, "expected_grade": "A-", "created": "2019-04-30T20:09:20Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "A really engaging professor who genuinely cares about his students! Standard lectures with powerpoints, but Professor Parham made them pretty interesting and enjoyable to attend.", "rating": 5, "expected_grade": "A", "created": "2019-12-27T16:12:35Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "This professor claims to care about his students when he really does not. He is rude and dismissive and has a huge ego. The TA's grade every paper in this class. His lectures are boring, yet you have to pay attention to get every detail for the tests because his slides have no information whatsoever. Not a terribly hard class, but if you have the option please go with another teacher. Selterman isn't worth the headache and pain of taking this class. ", "rating": 1, "expected_grade": "", "created": "2020-01-24T18:11:18Z"}, {"professor": "Linda Zou", "course": "PSYC221", "review": "Amazing professor, very kind and wants to see students succeed. She's very flexible with making things work for the class and presents information in a fun and interactive way.", "rating": 5, "expected_grade": "A", "created": "2020-03-25T18:45:36Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "Overall I disliked Selterman. His lectures all felt robotic, and he was extremely unhelpful with explaining any of the assignments for the class. He made it much more difficult then it should have been. You have to write a scientific analysis essay every other week and is graded very specifically and overall difficult to write. If it wasn't for the TA, I would've never passed this class.  I will say if you show up for class and participate with the clickers, you will get a TON of extra credit in the end that actually boosted my grade up by two letter grades. I would not recommend taking this class unless required.", "rating": 2, "expected_grade": "A", "created": "2020-04-14T16:48:10Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "I don't know why people don't like Dr. Selterman because he was super great! He was funny and very knowledgable of anything psych. The scientific analysis essays were not hard if you put in effort, start early and get help from the TAs when you need. Yes, it was a different assignment that was not like anything I've done before but if you thoroughly read the instruction, look at the sample and ask a TA to proof read it then you'll be fine. Class was also divided into two groups and each group attend discussion on alternate weeks. ", "rating": 5, "expected_grade": "A", "created": "2020-08-16T03:36:20Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "I had his class fully online, and what a ride it was. The coursework wasn't really difficult (participation questions and a weekly activity/essay), and we didn't have exams either. What sucked is that I literally didn't learn a single thing in his class, as everything he covered was material that is taught in PSYC100 or AP Psych. He has a huuuuge ego and will not respond if something questions what he is presenting (like if you were to propose a theory that contradicted his own- he would straight up pretend like you didn't type or say anything). I also noticed that he didn't really address anyone in his class who had a more complex or foreign name, which was incredibly disheartening to see. Overall I am giving two stars because the workload itself wasn't that bad and I liked his cats; he seriously needs to work on actually connecting with his students and teaching new material.", "rating": 2, "expected_grade": "A", "created": "2021-01-02T17:29:41Z"}, {"professor": "Joshua Ryan", "course": "PSYC221", "review": "Winter 221 (online). Not bad at all. A decent amount of reading, but very manageable. Options for extra credit. ", "rating": 5, "expected_grade": "A+", "created": "2021-01-23T18:49:12Z"}, {"professor": "Colleen Kase", "course": "PSYC221", "review": "absolutely amazing. extremely thorough. in general, this class is a must-take because you learn so much about life and things you never really thought needed tactic. ex: love life, studying, procrastination, etc. NOTE: lots of extra credit, online textbook,very cool teacher hehe", "rating": 5, "expected_grade": "A", "created": "2021-04-07T13:52:43Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "He is the best professor ever!! The lectures are always interesting and his main priority is for us to learn instead of forcing us to do random assignments and stress us out. The class is so chill, but enables you to get a lot out of it if you're interested. The textbook is pretty interesting too so just take notes from that and you'll be perfectly fine. He does exam reviews that are literally based on the exam so you don't have to worry about that either. Cool class and amazing professor!", "rating": 5, "expected_grade": "A+", "created": "2021-04-20T04:38:37Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "A top-notch professor who cares about students, is knowledgeable on the subject matter, and goes out of his way to help and explain things. His lectures and assignments were manageable and focused on actually help you learn the material (versus busy work). His syllabus was well outlined and he followed it pretty well, and his grades always well kept and even automatically applied the dropped material. Also, don't miss his exam reviews, he literally reviews the exact exam you will take. The only drawback I can mention is that he is very confident in his knowledge and has the occasional obscure (strange) belief; however, he does mention that he is willing to debate anything with anyone so if you are willing to take the time to talk with him this isn't an issue. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-08T19:50:43Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "Literally one of the best professors I have had. So understanding, will let you make up anything and make sure you get the best grade that you can get. You can tell that he truly cares about his students.", "rating": 5, "expected_grade": "A+", "created": "2021-05-10T16:08:45Z"}, {"professor": "Adam Factor", "course": "PSYC221", "review": "Adam is the best professor I think I've ever had! Take him if you have the option to. The way he teaches makes it so easy to learn the material and you won't struggle to take notes or do well. The midterms were online and you can take them anytime throughout the day (it is timed once you start though). The Final was easier than the midterms (and also online). Oh yeah, and your lowest exam gets dropped, so you don't have to take the final if you did well on the first two exams. The most difficult part was the writing assignments. Three 500 word essays throughout the semester and one final paper that is 4 pages. If you check all the boxes in the rubric before submitting you will do well. Expect an A if you try a little. There are weekly reading quizzes, but they are super easy and the lowest 3 get dropped. There is a lot of extra credit you can do and participation counts for a solid amount so show up and you will do well. Love Adam, you should take him.", "rating": 5, "expected_grade": "A", "created": "2021-12-17T17:23:25Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "He is a very helpful and easy going professor. He is always understanding if you communicate with him and offers more than enough help for you to succeed in the course. His reviews basically tell you everything that is going to be on the test. Beyond being a great professor he is also an amazing and friendly person. Professor Parham is more of a friend in the course than an instructor. ", "rating": 5, "expected_grade": "A+", "created": "2022-01-24T15:32:22Z"}, {"professor": "Dylan Selterman", "course": "PSYC221", "review": "Relatively easy A as long as you do all of the work and extra credit in the class, although his grading on papers is ridiculously petty. My problem is more so his attitude, as he is very arrogant and talks down to students as if they are beneath him, and he seems to dislike teaching. However, if you can deal with that, it's a simple A class. In addition, though, I would not recommend taking him if you are actually interested in learning psychology, as I didn't really gain much new psychological knowledge from this course. It felt more like busy work if anything,", "rating": 3, "expected_grade": "A+", "created": "2022-02-06T22:22:05Z"}, {"professor": "Linda Zou", "course": "PSYC221", "review": "Not my favorite professor, I felt like I taught myself a lot of this material. She kind of seems like she doesn’t know what she’s talking about. She could never answer questions students had. Nice enough and lots of extra credit but I was disappointed. ", "rating": 3, "expected_grade": "A-", "created": "2022-05-21T14:01:24Z"}, {"professor": "Linda Zou", "course": "PSYC221", "review": "Great professor. Lectures were organized and there were lots of extra credit opportunities.", "rating": 5, "expected_grade": "A+", "created": "2022-05-23T18:48:05Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Such a fun lecturer!! All of her lectures are super entertaining and engaging. Since she is young, she is able to relate with the students more easily and uses examples which are likely to pertain to us. There are three big exams and the lowest grade is dropped; there are 12 weekly quizzes and 2 are dropped. I wasn't a big fan of the discussions because of the TAs, but I wouldn't blame her for that. There is a lot of extra credit, and overall an enjoyable class.", "rating": 5, "expected_grade": "A+", "created": "2022-10-28T20:38:40.117616Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "She is the best! The lectures are so interesting and engaging, and she is an excellent teacher. She responds to emails super fast and is really flexible when it comes to late assignments. Her grading scheme is amazing- one exam is dropped! Dr. Abi is amazing!", "rating": 5, "expected_grade": "A", "created": "2022-11-30T16:37:58.756033Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Great professor. Passionate about topics and is a very good lecturer. Exams are open note and online, but pay attention because a lot of stuff from class shows up. Super flexible and helpful, responds to emails before you even close your computer. Highly recommend!", "rating": 5, "expected_grade": "", "created": "2022-12-06T16:09:33.615463Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "The lectures are usually just PowerPoints and note taking. She is very funny and relatable since she's younger. I would definitely recommend her!!", "rating": 5, "expected_grade": "A", "created": "2022-12-06T22:48:33.735331Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Dr. Abi is does a fantastic job relating content from the class to real life examples and scenarios, which makes the lectures so engaging and the content easy to remember. There are weekly virtual quizzes based off of the reading material, and three virtual exams. All of the writing assignments, quizzes, and exams are thoroughly explained and match all of the course content. Great class and amazing professor overall :) !", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T21:59:35.855867Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "She's so sweet and amazing. Love her! Take her! Her ta's are okay though..", "rating": 5, "expected_grade": "A", "created": "2022-12-12T19:21:52.619945Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "Professor Parham is awesome. His class is super easy if you keep up with the work and have a good TA (the TAs grade all the papers). The lectures aren't mandatory because he records all of them but I recommended attending simply because the guy is so interesting and he genuinely cares about your success in the course. There are weekly quizzes, 3 small papers (lowest score gets dropped- GODSEND), a 1500 word final paper, and a multiple choice midterm and final. Highly recommend taking PSYC221 with professor Parham.", "rating": 5, "expected_grade": "A", "created": "2022-12-18T01:51:34.193468Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "insanely great professor, he knows so much about psychology and is a very chill guy. there were some lecture technical difficulties on zoom but they were easy to get pass. the assignments were super easy if you go to lecture. he's also very lenient and overall great prof, take him if you can!", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T01:42:25.721783Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "I really enjoyed having this professor! She keeps lecture interesting and fun, while also covering the material in an efficient way. We get to learn a lot of course material through her personal stories, and class activities. This is an easy A class IF YOU DO ALL OF THE EXTRA CREDIT. My raw grade in the class was an 88% and with the extra credit it went up to an A+. I recommend taking the weekly quizzes seriously (reading+vocab). The writing assignments are not hard but the ta's do grade a bit strictly. All in all I highly recommend taking her class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T17:41:26.447030Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "Amazing professor. Very relatable, also there to help you, and gives you helpful feedback.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T20:00:16.458335Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "I've never met a professor who genuinely cares so much about his students. The lectures are interesting and the course work isn't so hard. \r\nTake professor Parham at any chance you get!!!!", "rating": 5, "expected_grade": "A", "created": "2022-12-21T19:07:13.558219Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "i had her fall 2022 for psyc221 & professor abi is great. she's very passionate and enthusiastic which keeps class very engaging. she is very sweet and cares about her students. the class wasn't bad at all either. we had weekly online quizzes, 3 online open note exams, and 3 written assignments. the only complaint i have is that the grading was a bit slow and class would run longer than usual. no real problems though with the class or her, she's great i loved her and chose to take another class with her this semester.", "rating": 5, "expected_grade": "A", "created": "2023-01-26T20:47:24.205015Z"}, {"professor": "Linda Zou", "course": "PSYC221", "review": "Professor Zou's lectures are engaging and organized, and she herself is very sweet. The class itself is not difficult, there are many extra credit opportunities and besides a couple of writing assignments and a final essay, the workload is light. A previous review stated that Professor Zou was not able to answer student questions, but I personally have felt my questions have been answered well. Overall a great class that is not too difficult if you're looking for something easy but interesting.", "rating": 5, "expected_grade": "A", "created": "2023-05-09T14:39:37.124104Z"}, {"professor": "Linda Zou", "course": "PSYC221", "review": "The syllabus for the class is very comprehensive; from the beginning, you'll know exactly what to expect regarding assignments. There is only one homework assignment per week (a 5-6 question quiz) on the material covered in the lecture, and during the lecture, participation is evaluated through Turning Point. There are a lot of small assignments throughout the semester, including 3 writing assignments and multiple extra credit opportunities. Both the midterm and finals are open-note and pretty easy to follow. She cares a lot about her students but appears sort of nervous and lacks the assertiveness that I think would take her teaching quality to the next level.", "rating": 4, "expected_grade": "A-", "created": "2023-05-17T00:15:43.136794Z"}, {"professor": "Linda Zou", "course": "PSYC221", "review": "Dr. Zou is a great lecturer and professor. She responds to any concerns incredibly quickly, and lectures in a way that is easy to understand and take notes on. However, her exams and quizzes, while open note, can be difficult. There are occasionally a few trick questions where either answer could be correct, and it just becomes a 50/50 guess. She does genuinely care about her students, but her UTA and GTA during Spring 2023 left a little to be desired. While there are some things that she could change to make the course better, I believe she is a great professor and a good option for anyone looking to take PSYC 221.", "rating": 4, "expected_grade": "A-", "created": "2023-05-17T00:20:37.149333Z"}, {"professor": "Fanita Tyrell", "course": "PSYC221", "review": "Dr. Tyrell is incredibly unfair, unreasonable, and unapproachable. She does not teach or communicate her expectations, yet somehow expects her students to perform at a level that is unattainable. She picks favorites, and gives those people unfair opportunities. If you're not one of her favorites, then she treats you with disrespect, and is passive aggressive. I would never take a course with this professor if you value your mental health.", "rating": 1, "expected_grade": "", "created": "2023-05-30T04:16:19.282945Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Great instructor! Loved her course and the content. Not many assignments.", "rating": 5, "expected_grade": "A+", "created": "2023-06-22T17:27:49.172099Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "The professor is a nice and considerate person. Lectures were more interesting to listen to than reading the textbook. Assignments were fairly simple except for the application assignments, where you have to apply more effort. Quizzes were easy to complete. The final paper and final exam were the only difficult aspects of the course. Overall, the course is chill. Take the course with this professor even if you are doing it as an elective.", "rating": 5, "expected_grade": "A-", "created": "2023-07-12T03:24:59.343649Z"}, {"professor": "Fanita Tyrell", "course": "PSYC221", "review": "Dr. Tyrell is a very well informed, passionate, committed, and respectful professor. I took PSYC 221 over the summer term and it was not only incredibly engaging course material, but the pacing and assignment structure was sufficiently challenging without being overwhelming. I found her approach to teaching to be very welcoming and accessible; class consisted of lecturing with open discussions and interactive activities interspersed throughout, and even in a online synchronous classroom environment she executed this very well. \r\n\r\nAs long as you prepare before class (readings, discussion boards) and engage in class (lectures, open-discussions, and activities), you will have no trouble with the quizzes and essays. \r\n\r\nClass participation is important, but as long as you make a consistent effort to contribute something (literally anything relevant to show that you are actively engaging with this material), she will appreciate it (i.e. put in real effort and your work will be recognized). Her grading is very honest and fair. \r\n\r\nI highly recommend this professor.", "rating": 5, "expected_grade": "A+", "created": "2023-07-23T13:57:41.626559Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "I've had Dr. Abi before for PSYC 100 and I can say that she is a truly engaging professor. Her course material is very manageable and she's understanding if you have a hard time meeting a deadline or have personal issues. Class attendance is not necessary to your success, but I definitely recommend it: during lecture there are clicker questions to participate in that go towards boosting your grade (definitely worth the 50 minute lecture). Overall, she does a great job and I can tell that she loves what she does. 100% recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-11-15T22:53:44.825304Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "Took this professor for PSYC100 spring of last year, and immediately enrolled for 221 with him afterwards. He's a great professor. I've never seen a teacher who genuinely seems to care more about his students' wellbeing over grades. \r\nFairly easy class! Only thing that takes some time is really the writing assignments, but those kind of depend on what TA is grading them and if you've actually put some thought into it.\r\nGreat guy - you won't regret taking a class with him.", "rating": 5, "expected_grade": "A", "created": "2023-11-19T03:41:45.478829Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "She is very engaging during lectures! Both the textbook and her lectures do an nice job of explaining material. Her TA's are helpful in office hours if you ever need to go to them. While the structure of her class might feel odd at first with various zoom calls and writing assignments, you get used to it pretty quickly. Her quizzes, writing assignments, and exams are very fair in respect to the material covered. Moreover, her policies for dropping the lowest scores for quizzes and exams, as well as providing numerous extra credit opportunities, make her class quite forgiving. Attendance is important as there is material covered outside of the textbook, but she posts lecture recordings on canvas and gives some leeway for unexcused absences.", "rating": 5, "expected_grade": "A", "created": "2023-11-29T23:02:05.535436Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Dr. Abi is amazing! She is super engaging in lecture and makes learning about the topics fun. The grading structure is odd, but it doesn't really affect anything in the long-run. There's a weekly quiz, three writing assignments (can't be longer than 500 words), three exams (highest two grades are kept), and \"discussion\" grades every other Friday where you meet on zoom with a grad TA. I'm not even a PSYC major (took this class for the gen-ed) so I didn't even purchase the book and I got an A in the class. Certainly recommend this class for everyone!", "rating": 5, "expected_grade": "A", "created": "2023-12-06T16:59:48.393273Z"}, {"professor": "Joseph Barnet", "course": "PSYC221", "review": "Enjoyed the content of this class and Dr. Barnet was very student-oriented. It seems like he really cares that you do well in his class. Content on Exams was all application based but predictable. He drops the lowest exam score so that also took a lot of stress off finals. There is some writing in this course but the essays and content were interesting and he provides a lot of resources to use as support. His lectures are almost straight out of the textbook, so both re-enforce each other. Would definitely recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T16:16:49.574653Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "PSYC221 with Dr Abi was a very enjoyable class.  For the most part lectures were in person Monday/Wednesday and online discussion every other Friday.  Lectures were interesting and Dr Abi used a lot of examples and real world connections to make the content applicable.  She does track participation with clickers but drops a few at the end of the semester.  Also you can log into the clicker without being in class in case you can't make it.  Discussion is not really skippable if you want the points but it is not that much work, also there are only 5 for the semester.  \r\nThere are 3 exams (one is the final) and one gets dropped.  They are online and are taken outside of class.  Other reviewers said the syllabus is overcomplicated - but she goes over it and it's really not that hard to understand.  There are 4 writing assignments (spaced out in the semester) which are probably the hardest part of the class but they are still not that bad.  There are weekly reading quizzes but they are also out of class and not that big of a deal.  There is also a ton of extra credit to help your grade.  \r\nOverall, Dr Abi was very kind and made PSYC221 an enjoyable course!", "rating": 5, "expected_grade": "A+", "created": "2023-12-14T19:38:05.280704Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "Very easy class but there are 3 essays + 1 long essay that take more time. He lets you redo them if you're not satisfied with your grade at the end, and there are extra credit opportunities. Professor Parham very much cares for his students and records all his lectures, which are on Zoom anyway. Definitely take him.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T16:33:54.841309Z"}, {"professor": "Dirk Parham", "course": "PSYC221", "review": "Very easy course. Lectures are on Zoom because he lives in Florida. Tests are very straightforward and he basically tells you whats on them in the lecture before the test. One of the nicest guys you'll ever meet and super engaging. It is too bad the psych department is having \"policy changes\" and he won't be teaching this course anymore. The content itself is fun, so I'd recommend taking 221 with whoever you can!", "rating": 5, "expected_grade": "A", "created": "2023-12-20T20:26:08.790127Z"}, {"professor": "Joseph Barnet", "course": "PSYC221", "review": "Joseph Barnet is the nicest professor I've ever had and he really tries to make an effort to make each student feel important. His lectures and discussions are interesting and he is extremely generous with grading. He often offers various extra credit opportunities to boost your grade and the test is always like the powerpoint notes.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T19:22:56.142248Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Dr. Nicolas made class enjoyable with her relatable remarks and recent examples. However, I felt she went into way too much detail about concepts or ideas that were minor, or not even pertinent, to the topic being taught. Dr. Nicolas also grades writing assignments harshly, but she gives extra credit opportunities for most, if not all of the exams. Exams and quizzes are open note, so it is easy to do well if writing isn't quite your thing.", "rating": 3, "expected_grade": "A", "created": "2023-12-26T04:23:40.048119Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Dr. Abi is the BEST! the class was really straight forwards and all the exams were online open note and open textbook so that was a breeze. Her lectures are actually engaging and relatable with special topics like cults or violent video games. I would recommend starting the writing assignments early because they do sneak up on you. She offers many easy opportunities for extra credit too. The only thing is you actually have to attend a certain amount of lectures because you get graded on participation using clickers. She is very nice and helpful in office hours too!", "rating": 5, "expected_grade": "A+", "created": "2024-01-05T16:58:25.458795Z"}, {"professor": "Joseph Barnet", "course": "PSYC221", "review": "He always keeps his lectures interesting. The writing portion of the class can be a little frustrating sometimes because different TAs grade it each time, so you never really know what they want since they have different expectations. He drops the lowest test grade which can also be your final. His tests are very reasonable, I usually prepare using the review slides he posts.", "rating": 4, "expected_grade": "A", "created": "2024-01-19T18:32:37.989631Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "She is such a nice professor and cares about all her students. She is an enthusiastic, funny lecturer. She has open note quizzes every week and your lowest exam grade gets dropped. She also offers extra credit opportunities.", "rating": 5, "expected_grade": "A-", "created": "2024-01-29T06:28:52.484374Z"}, {"professor": "Linda Zou", "course": "PSYC221", "review": "Easy A course if you just keep up (there's honestly not much work). Her class can be kind of boring but the content is interesting (lowkey common sense).", "rating": 5, "expected_grade": "A", "created": "2024-02-01T16:43:42.838872Z"}], "department": "PSYC", "course_number": "221", "name": "PSYC221", "title": "Social Psychology", "credits": 3, "description": "<b>Prerequisite:</b> PSYC100.\nThe influence of social factors on the individual and on interpersonal behavior. Includes topics such as conformity, attitude change, personal perception, interpersonal attraction, and group behavior.\n<i>Click here for course syllabus.</i>", "is_recent": true, "geneds": null}