{"average_gpa": 3.061301671064203, "professors": ["Susan Lee", "Nazish Salahuddin", "Meg O'Neill", "Monica Kearney", "Monica Kearney", "Monica Kearney", "Monica Kearney", "Stephanie Yee", "Stephanie Yee", "Monica Kearney", "Monica Kearney", "Monica Kearney"], "reviews": [{"professor": "Sangbok Lee", "course": "PSYC354", "review": "This is also a review for Susan Lee, who taught Cross-Cultural Psychology (PSYC354).\n\r\nI despised this class. Lecture slides are often quoted verbatim from the textbook, and they're not posted online. Tests asked incredibly arbitrary questions and were mostly a challenge to remember random facts instead of actually learning material. The papers are inconsistent -- I crapped out the first one in a few hours and got an A, but the one that I actually put time into got me a B because I didn't define enough terms that were defined within the first week of class. \n\r\nIt does fill a Diversity credit. But honestly I couldn't stand this class. ", "rating": 1, "expected_grade": "B+", "created": "2013-05-23T15:23:00Z"}, {"professor": "Sangbok Lee", "course": "PSYC354", "review": "Please note: this is a review for Susan Lee for Cross-Cultural Psychology. There appear to be multiple S. Lee's.\n\r\nI would strongly recommend against taking this class. Lectures are extraordinarily boring. While she doesn't post the slides online, they are merely poorly rehashed versions of the textbook. Tests are difficult insofar as she is a bad test writer. Often she will give points back after reviewing the scores and realizing that everyone missed multiple questions because they were worded poorly or they were not taught in class. Luckily there are two easy papers that can boost your grade (or at least that's how it worked out for me). The one merit to this class is that it's an easy way to fulfill a D CORE and one of the PSYC Theme III requirements. But if you can take something more interesting, do it.", "rating": 1, "expected_grade": "A", "created": "2012-12-21T01:02:00Z"}, {"professor": "Nazish Salahuddin", "course": "PSYC354", "review": "LOVE DR. NAZ! She is so awesome and funny and actually engages people in lecture by making it kind of discussion based, she isn't just sitting there reading info off of slides the whole time. She brings up real world topics and examples and people share their opinions while Dr. Naz shares hers too, it helps to understand certain psych concepts by relating them to real world stuff.\n\r\nYou have 1 midterm exam and 1 final. She gives you the chance to earn some points back on your midterm (super nice of her). You also have a couple papers to write, and some activities that are to be completed by the end of class time on fridays...because she doesn't make you come on friday, just the activities have to be done which is super awesome.\n\r\nWould definitely recommend this class or any class with Dr. Naz!", "rating": 5, "expected_grade": "", "created": "2016-10-19T00:07:00Z"}, {"professor": "Nazish Salahuddin", "course": "PSYC354", "review": "I've taken two classes with her and have received A's in both. Most of her classes tend to be blended learning, so we come to class on Monday and Wednesday, but only have an assignment due on Friday. Her exams were pretty straightforward, and all I did to study for them was look over the slides. She's also really approachable and understanding.", "rating": 5, "expected_grade": "A+", "created": "2018-05-17T18:05:17Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "Super easy class, and the topics are fairly interesting. There are random clicker questions and in-class work, so you have to go to class, but it's a good way to get easy points. There are only 2 exams and one paper. Overall, it's a solid choice for a class without too much work. ", "rating": 4, "expected_grade": "A+", "created": "2020-05-17T17:39:49Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "Honestly one of the best psych professors I've had, super understanding and sweet. As long as you pay attention, the course material is easy to understand. Definitely a passionate and nice professor and an easy class to pass.  ", "rating": 5, "expected_grade": "A", "created": "2020-05-23T21:08:43Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "Monica is a nice professor though I would not take another course she teaches again. Her TA's grade unnecessarily hard where this should be an easy enough course. I am a psych major and have never received any grade lower than an A- in a psych course besides this one.  Along with this be ready for loads of busy work and useless discussion posts every week that do not help with understanding the course concepts at all. I would not recommend taking this class unless you enjoy pointless work and hard grading for no reason at all. ", "rating": 2, "expected_grade": "B-", "created": "2021-05-03T14:25:28Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "One of the nicest and most understanding professors I've had. The workload was really fair and the assignments were pretty easy. The lectures were also super interesting. Maybe I just had a different experience than the other reviewer here, but the TAs that graded my assignments seemed pretty lenient and the averages for all of them were around 90%. If you felt that something was graded unfairly, she was also very open to regrades.", "rating": 5, "expected_grade": "", "created": "2021-05-06T01:46:14Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "Dr. Kearney is the coolest professor I've ever had. She says it how it is, is so real, lets everyone say how they feel, makes the environment so comfortable for everyone, and leads a great lecture. Her slides are up on the board during class, posted on ELMS, and her classes are recorded. The work load was easy and the information was interesting. Take psyc354!!!!!!!", "rating": 5, "expected_grade": "", "created": "2022-02-23T15:54:25Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "The teaching team for this class is so responsive. They answer your emails so fast and give you detailed answers to your questions. They really prioritize helping you and making your life easier (you just have to reach out and ask your questions). The grading in this class can be tough sometimes but if you read the rubric over and put in the work you'll do great. Dr. Kearney is also the coolest- she relates to us so much and really just gets it.", "rating": 4, "expected_grade": "", "created": "2022-04-26T16:05:45Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "Dr. Kearney was AMAZING. The content was super interesting and she really cares about her students and is super approachable. One of my favorite classes I've taken in college. ", "rating": 5, "expected_grade": "A", "created": "2022-05-10T16:28:15Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "TAKE THIS CLASS!!!!! You seriously won't regret it. Dr.Kearney is the best professor I've had at umd. She makes topics extremely applicable to life and as long as you put in effort to complete all the assignments, it is not hard to do well in the class. You can tell she also cares a lot about student mental health and gives you unlimited extensions as long as you ask 24 hours before the assignment is due (apart from the in class assignments). ", "rating": 5, "expected_grade": "A", "created": "2022-05-14T20:08:05Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "Monica is a fine professor but I would not take another course she teaches again. Her TA's grade unnecessarily extremely hard where this should be an easy enough course. This makes the course very stressful. Along with this be ready for loads of busy work and useless discussion posts every week that do not help with understanding the course concepts at all. I would not recommend taking this class unless you enjoy pointless work and hard grading for no reason at all. The only positive to this class is never having to actually go to it because the powerpoints are posted online.", "rating": 2, "expected_grade": "B+", "created": "2022-11-01T16:33:38.838940Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "Dr. K is a wonderful professor. I have no idea what the other student below is talking about. They might not have found value in the class, but that sounds like a personal problem for them, lol. The content is extremely engaging and relevant, and all of it is supported by research and empirical findings. Her class is manageable, low-effort, and her lectures are engaging. Attending class is worth it because she often engages in a lot of class discussions, and these are actually pretty beneficial and interesting to be a part of. Usually, there is just one assignment due each Friday, and they usually do not take too long to complete. I did not think the TAs graded harshly, for the most part; all I did on my discussions and assignments was follow basic rubric instructions and put in a decent amount of effort, and I managed to get full points on almost everything. To succeed and get the most of class, I would recommend attending lectures, emailing her or the TAs for help, submitting work on time, doing the required readings before class (these can be a little long, just skimming is fine), and participating in discussions. There is two exams; a midterm and a final, not cumulative and all multiple choice. To study, I watched back the lecture recordings. I loved this class because it really allowed me to think critically about the world around me and explained a lot of social concepts and phenomena that is always present around us. This is truly an easy class to do well in, and the content is useful and interesting. I would definitely recommend both Dr. K and this class to anyone.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T05:29:54.716021Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "This class grades you more on APA than actual content. IDK WTF these other people are talking about, it sucks do not take this course unless you want to scream at a wall bc the TA’s grade ridiculously hard.", "rating": 1, "expected_grade": "B-", "created": "2022-12-15T12:03:01.981949Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "I have a lot of mixed feelings about this class.  I think the class discusses many important topics. However, it also fails to address many topics that I think are critical to be mentioned in that class. \r\nThe key doing well in this class is not submitting your best work, but submitting work that follows the rubric to the tea. Once I figured that out, my grades began improving from Cs to As.", "rating": 3, "expected_grade": "A", "created": "2022-12-21T19:04:27.180954Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "Dr. Kearney is a sweetheart. She is so friendly and caring and keeps you engaged during lecture. The course content is SUPER interesting, insightful, important, and relevant - EVERYONE needs to learn this content. I also appreciate the wide array of topics: bias and stereotyping, anti-Black racism, white supremacy, immigration and xenophobia, model minority myth, mental health, heterosexism and homophobia, transphobia, masculinity and femininity, misogyny, etc. \r\n\r\nHowever, the TA's are AWFUL. As a UTA myself, I am appalled at how the TA's have been grading assignments, ESPECIALLY the workshop/group project assignments. They're quite literally out to destroy your grade. At first I thought it was only the GTA Carlos , but turns out its the whole teaching team. I know for sure many student's grades are not accurately reflecting their understanding of course material because the TA's are busy deducting points for the most minute things and then proceed to leave behind useless comments. Also, apparently the whole psyc dept is so pressed over APA formatting. Please, I could care less. Sure, I'll follow APA formatting, but we should not be losing points over dumb things like oh the font of ONE word or phrase was accidentally a different color or size, the title was only horizontally centered and not vertically...\r\n\r\nIt's quite unfortunate because the course content is so interesting and I've learned a lot, however the TAs are literally ruining the whole experience. I'm sorry, but this is a PSYC class, it's not meant to be so difficult (aka, an easy A). The TA's clearly have an ego and need to get their heads out of their...\r\n\r\nSomeone below said \"I would not recommend taking this class unless you enjoy pointless work and hard grading for no reason at all.\" 100% agree. Again, though the material is so interesting, at the end of the day, it's the grade that matters. I hope Dr. Kearney considers new TAs for future semesters or else people will continue to be deterred by these reviews and unfortunately miss out on her wonderful lectures.", "rating": 3, "expected_grade": "", "created": "2023-04-12T20:42:05.216005Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "Do not waste your time on this course. They only care about APA format, not the content. Never had a class care so much about APA and only got a B because of that.", "rating": 1, "expected_grade": "B", "created": "2023-12-16T18:22:40.647344Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "I went into this course thinking it wouldn't be too hard but definitely higher difficulty than some courses. The assignments themselves didn't seem that hard but Dr. Kearney and her TAs were extremely harsh about grading and took off points for the littlest details. Dr. Kearney is a nice person and a good lecturer but a mean grader. \r\nThe exams were easy for me and I would get high grades on them (as they were multiple choice, graded objectively) but the papers I would get such low grades on for stupid reasons. They are harsh graders were it comes to the subjective stuff. \r\nNot the worse professor but I don't recommend if you don't want a difficult class", "rating": 2, "expected_grade": "B+", "created": "2023-12-16T18:58:11.505295Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "Positives: Dr. Kearney is a fantastic lecturer and good at explaining topics. The lecture is very interesting, insightful, and really helps you understand the scope of topics in society. I believe everyone should take the time to go to these lectures. The lectures are also very skippable, so if you don't care enough, you don't need to go.\r\n\r\nNegatives: Grading is insanely harsh, inconsistent, and defensive. \r\n- If you want a good grade in this class, you need to follow the rubric to a T for EVERYTHING. My OpEd did not deserve the high grade it got, but it only worked because EVERYTHING I did was based on the rubric. Can't take off points if there's nothing wrong with it based on the rubric. Was the purpose of the OpEd to write well or write based on the rubric? The rubric, I guess.\r\n- Basically got my grade destroyed (A vs. A-) by 1 assignment that wasn't to the T. Tried asking for a regrade, got the \"nope lol.\"\r\n- Regrade requests are offered. If you decide to take this class, you need to use them. I didn't care much about it until it was too late and I realized I lost points on SUPER pointless stuff.\r\n- Dr. K enables her TAs to grade harshly. She stands by their grading more than half the time (and the rare times I got some crumbs back were the other less than half). So all the other comments saying the TA grading is insane, it's because Dr. K enables them to.\r\n- Her exams are all multiple choice and open note, but she DOES NOT RELEASE THEM. Which means you don't know what you're losing points on, you don't know where you're going wrong, you can't learn from what you're doing wrong, and based on the content of this class, there is a LOT of answers that can potentially be very subjective. You will never know unless you ask to see them. \r\n- A lot of busy work. I did not find value in most of her assignments. Assignments are more \"make sure you follow the rubric\" and not the actual content yourself.\r\n- APA formatting. I personally didn't have a huge issue with this since I learned from how ridiculous it was in PSYC221 (which was equally as bad in terms of APA formatting), but the emphasis on APA in this department is pretty ridiculous, and this class is no exception (had 1 error which also destroyed my grade once). My literal class on research methods and writing cohesive research papers (PSYC300) didn't even grade harshly on APA formatting.\r\n\r\nOther comments:\r\n- The workload is easy. It's easy to do well in this class if you spend a lot of time stressing over the rubric and following it to a T. No matter what the assignment is asking you, you must do it based on the rubric. I would've finished with an A if I followed the rubric on the outline assignment and not what the assignment descriptions were.\r\n- Despite finding the course content interesting, I could not bring myself to go to lectures after the first 3 weeks. It felt like a waste of time when the assignments weren't even emphasizing learning the content.\r\n- All of the other comments about grading are VERY true. At least the teaching team is responsive to regrade requests. Just make sure you use it. I've had to submit 3 and I got points back for all of them...\r\n- Overall, the grading for me killed this class. I really wanted to like it. But the amount of stress for the assignments was not it. Basically agree with the person who said \"It's quite unfortunate because the course content is so interesting and I've learned a lot, however the TAs are literally ruining the whole experience. I'm sorry, but this is a PSYC class, it's not meant to be so difficult (aka, an easy A). The TA's clearly have an ego and need to get their heads out of their... Someone below said \"I would not recommend taking this class unless you enjoy pointless work and hard grading for no reason at all.\" 100% agree. Again, though the material is so interesting, at the end of the day, it's the grade that matters.\" The TAs are literally getting enabled by Dr. K to grade like this.", "rating": 1, "expected_grade": "A-", "created": "2023-12-16T20:41:32.478770Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "truly the worst class I have taken in all 4 years of undergrad. the concepts are important and the content is necessary, but the TAs will destroy your grade at the drop of a hat. just as previous reviewers have said -- there are THREE TAS and there is absolutely zero consistency in grading. you could get a 100 on a draft, and receive a C on the final submission that was identical, simply because you got a different TA that round. i wish i never took this class, and i recommend you choose any other possible option. i took the class to learn about critical topics that were especially important to me, but all i could focus on was keeping my grade afloat.", "rating": 2, "expected_grade": "A", "created": "2023-12-27T14:07:35.532563Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "I liked this course a lot, as the content was very engaging, relevant, and important. Additionally, Dr. Kearney is very nice, accessible, and easy to talk to. I believe that she got new TAs for this semester, as grading was not nearly as severe as what appears to be reported on this page, so she might have taken that into account. Additionally, the TAs offered regrade opportunities in case there were inconsistencies. I can definitely see though how your grade is dependent on the TAs, since 60% of your grade in this course comes from writing assignments, but at least for now the TAs seem reasonable, so this course was pretty enjoyable opposed to being a nightmare.", "rating": 5, "expected_grade": "A", "created": "2023-12-27T23:29:33.922715Z"}, {"professor": "Monica Kearney", "course": "PSYC354", "review": "This class is titled Multicultural Psychology in the U.S. however it focuses more on political controversies and race rather than US. Assignments are graded on following the rubric and writing what the professor seems to be looking for. However, the TA’s grade all assignments so there is definitely  some bias there. Assignments are quite shallow to be honest. I know this is a required course and some components are interesting while others do not provide the relevance or intention. I’d appreciate more research based and I wonder if the other psyc354 professor teaches different style.", "rating": 4, "expected_grade": "A", "created": "2024-02-28T02:09:00.863776Z"}], "department": "PSYC", "course_number": "354", "name": "PSYC354", "title": "Multicultural Psychology in the U.S.", "credits": 3, "description": "<b>Prerequisite:</b> PSYC100.\nWhat are the psychological implications of racism, sexism, homophobia and other structures of inequality in the United States? How do socio-cultural privilege and oppression influence individual and group thoughts, feelings, and behaviors? This course will take a current events focus to understanding multicultural and social justice issues in psychology with an emphasis on self-reflection, mental health, cross-cultural communication, and strategies for social change.\n<i>Click here for course syllabus.</i>", "is_recent": true, "geneds": null}