{"average_gpa": 3.6340425531914895, "professors": ["Andrew Schonebaum", "Andrew Schonebaum", "Andrew Schonebaum", "Andrew Schonebaum", "Andrew Schonebaum", "Andrew Schonebaum", "Andrew Schonebaum"], "reviews": [{"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "I never thought I would be interested in eastern philosophies until I took this class. Dr Andrew is genuine and really nice guy, excellent at presenting ideas and discussing them too. I had so much fun in his class and would certainly recommend him! ", "rating": 5, "expected_grade": "A", "created": "2018-05-11T05:06:48Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "I learned way more than I thought I would in this class. He encouraged me to minor in Chinese and changed the way I think through eastern philosophy.", "rating": 5, "expected_grade": "A", "created": "2018-12-11T22:55:57Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "Taking this class for a gen ed, I found myself very interested in Chinese Philosophy. Professor Schonebaum is very personable and his personality makes learning the content easier and as a result, I was willing to participate much more than most classes.", "rating": 5, "expected_grade": "A", "created": "2020-04-22T18:04:13Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "extremely nice guy and really wants his students to succeed. He really hopes that students are actually learning rather than just getting through the class. This class was taught for the first time online (due to covid) so the few quizzes that we had and our midterm were on canvas. He always goes over the answers after. Most of the lectures are discussion based, we would just talk about the readings as a group or sometimes in break out rooms. There are readings assigned every week, but as long as you're paying attention and taking notes during lecture, you'll have all the information you need for the exam/quizzes. Great guy, who really cares about what he's teaching. Always in great spirits and just wants students to think and form ideas of their own. ", "rating": 5, "expected_grade": "A", "created": "2020-11-02T06:30:22Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "Prof. Schonebaum was a solid teacher and was super enthusiastic about what he was teaching. There was a decent amount of reading, but it was easy to find a balance once you started the course. Also, the entire course is discussion-based which means he will require you to speak and have your camera on for Zoom as well as participate in breakout rooms. The tests were easy multiple choice with thought-provoking short answers. He was  beyond reasonable with grading and I would argue that everyone should be getting an A (maybe a few B's).", "rating": 5, "expected_grade": "A+", "created": "2020-12-14T15:53:15Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "Professor Andy is such a nice guy and a really good teacher. He wants everyone to do well in his class, and he tells you that on the first day. He encouraged us to collaborate with our classmates and work together on multiple assignments, and that helped me make a connection with my Zoom classmates.\r\nThe class itself is not that hard, and if you pay attention in lecture and participate in notetaking, you should be able to get a good grade in the class. Again, he clearly wants you to succeed. If you have a chance to take this class or any class taught by Prof. Andy, I highly suggest you take that opportunity. He is such a great guy and his class was one I looked forward to often.", "rating": 5, "expected_grade": "A", "created": "2020-12-20T04:22:31Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "Can be a little strange at times but he's super interesting to talk to and is willing to listen to his students. The actual grade aspect isn't that important to him to he will let people take quizzes in groups.", "rating": 5, "expected_grade": "A", "created": "2020-12-22T00:11:01Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "Very interesting class where you will learn a lot. I enjoyed the readings in the class a lot. Andrew makes it so that you can focus on learning, not stressing about your grades.", "rating": 5, "expected_grade": "A", "created": "2021-01-03T19:38:28Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "Prof Schonebaum was really nice to have. He's pretty open with office hrs; I even found myself going a couple times to talk about the readings or whatever I was studying which related to them. Taking notes in the class can be a little difficult because he skips around topics a lot (granted, I took SLLC286 in spring 2020, in the middle of the transition to online learning); just make sure to keep your notes organized, and taking the exams should be fine.", "rating": 5, "expected_grade": "A+", "created": "2021-01-12T07:45:01Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "I cannot recommend taking a course with Dr. Schonebaum enough-- he's seriously the best. He's really engaging and makes lectures fun to listen to. He's super understanding and creates a chill environment in class where students feel comfortable to contribute at any time. The contents of SLLC286 were already interesting, but he also taught the course in a way that made the materials applicable to real life and made it more relatable to us. I really enjoyed taking this course and having Dr. Schonebaum.", "rating": 5, "expected_grade": "A", "created": "2022-01-02T17:34:50Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "Good professor! He really seems to care about his students, and classes are always fun to be a part of. I also enjoyed the readings we did and learning about how we can apply them to our lives today. Would definitely recommend taking him as a prof!", "rating": 5, "expected_grade": "A", "created": "2022-05-25T15:54:31Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "I love Dr. Schonebaum. He is so passionate and sweet and his lectures are interesting if you do the readings, which are a nice thing to do as you unwind at the end of the day. The quizzes and final questions were a little confusing but it was nice that they were all online on elms. This is exactly how a gen-ed should be: if you cannot attend class one day it is fine, the exams are easy, and you just get to sit in class and listen to Chinese philosophy. He even brought us donuts on the last day!", "rating": 5, "expected_grade": "A", "created": "2022-12-20T20:57:37.472358Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "He is a great lecturer and he keeps things interesting. He is very fair with his grading as long as you go to class and knows you. The exams are exactly what he talks about in class.", "rating": 5, "expected_grade": "A", "created": "2023-01-23T01:41:32.112225Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "He is one of the kindest professors I have had at UMD.  You can tell he genuinely cares about his students' success and wants them to walk away having actually learned something from the course.  It is a great experience, very fun, and I honestly learned a lot.  Highly recommend him and this course.  It does not have a heavy workload, he goes over what is on exams very well, and even reuses some questions since he is trying to reinforce important concepts.  Definitely one of my favorite courses and professors I have taken.  He emphasizes making friends, so don't be shy in the class and make sure he knows who you are.  It is a great gen ed, and you should consider taking it regardless if you need it or not", "rating": 5, "expected_grade": "A", "created": "2023-04-13T15:06:40.649087Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "cool dude, interesting material, deceptively difficult online quizzes. I mean they're not that bad considering they're online and mostly on quizlet, but without the quizlet answers I'd honestly probably get around an 80 or something for the quizzes. Cool guy and def my favorite class at UMD so far.", "rating": 5, "expected_grade": "A", "created": "2023-05-19T15:45:49.255109Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "Very nice professor. Easy gen ed but also you learn a lot. Make sure to go to class!", "rating": 5, "expected_grade": "B", "created": "2023-05-20T14:51:30.884837Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "Was probably my favorite class at umd, super interesting and enthusiastic lecturer. 10/10", "rating": 5, "expected_grade": "A", "created": "2023-11-09T16:55:17.062857Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "Took this class Fall 2022. Beast lecturer, awesome class. Set the gold standard for GenEds, other elective professors should look to this for pointers. Content was super interesting and lectures energetic. No stress at all, and an A is easily achievable; the professor isn't trying to trip you up or make you stress over grades, he just really wants you to learn about Chinese philosophy. 10/10", "rating": 5, "expected_grade": "A", "created": "2023-11-16T15:03:08.327555Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "Class was pretty easy and fun, he does have a \"no tech\" policy but it became loosely handled as more and more people kept pulling out their laptops anyways. He's a great guy, and emphasizes making friends so really trust in him when he says that. Make some friends to pull each other through this class and you should be smooth sailing.", "rating": 5, "expected_grade": "A", "created": "2023-12-22T18:05:00.972463Z"}, {"professor": "Andrew Schonebaum", "course": "SLLC286", "review": "Super nice professor. The only thing he emphasizes is making new friends in class. It should be a very easy A if you go to lecture and look over your notes before quizzes and exams.", "rating": 5, "expected_grade": "A+", "created": "2024-04-01T18:22:45.872742Z"}], "department": "SLLC", "course_number": "286", "name": "SLLC286", "title": "Living the Good Life: Chinese Philosophy in the Modern World", "credits": 3, "description": "<b>Additional information:</b> Taught in English.\nConfucius, Mencius, Zhuangzi and other Chinese thinkers who lived more than 2,000 years ago would argue that the contemporary Western emphasis on self-discovery (Find yourself) and self-acceptance has led you astray. See what they have to say and discuss what relevance it has for the modern world as we study how early Chinese thinkers wrestled with questions of existence, morality, and governance. No previous knowledge of Chinese philosophy and history will be assumed and no prerequisites are required. We will discuss ideas that are both historical and relevant to students' lives. What is \"the Way\"? How do we cultivate spontaneity? Is there a stable self? How can we be more alive? These are questions important for ancient kings but also for UMD students choosing a major, or wondering how ARHU can benefit them.", "is_recent": true, "geneds": null}