{"average_gpa": 3.744086021505377, "professors": ["Juan Uriagereka", "Juan Uriagereka", "Juan Uriagereka", "Juan Uriagereka"], "reviews": [{"professor": "Juan Uriagereka", "course": "SLLC280", "review": "Juan is an excellent discussion leader, his lectures were fairly interesting but would sometimes get boring with the hour and 15 minute long class. He is a very kind and understanding professor. The way he structured this course was unorthodox with half the semester done completely around one research project led by a TA and done with a few other members. This research project also includes a presentation and a showcase. He is fairly relaxed with due dates and he often lets us choose the direction that the course takes, for example, he let us come up with the essay questions for our final(two 500 word essays). This is not a difficult course as long as you and your group members do your work. Juan is a very relaxed and cares more about your learning than what your grade is.", "rating": 4, "expected_grade": "A", "created": "2023-12-22T22:08:26.616938Z"}, {"professor": "Juan Uriagereka", "course": "SLLC280", "review": "The professor is a pretty upbeat person with a passion for history, language, and the abilities of artificial intelligence.\r\nUnfortunately, the course itself was confusing at best. The course began with lectures that leaned towards philosophy and \"why is it the way it is?\" discussions. It's not bad, but it doesn't encapsulate the projects we did later in the semester. The grader for the class is a woman who, from my experience, is like those teachers that dock points for expressing the \"wrong\" point of view. Her grading style is interesting to say the least. There is also rarely a rubric.\r\nOverall the course covered interesting topics, but the material was confusing and homepage difficult to navigate.", "rating": 3, "expected_grade": "A-", "created": "2023-12-29T05:16:11.059883Z"}], "department": "SLLC", "course_number": "280", "name": "SLLC280", "title": "Mythology of the Oppressed", "credits": 3, "description": "<b>Credit only granted for:</b> SLLC280 or SLLC299J.\n<b>Formerly:</b> SLLC299J.\nDoes information drive human history? Mythological recurrences say much about cultures that had to adapt their world views while attempting to preserve them. This course examines the cognitive or social bases of mythology, to be pursued from insights in cultural and literary studies, linguistics, the cognitive sciences, paleo-anthropology, archeology, etc. The course is designed to help students think about complex problems from a humanistic perspective, making liberal use of the sciences.\n<i>Restricted to Carillon Community Language students.</i>", "is_recent": true, "geneds": null}