{"average_gpa": 3.149559082892415, "professors": ["Denae Johnson", "Akilah Watkins-Butler", "Yan Yu", "Kris Marsh", "Mark Gross", "Scott Albrecht", "Arthur Piszczatowski", "Jonathan Jackson", "Nicole Cousin-Gossett", "Collin Mueller", "Meredith Kleykamp", "Simone Durham", "Reeve Vanneman", "Reeve Vanneman", "Simone Durham", "Reeve Vanneman", "Collin Mueller", "Collin Mueller"], "reviews": [{"professor": "Reeve Vanneman", "course": "SOCY241", "review": "To echo what others have said, Prof Vanneman gives reading quizzes with trick questions that are extremely difficult for no real reason. He is difficult to reach via email as well and does not provide clear grading instructions-- I'm talking specifically about the final presentation assignment. His lecture is unengaging and as a professor, he is disorganized-- but to students' benefit this meant he failed to upload readings for the second half of the semester. \r\n\r\nThe 4-3-2-1 writing quizzes were easy enough though.", "rating": 2, "expected_grade": "", "created": "2022-12-09T19:56:57.678009Z"}, {"professor": "Reeve Vanneman", "course": "SOCY241", "review": "He is a nice guy with tons of knowledge. He is very disorganized which makes the lectures hard to follow. The class is basically just him rambling the entire time, most assignments get moved throughout the semester. He is not a horrible teacher and is willing to work with you on extensions or any other concerns. Lecture is just hard to sit through", "rating": 4, "expected_grade": "A-", "created": "2023-05-08T15:44:43.843126Z"}, {"professor": "Collin Mueller", "course": "SOCY241", "review": "Professor Mueller is a GOAT. He genuinely cares about his students, and he is generally a very laid-back and chill person. There are no exams for the course, but there are 4-3-2-1 essay quizzes every other week that sound like a lot of work, but if you put in the effort, they are not hard at all. If you fall behind on one, there is a 1 week grace period after the due date that you can use. The material is very interesting and for the most part, quite easy to follow. Professor Mueller is also funny and loves telling jokes at the beginning of class. Take this class with him, you will not regret it!", "rating": 5, "expected_grade": "A", "created": "2024-03-29T14:23:31.221107Z"}], "department": "SOCY", "course_number": "241", "name": "SOCY241", "title": "Inequality in American Society", "credits": 3, "description": "<b>Credit only granted for:</b> SOCY241 or SOCY441.\nThe dynamics of inequality: its social production, politics, future, and ideological bases. Utopian communities, efforts to eliminate inequality.\n<i>Credit granted for SOCY241 or SOCY441.</i>", "is_recent": true, "geneds": null}