{"average_gpa": 3.2021496130696474, "professors": ["Luis Charry", "Melissa Gonzalez-Contreras", "Maria Monsalve", "Ginette Eldredge", "Daybert Linares", "Sarah Dowman", "Kayla Watson", "Aida Garcia Revuelta", "Chila Hidalgo", "Meghan Hamorsky", "Daniela Bulansky", "Monica Ocasio", "Sofia Maurette", "Nelida Devesa-Gomez", "Karen Krausen", "Maggy Rodriguez", "Maria Becerril Longares", "Ivette Rodriguez-Santana", "Sofia Calzada-Orihuela", "Laura Quijano", "Lina Morales Chacana", "Douglas Glynn", "Nidia Reyes", "Carla Onate", "Jackson Monzon", "Daniela Hernandez", "Maria Herrera Arvay", "Ofelia Montelongo Valencia", "Ligia Gonzalez", "Roberto Katrandjiyski", "Cecilia Battauz", "Chila Hidalgo", "Andres Garcia", "Chila Hidalgo", "Maureen Wrightson", "Ofelia Montelongo Valencia", "Tatiana Chi Miranda", "Chila Hidalgo", "Daniela Hernandez", "Chila Hidalgo", "Gianinna Malatesta", "Maureen Wrightson", "Chila Hidalgo", "Chila Hidalgo", "Karina De Sande", "Ana Cuevas Albarran", "Angela Pico Pinto", "Chila Hidalgo", "Isadora Quintana"], "reviews": [{"professor": "Chila Hidalgo", "course": "SPAN207", "review": "Señora Hidalgo is awesome. She's very funny and I learned a lot in her class. The Spanish professors have all been great and she has only boosted that stereotype for me! The homework assignments and workload are very manageable and she really cares about her students. Attendance is important, as it should be in any class. Definitely take a class with her if you get the chance. ", "rating": 5, "expected_grade": "A", "created": "2016-12-01T15:56:00Z"}, {"professor": "Fabian Faccio", "course": "SPAN207", "review": "This has been one of my favorite classes at Maryland.  Fabian is a great professor.  He is excited about Spanish and loves his students.  He wants each student to succeed.  I learned a lot from him and truly enjoyed his class. I would highly recommend him. ", "rating": 5, "expected_grade": "A-", "created": "2011-05-21T14:39:00Z"}, {"professor": "Chila Hidalgo", "course": "SPAN207", "review": "SHE IS THE BEST SPANISH PROFESSOR AT UMD! If you're looking for a sign to choose her as your professor, this is it!!! She is very generous with grading, and is also very understanding with course material, grades, and help. The class is very organized with a set schedule each week that she actually follows. Great class!", "rating": 5, "expected_grade": "A", "created": "2019-12-17T01:54:02Z"}, {"professor": "Chila Hidalgo", "course": "SPAN207", "review": "I was expecting this class to be horrible, I am not a confident spanish speaker but Prof Hidalgo has made it enjoyable and I have learned a ton! She is communicative and organized. The class is composed of HWs, 2 quizes, 2 writing assignments and a midterm and final and all of these expectations are reasonablely easy and well graded. ", "rating": 5, "expected_grade": "A", "created": "2021-12-06T21:39:34Z"}, {"professor": "Chila Hidalgo", "course": "SPAN207", "review": "She is an amazing Spanish professor; she does an excellent job of integrating lessons about grammar into discussions of culture and art. The class consists of a lot of work in small groups and discussions. The homework load never takes more than 30 minutes however there are grammar quizzes worth 1-3 points that tend to be very difficult. Overall I would definitely recommend her. ", "rating": 5, "expected_grade": "", "created": "2021-12-08T02:37:52Z"}, {"professor": "Ofelia Montelongo Valencia", "course": "SPAN207", "review": "Ms. Montelongo was the sweetest teacher. She gave out review guides that were exactly like the test, and the workload was fairly light. Most classes, each student would take a turn reading an excerpt from the textbook aloud which can be intimidating, but she made it a comfortable environment. She was also really understanding and cared for all of her students. She was super approachable if you were having problems.Definitely recommend her.", "rating": 4, "expected_grade": "A+", "created": "2022-01-26T03:55:41Z"}, {"professor": "Chila Hidalgo", "course": "SPAN207", "review": "She is such a good Spanish professor! There is a lot of speaking and working with a partner while in the classroom, but it is not too challenging. Every week you have 3 homework assignments. The grammar and vocab assignments are hard, but her quizzes and written assignments are easier and help to raise your grade.", "rating": 5, "expected_grade": "A", "created": "2022-12-05T21:39:00.797614Z"}, {"professor": "Tatiana Chi Miranda", "course": "SPAN207", "review": "Great great great professor! She's the best professor I've had at UMD. She brings enthusiasm to the classroom even when it was a 9:30 am class. She also seems to actually care about her students! One time she even brought us cookies and played just dance for us to find our \"alma\" in the music. I really can't say anything bad about her.", "rating": 5, "expected_grade": "A", "created": "2022-12-22T03:46:21.400803Z"}, {"professor": "Tatiana Chi Miranda", "course": "SPAN207", "review": "Excellent professor! Her grading is extremely fair, and the content is very relevant. She is very enthusiastic about Spanish, and she is great at explaining more difficult concepts. She also truly cares about her students, both as students and overall. I noticed my fluency in Spanish definitely improved after taking her class. I would highly, highly recommend registering in her section!", "rating": 5, "expected_grade": "A", "created": "2022-12-28T01:35:27.382923Z"}, {"professor": "Tatiana Chi Miranda", "course": "SPAN207", "review": "She is so sweet and great at lecturing. I transferred college and had a hard time adjusting for the for the first couple weeks, but I went to her office hours and we talked about my grades and how I could improve. I improved my grade a lot! She really cares about her students and always responds very quickly to emails as well!", "rating": 5, "expected_grade": "B+", "created": "2023-01-23T21:35:08.241261Z"}, {"professor": "Chila Hidalgo", "course": "SPAN207", "review": "She is an amazing professor and genuinely wants her students to learn and improve their spanish. She is super sweet and the workload isn’t bad at all.", "rating": 5, "expected_grade": "B+", "created": "2023-05-11T20:06:22.993092Z"}, {"professor": "Chila Hidalgo", "course": "SPAN207", "review": "Such an amazing professor. You can tell that she truly cares about her students and offers all of her help to make sure you learn. Her classroom feels like a safe space, where it is OKAY to make mistakes and not feel bad about it! She is very organized and followed the syllabus to a T. I have taken Spanish for 8 years and this is the first time I feel as though I have truly grasped all of the grammar concepts.", "rating": 5, "expected_grade": "A-", "created": "2023-05-21T13:33:08.842509Z"}, {"professor": "Chila Hidalgo", "course": "SPAN207", "review": "I hadn't taken a spanish class in a long time so Señora Hidalgo's teaching in complete spanish threw me off at first, but I learned so much so quickly. She is very very sweet and really wants everyone to learn the language. There's 3ish homework assignments a week and the grammar quizzes are pretty hard, but she's not a very harsh grader with written assignments so they help bring your grade up. However, if you slack off in the beginning or bomb a quiz or something its very hard to get back up.", "rating": 4, "expected_grade": "B-", "created": "2023-05-22T00:15:59.824421Z"}, {"professor": "Karina De Sande", "course": "SPAN207", "review": "This class is hard, but I have talked to several friends who have all taken SPAN207 with different professors, and the workload is pretty standard across all 207 classes, so the instructor is really what changes your experience. The online grading is pretty nitpicky, but again, that is a department-wide concern. \r\nProfessor de Sande really makes class fun! She is always willing to slow down and explain things for students who need help, and has always been available for help/discussion when I have asked. She is a fair grader and tries to make her class engaging, and help us learn Spanish instead of just memorizing words. I would totally recommend taking her class!", "rating": 5, "expected_grade": "B-", "created": "2023-11-01T16:10:35.217806Z"}, {"professor": "Chila Hidalgo", "course": "SPAN207", "review": "She does not respond to emails at all.", "rating": 1, "expected_grade": "", "created": "2023-11-09T04:02:12.283217Z"}, {"professor": "Karina De Sande", "course": "SPAN207", "review": "This class is pretty challenging and the grading is really specific on ELMS, but Karina is amazing. She always took the time to make sure we understood everything and was willing to explain the same concept over and over again just to make sure it clicked. When I failed a quiz and came into class crying, she pulled me aside and offered to help me out during office hours and assured me that I was still capable of doing well in the class and I had just made some mistakes and we worked together to identify my mistakes so I could improve.", "rating": 5, "expected_grade": "B-", "created": "2023-12-12T20:50:46.825434Z"}, {"professor": "Chila Hidalgo", "course": "SPAN207", "review": "Amazing professor, well-prepares us for tests (good reviews + shows us the exact format), curves the tests, and overall I feel really improved. Note: you cannot use your phone at all in class and she takes attendance.\r\n--As someone who has taken Spanish classes for 5 years (3 middle school, 2 high school) but hasn't taken one in a few years (since covid lockdown) (also in the American education system so the 5 years were basic), entering the class was daunting when she teaches entirely in Spanish and a lot of the students seem confident in speaking Spanish. But the professor speaks slowly and well that you can understand each word--however I can say that I felt a little lost the first few classes because I didn't remember or know meanings to many words. A lot of people dropped the class, so I say trust your judgment, but do not be afraid to stay the first few classes because I was very lost too at first.\r\n--Over the course I grew a lot of confidence in my pronunciation and grammar, and grew my vocabulary.\r\n--Now, the work:\r\n1) There's always homework--it's clearly posted on elms and the syllabus--just do it because it's generally easy and you get unlimited time. It's usually either drop-down/fill-in-the-blank about a reading in the textbook, a 10 sentence journal entry (completion), or fill-in-the-blank on grammar.\r\n2) 2 papers-- she gives you like a month to do it and clearly outlines what she's looking for in it. about 1 and a half to 2 pages.\r\n3) 2 quizzes, 1 midterm, 1 final-- she always gives a review packet that we go over, clearly showing the format of the quiz. she also frequently notes that she likes using some irregular verbs so just remember to study those too.", "rating": 5, "expected_grade": "B+", "created": "2023-12-19T23:30:06.574466Z"}, {"professor": "Chila Hidalgo", "course": "SPAN207", "review": "You can do well in this class if you: show up, complete the homework, and practice grammar for tests/quizzes using the link on canvas. Attendance counts for the participation grade. There will be a final, midterm, two quizzes, two writing assignments, and homework (due before every class). Profa is a fair grader and dropped hw assignments the class did poorly on. There were some questions on hw that were tricky or didn't make a ton of sense, so this came in handy. The quizzes, midterm exam, and final are exactly like the reviews she gives in class. She is not punitive in exams/quizzes, but she does like irregulars so be sure to review. Even if you mess up a major assignment or two, you can still do very well in the class. She's a very good professor and I would recommend taking the class.", "rating": 5, "expected_grade": "A", "created": "2023-12-26T15:34:20.324286Z"}, {"professor": "Karina De Sande", "course": "SPAN207", "review": "Really good instructor, takes the time to explain things well. Very approachable and good-natured. Quizzes were basically the same as the homeworks which was a plus. She seems to genuinely care about her students and she's always willing to help if you have questions or concerns. Participation is definitely something that counts towards your grade, I didn't skip a class and spoke in class but still got points taken off for participation. Grading is nit-picky but I think that's typical of the department. Overall a really good class and teacher.", "rating": 5, "expected_grade": "A", "created": "2024-01-16T19:34:05.333813Z"}], "department": "SPAN", "course_number": "207", "name": "SPAN207", "title": "Reading and Writing in Spanish", "credits": 3, "description": "<b>Prerequisite:</b> Must have completed or be concurrently enrolled in SPAN204; or must have appropriate Foreign Language Placement Test (FLPT) score.\nSelected readings with emphasis on reading comprehension and the development of reading strategies. Work in composition writing and a review of selected grammatical topics. Complements material of SPAN204.", "is_recent": true, "geneds": null}