{"average_gpa": 2.9954128440366974, "professors": ["Jose Naharro-Calderon", "Mehl Penrose", "Anne Giller-Wilde", "Hernan Sanchez", "Maria Becerril Longares", "Juan Uriagereka", "Nelida Devesa-Gomez", "Mariluz Bort Caballero", "Jose Naharro-Calderon", "Mehl Penrose", "Jose Naharro-Calderon", "Mehl Penrose", "Alvaro Villar Cobo", "Mehl Penrose", "Mehl Penrose", "Jose Naharro-Calderon", "Mehl Penrose"], "reviews": [{"professor": "Jose Naharro-Calderon", "course": "SPAN333", "review": "Oh dear lord. If you respect yourself, I wouldn't take this course. It's not that I'm doing badly; it's the fact that I really don't feel like this professor respects his students. \n\r\nHe is, admittedly, a great lecturer. He knows exactly what he is talking about, and he will give you that information. His class is interesting, he is not boring, and I have no doubt that he is knowledgeable about his subject. He is even quite funny at times.\n\r\nHowever, his class structure is such a clusterfuck that I can't advise anyone to take this course. He is routinely late to class by at least 3 minutes, and he routinely holds the entire class after by 5-10 minutes. I have had him keep a class 13 minutes after the class had officially ended, just because he wasn't ready to stop talking.\n\r\nHis syllabus is horrific. It is 16 pages long, single spaced, and extremely unclear. It liberally intersperses random bold and italicized words. It is nigh impossible to tell the difference between an assigned book and an assigned movie on his calendar. The whole thing is about 2 days off of what we're actually doing in the class. The due date for the final paper is not even on the thing, and he couldn't tell us until two weeks before finals when it would actually be due.\n\r\nWhen our class asked him what would be on our first exam, he would not tell us. It might be reasonable if he had something on the syllabus about it, or if he just gave us some broad topics that would be most explored. However, he just answered \"Everything.\" He said everything would be on the exam. Supremely unhelpful. He also would not tell us the format of the exam. If you're not okay with not knowing anything about the test you're about to take, don't take his class.\n\r\nI have received multiple grades from him that i have NO idea how I got. His grading is mysterious, to say the least. His writing is illegible, so there's no way to read his comments without going to his office hours. I have no idea what he's looking for as far as tests, essay, and quiz answers... even after having taken the class.\n\r\nTo top it all off, he is a huge luddite. I've seen him yell curse words at a computer before. If something goes wrong, he blames it on technology. He got mad at our class for not knowing the name of a specific brand of typewriters, because it was the title of a poem and he thought we would all get the reference instead of being massively confused. He refuses to stream films from Hornbake library onto Canvas because he says he wants us to get the film experience. This means you have to physically travel to the library to watch every movie for his class (where you watch the films on a TV screen that's probably smaller than your laptop or desktop screen... film experience). He makes frequent comments about how something is very wrong with 'your generation' because students today like technology. \n\r\nYou cannot use any technology in his class, even for any of the books, papers, or films that are assigned. You must buy every book and print out every reading. I went through a full ink cartridge just from his class. If you take this class, make sure you have a laser printer.\n\r\nHis exams are not hard, but they are comprised entirely of essays and he does give pop quizzes. If you managed to slog through the syllabus to find what you were supposed to do for that day, and you managed to choose the right day and the right work for that day (because it may well not be on track with the syllabus) AND you found the reading or bought the right edition of the book or went to the library to do the assignment, then his quizzes are easy. The final essay at the end of the course was 5-8 pages long. \n\r\nI would avoid taking this class with him if you can. He knows what he's doing, and I like him as a lecturer, but his arrogance about technology, his awful syllabus, the heaps of assignments, and his general lack of respect for his student's time make me wish I had been able to drop and take this with someone who at least pretended that they cared about their students as people.\n\r\nAs a last note: If you are weird like I am, you will notice that when he has talked for about 15 minutes, his saliva starts to froth around the edges of his mouth. He rarely wipes it away. I'm super uncomfortable with things like that, and I have literally gagged in class before. Sometimes I just stare at my notes and avoid looking up. If that would bother you too, be warned.", "rating": 2, "expected_grade": "B+", "created": "2014-12-03T07:19:00Z"}, {"professor": "Jose Naharro-Calderon", "course": "SPAN333", "review": "Dr. Naharro-Calderon is an excellent profesor. I must say there were times during the semester that I felt like dropping the class because it was so much reading and because his tests weren't always in the same format each time. Participation is a must in this calss, and although this class is a lot of work, you'll come out feeling like you learned something! Take it but stick it out of it becomes too hard.", "rating": 5, "expected_grade": "B-", "created": "2013-01-10T18:03:00Z"}, {"professor": "Jose Naharro-Calderon", "course": "SPAN333", "review": "Dr. Naharro pretty much knows everything about everything. He's an AMAZING lecturer (like chills down your spine amazing) and really, truly has a passion for what he's teaching. \n\r\nThe difference between an amazingly interesting class and a horribly uncomfortable class is how many people have done the reading. (Also, he asks very specific questions in class, and 20% of the final grade is class participation.)\r\nThey're actually pretty amazing readings. \n\r\nAll his test questions are straight from his lectures. He shows several videos in class, but they're basically an excuse for him to skip class. ", "rating": 5, "expected_grade": "A+", "created": "2008-12-10T17:25:00Z"}], "department": "SPAN", "course_number": "333", "name": "SPAN333", "title": "Spanish Culture, Civilization and Literature III: Modern Times", "credits": 3, "description": "<b>Prerequisite:</b> SPAN303; and (SPAN311 or SPAN316).\nAn overview of cultural and literary production of Spain from the late 17th century through the present day, exploring the production of literary texts in their socio-historical, political, religious and cultural contexts and development. Taught in Spanish.", "is_recent": true, "geneds": null}