{"average_gpa": 3.0912854030501085, "professors": ["Eyda Merediz", "Saul Sosnowski", "Lisa Carney", "Ana Rodriguez", "Laura Demaria", "Ginette Eldredge", "Sofia Calzada-Orihuela", "Ryan Long", "Juan Carlos Quintero-Herencia", "Ginette Eldredge", "Maria Herrera Arvay", "Eyda Merediz", "Maria Herrera Arvay"], "reviews": [{"professor": "Eyda Merediz", "course": "SPAN361", "review": "I like Eyda a lot. She is really funny, and incredibly intelligent and knowledgable.  However, she expects a lot from her students, so you have to be prepared to put in work.  Participation is 15% of our grade, so you need to read and come prepared.  I've gone to her office hours twice now, and she has been very helpful and receptive to my questions/concerns.  I would recommend her just because she's fun.  But it's not an easy A.  \n\r\nClass is sometimes a little hard to follow because she goes on tangents, and doesn't specify what information is most important. But it's still interesting, and I can feel my Spanish improving.  Also, the study guide for the midterm gives you all the questions that might be on it, so you can prepare ahead of time.  This is not to say the midterm was easy, but at least she told us what we were accountable for.  ", "rating": 4, "expected_grade": "B+", "created": "2013-11-05T16:03:00Z"}, {"professor": "Eyda Merediz", "course": "SPAN361", "review": "She is knowledgeable and personable, however, does not provide structure to her classes. She does not write on the board, and goes off on tangents during her lectures, making it very difficult to ascertain what information is pertinent and should be on the tests. She includes very vague identifications for the test that do not pertain to the main themes of the course. Definitely pick a different professor in the department- like Demaria, over her. ", "rating": 2, "expected_grade": "", "created": "2011-12-19T02:37:00Z"}, {"professor": "Ginette Eldredge", "course": "SPAN361", "review": "She assigns so much work like its a 5 credit class. my grades in my major classes dropped because i was so focused on this class because she gave so much! ruined my gpa. do not take her. ", "rating": 1, "expected_grade": "", "created": "2021-12-09T19:43:22Z"}, {"professor": "Ginette Eldredge", "course": "SPAN361", "review": "So she's insane. Like actually built different. She will make you work your tail off for 15 weeks straight. Not only should you be prepared to spend 10-15 hours a week doing the ridiculously long readings and essay questions, but the material is unfamiliar and hard to grasp. This class is the reason why I didn't sleep for a semester. DO NOT TAKE!!", "rating": 3, "expected_grade": "", "created": "2022-01-29T02:48:39Z"}, {"professor": "Eyda Merediz", "course": "SPAN361", "review": "Great professor, but the readings can really pile up during the week. You can't survive by just skimming the material - you really need to understand and pick apart the text to do well. Hence this isn't a class you can skip readings for and expect to do well. Throughout the semester she made accommodations for us (canceling a quiz on Latin American capital cities, extending an essay deadline). She is a good professor and doesn't pick on you to answer if she senses that you don't want to participate. Overall had a really good time in this class.", "rating": 5, "expected_grade": "A", "created": "2022-10-30T01:36:20.137477Z"}], "department": "SPAN", "course_number": "361", "name": "SPAN361", "title": "Latin American Literatures and Cultures I: From Pre-Columbian to Colonial Times", "credits": 3, "description": "<b>Prerequisite:</b> SPAN303; and (SPAN311 or SPAN316).\nOverview of cultural history of Latin America from pre-Columbian civilizations to the Colonial period, exploring the foundations of the Spanish American cultural and literary tradition to approximately 1770. Taught in Spanish.", "is_recent": true, "geneds": null}