{"average_gpa": 3.1641363284275754, "professors": ["Carmen Benito-Vessels", "Ana Rodriguez", "Mehl Penrose", "Juan Carlos Quintero-Herencia", "Jose Naharro-Calderon", "Anne Giller-Wilde", "Matthew Lewis", "Lisa Carney", "Sebastian Bartis", "Douglas Glynn", "Luis Charry", "Melissa Gonzalez-Contreras", "Aida Garcia Revuelta", "Daybert Linares", "Mariluz Bort Caballero", "Kayla Watson", "Hernan Sanchez", "Eyda Merediz", "Sarah Dowman", "Jose Contreras", "M Lewis", "Ryan Long", "Laura Quijano", "Kathryn Taylor", "Rocio Gordon", "Maria Campero", "Regina Harrison", "Sandra Cypess", "Oscar Santos Sopena", "Hernan De Pinillos", "Norman Gonzalez", "Maria Becerril Longares", "Jason Bartles", "Daniela Bulansky", "Laura Demaria", "Nelida Devesa-Gomez", "Rebeca Moreno-Orama", "Saul Sosnowski", "Cecilia Battauz", "Chris Lewis", "Nidia Reyes", "Sofia Maurette", "Ginette Eldredge", "Juan Diaz", "Jackson Monzon", "Chris Lewis", "Eyda Merediz", "Ginette Eldredge", "Chris Lewis", "Jose Naharro-Calderon", "Ligia Gonzalez", "Marcela Risso", "Mehl Penrose", "Ryan Long", "Ana Rodriguez", "Ryan Long", "Jackson Monzon", "Chris Lewis", "Jackson Monzon", "Ligia Gonzalez", "Jackson Monzon", "Juan Carlos Quintero-Herencia", "Ryan Long", "Ana Rodriguez", "Chris Lewis", "Daniela Hernandez", "Tatiana Chi Miranda", "Andrea Torres Armas", "Ligia Gonzalez", "Tatiana Chi Miranda", "Ryan Long"], "reviews": [{"professor": "Carmen Benito-Vessels", "course": "SPAN303", "review": "I'd agree that Carmen is adorable and the grandmother-ey type, but the class was a bit disorganized and most of the time no one knew what we had to read, what we had to do for hw, etc. The tests themselves weren't bad and were graded leniently. Keep up with the readings, participate in class, and show her that you're putting in effort and you'll be fine. ", "rating": 4, "expected_grade": "", "created": "2011-05-16T12:20:00Z"}, {"professor": "Carmen Benito-Vessels", "course": "SPAN303", "review": "Carmen is absolutely adorable. She's an older woman from Spain and really cares about literature and culture. There's not a lot of grades in class, so participation is really important, but she is flexible and understanding about pretty much anything. Her two tests are extremely reasonable and she usually only gives out As and Bs as final grades.", "rating": 5, "expected_grade": "A", "created": "2011-04-05T13:53:00Z"}, {"professor": "Carmen Benito-Vessels", "course": "SPAN303", "review": "She has been one of the worst teachers I have had so far. A native speaker of spanish, she seems to have little grasp of the english language and the one time I went to her to ask a question Im pretty sure she didnt understand what I was saying and did not help answer my question whatsoever.\n\r\nShe had us drop off our term paper in her mailbox on the last day of finals, and at the time she said it would be open it was closed. She also had a substitute teacher come to class on the day we had our MIDTERM so we couldnt ask questions, and did not let us know in advance that she was going to do that.\n\r\nShe most certainly plays favorites, and if youre shy to talk in class she wont like you. She also cares more about quantity over quality. I found that while writing decent things but in shorter lengths she gave me bad grades. When I lengthened what I was writing, though not adding any better content, she gave much higher grades.\n\r\nThis is NOT a teacher I would reccomend taking a class with if you are quiet in class, and bad at bullshitting to make your essays longer. I will never take another class with her.", "rating": 1, "expected_grade": "", "created": "2010-11-17T18:47:00Z"}, {"professor": "Sofia Maurette", "course": "SPAN303", "review": "Pretty harsh grader and is rlly scary also she yeeted for 2 weeks ", "rating": 2, "expected_grade": "B", "created": "2019-10-10T04:40:25Z"}, {"professor": "Sofia Maurette", "course": "SPAN303", "review": "dude this teacher sucks do not take her... such a harsh grader for absolutely no reason at all, despite the fact that the material isn't difficult.  She's nice enough and will basically tell you what is going to be on the tests, but will take off points even if you write the answers she tells you to put down in class... absolutely ridiculous. ", "rating": 1, "expected_grade": "", "created": "2020-05-03T16:49:41Z"}, {"professor": "Sofia Maurette", "course": "SPAN303", "review": "Very hard grader for no reason.  Not much leeway during COVID either...", "rating": 2, "expected_grade": "P", "created": "2020-05-15T23:12:39Z"}, {"professor": "Carmen Benito-Vessels", "course": "SPAN303", "review": "Carmen is a sweet elderly lady who treats her students with the utmost respect. The class was pretty poorly organized, but it's unclear if that was more her fault or if the whole course is just poorly organized. That said you can tell she is very knowledgeable and passionate about many of the course topics. Tends to call on students at random in class so it's important that you have done the readings for that day. Very lenient grader.", "rating": 4, "expected_grade": "A+", "created": "2021-01-13T06:55:03Z"}, {"professor": "Ryan Long", "course": "SPAN303", "review": "Professor Long is an extremely caring person. He treats his students with a great amount of respect and patience. He is flexible with due dates (to a certain extent) and always provides constructive criticism when necessary. You can really tell he cares about teaching and providing an open space for discussion in class. If you do the homeworks and participate in class, it will be extremely difficult to fail. ", "rating": 5, "expected_grade": "", "created": "2021-12-21T04:50:33Z"}, {"professor": "Mehl Penrose", "course": "SPAN303", "review": "He was great! SPAN303 class may seem like a lot to some but that'll be the case w any teacher. The first two weeks I thought it was going to be dull but he keeps it interesting and is funny and vocal. Very understanding professor and wants everyone to do well.", "rating": 5, "expected_grade": "A", "created": "2022-07-21T21:10:35Z"}, {"professor": "Eyda Merediz", "course": "SPAN303", "review": "Overall, I enjoyed taking Prof Merediz's course. She is funny and knowledgeable. Expect to have quite a few assignments a week (film analysis, literature analysis, or a mix of both). While you could get away with putting minimal effort into them, I suggest taking them seriously, as the questions she asks explore concepts and themes that will be on the midterm and the final. They may feel like busy work (I'd argue that sometimes they are), but they can serve as a good study resource if done well. She teaches based off of slides that contains few words, so sometimes it is challenging to discern what to takes notes on- this is why I'd recommend using the homework assignments to guide your note-taking. During lectures, I just listened and jotted down recurring concepts and terminology. Some materials can be a bit dense if your Spanish skills aren't nearing those of a fluent/native speaker. If you fall into that category, don't worry, she reviews materials in class and gives out assignments that mirror potential exam questions so you know what to expect. The final analysis paper is divided into 3 steps (outline, draft, final) and takes a nontrivial amount of time, so be sure to start early and utilize office hours. ", "rating": 4, "expected_grade": "A-", "created": "2022-08-15T17:32:19Z"}, {"professor": "Marcela Risso", "course": "SPAN303", "review": "Honestly an amazing teacher. She's very smart, knows what she's talking about, funny, and quirky in a very endearing way. She's really authentic and doesn't have a filter, which I appreciated. You can tell that she really cares for her students and if you need to meet with her, she will do so happily. She wants to see you succeed which is really necessary for a class that moves super fast and doesn't provide too much time to delve into too much details.\r\n\r\nThe only thing I noted that some may have problems with is that usually for the first 10 minutes of every class she'll talk to us in English about something completely unrelated to the material. It's usually really interesting though and should be known that I have no problems with it, it just reminds me a bit of this tiktok: https://www.tiktok.com/@kanye_west_bible_study/video/7161620906929016110?is_from_webapp=1&sender_device=pc&web_id=7150031634174199339\r\n\r\nOverall, I definitely recommend her. She takes what is normally a very stressful and/or boring class and turns it into something so much better.", "rating": 5, "expected_grade": "A", "created": "2022-12-11T01:00:32.721934Z"}, {"professor": "Chris Lewis", "course": "SPAN303", "review": "Profesor Lewis is very caring and down to earth, he genuinely cares about his students and the content. I highly recommend taking a class with him!", "rating": 5, "expected_grade": "A", "created": "2022-12-13T01:09:24.129768Z"}, {"professor": "Jackson Monzon", "course": "SPAN303", "review": "Took this professor over the summer and do not recommend. Worked like crazy and was one of 4 people in my class. Despite consistent participation and class sized repeatedly gave harsh grades for participation and other assignments.", "rating": 1, "expected_grade": "A-", "created": "2023-02-13T17:56:23.590054Z"}, {"professor": "Chris Lewis", "course": "SPAN303", "review": "Good professor that clearly cares about his students. Class was pretty tight-knit since it was so small and the in-class discussions were pretty productive. Both the midterm and the final were quite long given the time we had and the vast majority of the class did not finish.", "rating": 4, "expected_grade": "A-", "created": "2023-05-18T01:51:38.007557Z"}, {"professor": "Ligia Gonzalez", "course": "SPAN303", "review": "I took this class in the spring 2023 semester. Profesora González is very kind and encourages discussion about the course content. She values participation and graded for it, so be prepared to speak up at least once every class. You'll need to put in some effort, there's weekly homework assignments (mostly analysis questions for some kind of text). There's a midterm which included an essay portion, but was fairly simple if you review the material. There's a final exam, one research paper and an oral presentation of key points from your research. It may sound like a lot, but I really enjoyed this class. She was very eager to teach the material and make it interesting, ranging from analyzing political speeches to poetic terminology to movie scenes. She gave feedback and graded assignments quickly, too (aka didn't wait until the end of the semester to grade everything). Just be prepared to speak almost 100% in and for basically all instruction to be in Spanish.", "rating": 5, "expected_grade": "A+", "created": "2023-08-23T18:13:57.046923Z"}, {"professor": "Daniela Hernandez", "course": "SPAN303", "review": "-If you are gonna take SPAN 303, take it with her. I am a Spanish minor and this course is probably the hardest course in the entire class req list. But she makes it so simple and helpful. Lectures can get a little boring and lengthly but there's always discussions and she actually cares that you understand the material. \r\n-Very welcoming and understanding if you make a mistake, she's willing to help you. Midterm was very simple, and quickly responds to emails literally at anytime of the day. \r\n-Would recommend her to anyone. \r\n-Only issue I have is that in order for her to explain assignments you have to email her about them, she doesn't go over the assignments she assigned in class.", "rating": 5, "expected_grade": "B", "created": "2023-10-26T13:47:27.671514Z"}], "department": "SPAN", "course_number": "303", "name": "SPAN303", "title": "Approaches to Cultural Materials in the Hispanic World", "credits": 3, "description": "<b>Prerequisite:</b> SPAN301.\n<b>Recommended:</b> May elect to take SPAN311 and/or SPAN316 in same semester as SPAN303.\nDevelopment of proficiency in critical thought through the reading, viewing, and analytical discussion of major genres and styles of cultural materials selected from Spanish-speaking world. Taught in Spanish.", "is_recent": true, "geneds": null}