{"average_gpa": 3.661804087385483, "professors": ["Taylor York", "Kate Yanchulis", "Sarah Scriven", "Melissa Stevens", "Clara Montague", "Amira Lundy-Harris", "Jocelyn Coates", "Sina Lee", "Danielle Laplace", "Rahma Haji", "Caitlin Leach", "Michelle Rowley", "Jocelyn Coates", "Melissa Stevens", "Sarah Scriven", "Taylor York", "Caitlin Leach", "Eva Peskin", "Jaime Madden", "Jocelyn Coates", "Melissa Stevens", "Rahma Haji", "Renee Scott", "Sarah Scriven", "Adreanna Nattiel", "Amira Lundy-Harris", "Damien Hagen", "Jaime Madden", "Jocelyn Coates", "Melissa Stevens", "Michelle Rowley", "Renee Scott", "Sarah Scriven", "Damien Hagen", "Eva Peskin", "Eva Peskin", "Jaime Madden", "Michelle Rowley", "Damien Hagen", "Jaime Madden", "Melissa Stevens", "Rahma Haji", "Renee Scott", "Taylor York", "Jaime Madden", "Michelle Rowley"], "reviews": [{"professor": "Sina Lee", "course": "WGSS250", "review": "I really enjoyed her class and her teaching style. Because the class size was small it was easy to participate in group discussions. The work load is reasonable and she gives plenty of extra credit opportunities.", "rating": 5, "expected_grade": "B", "created": "2021-12-03T00:59:05Z"}, {"professor": "Sina Lee", "course": "WGSS250", "review": "Extremely nice and personable. She creates a really nice and friendly environment in class which makes group discussions very nice and easy to participate in. Also, if you are a guy who is genuinely interested in this class but questioning whether you \"should\" take it, if you take it with Sina and put effort in she does an amazing job at not making you feel alienated. Though, she might make a few funny jokes about it throughout the semester. Overall very good experience that was not too demanding but also covered some interesting topics. ", "rating": 5, "expected_grade": "A", "created": "2021-12-10T04:58:44Z"}, {"professor": "Kate Yanchulis", "course": "WGSS250", "review": "Very sweet professor and pretty accommodating. Material is somewhat interesting. Some outside readings for homework but it never takes long and she goes over them in class. Class reflections every few weeks, one more artistic assignment, and two larger writing assignments, but nothing crazy. Definitely recommend for a gen ed. (she does take attendance/participation so show up tp class!)", "rating": 4, "expected_grade": "A", "created": "2021-12-16T14:39:03Z"}, {"professor": "Jocelyn Coates", "course": "WGSS250", "review": "She's probably the most compassionate and kindest teacher I've ever met. I was going through a lot of personal issues during the semester, so I didn't turn in a lot of things on time. However, she was always understanding and willing to grant extensions for the projects (midterm and final essays), and even accepted all late homework assignments with no penalty. She really wants all the students to have a good experience. Even though I took this solely for a gened, I really enjoyed the topics/class discussions and learned a lot.", "rating": 5, "expected_grade": "A", "created": "2022-01-26T00:02:59Z"}, {"professor": "Danielle Laplace", "course": "WGSS250", "review": "Recommend taking her. The course is very manageable but very discussion based and a lot of reading. But, you can still get participation points other ways.  She makes the course interesting and intriguing ", "rating": 5, "expected_grade": "A", "created": "2022-03-30T13:54:23Z"}, {"professor": "Jocelyn Coates", "course": "WGSS250", "review": "LOVE this class and this professor. It is a great course that teaches important topics but it won't drown you in work. There are weekly readings, mandatory attendance, and some small participation activities in class but the work is pretty relevant to today's political climate and she is so flexible if you have conflicts or need an extension. There are 2 papers throughout the course and one of them is the final but she explains everything really well and is always ready to provide assistance if you ask. She really just wants her students to succeed. This was a really good class to lighten my course load but also keep me interested and engaged. 10/10 recommend. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-09T17:10:16Z"}, {"professor": "Kate Yanchulis", "course": "WGSS250", "review": "I did not like her at all graded it way too harsh and did not treat it like just a gen ed class, and I would not retake it or tell anyone else to take it, at least not with her; the course itself is fine she is the problem.", "rating": 2, "expected_grade": "B", "created": "2022-05-16T06:05:15Z"}, {"professor": "Jocelyn Coates", "course": "WGSS250", "review": "This was my favorite class by far this semester! As said in the previous reviews, the course load is not bad at all. She frequently allows students to share what's going on in their lives and wants to create an environment where people aren't overwhelmed. She is great with clarifying anything and gives extensions if need be. I also found myself loving the material more in this class because of the in-class discussions and feeling as though I was learning more than in any other class this semester. I 100% recommend. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-17T19:50:19Z"}, {"professor": "Caitlin Leach", "course": "WGSS250", "review": "Super kind and respectful. While there is a decent amount of reading, she does make the effort of dropping certain grades in order to lessen the workload. The class is interesting, and she is really passionate in the topics. She takes super complicated topics and makes them accessible and interesting. All of the discussions are super inviting, although it helps if you participate. I would 100% recommend taking a class with her.", "rating": 5, "expected_grade": "A", "created": "2022-10-28T20:34:05.472956Z"}, {"professor": "Jocelyn Coates", "course": "WGSS250", "review": "Absolutely love Professor Coates. She cares so much about the material, is so understanding, and really wants us to learn about different perspectives. You do need to come to most classes and participate. There are 4 discussion posts and 2 papers that are easy to do well on. I would 100% recommend this class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-08T17:39:22.866264Z"}, {"professor": "Eva Peskin", "course": "WGSS250", "review": "The class was self-led and there were about 3 assignments due every 2 weeks. The courseload is very light and a great elective to take. I also really liked the professor since she was very lenient about extending due dates and considerate of the students. I definitely recommend taking this class with this professor.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T23:29:11.994547Z"}, {"professor": "Jocelyn Coates", "course": "WGSS250", "review": "Professor Coates is a great professor! She was always super understanding with absences and extensions and she always checked in on how we were doing. Every class is essentially a discussion and you need to read the given readings before class. I did appreciate that we had small discussion groups and then shared as a class. We also had 4 discussion posts and 2 essays (one was the final).  Overall, I learned a lot from this class and would highly recommend it!", "rating": 5, "expected_grade": "A", "created": "2023-01-04T17:28:51.810624Z"}, {"professor": "Sarah Scriven", "course": "WGSS250", "review": "goat", "rating": 5, "expected_grade": "A+", "created": "2023-02-02T20:42:13.424061Z"}, {"professor": "Michelle Rowley", "course": "WGSS250", "review": "I had to take this class because I needed a last minute gened that was online but i’d recommend you not take this class at all. Rowley is very rude and expects so much out of the class. She makes you log your participation throughout the class on a point system that’s extremely confusing and if you make a mistake, she gives you a snarky comment. She’s not understanding because even though i joined the class a week late, she was not helpful in getting me on track and rather took off points and told me i was wrong. I didn’t have my camera on for one small portion of the class and me and someone else in a breakout room were muted when she came in and she made a rude comment about us not talking. Don’t take this class. Definitely not worth the effort given it’s level and topic.", "rating": 1, "expected_grade": "", "created": "2023-02-14T14:27:23.023667Z"}, {"professor": "Amira Lundy-Harris", "course": "WGSS250", "review": "One of the easiest classes you can take. Prof encourages class discussion off the assigned readings but never took attendance so you really don't have to go every time. There's a weekly discussion post (easy), a one page midterm paper (easy), a museum visit and a two page reflection (easy), and a 5-7 page final paper on a feminist music album (just annoying if you ask me). The reason this doesn't get 5 stars is because their lectures were brutal. Interesting stuff, but he never seemed that excited to teach and it felt pretty disorganized and pointless. This prof is definitely easier and more chill than others in this course though.", "rating": 4, "expected_grade": "A+", "created": "2023-05-09T18:45:37.936141Z"}, {"professor": "Sarah Scriven", "course": "WGSS250", "review": "Amazing teacher. Communicates all class expectations well and makes class fun and engaging. I originally took this class to get an easy A but it is so much more than that. I recommend this class because you will learn things and consider aspects of life that you might not have ever thought about before.", "rating": 5, "expected_grade": "A+", "created": "2023-05-12T05:51:38.547322Z"}, {"professor": "Renee Scott", "course": "WGSS250", "review": "I would not take again. Super harsh grader, doesn't respond to emails even though its the only way to access her, doesn't post assignments on time and gets upset when she gets tons of emails. Not clear on directions, and almost impossible to get ahold of/know what your assignments are for that week.", "rating": 2, "expected_grade": "A", "created": "2023-05-16T12:50:42.015317Z"}, {"professor": "Michelle Rowley", "course": "WGSS250", "review": "she's misunderstanding, rude, and demeaning toward her students. she definitely has her favorites too, which is unfair to other students. she has super high expectations despite knowing that we're all taking more classes than just hers. she also assigns you an unrealistic amount of readings and expects you to write about them every other week. it's insane. don't take her class.", "rating": 1, "expected_grade": "A", "created": "2023-11-02T21:59:10.228326Z"}, {"professor": "Michelle Rowley", "course": "WGSS250", "review": "im adding to my other review. she refuses to compromise with her students. she assigned us to go to an event that was required for the midterm, but it was in the middle of the day at a time other than our class time, which i had a meeting. after telling her i couldn't go, she refused to help me or even find a recording (which she could've done in the first place for students who couldn't make it). she also had this super weird point system that half the class couldn't understand and it made seeing my grade in the moment very difficult. again, don't take her class.", "rating": 1, "expected_grade": "A", "created": "2023-11-03T06:14:20.558616Z"}, {"professor": "Michelle Rowley", "course": "WGSS250", "review": "This year professor Rowley made every assignment completion. So pretty much if you do the assignments you get an A. The work load is fair. She has weekly readings but i never read them because they were extremely long. You have to write three reading reflections within the year (you chose when you want to complete them) and that was the only time I looked at the readings. Her lectures are interesting and make it easy to get participation points.", "rating": 4, "expected_grade": "A", "created": "2023-11-30T05:15:15.181940Z"}, {"professor": "Michelle Rowley", "course": "WGSS250", "review": "This class definitely has a lot of work from the pre-class readings to reading-reflections to the insanely long final, but I think it was all worth it. Professor Rowley always made lectures really engaging and always managed to make the readings make sense and feel relevant. I definitely came out of the class having learned a lot that I can use in other areas of my studies and life with her focus on different frameworks and models of viewing art/the world. \r\nEspecially with the change to a completion-based grading model, it is not that difficult to get an A (or a B by simply not doing as many assignments). Attendance is mandatory as participation is a part of your grade, so just be prepared to ask and answer questions in class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T21:02:17.240388Z"}, {"professor": "Jaime Madden", "course": "WGSS250", "review": "Professor Madden is a good professor overall. Her classes are quite interesting and engaging. The course assignments involve a diverse range of activities (short written responses every week, 3 essays, 2 groups assignments, and a gallery visit), but she explains them thoroughly, ensuring students understand the expectations and requirements. She is responsive to studen's requests and feedback, so don't hesitate to reach out with any questions. It's worth noting that she adheres strictly to due dates and deadlines. Overall, I would recommend her to fulfill the DSHU gen-ed credit.", "rating": 5, "expected_grade": "A-", "created": "2024-01-11T14:58:56.722879Z"}, {"professor": "Kate Yanchulis", "course": "WGSS250", "review": "Was so bad and so rude, would never take as a woman I really did not feel ok with the way she would treat me and others in the calss", "rating": 1, "expected_grade": "D", "created": "2024-01-28T23:25:07.197058Z"}], "department": "WGSS", "course_number": "250", "name": "WGSS250", "title": "Introduction to WGSS: Art and Culture", "credits": 3, "description": "<b>Credit only granted for:</b> WMST250 or WGSS250.\n<b>Formerly:</b> WMST250.\nProvides students with a critical introduction to the ways that art and art activism have served as a conduit to understanding and challenging systems of inequity and practices of normativity. Interrogating the categories of gender, sexuality, race, class, ability, the course will provide students with an examination of how artists have responded to pressing social justice issues of their eras. While the course centers visual art, students will also engage genres such as music, plays, literature, digital and performance art as arenas of social change.", "is_recent": true, "geneds": null}