{"average_gpa": 3.0339914445541294, "professors": ["Dennis Doster", "Robert Choflet", "Renina Jarmon", "Renina Jarmon", "Robert Choflet", "Angel Dunbar", "Renina Jarmon", "Robert Choflet", "Sharon Harley", "Ashley Newby", "Renina Jarmon", "Robert Choflet", "Robert Choflet", "Dorith Grant-Wisdom", "Angel Dunbar", "Robert Choflet", "Sharon Harley", "Ashley Newby", "Angel Dunbar", "Ashley Newby", "Robert Choflet", "Angel Dunbar", "Ashley Newby", "Robert Choflet"], "reviews": [{"professor": "Sharon Harley", "course": "AASP202", "review": "I loved this class. Yes you HAVE to go to lecture but its totally worth it...There is alot of material but Prof. Harley makes it very easy to follow and understand...My T.A. was pretty helpful but then again I only needed his help once...The workload is pretty decent for the amount of material you actually learn....TAKE THIS CLASS WITH PROF. HARLEY!!! She's the best!", "rating": 5, "expected_grade": "A", "created": "2009-11-23T15:57:00Z"}, {"professor": "Sharon Harley", "course": "AASP202", "review": "Class focused on black culture in post-emancipation era, Harlem Renaissance,black arts movement, and hip hop. Going to lecture is a MUST because she gives A LOT of notes that are not online. Like most African American studies class, there is a lot of reading.  The quizzes are True/False and they are pretty fair.  She gives a mid-term exam and a final exam that covers a lot of material. And there is also a  6-7 page mid-term paper. Harley  makes lecture a little interesting sometimes by throwing in some of her personal stories and jokes.  However, her TA's are not very helpful.   ", "rating": 3, "expected_grade": "A", "created": "2007-12-20T21:10:00Z"}, {"professor": "Renina Jarmon", "course": "AASP202", "review": "Prof.Jarmon is very insightful and engaging in class but be prepared to do a lot of reading and writing. If you're not interested in the content you'll struggle to finish all of the work she asigns because it's a lot. If you take her classes be direct with her and ask questions! She's very responsive to feedback. Beware! She takes forever to grade, so if you get anxious about that sort of thing don't take the class. Overall she was quite caring and loves what she teaches so you won't be bored by her! ", "rating": 4, "expected_grade": "", "created": "2020-12-19T00:50:47Z"}, {"professor": "Robert Choflet", "course": "AASP202", "review": "Overall great professor. He was responsive to concerns and questions that everyone else had, and he made sure to communicate any schedule changes ahead of time for adequate preparation. He is a nice guy and genuinely wants everyone to succeed in class. \r\nThree things:\r\n1) It takes him awhile to grade stuff. I took this class in the fall and some of the assignments from October were not graded until Thanksgiving. \r\n2) He assigns a lot of readings. It's not too overwhelming, but as someone taking 2 math classes at the same time, it was a little much in terms of a personal workload\r\n3) Lectures can get a little dry in the latter half of class.  The more people who participate, the better it gets. ", "rating": 4, "expected_grade": "A-", "created": "2021-12-08T14:37:37Z"}, {"professor": "Renina Jarmon", "course": "AASP202", "review": "Do not take her class. Jarmon is very unorganized. She assigns a lot of work and expects you to refer to her documents to know what is due and when it is due, but she had the dates from last semester on her documents so you couldn't know when stuff was due. She also moves her class onto zoom after a couple weeks which is annoying for a class where most of the class time is spent discussing course content. Also, right now we are two weeks from the last day of classes and she hasn't given a grade on any assignment. She also wastes a lot of class time. In several instances she will spend the first 5-15 minutes not saying anything or talking about something that is irrelevant. ", "rating": 1, "expected_grade": "", "created": "2022-04-26T15:21:30Z"}, {"professor": "Sharon Harley", "course": "AASP202", "review": "Very nice lady but horrible professor. Had us do around ten PowerPoints in teams for the first half of the semester that weren’t even on the syllabus. Then, still didn’t put the grades in for it. Quizzes and exams are confusing because of her wording, and lectures will have you lost. Very smart woman but nope.", "rating": 2, "expected_grade": "B", "created": "2022-12-11T07:38:02.802363Z"}, {"professor": "Robert Choflet", "course": "AASP202", "review": "Great Professor and great course. Class focused on major readings and group projects, but it was chill.", "rating": 5, "expected_grade": "A+", "created": "2022-12-29T05:20:03.350343Z"}, {"professor": "Dorith Grant-Wisdom", "course": "AASP202", "review": "The course itself is EXTREMELY reading-heavy with long and complicated readings that take hours to complete. It is WAY too much work for an intro level 200 class, I have never had this much reading expected of me in a class. Dr. Grant-Wisdom is so focused on if students read that she spends all of her time in class trying to catch someone who didn't read so she can expose them. Her slides are unorganized, she is constantly late to class, and it took her a month and a half to grade an essay that was worth a large chunk of our grade. She does not care about her students, she argues with them in class, tries to prove people wrong and call them out, is rude, and frankly not a good teacher. She has slides with quotes, which she uses to lecture, but constantly goes off-topic and gets very confusing. She has called students stupid and belittled them for not knowing things when she has been wrong about things but refuses to change her mind. She kept threatening to change the virtual final to an in-person one because she felt students were cheating and was so worried that she is trying to change the 'hybrid' aspect of the course. The worst part is, she was not even supposed to be the instructor. We were supposed to have Dr. Newby by Dr. Grant-Wisdom was asked to take over and she is trying to change aspects of the course that do not need to be changed. She does not care about her students, is extremely closed-minded, and is SO focused on us cheating that she is policing us and almost expecting us to cheat when no one has. She says she is retiring soon and I hope that is true.", "rating": 1, "expected_grade": "A-", "created": "2023-05-08T17:12:44.885660Z"}, {"professor": "Robert Choflet", "course": "AASP202", "review": "AASP202 was okay. It was a lot of reading which was a lot. We did 2 big group projects throughout the semester. The mid-term and final aren't too bad though as they are open note, but it is important to note you know the content and review. Dr. Choflet was a nice and chill professor too. Only thing that was frustrating was how he did not answer emails, and took a long time to grade. He was kind of a little boring too, and the class size diminished as the semester went on. If you need a gen-ed this is a good course but we warned you must put in effort to get a good grade.", "rating": 3, "expected_grade": "B+", "created": "2023-05-16T02:17:39.593610Z"}, {"professor": "Ashley Newby", "course": "AASP202", "review": "Prof Newby is very down to earth, relatable, and pleasant to learn under. The assignments mainly composed of a discussion post every week+about 3 major writing assignments. Take this class if it is open", "rating": 5, "expected_grade": "A-", "created": "2023-12-14T22:42:47.951766Z"}, {"professor": "Robert Choflet", "course": "AASP202", "review": "If you have the chance to be taught by Professor Choflet, do it. He asks questions to get to know his students, and he genuinely loves what he does, which is reflected in the way he teaches. The assignments are not hard at all, but sometimes the readings are a lot. As someone who reads for fun outside of class, I got really good at skimming through books, which is an extremely helpful ability in this class. You will be okay to miss a couple of readings, but if anything, go to class. I feel like a bulk of the content is reviewed in class by him anyway, so even if you are behind in the reading, the lectures will help you catch up. I took this class for a GenEd, so I wasn't expecting much, but this was easily my favorite class of this semester, and a lot of it is owed to Choflet.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T17:27:15.137191Z"}, {"professor": "Robert Choflet", "course": "AASP202", "review": "Honestly one of the best classes I've had at UMD to date. The man loves what he teaches and he's so laid back that it's a perfect combo. He's quite knowledgeable in African American studies and by the end you will be too. There was quite a lot of reading and each chapter was at least 45 pages but if you skim, you'll likely get the gist. Also, the best part was that the very next class he'd explain the readings to you anyways and there weren't any assignments attached typically. There were a couple of group assignments, reading journals/black culture projects and then there was the mid-term and final which were both open notes. If you want to learn while also taking a fairly easier A (not easy just easier), I'd definitely recommend this one for you.", "rating": 5, "expected_grade": "A", "created": "2024-01-19T05:07:35.891738Z"}], "department": "AASP", "course_number": "202", "name": "AASP202", "title": "Black Culture in the United States", "credits": 3, "description": "The course examines important aspects of African American life and thought which are reflected in African American literature, drama, music and art. Beginning with the cultural heritage of slavery, the course surveys the changing modes of black creative expression from the 19th-century to the present.", "is_recent": true, "geneds": null}