{"average_gpa": 2.3000000000000003, "professors": ["Emily Perez", "Laura Williams", "Douglas Kern", "Isis Semaj-Hall", "Christin Taylor", "Anna Steed", "Zita Nunes", "Mary Washington", "Edlie Wong", "Lewis Gleich", "Abbey Morgan", "Delisa Hawkes", "Timothy Bruno", "Norrell Edwards", "Sarah Humud", "Dominique Young", "Steve Beaulieu", "Mike Kolakoski", "Andy Yeh", "Elizabeth Catchmark", "Chauncey Dennie", "Alexandria Nunn", "Elizabeth Catchmark", "Chauncey Dennie", "Fredrick Cherry Jr", "Tyra Griffin", "Fredrick Cherry Jr", "Anthony Batts", "Tyra Griffin"], "reviews": [{"professor": "Zita Nunes", "course": "AASP298L", "review": "so easy its ridiculous. 2 quizzes a week, interesting reading if you like to read, lectures get way boring as time goes on\n\r\nall TAs are good it seems but the best is STEED. discussion is always good\n\r\nB on midterm and A on first paper, haven't gotten second paper grade", "rating": 4, "expected_grade": "A", "created": "2009-05-05T22:43:00Z"}, {"professor": "Zita Nunes", "course": "AASP298L", "review": "Interesting class, and the professor is extremely knowledgeable on the subject matter. The quizzes are easy if you do the reading, but there is A LOT of reading. Two papers are assigned throughout the semester, and the grading is pretty tough. Quizzes are given in the first 5 minutes, so you cannot be late, and if you are you get a zero. She drops the two lowest quiz grades.", "rating": 3, "expected_grade": "B", "created": "2008-12-11T18:11:00Z"}, {"professor": "Mary Washington", "course": "AASP298L", "review": "So, let me start off with the positive. The professor is very passionate about what she is teaching and I can honestly say that the material and readings were interesting. However, this is not an easy A. I got a B+ in the class. Granted, I didn't read half of the books, but even when I did read, the quizzes were very difficult. Also, the final is cumulative and it's like impossible to remember everything that happened in every story that we read over the course of the semester. And yes, this is a literature class, so there was a lot of assigned reading. But to end on a good note, the stories that I did read, I highly enjoyed. ", "rating": 4, "expected_grade": "B+", "created": "2011-06-20T00:14:00Z"}, {"professor": "Mary Washington", "course": "AASP298L", "review": "I got an A- in this class, and it was not easy. MaryHelen reviews books online, her material is hard. the final is almost impossible, quizzes annoying. Papers do able. Try to get anna steed as your TA, she is the best ive come to realize that at the end. ", "rating": 4, "expected_grade": "B", "created": "2011-05-24T16:06:00Z"}, {"professor": "Elizabeth Catchmark", "course": "AASP298L", "review": "This course in general has a lot of reading, but she is very good at giving a lot of good discussion time and being very flexible with due dates (She literally said that if one of her papers was due on a day you had a lot of stuff for other classes, she would let you get an extension for her class) Very informative and knowledgeable.  She gives a lot of discussion boards, projects, and mini-papers, which usually help to build up ideas for bigger projects and pad your grade as long as you put in a little effort. Her main focus is on studying literature that shows the medical system's disparities and talking about fear of black groups for holding leftist ideologies (I.E Black Panthers, Socialist groups), but she covers a lot of other socio-cultural topics (LGBTQ topics, HIV crisis among black men, Black Women's issues, Failures of \"white\" feminism, etc.) ", "rating": 5, "expected_grade": "A", "created": "2020-11-30T17:22:24Z"}, {"professor": "Elizabeth Catchmark", "course": "AASP298L", "review": "The absolute best!!! Trust me", "rating": 5, "expected_grade": "A+", "created": "2021-01-27T03:59:44Z"}, {"professor": "Alexandria Nunn", "course": "AASP298L", "review": "I think professor Nunn was a great professor. I took her class the first semester of my freshman year. There are a shit ton of readings but you don't actually need to do them, I would always look up summaries for the weekly discuss boards. Don't be afraid to participate in class, the more you get your voice out there the better. Work load is pretty large but you know about all the assignments from the first day so are long as you plan things out you will be fine. Professor Nunn really cares about her students, has a profound knowledge of this class and is funny. From a major procrastinator, this class is very doable ", "rating": 5, "expected_grade": "A+", "created": "2022-04-25T20:19:14Z"}, {"professor": "Tyra Griffin", "course": "AASP298L", "review": "Tyra is a Super enjoyable professor and was a pleasure to work with. Her class discussions are the most interesting parts of the class and will leave you with something to think about/consider for days. She is always easy to work with and does not want to make anything too complicated. I'm happy to say I actually learned quite a bit during her class and challenged myself She's great, please don't stress her out!! :-D", "rating": 5, "expected_grade": "A+", "created": "2023-05-15T22:41:23.714145Z"}, {"professor": "Chauncey Dennie", "course": "AASP298L", "review": "Chill professor, Slightly boring literature, Great Discussions, Reasonable Assignments. He didn’t really care about attendance or being nitpicky with assignment criteria which I found awesome! Our class discussions were very entertaining and you sign up for a presentation slot to present a specific part in the book the class reads. But you also have to participate in class debate with other groups who ask you questions about the novel. And a course playlist and a few papers at most. But this class was fair! It wasn’t the most interesting class out there for me personally because of the literature. And also, this was a last-minute decision class. But this professor was really nice so I’m all for it.", "rating": 4, "expected_grade": "A", "created": "2023-09-04T08:04:23.730884Z"}], "department": "AASP", "course_number": "298L", "name": "AASP298L", "title": "African-American Literature and Culture", "credits": 3, "description": "<b>Cross-listed with:</b> ENGL234.\n<b>Credit only granted for:</b> ENGL234 or AASP298L.\nAn exploration of the stories black authors tell about themselves, their communities, and the nation as informed by time and place, gender, sexuality, and class. African American perspective themes such as art, childhood, sexuality, marriage, alienation and mortality, as well as representations of slavery, Reconstruction, racial violence and the Nadir, legalized racism and segregation, black patriotism and black ex-patriots, the optimism of integration, and the prospects of a post-racial America.\n<i>Cross-listed with ENGL234. Credit granted for AASP298L or ENGL234.</i>", "is_recent": true, "geneds": null}