{"average_gpa": 3.1820809248554918, "professors": ["Jonathan England", "Gniesha Dinwiddie", "Alana Hackshaw", "Cecily Hardaway", "Cecily Hardaway", "Ashley Newby", "Ashley Newby", "Cecily Hardaway", "Dorith Grant-Wisdom", "Ashley Newby", "Chinyere Osuji", "Alana Hackshaw", "Alana Hackshaw", "Chinyere Osuji", "Cecily Hardaway", "Periloux Peay", "Cecily Jackson", "Chinyere Osuji"], "reviews": [{"professor": "Jonathan England", "course": "AASP101", "review": "Like everyone else has said, he's a very good teacher. AASP101 in general will be any easy A for you, but beyond that he really gives you an interest for politics and afroamerican studies if you are just entering the field as a freshman or sophomore. He encourages you to think about things from a wider perspective. You will never be bored in class. I also had him for an online course that was really interesting. Though more demanding. Still got an A though. Definitely take him!", "rating": 5, "expected_grade": "A", "created": "2009-01-28T09:54:00Z"}, {"professor": "Jonathan England", "course": "AASP101", "review": "Great teacher.  I had the chance to take this class during the 2008 election cycle, which led to some great discussions.  Really knows what hes talking about and provides a lot of information on the policy process and some key issues.  I would definitely take another class by him.", "rating": 5, "expected_grade": "A", "created": "2008-12-04T19:14:00Z"}, {"professor": "Gniesha Dinwiddie", "course": "AASP101", "review": "this class is boring. Everyone looks like they want to fall asleep during class! all it is is power points and facts anyone can look up! the group project was a bit much especially in the given time. she expects you to get in touch with a CEO of an organization when employees cant even do that! however boring it wasnt that hard if you actually studied or learned on your own.  ", "rating": 2, "expected_grade": "B+", "created": "2011-12-06T14:37:00Z"}, {"professor": "Gniesha Dinwiddie", "course": "AASP101", "review": "Dinwiddie was an OK teacher. SOmetimes her lectures were engaging, other times they weren't. When talking about statistics and stuff like that, you can tell she knew what she was talking about. Alot of other times during lectures, I found her hard to understand because every other word was (ummm, uhh, umm, uhh, umm, uhh) so yea pretty boring. The only good thing is that she posts all lectures online so you don't even need to go to class..\r\nHowever, the books she requires you to read in class aren't ideal. She expects us to read an entire 200 some page book in a week, like we don't have other classes. Books are a waste of money. Also, we have to read these 20 page small print readings online. pointless again. \n\r\nEasy class though. TA's are what make the class easier. Erika Thompson was a great TA. But it's about 5 papers and a midterm and exam and that's it. Easy diversity/political history credit.", "rating": 3, "expected_grade": "B", "created": "2011-10-20T23:06:00Z"}, {"professor": "Gniesha Dinwiddie", "course": "AASP101", "review": "she is a TERRIBLE lecturer. some of her points are interesting, but they are often lost along the way. she is also a difficult grader, and chooses clear favorites. mostly, i would avoid this class so that you don't have to sit through her attendance mandated lectures. discussion once every two weeks can be interesting, but watch out if she disagrees with you. ", "rating": 1, "expected_grade": "B", "created": "2011-05-10T20:20:00Z"}, {"professor": "Gniesha Dinwiddie", "course": "AASP101", "review": "Wow. The way this class was executed was atrocious. Dinwiddie is very knowledgeable but teaching and lecturing is not her strong points. The class was extremely unorganized and there was not a constant way she would assign assignments and papers. For example, sometimes assignments was given to us via email. Other times it's embedded in a powerpoint. Other times, word of mouth. The review session for the final was announced LESS THAN 22 HOURS from the time it was to be held! SERIOUSLY? I have a busy life and most professors respect that. Not in AASP100. They assume this class is the only class we are taking or something. Terrible, skip this class and take something else to fulfill your CORE requirements. I suggest a SOCY or ANTH class. Forget this one. Please, for your own sake, don't take it.", "rating": 1, "expected_grade": "B", "created": "2010-12-15T13:46:00Z"}, {"professor": "Cecily Hardaway", "course": "AASP101", "review": "Professor Hardaway is a great teacher and she seems to care about her students. The homework was always straightforward AND informative. She made the classes engaging and interactive. I really enjoyed her teaching, and she never assigned an unmanageable amount of homework. ", "rating": 5, "expected_grade": "A", "created": "2021-12-17T14:57:27Z"}, {"professor": "Chinyere Osuji", "course": "AASP101", "review": "Pros\r\n- Nice, funny, energetic, not much work\r\n- Interesting class material: required readings are actually introspective, videos are entertaining and interesting\r\nCons\r\n- Extremely disorganized\r\n- Wastes class time trying to get organized\r\n- Group assignments are poorly planned\r\n- Doesn't follow syllabus\r\n- Expects you to talk with peers to get info on missed classes", "rating": 2, "expected_grade": "A-", "created": "2023-05-02T17:04:13.994611Z"}, {"professor": "Chinyere Osuji", "course": "AASP101", "review": "Class material is interesting but taught in a disorganized way. Syllabus is vague at best and subject to constant changes throughout the semester. She is really unclear about what she wants submitted and where to submit it; sometimes just one group member submits the assignment, sometimes all members do. Assignments rarely have a rubric and when they do it is really unclear. Most if not all assignments are graded late and given little feedback. If you ask a question about a requirement that wasn't made clear you'll be made to feel bad just for asking. Was looking forward to the class material but her class just isn't worth it.", "rating": 1, "expected_grade": "A-", "created": "2023-05-11T17:58:04.820996Z"}, {"professor": "Chinyere Osuji", "course": "AASP101", "review": "Class structure is very disorganized. Assignments often don't have rubrics, and requirements are poorly communicated. She is often condescending when asked questions as well. Assignments are graded many weeks after their due date and given little feedback.", "rating": 1, "expected_grade": "B+", "created": "2023-05-15T14:57:14.351785Z"}, {"professor": "Chinyere Osuji", "course": "AASP101", "review": "Overall she's not the most organized and since it's an online course she should know how to work with technology but struggles at times. The class itself isn't that hard there aren't any midterms or a Final. It's mostly group work which can be annoying and it was a bit last minute at times. It is very much a go-with-the-flow class, you have 4 reflections to write and the lowest one is dropped. For me the reflections were the easiest to get A's on just make sure to participate because that's what gave me an A- instead of an A. She will not curve even for 89.99% so get all ur points!", "rating": 3, "expected_grade": "A-", "created": "2023-05-25T21:17:41.484056Z"}, {"professor": "Chinyere Osuji", "course": "AASP101", "review": "I would not recommend taking this class. It is completely online as of right now, but she said she might change that, so I would recommend the class even less. My roommate took it last semester and it was completely different. Now there are 3 quizzes and a final. The quizzes are confusing because multiple answers could be correct, but she chooses just one. Also, they are timed and sometimes you can not go back and check your answers after you move on to the next. The average of the quiz i just took was a 41/56 and no one got higher than a 47/56. Overall, theres too many readings. The quizzes are not easy and there should not be a final we have to take for a gen ed class. Don't take this class unless this information truly interests you.", "rating": 2, "expected_grade": "B+", "created": "2023-12-05T17:08:34.100344Z"}], "department": "AASP", "course_number": "101", "name": "AASP101", "title": "Public Policy and the Black Community", "credits": 3, "description": "<b>Formerly:</b> AASP300.\nThe impact of public policies on the black community and the role of the policy process in affecting the social, economic and political well-being of minorities. Particular attention given to the post-1960 to present era.", "is_recent": true, "geneds": null}