{"average_gpa": 3.7531578947368427, "professors": ["Terry Park", "Binod Paudyal", "Binod Paudyal", "Binod Paudyal", "Binod Paudyal", "Janelle Wong", "Binod Paudyal", "Binod Paudyal", "Binod Paudyal"], "reviews": [{"professor": "Binod Paudyal", "course": "AAST351", "review": "I took this course in Fall 2022\r\n\r\nPros:\r\n+ Extremely passionate and knowledgable about Asian American history\r\n+ Very relaxed if you miss deadlines. If you email him and politely explain your situation, he may grant you a deadline extension on minor assignments.\r\n+ There are weekly assignments, but they are short and essentially graded on completion.\r\n+ Overall, a very easy grader\r\n\r\nCons:\r\n- There are four short response assignments (500 words each), and they are definitely not spaced out over the semester properly. Two of them were due in the same month, with only a week gap between them", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T17:41:22.011267Z"}, {"professor": "Binod Paudyal", "course": "AAST351", "review": "Very nice professor and lenient if you need extensions. I will say there is a lot of work, but it's not hard work. There are weekly dense/long readings and annotations, but I barely read them and just did the notes on a few passages (completion grade). Attendance for class is mandatory as he does take attendance and makes in class activites (usually just an exit ticket type thing). There are short response papers throughout the class and a midterm paper. The final is a group project which you can choose. I decided on the 10-12 page essay with my group and it wasn't bad. Basically, just go to class and its fine.", "rating": 5, "expected_grade": "A+", "created": "2023-12-13T18:08:33.343037Z"}], "department": "AAST", "course_number": "351", "name": "AAST351", "title": "Asian Americans and Media", "credits": 3, "description": "<b>Credit only granted for:</b> AAST351, AAST398M or AAST398N.\n<b>Formerly:</b> AAST398M, AAST398N.\nFrom yellow peril invaders to model minority allies, Asian Americans have crafted their own dynamic cultural expressions in a number of media from film, television, and music to fashion, sports, and food that reveal and contest the contradictions of the U.S. nation-state. Asian American culture also uniquely sits at the nexus of immigration flows and digital technologies, providing a transnational lens to view the US place in the world. This advanced course, then, will introduce students to the study and practice of Asian American cyktyre as multiple , hybrid, and heterogeneous. It will do so through three sections: section one will introduce students to classical, cultural, and media concepts as well as relevant keywords outlined by Asian American Studies scholars; section two will review the work of Asian American cultural theorists; section three will focus on analyses of particular Asian American cultural productions. In doing so, students will gain an understanding of the shifting and interlocking tensions among the local, the national, and the global that form the cultural geographies of Asian America.", "is_recent": true, "geneds": null}