{"average_gpa": 3.306305506216696, "professors": ["Julie Park", "Janelle Wong", "Jeannette Soon-Ludes", "Terry Park", "Neha Singhal", "Binod Paudyal", "Binod Paudyal", "Binod Paudyal", "Jennifer Cho", "Jennifer Cho", "Binod Paudyal", "Jennifer Cho", "Binod Paudyal", "Julie Park", "Jennifer Cho", "Julie Park"], "reviews": [{"professor": "Julie Park", "course": "AAST200", "review": "Professor Park is a very reasonable professor. She is willing to adjust her expectations based on class feedback and performance. She expects you to do the readings and contribute in class, but other than that there is not consistently much work you have to put in.\n\r\nAssignments:\r\n3-4 pop quizzes, sometimes open book/open note\r\n1 final paper (5-7 pages)\r\n1 midterm\r\n1 final.\n\r\nShe has extra credit opportunities as well. \n\r\nIt is pretty critical that you pay attention and take notes in class, as all of her exams/quizzes are based heavily on this material.", "rating": 4, "expected_grade": "", "created": "2015-01-20T18:21:00Z"}, {"professor": "Julie Park", "course": "AAST200", "review": "Prof Park really isn't bad for AAST200. The key to getting a good grade is to pay attention to the the points she brings up over and over again as she will most likely test you on those (e.g. 1965 Immigration Act, Paper Sons...etc) There is a midterm, oral history paper, and final. She \"takes attendance\" by making you do these group assignments during class to turn in at the end. \n\r\nYou don't have to read any book except Asian American X. Show up and listen somewhat and you'll be fine.", "rating": 4, "expected_grade": "A", "created": "2011-05-24T03:44:00Z"}, {"professor": "Julie Park", "course": "AAST200", "review": "The readings assigned every class are at times boring but pretty manageable. The lectures are a little scattered and unorganized which makes it hard to follow but Professor Park is pretty nice. The midterm consists of 11 short answers and if you know the material, you'll do well. There aren't that many grades so if you do poorly on one of them it's really hard to get a good grade in the class.", "rating": 4, "expected_grade": "A", "created": "2011-04-09T22:04:00Z"}, {"professor": "Terry Park", "course": "AAST200", "review": "Engaging and nice professor. Very fair with grading and makes class interesting even though it is a gen-ed. 8/10 would take again", "rating": 4, "expected_grade": "A", "created": "2018-12-11T22:48:13Z"}, {"professor": "Terry Park", "course": "AAST200", "review": "I took both AAST200 and AAST398L with Dr. Park. He is an amazing professor who goes in depth with each topic described in the class. He is very informative and keeps class engaging on most days. I really enjoyed taking the two classes with him and felt like I could connect with him easily. He was very approachable.", "rating": 5, "expected_grade": "A", "created": "2021-02-03T23:28:45Z"}, {"professor": "Binod Paudyal", "course": "AAST200", "review": "TLDR: Nice guy, likes participations, enjoys the content.\r\n\r\nPaudyal was a breath of fresh air in the life of this Cs major. \r\nHis class was chill and straightforward. He enjoys what he teaches and provides interesting insight.\r\n\r\nHis lectures are a bit boring but very informative.\r\n\r\nHe appreciates participation. \r\nHe wants discussion and encourages people to share.\r\nYou don't need to however speaking up often feels refreshing.\r\n\r\nIn terms of grading he's and straight as they come.\r\nI don't want to say easy A but he'll give you one as long as your work is relevant.", "rating": 5, "expected_grade": "A", "created": "2022-05-09T01:18:35Z"}, {"professor": "Binod Paudyal", "course": "AAST200", "review": "Truly a great person and professor overall. Let me give you the stuff you want to read:\r\n[ABOUT THE CLASS]\r\n- He gives out readings for HW. He wants you to read them, but it's not necessarily required.\r\n- Sometimes he gives videos to watch for HW. It's cool.\r\n- You have to do a presentation/mini-lecture about the topic of the day that you select. It's simple, just a slideshow going over the reading of the topic.\r\n- Exams are very simple, and as long as you take notes and pay attention to class, you should not be getting less than a B. \r\n- Final project is easy so long as one of your members is willing to carry the group, or as long as the group works as a group. PICK A GOOD GROUP, DON'T PICK LAZY PEOPLE.\r\nOverall, the class is easy. He does participation points, but so long as you say something you'll get them. At the end of almost every class, there is an in-class participation activity, which is just answering a few questions related to the class that day. Literally, just pay attention and you'll get an A. I didn't do readings, but because I took notes and listened to his lectures, I came out of my exams with only one question wrong (they're online). I'm a CS major like the person below me, so this class was 100% a breath of fresh air that gave out 2 GenEds. \r\n\r\n10/10 class.\r\n\r\n[ABOUT THE PROFESSOR]\r\nProfessor Paudyal is truly one of the best professors at this institution. Not only is he understanding and kind, but he does also care about you and the other students. He really is interested in the topic that he is teaching. \r\nWhen no one answers his questions, he doesn't wait for an answer and answers it himself (which is extremely sad, but it saves the awkwardness of no one speaking).\r\nFor our final project, we were given the chance to do a research paper or create a piece of media. I went with a Youtube documentary, but he allowed other groups to use TikTok. What other class and professor allow TikTok as a submission for a final assignment?\r\nI really wish that if you take this class, have him as your professor. He doesn't yell, is not harsh, and will not punish you for small fractures. Truly one of the best professors that make college bearable.\r\n\r\n10/10 professor.", "rating": 5, "expected_grade": "A", "created": "2022-12-08T17:36:04.464947Z"}, {"professor": "Jennifer Cho", "course": "AAST200", "review": "absolutely love dr.cho! you can def tell she's passionate about what she teaches and really wants to get to know her students. it sometimes gets awkward in class when she asks questions and no one answers so def only take the class if you don't mind speaking up from time to time. format of the class is assigned readings and then she lectures on them and has videos/other readings to support. def read before coming to class and take good notes on the readings. class has no final just a final project which is straightforward. she has reading check ins spread out hence why I say take good notes on the readings because they are open note. a lot of extra credit opportunities (currently have over 100% rn). a big project is a group presentation on one of the chapters you need to read which are spread out over the semester but very easy to do. \r\n\r\noverall i love her and the class, it's something i am passionate about. def recommend taking her and speaking up in class as it makes her happy and doesn't make the class dry.", "rating": 5, "expected_grade": "A+", "created": "2023-11-17T15:45:52.627086Z"}, {"professor": "Jennifer Cho", "course": "AAST200", "review": "Fantastic professor, extremely passionate and receptive to student concerns/interests. The course covers a variety of relevant topics to the Asian American community from history to contemporary issues. I personally have learned so much from this class and the course structure does not burden a STEM heavy schedule. Attending class and participating in class is important but activities are engaging and not tedious. Please be willing to speak up in class if you take it! As someone else mentioned the class is only impactful if you can connect it into your own life.", "rating": 5, "expected_grade": "A", "created": "2023-12-06T04:08:01.837429Z"}], "department": "AAST", "course_number": "200", "name": "AAST200", "title": "Introduction to Asian American Studies", "credits": 3, "description": "<b>Cross-listed with:</b> AMST298C.\n<b>Credit only granted for:</b> AAST200 or AMST298C.\nThe aggregate experience of Asian Pacific Americans, from developments in the countries of origin to their contemporary issues. The histories of Asian Pacific American groups as well as culture, politics, the media, and stereotypes, viewed from an interdisciplinary perspective.", "is_recent": true, "geneds": null}