{"average_gpa": 3.2904509283819636, "professors": ["Jennie Chaplin", "Ilyas Abukar", "Ellen Griff", "Terrance Wooten", "Daniel Greene", "Tatiana Benjamin", "Patricia Akinbola", "Tony Perry", "Michael Casiano", "Robert Jiles", "Kalima Young", "Ashley Minner", "Shoji Sanders", "Ashley Hufnagel", "Melissa Benitez", "Schillica Howard", "Kelsey Michael", "Brienne Adams", "Ian Funk", "Jacqueline Partida", "Robert Chester", "Douglas Ishii", "Paul Saiedi", "Stephanie Stevenson", "Darius Bost", "A Anthony", "Jung Kim", "Christina Sessoms", "Hazim Abdullah-Smith", "Timothy Kumfer", "Victor Bramble", "Izetta Mobley", "Mark Lockwood", "Xinqian Qiu", "Adelaida Shelley", "Yvonne Bramble", "Zachary Johnson", "Perla Guerrero", "Anh Duong", "Christina Hanhardt", "Dallas Donnell", "Devon Betts", "Eva Hageman", "Kevin Winstead", "Christina Hanhardt", "Devon Betts", "Eva Hageman", "Dallas Donnell", "Wanda Hernández", "Devon Betts", "Wanda Hernández", "Alice Santana", "Kylee Manganiello", "Wanda Hernández", "Christina Hanhardt", "Carla Thomas Mcginnis", "Perla Guerrero", "Christina Hanhardt"], "reviews": [{"professor": "Jacqueline Partida", "course": "AMST101", "review": "She's an amazing professor! Straight to the point and makes class super fun. Her class gets filled fast so if you can join her class, register asap!", "rating": 5, "expected_grade": "A-", "created": "2019-05-23T21:44:39Z"}, {"professor": "Victor Bramble", "course": "AMST101", "review": "Professor Bramble gave an insane amount of work for this class. This class consists of a reading quiz on 2-3 readings (30-50 pages) a week with extremely specific questions, and a paper a week. These papers were graded so harshly that when we looked at the grade distribution everyone got below a C+ on a 25 point paper (which is a lot for this class). I strongly encourage everyone to stay away from this professor... there are better ones for the course.", "rating": 2, "expected_grade": "A", "created": "2019-12-06T16:42:07Z"}, {"professor": "Yvonne Bramble", "course": "AMST101", "review": "I would not suggest taking this course with this teacher. It is an insane amount of work and she is a very hard grader and if you are expecting the class to be about American studies, it is not. It is biased towards the professor's own political and personal opinions on society. Its a ton of reading and you have an essay to write every week. ", "rating": 2, "expected_grade": "A", "created": "2019-12-06T16:42:28Z"}, {"professor": "Shoji Sanders", "course": "AMST101", "review": "The readings for this class are surprisingly interesting. Work is mostly just a discussion post and reply once a week and we only actually met a handful of times this semester, class was basically asynchronous. Would recommend if you need this as a gen ed and don't mind writing about 500-700 words every week, which wasn't bad.", "rating": 4, "expected_grade": "A", "created": "2020-12-08T15:32:25Z"}, {"professor": "Jacqueline Partida", "course": "AMST101", "review": "Easy grader, a little curve(1.5%) and 2% extra credit. She curves a single exam if the average is low, not the final grades.\r\nShe is nice and willing to answer any question and give suggestions for assignments.\r\nI took it during covid, entirely online, the attendance rate is low and it is not required.\r\nA lot of readings. Exams are hard if you want an A. You need to be able to answer about 90% of the suggested questions to get an A on the exam. She gives guidelines and questions to prepare you for the exams, they are important.\r\n20% US history, 30% the history of American studies, 50% social problems.\r\nFor those who are not familiar with these topics at all, this is class may not be easy in the following sense: If you do all your work, you are guaranteed B+. You need to do well on presentations and the exams to get an A, and that requires effort if you are new to the subject.", "rating": 5, "expected_grade": "A", "created": "2021-01-10T01:01:30Z"}, {"professor": "Mark Lockwood", "course": "AMST101", "review": "Took this class winter semester. Was asynchronous so I don't really know much about Lockwood as a person. However, the work load was slight and easily doable. Essays were fairly easy and open ended. Through his emails he seems like a nice person. Even cancelled our final paper (yay)! \r\nCons:\r\n- Content was very liberal/one-sided. Not a single article we read addressed a conservative view or the existence of any other opposing view.\r\n- Content was about the black community in America rather than American society as a whole. If I wanted to study African Americans I would have signed up for a class from the African American Studies department. IMO the course description falsely advertised the course.", "rating": 4, "expected_grade": "A+", "created": "2021-01-16T22:00:39Z"}, {"professor": "Kevin Winstead", "course": "AMST101", "review": "This professor assigned so much work, it became impossible to meet his expectations. I think I speak for majority of the class when I say that we all stopped doing the readings. Even without doing the readings, I still managed to do very well in the class, only really emphasizing how much busy work the readings were. I emailed him about this concern and he said, \"The basic rule of thumb is for every credit hour in class, you should commit three hours of outside class time. So for a 12 credit semester, you should expect to spend 36 hours a week outside class studying. So for this course I would commit 4.5 hours per each day's readings. \" This is an unrealistic expectation and I am shocked at the level of work for a 101 course. ", "rating": 1, "expected_grade": "A", "created": "2022-04-07T01:06:08Z"}, {"professor": "Kevin Winstead", "course": "AMST101", "review": "A fine lecturer, but he doesn't seem to realize that everyone taking his class is doing it for a gen ed. He assigns enough reading to take up as much time as one of my engineering classes. I got through the class just fine without touching most of the readings, and that's the way it should stay. I will say, however, that you have to talk the talk in this class. If you disagree with any viewpoints, you'll have to defend them perfectly in papers, discussion posts, etc. If you want to get by the class easily, say what they want you to say. Or honestly, avoid this class entirely. The professor is fine, but the class itself needs a serious revamp. Consider another gen ed. Not suitable for a 100 level course, given that most of us have actual major requirements to dedicate time to. ", "rating": 1, "expected_grade": "B", "created": "2022-05-14T16:05:15Z"}, {"professor": "Devon Betts", "course": "AMST101", "review": "Mr. Betts was amazing!!! I really enjoyed this class and was never bored with the subject matter. The assignments were very organized, and I found myself actually enjoying doing the work! I was able to use the concepts we learned in class and apply them to my other classes, which I thought was so awesome. Mr. Betts is also very funny, kind, and always gives feedback so you never have to ask what you did wrong. I wouldn’t say it was an easy A, but as long as you put in the work and participate in class, it should be enjoyable!", "rating": 5, "expected_grade": "A+", "created": "2022-12-06T02:35:50.042792Z"}, {"professor": "Christina Hanhardt", "course": "AMST101", "review": "Professor Hanhardt made it very easy to succeed in AMST101. I could tell that she cared a lot about our learning along with our two TAs. Grading was very lenient and it is very easy to get an A. Participation in lecture (attendance) and discussion is a grade but all you have to do is show up for class and participate a few times in discussion to get an A. There were readings and/or videos along with a response paper due every week. The readings and videos sometimes took a few hours to read or watch which was kind of annoying. The response papers were 300-500 words but they aren't formal and they aren't individually graded (there's a overall response paper grade which you get at the end of the semester). They were also posted to a discussion page so everyone in your class could view your responses, which in my opinion, made it hard to get really personal with the topics because I didn't want my peers to read some of my responses that would be very personal to me. I would say that my biggest concern taking this class is the lack of grades. The first grade was the midterm grade which came a few weeks after it was due, so it was hard to know how you were doing grade-wise in the class until the very end. My TA facilitated great discussion which enhanced my learning on the topic, and the ~7 guest lecturers throughout the semester were engaging and great to listen to. Overall, Professor Hanhardt is a great professor and I would recommend AMST101 for a Gen-ed requirement.", "rating": 5, "expected_grade": "A+", "created": "2022-12-24T00:59:06.009423Z"}, {"professor": "Eva Hageman", "course": "AMST101", "review": "Took this class as a GENED and I believe that I got a lot out of it. We discuss a huge range of topics including systemic racism, accessibility, and material culture. You will do well in the class if you are in attendance, participate, and do the response papers every week (very simple, 400 word responses). There are usually weekly readings, however I was usually pressed for time and skimmed most of them or read a summary and still have a 100% in the class. I really enjoy discussing the topics in class, but a lot of students are reluctant to raise their hands and participate. She also provides a huge amount of extra credit opportunities such as participating a lot, attending guest speakers at the university, and uploading your notes for classmates on ELMS. The midterm was a paper and the final was a group project. Overall not a difficult class and I think it discusses a lot of topics that are very prevalent today.", "rating": 5, "expected_grade": "A+", "created": "2023-05-10T00:22:31.419632Z"}, {"professor": "Eva Hageman", "course": "AMST101", "review": "Professor Hageman isn't too bad. The class isn't that difficult, it's a standard Gen Ed. The only thing I'd point out is that she's a little unspecific when it comes to rubrics and such. Other than that, she's a good professor.", "rating": 4, "expected_grade": "B+", "created": "2023-05-28T21:02:26.356351Z"}, {"professor": "Kylee Manganiello", "course": "AMST101", "review": "I would definitely recommend taking AMST101 with Kylee as a gened course. She is super charismatic and understanding and you can tell she cares a lot about her students. I took it as a summer course and found the content to be interesting and engaging. The structure consisted of weekly recorded lectures/readings, a weekly discussion board, and an alternation between reading responses and journal entries each week leading up to the final project, where you conduct an ethnographic study on the subculture or place of your choice. I actually found the final project to be very interesting and enjoyable, because you have creative direction. Overall this was an easy yet super interesting course that personally I wouldn't have chosen originally but I couldn't recommend it more!", "rating": 5, "expected_grade": "A+", "created": "2023-08-23T12:08:52.038496Z"}, {"professor": "Christina Hanhardt", "course": "AMST101", "review": "Dr. Hanhardt asks really interesting questions for in class discussions. She also makes lectures really open-ended and up to interpretation which I find is super helpful with this class and the content. The response papers required are super simple and easy points if you show you read the reading and input your own ideas into them. She's also really good with flexibility due to illness or and personal issues. The class itself is kind of lacking, but Dr. Hanhardt is really good at creating thinking points and discussion topics. I also found the readings sometimes quite interesting and there is plenty of variety for everyone.", "rating": 5, "expected_grade": "A+", "created": "2023-11-27T17:02:51.104520Z"}, {"professor": "Christina Hanhardt", "course": "AMST101", "review": "Dr. Hanhardt is an amazing professor. I had her in my first semester of college (Fall 2022). She is a great lecturer and is very passionate about American history, specifically LGBTQ+ American history. If you are LGBTQ+ or anyone I would 100% recommend taking AMST101 for a general education requirement. Dr. Handhardt is also hilarious and makes class fun. The content in the class is good as well. She is also very personable I met with her over a year later to catch up. Fun Fact: She has been arrested for protesting.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T19:50:31.345908Z"}, {"professor": "Christina Hanhardt", "course": "AMST101", "review": "If you are reading this and considering taking AMST101 with Dr. Hanhardt, I need to emphasize to you that the bulk of this class is talking about different marginalized groups and I probably wouldn't have taken this class if I knew what it would be about. If you want an easy A, this class is fine, but you kind of have to write what you think the TAs want to hear which gets annoying after the 11th weekly response paper. Hanhardt is a really chill person, so I was able to spend 80% of class time doing random stuff on my laptop. The class is fine, I just want to make sure you know if you are considering taking this class that it is way closer to an LGBT or feminist studies course than an actual history/mainstream American culture course.", "rating": 3, "expected_grade": "A", "created": "2023-12-21T04:11:54.547452Z"}, {"professor": "Alice Santana", "course": "AMST101", "review": "I took this class winter semester and it was so worth it. I always finished my work for the week by Tuesday and it was very manageable and easy. Professor Alice was very friendly and approachable. Would highly recommend.", "rating": 5, "expected_grade": "A+", "created": "2024-01-24T15:40:31.671179Z"}], "department": "AMST", "course_number": "101", "name": "AMST101", "title": "Introduction American Studies", "credits": 3, "description": "<b>Credit only granted for:</b> AMST101 or AMST201.\n<b>Formerly:</b> AMST201.\nIntroduces students to the interdisciplinary field of American Studies by examining concepts such as culture, identity, cultural practices, and globalization, as well as theories underlying these concepts. Engages key themes, especially constructions of difference and identity, cultures of everyday life, and America and the world.", "is_recent": true, "geneds": null}