{"average_gpa": 3.273170731707317, "professors": ["Susan Pramschufer", "Susan Pramschufer", "Susan Pramschufer"], "reviews": [{"professor": "Susan Pramschufer", "course": "AMST320", "review": "I thought this class was going to be an easy A class but I was really wrong. At the beginning of the semester, you watch several movies, focusing on different models of disability and then you do discussion posts (like 5 times). After that, no more discussion posts, which is gold to me. There are three big essays you'd have to do. An observation, scene analysis, and restatement project. Towards the ending of the semester, you'd choose a specific scene from any movie with aspects of disability in it and \"remake\" that scene to be more progressive than it is now. You do either a storyboard or a script, depending on what is your scene. Anyway, the overall course is kind of interesting, especially coming from a disabled student like me. I don't agree with some stuff that is mentioned in this course. The film class basically says that movies or we should reject patriarchal, white, straight, and male hegemony. Cultural hegemony should be rejected.  If you are a conservative, then you might not like this course??? \r\n\r\nBut Mrs. Pramschufer is an extremely helpful teacher. She is so willing to help students understand the concepts. She would set up an appointment to meet on Zoom if you need to go over some course material. Susan really wants her students to be successful on the exams. Not sure what you understand some of the concepts? Just ask or set an appointment with her! She would try to make lots of concepts as clear as possible for students to understand. \r\n\r\nAlso, the exams are written. No multiple choices questions.", "rating": 5, "expected_grade": "B", "created": "2023-12-12T03:27:17.093662Z"}], "department": "AMST", "course_number": "320", "name": "AMST320", "title": "(Dis)ability in American Film", "credits": 3, "description": "Explores the connection between film and disability through an analysis of independent and mainstream American films in various film genres. Specifically, we will consider how these film representations reflect and/or challenge the shifting social perspectives of disability over the 20th and 21st centuries.  Beginning with the presentation of disability as theatrical spectacle in the traveling sideshow and early cinema, we will work our way through film history to develop an understanding of our society's complicated relationship with disability.", "is_recent": true, "geneds": null}