{"average_gpa": 3.216736916051985, "professors": ["Timothy Canty", "Rachel Pinker", "Robert Hudson", "Jeffrey Henrikson", "Jeffrey Henrikson", "Timothy Canty", "Alexandra Jones", "Jeffrey Henrikson", "Timothy Canty", "Jeffrey Henrikson", "Bennett Erdman", "Erin Evans", "Gillian Felton", "Hannah Zafar", "Jeffrey Henrikson", "Jeffrey Henrikson", "Jeffrey Henrikson", "Alexandra Jones", "Jeffrey Henrikson", "Timothy Canty", "Alexandra Jones", "Jeffrey Henrikson", "Alexandra Jones", "Jeffrey Henrikson", "Timothy Canty"], "reviews": [{"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim Canty is an awesome and geeky person, but I will admit the lectures were very boring and I found myself falling asleep.  That being said, he does post all the material online (lecture slides and recordings of the class) which is good for studying and catching up what you missed.  It was a pretty easy A class... that being said if you did the review guides and practice tests/quizzes he puts up you should be fine.  Also, an 85% was an A- and a 90% was an A.  I just wished the class was more engaging because I went to lectures for the \"topic of the day\"s which were like pop in-class activities that you had to be present to receive credit for.", "rating": 4, "expected_grade": "", "created": "2015-12-18T13:26:00Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "This is one of my favorite classes I have taken at UMD. Tim Canty made the class exciting, with lots of demonstrations and models about weather. The topics themselves can be boring, but the science itself is simple. You will have to do reading for short, 5 point quizzes, but the answers are out of the book. There are 2 quizzes, a midterm and a final, but he uploads plenty of old ones, and he prepares you more than well enough for those. The TAs are alright. Overall, I learned a lot from this class, and I would recommend it for both science and non-science majors. ", "rating": 5, "expected_grade": "A", "created": "2015-11-12T04:36:00Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "This class feels like a prison. Tim Canty is not an engaging teacher and has his TA's sitting in the back of the classroom watching over the class and watching our every move. I find it unnecessary and excessive. This is one of the classes where he forces and drags you to class. He records his lectures and posts them online which truly is helpful and I am thankful he does that, however, by default, he encourages students to not go to class because they can view the lectures later. However, he has surprise exit cards he calls topics of the days which in turn \"scares\" or \"stresses\" students out into going into class. Also, when we have discussions, rather than reviewing material we went in class, we end up doing group projects which are supposed to support our grade. But discussion is only 50 minutes, so there isn't enough time to explain group projects and do a thorough coverage of material that was went over in class so students are put at a disadvantage. This class seems to set you up to succeed with the way he grades but if anything, it makes the class more tedious than necessary and is setting you up to actually do worse. ", "rating": 2, "expected_grade": "A", "created": "2015-05-05T15:26:00Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Dr. Canty: Such a great professor who is really enthusiastic about the class and teaching you about weather and climate. He is really funny and he tries to keep the class engaging with demonstrations to help you visualize the concepts.\n\r\nExams: There are two exams and then the final (100 points each). Pretty easy, if you go to class and pay attention. Tim posts past exams on ELMS, but there aren't any answer keys, so you have to figure out the answers for yourself. Consists of about 10-15 multiple choice, and then 4-6 free response questions. Does not usually curve. \n\r\nQuizzes: 2 quizzes that are 40 points each. Same format as exams, just shorter.\n\r\nAdmission Tickets: 5 questions quizzes before every class. Answer are straight from the book.\n\r\nProjects: 2 group projects that take place in discussion, presentation format. Also easy, but the 1st project is easier than the second. \n\n\n", "rating": 5, "expected_grade": "A", "created": "2015-04-20T14:02:00Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Dr. Canty is a fantastic professor. Coming from someone who isn't even remotely close to being a science major, this class (and Dr. Canty) are perfect for those who need a lab/I-Series fulfilled. He does a great job. He uses good in-class models and keeps the material surprisingly interesting for a dry subject. \n\r\nHe does do five point quizzes due before every class on ELMS, but honestly the answers come straight from the textbook. There are also \"Topic of the Day\" sections on random class days where it's more or less a way to gauge attendance. (Both of these are worth 5% of your grade individually.) Projects are easy and are definitely a grade booster. In all, Canty is the man and this is a solid class.", "rating": 5, "expected_grade": "A-", "created": "2014-12-08T18:45:00Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim Canty is one of the funniest, cutest professors I've had at UMD.  He keeps the class engaged well by incorporating videos, graphics, jokes, and sidestories into his lectures.  The class itself isn't difficult and doesn't require a lot of studying if you go to all the lectures.  There are two projects over the course of the semester that take a bit of time, but are graded generously and are there to boost your grade.  Would 100% take this class again.", "rating": 5, "expected_grade": "A", "created": "2018-11-29T14:40:41Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Very engaging, down to earth teacher. I never had him test on anything he didn't cover or have in his notes. He truly wants his students to do will but also won't put up with bs in class. He answers every genuine question and is almost always available for a one to one in office hours. Great class and great teacher. Material could get boring but he tried to make clouds as exciting as they could be.", "rating": 5, "expected_grade": "A-", "created": "2019-01-30T20:11:31Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Extremely engaging lectures if you're interested in going. Absurdly self-aware of his nerdiness and lack of class-attendance. If you go to class, you will most likely get an A.", "rating": 5, "expected_grade": "A", "created": "2019-08-12T14:02:22Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim Canty was such a genuine professor and I thoroughly looked forward to his class. He really cares about his students and their well-being. This being my first semester at UMD, it was so nice to have a professor I knew cared about me. He makes his lectures very entertaining, even if the actual topic is not. Tim's passion on the class made it worthwhile and I definitely would take this class again.", "rating": 5, "expected_grade": "A", "created": "2019-12-16T02:57:55Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim is the cutest professor ever. If you go to class, you can get a good score.", "rating": 5, "expected_grade": "B+", "created": "2020-01-29T21:42:56Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "He's very nice and reasonable with grades/assignments. Is definitely willing to help when you ask for it. However, his synchronous sessions were often slow and unhelpful, making it more of a self-learning course from the textbook. Still, tests were closely related to the material and were by no means too difficult.", "rating": 4, "expected_grade": "", "created": "2020-12-20T18:02:02Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim is an absolute LEGEND. Sign up for AOSC200 and thank your respective god for allowing you to learn from one of UMD's best professors. Kind, funny, down to earth... what more could you want? ", "rating": 5, "expected_grade": "A+", "created": "2021-06-21T21:01:14Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Professor Canty clearly cares about his students and loves the material he teachers. He works to make all the lectures engaging and interesting and he teaches with an energy that makes the lectures fun to watch. He is funny, kind, and down to earth and cares more that his students understand the material rather than what grade they get. If you have the chance to take him, please do", "rating": 5, "expected_grade": "A+", "created": "2021-12-07T17:09:01Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Really cool and engaging professor. I found the course super interesting with the way he taught it and he always explained all the concepts really really well. Even when the textbook felt hard to grasp, he made it seem so simple and easy to understand. Overall just a great professor. The quizzes were open-book, lectures prepared you more than enough for the midterm, workload is light besides the occasional group project in the discussions. Would highly recommend.", "rating": 5, "expected_grade": "A", "created": "2021-12-09T23:04:00Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim is the GOAT he is such a nice, caring, and funny professor and you can tell that he definitely enjoys everything that he is teaching. Best of all he canceled our final for this semester and let us just keep whatever grade we had in the class, or take it online if we wanted. If you're able to take Tim for a class definitely do. AOSC200 in general was pretty good and interesting but the discussion section group projects were annoying.", "rating": 5, "expected_grade": "A", "created": "2021-12-17T02:48:28Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Great teacher, always willing to answer questions and makes review/lectures engaging with Kahoots, and icebreakers. Also canceled the final due to COVID concerns, which really helped with dealing with stress and preparation for other exams. ", "rating": 5, "expected_grade": "A", "created": "2021-12-17T06:14:27Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "I took Professor Henrikson for AOSC200 and paired it with AOSC201 lab. I got an A in 200 and A+ in lab. Really interesting professor and an interesting class. The projects are kind of intensive but graded easily. He records lectures and answers every question that students have. He has 2 quizzes and 1 midterm along with the final, which he made optional due to a rise in covid cases. Take this class with Jeff if you need DSNS/DSNL class", "rating": 5, "expected_grade": "A", "created": "2021-12-22T02:03:45Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Had him for the winter course version! Although fast-paced, he always explained things well and was super helpful during office hours! Genuinely wants students to succeed! ", "rating": 5, "expected_grade": "A", "created": "2021-12-22T19:31:54Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim is the GOAT he really cares for his students and is really hilarious during the lectures. The material is not that hard but you just need to read and understand the topics. take him if you can this guy deserves an award", "rating": 5, "expected_grade": "A-", "created": "2022-01-10T02:57:50Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim truly cares about his students' success in the class. He always emphasizes how he wants to help you and will follow through if you need it. Good class overall. Manageable workload. Just make sure to review the material and not fall behind. ", "rating": 5, "expected_grade": "A", "created": "2022-01-14T02:55:55Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "A fast-paced, manageable winter course that will teach you the ins and outs of the weather and its relevance to your everyday life beyond simple forecasts. Held asynchronously online, this course was a sure way to knock out a science Gen Ed and the professor, Jeff Henrikson, is exceptional. His video lectures are clear and concise, giving you the ‘need to know’ minus the fluff. While a textbook is required, the exams are 90% according to the videos so watching Jeff’s lecture videos will suffice if you want an A. The topics are engaging and require little to no math, making this course perfectly suited for a non-science major looking to take a science course/lab and earn a high grade. Granted, it takes a considerable amount of work to earn a high grade, but it’s not because Jeff is a harsh grader - he’s fair and considerate - but rather, the course is condensed into 3 weeks so there’s much to cover and learn. However, whenever you need help, Jeff is there and holds Zoom office hours 4x a week. Overall, this is a must take if you are reading reviews of science courses and wondering: ‘which is going to make me the least stressed, the most interested, and the most invested?’ This is the one. Take it.", "rating": 5, "expected_grade": "A", "created": "2022-01-23T19:09:55Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "I never write any professor reviews but this professor is literally so flexible, understanding and helpful that you just have to take him for this course. ", "rating": 5, "expected_grade": "A", "created": "2022-01-24T15:28:56Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Took him for the winter version of this course. A very easy and simple lab class to complete. All the instructions and assignments were easy to find and follow. Definitely a good lab for the winter if you need to fulfill a gen ed.", "rating": 5, "expected_grade": "A", "created": "2022-01-25T00:55:16Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Great, enthusiastic and understanding professor. While AOSC200 was fairly easy, he was very knowledgeable and easy to talk to if you had a genuine interest in the topics. ", "rating": 5, "expected_grade": "A", "created": "2022-02-02T17:42:37Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Ill start with the positives: \r\nTim’s a super nice guy and pretty fair, he tries his best to keep the class interesting. He’s very understanding of students and their needs. He is never condescending towards students and understand that not everyone comes from the same background. Always answers questions from students in depth. \r\n\r\nNow the negatives:\r\nThe class is SO boring. It’s a class on weather, I’m not sure what you’d expect. If you’re not fascinated by weather, I don’t recommend this class. I took this class bc I thought it would be pretty cool but it is now interesting in the slightest. Tim tries his best to make things interesting but it’s just so boring. \r\nAnother thing is, this class is a lot more work than you’d expect, especially for a gen Ed. There are multiple group projects, 2 quizzes ( basically an online midterm - idk why he calls them quizzes), a midterm (in person) and a final (also in person). Oh and a TON of reading. If you read the textbook and do the admission tickets, you don’t need to go to lecture. Despite his fairness, he absolutely does try and “trap” you on the online quizzes. I think he takes his job far too seriously, especially for a gen ed. he tried to justify himself by saying things like “oh i told you not to cheat” It’s an online midterm, of course people are going to try and cheat - any logical person would. Personally I thought the midterms and Quizzes were more difficult than they should have been. \r\n\r\nOverall: \r\nTake this class if you’re super into weather, if you’re not do not take this class. \r\nTim’s a great guy but I do not like the way he structures his class. ", "rating": 3, "expected_grade": "B", "created": "2022-04-25T18:31:53Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Very easy grading system, great professor, if you go to class you will succeed!!!! However, DO NOT CHEAT!!!!! Tim purposely puts questions on quizzes that he knows are on the internet, and he will check for who googled the answers and report you to the honor council.", "rating": 4, "expected_grade": "B+", "created": "2022-04-27T15:33:28Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "He is not the best prof honestly and he doesn't care about his students at all  ", "rating": 2, "expected_grade": "A-", "created": "2022-05-09T22:51:21Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Lots of assignments and projects. Don’t cheat or else you will get caught. ", "rating": 3, "expected_grade": "A-", "created": "2022-07-21T02:54:37Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "He cares about what he's teaching but I feel that he has little compassion for his students.", "rating": 2, "expected_grade": "", "created": "2022-07-27T14:09:07Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Keep in mind this is a genEd and 99% of the people who take the class are only doing so because they have to. \r\n\r\nThis is how Tim runs his class,\r\nTells you to take an online exam, at your convenience, with open notes, and not proctored. That's just edging students to cheat. Any reasonable person who is taking this class, given these circumstances, will cheat - that's just a simple matter of fact. He traps you by asking very specifically worded questions, that when put into google, will give a certain response. If your answer is similar to what google has, he will accuse you of cheating. After \"realizing\" that 50ish kids have cheated, he will give the class two options:\r\n1) Admit to cheating. Get a 0 for that exam. No referral to student conduct\r\n2) Receive an XF from student conduct\r\n\r\nBut no matter what, you will be referred to student conduct, even if you admit to him that you cheated! That's the kind of man Tim is. He will pretend to be your friend, trap you, convince you to admit fault, then lie to you and report you regardless. \r\n\r\nDon't take this class... Tim is a dishonorable person who encourages cheating and does not keep his word. It's a class on WEATHER, he takes it far too seriously, especially for a genEd.", "rating": 1, "expected_grade": "B-", "created": "2022-07-28T19:40:36Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "This guy is a joke, don't take his class unless you want to be accused of cheating.", "rating": 1, "expected_grade": "A-", "created": "2022-09-15T01:26:05.787525Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff is a great professor. You can tell he's passionate about Atmospheric and Oceanic science and he wants his students to succeed. He's extremely understanding and overall very positive and welcoming.", "rating": 5, "expected_grade": "", "created": "2022-09-15T18:39:38.161342Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Great professor, very passionate and very understanding. Exams not super challenging and ample prep is given. Would highly recommend his class.", "rating": 5, "expected_grade": "A", "created": "2022-10-24T23:42:54.217561Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Take it during the summer for an easy A. Quizzes/Exams go online, and they conduct the experiments for you in AOSC201 the lab. Not a class that requires a lot of studying imo.", "rating": 5, "expected_grade": "A", "created": "2022-11-28T02:54:57.457954Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Most kind and caring professors out there. He really wants his students to do well and is willing to accommodate for his students. He understand that the majority of people that take this class are not science people and he explains concepts in ways that are easy to understand. He also records all of his lectures and if you're ever confused about anything he is willing to go on zoom, one on one to help you. The workload is manageable, there were small quizzes due before each lecture and a weekly assignment that were pretty easy. There we 2 big projects in the discussion sections, as long as you don't have a bad group you’ll be fine. As far as the content in the class itself, I learned a lot of things about the world around me that I never knew and it was genuinely interesting. Jeff is a great guy and a great professor.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T00:22:11.947793Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "This Professor is super nice. But as someone who not in the stem program at umd, I found this course to be super difficult. Everyone told me it be an easy course but I really struggled all semester!", "rating": 3, "expected_grade": "C+", "created": "2022-12-13T17:29:21.413518Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "Professor Jones is a great Professor. It is her first-semester teaching AOSC so some of our quizzes and tests are harder than the other sections because she has never made exams for the class before. She let the class retake a part of the midterm for points back and has been adapting the class to student feedback. She didn't have any practice exams which made studying difficult, but she started giving practice problems after the midterm which helped a lot. She is very knowledgeable about the topics and if you need any help she is more than willing to help. I really enjoyed AOSC200 because it was very interesting and not too difficult. I believe her future sections will be easier as she will have experience and more course materials to give to the class.", "rating": 5, "expected_grade": "A-", "created": "2022-12-14T12:39:15.746202Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Great professor, highly recommend this class for lab gened", "rating": 5, "expected_grade": "A+", "created": "2022-12-18T13:17:14.684931Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "He's a great prof but an even better guy. The final was from 4-6pm...WRONG. It was 10:30am. I missed it. He emailed me back within two minutes and said I could take it in his office. I get to his office crying and he gives me gatorade and chocolate and an office to cry in and tells me I should compose myself before taking it because I can't take a test while crying. He encouraged me to ask him questions before I took the final. He has a turtle named Aida. No other professor would have even responded to my email. The final was directly relevant to what we learned. Things definitely could've gone worse from missing a final, but things couldn't possibly have  gone better.", "rating": 5, "expected_grade": "A", "created": "2022-12-19T11:45:47.147237Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "Professor Jones is really nice and you can tell she is really knowledgeable and she really wants you to do well. It seemed a bit more difficult than other professors' section because this was her first year teaching this course which also meant she didn't have past quizzes or exams that we could reference. However, she still did provide us with practice problems for example to help prepare us for potential questions. She really does try to work with you and she takes feedback to figure out how to best support the class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T18:55:11.141297Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "If you are expecting an easy class, do not take it. You will need to attend lectures and even do outside studying. Make sure to do your work on time as he doesnt allow late work. His class isnt hard persay, but you CANNOT CHEAT he will find out and is super strict on it. He posts recorded lectures and his slides are really informative. He does host reviews before quizzes and exams. Tim is a nice guy and is caring as long as you dont cheat which apparently a lot of people have judging by the reviews.", "rating": 4, "expected_grade": "B-", "created": "2022-12-20T06:16:39.336954Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff was a very kind professor. He seemed really friendly and caring, and the class was very straightforward. I didn't go to class often since the textbook was enough to prepare for exams, but the exams were fair and his lectures were usually interesting.", "rating": 4, "expected_grade": "A", "created": "2022-12-20T19:45:49.436919Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim is very genuinely very passionate about the subject and lectures are very informative and are available on ELMS. If you attend lecture and put in effort into studying outside of lecture (including taking practice exams and attending review sessions in discussion), you’ll do fine on quizzes and exam.", "rating": 4, "expected_grade": "A-", "created": "2022-12-24T00:30:56.633962Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "This semester was Dr. Jones' first time teaching this course, and although sometimes the assessments were pretty hard, she did her best to roll with that feedback and give everyone opportunities to improve their grades. She wants us to learn and do well. Overall I think she learned a lot and will be very well equipped to teach this class again in the future. Class was very organized and expectations for things to know were very clear. She clearly knew what she was talking about, too. Overall I expected the course to be a little bit easier, but I would recommend taking a course with Dr. Jones.", "rating": 5, "expected_grade": "A-", "created": "2022-12-24T20:13:08.288282Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "this class is interesting and fun, and if you're gonna take this class, I would definitely take it with Tim. He's funny and a good lecturer. However, disclaimer: you have to do these projects in discussion with a group, and that can definitely take a toll on your grade especially if your TA is annoying about grading (and group projects suck in general). Also, you actually need to pay attention and study (not that much but like a tad), this is definitely an easy science class but not an easy gen ed if that makes sense. \r\nI did not do this, but taking notes in class may help you. This might be obvious for some people to do but I didn't think to in an \"easy class\" \r\n- also if you're planning to take this class for fun and not for gen ed reasons, make sure you have energy and room in your schedule to devote at least a little time to this class because it surprisingly requires some energy. \r\nThat said, it's super interesting and gives good general knowledge on our weather system, so I would still recommend taking it, just keep these things in mind :)", "rating": 4, "expected_grade": "", "created": "2022-12-26T00:18:40.841282Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff is the sweetest person ever. However, his lectures of kind of boring. This is not because he is boring, the topic is just not the most interesting. But it is a generally easy class where all you gotta do to get an A is: read the textbook, go to lecture close to exam time for his review session, and do your part in the group projects. Don't really have to go to lecture and it's recorded anyway.", "rating": 5, "expected_grade": "A", "created": "2022-12-26T03:47:06.307581Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "if you go to class you will get an A. I got a B+ because I skipped 75% of them", "rating": 4, "expected_grade": "B+", "created": "2023-01-02T02:13:01.080326Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "I thought this class was pretty easy I would have had an A+ if i didnt forget about one of the weekly summaries but thats beside the point. Lectures are recorded and I didnt go to many during the 2nd half of the semester but I still watched them as they were very informative and he explained the concepts in a way that made them very easy for me to understand. Discussion projects was what took up most time out of class but were relatively easy and my TA was pretty good and didnt grade hard at all. Besides that, every lecture an easy admission ticket is due before you get to class. The single midterm was very easy in my opinion. The final was even easier though and I got a good grade with very little studying. Overall I recommend Tim, he brings some humor to lecture and just know hot air rises.", "rating": 5, "expected_grade": "A", "created": "2023-01-13T04:37:53.699795Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Came in expecting this class to be very dull (just taking it for gen ed credit), but I was pleasantly surprised with how the material was presented. Not only were his lectures easy to follow, but you can tell he is very passionate about the subject matter and brought in a lot of examples applicable to our lives. Couldn't recommend his class more! Only downside was the discussion portion of this class, but this is led by TAs and consists of two group projects which can get a bit boring", "rating": 5, "expected_grade": "A", "created": "2023-01-16T21:53:50.615208Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "The goat", "rating": 5, "expected_grade": "A+", "created": "2023-02-09T18:07:18.560724Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "Very sweet professor! Unfortunately, she made the class a lot more difficult than it was supposed to be.", "rating": 4, "expected_grade": "A-", "created": "2023-02-22T01:57:45.941851Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Prof Henrikson is very welcoming and clearly passionate about atmospheric science. A very understanding professor with a refreshing attitude. If you're going to take AOSC200, Prof Henrikson is simply the way to go.", "rating": 5, "expected_grade": "A-", "created": "2023-04-26T22:04:54.037698Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff is an extremely kind and thoughtful professor. This class was not too difficult if you show up and take notes. Lectures can be a bit boring though.", "rating": 4, "expected_grade": "A-", "created": "2023-04-26T23:13:33.561677Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff is the best he's really cool and relax on the work side. If you pay attention and attend lectures and essentially do the bare minimum you will learn alot in this class. He's really great at explaining and really approachable. Honestly just take him and you will see why he's so highly rated.", "rating": 5, "expected_grade": "A", "created": "2023-05-11T05:27:37.534231Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff is a great guy. Does his best to make lectures interesting, and is easy to talk too. He’s very accommodating and willing to help out with any extenuating issues you may have. I’m not a science major so I found this course taught by him is a good bet to knock out the gen-ed requirement. I think the weather stuff is interesting to know about too.", "rating": 5, "expected_grade": "A-", "created": "2023-05-13T20:53:57.291873Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff is an awesome professor. You can tell he actually cares about his students and their well-being. The exams are not difficult if you show up to lectures and understand the material. I learned a lot and enjoyed this class because of him. Would recommend.", "rating": 5, "expected_grade": "A", "created": "2023-05-22T23:46:54.710055Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "This dude is a great professor. In terms of the course there is a fair amount of padding that he gives you to get a good grade. The admission tickets, weekly activities, and the group project are a fairly easy 95%+ as long as you do the work.  This means you need to make sure you do good enough on the quizzes and exams. The quizzes are open note and the he gave us a review for the midterm and final so that we were very prepared for them. The final even had a fair bit that was word for word a copy from the review. In addition, he essentially gave us 2 extra credit points on both the midterm and final. In terms of a professor I echo the other reviews, he is extremely nice and helpful. I went to his office to correct some grading, and he was extremely fair. He also has a turtle in his office which was awesome. Lastly this doesn't really matter but the boundary for an A+ was a 98 which I don't even know how others are able to do that well but it feels a bit high. Overall, if you have the option to take him PLEASE DO, great professor.", "rating": 5, "expected_grade": "A", "created": "2023-12-22T23:18:08.742212Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Honestly, he makes the class pretty interesting. If you are curious about weather and you need an elective its not that bad to take. You will want to go to class or watch the lecture videos because he doesn't post a ton to study off of. Tests were fair but you will definitely need to study for them.", "rating": 4, "expected_grade": "A", "created": "2023-12-26T04:41:41.341139Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "I took AOSC123, AOSC200, and AOSC201 with Jeff in the same semester as a CS Major. I would definitely recommend Jeff for any of these classes. He is very passionate about the content and is happy to answer any questions. He's also very flexible and understanding with deadlines. The only downside is that his lectures can be boring at times. You can get an A in his class without putting too much effort in. Good natural science choice.", "rating": 5, "expected_grade": "A", "created": "2023-12-31T03:02:08.320079Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff does a great job and explaining the content and makes good slides that he presents well. The class is overall fine but is not as easy as you might hear it is. If you have a heavy schedule it might be harder to manage than you expect. Aside from that, you learn a lot and it is pretty interesting.", "rating": 5, "expected_grade": "B+", "created": "2024-01-01T19:04:38.681748Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "I took this course in the winter, along with the lab. It's super fast-paced, but you only spend maybe 2-3 hours each day (sometimes 4). The lecture videos were easy to understand, and I learned much about weather and climate from this class. A lot of the content was very applicable to my daily life as well. Dr. Jeff was really friendly and super helpful during office hours. For each test, he did Kahoots for exam review, which was awesome, and in some discussion posts, he had us send weather/climate memes. There's also no final exam for the winter term.", "rating": 5, "expected_grade": "A", "created": "2024-01-20T06:17:25.693024Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Most boring class ever. Tim is nice but kinda weird", "rating": 1, "expected_grade": "A", "created": "2024-02-20T21:04:39.937065Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "She is a very nice professor and pretty good at teaching the material. But if you're looking to take AOSC200 as an easy DSNL gen-ed I would not recommend taking it with her. There are closed-book exams on material that's pretty scientific if you're a non-science major, and grading is real harsh.", "rating": 3, "expected_grade": "B+", "created": "2024-03-06T02:29:30.616394Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "Do not take this course with her. She teaches the class like a 400 level course and expects you to remember everything. So not worth it.", "rating": 1, "expected_grade": "", "created": "2024-03-19T18:17:20.026576Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "She is very nice however she makes the class much more difficult than it needs to be. The class is supposed to be for non science majors who need to fulfill DSNS or DSNL credits yet she teaches the material as if this is a major course and not a gen ed. The midterm was extremely hard and she had little to no study materials or practice questions and the practice questions she did have, didnt even have the correct answer posted so you have no idea if you are doing it correctly or not. The quiz was open not yet still graded very harshly and had very in depth complicated subjects. She is just a harsh grader overall and will deduct points for the smallest things. It is clear that the other sections with different professors have a much different experience in this class so DO NOT take this class with her if you are looking for an easy DSNL credit.", "rating": 1, "expected_grade": "B-", "created": "2024-03-25T20:52:34.633827Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "This class was very tedious. Was looking for an easy A, but not the case. Look for easier Gen Ed.", "rating": 1, "expected_grade": "C+", "created": "2024-03-25T21:11:39.599593Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "DO NOT TAKE! everyone says its so easy but she makes this class insanely hard. This is the hardest course I have taken here. You know its bad when everyone in the group me is saying they will be happy with a 30% on the first midterm. DONT DO IT", "rating": 1, "expected_grade": "C", "created": "2024-03-26T16:51:46.715718Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "She's very sweet professor but if you want an easy lab/class for credit DO NOT TAKE HER. I hear this class is much easier with the other professor. She makes it way more difficult then needed and has no practice material or stuff to study. She throws way too much info at you in one lecture and expects you to know a lot more then normal. I strongly recommend taking this with the other professor if you want a good grade.", "rating": 1, "expected_grade": "A-", "created": "2024-03-26T16:53:05.764728Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "She teaches the class like a 400 level course. Don't do it.", "rating": 1, "expected_grade": "", "created": "2024-03-26T16:56:32.216536Z"}, {"professor": "Alexandra Jones", "course": "AOSC200", "review": "This is not the course to take if you want an easy gen ed class. She is relatively new to teaching so her exams are way too hard and she does not give any review or sample exams to study off of. The average of the first midterm was a 68 so take this class at your own risk", "rating": 1, "expected_grade": "B", "created": "2024-03-27T19:42:33.072801Z"}], "department": "AOSC", "course_number": "200", "name": "AOSC200", "title": "Weather and Climate", "credits": 3, "description": "<b>Prerequisite:</b> MATH107, MATH110, or MATH115.\n<b>Recommended:</b> Concurrent enrollment in AOSC201.\nWhat are weather and climate? Most people think they know but if you ask people to explain the differences and similarities you're bound to get a range of answers. Weather affects not just our daily activities but other important aspects of society such as transportation, commerce, security and agriculture. Most people understand what weather is to some extent. Climate and climate change are concepts that evoke strong emotional responses from people but are less well understood. In this class, students examine fundamental issues such as the greenhouse effect, severe weather, and global weather patterns and how they relate to a changing climate. Instruction in the lectures will provide the basic knowledge needed to understand these issues. In the discussion sections, students will be divided into groups to address the implications of these topics through group projects.\n<i>A Marquee Science and Technology Course designed for Non-Science Majors: http://www.marqueecourses.umd.edu/*  Click here for more Marquee course information.</i>", "is_recent": true, "geneds": null}