{"average_gpa": 3.1103960396039607, "professors": ["Michael Ambrose", "Ezra Griffith", "Daniel Peragine", "Melonee Quintanilla", "Andrew Koenings", "Dan Lorenzana", "Christian Romero", "Elijah Northen", "Alex Donahue", "Robert Kuentzel", "Alex Donahue", "Robert Kuentzel", "Kenneth Filler", "Kenneth Filler"], "reviews": [{"professor": "Alex Donahue", "course": "ARCH171", "review": "This professor teaches the information and that's it. Most of the work is done by the TAs. He makes it clear when the assignments are due but doesn't always make it clear on how to perform each assignment and how to receive a good grade on each assignment. The TA I had wasn't that great either as he didn't grade assignments in a timely manner or give advice on how to improve. Neither the teacher, Alex Donahue, or TA made it clear what I needed to work on to improve my work for the next assignment. Would not recommend this teacher as he seems very detached from the students and only lectures for and hour and fifteen minutes and doesn't engage with students. He doesn't even want students emailing him he says to email the TA and cc him in the email.", "rating": 1, "expected_grade": "A-", "created": "2022-12-07T04:55:02.195715Z"}, {"professor": "Benjamin Ripley", "course": "ARCH171", "review": "Was very slow to grade and provide feedback. Often gave feedback that could've been useful way too late. Didn't give tips on ways to improve. The worst TA experience I have had so far.", "rating": 2, "expected_grade": "A-", "created": "2022-12-07T05:05:09.911238Z"}, {"professor": "Alex Donahue", "course": "ARCH171", "review": "I had an incredible experience taking ARCH171 with Professor Donahue. The class was engaging and all the material was clearly explained. While Professor Donahue was often available for office hours - which I found to be greatly helpful when I had questions regarding the class material and/or wanted further assistance on my assignments - his group of TA's were also a great resource to use when I needed more guidance.There were a few presentations in this class and I found that both Professor Donahue and the TA's provided each student with excellent feedback so that they could improve their presentational skills and further succeed. By the end of the semester, I felt much more comfortable standing in front of a large class and receiving constructive criticism. Professor Donahue and the TA's created a very welcoming and inviting environment so that each student felt comfortable participating and inspired to create unique designs. I would recommend this class to any student interested in architecture, and I would definitely be interested in taking another class with Professor Donahue.", "rating": 5, "expected_grade": "A-", "created": "2023-02-13T22:10:30.093469Z"}, {"professor": "Alex Donahue", "course": "ARCH171", "review": "I had an incredible experience taking ARCH171 with Professor Donahue. He keeps the class engaging and explains the material very clearly. While professor Donahue is often available for office hours - which I found to be very helpful - his team of TA's is also a great resource to use when you have further questions about the class and/or assignments. The class had a few presentations and I found that each student received excellent feedback from all of the TA's, as well as Professor Donahue. By the end of the semester I felt extremely comfortable presenting in front of a large group, as well as receiving constructive criticism. Additionally, Professor Donahue and the TA's created a very welcoming environment so that each student felt comfortable participating and inspired to create unique designs. I would recommend this class to anyone interested in architecture, and I would definitely be interested in taking another class with Professor Donahue.", "rating": 5, "expected_grade": "A", "created": "2023-02-13T22:17:28.480114Z"}, {"professor": "Alex Donahue", "course": "ARCH171", "review": "I don't really have much to say about this class except that it was very unorganized. Due dates, instructions, and other things like this were very rarely provided and when they were they were rarely kept. Sometimes we would have an assignment due that he forgot to give instructions for and he didn't know until someone brought it up in class. If you get the right TA it could help but mine didn't know the answer to many questions and rarely graded assignments. He didn't seem to inform the TA's about what was happening in the class even when he was absent and they were running the class. Overall it's a pretty easy A if you do the work but I would be ready to be a little lost for the majority of the semester.", "rating": 2, "expected_grade": "A", "created": "2023-04-24T15:35:31.910846Z"}, {"professor": "Alex Donahue", "course": "ARCH171", "review": "professor donahue and the TAs are likeable people, but sometimes the way they prepare you for assignments is lacking. for the final project, we really had little to no instruction on Illustrator, Indesign and Rhino. projects and assignments aren't exactly difficult but they do take time. Marcelino was a great TA. you also have a presentation on a chosen building you have to do at least once in the semester and at least for Fall 2022 every week you need \"visual notes\" of both the lectures/presentations and the assigned reading. both pdfs can be found online", "rating": 4, "expected_grade": "A+", "created": "2023-05-04T20:56:14.794825Z"}, {"professor": "Kenneth Filler", "course": "ARCH171", "review": "He is a really nice professor, really connects with the students. He takes a while to get grades back, but he is super understanding. He also gives really good feedback on assignments.", "rating": 5, "expected_grade": "A", "created": "2023-10-06T15:38:53.555592Z"}], "department": "ARCH", "course_number": "171", "name": "ARCH171", "title": "Design Thinking and Making in Architecture", "credits": 3, "description": "<b>Restriction:</b> Must be a major in ARCH-Architecture Program; and must be a freshman; or have permission of the School of Architecture, Planning and Preservation.\nExamines iterative design processes and critical thinking skills through active learning and design thinking methodologies to solve problems and apply design as a lens of inquiry and exploration. Students will understand Design Thinking through interactive and experiential learning.", "is_recent": true, "geneds": null}