{"average_gpa": 2.842925278219396, "professors": ["Mary Zaki", "Lori Lynch", "Yunguang Chen", "Jeffrey Hunt", "Zedekiah Higgs", "Zedekiah Higgs", "Maria Soppelsa", "Maria Soppelsa", "Billie Ray"], "reviews": [{"professor": "Mary Zaki", "course": "AREC250", "review": "quite possibly the worst teacher for an economics class, especially if it’s your first time taking one. online was very difficult and stressful. Lectures were also not recorded. While a very nice lady who would take her time to try and listen to what was confusing students and help, her explanations were just not good. Nice person, not a great teacher. Also barely any assignments were put in which is unfortunate to try and get better grades. ", "rating": 1, "expected_grade": "", "created": "2020-12-17T22:04:26Z"}, {"professor": "Zedekiah Higgs", "course": "AREC250", "review": "Professor Higgs is the man. He is very helpful and his class is structured very simply with weekly problem sets and 3 exams over the course. Highly recommend taking his class especially if you like econ even a little bit. ", "rating": 5, "expected_grade": "A", "created": "2021-12-04T18:24:36Z"}, {"professor": "Maria Soppelsa", "course": "AREC250", "review": "The class as a whole was not the most engaging- in part because it is about cows and the production of wheat like 50% of the time, but Maria was a very kind professor and the TA Laura for this class was great, especially with guiding you on your homework. I would recommend taking this class!", "rating": 4, "expected_grade": "A", "created": "2022-11-13T14:30:04.796777Z"}, {"professor": "Maria Soppelsa", "course": "AREC250", "review": "She is the BEST professor ever. Dr. Soppelsa is extremely kind, never turned down a question from a student, she makes sure a student understands before moving on, and her exams are easy if you study. Her TA Luna also does review sessions the class period before an exam. 2 midterms and a cumulative final.", "rating": 5, "expected_grade": "A", "created": "2023-12-05T18:50:58.627336Z"}], "department": "AREC", "course_number": "250", "name": "AREC250", "title": "Elements of Agricultural and Resource Economics", "credits": 3, "description": "<b>Credit only granted for:</b> ECON200, AREC240 or AREC250.\nAn introduction to economic principles of production, marketing, agricultural prices and incomes, farm labor, credit, agricultural policies, and government programs.", "is_recent": true, "geneds": null}