{"average_gpa": 3.774137931034483, "professors": ["Marybeth Shea", "Chantel Rodriguez", "Robert Lucci", "Michelle Moncrieffe", "Jessica Mathiason", "Robert Lucci", "Jessica Mathiason", "Robert Lucci", "Michelle Moncrieffe", "Michelle Moncrieffe", "Robert Lucci", "Michelle Moncrieffe", "Mirella Vaglio", "Robert Lucci", "Michelle Moncrieffe"], "reviews": [{"professor": "Robert Lucci", "course": "ARHU230", "review": "Love this man. Great online instructor. Very engaging, discussions are a big part of your grade (in class and on ELMS). Clas was very interesting highly recommend if you want to take a winter or summer class. The workload is very reasonable. ", "rating": 5, "expected_grade": "", "created": "2022-01-19T18:10:36Z"}, {"professor": "Robert Lucci", "course": "ARHU230", "review": "Professor Lucci is incredibly kind, understanding, and passionate about what he teaches. He cares about student feedback and wants to make sure you get the most out of his class. This class handles tons of highly sensitive subjects which he handles with grade. He is truly the best!", "rating": 5, "expected_grade": "A", "created": "2022-12-23T20:49:44.790139Z"}, {"professor": "Robert Lucci", "course": "ARHU230", "review": "Professor Lucci is one of the best professors I've ever had at UMD. He genuinely cares about his students and wants them to succeed. He's also clearly passionate and knowledgeable about the topics in class. The readings are interesting and so are the class discussions. I took the class over winter so it was a very condensed and quick but he was still very reasonable about the assignments we were given and he even gave extensions when you asked for them. If you have the opportunity to have him as a professor DEFINITELY take it.", "rating": 5, "expected_grade": "A+", "created": "2023-01-19T17:24:23.230526Z"}, {"professor": "Jessica Mathiason", "course": "ARHU230", "review": "The class is split into 3 parts: traditional medical cultures and history, bioethics, and contemporary cultures and frameworks. Readings are dense but you should read them because she asks questions about them during class. Projects are fairly straightforward and flexible, should be easy to get a good grade if you write well. Honestly the defining course of the health, humanities, and medicine minor, highly recommend Prof Mathiason for this!", "rating": 5, "expected_grade": "", "created": "2023-06-14T00:53:11.490072Z"}, {"professor": "Michelle Moncrieffe", "course": "ARHU230", "review": "love her, very passionate about the class. -1 star tho cuz sometimes the class felt like there was no structure and i found myself doing things that wasn't even related to the subject which was annoying. i didn't like the class but she's great.", "rating": 4, "expected_grade": "A", "created": "2023-11-17T15:48:43.625630Z"}], "department": "ARHU", "course_number": "230", "name": "ARHU230", "title": "Introduction to Humanities, Health, and Medicine", "credits": 3, "description": "<b>Restriction:</b> Permission of ARHU-School of Languages, Literatures, and Cultures department.\n<b>Cross-listed with:</b> ENGL254, HIST219N, WGSS230.\n<b>Credit only granted for:</b> ARHU230 , ENGL289C, ENGL254, ARHU298A, HIST219N, or WGSS230.\nAn overview of the historical, cultural, ethical, and spiritual dimensions of medicine, human health, disease, and death from the points of view of various humanistic disciplines.", "is_recent": true, "geneds": null}