{"average_gpa": 2.8807821229050283, "professors": ["Alan Peel", "Jessica Sunshine", "Timothy McConnochie", "Douglas Hamilton", "Douglas Hamilton", "Alan Peel", "Timothy Livengood", "Timothy Livengood", "Timothy Livengood", "Thaddeus Komacek"], "reviews": [{"professor": "Timothy Livengood", "course": "ASTR330", "review": "Worst teacher I've had at UMD. Very poor communication and tries to keep students on edge by surprising them with pointless problems on tests instead of actually teaching valuable material. Avoid this class if you can.", "rating": 1, "expected_grade": "B", "created": "2019-05-13T23:14:18Z"}, {"professor": "Alan Peel", "course": "ASTR330", "review": "He's a tough person to read but always tried to check in on us throughout the semester after we switched to online learning. His homework is not to be taken lightly. If you want to do well you need to deeply understand the material before attempting to answer the questions; some questions you can't even find in the book and instead need to use your intuition (which means you'll probably get it wrong). His curve at the end appropriately reflected the very low average in the class, but for the easiness of the material taught the questions were over the top and incredibly time-consuming. At times it felt as though the TA grading our homework was inconsistent in their methods and was trying to work against us.", "rating": 3, "expected_grade": "", "created": "2020-06-02T00:03:49Z"}, {"professor": "Douglas Hamilton", "course": "ASTR330", "review": "I really enjoyed this class! Dr. Hamilton was very engaging and it was clear he was really passionate about the topics in the course. He was really kind to students and I loved his teaching style! For lecture, one downside is that I felt he didn't hit on the points needed in the exams or had an organized way of conveying information, since it felt like I got a bit lost during lecture. Other than that, I would take a class with Dr. Hamilton again.", "rating": 4, "expected_grade": "", "created": "2020-12-09T01:51:18Z"}, {"professor": "Alan Peel", "course": "ASTR330", "review": "People have a lot of strong opinions about Peel. Some people love him, some people hate him, but I thought he was just alright. \r\nYou can tell he's really passionate about the material he teaches, which is always a good thing to see in a professor. My MAIN\r\ncriticism is that the workload felt overwhelming for a class that's supposed to be for non-science majors. I didn't\r\nexpect the class to be easy by any means, but even then I felt drained constantly. He had post-lecture assignments after\r\nevery class that sometimes took hours to finish. For a 1 hr 15 minute exam he would give 30+ questions, half of which were\r\nlong answers. The final was 68 questions with a 2-hour time limit.\r\n\r\nOverall he's not bad, but if you don't put in the work your grade will slip really fast.", "rating": 3, "expected_grade": "A-", "created": "2021-05-15T02:00:49Z"}, {"professor": "Alan Peel", "course": "ASTR330", "review": "I didn't think Peel was bad at all. His lectures were informative and his witty humor kept the class engaged.\r\nI would have given him a 4/5, but the reason he gets a 3/5 is because his exams and assignments were just insane. We had a post-lecture quiz after EVERY class and half of them drove me crazy because of how ridiculous they were.\r\nWe also had 3 exams and a final, and the averages were 63, 71, 77 and 65. As you can see, exam 1 and the final destroyed the class.\r\n\r\nThankfully he curved generously so I guess that made up for the stress in some way.", "rating": 3, "expected_grade": "A", "created": "2021-05-22T18:12:34Z"}, {"professor": "Douglas Hamilton", "course": "ASTR330", "review": "Doug Hamilton is such a wonderful guy. This class is challenging, so this review is based solely on who he is as a professor.\r\nHe is engaging, animated, and funny. He's a bit of a dork, which is so fun to be around. 9:30 classes never felt like it with the energy he brought. You can always come to him for help in math (which I desperately needed as an English major.)\r\nHe is an empathetic and sweet person. The nice things I have to say about the dude is unending. Not to mention he is very bright and an expert in this field. Even my mom loved him when she facetimed me during office hours. Do yourself a favor and choose him for this class. You won't regret it. \r\nOne of the best professors in the entire university. ", "rating": 5, "expected_grade": "C", "created": "2021-12-07T18:13:36Z"}, {"professor": "Douglas Hamilton", "course": "ASTR330", "review": " I have taken 3 ASTRO 3XX classes and this one being my last and fourth one to fulfill my COMPSCI upper level concentration requirement. I got an A- in both ASTR380 and ASTR340 and a B- in ASTR350. These classes were structured in a way that the professors understood that the students in this class take it as an elective, so that's how much they expect from you. However, they are 3xx level classes so their is still a good amount of studying and work to do in order to well. In addition, for these three classes all the hw, quizzes. and exams only relied on class sides, no textbook. These professors also dropped lowest HWs and even Quiz grades.\r\n\r\n ASTR330 on the other hand was something else. The professor required you to read and memorize line by line every single word and concept from the textbook he makes you buy. His class slides were not helpful nor meaningful at all as they only contain a title heading and one picture per slide. He mainly just talks about everything in class and expects you to memorize everything that he has said. The hws are also long and very confusing. His chapter quizzes are also very horribly designed as they can be anything from the dense chapter you have to read and memorize. I barely passed the class, I would not recommend taking this class with this professor if you are thinking that you can easily pass, you need to really work hard for this class as if this was one of your major classes. ", "rating": 1, "expected_grade": "", "created": "2022-06-16T16:46:01Z"}, {"professor": "Douglas Hamilton", "course": "ASTR330", "review": "Professor Hamilton is a cool, funny, and easy to approach person, but I will admit this class was seriously a jumble of work(his grade distribution of the class should tell much of the story). The class focuses around a textbook you are forced to read as all the class' content will be drawn from there. The class slides are an attempt to give you more context, however, this consisted of an image and like 2 words lol. The reason he does this is to convince more people to come to class to hear his lecture and what he says during the slides. There are quizzes for each chapter to which the questions can range from \"oh i heard that in lecture\" to \"u have to memorize every detail of the chapter to get this one\". Sometimes there will be online quizzes - which are open note. The homeworks were extremely difficult and graded strictly. I would come into office hours for help and professor Hamilton would spout a lot of random stuff but if you come prepared with questions and an honest attempt, he will offer more help. Treat homeworks seriously as overall they will be weighed more to the final. There were 2 exams and a final, all of which honestly required a lot of memorization. He allows you to have a cheat sheet but that just gives him incentive to make it harder. If you score higher than the average you are in a really good spot, but easier said than done. But I scored below average on the first exam(by a lot) and the final(by quite a bit) and still got a B- b/c I did good on the hws, did pretty good on the quizzes, and scored above avg for the 2nd exam\r\nThere is an automatic curve after every assignment, which is nice but he curves around a C range based on the average(so the average score becomes the C). There is also extra credit provided and a lot of points for participation, which helps for the loss of points from homeworks and exams- so come to class and office hours. Overall, one hell of a class and a lot more work than I would have anticipated. You will need to put a lot of work and time into this class if you want a good grade... and have really good memorization skills. ", "rating": 3, "expected_grade": "B-", "created": "2022-06-26T01:38:50Z"}, {"professor": "Douglas Hamilton", "course": "ASTR330", "review": "Very interactive class and super interesting guy if you're into astronomy.  I found that by reading the book and going to class I didn't have to spend too much time studying at all.  His lectures don't strictly follow the book, so be sure to take notes for quizzes and exams.  ", "rating": 5, "expected_grade": "A+", "created": "2022-07-26T14:08:24Z"}, {"professor": "Timothy Livengood", "course": "ASTR330", "review": "Very laid-back but interesting class and professor. He is very knowledgeable in his field and the information can be pretty fascinating and loves to interact with his students. The structure of his class is very straightforward, 3 small HWs, 3 \"assigned\" Group Projects, and 3 mini-tests (they aren't that difficult and aren't meant to be challenging). I definitely recommend taking this course with Dr. Livengood.", "rating": 5, "expected_grade": "A", "created": "2022-11-12T18:54:14.610581Z"}, {"professor": "Timothy Livengood", "course": "ASTR330", "review": "This class is totally unique, and takes a bit to get the hang of. Dr. Livengood is a professor that absolutely loves to talk-- whether about his work in Astronomy over the years, his adventures at Mauna Kea observatory; past, present, and upcoming missions to all sorts of celestial bodies. You will hear it all! It's in many of these sort of half-on-topic discussions that you realize just how much knowledge he has in the field. That is, A TON. \r\n\r\nOne of the things that sets this class apart from the rest is that, aside from a few classes early on, most classes are not going to be lectures. You will design missions to bodies inside the solar system, then be sorted into groups of people that had similar bodies targeted, and then make a mission together and present it! Three of these throughout the semester. The thing that separates these from higher-stakes presentations in other classes is that you will probably present the same thing about 3-4 times, each time getting direct feedback and conversing with Dr. Livengood in the middle of your presentations! It almost feels like you're brainstorming live at the front of the class. \r\n\r\nAfter each presentation, you and your group go home and revise it a little based on what Dr. Livengood took issue with or wanted you to focus more on, and then present it again next class. This takes up almost all of the classes of the semester. By the end, you should have a pretty well-rounded project plan for your mission proposal! In between projects, he usually brings in a guest speaker (and he is WELL connected) and has an exam (which are subjectively easy. Don't overthink them!). \r\n\r\nOne thing you have to take to heart is his suggestions! Don't be shy to ask him directly (even during a presentation) if something is viable/a good idea. If there's an issue, change it before next presentation, and if he has a suggestions, do some research on it. All of this long-winded review just to say Dr. Livengood is one of the more approachable professors I've ever had, and makes the class pretty fun. It will open your eyes to the world of ACTUAL mission design and constraints, without getting too bogged down in the details that you get stuck thinking about budgets and exact launch windows.", "rating": 5, "expected_grade": "B", "created": "2022-11-15T04:28:51.077164Z"}, {"professor": "Timothy Livengood", "course": "ASTR330", "review": "This class consists of three homeworks, three group projects, and three exams which are loosely related to the projects. Dr. Livengood is a very fair grader, but prepare yourself for some curveball questions on the exams. As long as you can get your group to work together this class will be fairly easy. Dr. Livengood keeps lecture interesting with his stories. The only negative about this class is that it may not prove to be very useful to you, but if you are interested in astronomy this class may allow you to better understand what NASA is doing with their missions.", "rating": 4, "expected_grade": "A", "created": "2023-01-27T20:54:14.251389Z"}], "department": "ASTR", "course_number": "330", "name": "ASTR330", "title": "Solar System Astronomy", "credits": 3, "description": "<b>Prerequisite:</b> ASTR100 or ASTR101; and completion of the CORE Distributive Studies requirement in Mathematics and Sciences or the General Education Fundamental Studies requirement in Mathematics. Or permission of CMNS-Astronomy department.\n<b>Credit only granted for:</b> ASTR330 or GEOL212.\nDesigned primarily for non-science majors. The structure of planets and of their atmospheres, the nature of comets, asteroids, and satellites. Comparison of various theories for the origin of the solar system. Emphasis on a description of recent data and interpretation.", "is_recent": true, "geneds": null}