{"average_gpa": 2.9085777287761854, "professors": ["Grace Deming", "Lee Mundy", "Blake Hartley", "Sylvain Veilleux", "Alice Olmstead", "John Vanlandingham", "James Hunt", "Lixin Dai", "Stuart Vogel", "Eliza Kempton", "Alberto Bolatto", "James Hunt", "Massimo Ricotti", "Douglas Hamilton", "James Hunt", "Sylvain Veilleux", "James Hunt", "Douglas Hamilton", "Douglas Hamilton", "Douglas Hamilton", "James Hunt", "Douglas Hamilton", "James Hunt", "Douglas Hamilton", "Douglas Hamilton", "Douglas Hamilton", "Marvin Jones", "Michael Miller", "James Hunt", "Marvin Jones"], "reviews": [{"professor": "Grace Deming", "course": "ASTR101", "review": "Boring as hell. Avoid her if you can. Class is easy if you pay attention but that can be hard sometimes, especially if you don't have any interest in space and objects billions of light years away. Overall and easy class for a lab if you can tolerate her", "rating": 3, "expected_grade": "B", "created": "2014-12-28T04:22:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "I do not recommend taking this course. Lectures are painfully long and the TA's really don't care how you do in the class. The tests are extremely hard, even after studying for about a week before. Deming is very nice and her office hours are helpful, but if you're just taking this class to fulfill the requirement I suggest finding something else. As a business major, I found this class to take up way too much of my time and took away focus from other classes that I actually care about the material. Also, the labs are painfully boring and you get almost nothing out of them. Although I respect Professor Deming for her depth of knowledge, unless you are very interested in Astronomy, do not take this class.", "rating": 2, "expected_grade": "B-", "created": "2014-12-10T16:54:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "If you're looking for an easy class to fulfill your lab requirement, this one is a pretty good choice.  Deming is a pretty boring professor, but the assignments and labs are pretty straightforward.  I recommend bringing a laptop or something to class and discussions so you have something to do, as the hour and fifteen minutes of her talking can drag on a bit.\r\nHer lectures are almost straight from the book, so reading the right sections before exams should be all the studying you need.", "rating": 3, "expected_grade": "B", "created": "2013-12-10T22:48:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "Deming is a great professor. She's very excited about Astronomy and is able to convey that feeling during lectures. The class itself is extremely interesting and I felt like I came out of it knowing a lot more about space than I did before. Lab sections are the only downside to the class imo. A few of the labs are ok, but mostly they are just time consuming and tedious. They're not hard though. You will need an elementary understanding of algebra going into the class which shouldn't be a problem for ANYONE.\n\r\nThe class is easy, interesting, and Deming did a nice job teaching it.", "rating": 5, "expected_grade": "A+", "created": "2011-12-27T16:50:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "I enjoyed this class. No doubt it was very difficult for a core that we wanna get out of the way, so if you're looking for that, this may not be for you. \n\r\nDeming's lectures were hit or miss, depending on how dry the material was, because her voice can have the ability to make you drowsy. If you stay engaged, however, you can really understand the material. There are a lot of extra credit assignments on the homeworks, and these help bolster your grade. The labs, homeworks, and activities are graded pretty strictly, and systematically, but the EC can help override that. \n\r\nExams are tough, especially if you have other exams close to them, because you need a week of steady. Otherwise, get ready to cram in one night, which I was forced to do for most of them. I got A's on the exams, but it was stressful. I guess with more study time, they aren't as hard.\n\r\nMy TA was AWESOME. Hannah was really helpful, always willing to take time to explain concepts and help with the homework. \n\r\nTough class, but not impossible. If you work a decent amount, you will be find. Easy to get a B, but a lot tougher to get an A. Just put in the effort, and you will do well.", "rating": 4, "expected_grade": "A+", "created": "2011-12-25T16:12:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "All lectures mandatory because of random quizzes/activities, and it is the only way to get the detailed notes, which she WILL ask about on the exam. Discussions mandatory because of graded activities. Labs are very easy.  Exams are what make this class difficult to get an A in.  I had almost 100% on everything except for exams in this class, with an 87.5 on midterm 1 and an 85 on midterm 2. This left me with an 89.7 avg going into the final. Final was very difficult and I got a 77 on it, which gave me a B overall in the class. \n\r\n2 midterms, labs, lecture/discussion activities, 5 HW, and a Final will make up your grade.\n\r\nAn A will require a lot of studying for exams in this class, however getting a B is not too much work.", "rating": 3, "expected_grade": "B", "created": "2011-12-24T16:39:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "Quick Pros and Cons list.\n\r\nPros: Class is just memorize, memorize, memorize. Definitions, processes, and like 3 formulas.\n\r\nCons: Where do I even begin?\r\n-Deming is nuts about Astronomy. That's a good thing, but it also causes her to go further into the subject than we should. \r\n-Often wastes time during class talking about unimportant, extraneous, or unnecessary subjects. \r\n-Has a very boring lecture tone\r\n-Treats us like children. I feel like I'm in a high-difficulty 4th grade class.\r\n-She requires you to go to lectures and stay until the end. She often has lecture activities that count for grades, and you don't know when those will be given. \r\n-She doesn't post full powerpoints online. Only a tiny outline\r\n-Her tests often focus on the details she explains during her lectures. Sure you may be thinking \"oh, that's what everyone says, you must be stupid.\" But no, I knew around 85 to 95% of the material, but seriously, that 5 to 15% of lecture related details that no one really cared about... they really drag down your score. You make one little mistake and here's a B... or worse.\r\n-I don't like the TA I had. He took 10 minutes to explain something that can take 2 minutes to explain. No, he was not just going into detail, he was repeating himself, thinking about what he was going to say, saying completely obvious things that a 6th grader would know, etc. He wasted a lot of time, and it didn't help anyone.\n\r\nAll in all, don't take this class for a core. ", "rating": 3, "expected_grade": "", "created": "2011-12-07T14:36:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "Deming is absolutely crazy. Don't take this class unless you have to. My advisor told me this was going to be an easy lab to fulfill my lab requirement but it was NOT. The exams are extremely difficult and random and no matter how hard I studied (one test i studied for two weeks), I could't get an A because of the tricky questions she likes to throw in. Labs weren't that bad but still really annoying. She does give extra credit opportunities and holds reviews sessions which are good, but I still hated this class and am so glad I will never have to talk about space ever again.", "rating": 3, "expected_grade": "B", "created": "2010-12-15T16:26:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "A class from hell...Seriously I feel like Im at a Star Trek convention everytime im at class...Do not take for Lab Science Core it is way to hard for an intro lab class", "rating": 2, "expected_grade": "", "created": "2010-11-10T01:39:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "This class is one of those classes where the exams make or break your grade. The exams are really hard, which makes getting an A in this class very hard, especially if you are not interested in astronomy and can't memorize all the details well. I don't think I got the grade I deserved, but other people did much better that me on exams, so it might be a more personal difficulty with astronomy.\n\r\nAstronomy is my first B in college and I am a second semester freshman.", "rating": 3, "expected_grade": "B+", "created": "2010-05-18T11:11:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "Deming was a great professor.  Even though I thought astronomy wouldn't be interesting, she made it interesting.  Lectures were very good.  \n\r\nDiscussions and labs were mandatory and not the most exciting, but they were good grade boosters.\n\r\nAll of the exams were pretty easy.  There was also an online quiz every week and 5 homeworks total, but all of those were easy.", "rating": 5, "expected_grade": "", "created": "2010-05-16T15:48:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "I love her enthusiasm. Great teacher.", "rating": 5, "expected_grade": "", "created": "2009-12-15T17:31:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "Class is WAY easy, especially if you know anything about space already.  I read A Brief History of Time after her class, and she uses a LOT of the information presented in the book in her class.  Didn't read the textbook, just went to lecture/discussion and took notes.  Study for the exams so you can at least get the avg, because the range of scores for some of the exams were: hi-95, low-13.", "rating": 5, "expected_grade": "A+", "created": "2009-06-17T15:19:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "She is absolutely amazing. I was a business major my freshmen year, however, after i took her class, I fell in love with astronomy and switched majors. The class can be a little tricky. Its not extremely easy however if you put a next to some effort and show up to class, you would have no problem getting an A. She's very nice and very easy to talk to. ", "rating": 5, "expected_grade": "A", "created": "2009-04-18T16:14:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "This course was a lot harder than I expected. Exams are tricky, but review sessions do help a lot. If you get a good TA you will do a lot better in this course as well. Deming keeps things interesting with a lot of cool demonstrations and she hands out free stuff. Towards the end of the semester material gets heavily into physics, which I hated, so beware. She gives a lot of extra credit opportunity for homework and on exams, which I liked. If you put some effort into studying and go to all lectures, you'll be fine. Labs are easy, as are discussions. Lots of easy points in this class, but exams will make or break your grade. Be prepared to spend some time studying! ", "rating": 3, "expected_grade": "", "created": "2008-12-09T22:33:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "I was very happy with this class. She's a good professor, and is very nice and approachable. She also reminds you when the homework is due, and gives opportunities for extra credit. I came in without much knowledge of physics, but did well, after putting in a little bit of work. Having a good TA is essential, as the lab, which you do with the TAs, is annoying. Focus on the class notes, not the reading, when studying for exams. ", "rating": 5, "expected_grade": "A", "created": "2007-12-21T03:18:00Z"}, {"professor": "Grace Deming", "course": "ASTR101", "review": "Her exams are hard!! She's a good teacher though, and her lectures are interesting. The course requires a lot of reading which I found difficult to retain. Count on spending a lot of time studying for the exams. To her credit, she does give a good review session before exams. Your TA can make or break you in this course; they grade all your work, and some are a lot harsher than others when it comes to grading. ", "rating": 2, "expected_grade": "A", "created": "2007-11-01T18:17:00Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "Do not take this course. Some may say all you have to do is show up to class and lab every day and you will get an A but that is just not true. For the time of work I put in for the amount of credits this class is, it should have been an easy A, but was not. Not even close to the level of what a 100 course should be. The exams are terribly unfair and way too difficult. Overall, not something you should waste your time with.", "rating": 1, "expected_grade": "B", "created": "2016-05-12T16:29:00Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "I read every review and expected a great professor and was let down. While he is great at engaging students in the material he falls short in his exam questions. The questions are intentionally deceitful on the exam making them unnecessarily difficult. For a Gen Ed, the amount of work required by the class is too much for what a 100 level Gen ed should be like. ", "rating": 3, "expected_grade": "A-", "created": "2016-05-12T16:21:00Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "This is my last semester in college and I took him in my freshman year. One of the best teacher I have ever had. ", "rating": 5, "expected_grade": "A-", "created": "2018-04-17T03:37:27Z"}, {"professor": "Blake Hartley", "course": "ASTR101", "review": "Great professor, taught material very well and posted all lectures online. Exams were more than fair as he wants students to do well and enjoy Astronomy.", "rating": 5, "expected_grade": "A", "created": "2018-12-06T17:34:24Z"}, {"professor": "Eliza Kempton", "course": "ASTR101", "review": "Good professor in lectures. Homeworks are very challenging though. Mostly graded on a combination of labs, exams, discussions, homework, and readings so it's a lot of work but not too difficult. All in all, solid professor.", "rating": 4, "expected_grade": "B+", "created": "2019-12-10T19:28:15Z"}, {"professor": "Eliza Kempton", "course": "ASTR101", "review": "Took ASTR101 with her, not an easy A if math isn't your thing. She writes all her own homework questions that are nowhere online and you have to use the equations she explains during lecture, so if you skip you'll likely be clueless. ", "rating": 3, "expected_grade": "B", "created": "2020-01-25T02:02:44Z"}, {"professor": "Eliza Kempton", "course": "ASTR101", "review": "The course was pretty well managed. She made sure there was a variety of material in an interesting manner. HWs were challenging but I felt like I learned a lot from them, though some weren't happy that the questions were not in the same format as the exams.", "rating": 5, "expected_grade": "A", "created": "2020-04-26T14:27:20Z"}, {"professor": "Alberto Bolatto", "course": "ASTR101", "review": "Prof Bolatto is very knowledgeable and for the most part, the class isn't too bad. The homework assignments a were bit too complicated but otherwise, the classwork wasn't too bad. As long as you stay on top of the readings and assignments, you should be fine.", "rating": 4, "expected_grade": "B", "created": "2020-12-20T21:47:54Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR101", "review": "Good professor, class was fairly easy, interesting lectures. He is an engaging speaker and the workload is not too intense for a lab credit. I was/am not super interested in astronomy but I still enjoyed the class and didn't struggle too much. Overall, I would recommend for someone looking for a semi-interesting GenEd with a good professor. ", "rating": 4, "expected_grade": "A+", "created": "2021-08-17T17:34:26Z"}, {"professor": "Eliza Kempton", "course": "ASTR101", "review": "Professor Kempton runs a very solid ASTR101 course. The class was reasonably challenging, but overall if one reads closely, attends lectures, and is confident in using formulas then this class will be a walk in the park. As others have noted, this class is quite math based and you can expect the homework to use many equations. I will say that content wise the information and style of the class is very repetitive and monotone, but that seems to be ingrained in the class's curriculum itself, not in Kempton's teaching. Exams and labs are interesting as they ask how well you understand the material and each concept and how it connects to the big picture (although some questions are janky and somewhat disconnected, so again make sure to pay attention to definitions and review material). Also, TAs have been generally helpful especially in discussions, so this class should be easy as long as you are putting some effort to understand the material.", "rating": 5, "expected_grade": "A", "created": "2021-12-16T20:46:26Z"}, {"professor": "Eliza Kempton", "course": "ASTR101", "review": "don’t recommend unless you really like physics and hard exams and homeworks.", "rating": 1, "expected_grade": "B", "created": "2021-12-24T03:43:15Z"}, {"professor": "Massimo Ricotti", "course": "ASTR101", "review": "Dr. Ricotti hadn't taught the class before, which was very clear in the structure and how the material was presented. The lecture, discussion, lab, and reading components of the class were almost totally decoupled. Despite this, the class was simple and the assignments were straightforward and didn't require much time. He did emphasize math and physics more than expected for a class that doesn't necessarily contain STEM majors. ", "rating": 4, "expected_grade": "A+", "created": "2022-05-19T03:32:54Z"}, {"professor": "Massimo Ricotti", "course": "ASTR101", "review": "Really great guy, super nice. He sometimes talks quietly (compared to the noises the people in lecture sometimes makes), which can make it hard to hear. I recommend going to the front row, that's what I did. I can see how people may find his lectures to be boring, but you have to make sure that you're paying attention and read the material prior to know what he's talking about. I definitely recommend reading through the textbook, since all of the lectures are based on these chapters. However, the book does go more in detail and covers some stuff that's on assignments/exams that are more thoroughly explained in the textbook. If you read the textbook, you'll be fine. He had some really fun and engaging demos throughout the semester, which added some liveliness to the lectures. Don't worry about the discussion or the lab parts, they are both pretty easy, and if there are some difficulties, the GAs are extremely kind in helping the students. The GAs offer a lot of assistance and review sessions for exams—they are a great resource! Overall, a great course that is interesting and not too hard. ", "rating": 4, "expected_grade": "A+", "created": "2022-05-19T16:43:54Z"}, {"professor": "Massimo Ricotti", "course": "ASTR101", "review": "Dr. Ricotti was a great prof for a 100-level course. My only complaint is that he can be a bit dry sometimes and lose your attention easily. Otherwise, his exams and assignments were well thought out. ", "rating": 4, "expected_grade": "", "created": "2022-05-19T23:50:08Z"}, {"professor": "Massimo Ricotti", "course": "ASTR101", "review": "This was this professors first time teaching ASTR101, and he put a lot of effort into making sure people understood the material. I would definitely recommend this professor. Do the reading and if you’re confused about something go to office hours, and you’ll be fine.\r\n\r\nPros: \r\n- The class was graded on a lot of things, which was helpful because if you don’t do well on one assignment you can easily make it up. \r\n- In class there were a lot of mini-experiments that helped demonstrate difficult concepts, so if you’re a visual learner (like me) that will help you a lot. \r\n- The TA’s meet with the professor then hold exam reviews and put review slides up online that you can use as a study guide.\r\n\r\nPro or Con depending on preference:\r\n- As the other reviews mention, there was a curve, but for ASTR101 they curved every exam individually instead of curving everyone at the end of class.\r\n\r\nCon:\r\n- This wasn’t the professors fault, but if you take the class sit toward the front of the room. The experiments can be hard to see from the back.\r\n- The homework can be rough, but the lowest score is dropped and it isn’t a large part of your grade.", "rating": 5, "expected_grade": "", "created": "2022-05-20T20:48:35Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "Took this class for GenEd lab credit... big mistake. Lectures are all over the place and don't at all match up with textbook readings or labs. He can be condescending which isn't helpful when you are trying to understand material. His exams are also very strange- they have a ton of hypothetical questions that there's no way you could know the answers to. When the class asked what to study for exams, the exact content he told us to focus on studying wasn't even on the exam, which was so frustrating. Just avoid all together.", "rating": 1, "expected_grade": "", "created": "2022-12-12T03:29:58.220457Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "Professor Hamilton is very knowledgeable on astronomy but he seems out of touch with teaching. He does not use powerpoints during lecture, and expects students to take notes on what he is saying for over an hour. Very challenging for visual learners or those with focus issues. The only reason I am passing the class is because I learned all the material on my own time with my own resources. There is a curve for exams but that is because the average grades are so low that everyone would be under a C. If you are super smart and type A then you will do fine but otherwise I would try to find someone else.", "rating": 2, "expected_grade": "B-", "created": "2022-12-13T16:25:39.032895Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "I took this class as a gen ed and because I had a personal interest in astronomy. I wanted to learn more about the field and become more engaged with STEM. However, I left this class feeling unmotivated, embarrassed, and frustrated. Dr. Hamilton seems to have a general dislike for the youth. He frequently makes comments about how we don't pay attention or don't participate when he is abrasive to those who do. I really enjoyed his personality, but the silliness became belittling. Especially so as a woman. Another review mentioned how he doesn't understand much outside of a binary sense, making the class hard for neuro-divergent students. Exams were incredibly difficult and broad, and there was little to no guidance on what materials were to be studied. He also uses archaic ways of conveying information. Overall, unless you are very interested and well versed in astronomy/physics, I don't recommend this class.", "rating": 1, "expected_grade": "B-", "created": "2022-12-14T01:08:03.144955Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "Douglas is an all around inefficient educator with a poor attitude towards his student body. Any chance there has been class feedback opportunities, there have been no changes to improve instruction, exam formatting, and teaching to better assist students in succeeding. There have been a few times when the professor outright humiliated his class by displaying the statistics on class scores, later placing all blame on our efforts and lack of attendance rather than shortcomings that have been voiced on his end. This created a hostile environment and relationship professor to student where few in the class felt psychologically safe to ask for further help. When a class average for an exam is a 58, this says more about the failure of an educator than each individual in the classroom. I would never recommend Doug’s class to anyone hoping to enter science at a novice level. You will be thrown for a loop. I had a 4.0 before him and don’t know what to expect now.", "rating": 1, "expected_grade": "C", "created": "2022-12-14T15:44:10.130367Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "This man is a joke of a professor. Save yourself the mental turmoil and stress of trying to work through his inefficient teaching and lack of respect for students. With so many students failing to grasp concepts enough to pass an exam, the blame cannot just be on us. He needs to take some responsibility for his shortcomings as he time and time again refuses to.", "rating": 1, "expected_grade": "B-", "created": "2022-12-16T18:04:30.858445Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "Dr. Hamilton is a generally uninteresting lecturer who still uses overhead projectors even though he has a projector and a computer available to him. He tries to make the lectures interesting with demos that are momentary distractions from the boredom of being in his class. On top of this, his exams are unreasonably hard for a gen ed lab requirement, with the average of many exams being around a C or a D. He also accuses everyone of cheating on homework’s he doesn’t prepare us properly for, and will give harsh penalties if you use Google or any other resource besides the textbook. Sadly, not even the textbook seems to have these answers either. He’s just a generally out of touch guy who seems to think most college students are lazy and unmotivated, and will blame us for doing badly on exams. I would avoid his class if possible.", "rating": 2, "expected_grade": "B-", "created": "2022-12-20T23:32:41.659425Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "Don't get me wrong this dude tries his hardest to make his class entertaining and engaging, the thing is that he's not a good professor. The average for the exams in the course were low and he made it seem like he would curve them by assigning a letter grade (For example I got a 74.5 on Exam 1 and I got my exam returned with a B+ on it). However, this was very misleading as at the end of the semester he said the letter grades were not a curve but instead to \"let you know how you're doing in comparison to the rest of the class\". Further, he used collective punishment in class. He got upset that many people weren't attending lectures so he said he would not post lecture recordings and slides until class attendance was over 60%, which was completely unfair to people who attended class regularly and had no control over the attendance of other people. This also hurt people's ability to review for exams which is probably why the grades were so low. Overall his grade distribution in an entry-level \"easy A\" astronomy course was 34 As, 54 Bs, 67 Cs, 15Ds, 5 Fs. I overall wouldn't recommend him for this course however I've heard other people have had a better time with other professors.", "rating": 1, "expected_grade": "A-", "created": "2023-01-06T17:09:02.160331Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "The class is harder than it should be for a 100-level course. He is friendly but could be more organized. He did give a LOT of extra credit during lectures which honestly carried my grade. The exams were way too hard, but thanks to the extra credit, my grade did not suffer as much. Still, I found the class very interesting. My TA, Brian, was really good and made labs fun and interesting. It is a good class to get the Lab Credit if you are interested in astronomy and can come to lectures/labs.", "rating": 3, "expected_grade": "B", "created": "2023-01-30T03:50:40.145601Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR101", "review": "I recommend taking ASTR101 if you need an gen ed requirement for lab.  It's a pretty easy course and the labs and homework aren't too difficult.  I just gave 3 stars because I found this class to be so boring and much of chore throughout the semester to watch all of the lecture videos.  Professor Veilleux is a great guy and is good at what he does, but his speaking makes it difficult to stay focused for long periods of time.  He does however do some cool experiments in class from time to time.", "rating": 4, "expected_grade": "A", "created": "2023-05-06T15:04:45.088117Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR101", "review": "Veilleux is a pretty good professor. Sometimes concepts are left unclear, but it is not detrimental to your grade. ATTEND office hours for homework. It is likely that you will not get a good grade by yourself.  The class is a lot easier than it looks. You will get lecture quizzes the day before each class which is easy. I advise watching the lecture videos in full before class because it helps confirm concepts. Don't be afraid to take this class, it is very interesting. The lab is also pretty easy and you'll usually get out early. also, two labs are dropped.", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T14:43:53.704427Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR101", "review": "For a lab class, this was a steal. You do a little work and quizlet for all the reading assignments. He keeps lectures interesting, but he makes you watch the lecture the night before, then show up to class to 'review'. He uses clickers and has lots of participation points, but you can just answer the clicker questions from home. Everything in the class could be ChatGPT'd. Overall it was a good experience, an interesting topic, and a good down to earth teacher, I definitely recommend this class and him to fulfill the gen-ed", "rating": 5, "expected_grade": "A+", "created": "2023-05-11T00:20:15.641719Z"}, {"professor": "Brian Davenport", "course": "ASTR101", "review": "Great TA, very helpful, and made the class interesting. Super chill and way less strict about attendance compared to the other TA's would help you out on labs if you asked.", "rating": 5, "expected_grade": "A+", "created": "2023-05-11T00:22:05.914127Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "Unfair exams, completely out of touch with is students, blames students for being lazy even though he does not put in the effort to communicate with his students. Stay away.", "rating": 1, "expected_grade": "", "created": "2023-05-27T02:36:40.726023Z"}, {"professor": "Douglas Hamilton", "course": "ASTR101", "review": "I took this class expecting it to be a simple gen ed but Douglas had other plans. His exams were completely unfair with his averages being very low. He blames students for being lazy while he doesn't try to communicate with anyone. His lectures were structured horrible as he would put his notes on a projector written in dry erase markers. Study material barely reflected what was being tested on and his homework were undoable with out having to search the answers up on Google. This would spark the \"cheating\" epidemic in which he accused his students of cheating on his abysmally hard homework. The TAs I had did not care about the class and did not make an attempt to help the struggling students. She would sit on her phone the entire lab period and when students would ask for an explanation she would say she didn't know what to do then go back on her phone.\r\n\r\nTerrible. Just take a different gen ed", "rating": 1, "expected_grade": "", "created": "2023-05-27T02:47:07.479193Z"}, {"professor": "Mark Ugalino", "course": "ASTR101", "review": "Mark is a very harsh grader. There will be written questions that are worth 2 points, and even if you think you did a decent job writing the explanation, he will still mark the question 1/2, and this accumulates.\r\n\r\n o instead of having what you would think would be 8/10 worth points on a written question, you will probably have a 5/10, which can take a huge toll on your grade. His discussion format is pretty standard, but does not leave that much time for answering the written questions, and honestly he does not do a good job explaining what exactly he wants in a response unless you ask.\r\n\r\nKeep in mind that the TAs for this course also grade  the Exam written portions and lecture exercises. Overall, would avoid taking a discussion under him for that reason.", "rating": 2, "expected_grade": "", "created": "2023-10-10T17:07:37.539564Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "I am currently writing this as Professor Mundy is teaching a lecture on the structure of the galaxy.  It is currently 11/14/23 and we just got our second exam grades back from the weeks prior.  The MEAN of the exam was a whopping 66/100, the first exams mean was 68/100, and the average grade right now is an 83%.  I took this class as a Gen Ed and although I am a political-sci major with very little interest in anything STEM, I was hopeful I would do well.  You will also be disappointed.  The exams are incredibly hard and have tricky questions that cause wasted time.  The labs can be confusing, but I actually enjoy those the most out of everything.  The TAs besides ONE seem like they actually have a clue of what's going on in the class and typically don't explain much during labs or discussions of what's happening.  I have never skipped a class, discussion, or lab, I activity turn everything in on time, spend a whole week on studying for the exams, and still am left very disappointed.", "rating": 2, "expected_grade": "B-", "created": "2023-11-14T16:45:10.694621Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "Do yourself a favor and do not take his class. I took this class to fulfill my gen-ed requirement for a lab and although the labs are alright, his lectures are the least helpful for exams. He says that if you \"show up to lecture, do in-class lecture activities(which could as attendance technically), and participate in lab, you should get an A easily that is NOT the case. He provides no practice exams or any material to prepare you for his exam. So far the averages for the exam are in the 60s and he does NOT curve. Discussions are the only times when I actually figure out what we are learning but sometimes the TAs and the professor are completely out of sync. I attended an exam review for this class in hopes to figure out what to expect on the exam and the TAs couldn't provide any insight on the exam because the professor simply wouldn't tell them. If you are trying to fulfill your gen-ed lab requirement with this class do NOT take this professor.", "rating": 1, "expected_grade": "C+", "created": "2023-12-03T02:53:38.531741Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "Absolutely do not take this class. I was under the impression that it was going to be an easy A, as it had been for most people in the past but this year something in this class made it extremely difficult to succeed. The tests for this class used to be  all online so everyone who took it recommended it to me but taking it was a huge mistake. The labs aren't that hard and you can definitely ask for help if you want to get a 100, but the class itself is extremely content heavy. Each test's average has been in the 60s and Mundy does not give any type of curve. Each lecture has 50+ slide powerpoints with \"things you should know\" at the end of each, but the tests have almost nothing to do with those questions. As I am studying for the final right now, I am reviewing 26 lecture slides x about 50 (or more) slides in each totaling at least 1300 slides. Each slide is also absolutely filled top to bottom with information... making it impossible to actually retain anything. His MC is full of trick questions and the short answer on each test are (most of the time) super specific about a random concept. If you are taking this class to fulfill your lab requirement, look elsewhere. Do not take this class.", "rating": 1, "expected_grade": "B-", "created": "2023-12-07T02:13:18.421876Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "I took this class because I needed to fulfill my gen-ed courses and I read the reviews about how this class was structured before and I thought it was actually like reviews. I attended every lecture, lab, and discussion. The exams were extremely hard and he did not provide any materials to study or practice exams, the only thing we had was just the lecture slides and each of them is about 45-50 pages and we were required to go over them to study for exams and I spent a whole week just to study for it but it was not worth your time because the free response questions were way harder and tricky. The in-class activities were not that easy, the questions were not what he had covered on that day and it was so much harder than it was expected. If you are looking for a lab course to take, I don't really recommend this class because the professor has changed a lot compared to whoever took this class in the past.", "rating": 1, "expected_grade": "D-", "created": "2023-12-07T04:41:24.344437Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "If I could give ZERO stars i would. this is probably the hardest freaking class I have taken. whatever you do do not take this class with this professor. the exams are ridiculously tough. I have not gotten even a 60 on any of them. I go to class every day I have it, and go to all of the labs and discussions yet I still do not know what the heck I am even doing. the final is 25% of your overall grade and is cumulative of the ENTIRE semester. the average exam grade is like a 60 with a good portion of students barely getting 50s. the TAs are so unhelpful I even saw them googling answers to in-class assignments. there are no curves, no study guides, and I even had a 10-point essay question on a topic that I pretty much learned two days before the exam. I genuinely do not understand how I take notes and do well on all the other assignments yet still bomb the exams. save yourselves the time and stress and take another lab because this one requires more work and energy than the classes I am taking for my major. it is absolutely ridiculous how hard this class is. It is almost like he wants us to fail. You have all been warned", "rating": 1, "expected_grade": "C", "created": "2023-12-07T06:53:15.759484Z"}, {"professor": "James Hunt", "course": "ASTR101", "review": "Professor Hunt is very nice and is willing to help his students in any way he can to help them succeed in his class. He is so passionate and knowledgeable about astronomy which made class more interesting. Lectures can get a bit boring because Professor Hunt rambles sometimes, but they are bearable. He is very interested in history so he tailors his teaching more toward the historical side of astronomy, rather than the scientific side. The test questions came right from the slideshows and were not difficult. If you have to take a lab, I recommend ASTR101 because it is so easy.", "rating": 4, "expected_grade": "A-", "created": "2023-12-11T23:01:51.059418Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "I have no idea what the reviews from 2015 and 2012 are talking about because Mundy was absolutely nothing like that. He gives no supplemental materials to help prepare for exams, and the exams are unnecessarily difficult for a gen-ed course. The averages for the exams have been incredibly low, and he has yet to offer any sort of extra credit. He also doesn't share his exams with his TAs so when they try to help you they are merely guessing what they think he will put on the exam. He doesn't really seem like he cares about the success of his students. The only thing I will say worked in this course is the grade distribution. Although I have done poorly on the exams despite studying because he makes them incredibly difficult on purpose, my grade is not super low because the labs, discussion, in lecture activities, and homework count for a lot. If you do have to take this course with him, do not skip any labs because those are the main thing that have been pulling my grade up. Overall just do not take him if you don't need to.", "rating": 1, "expected_grade": "B-", "created": "2023-12-12T21:12:11.423870Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "DO NOT TAKE THIS CLASS! I took this class to fulfill the natural science lab Gen-Ed, and I deeply regret it. Professor Mundy does genuinely care about his students; however, the difficulty of the exams and the lack of exam preparation or study materials made it very difficult to do well in this class. On both midterms, the class average was in the mid-60s, and the class average overall is currently in the low 80s. I should also add that he does NOT curve any of the exams. The TA's have very little idea of what is going on and provide basically zero help. The labs are relatively straight-forward and are easy to do well on, but despite getting an A on every lab, the lab grades do not balance out the poor exam performances. The pictures he shows are pretty cool, though!", "rating": 2, "expected_grade": "C+", "created": "2023-12-13T01:36:36.184622Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "Nice personality, means no harm and can occasionally be interesting, but his lectures covered the content you'd think would help with the exam, instead of what actually will. The exams asks questions in a fashion where one would have to completely master each part of each of his lectures, and without that, it is certain you won't do well. The exam averages in the class were all in the 60s, and there was never anything done to fix it. No curve and no study guides. Unless you truly excel in general astronomy or have a passion for it, this is not the class for you...especially if its being used to check off a graduation requirement.", "rating": 2, "expected_grade": "B-", "created": "2023-12-13T03:10:52.454845Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "Beware- this is not an easy way to fill your lab credit. The class is unnecessarily hard. Average for all midterms was a 66/100 and wasnt curved one point. Not worth it", "rating": 1, "expected_grade": "B-", "created": "2023-12-13T19:41:16.474581Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "Pros:\r\n- Mundy knows what he's talking about. Seems like a smart guy and can answer any questions you may have.\r\n- Grades are evenly weighted out, meaning if you mess up on one exam or something like that it's not a huge hit to your grade:\r\n    - lecture activities: 10%\r\n    - labs: 25%\r\n    - homeworks: 10%\r\n    - discussion activities: 10%\r\n    - midterm1: 10%\r\n    - midterm 2: 10%\r\n    - final: 25%\r\n- Lowest 2 labs, 2 discussion activities, and 4 lecture activities are dropped, so you have some leeway\r\n- Officially, every week there are two 75 min lectures, a 50 min discussion, and a 2 hour lab, but the lectures usually ended 10 min early, the discussions 10-15 min early, and most of the labs you could finish in maybe just over an hour.\r\n- At least personally, I found the course content pretty interesting. More about breadth than depth.\r\n\r\nCons:\r\n- Exams are tough. I think part of it may be that a lot of people don't really think or care to put too much time into the course (tbf it's a 101 course and it's meant to be a GenEd for non-astronomy majors). That being said, there wasn't really away to study for the exams besides just looking back at the slides, and I found the review sessions hosted by the TAs pretty useless.\r\n- The focus on breadth rather than depth means there's a pretty decent amount of content to remember, especially for the cumulative final.\r\n- Most of the TAs, while nice, are just not helpful when it comes to actual, specific questions.\r\n- Because the grades are weighted out as shown above, you have to go to lecture and discussion for the grades, for anyone who would rather not show up to class.\r\n\r\nOverall, it's not a terrible course and it gets the DSNL credit out of the way. You will need to study well for the exams, but besides that there's basically no work outside of class.", "rating": 3, "expected_grade": "B+", "created": "2023-12-14T02:27:21.114140Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "This is a 101 class. The amount of work needed for this 100-level gen-ed class is way more than what it should be. Lectures are boring and count as attendance since there are 2-point lecture exercises, but he goes over the answer before the end of class. Many students leave lectures after finishing them. The fact that the exam averages are in the 60s, the final in the 70s, and he doesn't curve is crazy. Again, this is a gen ed lab. Discussions are pretty much useless but there is an easy quiz in each one, and labs are also easy (most don't take up the whole two hours). Take a different lab.", "rating": 1, "expected_grade": "B+", "created": "2023-12-21T03:12:21.518117Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "Dr. Mundy is the best! He's such a wonderful lecturer, understanding professor, and kind human. I learned so much from him and enjoyed coming to his lectures twice a week! I would 100% recommend him.", "rating": 5, "expected_grade": "B", "created": "2023-12-21T22:07:18.599743Z"}, {"professor": "Lee Mundy", "course": "ASTR101", "review": "too hard for a gened", "rating": 1, "expected_grade": "C-", "created": "2023-12-22T23:29:52.023902Z"}], "department": "ASTR", "course_number": "101", "name": "ASTR101", "title": "General Astronomy", "credits": 4, "description": "<b>Credit only granted for:</b> ASTR100, ASTR101, or ASTR120.\nDescriptive astronomy, appropriate for non-science majors. Sun, moon, planets, stars, nebulae, galaxies and evolution. Laboratory exercises include use of photographic material, computer simulations, and standard laboratory equipment.\n<i>Discussion sections and lab do not meet the first week of classes. Attend lecture before coming to discussion or lab section. Students must pay a $50.00 Laboratory Materials fee.</i>", "is_recent": true, "geneds": null}