{"average_gpa": 2.6552062868369353, "professors": ["Alan Peel", "Alan Peel", "Alan Peel", "Jessica Sunshine", "Marvin Jones"], "reviews": [{"professor": "Alan Peel", "course": "ASTR230", "review": "Dr. Peel is a professor who can be really chill one day, then totally rude and off another day. I had him for both astr 230 and 340 and both of those classes were quite a challenge with him as a lecturer. Do not get me wrong, he can be an effective professor but can come off as rude and material such as homework and exams can be rather tricky. In astro 230 the average on each exam was a 65, 58, 70, and 68. Which is actually much lower than astro 340 exams which were about 70 to 73 each. Saving grace for 230 was there was no final and there are alot of free points for discussion assignments and clickers. If you really like the material take him, if you are not adapt at the algebra and math of astronomy be advised.", "rating": 3, "expected_grade": "B", "created": "2019-06-04T15:57:04Z"}, {"professor": "Alan Peel", "course": "ASTR230", "review": "The class takes a lot of time and can be pretty frustrating and inconvenient. Dr. Peel though is pretty knowledgeable and good at explaining things, and I thought pretty likeable as well.\r\n\r\nPros:\r\nInteresting content if you are into this kinda stuff\r\nMakes you think about problems\r\nlearn quite a bit\r\nno real hw\r\n\r\nCons:\r\n3 discussions a week\r\nearly lecture\r\ngroup project\r\nreadings\r\nclicker questions/attendance mandatory", "rating": 4, "expected_grade": "A", "created": "2020-05-19T17:59:51Z"}, {"professor": "Alan Peel", "course": "ASTR230", "review": "Very likeable professor, puts a lovely brand of dry humor throughout lectures and discussions. The course itself is challenging in that there is almost always something imminent: discussion 3 times a week with a worksheet, working on the Group Project Solar System towards the end of semester, etc. Otherwise, the discussions are graded on how much effort you put into them. The first couple units are math units with the expectations of an English class: make a good enough case, provide the evidence of your thought process, and get corrected if you were wrong later. You will still receive the points, just make sure you know the real answers for the tests. \r\n\r\nProfessor Peel always had a chat open during the discussion for questions, and was ALWAYS real with us. If there was an idea that didn't work out, or something in particular that he expected from us, he would tell us. He mentions things like \"I see multiple groups doing this, that, -- please be aware that I am expecting you to know  (something important).\" Always respectful, in my experience.\r\n\r\nAlso, use ratios. Always.\r\n\r\nThe class is one long gauntlet of group work, so you better get along early or it will not be a good time. I was lucky enough to get a fantastic one where all of our members contributed and spoke up. ", "rating": 5, "expected_grade": "B", "created": "2020-12-14T19:57:03Z"}, {"professor": "Alan Peel", "course": "ASTR230", "review": "I really liked the content of his class. I learned a lot, and all of the content is interesting. \r\n\r\nDon't take him for an easy-A though (or even a medium-difficulty A), the exams are very difficult, mostly because they were basically impossible to study for. There was also very little time in class to finish the discussion assignments.\r\n\r\nA major component of the class was group work.\r\n\r\nIt's a gamble whether you'll like Peel or not. Even depending on the time of day I either love him or hate him.", "rating": 3, "expected_grade": "B+", "created": "2021-12-03T15:57:58Z"}], "department": "ASTR", "course_number": "230", "name": "ASTR230", "title": "The Science and Fiction of Planetary Systems", "credits": 3, "description": "<b>Prerequisite:</b> Must have math eligibility of MATH115 or higher; or MATH113.\nHave you ever wondered if humans will ever terraform Mars or Europa so we could live there without a spacesuit? Has it ever crossed your mind how lucky you are that you live on a water-rich planet with an oxygen-rich atmosphere? Have you ever suspected novelists and scriptwriters of creating ridiculous planets that violate scientific laws? Does the fate of our planet's thin biosphere keep you up at night? How common is life in the Universe? These are difficult questions, but armed with the right information, you can answer all of them. The Science and Fiction of Planetary Systems will help you develop a deeper understanding of why planets are the way they are. Along the way, you'll see examples of mistakes made in classic science fiction movies, novels and short stories and get the chance to invent your own plausible planets!", "is_recent": true, "geneds": null}