{"average_gpa": 2.847676767676768, "professors": ["Richard Mushotzky", "Alan Peel", "Christopher Reynolds", "Andrew Harris", "Michael Boylan-Kolchin", "Massimo Ricotti", "Benedikt Diemer", "Alberto Bolatto", "Alberto Bolatto", "Alberto Bolatto", "Sylvain Veilleux", "Sylvain Veilleux"], "reviews": [{"professor": "Massimo Ricotti", "course": "ASTR340", "review": "Pros: Knows what he's talking about, gives out copies of the lecture, very friendly and always willing to answer questions. Curve was set first day of class (100-85 A, 84-70 B, ...) and homework was 40% of the final grade. \n\r\nCons: If you aren't super interested in some of the topics of the course, then some lectures can be pretty boring. The math involved in the homework gave some people problems, but overall it really was not that difficult if you could use the given equations and can convert units (high school level stuff).\n\r\nOverall: While I did enjoy the course a lot, it is \"designed primarily for non-science majors\" and therefore didn't go as in depth with physics as I personally would have liked. Regardless, I learned a lot and recommend both the course and the professor.", "rating": 4, "expected_grade": "A", "created": "2011-05-15T17:38:00Z"}, {"professor": "Andrew Harris", "course": "ASTR340", "review": "He tries to make the lectures interesting and it worked 99% of the time. I was never tempted to skip class.\n\r\nHe is pretty generous with grades (85% and higher is an A) and for our class, he gave us extra credit for turning in homework on time.\n\r\nYou get a handful of homeworks, a midterm and a final. IIRC he gave us a helpful sample exam for the midterm. It was close to the actual midterm.\n\r\nOverall I enjoyed the class and glad I took it!", "rating": 5, "expected_grade": "A", "created": "2009-10-21T15:56:00Z"}, {"professor": "Andrew Harris", "course": "ASTR340", "review": "Professor Harris is an excellent teacher. He really makes class interesting and is a great lecturer. He is hilarious in his own nerdy way. Homework counts for a big percent of your grade and he has been giving extra credit for handing it in on time. There is only one midterm, so it is pretty comprehensive. The Final exam is cumulative and I expect it to cover a lot of material and be pretty difficult. \n\r\nThis is a pretty hard class and reading the text beforehand is definitely recommended. Even though this class is hard, I enjoyed it a lot, mostly because Andy Harris was a fantastic professor.", "rating": 5, "expected_grade": "B", "created": "2009-04-22T23:24:00Z"}, {"professor": "Alberto Bolatto", "course": "ASTR340", "review": "This is not an easy class, but I enjoyed the lectures very much. He made so many connections it blew my mind. If you are looking for a class that makes you think about big things this is it. But it is not an easy A.", "rating": 5, "expected_grade": "", "created": "2015-12-12T14:44:00Z"}, {"professor": "Alberto Bolatto", "course": "ASTR340", "review": "He is a great teacher, he made a lot of connections. He makes you work for your grade, and he likes to challenge the students. But, hey, that's why I am taking university courses!", "rating": 5, "expected_grade": "", "created": "2011-10-13T19:10:00Z"}, {"professor": "Alberto Bolatto", "course": "ASTR340", "review": "He is a very friendly teacher, but I just felt like the material was a little detailed for a non-science major course.", "rating": 3, "expected_grade": "", "created": "2010-04-29T17:06:00Z"}, {"professor": "Benedikt Diemer", "course": "ASTR340", "review": "Lectures are kind of boring, homework is long, and exams are difficult. But the professor is pretty chill and grades leniently, so you can expect to have a decent grade.", "rating": 4, "expected_grade": "A", "created": "2020-11-12T17:35:18Z"}, {"professor": "Benedikt Diemer", "course": "ASTR340", "review": "Long long homeworks and extremely vague, but the grading is lenient so it makes up for it. Exams are hard too. Not an easy A, and quite a bit of workload.", "rating": 2, "expected_grade": "A-", "created": "2020-11-13T02:58:17Z"}, {"professor": "Benedikt Diemer", "course": "ASTR340", "review": "Super nice guy. Homework and exams are long and hard, but the professor is accommodating and tries to make the material work for us. I recommend taking him.", "rating": 5, "expected_grade": "A", "created": "2020-12-01T18:26:11Z"}, {"professor": "Benedikt Diemer", "course": "ASTR340", "review": "Super nice professor who did a really good job of transitioning to online learning. Don’t expect an easy A, but easily the most interesting astronomy course I’ve taken so far and Diemer does a good job of explaining and motivating information ", "rating": 5, "expected_grade": "A+", "created": "2021-01-05T04:49:53Z"}, {"professor": "Benedikt Diemer", "course": "ASTR340", "review": "Good and kind professor. The only downside is the homeworks and exams which were pretty difficult. ", "rating": 4, "expected_grade": "A", "created": "2021-01-12T04:25:35Z"}, {"professor": "Benedikt Diemer", "course": "ASTR340", "review": "The class was difficult, but Diemer tried his best to make the material work for us. Make sure you study well and you'll be fine on his exams. I didn't study enough for the final and it brought my grade down significantly.", "rating": 4, "expected_grade": "A-", "created": "2021-01-25T20:05:59Z"}, {"professor": "Benedikt Diemer", "course": "ASTR340", "review": "Class can be a bit difficult but he curves it. \r\nNow, even though the class was hard when I took it, I thoroughly enjoyed it. One of my favorite ASTR courses. I got to learn a lot and it was really easy to approach him with any questions or doubts that I had.", "rating": 5, "expected_grade": "A", "created": "2021-03-09T07:06:23Z"}, {"professor": "Benedikt Diemer", "course": "ASTR340", "review": "If I could give him 6 stars I would. I've had my fair share of good professors and Diemer is BY FAR the best prof I've had at UMD. At the end of the last lecture of the semester the entire class clapped for him, like a full round of applause because he made the semester so fun, and he deserved every bit of it. Diemer would crack jokes, talk about current astro events, and made the course fun all around which made it enjoyable to go to each lecture, I wanted to go each day. He also would answer any questions students had mid lecture and if he didn't know the answer he'd let you know and would look it up after lecture so that next class he could answer it correctly for you. Each lecture he was so well prepared, it was like he knew his lecture like the back of his hand. Overall just an awesome experience. If you're an architecture major I would still recommend taking ASTR340 even though it has NOTHING to do with anything you'll do in life, purely because you can take Diemer.\r\n\r\nQuite simply, he's the GOAT.", "rating": 5, "expected_grade": "A", "created": "2021-12-08T03:31:56Z"}, {"professor": "Alberto Bolatto", "course": "ASTR340", "review": "nice guy but the class is challenging \r\nhis explanations sometimes were confusing but the class is manageable if you're interested enough", "rating": 4, "expected_grade": "A", "created": "2023-01-05T17:14:48.580690Z"}, {"professor": "Alberto Bolatto", "course": "ASTR340", "review": "Dude man, It's currently the middle of spring semester and I have learned so little from this class. This guy CAN NOT explain anything well. Youtube and reddit has been saving me. We have clicker questions, and 50% of students would often get it wrong. Instead of going back and explaining it again, he just goes forward and act like everything is fine and dandy. His homework takes forever to do as well. His 2 exam make up almost majority of your grade and its no notes, no resources what so ever. There is so much physics and math involved. If I were you, please stay away from this guy and class.", "rating": 1, "expected_grade": "", "created": "2023-03-07T18:30:50.723263Z"}, {"professor": "Alberto Bolatto", "course": "ASTR340", "review": "Don't take this guy for this class. It's impossible to keep up with the lectures. He blows past explaining complex topics in class, even if the majority of the class gets an answer wrong on clicker questions. He refuses to tell you what you did wrong on your extremely difficult time-consuming homework unless you go to office hours, and even if you do go he doesn't really explain anything to you. There's no textbooks or anything, so there are no resources beyond banging your head against hard-to-understand slides and googling questions. This class is just getting points docked over and over for no reason that you can figure out with a professor that refuses to give you the correct answer so you can learn. If he did give you the answer at the very least you could reverse engineer the physics problems to try to understand what you did wrong.\r\n\r\nI appreciate that this is a complex topic, and I know it's very hard to explain to a class full of people who've taken one prereq. This class should be much higher level and have more physics and astronomy class prereqs. Don't take this with just basic astronomy and basic physics or you'll regret it.", "rating": 1, "expected_grade": "A-", "created": "2023-05-09T03:10:37.458485Z"}, {"professor": "Alberto Bolatto", "course": "ASTR340", "review": "Nice guy. Class is VERY interesting. One of the best classes I have taken at UMD. Go to class, pay attention,  study a bit when there’s an exam, complete hw and quizzes and I promise you will end with at bare minimum a B. If you put in a bit more effort you’ll get an A no problem.", "rating": 5, "expected_grade": "A+", "created": "2023-05-12T04:08:02.020755Z"}, {"professor": "Alberto Bolatto", "course": "ASTR340", "review": "Prof. Bolatto is a jolly, kind, and very smart person. Beware that while prior physics/astronomy knowledge isn't expected, this course moves quickly through complicated astrophysics concepts. Though this class is “intended primarily for non-science majors”, it’s difficult and covers a lot of content. There was little study material, which made test prep feel futile. The tests themselves are lengthy and all written, but fair. Grading is not harsh and Bolatto himself is great, so if you like science, I would recommend him.", "rating": 3, "expected_grade": "A-", "created": "2023-05-22T18:28:13.620842Z"}, {"professor": "Sylvain Veilleux", "course": "ASTR340", "review": "This professor is very understanding and wants you to succeed in class. He takes out your lowest grades from the homework and homework quizzes. His class is very dependent on your exam grades, however if you study the PowerPoint and homework thoroughly, you should get above average and the curve should really help you. His lecture may be a bit boring but if you go over the lecture slides you should be set for this class. 10/10 professor, would take again if I could.", "rating": 5, "expected_grade": "A-", "created": "2023-12-19T17:53:45.814930Z"}], "department": "ASTR", "course_number": "340", "name": "ASTR340", "title": "Origin of the Universe", "credits": 3, "description": "<b>Prerequisite:</b> ASTR100 or ASTR101; and completion of the CORE Distributive Studies requirement in Mathematics and Sciences or General Education Fundamental Studies requirement in Mathematics. Or permission of CMNS-Astronomy department.\nDesigned primarily for non-science majors. A study of our progression of knowledge about the universe. Topics include: early cosmological models, geocentric vs. heliocentric theory, curvature of space, Hubble's Law, Big Bang Theory, microwave background radiation, evolution of stars and galaxies, dark matter, active galaxies, quasars and the future of the universe.", "is_recent": true, "geneds": null}