{"average_gpa": 2.809718309859155, "professors": ["Derek Richardson", "Douglas Hamilton", "Michael Miller", "Stuart Vogel", "Stuart Vogel", "Michael Miller"], "reviews": [{"professor": "Douglas Hamilton", "course": "ASTR120", "review": "profesor hamilton is a very good lecturer, trys to make sure every one knows whats going on. takes lots of questions and answers them during class. he is big on teaching big general concepts, but their have been times on homeworks and test that i lose points for being too specific, and times i have lost points for being too general. its rather hard to figure out what he wants work wise. claims are made of intense use of math, but their really is only light calculus, and that is rare. most of the time their is no math at all.", "rating": 4, "expected_grade": "", "created": "2008-02-22T00:38:00Z"}, {"professor": "Christopher Reynolds", "course": "ASTR120", "review": "This class is kinda tricky. He assigns the book, however the tests are all from his class notes. He focuses 90% on the physics of the class and his tests are physics based. If you want to ace this class you will need to be able to take a basic physics formula and derive it into something useful for your problem. Overall he is a good teacher. He's very nice and class is amusing and interesting. ", "rating": 4, "expected_grade": "B", "created": "2009-04-18T16:19:00Z"}, {"professor": "Derek Richardson", "course": "ASTR120", "review": "Derek was really cool as a professor.  He was really funny and kept things simple.  Homework wasn't difficult, tests were actually pretty funny (science fiction references left and right), and it was a great class to take (ASTR121 too).", "rating": 4, "expected_grade": "B", "created": "2014-05-11T18:42:00Z"}, {"professor": "Derek Richardson", "course": "ASTR120", "review": "Derek is AWESOME. He makes all of the classes fun by incorporating little animations or videos to demonstrate concepts, as well as making references to video games or birding (two things he loves to do). He has a great sense of humor, and love answering questions. The homework and tests make you think, but are by no means impossible, and he is very accessible by email or during office hours.", "rating": 5, "expected_grade": "A", "created": "2011-11-16T16:39:00Z"}, {"professor": "Derek Richardson", "course": "ASTR120", "review": "Derek is an awesome guy. His attempts to make lectures interesting are effective and I really enjoyed his class. He is also one of the most understanding professors I've ever had.", "rating": 5, "expected_grade": "B", "created": "2017-11-19T19:25:44Z"}, {"professor": "Michael Miller", "course": "ASTR120", "review": "He's a fantastic professor for anyone who is genuinely interested in the subject and wants to learn more,  and he's super engaged in making sure everyone understands the material (including designating time to answer student questions every lecture). He is very smart but it's not daunting once you get used to him and relax a little bit. Definitely glad I had him.", "rating": 5, "expected_grade": "A", "created": "2018-12-18T04:31:32Z"}, {"professor": "Stuart Vogel", "course": "ASTR120", "review": "He tries to make his lectures engaging. Understanding and approachable prof. overall. ", "rating": 4, "expected_grade": "A+", "created": "2019-12-13T15:32:53Z"}, {"professor": "Stuart Vogel", "course": "ASTR120", "review": "Great professor, attend all the lectures and do the reading, it will make the class very easy. Expect a decent amount of HW for ASTR120 and the midterms aren't too tough if you put in the work. Overall Professor Vogel is a great professor and very easy to talk to, office hours help a ton.  ", "rating": 5, "expected_grade": "B", "created": "2019-12-15T22:46:53Z"}, {"professor": "Stuart Vogel", "course": "ASTR120", "review": "Can be a bit boring (though that may be in part due to the course), but overall a great guy. Really nice and easy to talk to. ", "rating": 4, "expected_grade": "A", "created": "2020-01-13T00:15:50Z"}, {"professor": "Stuart Vogel", "course": "ASTR120", "review": "Great professor, super easy to talk to and ask questions with. Knows what he's talking about, although lectures may get a bit boring sometimes. ", "rating": 5, "expected_grade": "A", "created": "2020-09-18T18:10:49Z"}, {"professor": "Stuart Vogel", "course": "ASTR120", "review": "So far the best professor I’ve had at UMD! I had him for 120 and currently have him for 121 and thoroughly enjoyed both classes, even the parts about planets which I don’t really care about. His lectures are really thorough so they’re a must-attend, you don’t get the same preparation from reading the textbook and slides like with some professors. I felt adequately prepared for all the tests from the lectures, homeworks, and practice exams he posts. He also does a retest after every midterm that is open-note and averages the grade between your test and retest if you did better on a retest question, so that it can only bring your grade up. That really helps you learn the material! He also does a bonus question on each homework and exam, so for awhile I had over 100% in both 120 and 121. Also he’s really nice and really accommodating. ", "rating": 5, "expected_grade": "A+", "created": "2022-04-21T02:09:04Z"}, {"professor": "Douglas Hamilton", "course": "ASTR120", "review": "While he's not a terrible professor, going to office hours I've gotten the impression that he doesn't really know anything about neurodivergency or what being a woman in STEM is like.  I'd avoid if you actually want to enjoy your time in Astronomy.", "rating": 1, "expected_grade": "P", "created": "2022-11-04T20:18:00.394937Z"}, {"professor": "Stuart Vogel", "course": "ASTR120", "review": "He’s wonderful as a person. He’s very understanding, and the class is very easy if you keep up with the workload. There was a lot of material that he tried to cover, so I feel like I wasn’t able to absorb it all. You have to make sure you don’t zone out during lectures or you’ll end up missing like 50% of the slides.", "rating": 4, "expected_grade": "A", "created": "2022-12-16T18:06:37.859780Z"}, {"professor": "Stuart Vogel", "course": "ASTR120", "review": "He's a sweet and approachable guy who is genuinely interested in the subject. While lectures can be a little dry at times since he just goes through PowerPoints, the work and exams were easy as cake. There are many ways to boost your grade with the amount of \"free\" attendance/participation points. For every midterm, he gives the option of doing a retest, which is basically a take-home test of the exact same questions, where you can discuss with classmates and use other resources to complete. Your final score on the midterm will be the average of what you got on the original exam and the retest that you turn in a week later.", "rating": 5, "expected_grade": "A", "created": "2022-12-20T21:42:35.887965Z"}, {"professor": "Stuart Vogel", "course": "ASTR120", "review": "Although lecture was often boring, Vogel is clearly passionate about the subject and included small bits of fun to keep the class engaging. Whiteboard assignments were completed each class, which was a bit tedious, but they were always group assignments so they weren't too bad. Homework and tests were challenging, so expect to ask questions of your friends, the tutors, or your TA. Definitely take advantage of being able to re-submit test questions! We would have a dedicated discussion after each class to work together on making up the tests. Overall, Vogel is a super sweet professor and I would recommend taking ASTR120 (Assuming you aren't already in the major) if you're interested in Astronomy and the science behind it. I'm excited for ASTR121 in the spring!", "rating": 5, "expected_grade": "A-", "created": "2023-01-18T20:58:15.940490Z"}, {"professor": "Derek Richardson", "course": "ASTR120", "review": "Derek as a professor is fine, he is very nice and speaks well on the material. He communicates deadlines and expectations very well. I only took off 1 star because of the set up of the class, I really hated it. Its \"blended learning\" or something so all class is is stupid Nearpod questions and readings you are supposed to do before class that teach you all the actual material. The lecture time is useless but you have to go because of in-class assignments. Midterms & final are take home and you have a week to do them so this class is an easy A just so annoying you wont learn anything.", "rating": 4, "expected_grade": "A", "created": "2023-12-21T19:12:06.857491Z"}], "department": "ASTR", "course_number": "120", "name": "ASTR120", "title": "Introductory Astrophysics - Solar System", "credits": 3, "description": "<b>Prerequisite:</b> Must have completed or be concurrently enrolled in MATH140.\n<b>Restriction:</b> Must not have completed ASTR101 or ASTR100.\n<b>Credit only granted for:</b> ASTR100, ASTR101, or ASTR120.\nFor students majoring in astronomy or with a strong interest in science. Topics include development of astronomy, planetary orbits, electromagnetic radiation, telescopes as well as constituents and origin of the solar system (planets, satellites, comets, asteroids, meteoroids, etc.).", "is_recent": true, "geneds": null}