{"average_gpa": 3.9382914572864323, "professors": ["Joseph Bailey", "Pamela Armstrong", "Pamela Armstrong", "Pamela Armstrong", "Pamela Armstrong", "Pamela Armstrong", "Benjamin Huffman", "Joshua Cocker", "Benjamin Huffman", "Christopher Troilo", "Joshua Cocker", "Benjamin Huffman", "Joshua Cocker"], "reviews": [{"professor": "Joseph Bailey", "course": "BMGT190H", "review": "It's possible to take this class too seriously, as many overachievers with lots of time will. My group spent long hours of countless meetings for \"team projects\" poring over details and trying to impress Bailey, only to get a completion grade on the project. His class time was also not very fulfilling, and the only real \"material\" we \"learned\" were things like \"dress nicely to your interviews\", \"how to dress nicely\", and \"what to say at job interviews\".\n\r\nHis tests were very opinion based (such as, how effective were your surveys in your team project?) and if you didn't have the opinion he wanted, you lost a few points, but it wasn't a big deal anyway since most of the points were completion points for presenting your team project.\n\r\nOverall, the class doesn't teach you much, and it's mainly learning by doing, except that everybody gets A's anyway, which is kind of frustrating (not to complain though), since you actually spend a whole lot of time working on your team project just to get an easy A that you could have gotten being lazy like the other team.", "rating": 4, "expected_grade": "A+", "created": "2011-03-03T04:55:00Z"}, {"professor": "Joseph Bailey", "course": "BMGT190H", "review": "I guarantee you. He's the best professor you will ever have in the university. ", "rating": 5, "expected_grade": "A", "created": "2010-12-02T19:09:00Z"}, {"professor": "Pamela Armstrong", "course": "BMGT190H", "review": "The class was very interesting in that it was mostly team based. Dr. Armstrong also brings in some guest speakers, which was good to learn about different opportunities and network. However, the lectures she gave were pretty lengthy and hard to focus through. They were useful, but could have been presented in a more interesting way. Additionally, the grading is pretty harsh on the papers and presentations, though this is the first QUEST class so the expectations are not known yet.", "rating": 4, "expected_grade": "A", "created": "2021-05-29T18:49:10Z"}], "department": "BMGT", "course_number": "190H", "name": "BMGT190H", "title": "Introduction to Design and Quality", "credits": 4, "description": "<b>Restriction:</b> Must be in the Quest program.  Cross-listed with ENES190.\n<b>Credit only granted for:</b> BMGT190 or ENES190.\nQUEST students learn and apply design practices to design new products and services. Working in multidisciplinary teams, students use quality and process improvement methods to identify, analyze, and recommend solutions to real-world problems.\n<i>Restricted to QUEST program students. Cross-listed with ENES190H. Credit   granted for ENES190H or BMGT190H.</i>", "is_recent": true, "geneds": null}