{"average_gpa": null, "professors": ["Hilary Bierman", "Hilary Bierman", "Hilary Bierman", "Hilary Bierman", "Hilary Bierman", "Hilary Bierman", "Hilary Bierman"], "reviews": [{"professor": "Hilary Bierman", "course": "BSCI455", "review": "Not an interesting class made up of a lot of busy work. The professor is nice but very obviously picks favorites (this has an affect on the grade you get)", "rating": 1, "expected_grade": "A", "created": "2023-04-17T02:47:01.068910Z"}, {"professor": "Hilary Bierman", "course": "BSCI455", "review": "I did not enjoy BSCI455/NEUR405. I took this class because of the promising grade distribution compared to other BSCI courses. However, I should have given these reviews more thought before I signed up. It's not difficult to get an A or A- in this class, but your TA does play a massive part in the grades that you receive. Some people get lucky with a TA who grades leniently and is easy to communicate with, while others do not and must fend for themselves. In my opinion, the 2-hour lecture once a week is unnecessary: it doesn't do much to help you more in the class if you do all the readings and assignments on your own. You can expect to stay in the lab for the full 4 hours every week (besides the first couple of labs) even if your group members are well-prepared and did all the pre-lab readings and assignments. The assignments for this class are pretty straightforward, but they do take up quite a bit of time, and all of the big assignments are graded as a group. I do kind of agree with the review that the professor picks favorites, but it doesn't take much to get on her good side. Just be participative in class, and she'll learn your name and face pretty quickly. I think the hardest part of this class is doing the dissections in the lab and obtaining data, and troubleshooting can take you up to a couple of hours each week. All in all, this proved to be a lot of headache for a 3 credit course, but it's a given that you will get a decent grade.", "rating": 1, "expected_grade": "A-", "created": "2023-12-11T16:12:03.012453Z"}, {"professor": "Hilary Bierman", "course": "BSCI455", "review": "I wish I were kidding but this is the worst class I have taken in college. The workload/learning ratio is so high it's indescribable. Get ready to fill out useless worksheets, have 4-hour labs, and write 20-30 page lab reports which will be graded based on very small formality details rather than their content. If possible, make sure to join a group of 4 or 5 to divide the work better, if you have 3 people, power to you my friend. Don't worry though, after all the 700+ points of the class, you will get 3 bonus points because you were in a group of 3 for the whole semester. The labs don't work nearly as well as they are presented, your data is going to be super messy most likely, there is going to be a lot of troubleshooting in the lab and sometimes even the TAs cannot help. Grading is in the hands of your TA almost entirely so it can vary between sections so good luck with that as well. If you have the choice, take BSCI451. Lastly, the lecture is pretty useless, there is no reason for it to be 2 hours long, and half an hour would suffice. Not to mention, a lecture will not truly help you with lab report writing because the TAs are going to find the smallest details in your report, irrelevant to the content, and take off points. \r\n\r\nThere are two good things about this lab: The dissections which are cool but quite difficult and poster day at the end of the semester. That's it. Good luck.", "rating": 1, "expected_grade": "B+", "created": "2023-12-24T16:32:37.477443Z"}], "department": "BSCI", "course_number": "455", "name": "BSCI455", "title": "Neuroscience Laboratory", "credits": 3, "description": "<b>Prerequisite:</b> NEUR306 or BSCI353.\n<b>Recommended:</b> NEUR305.\n<b>Cross-listed with:</b> NEUR405.\n<b>Credit only granted for:</b> PSYC401, NEUR405, BSCI455 or BSCI454.\nStudents will utilize neurophysiological techniques to examine fundamental principles of  neurons and neural circuits. This course will reinforce content from prerequisite NEUR courses. Students will also strengthen skills in experimental design and scientific writing.\n<i>(Sponsoring Dept.: BIOL). Acceptable toward Biological Sciences Specialization Areas: CEBG (Cell Biology), GENB (Cell Biology, Development, Physiology), and PHNB. Students must pay a $40.00 lab fee.</i>", "is_recent": true, "geneds": null}