{"average_gpa": null, "professors": ["Luka Arsenjuk", "Joshua Weiss", "Valentina Rosales", "Luka Arsenjuk", "Brittany Starr", "Anthony Obute", "William Pittman", "Caroline Eades"], "reviews": [{"professor": "Luka Arsenjuk", "course": "CINE280", "review": "If you want to learn about film or just have a few hours to sit in lecture and work on something else, this class is for you. Professor Arsenjuk doesn't really do anything or grade anything (except maaaybe the term paper). He just lectures and it is easy to tell he really loves film. The TA's are super nice and helpful. If you show up to most classes: easy A. The term paper is extremely easy to BS, and they were graded so quickly I highly doubt they were all even read thoroughly. \r\nBe ready to watch some dull movies that are hard to understand at 2x speed. Some of the assigned films are interesting, but those are dwarfed in number by the boring ones. \r\nIn all, great prof and little effort required.", "rating": 5, "expected_grade": "A", "created": "2022-05-20T21:07:49Z"}, {"professor": "Valentina Rosales", "course": "CINE280", "review": "One of the kindest human beings I’ve ever met. Going to her class is always the best part of my day. Don’t take if you’re not gonna go to class or participate", "rating": 5, "expected_grade": "A", "created": "2022-11-14T21:40:10.366281Z"}, {"professor": "Valentina Rosales", "course": "CINE280", "review": "An absolute pleasure taking a class from her. I always looked forward to class. The class opened my eyes to so many films I never thought I would enjoy.", "rating": 5, "expected_grade": "A+", "created": "2022-12-12T17:22:07.159196Z"}, {"professor": "Luka Arsenjuk", "course": "CINE280", "review": "This class is extremely easy. There are easy weekly one-page double-spaced reflections based on weekly readings (that you can skim) and weekly films (that I recommended putting on 2x speed). About 3 weeks in, there is a new guest lecturer each week who goes in-depth on the theme/film of the week. He's strict about talking in class, but other than that he's easygoing.", "rating": 5, "expected_grade": "A+", "created": "2023-05-01T22:11:07.489831Z"}, {"professor": "Valentina Rosales", "course": "CINE280", "review": "Easy class, nice teachers, but she doesn't respond to emails for some reason.", "rating": 4, "expected_grade": "A", "created": "2023-05-16T17:31:50.530856Z"}, {"professor": "Luka Arsenjuk", "course": "CINE280", "review": "Easy class, teacher doesn't respond to emails for some reason.", "rating": 4, "expected_grade": "A", "created": "2023-05-16T17:32:31.937805Z"}, {"professor": "Luka Arsenjuk", "course": "CINE280", "review": "This class was overall pretty interesting and very easy. Almost every week we have to watch a film (most of them were boring but if you watch them at 2x speed it's easier to get through) and then there's a discussion that's super easy - you just talk about different parts of the film. Then at the end of the semester, there is a final paper where you analyze one of the films. The lectures were also kind of interesting - there were guest speakers almost every week.", "rating": 5, "expected_grade": "A+", "created": "2023-05-19T03:30:43.748399Z"}], "department": "CINE", "course_number": "280", "name": "CINE280", "title": "Film Art in a Global Society", "credits": 3, "description": "<b>Cross-listed with:</b> CMLT280.\n<b>Credit only granted for:</b> CINE280, FILM298D or CMLT280.\n<b>Formerly:</b> FILM298D.\nComparative study of a variety of film traditions from around the world, including cinema from Hollywood, Europe, Asia and developing countries, with a stress on different cultural contexts for film-making and viewing.", "is_recent": true, "geneds": null}