{"average_gpa": 3.38, "professors": ["Marit Knollmueller", "Paul Cote", "Steve Beaulieu", "Manon Soulet", "Sara Faradji", "Liora Moriel", "Caitlin McGrath", "Joseph Byrne", "Lauren Albright", "James Hodapp", "Porter Olsen", "Eric Zakim", "Shalom Rosenberg", "Tung-An Wei", "Luka Arsenjuk", "Kyle Bickoff", "William Pittman", "Dominique Young", "Valentina Rosales", "Joshua Weiss", "Valentina Rosales", "Luka Arsenjuk", "Brittany Starr", "Anthony Obute", "William Pittman", "Caroline Eades"], "reviews": [{"professor": "Anthony Obute", "course": "CMLT280", "review": "He is a nice guy... BUT he is not a great professor by any means. Classes are long and drag on forever. Cold calls and forced particiaption every class. Everything is very subjective in the class but if you give an answer he doesn't agree with then he will make you feel stupid. Sometimes he will just laugh at people when they gave an answer to a question that was wrong. Relatively harsh grader and waits to post the majority of grades until the end of the semester. Like I said, very nice guy but is not the most ideal professor (especially when taking a class that was supposed to be an easy elective).", "rating": 2, "expected_grade": "A", "created": "2023-12-11T19:08:50.316317Z"}, {"professor": "William Pittman", "course": "CMLT280", "review": "Will is really funny and interesting to talk with during the discussions we had in class. I think a lot of people took this class really unseriously because no one would show up to the Friday classes or they would come late in general. Make sure to go to class and remember to do the discussion boards because they don't show up on canvas and they're due at 7pm because that's 60% of your grade. You don't even have to talk that much in class just show up on time and do the assignments which are just the discussion boards and 3 short essays.", "rating": 4, "expected_grade": "B", "created": "2023-12-15T15:43:11.095490Z"}, {"professor": "William Pittman", "course": "CMLT280", "review": "The class was very unorganized and he did not follow the syllabus at all. 30% of our grades complied of discussion board posts but he did not make that clear at all and made it seem like they were optional. Furthermore, these discussion board posts also weren't counted as \"assignments\" on elms so you can VERY easily forget about them because I use the calendar on elms to ensure I've done all my work and the discussion board posts don't show up because he doesn't put them as an assignment. Furthermore, he doesn't follow the syllabus at all and kind of reconstructed our class. Also, we didn't see our grades AT ALL the entire semester so we didn't know what we were doing wrong or how we were standing in the class. We were only given grades on our papers that we had to write for films. Will is a very nice guy and understanding but the way he structured this class was very bad and could have been done a lot more organized. If we were given a clear outlook of how this course would've been structured, it would have been a lot better.", "rating": 3, "expected_grade": "B", "created": "2023-12-15T16:01:01.786919Z"}, {"professor": "William Pittman", "course": "CMLT280", "review": "Cool class (CMLT280). He's very enthusiastic and the class is participation based. As long as you watch the movie before class and say something, you'll get an A. If talking in class is stressful, you can talk more in discussion boards. The essays (we had 2) aren't stressful either; he makes his standards clear and simple. You generally have 1 movie per week. 2 if one or both are shorter than the standard 2 hour length.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T22:51:59.817321Z"}], "department": "CMLT", "course_number": "280", "name": "CMLT280", "title": "Film Art in a Global Society", "credits": 3, "description": "<b>Cross-listed with:</b> CINE280.\n<b>Credit only granted for:</b> CINE280, FILM298D or CMLT280.\n<b>Formerly:</b> FILM298D.\nComparative study of a variety of film traditions from around the world, including cinema from Hollywood, Europe, Asia and developing countries, with a stress on different cultural contexts for film-making and viewing.\n<i>Cross-listed with FILM298D.\n<b>Credit only granted for:</b> CMLT280 or FILM298D.</i>", "is_recent": true, "geneds": null}