{"average_gpa": 2.397250859106529, "professors": ["Nelson Padua-Perez", "Ilchul Yoon", "Anthony Banes", "Jandelyn Plane", "Jandelyn Plane", "Ilchul Yoon", "Jandelyn Plane", "Aaron Kyei-asare", "Maksym Morawski", "Ilchul Yoon", "Maksym Morawski"], "reviews": [{"professor": "Larry Herman", "course": "CMSC106", "review": "I read the reviews below before taking 106 with herman and was very surprised.  I thought he did an excellent job teaching the course.  Granted 106 is supposed to be easy so maybe that is why I thought he did a good job.  \r\nI almost never had to open the textbook because all I had to do was listen to lecture and then I would have everything I needed to do the projects.  He was mildly funny and kept the class engaging.  To be honest if you actually go to class arrive on time and pay attention you should be able to learn from him. \r\nThe projects were nit-picky, but that is because he has a program grade them to ensure accuracy (But I must say most of the projects were pretty easy for me, although many of my classmates struggled).\r\nThe tests were a little more difficult just because I find it hard to write code on paper (you have to write a short program for most tests).\r\nQuizzes in discussion were announced and generally just quickly reviewing the previous two lectures would give you enough information to get ~36/40 on the quiz.\r\nSeriously if Herman is the worst lecturer in the CS department then the department must have the best lecturers on campus because he really wasn't that bad.\r\nP.S. go to class and pay attention it really helps even if you don't think it does.\n\r\nI also took CMSC131 with Herman:\r\nSame as above pretty much, a lot of people just have no logic and do not belong in computer programming classes (or the major).  Logic cannot be taught, and if you don't have any then go away, you are annoying to the rest of us that can actually figure things out.  Seriously, he does a good job, if you don't excel in his class it's not his fault, you just aren't capable of the programming logic approaches, which is okay, just change majors.\n\r\nFor CMSC131 Do not buy the textbook, I always buy my textbooks, but the Java book is a waste of money, EVERYTHING IS ONLINE:\r\nhttp://docs.oracle.com/javase/6/docs/api/index.html", "rating": 4, "expected_grade": "A", "created": "2011-12-24T19:11:00Z"}, {"professor": "Larry Herman", "course": "CMSC106", "review": "1. Larry Herman teaches at a snail's pace. And by that, I mean an elderly snail that has trouble being mobile. This class is a non-majors CS course, so it goes slower than most CS classes. But the pace at which Larry Herman explains things is simply intolerable, even for someone who has never encountered computer programming. Yet Herman does not even teach effectively. He follows the book closely but does not present the material in an effective manner. He writes long explanatory sentences on the board but does not actually describe what they mean.\n\r\n2. He loves to make the class more irritating than necessary. He doesn't care about his students at all. I found discussion useless since I program in C and Java at my job but didn't feel prepared enough to test out of 131. However since unannounced quizzes were given in discussion, so I had to go. Yet Herman forbade the TA from telling ANYONE when the quizzes were. So each student was forced to either (a) go to every single discussion where the TA (who was horrendous, by the way) mumbled insensibly for an hour or (b) try to guess when the quizzes were and attend discussion on those days. Personally, I thought professors and TAs were supposed to make learning easier, NOT harder. \n\r\n3. Tests and quizzes are fair and well written. \n\r\n4. Projects are fair, but he has an annoying way of saying important things during lecture. For example, due date changes announced the day before Thanksgiving break. Too bad I had a plane to catch. And he never, EVER e-mails out these important little details. He WANTS you to come to class for some obscure reason (aka feed his pride), since his lectures are useless and boring. Clearly he cares more about you coming to his lecture than about you succeeding. \n\r\n5. Projects and quizzes are not returned in a timely manner. Herman doesn't seem to realize that his TA is the worst grader possible, and when told so, he takes no action on it. \n\r\n6. Class website is easy to use and well-organized. The textbook is useful. \n\r\n7. He is a fair grader. ", "rating": 1, "expected_grade": "A+", "created": "2009-12-05T16:34:00Z"}, {"professor": "Larry Herman", "course": "CMSC106", "review": "I thought he was great. His exams were fair, no trickery, and he gave many practice questions and all his old exams. The projects weren't hard, and he was extremely approachable during office hours. If you went to class and he knew you worked hard he was willing to help with anything. Although sometimes on the boring side, he is an effective instructor and taught difficult material to us non-computer types clearly.\r\nOther posters say he is partial to girls...I am a girl, which could have been the reason for my positive experience\n", "rating": 4, "expected_grade": "", "created": "2008-12-17T18:35:00Z"}, {"professor": "Jandelyn Plane", "course": "CMSC106", "review": "Learned the material well from this class, feel like a C++ pro. Only gripe is that A+'s don't exist, always a bummer to get a 97 or higher and just get an A. Her videos and lectures were very helpful, and even though this isn't about them her TA's were the best I've had in a class. As someone completely new to computer science, this class was great.", "rating": 5, "expected_grade": "A", "created": "2022-05-20T18:19:51Z"}, {"professor": "Ilchul Yoon", "course": "CMSC106", "review": "I love Yoon. Best lecturer I've had. He's great at structuring the course and explains things thoroughly. He's also just very personable. I wish he was my dad. Our projects were very manageable, we have like 5 total, 11pm due times, and you have to do the minimums for every project to pass the course. He encourages students to start them early, and it just made for a healthy homework schedule, if that makes sense. He posts review worksheets for exams, lecture slides, and example programs which have all been helpful. I'd say the quizzes are the harder part of the class, but none of them get too crazy. \r\n\r\nOther details... it was a smaller class, mostly math majors, most of us beginners. The lab section isn't as awesome since TA's teach that part, but they do fine. Also, he usually waits until the end of the semester to curve. But yeah, Yoon's a stellar dude.", "rating": 5, "expected_grade": "A-", "created": "2022-11-30T15:02:50.787207Z"}, {"professor": "Jandelyn Plane", "course": "CMSC106", "review": "Honestly one of the best professors I have had. This class I didn't find that challenging considering we also had like three TA's that were SUPER helpful. Sometimes the Projects we had due were a bit hard but the TAs help you out a lot. Also, the professor is very helpful during office hours and would work with you even after the allocated time until your program is running again. If you know you're going to struggle with projects you HAVE to start them ASAP, so you can get help before the project is due. She is pretty flexible with submitting stuff late due to technical difficulties. She was also very sweet and kind at least to me. If you're taking CMSC106 as a math major whos not really interested in CS, I definitely recommend her.", "rating": 5, "expected_grade": "A", "created": "2022-12-01T14:18:54.957351Z"}, {"professor": "Maksym Morawski", "course": "CMSC106", "review": "Maks is really nice and it's obvious that he is on our side, and knows how difficult the course is. His lectures are good and he posts the material afterwards which is helpful, however since the class is naturally difficult and hard to keep up with you should make sure you practice a lot on your own time to ensure you do good. The projects get progressively harder, so make sure you dont underestimate how long they take.", "rating": 4, "expected_grade": "B", "created": "2023-12-02T20:07:29.477256Z"}, {"professor": "Maksym Morawski", "course": "CMSC106", "review": "not a bad professor, very cool and chill but his teaching style was a mess. lectures were just slide shows and sometimes hard to follow all the information given to beginners without practice. listened to student feedback throughout the semester and was flexible with exam dates. exams weren't hard but definitely need to study for them if you don't feel mastered at the topics. not the worst class, but it was very messy and unorganized, the TAs definitely made the class better to follow.", "rating": 3, "expected_grade": "A+", "created": "2024-01-23T16:54:36.895213Z"}], "department": "CMSC", "course_number": "106", "name": "CMSC106", "title": "Introduction to C Programming", "credits": 4, "description": "<b>Prerequisite:</b> MATH115.\n<b>Restriction:</b> Must not be in Computer Science program; and must not have completed any courses from CMSC131-499 course range.\n<b>Credit only granted for:</b> CMSC106 or CMSC122.\nDesign and analysis of programs in C. An introduction to computing using structured programming concepts. Intended for students with no or minimal programming experience.", "is_recent": true, "geneds": null}