{"average_gpa": 3.136197440585009, "professors": ["James Reggia", "Hal Daume", "Venkatramanan Subrahmanian", "Marine Carpuat", "Ramani Duraiswami", "David Jacobs", "William Regli", "Furong Huang", "Soheil Feizi", "Furong Huang", "Mohammad Nayeem Teli", "Mohammad Nayeem Teli", "Soheil Feizi", "Mohammad Nayeem Teli", "Mohammad Nayeem Teli", "Furong Huang", "Heng Huang", "Mohammad Nayeem Teli"], "reviews": [{"professor": "Hal Daume", "course": "CMSC422", "review": "Unfortunately, Hal was disappointing. At first, he seemed like he'd put a tremendous amount of effort into the class and that we would learn a lot. After the first 3 weeks though, he stopped putting any effort, and taught extremely poorly. We barely covered any material, and he made the final trivial. I wouldn't recommend him for anyone who wants to learn: though he does make the class very very easy (16% extra credit absolute).", "rating": 2, "expected_grade": "A+", "created": "2016-12-18T16:50:00Z"}, {"professor": "Alex Springer", "course": "CMSC422", "review": "Very good", "rating": 5, "expected_grade": "A+", "created": "2018-02-23T03:37:20Z"}, {"professor": "Ramani Duraiswami", "course": "CMSC422", "review": "Friendly guy, not the best teacher or course. Curves well", "rating": 4, "expected_grade": "", "created": "2019-12-18T07:26:34Z"}, {"professor": "Ramani Duraiswami", "course": "CMSC422", "review": "Ramani is a friendly teacher, but I don't think he taught 422 that well. Lectures were sort of boring, and he doesn't really explain concepts in an intuitive, understandable way.", "rating": 3, "expected_grade": "B+", "created": "2019-12-19T00:42:56Z"}, {"professor": "David Jacobs", "course": "CMSC422", "review": "Friendly and knowledgeable. Good curve at end. Good intro to ML concepts, as it is not too thorough and covers a good amount of material. ", "rating": 4, "expected_grade": "B", "created": "2019-12-21T16:45:04Z"}, {"professor": "James Reggia", "course": "CMSC422", "review": "pretty chill prof, understanding of personal issues. the class isn't too difficult for a 400 level class, but i took this class during the covid pandemic so that might have skewed the difficulty of class(making it easier). either way if he's teaching take it with him!", "rating": 5, "expected_grade": "A", "created": "2020-05-13T01:13:31Z"}, {"professor": "Ramani Duraiswami", "course": "CMSC422", "review": "Worst taught course ever. This course was co-taught by him and David Jacobs, and I ended up skipping my other CS class to go to Jacobs' discussions. If you have the option please take Jacobs instead. Dr. Duraiswami simply reads over slides, didn't truly teach anything, especially if it related to the weekly quizzes or the final, and wouldn't go over quiz answers because somehow we're magically supposed to \"understand\" what we were never actually taught. He also would make a lot of errors, which is perfectly human, but it was never corrected, and some of us can't tell what's right/wrong to be able to immediately correct him. As a result, I never had any real material to study off of and didn't learn enough to know whether what he did was actually correct or not. Also, office hours were very limiting and didn't help much with problem sets. Overall, poorly taught class, and would not take a course with him again.", "rating": 1, "expected_grade": "", "created": "2021-01-14T21:46:56Z"}, {"professor": "Furong Huang", "course": "CMSC422", "review": "Professor Huang is a good instructor, but the course is poorly designed in my opinion. She was very generous with grades (due to the pandemic probably), and the class material was pretty straightforward. The homeworks in the form of ELMS quizzes make it feel like you don't learn much that much though.", "rating": 4, "expected_grade": "", "created": "2021-06-14T17:38:17Z"}, {"professor": "Ramani Duraiswami", "course": "CMSC422", "review": "Lectures are handwritten, which is horrible. They request you read the textbook before the lecture, but then review it verbatim, therefore making reading the textbook feel a little frustrating. However, he is quite knowledgeable and communicates content pretty effectively.\r\n\r\nHe combines his lectures with the other professor, and it just ended up being really annoying. Especially since the other professor was significantly worse at teaching than he was.", "rating": 3, "expected_grade": "B", "created": "2021-12-09T19:02:30Z"}, {"professor": "Ramani Duraiswami", "course": "CMSC422", "review": "I took this course in Fall 2021\r\n\r\nPros:\r\n+ Generally nice guy\r\n\r\nCons:\r\n- Is a meh lecturer, I do not feel as though his explanations of concepts were sufficient\r\n- Lectures are handwritten, and is often hard to read\r\n- Lecture notes are not easily available in one place, they were on Piazza but not readily organized, and half of them weren't even there.\r\n- Lecture barely helps with coding assignments\r\n- THE CLASS IS VERY DISORGANIZED! Along with what I've already said, lectures were delivered during the Tuesday morning section and the Thursday afternoon section. However, since you are only scheduled for either the morning or afternoon section, you would either have to find some way to get there in time, or (most likely), watch the lecture videos which are extremely long. They did not make it clear how exactly content was split up between both of those classes, or what quizzes were on what concepts, and it took me about a month and a half to figure out how the class was organized.\r\n- Workload is very high, even for a 3 credit CS class", "rating": 2, "expected_grade": "B-", "created": "2021-12-23T19:03:29Z"}, {"professor": "David Jacobs", "course": "CMSC422", "review": "I took this course in Fall 2021\r\n\r\nPros:\r\n+ Generally nice guy\r\n+ Pretty good curve\r\n+ Pretty good lecturer\r\n\r\nCons:\r\n- Some lectures, especially towards the end, seemed irrelevant to the course, only for them to appear on the final. This seemed unfair, especially when it was alluded that the topics were auxiliary to the course\r\n- Lecture notes are not easily available in one place, they were on Piazza but not readily organized, and half of them weren't even there.\r\n- Lecture barely helps with coding assignments\r\n- THE CLASS IS VERY DISORGANIZED! Along with what I've already said, lectures were delivered during the Tuesday morning section and the Thursday afternoon section. However, since you are only scheduled for either the morning or afternoon section, you would either have to find some way to get there in time, or (most likely), watch the lecture videos which are extremely long. They did not make it clear how exactly content was split up between both of those classes, or what quizzes were on what concepts, and it took me about a month and a half to figure out how the class was organized.\r\n- Workload is very high, even for a 3 credit CS class", "rating": 3, "expected_grade": "B-", "created": "2021-12-23T19:07:51Z"}, {"professor": "David Jacobs", "course": "CMSC422", "review": "I don't usually do reviews, but I really wish someone would have warned me about this class before I took it. It is quite possibly one of the worst taught classes I have ever taken at UMD, mostly because of how its run. \r\n\r\n1. Class Structure - This class is the most disorganized class in the CS department. Jacobs and Duraiswami co-teach, so even if you are in Jacobs's section you'll still have to deal with lectures from Duraiswami (and vice versa if you're in the other section). For some reason the professors thought it was okay to essentially add another \"period\" of mandatory content. We had in-person lecture on Tuesday, and Thursdays were reserved for \"discussion\" where we would do actual practice problems instead of theory. However, before the next week's Tuesday lecture, you were expected to watch the recorded lecture from the other section. So basically, even though you only registered for two 1 hr 15 min periods, you effectively had to complete 3 to make the most out of the class. Another issue is that none of the resources are centralized. They post the jamboard from lecture in the resources section of piazza, but discussion problems and jamboards are lost within the sea of piazza questions. Some of them were missing, and in general it was extremely difficult to access the content in a systematic way. \r\n\r\n2. Content -  I ended up self teaching a lot of the content in this class. During lectures, both professors tended to ramble and never really seemed to hit the point. Rather than using structured slides, they taught freely while writing things on a Google Jamboard (essentially a virtual whiteboard). This is fine if you know exactly what you want to talk about, but unfortunately Jacobs had a tendency to make a lot of mistakes and get confused while teaching. I never retained anything from lecture until I googled things on my own to learn them. I also felt like the general flow of topics could have been a little better. \r\n\r\n3. Responsiveness & Grading- This class had one of the worst Piazza response rates. There were times where I would have questions that went over 4 days unanswered. This was especially problematic when a project was due the same week. A lot of times responses were also not that helpful. For example, I remember someone asked for clarification on one of the questions from the final review, and a professor responded with \"I don't see what's unclear with this solution,\" and then did not respond to the student's followup. The grading in the class was also extremely slow. Problem sets and quizzes from the middle of october were only graded in the last couple weeks of the semester. Solutions were not released until the last week either, which made it very difficult to study or even know where you stand in the class before the withdraw deadline. I understand that grading of written problem sets takes time, but in general it felt like there was no communication between instructors and TAs.\r\n\r\nOverall I was extremely disappointed with the class, especially given that I love machine learning. Some pros are that the professors were nice and generally approachable. There was also a decent curve at the end which helped boost a lot of grades. I'm sure both Jacobs and Duraiswami are smart people, but I think they did a pretty bad job teaching. I would take 422 with different professors if you can. ", "rating": 1, "expected_grade": "A", "created": "2021-12-25T00:27:40Z"}, {"professor": "David Jacobs", "course": "CMSC422", "review": "Generally a good professor for ML. Pretty responsive to student questions and very helpful/accessible especially during OHs. Overall, the class covered what I thought to be a pretty good range of different topics in ML appropriate for an introductory course, providing a solid foundation on the fundamentals including multivar calc, inner product, supervised learning, bayesian reasoning, and neural networks. Also, there were lectures on special topics(eg. GANs, transformers, CV,  ect) that were really interesting. Although, the class/lectures did feel a bit unstructured/disconnected at times due to 2 professors coteaching the course. Also, especially for those with a background in ML, the class material did feel a bit shallow and didn't rigorously cover some of the algorithms eg. SVMs to the level I would have liked\r\n\r\nBut overall, Prof Jacobs is a pretty solid choice and CMSC422 does offer what I think to be a good primer into the ML field that can be easily built upon through more advanced ML/DL courses.", "rating": 4, "expected_grade": "A", "created": "2021-12-28T03:14:56Z"}, {"professor": "Furong Huang", "course": "CMSC422", "review": "Decent instructor but the course is planned very poorly. She gives a decent curve but the homework quizzes were quite difficult and the exams were very abstract. The study material never seemed to help and i spent a lot longer than I should have on the assignments. Shes a good professor, but the class is going to be a challenge", "rating": 2, "expected_grade": "B+", "created": "2022-04-05T21:24:32Z"}, {"professor": "Furong Huang", "course": "CMSC422", "review": "Dr. Huang is a friendly professor and willing to help students but she expects students to have a higher math background than indicated by the course prereqs which makes following lectures difficult. The homeworks and exams are not exactly related to the content in the slides, and the projects do not have much detail, which overworks the TAs who have to answer all the holes in the projects. Despite this I still recommend her because she is very nice.", "rating": 4, "expected_grade": "", "created": "2022-05-19T00:59:28Z"}, {"professor": "Furong Huang", "course": "CMSC422", "review": "Incredibly caring professor. She makes an effort and it shows. Take her class and you won't regret it. It's by no means an easy A, but also not too difficult. ", "rating": 5, "expected_grade": "A", "created": "2022-07-12T23:23:14Z"}, {"professor": "Furong Huang", "course": "CMSC422", "review": "Nice professor, decent lectures. Often got very difficult to force myself to go as they were slow. Projects and slides were old and she would have notes that she would not put on the slides and only say out loud during lectures. If you missed it, that's too bad, it was probably on the weekly ELMS quiz, which was always annoying. Having only two attempts for the quizzes was super frustrating, especially for very mathematically dense weeks. The projects were fair, a little tedious. They have an autograder on ELMS, but we do not have access to see how we did until we get the grade. ELMS Computer Science courses stink, just put it on gradescope.", "rating": 3, "expected_grade": "A-", "created": "2022-12-16T16:19:14.302284Z"}, {"professor": "Soheil Feizi", "course": "CMSC422", "review": "Pros:\r\n-He's pretty fun\r\n-Getting a good grade is doable due to him curving the exams if people do bad\r\n-Not very much work\r\n\r\nCons:\r\n-The class was much more theory based than I expected. I don't feel any more prepared to implement machine learning algorithms than I did before starting the class\r\n-I've only taken the midterm so far but it was hard\r\n-Not very much work means there wasn't much practice content\r\n-Only one programming assignment and it was kind of a mess\r\n-He doesn't record lectures\r\n\r\nOverall I would recommend taking the class with Feizi though!", "rating": 4, "expected_grade": "A", "created": "2023-05-03T22:35:48.151167Z"}, {"professor": "Soheil Feizi", "course": "CMSC422", "review": "If possible, avoid Feizi, great person, horrendous structure of class. I agree with the other review, barely got to implement the algorithms specified in the class so I have nothing but tens of math theories in my brain which I will later forget. Would rather take Teli who has many projects so you can actually apply the material instead of this turning into a higher level theoretical math class. \r\n\r\nOther person is coping with the 4 star review and is judging based on how nice he is. Don't fall for the trap or else Feizi will give you a present.", "rating": 2, "expected_grade": "A", "created": "2023-05-19T05:20:13.844245Z"}, {"professor": "Soheil Feizi", "course": "CMSC422", "review": "Excellent lecturer. The logistics of the course were pretty bad - the TAs were often unavailable and not very helpful, and the homework assignments (ELMS quizzes and a programming assignment) were never really reviewed or explained well. Overall a good experience though.", "rating": 4, "expected_grade": "A", "created": "2023-05-21T12:51:24.924916Z"}, {"professor": "Soheil Feizi", "course": "CMSC422", "review": "Other reviews are generally correct. He's a nice guy and keeps lectures fun but everything that is taught is stuff that will just pass through your head by the time the class is done (experiencing that rn). Him and his TAs are like always MIA tho so you are kind of on your own. I think Teli is the move if you want to learn stuff and retain it though. Still a decent experience overall.", "rating": 3, "expected_grade": "B", "created": "2023-05-30T14:55:24.579329Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC422", "review": "This is a midsemester review for the class in Fall 2023. I think Prof Teli has done a great job teaching this class so far. He posts the lecture slides and notes relatively quickly, does a good job at answering questions within lectures, and uploads the lecture recordings. He and his TAs are also very responsive on Piazza and provided a practice midterm before the actual exam. The HW quizzes in ELMS  do a good job of reinforcing the concepts for the ML models we've covered and we get 1 week to do each of them. The lecture examples and HW problems definitely help in preparing for the midterm. I thought it was reasonable. The projects are interesting and we get about 2-3 weeks to work on each them. I'd recommend starting the projects early. The HW quizzes are automatically graded and you get a few attempts to work on each one, which I think is very nice. The TAs and Prof Teli are very helpful and understanding in their in-person OH. One concern I have regarding the class is there not online OH in addition to the in-person ones as there probably are students not always on campus that could benefit from them. Another is that there are no late submissions allowed so it is important to get all your assignments done on time. Aside from that, I think Prof Teli overall has done a great job and he has been very organized with this class. I took 320 online in Summer 2023 and his class was also very organized. I think a lot of the reviews are very negative towards Teli's teaching as a professor and he is very underrated. I highly recommend you take a class with Teli if possible (preferably 320 or 422).", "rating": 5, "expected_grade": "A", "created": "2023-10-19T23:48:46.187464Z"}, {"professor": "Soheil Feizi", "course": "CMSC422", "review": "Awesome professor who is very approachable and super passionate about what he is teaching. Exams were fair and so were homework which were also quite sparse. The programming assignments were a little disorganized and a little underwhelming in that we did not get a lot of programming experience with ML but the course is more about the theory and being able to apply things.", "rating": 5, "expected_grade": "A", "created": "2023-11-08T05:41:15.900090Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC422", "review": "Pretty much agree with all the recent comments about Teli as well. He's a great professor and really good at explaining the math behind all the ML-related concepts taught in this class in an understandable, step-by-step manner. The math discussions can get dry but it's a really important part of succeeding in this field, and Teli does an excellent job working through the derivations and matrix calculations that may make students overwhelmed. If you have a chance to take this (or honestly any) CS class with Teli, I would highly recommend doing so.", "rating": 5, "expected_grade": "A", "created": "2023-12-14T02:37:18.636152Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC422", "review": "I posted a midsemester review of this class back in October 2023 so this is a review for the class in Fall 2023 semester now that it's over (apologies for being a little late). My feedback for this course now is basically the same as the prior review I made. The first thing I would like to add are that the final project was a little challenging (extra credit section was interesting) and time-consuming so as always, make sure you start your projects early. Second, the final exam was cumulative and relatively similar to the practice final we got. There was also a final exam review session via Zoom, which greatly helped. This class will be challenging from a mathematical standpoint so make sure your calculus, probability, statistics & linear algebra foundation is strong. Other than that, the class was well-organized. I still recommend all students to take this class with Prof Teli.", "rating": 5, "expected_grade": "B+", "created": "2024-01-01T22:35:53.117075Z"}, {"professor": "Marine Carpuat", "course": "CMSC422", "review": "Great teacher!!! Well organized, clearly explains topics", "rating": 5, "expected_grade": "A", "created": "2024-02-24T14:01:53.619099Z"}, {"professor": "Mohammad Nayeem Teli", "course": "CMSC422", "review": "The content is difficult but Teli structures it in a way so that it won't take too much time. If you look through the slides before the exams they are doable, and he genuinely cares about his students.", "rating": 4, "expected_grade": "A", "created": "2024-03-28T17:15:08.737646Z"}], "department": "CMSC", "course_number": "422", "name": "CMSC422", "title": "Introduction to Machine Learning", "credits": 3, "description": "<b>Prerequisite:</b> Minimum grade of C- in CMSC320, CMSC330, and CMSC351; and 1 course with a minimum grade of C- from (MATH240, MATH461); and permission of CMNS-Computer Science department.\nMachine Learning studies representations and algorithms that allow machines to improve their performance on a task from experience. This is a broad overview of existing methods for machine learning and an introduction to adaptive systems in general. Emphasis is given to practical aspects of machine learning and data mining.\n<i>Credit only granted for CMSC422 or CMSC498M.</i>", "is_recent": true, "geneds": null}