{"average_gpa": 2.527072072072072, "professors": ["Fawzi Emad", "Pedram Sadeghian", "Jandelyn Plane", "Ioana Bercea", "Thomas Reinhardt", "Ilchul Yoon", "Brian Brubach", "Jennifer Manly", "Jennifer Manly", "Jennifer Manly", "Pedram Sadeghian", "Jennifer Manly", "Nelson Padua-Perez", "Jennifer Manly", "Pedram Sadeghian", "Aaron Kyei-asare", "Jennifer Manly", "Pedram Sadeghian"], "reviews": [{"professor": "Fawzi Emad", "course": "CMSC122", "review": "Amazing professor. Makes the material very interesting and got me involved in computer science. I am a business major and he was so good I started coding in my free time!\r\nSome people had trouble with certain parts of the class, but that was not his fault, but a function of the material.\r\nBottom line: Take Fawzi for anything he teaches. He is the man.", "rating": 5, "expected_grade": "A+", "created": "2015-01-21T12:51:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Fawzi is a FANTASTIC professor! I entered 122 with absolutely zero knowledge or experience in the subject, and by the end he had me switching my major!  He is exciting in class, extremely fair in his tests, helpful in assigned projects, and if you go to lectures he makes the material incredibly easy and understandable! With computer science, part of it will always be a natural aptness to computers and thinking in code that not everyone has.  However, for beginners and non comp sci majors, Fawzi is more than ready to help and always willing to repeat ideas.  If you are ever stuck, I've never been to a more productive office hours!", "rating": 5, "expected_grade": "A", "created": "2014-12-19T13:25:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Great instructor. His enthusiasm keeps you from falling asleep in his class. Projects aren't too bad, but I've never had programming experience so javascript was difficult for me. I heard he's helpful during office hours but I never went.\r\nTake this if you want comp sci experience, but not if you want an easy DSSP gen ed credit.", "rating": 5, "expected_grade": "B-", "created": "2014-05-19T21:27:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Fawzi was a great professor. Anyone saying he taught poorly probably just doesn't like Computer Science, not Fawzi. I don't know how you can make a computer class anymore simple or interesting. The TA's and his own office hours were extremely helpful for the projects. The tests and quizzes were straight from the lecture slides so if you go to class and then review them as study material you will get an A; the final is no exception. \n\r\nI had fun in this class and am now going to declare a Computer Science minor", "rating": 5, "expected_grade": "A", "created": "2012-07-18T12:33:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Programming is not really my thing, but Fawzi made the class more than bearable. His sense of humor and teaching style were very amusing and overall this was a great class. He grades reasonably, and the assignments were mostly pretty cool (except for one of them that drove me up a wall.) BTW, I thoght I was getting a C, but ended up with a B! Fawzi is more than fair when it comes to grades.\n\r\nSomebody else said Fawzi wasn't helpful in office hours, but that's total B.S. I don't know why that kid is so pissed off - Fawzi knows the material backwards and forwards and will go out of his way to make sure you understand it. I got a lot of help in office hours from Fawzi -- he was totally chill.", "rating": 5, "expected_grade": "B", "created": "2012-05-29T20:12:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "The class was fun!  Fawzi is truly a gifted instructor and does a great job making sure that everyone learns the material.  I met with him several times during office hours and he was very personable and helpful.  \n\r\nThe exams were very fair (actually, they were pretty easy).  The projects were reasonable, but don't start working on them at the last minute because office hours get crowded on the day the projects are due.\n\r\nThis is a course for beginners, so you don't need to know anything beforehand.  But be prepared to do some work. The projects take a good amount of time and there are frequent quizzes that you'll need to study for.\n\r\nOverall, this was a great class for me -- I learned a lot and enjoyed it quite a bit.", "rating": 5, "expected_grade": "B", "created": "2012-05-24T12:30:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "This class consisted of 2 midterms, the final, 10 quizzes, 5 programming projects, and an 8 page paper. The paper sounds bad but it's easy, basically if you do it and it's coherent, you should get an A. \n\r\nThe class is easy in the beginning, until you start talking about Javascript. However, I ended up getting an A in the class and I had no prior programming knowledge whatsoever. He tries to make lectures interesting and talk about things that could be useful and get you interested in computer programming, if you aren't already. \n\r\nThe tests have at most three questions where you have to write programs, and the rest are short answers, so he tries to help out the people who might not be good at writing programs and functions.\n\r\nGood class to take if you are willing to put in a little work for the A.", "rating": 4, "expected_grade": "A", "created": "2012-05-14T14:39:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "I'm finishing up CMSC122 with Mr. Emad this semester.  So far (as a second semester Freshman) this is the best class I've had in college. I'm actually changing my major to Computer Science as a result of my experiences in this course. Mr. Emad's teaching style is outstanding -- he is very enthusiastic and his explanations are always logical and easy to understand. The exams were reasonable (not too long and at the right level) and the projects were decent. I'm looking forward to taking CMSC131 with Mr. Emad this summer and continuing on in the major.", "rating": 5, "expected_grade": "B", "created": "2012-04-22T20:31:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "1st: If you are a JOURNALISM MAJOR dont take this class with him.  and btw that expected grade is a C if he doesnt act like a complete douche.  He teaches 122 as if you already know coding and caters his class to people that will be majors or are trying to get into the major.  His grading is arbitrary and doesnt give you a rubric for the projects. Sketch. His grading is harsh, unforgiving and frankly unnecessary for an introductory class.  He doesnt curve, but takes off chunks of your grade for senseless things.  \n\r\nHe needs to think more about his audience, which is the key to being a good teacher.  Don't cater your class to people that already know material.  Bring everyone up or reconsider your profession\n\n", "rating": 1, "expected_grade": "C", "created": "2012-04-20T21:28:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Let me begin by saying that CMSC122 is probably one of the most demanding CORE classes out there, and you should take it only if you're willing to LEARN something (not a class where you can beat around the bush and get an A). With that said, Dr. Emad makes the rigorous challenge of learning a programming language for the first time insanely fun. He's a great guy, and overall a professor that can actually TEACH. I usually suck at programming, but because of his guidance, I can actually program independently now. You will have to work your tail off in his class, but trust me, in the end it's the most accomplished feeling you'll ever have. Wish I actually majored in Compsci now, since he made everything seem so interesting! ", "rating": 5, "expected_grade": "A", "created": "2011-05-16T13:41:00Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "Very friendly and approachable person. Clearly passionate and knowledgeable. Unfortunately, he has apparently injured his clavicle from years of writing on the board, so he gave lectures from a PowerPoint. He seemed a little out of his comfort zone.\n\r\nNonetheless, great professor. If you know nothing of HTML, CSS, or Javascript he'll make sure you do by the end of the class! Always has office hours and always willing and able to address any concerns.", "rating": 5, "expected_grade": "", "created": "2011-04-25T19:34:00Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC122", "review": "In all honesty, I don't know why everyone is praising Nelson. Maybe it is because they didn't have him for CMSC122. Seriously, don't take this class. It is just a bunch of unneeded stress. \n\r\nNelson is the first teacher that I've ever had that actually discouraged asking questions. I asked him reasonable questions during lecture and he not only didn't answer them, he makes an example of me in front of the class. \n\r\nHe also teaches the class as if it is a bunch of grad students or something. He goes super fast and will once in a while ask us if he is going to fast. When I told him he was, he proceeded to go at the same pace.\n\r\nHe is also very inaccessible. He often ignores emails or sends back nasty messages saying things that frankly, I don't understand. The TA's also don't show up to class so when you go into office hours (which also suck) you don't know who they are. \n\r\nI went to a lot of the lectures, but I found myself learning more from a friend in a 2 hour period than I did all year with him.\n\r\nI noticed that computer science is a thing that comes natural to some and not to others. If you are like me and know nothing, seriously reconsider taking this class. ", "rating": 1, "expected_grade": "", "created": "2011-12-15T18:44:00Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC122", "review": "He's a good professor and will take every single question you have. His jokes are hilarious the first few days, but then he starts to recycle and it gets old and awkward fast. Which is fine because he really does break down the material into manageable pieces for someone like me who has never done a bit of programming in my life.\n\r\nThere are quizzes but he tells you when they are. He threatens pop-quizzes sometimes because a few weeks in no one listens to him anymore because he moves on to miscellaneous and useless topics after JavaScript, but he never pulled it. \n\r\nMake sure to ask him questions in class though because once that clock strikes 1:50 (or whenever the class ends), he is outta there. Won't answer your questions and isn't helpful in office hours. Go to the TA's for that, and that's what he tells you. \n\r\nI'm taking this as a programming requirement for my math major so if you need one and want to do minimal work, take this course with Nelson.", "rating": 3, "expected_grade": "A", "created": "2011-10-11T20:36:00Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC122", "review": "This is by far the worst class at any level of education I have ever taken in my life. The syllabus did not describe the guidelines in the class at all. It just listed that there would be projects at some time during the semester but students were not informed of when projects were due until they were assigned. The professor also assigned a major assignment each week about halfway through the semester. I never had a break from this class. I was always either working on a project or studying for a test or quiz. I understand that there will be assignments, but I never had more work in any class of college so far and I have taken some 400-level classes.\n\r\nWhen I had questions about some of the assignments, I would go to both the professor and the TA's office hours. However, once I was there, I received no help. I was told to look over the powerpoint slides again and then turned away. My questions were not answered at all.\n\r\nThe lectures for this class were incredibly boring. The teaching style was horrible. At the beginning of the semester, Nelson said he did not care what students did during his class. Yet throughout the semester, he constantly called out students for talking, texting or typing on their computer. His lecture style was not engaging at all. It was so hard to focus and he did not gear the information at all to people who are not great with computers like myself. Whenever students asked questions, his answers were not helpful at all. \n\r\nWorst class ever. Do not take this if you are not great with computers and are not a computer science major.", "rating": 1, "expected_grade": "", "created": "2011-05-11T22:12:00Z"}, {"professor": "Jandelyn Plane", "course": "CMSC122", "review": "She is very nice and tried very hard (saw her a couple times at office hours), but just didn't teach the stuff well. One problem is the class doesn't really have homework. She expects us to create situations that we would use the code. In a normal comp. sci class that could fly, but this is an intro class! Anyway the material wasn't that hard, but I had to teach myself everything, which made it harder. A+ for my TA though (I don't know if shell be there next semester)", "rating": 3, "expected_grade": "A", "created": "2013-12-27T14:18:00Z"}, {"professor": "Jandelyn Plane", "course": "CMSC122", "review": "The class itself is not hard. Unlike what the person below me had said, I had no problems when it came to midterms (92.2% avg), projects (99% avg), or the labs that I had done at home with very little difficulty. I have previous programming experience in MATLAB from PHYS165 so most of aspects of the class were already familiar to me and I had no difficulty adapting to slightly different terms and methods. If you know MATLAB, you should be fine.\r\nHowever, you should be aware of the fact that many of the students with 0 experience had a very hard time. Some did not do well on exams, needed help on projects, and were continually relying on the TAs to dig them out of holes.\r\nWith that said, Plane is completely unresponsive to student concerns. In one case, i had an issue that I had contacted her about. She replied very promptly and I thought we had resolved it, but she took no action. So I contacted her again. And again. And again. No reply, no action taken. Because of her lack of activity and willingness to help, I'll be getting an entire letter grade lower because the issue at hand was worth about 8% of the total point breakdown. If this doesn't convince you that she doesn't care about your concerns, I don't know what else to tell you.\r\nIf you have a definite need to take this class with Plane, I suppose you don't have a choice... However, if you get another professor, you're probably in better hands.", "rating": 2, "expected_grade": "B+", "created": "2013-12-17T02:06:00Z"}, {"professor": "Jandelyn Plane", "course": "CMSC122", "review": "I am currently taking this course with Plane, and I would like to say that she is a very kind woman and really does want to see her students succeed, however wanting to help them succeed and actually doing it are two different things. You will struggle in this course if you have no prior Computer Science experience, which is why I took the class. As others have said before, in her  other computer science courses her lectures are so basic that when it comes time for quizzes and tests you have no idea what to do. Not to mention she only gives 10 minutes to do these quizzes which are too complicated for a class at this level. The tests were equally as difficult and on more than one occasion almost the entire class did not finish on time.\n\r\nAs soon as you get to JavaScript you better hope that you don't fall behind or else your grade will be ruined. Don't expect your TAs to help you either because they don't speak English.\n\r\nAs for projects they are also extraordinarily complicated for what you learn in the class. There is no way you can do these without help and I recommend starting them as soon as they are assigned. There are weekly \"In class labs\" that are supposed to help you do these projects and understand the material better, but after the first week of class she leaves you to do them on your own with no help.\n\r\nShe is a very nice woman but do not take this class if you want an elective and are new to Computer Science, you will most certainly regret it. You can learn about HTML, CSS, and JavaScript on your own for free without being so brutally penalized.", "rating": 2, "expected_grade": "C", "created": "2013-04-11T09:53:00Z"}, {"professor": "Shriraj Gandhi", "course": "CMSC122", "review": "Super, super, super, super helpful. Works around the clock to answer questions on Piazza, holds 5 hours of extra office hours near project deadlines, writes practice exams and holds review sessions. Lifesaver!", "rating": 5, "expected_grade": "", "created": "2018-12-11T21:06:08Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC122", "review": "Terrible teacher. not engaging at all and regurgitates the slides. this was an intro class yet our exam averages were in the 50% range. do not take this unless you absolutely have to", "rating": 1, "expected_grade": "", "created": "2019-12-10T19:06:32Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC122", "review": "His lectures are fine, but can be unbearably slow and monotone. Tests and quizzes were OK as long as you kept up with your lectures. He didn't really interact with students much, but the class was fully online so I can't say that I expected anything different. ", "rating": 4, "expected_grade": "B+", "created": "2020-12-21T19:04:56Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC122", "review": "Lectures are on the boring side but the course was run will completely remote. The exams were mental difficulty because they were take home. The three midterms were supposed to take 1 hour but they took me 3-5 hours.", "rating": 4, "expected_grade": "A+", "created": "2021-01-11T22:21:59Z"}, {"professor": "Ilchul Yoon", "course": "CMSC122", "review": "Yoon definitely knows what he's talking about, and he goes into the small details about programming. But his exams and quizzes are extremely difficult, and he didn't give us a lot of time for the final project. The only thing that's a saving grace in this class is that his curves are insane, I went up two letter grades from my original percentage ", "rating": 3, "expected_grade": "B", "created": "2021-02-06T15:58:14Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "The best and most understanding professor ever. Best teacher and class I have taken.", "rating": 5, "expected_grade": "A", "created": "2021-04-06T03:38:19Z"}, {"professor": "Pedram Sadeghian", "course": "CMSC122", "review": "His lectures can be a bit dry, and it's a little bit of a struggle to pay attention sometimes, but that's totally not his fault. He's a really informative lecturer and all the examples he does in class are great for helping to illustrate the concepts. The projects are pretty fun, and he gives plenty of time for you to work on them. The quizzes and tests are always on exactly what he says they will be -- no surprises there. If you study (do the worksheets he posts!) you'll be fine. The TAs were great, and Pedram says he's always pretty picky about who he lets TA his courses, so I trust that it would be the same in other semesters. This was the first coding class I've ever taken and it was my favorite this semester. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-06T02:06:52Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "Sometimes I cannot believe Professor Manly is even real. She is one of the kindest, sweetest people I have ever met. Her passion for teaching and her love for her students are clearly demonstrated through her continued preparation for class, challenging but reasonable workload, among many other things. If you're new to programming, this is the professor you'll want to have. She will get you interested in computer science and keep you excited to show up to class. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-18T22:01:52Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "Great professor with a genuine love/understanding for teaching and her students. If you are new to programming like I was she is the teacher for you. Her class is moderately challenging but she gives many chances to turn in late work for full credit and will heavily curve tests if needed. Overall great class and teacher.", "rating": 5, "expected_grade": "A+", "created": "2021-12-20T02:59:36Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "Great professor. Good class if you're new to programming. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-20T23:45:01Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "Great professor, really wants to see student achieve.", "rating": 5, "expected_grade": "A+", "created": "2022-10-26T14:24:15.799701Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "I start my emails off with \"hey girl hey\" and end them with \"period\". She complimented them. Sweetheart, 5 star.", "rating": 5, "expected_grade": "A-", "created": "2022-12-04T01:15:16.949901Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "Genuinely such a nice person really loves to teach. Not only is this class pretty easy but its also enjoyable. She and her TAs grade pretty easily and curved the only exam we had all semester. Final is a project that you work on all semester. She posts recordings of her classes and is always willing to help over email and office hours. Takes work super late, makes it really really hard to do poorly in this class everyone should get an A if you give the minimum effort.", "rating": 5, "expected_grade": "A+", "created": "2022-12-16T21:44:06.334061Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "Amazing professor, she's one of the nicest people I've ever met. She's very lenient with grading, and especially in this course you're not expected to have any background knowledge. Pacing is perfect and she's very receptive to questions, she responds to emails relatively quickly, and she really just wants to see everyone succeed. Very lenient with deadlines, I turned in some major assignments due in November by the end of the semester and she still graded it with only a 10% deduction. I had prior programming knowledge, but my friends in this class were completely new to it and still succeeded. If you have the chance to take this professor, no matter the class, take her. She is amazing.", "rating": 5, "expected_grade": "A", "created": "2023-01-16T10:55:13.464411Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "Honestly a great and lovely professor. She really does want to see the students succeed in her class and provides a 48-hour grace period or more if you email her. She explains as much as possible, especially when a student does not understand. The course itself could be challenging, especially if you do not have experience, but it is not impossible. Attend office hours/TA hours if you need extra help because they definitely help. Her assignments typically consist of small projects, knowledge checks, and one final project (you begin working on it early in the semester). I had no knowledge of comp. science at all before this class, but if you put in the effort you can get a good grade. Overall a great/fun class with a very chill professor.", "rating": 5, "expected_grade": "A", "created": "2023-02-01T16:49:32.045796Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "Professor Manly is such a nice teacher and is always willing to help. She records each of her lectures so they are easy to refer back to you. She also has loose deadlines and is lenient with extensions.", "rating": 5, "expected_grade": "A", "created": "2023-05-01T02:57:32.503709Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "Amazing professor, very helpful and kind to everyone and is great at keeping the lectures interesting. Class consisted of making your own websites which I found very fun.", "rating": 5, "expected_grade": "A", "created": "2023-05-04T20:17:24.875569Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "This woman is the epitome of what a professor should be. Jen is sweet and cares a lot about her students success. She is super accommodating and is very lenient with deadlines, all you have to do is ask. She let us do midterm corrections and even let us turn in one project for a project AND for the final. She is a literal godsend and wants to see you succeed, the course itself can be tricky if you fall behind, but Jen and her TAs are there to help.", "rating": 5, "expected_grade": "A", "created": "2023-05-15T04:47:42.890465Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "Honestly an amazing professor. Even with no prior coding knowledge the class makes it easy to succeed. Had midterms corrections which was a godsend. Even with the projects we had, you could make the website about whatever you wanted as long as it fits the requirements. TBH attendance is not needed if you understand the basics of the languages taught. The lectures are recorded even if u need to miss a class.", "rating": 5, "expected_grade": "A+", "created": "2023-06-21T06:06:20.499365Z"}, {"professor": "Fawzi Emad", "course": "CMSC122", "review": "I came into the class with prior coding knowledge so it was pretty easy. Fawzi is also an entertaining lecturer for the most part, so lectures are never boring. However, it is very difficult to miss a lecture as the content on the slides is barebones and Fawzi doesn't record. Fawzi also gave us reviews for the midterms which helped me brush up on skills. As long as you show up to lecture, this class is not bad.", "rating": 5, "expected_grade": "A", "created": "2023-11-23T20:56:22.555848Z"}, {"professor": "Jennifer Manly", "course": "CMSC122", "review": "This professor is who you want if you are just starting out with computer science. While I went into the class with some experience, it was clear she put in effort to help beginners learn just as efficiently as more experienced programmers. She is extremely nice and lenient, basically every assignment has a 2 day grace period where you can turn it in late with no penalty, she will grant you an extension without any reason, just send her an email. She also has corrections for her midterms. Overall, this is a CMSC122 was a very easy class with some fun learning opportunities. I absolutely recommend this professor.", "rating": 5, "expected_grade": "A", "created": "2023-12-09T18:11:49.817310Z"}], "department": "CMSC", "course_number": "122", "name": "CMSC122", "title": "Introduction to Computer Programming via the Web", "credits": 3, "description": "<b>Restriction:</b> Must not have completed any courses from CMSC131-499 course range; and must not be concurrently enrolled in CMSC131.\n<b>Credit only granted for:</b> CMSC106, or CMSC122.\nIntroduction to computer programming in the context of developing full featured dynamic web sites. Uses a problem solving approach to teach basics of program design and implementation using JavaScript; relates these skills to creation of dynamic web sites; then explores both the potential and limits of web-based information sources for use in research. Intended to help relate a student's major to these emerging technologies.", "is_recent": true, "geneds": null}