{"average_gpa": 3.6920784313725488, "professors": ["Nelson Padua-Perez", "Nelson Padua-Perez", "Nelson Padua-Perez", "Ilchul Yoon", "David Mount", "Nelson Padua-Perez", "Nelson Padua-Perez", "Nelson Padua-Perez"], "reviews": [{"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Nelson made this course easy, and he knew it. Absolute king. I went to lecture, but you could easily get away without ever watching lecture. A lot of stuff you can find on the internet or in the lecture examples. I was a bit worried about this course because I found his 131/132 courses to be tricky at times (especially with exams), but Nelson kept this course very straightforward and minimized exam difficulty. I have nothing bad to say about this course except for the fact that I wish it provided more depth on practical skills. We only got into Node towards the end. However, part of what made this course easy was the lack of depth so yk... But yeah, def a chill elective with a wonderful prof!", "rating": 5, "expected_grade": "A", "created": "2022-05-21T14:59:08Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "I am taking this course during the fall of 2022.\r\nNelson is the GOAT. Genuinely an amazing lecturer and an even better person. I wish he taught more upper-level classes so that I can take more classes with him.\r\nAlways keeps the class engaged by making funny jokes.\r\nAmazing teaching skills, he discusses a topic and then immediately shows an example.\r\nRecords lecture and immediately posts them. Attendance is not required unless it's exam day\r\nExams are extremely fair, nothing scary.\r\nProjects are not super challenging but do not wait till the last minute to implement them.\r\n\r\n\r\nAMAZING PROFESSOR MUST TAKE!!!!!!!!!!!!!!", "rating": 5, "expected_grade": "A+", "created": "2022-11-17T00:09:06.997413Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Epic class, Epic professor. Everything is set up so perfectly. Attendance is optional. All resources in one place, reasonable exams and projects. Take this course if it all fits your plans.", "rating": 5, "expected_grade": "A+", "created": "2022-12-12T02:30:02.268252Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Nice person and good professor overall.\r\nThis lectures were good and his projects were fair.\r\nHe understands how stressful college can be and trys to accommodate.\r\n\r\nOnly complate is that sometimes his exams material we have just learned and his review guides have a lot of topics which never actually get tested.", "rating": 4, "expected_grade": "A-", "created": "2022-12-20T14:19:43.727451Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Nelson is very understanding and lenient on due dates. Highly recommend the course. Low stress while still getting a background in web dev.\r\nDoesn't require coming to class and records all lectures", "rating": 5, "expected_grade": "A+", "created": "2022-12-27T18:31:44.181013Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "You need to take this class an elective with Nelson.\r\n\r\nNelson is the best. Period.\r\n\r\nThere are 3 tests and he gives you a test from the previous year that is basically the same thing, with different numbers.\r\n\r\nThe projects are all super easy and straight-forward, while also making you learn the topic. He also gave extensions for almost every project which was always a nice surpise.\r\n\r\nI wish we spend less time on html in the beginning and spend more time with React/Angular, but overall, great class and great teacher.", "rating": 5, "expected_grade": "A+", "created": "2023-01-24T18:27:11.583532Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Nelson is the chillest professor. He understands students needs and teaches important material. This class was very easy though. Projects are mostly changing things from the examples he has in class. The tests are a lot of info to memorize but I found that it wasn't graded so harshly.", "rating": 5, "expected_grade": "A", "created": "2023-02-06T15:26:06.609552Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Straightforward and funny professor who teaches you the fundamentals. Great for people getting into web development. I would recommend Nelson 100% for CMSC335", "rating": 5, "expected_grade": "A", "created": "2023-05-03T19:03:06.554873Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Nelson is great. He's really funny and understands student's struggles. 335 was a very useful class, and extremely manageable. Projects were basically just adapting what examples he did in class and there was no final exam, just a final project. Would definitely recommend.", "rating": 5, "expected_grade": "A", "created": "2023-05-15T17:44:42.146423Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Nelson is a very chill and funny professor. Lectures are recorded and projects and exams are very straightforward. The course covers express, node, and MongoDB, so you do learn some valuable information as well. Definitely recommend taking this course.", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T20:50:02.416350Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Great class! Good if you want an introduction to Web Development. Also good if you need an extra CS class that's not too difficult or time-consuming.\r\n Lectures are optional and if you skip them you'll be fine because the material is all online. The exams were easy and the projects were easy also and not too time-consuming.", "rating": 5, "expected_grade": "A", "created": "2023-11-28T22:05:37.427665Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "This class was phenomenal! Genuinely the most enjoyable CMSC course you can take at UMD. Projects are very manageable, exams are quite easy if you run through study guides, and you do not have to attend class at all! If you make an effort to soak in the course material, you will learn a ton of applicable skills and it's an easy resume booster, you learn a lot of tools in such a short time. (I suggest working on the final project alone or doing something grand so you can put it on your resume, I did a personal portfolio as my final)", "rating": 5, "expected_grade": "A", "created": "2023-12-15T03:05:57.229670Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "I took CMSC335: Introduction to Javascript with Nelson over Fall 2023 as a CS elective.\r\n\r\nYou MUST take this course. It is actually useful and sometimes even fun. Nelson is of course, classic Nelson.\r\n\r\nPlease also take this course alongside TWO other CS classes because the workload for this course is negligible. It is easily balanced on top of taking CMSC330 and CMSC351, for example.\r\n\r\nRecords lectures, nobody shows up to class, I personally never watched the lectures but I did fine.\r\n\r\nNelson was terrible for CMSC131 (kind of expected because he does not like the subject so much and finds it boring, something to \"just pay the bills\") but he was great for CMSC216 and CMSC335 (both of which he likes), I cannot recommend him enough.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T19:35:34.974107Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Super nice professor who's very fair in his exams and projects. He's also hilarious and makes lectures entertaining.", "rating": 5, "expected_grade": "A+", "created": "2023-12-28T16:50:17.541456Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Nelson is as awesome as always. Take this course over all the other electives. You actually learn a good amount and become competent in website building at the end.", "rating": 5, "expected_grade": "A+", "created": "2024-01-01T18:51:37.669846Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Nelson is a friendly professor for sure. He recorded lectures and posted slides so in-person lectures were optional. Midterms are fairly easy, and you can easy earn a A/B by practicing the old exams. The projects are easy as well. I'd definitely recommend it for students who want to learn web development.", "rating": 5, "expected_grade": "A", "created": "2024-01-11T14:39:09.245854Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "Nelson is simply incredible. He is very chill, kind, and funny, all while being a great instructor. His exams (very fair), projects, and lectures are the best!", "rating": 5, "expected_grade": "", "created": "2024-01-20T01:23:05.541087Z"}, {"professor": "Nelson Padua-Perez", "course": "CMSC335", "review": "The class is easy and Nelson is a great lecturer, he makes it very fun. However, you can't talk in class or he will call you out so if you want to do that then just watch his lecture videos.", "rating": 4, "expected_grade": "A+", "created": "2024-03-28T17:16:32.822862Z"}], "department": "CMSC", "course_number": "335", "name": "CMSC335", "title": "Web Application Development with JavaScript", "credits": 3, "description": "<b>Prerequisite:</b> Minimum grade of C- in CMSC216 and CMSC250.\n<b>Restriction:</b> Permission of CMNS-Computer Science Department.\n<b>Credit only granted for:</b> CMSC389N or CMSC335.\n<b>Formerly:</b> CMSC389N.\nProvides an introduction to modern ways of developing Web Applications/Services using JavaScript for both front-end and back-end. The course covers topics on fundamental JavaScript language constructs, server-side JavaScript, back-end data persistence, and client-side JavaScript to build Web Applications that interact with Web services and back-end databases.", "is_recent": true, "geneds": null}