{"average_gpa": 3.7536144578313255, "professors": ["Abhinav Shrivastava", "Abhinav Shrivastava", "Abhinav Shrivastava", "Abhinav Shrivastava"], "reviews": [{"professor": "Abhinav Shrivastava", "course": "CMSC472", "review": "This class is not too bad and quite interesting if you're at all invested in more complex machine learning techniques. I feel like the class's pacing could be better, as the beginning of the class is extremely slow, but the last few weeks are a bit rough with assignments, final project checkpoints, and the final exam all overlapping. The lectures can be dry and math theory heavy but if you're interested it's doable. And all the lectures are recorded and taught on zoom concurrently so you don't have to physically attend class.\r\n\r\nProfessor Shrivastava is very kind and understanding when it comes to grade concerns or other logistical concerns. Almost no one fails this class. That being said, the TAs (for my class at least) were very hard on grading and rarely granted regrade requests. But like I said, it doesn't really matter unless you're trying to get a 95 or more because the curve is high.\r\n\r\nOverall, I recommend this class for those who are interested in machine learning/deep learning. If you're not interested in the topics you *will* be bored out of your mind.", "rating": 4, "expected_grade": "B+", "created": "2023-05-01T14:23:31.464219Z"}, {"professor": "Abhinav Shrivastava", "course": "CMSC472", "review": "Really nice professor. Gives 7 late days to use for homework assignments throughout the semester, lets us use cheat sheets for midterm and final. Throughout the course, in each lecture he'll mention if a question or topic specifically will be on the final or midterm, so if you note them down throughout the semester you basically have half of the midterm/final questions right there. Knows a ton of stuff about deep learning since he's been a bit of a helping hand/pioneer in the field itself as well. Nice curve at the end of class. Because there's a group final project though, you probably want to take the class with a friend since you can choose groups. Good class", "rating": 4, "expected_grade": "A", "created": "2023-05-23T21:29:23.676704Z"}], "department": "CMSC", "course_number": "472", "name": "CMSC472", "title": "Introduction to Deep Learning", "credits": 3, "description": "<b>Prerequisite:</b> Minimum grade of C- or higher in CMSC330 and CMSC351; and 1 course with a minimum grade of C- or higher from (MATH240, MATH461).\n<b>Restriction:</b> Permission of the CMNS-Computer Science department. Or must be in the (Computer Science (Doctoral), Computer Science (Master's) program.\n<b>Credit only granted for:</b> CMSC498L or CMSC472.\n<b>Formerly:</b> CMSC498L.\nAn introduction to deep learning, a machine learning technique, as well as its applications to a variety of domains. Provides a broad overview of deep learning concepts including neural networks, convolutional neural networks, recurrent neural networks, generative models, and deep reinforcement learning, and an intuitive introduction to basics of machine learning such as simple models, learning paradigms, optimization, overfitting, importance of data, and training caveats.", "is_recent": true, "geneds": null}