{"average_gpa": 3.0791934332619557, "professors": ["Deepa Anagondahalli", "Anita Seate", "Nicholas Joyce", "Rong Ma", "David Payne", "Lin Zhu", "Meina Liu", "Ahnlee Jang", "Nick Joyce", "Savreen Hundal", "Xiaojing Wang", "Paula Nadler", "Ayodeji Dapherede-Otusanya", "Paula Nadler", "Ari Perez Montes", "Ayodeji Dapherede-Otusanya", "Erika Perez Montes", "Nick Joyce", "Umisha Kc", "Umisha Kc", "Umisha Kc", "Ari Perez Montes", "Umisha Kc", "Ayodeji Dapherede-Otusanya", "Ari Perez Montes", "Umisha Kc", "Margaret Williams", "Margaret Williams", "Umisha Kc", "Ayodeji Dapherede-Otusanya"], "reviews": [{"professor": "Anita Seate", "course": "COMM382", "review": "She is a very nice person and is interested in students lives and progress. She is a pretty good professor and knows what she's talking about. This class had pretty easy to understand material so it wasn't very difficult. It was graded off of a midterm, final, a handful of quizzes, and a group project. Overall she did a good job.", "rating": 4, "expected_grade": "A", "created": "2018-01-19T22:40:57Z"}, {"professor": "Ari Perez Montes", "course": "COMM382", "review": "Ari is a graduate student, so he is super chill and fun. This class was easy and we talked a lot about interesting topics. It's an easy A and interesting so take this course to get a Gen Ed out of the way. You have to do discussions and he assigns some interesting podcasts and movies to watch. There's no exam but there is a final project which Ari walks you through and is fun and laid back to do. I loved him, take him if u can.", "rating": 5, "expected_grade": "A+", "created": "2022-12-15T00:29:25.961066Z"}, {"professor": "Umisha Kc", "course": "COMM382", "review": "she is so cool! the fact that she is so young (mid/late 20s?) means she knows almost exactly the ins and outs of intercultural communication esp among young people. she is great at facilitating class conversation so everyone gets a chance to share their thoughts while also keeping it on topic. i hope she stays at UMD, i know she's in the doctoral program but pleeaasseeee Umisha if you're reading this stay b/c I would take like any class she teaches ever. this is also a super important class just in learning how to navigate the world and the different people/ideas you encounter. do the readings, show up, talk a little bit, and you're golden. she is just SO GREAT!!!!!!", "rating": 5, "expected_grade": "A", "created": "2023-12-07T14:49:53.190272Z"}, {"professor": "Umisha Kc", "course": "COMM382", "review": "Very chill professor that is knowledgeable and passionate about course content. The assigned readings for each class (especially the research papers) were kind of tedious so it's probably better to skim them otherwise it was a fun class. Also she wants people to speak more during class time for discussions so be prepared for that", "rating": 5, "expected_grade": "A", "created": "2024-01-24T16:34:04.995209Z"}], "department": "COMM", "course_number": "382", "name": "COMM382", "title": "Essentials of Intercultural Communication", "credits": 3, "description": "<b>Credit only granted for:</b> COMM382 or COMM482.\nIntroduction of major theories and concepts of intercultural communication; examination of processes that make up cultural differences; and use of intercultural communication competence skills.", "is_recent": true, "geneds": null}