{"average_gpa": 3.1614192903548224, "professors": ["Jade Olson", "Jessica Lu", "Yvonne Slosarski", "L Gordon", "Ann Mason", "William Howell", "Melissa Lucas", "Elizabeth Gardner", "Jaclyn Bruner", "Thomas McCloskey", "Rebecca Alt", "Devin Scott", "Meridith Styer", "Annie Nichols", "Tiffany Lewis", "Abigail Seiler", "Sean Luechtefeld", "Shannon Holland", "Janna Soeder", "Christopher Swift", "Randall Fowler", "Matthew Salzano", "Aya Farhat", "Alyson Farzad", "Aaron Swanlek", "Christopher Swift", "Christopher Swift", "Megu Itoh", "Megu Itoh", "Megu Itoh", "Christopher Swift", "Megu Itoh", "Alexandra Grimm", "Divine Aboagye", "Megu Itoh", "Divine Aboagye", "Alexandra Grimm", "Divine Aboagye", "Megu Itoh"], "reviews": [{"professor": "Jade Olson", "course": "COMM200", "review": "Overall this was a very good class. As long as you did the readings and attended class you should do fine. There are two speeches and one debate but they aren't that hard. It maybe takes a couple of hours each. There is one paper but it's not that bad. No midterm but there is a final. As long as you understand what is going on in class then it's not that bad. Jade is great! She is down to earth and chill. She really knows a lot about this and really gets that this isn't your first priority. She is more than willing to help or explain things in any way she can. Overall a good class to take if you need to take it but I wouldn't go out of my way to take it.", "rating": 3, "expected_grade": "", "created": "2012-05-18T12:16:00Z"}, {"professor": "Randall Fowler", "course": "COMM200", "review": "Actually a great professor.  He's encouraging to all of his students and goes out of his way to make sure that you're a better speaker at the end of the course.  Since the class is small, I would appreciate a little more feedback though.  He assigns A LOT of reading so be prepared for that.  Overall a strong recommendation, I'd take a class with him again!", "rating": 5, "expected_grade": "", "created": "2019-05-01T16:54:15Z"}, {"professor": "Christopher Swift", "course": "COMM200", "review": "Chill and effective instructor but he assigns a ton of work for COMM 200", "rating": 4, "expected_grade": "B+", "created": "2019-10-01T14:35:09Z"}, {"professor": "Randall Fowler", "course": "COMM200", "review": "Awesome professor. Super knowledgeable about writing, and he is very good at communicating what he wants on assignments. Although reading was assigned every week, it wasn't bad, like 20 pgs out of textbook per week. Looked forward to his class every week!", "rating": 5, "expected_grade": "A", "created": "2021-04-22T14:52:43Z"}, {"professor": "Megu Itoh", "course": "COMM200", "review": "Probably the nicest teacher I will meet, and it's only my first semester here. She's easy to talk to and the class isn't structured around quizzes, but instead just having open conversation about the readings or the topic at hand. She made me feel comfortable to talk in the classroom, and I don't like talking, which is why I was worried about taking a critical thinking communication course. As a full-time student with responsibilities outside of school I was worried about the workload. All my worries went away. Just take the time to read, or at least skim, the readings she has laid out in the syllabus before class. Be a part of the conversations every now and then because she will be accounting for how active you were with participation and group activities/projects. Speaking of which, we only had two solo speeches, the rest were group projects. There will be quite a few group activities within class, but it's good to talk in smaller groups with students to get an understanding between each other on the topic, it was fun. Ultimately, Professor Itoh is awesome!", "rating": 5, "expected_grade": "A-", "created": "2022-12-10T01:38:48.728866Z"}, {"professor": "Christopher Swift", "course": "COMM200", "review": "Interesting class, and he let us debate random topics a lot. Very tough grader though, he would take points off for really arbitrary things. Pretty lenient with late policy and there are a TON of assignments.", "rating": 3, "expected_grade": "A-", "created": "2022-12-13T22:03:39.420201Z"}, {"professor": "Christopher Swift", "course": "COMM200", "review": "such a tough grader and should have been an easy A but it wasn't. don't recommend if you just need a general credit OC credit, take 107 cuz 200 was too many assignments and so much work. Every class was a new speech or debate we had to do and it got annoying, plus the discussion boards  on readings we had to do.", "rating": 2, "expected_grade": "B", "created": "2022-12-19T01:40:38.420519Z"}, {"professor": "Megu Itoh", "course": "COMM200", "review": "Meg is a super sweet and fun professor, and I genuinely enjoyed the class and assignments! There were 3 unit projects (a speech, a podcast, and a presentation), a hot take assignment, and a final paper, all of which were graded fairly and strictly, but not easily. The class was a bit of work, but was adequate for a 200-level course, and there are quite a few group projects/activities. The bi-weekly readings were pretty long, but you could get the gist for discussions by skimming, so it wasn't too bad. Meg definitely knows how to engage well with her students and explains everything very thoroughly. I enjoyed how collaborative the class was overall and I loved Meg, but do keep in mind that COMM200 will be more difficult than COMM107.", "rating": 4, "expected_grade": "A-", "created": "2023-01-07T09:21:50.233138Z"}, {"professor": "Megu Itoh", "course": "COMM200", "review": "Professor Itoh, or Meg, was extremely kind and a warm welcome to my first semester at college. Her classroom setting was very casual, which was a great relief from the large lectures. My class became similar to a large group of friends and we all felt comfortable with one another. Despite the moderately heavy workload and occasional boring topic, I would say my overall experience in COMM200 was relatively positive. \r\nMy piece of advice, however, is to stay on top of your work and try not to fall behind, as it is easy to get lost. If you don't like group work, I strongly recommend you do NOT take this class, as a substantial amount of the course is centered around this. Otherwise, no harm in signing up!", "rating": 4, "expected_grade": "A", "created": "2023-03-09T16:57:30.551708Z"}, {"professor": "Megu Itoh", "course": "COMM200", "review": "Professor Itoh is one of the kindest, warmest, and compassionate professors I've ever had. She creates a very welcoming, calm class environment that everyone (even shy people like me) feel comfortable participating. Not to mention you get great practice with writing and group work in this class, but nothing is ever demanding. It is a fair, quality class and 10/10 recommend.", "rating": 5, "expected_grade": "A", "created": "2023-04-26T23:36:14.342074Z"}, {"professor": "Christopher Swift", "course": "COMM200", "review": "The coursework is fair, but the grading is harsh. He's a nice guy, but he really does makes you work for that grade. While his feedback can be useful, the amount of points taken off for small mistakes can be frustrating. If you do the small discussion posts and show up to class, it can really make up for any of the lost points. (Both are 10% of your grade each.) I'd only take this class if you're already comfortable with public speaking and want a challenge. If not, stick to COMM107.", "rating": 3, "expected_grade": "A", "created": "2023-05-07T19:36:07.202989Z"}, {"professor": "Megu Itoh", "course": "COMM200", "review": "Prof Meg is extremely kind and understanding. She would be willing to give extensions if necessary, but email her in advance because she is not great at responding. She loves to get to know her students on a personal level and truly cares about their well-being. She pretends to be a stickler at the beginning of the semester, but that is understandable because she is trying to assert herself. Read the readings before class and participate in class discussion even if it is to ask questions. I would advise taking notes during the class discussions as well because these readings are important for the unit tests. Nothing is too difficult but still put in the work because it will pay off for unit tests and overall grades.", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T14:33:04.363491Z"}, {"professor": "Megu Itoh", "course": "COMM200", "review": "This professor is quite literally one of the most amazing and nurturing educators I have had the pleasure of being taught by. We as a student body are mostly very used to accomodating to the professor's style and working to make sure they are happy, but with Professor Meg, she is so open minded and progressive to the point where she finds value and acceptance in each student's unique style. I never knew that this class would be my source of engagement, as it provided me a real open and accepting environment. I was never once afraid to raise my hand, as Professor Meg always makes us feel validated for every answer. Because of this lack of fear and confidence I developed, I naturally became a strong part of the classroom, as was everyone else in engagement. I have never seen a Professor so naturally display this level of charisma and passion to her students. It is just what we need. The workload is manageable, and not even boring or displeasing to do. She is also very understanding with extensions and deadlines, and shows kindness to every student. Definetely choose Professor Meg!", "rating": 5, "expected_grade": "A", "created": "2023-05-08T16:25:03.263630Z"}, {"professor": "Christopher Swift", "course": "COMM200", "review": "I took COMM200 instead of 107 because I thought the '200' would look better on my transcript. I regret doing that because this class is a lot of work for what it's worth. Homeworks are due Mondays, Wednesdays, and Fridays each week. Also, the major assignments are group projects so you'd better hope you get assigned good people because your grade quite literally depends on it. Like the other reviews say, Dr. Swift is a nice guy but a harsh grader for a gen ed course. Just take 107 with a different professor to get your OC gen ed out of the way.", "rating": 3, "expected_grade": "A", "created": "2023-05-12T17:03:56.498168Z"}, {"professor": "Alexandra Grimm", "course": "COMM200", "review": "She's a very sweet person and clearly cares about the subject of her class but I wouldn't recommend it. Just take 107, unless you NEED to take this. It was an annoying extra load of extremely long academic journals and group projects. The topic is unfortunately not interesting and it's easy to get lost in the readings she gives us. I also feel her grading criteria was a little vague at times. Unless you need this for your major just take COMM107.", "rating": 3, "expected_grade": "A", "created": "2023-12-15T23:37:24.946371Z"}, {"professor": "Megu Itoh", "course": "COMM200", "review": "Very chill professor and willing to explore ideas with the class. There's a lot of group projects with random people so that may affect you. She was kind of slow on grading even though there weren't that many assignments but if you put some effort into the class you should be fine (i.e. don't freeload on group projects). Her grading was kind of strict when it came to group presentations but she was very fair on the hot take speech. I think I did okay on that but I got a 50/50 and it seems like mostly everyone else did too.", "rating": 5, "expected_grade": "A", "created": "2024-01-24T16:49:51.950149Z"}, {"professor": "Divine Aboagye", "course": "COMM200", "review": "Divine is the nicest guy and is super understanding when it comes to any circumstances you have. Like the first comment here, I was able to connect with him since he was super approachable and was overall a cool dude who would share about his day. I had his class at 8:00am, which made it a little difficult for me to be entirely invested at times simply because I was bad at waking up that early, but I will say, every discussion he had us participate in were valuable and unique. I liked his approach to critical thinking because he not only made us practice it but also understand its importance. I also agree that he could improve with some experience, but I think if you took the time to at least skim the readings he requires, do the discussion posts, and thoughtfully engage in the in-class discussions, you will gain a lot from the class.", "rating": 5, "expected_grade": "A+", "created": "2024-03-11T04:06:47.481804Z"}], "department": "COMM", "course_number": "200", "name": "COMM200", "title": "Critical Thinking and Speaking", "credits": 3, "description": "<b>Credit only granted for:</b> COMM107, COMM200, ENES143, INAG110, JOUR130, OR THET285.\nTheory and practice of persuasive discourse analysis and composition. Research techniques, logical and rhetorical conceptions of argument, and technical principles for persuading in public venues.", "is_recent": true, "geneds": null}