{"average_gpa": 3.6714285714285713, "professors": ["David Tomblin", "Nicole Mogul", "Thomas Zeller", "Matthew Aruch", "Gregory Rulifson", "Logan Williams", "Matthew Aruch", "Kuan-hung Lo", "Matthew Aruch", "Matthew Aruch", "Thomas Zeller", "Justin Shapiro", "Kuan-hung Lo", "Kuan-hung Lo", "Justin Shapiro", "Roan Parrish", "Kuan-hung Lo"], "reviews": [{"professor": "Matthew Aruch", "course": "CPSS225", "review": "Best and most lenient professor ever. He is son funny and kind", "rating": 5, "expected_grade": "", "created": "2021-11-18T18:32:12Z"}, {"professor": "Justin Shapiro", "course": "CPSS225", "review": "Really great scholars instructor that connected the stem topics to social issues from a more 'istorian background. He is also super knowledgeable on historical issues that relate to technology development and is willing to learn about newer topics he doesn't know yet. He noticed what our class liked discussing and expanded on those. Justin also did a few lectures that were way way better than regular class lectures since there were no notes, it allowed for live Q&A, and was constantly engaging. Grades aren't an issue for this class, just make sure you show up on time.", "rating": 5, "expected_grade": "A", "created": "2023-06-06T02:27:54.089767Z"}, {"professor": "Kuan-hung Lo", "course": "CPSS225", "review": "Allow the accent, it will not interfere with the course whatsoever. The man is super chill and enjoys teaching this course, and is very caring about students' situations. Does his best to keep the class engaged and is very lenient with grading and work extensions if necessary.", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T06:07:52.433002Z"}], "department": "CPSS", "course_number": "225", "name": "CPSS225", "title": "College Park Scholars Capstone: Science, Technology, and Society", "credits": 3, "description": "<b>Prerequisite:</b> CPSS100.\n<b>Restriction:</b> Must be in the College Park Scholars Science, Technology & Society (CPSS) program.\n<b>Formerly:</b> CPSP227.\nExploration and understanding of ways science and technology shape and are shaped by society.", "is_recent": true, "geneds": null}