{"average_gpa": 3.9075471698113207, "professors": ["Nicole Mogul", "Nicole Mogul", "Nicole Mogul"], "reviews": [{"professor": "Nicole Mogul", "course": "CPSS220", "review": "These reviews make her seem like a terrible person but that is simply not the case. She genuinely cares about her students and is very nice/funny. She likes to bring people out of their comfort zone and super into mindfulness. She ran this class with a thing called the Grading Contract. Which essentially says, you will get an A if you make an attempt at every assignment. Very easy A class, in class she always does some fun or quirky activities, which is nice cause i feel like those tend to be very rare in college classes. Sometimes the assignments felt really dumb or like busy work but I honestly didn't need to spend too much time in the class cause i knew i was gonna get an A with the contract. She also does care about the content of the course. Overall not a bad course to fulfill the Practicum with.", "rating": 4, "expected_grade": "A", "created": "2021-12-24T21:27:52Z"}], "department": "CPSS", "course_number": "220", "name": "CPSS220", "title": "The Future of Science Communication", "credits": 3, "description": "<b>Restriction:</b> Must be in the College Park Scholars Science, Technology or Society program or have permission of the program.\nHow can scientists communicate their work effectively? The field of science communication ventures that the answer is not simply a matter of improving capacity (e.g., because people lack scientific information, scientists lack communication skills, or both). Rather, it calls for sustained collaboration and empathy between laypersons and experts. In this hands-on, experiential course, we use a model of cultural competency to put forth solutions to bridge the expert-lay divide. We investigate typical venues in which science is communicated (museums, YouTube videos, federal agency websites, and much much more) and study best practices for communication. Then we explore emerging venues that support sustained contact between so-called \"lay citizens\" and scientific or technical experts (dance/improv techniques, ethnographic methods and citizen science). Students learn to use cross-cultural perspectives as a basis to pilot and test ways of strengthening relationships and improving communication.", "is_recent": true, "geneds": null}