{"average_gpa": 3.897727272727273, "professors": ["David Tomblin", "David Tomblin", "Nicole Mogul", "David Tomblin", "Kuan-hung Lo", "David Tomblin", "David Tomblin"], "reviews": [{"professor": "David Tomblin", "course": "CPSS340", "review": "Dr. Tomblin is a great guy and is very understanding. He's also pretty lenient about grades. This course is very relaxed but does require a few expeditions/trips outside of class. If you're in Scholars and need DSSP, take this course.", "rating": 5, "expected_grade": "A", "created": "2023-01-03T18:25:09.231937Z"}, {"professor": "Nicole Mogul", "course": "CPSS340", "review": "If you are choosing a scholars program, do not choose STS. Nicole is a very ~annoying~ professor. Most of the assignments and activities you do are not at all related to the course, and feel like things you would do in elementary school. With that being said though, the work is very easy, and for 340 she uses contract grading, so basically as long as you turn in the work and go to class you will get an A. BUT, you will have to do her pointless improv and skit activities so do with that what you will.", "rating": 2, "expected_grade": "A", "created": "2023-04-17T20:43:42.437563Z"}], "department": "CPSS", "course_number": "340", "name": "CPSS340", "title": "College Park Scholars: Infrastructure and Society", "credits": 3, "description": "One of the most important, and underappreciated, aspects of our society is its infrastructure (roads, buildings, communication systems, water delivery systems, sanitation systems, energy systems, etc.). We often take for granted the services infrastructure bring us. As a consequence, the United States, which at one time was a world leader in creating infrastructure, is experiencing an infrastructure crisis. Furthermore, not everyone experiences this issue equally. This course is designed to identify the root causes of the crisis. You will explore emerging social, political, legal, cultural, and social justice issues associated with the building and maintenance of infrastructure from the perspective of Science and Technology Studies (STS) and engineers. You will work with a volunteer corps of professional engineers from a variety of disciplines on a service-learning project designed to assess the safety and vitality of infrastructure.", "is_recent": true, "geneds": null}