{"average_gpa": 3.492328767123287, "professors": ["Gabriella Estevez", "Justin Hillman", "Kathryn Kline", "Kathryn Sullivan", "Kelsey McCurdy", "Leyla Babaturk", "Ruogu Wang", "Samia Lalani", "Alexandria Travis", "Bhanu Moturu", "Priya Bansal", "Samantha Sommer", "Jocelyn Yao", "Kristin Meyering", "Shanyun Zheng", "Xinyi Zhang", "Shereen Ashai", "Shannon Martin", "Emily Cygrymus", "Mira An", "Amber Pasha", "Stephanie Cerrato", "Diksha Bali", "Shihong Lin", "Hailey Fleece", "Eunmyoung Lee", "Amber Pasha", "Diksha Bali", "Eunmyoung Lee", "Hailey Fleece", "Shihong Lin", "Stephanie Cerrato", "Ami Patel", "Anjali Sheth", "Daniel Moore", "Ilcia Hernandez", "Manuel Teran Hernandez", "Rabia Brown", "Ami Patel", "Anjali Sheth", "Daniel Moore", "Ilcia Hernandez", "Manuel Teran Hernandez", "Rabia Brown", "Ami Patel", "Anjali Sheth", "Daniel Moore", "Ilcia Hernandez", "Manuel Teran Hernandez", "Rabia Brown", "Brianna Ladd", "Bridget Moran", "Isabella Stoto", "Laura Kelly", "Romy Stancofski", "Brianna Ladd", "Bridget Moran", "Isabella Stoto", "Laura Kelly", "Romy Stancofski", "Brianna Ladd", "Bridget Moran", "Isabella Stoto", "Laura Kelly", "Romy Stancofski", "Roxanne Odiorne"], "reviews": [{"professor": "Alexandria Travis", "course": "EDCP210", "review": "Amazing professor ", "rating": 5, "expected_grade": "A", "created": "2019-12-05T19:40:21Z"}, {"professor": "Kristin Meyering", "course": "EDCP210", "review": "Graded WAYYY to harshly. It's a cool class but a lot of work, and turned in a well written paper and got a 50% on it ... the same grade for someone who didn't turn in anything at all", "rating": 3, "expected_grade": "C+", "created": "2020-05-06T02:06:37Z"}, {"professor": "Samantha Sommer", "course": "EDCP210", "review": "Sam is a great professor! She always found a way to engage the class and make it interesting. She was always nice to talk to before and after class and was easy to reach out to. Highly suggest taking EDCP210 with Sam. ", "rating": 5, "expected_grade": "A", "created": "2020-05-12T18:46:23Z"}, {"professor": "Alexandria Travis", "course": "EDCP210", "review": "Alex is awesome! She's so kinda and makes learning so much fun. I really enjoyed her lectures and the in-class activities we did. If you're looking for an easy course that interests you, I'd consider taking this course!", "rating": 5, "expected_grade": "A", "created": "2020-08-09T19:37:36Z"}, {"professor": "Hailey Fleece", "course": "EDCP210", "review": "This was my favorite class by far! Professor Fleece was super accommodating about deadlines and everything. All quizzes were untimed and online (like whaaat). There are a few long papers, but they are all very doable and you have lots of time to do them. All around fun class with a great teacher. Notice I used the word teacher, this is because online most professors, Hailey actually helps you learn the material. Take this class, enjoy your semester, and get a good grade.", "rating": 5, "expected_grade": "A+", "created": "2021-12-16T16:34:17Z"}, {"professor": "Shihong Lin", "course": "EDCP210", "review": "Very nice and accommodating professor. This is a pretty easy class in terms of actually course content. There are a few papers, but they're not bad at all. This is a very useful class and it's been quite eye opening to me especially in the wake of the pandemic with mental health going for whirlwind. Highly recommend. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-23T04:01:58Z"}, {"professor": "Diksha Bali", "course": "EDCP210", "review": "amazing", "rating": 5, "expected_grade": "A+", "created": "2022-01-19T19:14:42Z"}, {"professor": "Eunmyoung Lee", "course": "EDCP210", "review": "She is soooo understanding and nice. If you need an extension on anything, just ask in advance and she's pretty nice about it. The class itself is soooooo fun and she makes it a very safe environment. I highly recommend this class and professor.\r\n\r\nSpecifically for the class, it's about 3 short online quizzes along with in class participation (which is easy) and a few easy papers. ", "rating": 5, "expected_grade": "", "created": "2022-05-11T19:36:24Z"}, {"professor": "Anjali Sheth", "course": "EDCP210", "review": "Anjali is one of the most caring instructors I've ever had. She is extremely welcoming and accommodating. The coursework is light and fosters genuine connections within the small class.", "rating": 5, "expected_grade": "A", "created": "2022-12-06T18:02:16.506533Z"}, {"professor": "Anjali Sheth", "course": "EDCP210", "review": "Such a great class. Highly recommend this professor. This was her first time teaching, and it was great. There are 3 online quizzes 20 min each, 2 papers, and 2 group projects. Very doable amount of work, and the class is very engaging. Cannot recommend this class enough. This class is also small (20 people) and a great way to meet new people!", "rating": 5, "expected_grade": "A", "created": "2022-12-06T18:44:50.907144Z"}, {"professor": "Daniel Moore", "course": "EDCP210", "review": "This class was okay. I enjoyed the \"mock\" helping sessions but found the class boring. Professor Moore is a decent lecturer who promptly posts class slides on Canvas. I do think he made this class harder than it needed to be. For example, he made the (open-note, online) quizzes extremely difficult which negatively impacted our grades. He was a little passive-aggressive at times, too.", "rating": 3, "expected_grade": "A", "created": "2023-01-05T23:45:20.009759Z"}, {"professor": "Rabia Brown", "course": "EDCP210", "review": "Super easy class. Didn’t really pay attention and still got an A+. Quite a few papers and presentations, but she is super understanding and grades easy enough.", "rating": 4, "expected_grade": "A+", "created": "2023-01-22T21:01:29.731434Z"}, {"professor": "Ami Patel", "course": "EDCP210", "review": "overall\r\nthis is one the simplest classes I've ever taken. ms. patel is such a sweet person that genuinely cares for every student. her lectures are easy to follow & designed nicely. you learn a bunch of \"helping skills\" that you can actually apply in your life which is cool. there are a couple of papers to write in the class, which are very easy and mostly opinionated/analyzing simple interviews that you have to do. the helping sessions are where the scholarship in practice comes in, and they're really easy too. there are a couple scheduled quizzes too, but they are easy.\r\n\r\nrecommendations/heads up:\r\nparticipation is a grade bc there's no discussion sections so make sure you show up to class and raise your hand here & there, you don't need to read the book because she explains every chapter in lecture", "rating": 5, "expected_grade": "A+", "created": "2023-05-10T16:30:00.421942Z"}, {"professor": "Anjali Sheth", "course": "EDCP210", "review": "Professor sheth is one of the most kindest professor I had, She is very understanding, accommodating and very easy to talk to if you have concerns. The course work was light and the class is small. I really recommend this class.", "rating": 5, "expected_grade": "A", "created": "2023-05-11T03:27:41.184918Z"}, {"professor": "Manuel Teran Hernandez", "course": "EDCP210", "review": "Harsh grader, attendance and participation is mandatory. Other than that, a nice guy. If your looking for a gen ed, don't take this class.", "rating": 2, "expected_grade": "", "created": "2023-05-11T18:40:42.695226Z"}, {"professor": "Rabia Brown", "course": "EDCP210", "review": "She is a great professor! There were about 3 long papers, two presentations, and short online quizzes. She is a fair grader and is very understanding if you need extensions. I highly recommend taking EDCP210 with her!", "rating": 5, "expected_grade": "A+", "created": "2023-05-22T19:12:24.995412Z"}, {"professor": "Daniel Moore", "course": "EDCP210", "review": "Easy class. Based on participation and engagement. Readings was a lot but you do not need to keep up with them to pass with an A.         All essays are graded fairly but please know how to do APA format correctly. All quiz or test are open note, but do know that questions will be more specific according to the slides and readings. The other comment mentioned it was extremely difficult which is not true. \r\na). They either was not coming to class b). Not paying attention c). Not reading or simply skimping over the readings d). Not taking notes\r\ne). Or all the above. \r\n\r\nI took both of his classes \"EDCP210\" and \"EDCP 230\" and received an A with a decent amount of effort. \r\n\r\nSomeone described him as \"passive aggressive\" but that it is not true. He is very direct and will challenge your ideology and perspective through questions. He is respectful and does not rush to give a response to you in the moment. \r\nPlease understand he is a graduate student studying counseling; he is more equipped in having conversations on the topic of mental health. \r\nDo not be offended if he does not agree; he will not say that in a blunt manner, but he will simply ask you to elaborate your point(s) and may sometimes reiterate what you said to confirm the point you are making. \r\nWhich is ironic because he's teaching you that through the three stage model of counseling in EDCP210 which is: \r\n1). Exploration 2). Insight 3). Action. \r\n\r\nThe class is not \"boring\" (to me) depending on your classmates engagement. \r\nSome individuals are not comfortable expressing their feelings or experiences which makes it difficult to create an environment for everyone to particpate. \r\nI am not saying give us your life story BUT if no one participates in discussions then how can it be \"fun\".\r\n\r\nIn EDCP210 it is more engaging because you will be doing helping sessions with partners and group projects. \r\n\r\nEDCP230 is more focused on you and the diaries you do bi-weekly. \r\nYou learn more about happiness and what type of happiness you lean more towards (Hedonism v. Eudemonic). \r\n\r\nMr. Daniel is a good instructor. He has granted extensions for the whole class during mid terms.\r\nThere were times where I deserved to be graded hard for missing content in essays or projects and I still received an A or B at minimum. \r\nHe provides extra credit opportunities throughout the course.\r\nHe cares about his students well-being. It is an easy Gen-Ed course.", "rating": 5, "expected_grade": "A", "created": "2024-01-11T04:59:33.679111Z"}, {"professor": "Amber Pasha", "course": "EDCP210", "review": "Ditto to what the other person said", "rating": 5, "expected_grade": "A", "created": "2024-02-01T16:51:51.098137Z"}, {"professor": "Bridget Moran", "course": "EDCP210", "review": "Bridget is the most caring professor and such a wonderful person. The class does not have too much homework, just readings to prepare for in class discussions and 3 papers throughout the semester. I definitely recommend taking it with Bridget!", "rating": 5, "expected_grade": "A+", "created": "2024-02-28T20:21:38.821515Z"}], "department": "EDCP", "course_number": "210", "name": "EDCP210", "title": "Peer Counseling Skills and Mental Health Advocacy", "credits": 3, "description": "<b>Restriction:</b> Must not have completed EDCP310; and must not have completed PSYC433.\n<b>Credit only granted for:</b> EDCP210, EDCP310, or PSYC433.\nIntroduction to core helping skills in peer counseling settings and three predominant theoretical approaches used in the counseling field (humanistic, psychodynamic, cognitive-behavioral).  The course also explores mental health stigma and advocacy.  Students will build an understanding of the practical application of underlying principles and theory in counseling and the helping professions, while exploring their own, and societal, biases, assumptions, and attitudes toward mental health.", "is_recent": true, "geneds": null}