{"average_gpa": 3.2890489913544676, "professors": ["Elisa Klein", "Renee Garraway", "Elisa Klein", "Elisa Klein", "Lisa Davis", "Lisa Davis", "Jennifer Smallwood-Holmes", "Lisa Davis", "Jennifer Smallwood-Holmes", "Jennifer Smallwood-Holmes"], "reviews": [{"professor": "Natasha Cabrera", "course": "EDHD210", "review": "Professor Cabrera has been hands down one of my least favorite professors.  She is EXTREMELY scatter brained and it is impossible to follow her in class.  Not to mention she is extremely boring and sitting through a three hour class with her is pure torture.  She doesn't specify criteria for papers and is horrible and grading them in a timely matter and is a very hard grader.  She's very unresponsive to student concerns and I can honestly say that I learned nothing from her.  Avoid her if you can.", "rating": 1, "expected_grade": "B+", "created": "2011-12-17T02:55:00Z"}, {"professor": "Melanie Killen", "course": "EDHD210", "review": "Dr. Killen is awesome!!", "rating": 5, "expected_grade": "", "created": "2009-12-13T23:24:00Z"}, {"professor": "Elisa Klein", "course": "EDHD210", "review": "Dr. Klein is great!  She is so sweet and kind and wants all of her students do well!  This class met once a week for a 2:45min session which was kind of a lot but she let us a take breaks and we usually got out early!  The grades are based off of a few \"essay\" type assignments but they are all straightforward and easy.  The content is interesting and she tells a bunch fo stories that really helped me understand what we were learning better!  Great teacher and great class, highly recommend!", "rating": 5, "expected_grade": "A+", "created": "2022-04-14T19:52:24Z"}, {"professor": "Lisa Davis", "course": "EDHD210", "review": "Professor Davis is an amazing instructor. She is kind, caring, encouraging, and wants you to succeed. She is laid back and does not enforce strict rules. Her class includes a lot of discussion and dialogue where she shares her experiences as an educator. I learned a lot from this class and received a great grade because I applied myself and put in the work. You won’t regret taking her class.", "rating": 5, "expected_grade": "A+", "created": "2023-01-23T16:03:10.602917Z"}], "department": "EDHD", "course_number": "210", "name": "EDHD210", "title": "Foundations of Early Childhood Education", "credits": 3, "description": "<b>Restriction:</b> Permission of EDUC-Human Development and Quantitative Methodology department.\nStudents explore historical and current research in early childhood education, primary models of curriculum and pedagogy in the field, and the relationship between critical aspects of young children's development and the creation of inclusive learning opportunities for all children, including children at risk. The concept of developmentally appropriate practice and its application across different developmental levels and early childhood classrooms will be introduced and connected with discussion in EDHD220 and EDSP211. Students examine issues in developing and implementing high quality early childhood education experiences for young children with and without disabilities, including the influence of family, culture, and community, the needs of children at risk (e.g., poverty, immigrant status, English Language Learners), and the role of assessment in early learning.", "is_recent": true, "geneds": null}