{"average_gpa": 3.670473186119873, "professors": ["Carolyn Fink", "Miji Kim", "Sarah Mallory", "Patricia Ulf", "Stacey Williams", "Joan Lieber", "Yewon Lee", "Agnesanne Danehey", "Jennifer Kline", "Kimberly Palombo", "Carmen Constantinescu", "Monica Simonsen", "Deirdre Barnwell", "Leslie Page-Voth", "Deanna Collins", "Dawn Martin", "Jerae Kelly", "Cameron Butler", "Katryna Andrusik", "Briella Chen", "Jennifer McCatharn", "Tasha Harris", "Jason Chow", "Tori Page-Voth", "Amanda Schwartz", "Seyma Intepe Tingir", "Alicia Woolf", "Elizabeth Montanaro", "Jason Chow", "Jennifer Amilivia", "Katryna Andrusik", "Seyma Intepe Tingir", "Katryna Andrusik", "Tori Page-Voth", "Tori Page-Voth", "Tori Page-Voth", "Jennifer Amilivia", "Katryna Andrusik", "Cherise Hunter", "Cherise Hunter"], "reviews": [{"professor": "Carolyn Fink", "course": "EDSP210", "review": "Dr. Fink was probably one of the nicest professors that I've ever had.  She honestly cared about all of the students and there wasn't too much work.  This class is also really easy.  Even though she says that she grades as a group for the final group project, one girl in my group never did anything and she got a lower grade so don't worry about that (unless you're that kind of person).  ", "rating": 5, "expected_grade": "A", "created": "2012-01-25T18:32:00Z"}, {"professor": "Carolyn Fink", "course": "EDSP210", "review": "This class is pretty easy and does not require a lot of time or effort. There are chapter preparation assignments (you need the book), a book/movie review, two tests, two quizzes, and a presentation. There are also many guest speakers. Dr Fink was very laid back and accommodating, and she really does care about what she is teaching. Warning: she will make you feel bad if you use any words like \"retard\", \"handicapped\", or \"disabled person\". Before even starting the class, you should know that she requires person-first descriptions of people (ex: a child with autism, NOT an autistic child). and NEVER use the R word. I'll save you the lecture :) ", "rating": 5, "expected_grade": "A", "created": "2011-05-25T00:34:00Z"}, {"professor": "Jerae Kelly", "course": "EDSP210", "review": "I took EDSP210 with her online over the summer. The course was well-organized, all of the instructions were clear, and she was quick to respond to messages. Not a difficult class at all.  ", "rating": 5, "expected_grade": "A", "created": "2019-11-18T16:52:18Z"}, {"professor": "Cameron Butler", "course": "EDSP210", "review": "Cam is easily one of the best teachers I've ever had. He actually cares about you as a student and that you're learning. He's really funny and makes the content engaging. He recognizes that we have a lot to do and adjusts assignments to make life easier for us.  Cam is so understanding. He also almost always ends class 15 minutes early if not more. I would take any class he taught. ", "rating": 5, "expected_grade": "A", "created": "2019-12-05T17:46:19Z"}, {"professor": "Briella Chen", "course": "EDSP210", "review": "Professor Chen is awesome!  She is so kind and understanding of all of her students, and is very accommodating and helpful.  The class material was pretty straightforward and easy, and most of it is common sense.  I took this class as a general/special education major, but there were non-major students in my class and it was a great time!  Homework was an assignment a week and we only had Zoom meeting every two weeks in a discussion-based format.  I took this during fall 2020 semester so in person would probably be different.  Great class, great professor, easy A, highly recommend!!", "rating": 5, "expected_grade": "A", "created": "2022-04-14T19:32:04Z"}, {"professor": "Jennifer Amilivia", "course": "EDSP210", "review": "condescending, treats her students like they're in special ed, which is pretty ironic.", "rating": 3, "expected_grade": "A", "created": "2022-12-02T21:43:56.476305Z"}, {"professor": "Katryna Andrusik", "course": "EDSP210", "review": "If you need a class to satisfy the DVUP gen-ed, take this! She is an amazing teacher and keeps the class engaged really well. She is really understanding and reasonable when it comes to workload and quizzes. Definitely more project based rather than midterms and finals.", "rating": 5, "expected_grade": "A", "created": "2023-12-04T19:31:39.936369Z"}, {"professor": "Katryna Andrusik", "course": "EDSP210", "review": "Don't take it. Like just don't take it. Its a dumb course. She made us make lesson plans, which seemed pointless. everything beside viewing assignment and reading response is absolute shit. STAY AWAY. Teacher is supernice. she is super strict. if you miss an assignment it would probably drop your grade by at least 4-5%. killing you in the end. there are no make ups or extra credit. If you miss classes, she would tend to give u a worse score no matter what. it does depend on her mood ngl.", "rating": 1, "expected_grade": "B-", "created": "2023-12-23T18:42:53.778891Z"}], "department": "EDSP", "course_number": "210", "name": "EDSP210", "title": "Introduction to Special Education", "credits": 3, "description": "<b>Restriction:</b> Sophomore standing or lower.\n<b>Credit only granted for:</b> EDSP210 or EDSP470.\nCharacteristics and needs of individuals receiving special education and related services. Current issues and practices in special education.", "is_recent": true, "geneds": null}