{"average_gpa": 3.5924980665119888, "professors": ["Leslie Page-Voth", "Philip Burke", "Susan De La Paz", "Candice Doyle", "Karen Williams", "Heather Allcock", "Agnesanne Danehey", "Andrew Egel", "Christy Kelly", "Deirdre Barnwell", "Carolyn Fink", "Sarah Mallory", "Patricia Ulf", "Stacey Williams", "Yewon Lee", "Deanna Collins", "Dawn Martin", "Jerae Kelly", "Cameron Butler", "Katryna Andrusik", "Jennifer McCatharn", "Tasha Harris", "Jason Chow", "Tori Page-Voth", "Seyma Intepe Tingir", "Alicia Woolf", "Jason Chow", "Seyma Intepe Tingir", "Tasha Harris", "Melissa Defayette", "Seyma Intepe Tingir", "Tasha Harris", "Yang Fu", "Tori Page-Voth", "Tori Page-Voth", "Tori Page-Voth", "Jason Chow", "Yang Fu", "Sara Pepkin Dataram", "Stuti Gupta", "Tvisha Vyas", "Jennifer McCatharn", "Tvisha Vyas", "Yang Fu", "Daija Waugh", "Tvisha Vyas", "Yang Fu"], "reviews": [{"professor": "Cameron Butler", "course": "EDSP470", "review": "Funny and makes the class interesting. Leaves 15 minutes early every class.\r\n\r\nEasy A", "rating": 5, "expected_grade": "A+", "created": "2019-09-25T21:45:51Z"}, {"professor": "Leslie Page-Voth", "course": "EDSP470", "review": "Great professor. Super easy grader and does a good job teaching a thought-provoking subject.", "rating": 5, "expected_grade": "A+", "created": "2020-08-03T03:03:21Z"}, {"professor": "Deanna Collins", "course": "EDSP470", "review": "Very kind person, you know she cares about her students and what she does. I had her for an online course which you can tell is hard for her; but a lot of the content became very disorganized (contradicting info on syllabus, multiple places to submit assignments, unpublished modules, etc), so if you can't organize yourself, she's probably not the best professor to take- I'm sure it would be different in person. Overall, she delivers the content well and makes sure everyone understands; makes the assignments very reasonable. ", "rating": 3, "expected_grade": "A", "created": "2021-02-24T15:21:23Z"}, {"professor": "Tori Page-Voth", "course": "EDSP470", "review": "Nice and helpful professor. ", "rating": 4, "expected_grade": "", "created": "2021-03-12T22:52:23Z"}, {"professor": "Leslie Page-Voth", "course": "EDSP470", "review": "Great professor who makes a subject interesting. The work was challenging but definitely one of the best classes I have ever taken.", "rating": 5, "expected_grade": "B+", "created": "2021-06-13T04:20:11Z"}, {"professor": "Jason Chow", "course": "EDSP470", "review": "I love Professor Chow, he's super laid back and the assignments are really straightforward. There's usually one assignment due each week, sometimes two depending on the week, but it's super easy. There's no exams or quizzes, just a final paper where you have to analyze the portrayal of a character with a disability.", "rating": 5, "expected_grade": "A", "created": "2022-11-29T21:33:44.521387Z"}, {"professor": "Tasha Harris", "course": "EDSP470", "review": "The class is fine. Prof. Harris is nice and approachable, but very unorganized. Takes forever to grade and provides grading criteria and rubrics that are too vague for how harsh she grades certain assignments. Class isn't hard but you have to attend lectures for credit. She champions herself for being accessible outside of class, but weeks will go by where she ignores every student email. All that being said, I would not discourage anyone from taking this class and Prof. Harris does want her students to succeed.", "rating": 3, "expected_grade": "A", "created": "2022-12-17T16:37:50.725802Z"}, {"professor": "Jason Chow", "course": "EDSP470", "review": "Professor Chow was a solid professor. He's a really nice and understanding professor and is passionate about the topics he's teaching. My only qualm was that he went to Singapore for about a month in the middle of the course. He told us ahead of time so it was no surprise to us, but his TA and guest lecturers taught instead and it did feel like I was missing out as Professor Chow is a really good lecturer. The assignments are very straight forward and I would recommend this course to anyone needing an informative yet laid back upper level elective.", "rating": 4, "expected_grade": "A+", "created": "2022-12-22T02:26:29.763315Z"}, {"professor": "Sara Pepkin Dataram", "course": "EDSP470", "review": "Professor Pepkin is a super sweet person and lenient with grading. If you get a few points knocked off your grade for the IRIS Module, which seldom happens, she'll explain why in detail in the comments. There's also no final exam. The final is an essay where you provide the accuracy of which a disability is portrayed through a film and you need 4 peer reviews to back up your opinion. Many people didn't attend lectures but she does grade participation, so it's highly recommended to attend but not required to pass. Also no textbook is required. The only complaint is that she can seem nervous while teaching that she won't give you eye contact and lectures are mainly her reading from her slides. Overall, Professor Pepkin's class was straightforward and you'll get an A if you complete all of the assignments.", "rating": 4, "expected_grade": "A+", "created": "2023-12-12T02:48:17.653331Z"}, {"professor": "Yang Fu", "course": "EDSP470", "review": "Very nice professor and always provides resources for extra help if information is unclear. Very easy to communicate with and approach if there are any concerns about the class. She is also always considerate about different possible circumstances someone might have", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T23:14:35.793877Z"}], "department": "EDSP", "course_number": "470", "name": "EDSP470", "title": "Introduction to Special Education", "credits": 3, "description": "<b>Restriction:</b> Must not have completed EDSP210.\n<b>Credit only granted for:</b> EDSP210 or EDSP470.\nDesigned to give an understanding of the needs of all types of exceptional children.\n<i>EC/ECSE majors should register for EDSP211.</i>", "is_recent": true, "geneds": null}