{"average_gpa": 3.6643879776239685, "professors": ["Christopher Davis", "Kristen Hines", "Peter Kofinas", "Kevin Calabro", "Ayush Gupta", "Evandro Valente", "George Syrmos", "Isabel Lloyd", "David Lovell", "John Cumings", "Nicholas Wagman", "Romel Gomez", "Peter Sunderland", "Sheryl Ehrman", "Wesley Lawson", "Jackelyn Lopez Roshwalb", "Stephen Kamakaris", "Gregory Barr", "Patrick McAvoy", "Michael Galczynski", "Liangbing Hu", "Brian Phillips", "Stephen Secules", "Peter Chang", "Nick Wagman", "Taylor Myers", "W Ethan Eagle", "Brian Danielak", "Ted Baker", "Timothy Foecke", "David Kriesberg", "Jarred Young", "Richard Blanton", "Mohammad Ali", "Aadya Sharma", "Brian Danielak", "Caroline Altman Farrell", "Catherine Hamel", "David Kriesberg", "Dillon Capalongo", "Emily Wayson", "Gerald Brown", "Jackelyn Lopez Roshwalb", "John Cumings", "Joshua Cocker", "Kaliyah Burnett", "Kevin Cheng", "Michael Galczynski", "Mohammad Ali", "Patrick McAvoy", "Ronak Chawla", "Sierra Raspa", "Amy Karlsson", "Brian Danielak", "David Kriesberg", "Isabel Lloyd", "Jarred Young", "Joshua Cocker", "Michael Galczynski", "Paul Anderson", "Peter Sunderland", "Richard Blanton", "David Lovell", "Brian Danielak", "Catherine Hamel", "David Kriesberg", "John Cumings", "Joshua Cocker", "Kevin Calabro", "Lina Castano", "Michael Galczynski", "Amy Karlsson", "Aris Cleanthous", "Brian Danielak", "Danielle Barker", "David Kriesberg", "Isabel Lloyd", "Jarred Young", "Joshua Cocker", "Kevin Calabro", "Lina Castano", "Michael Galczynski", "Peter Sunderland", "Aris Cleanthous", "Brian Danielak", "Catherine Hamel", "Danielle Barker", "David Kriesberg", "John Cumings", "Joshua Cocker", "Michael Galczynski", "Paul Anderson"], "reviews": [{"professor": "John Cumings", "course": "ENES100", "review": "As a person, I genuinely liked Dr. Cumings, he's really a kind-hearted person and wants you to do well even if his teaching abilities aren't the best or the most organized. Yes, he'd spend at least a good half hour of our 1 hr 50 min lecture fiddling around trying to get his powerpoint up or figuring out what to teach us that day, so yes, his lectures were a bit useless. However, when we began working in the lab, he seemed like he genuinely cared about the success of the teams and gave our team some really good advice. My team was wildly unsuccessful, like we essentially couldn't get s**t to work. But he's extremely fair with grading and curves generously, so if you have this professor and a good hovercraft group (unlike me), you're totally set for this class.", "rating": 4, "expected_grade": "A-", "created": "2014-01-07T11:52:00Z"}, {"professor": "John Cumings", "course": "ENES100", "review": "He's a pretty good professor, and compared to other sections of ENES100 he grades favorably.  Lectures during the first half of the course were pretty boring, but they are going to be boring no matter who your professor is.  For the hovercraft milestones, Cumings was fair in his expectations for our hovercraft, and extended the deadline for a few milestones.  Overall I'd recommend him.", "rating": 4, "expected_grade": "B", "created": "2010-12-06T15:43:00Z"}, {"professor": "John Cumings", "course": "ENES100", "review": "Definitely not as bad as other comments make him out to be. The lectures in the first half of the course can get a little dull, but they contain some helpful information for the midterm. We had a good TA who was able to come in after-hours to work on the hovercraft. As for grading, I would say Cumings is definitely fair, especially for presentations and reports, and he does curve.", "rating": 4, "expected_grade": "A", "created": "2010-12-02T14:54:00Z"}, {"professor": "John Cumings", "course": "ENES100", "review": "The comment below pretty much sums up Professor Cumings.  He does not make himself available at all to help his students succeed in the class.  ENES 100 is a pretty straight forward class but his lectures are not helpful at all.  He has his doctorate and makes his presentations like he is still in high school.  He extends the due dates of assignments because the class cannot meet them but in the end, they become too close together and teams do not qualify for the competition.\n\r\nHope for a good TA if you have class with him.\n\r\nActually, just sign up for Evandro Calente instead because his groups are always the most prepared.", "rating": 1, "expected_grade": "B", "created": "2009-12-13T23:37:00Z"}, {"professor": "John Cumings", "course": "ENES100", "review": "I'm not sure if he knows what he is talking about half the time. He stutters all through lecture and tries to explain concepts, but doesn't really succeed. He randomly deducted points on our papers and didn't expplain why they were deducted. If you were lucky, you would get and underlined sentence or two with the word \"UGH\" in the corner. I still haven't figured out what that was supposed to mean.", "rating": 3, "expected_grade": "B-", "created": "2009-07-24T17:55:00Z"}, {"professor": "Christopher Davis", "course": "ENES100", "review": "Very nice guy, and is very willing to help. However, since he was used to having teams win the ENES100 competition, it seems I didn't get an A just because we didn't qualify for the competition.", "rating": 4, "expected_grade": "", "created": "2013-07-15T14:52:00Z"}, {"professor": "Christopher Davis", "course": "ENES100", "review": "Dr. Davis is the man! He's always very upbeat, incredibly smart and knowledgeable, and takes great care to see his students do well. Take his courses if you can, its well worth it!!!!", "rating": 5, "expected_grade": "A", "created": "2010-12-10T21:18:00Z"}, {"professor": "Bruce Jacob", "course": "ENES100", "review": "THE best professor for ENES100. He will basically tell you what parts are best for the hovercraft so pay attention. His lectures are also the most interesting. Just don't expect him to help you study for the midterm. The TA was much more helpful for answering questions. ", "rating": 5, "expected_grade": "", "created": "2010-05-20T20:44:00Z"}, {"professor": "Bruce Jacob", "course": "ENES100", "review": "From what I know, he was much more relaxed than the other teachers. The only issue I had is that I didn't really learn anything until right before the mid-term. If you're trying to learn you might want to take another section. He's easier and his TA (who happens to be a very cool person) can help you however. It really depends on what you're looking for.", "rating": 5, "expected_grade": "A", "created": "2009-01-28T16:24:00Z"}, {"professor": "Bruce Jacob", "course": "ENES100", "review": "Take Prof. Bruce Jacob at all cost! He is probably the coolest engineering professor in the Clark School, and is very lenient with grades. He encourages thinking outside the box, and tells you not to worry about your grade. Also, he always teaches with the same TA,(whose name is AJ by the way) and the guy is awesome. Either Jacob or AJ will help you out in anyway they can. Also, he will defend his students when other people in the department criticize ideas etc. Take this guys if you can!", "rating": 5, "expected_grade": "", "created": "2008-12-20T17:51:00Z"}, {"professor": "Bruce Jacob", "course": "ENES100", "review": "Great teacher! Absolutely does not care if your hovercraft breaks down as long as you put in effort. He loves getting off topic and cares a lot about helping you get the point of the class (which is : team projects are hard). As for the midterm, you'll do fantastic if you've taken some physics classes before. If not, get good at writing cheat sheets-you're allowed one page.", "rating": 5, "expected_grade": "A", "created": "2008-12-16T07:23:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "Kofinas is a very nice professor.  This year's project had nothing to do with oder designs.  Kofinas helped a lot, he will give you a good grade if you show you contribute to your team and work hard on the project", "rating": 5, "expected_grade": "A", "created": "2011-12-12T23:37:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "Kofinas wasn't a great professor, but he wasn't bad either. Would try to help all of his students, but didn't do well at actually helping. In this class though, that didn't really matter to much as he didn't actually have to teach us anything.\n\r\nEasy class, not difficult by any means, and has a major curve.\n\r\nWhen it comes to building your hovercraft, be creative, and make sure you stay involved in your group. Present your ideas clearly in your presentation and you will be set. Kofinas' biggest pet peeve was when people copied older designs. He would rather you built a totally new design that didn't work as well.", "rating": 3, "expected_grade": "A", "created": "2011-12-09T21:27:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "If you have the opportunity, I would definitely suggest taking ENES100 with Dr. Kofinas. Go out of your way to talk to him occasionally, because you want him to know your name and that you're contributing to your group.\n\r\nPROS:\r\na really nice guy, very willing to help when he can (or at least tell you which other professor to ask), and very reasonable with assigning milestone and final grades.\n\r\nCONS:\r\nlectures are long and not very exciting (but what can you expect when a professor is expected to cover everything from physics, to electronics and programming), at least 2/5 questions on the ENES100 midterms always seem to be awful (in-depth questions on topics covered for a week), and the success of your group really depends on how lucky you are with members (i.e. how many good computer/electrical engineers you get)... but those last two are just related to the course as a whole", "rating": 4, "expected_grade": "A", "created": "2011-07-17T17:54:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "Kofinas is a really nice guy and I enjoyed having him as a professor. He was very helpful and friendly throughout the semester, especially during the hovercraft project.", "rating": 5, "expected_grade": "A", "created": "2011-05-31T18:09:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "The previous reviewer is wrong.  Kofinas has been extremely helpful during assembly room hours.  When he does not know the solution to our problem, he always makes sure to point out to the right resource for us to get an answer, whether this is Chris, Evandro or some other teaching assistant. He is also vey accessible and helpful outside class hours. ", "rating": 5, "expected_grade": "A", "created": "2011-05-21T16:55:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "He just seems so confused. He constantly walks around just watching us and then we have to ask him if he has any questions. Then he'll usually just say what we're doing is wrong, but isn't able to help us fix it. We have to go to Chris to get more help. \n\r\nHis lectures aren't exciting, but I feel like it's like that anywhere. He knows that though so he tries to joke around. He's nice, he just doesn't know how to communicate with the students when it comes to shop hours.\n\r\nHe's also an easy grader and admits that this class gets curved majorly. It's very hard not to get an A with him.", "rating": 2, "expected_grade": "A", "created": "2011-05-05T12:43:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "Dr. Kofinas is a cheerful person and will try to help you on your design. He's also a pretty easy grader on top of that. However, his lectures are pretty boring, but they tend to have most everything you'll need to know for the class in them. Other than that, as long as you do your work, it's pretty much impossible to not get an A in his class.", "rating": 4, "expected_grade": "A", "created": "2010-12-23T19:26:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "This teacher is extremely lenient. Though his lectures can be boring, he is very understanding when it comes to grading. Overall i would recommend taking the class with him if given the opportunity.", "rating": 4, "expected_grade": "A", "created": "2010-05-31T04:30:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "This professor is really nice. The lectures in the beginning of the class are dull, but important and easy to follow. When building starts he is very helpful and what seems like him being really harsh is really his way of saying, \"from my experience that won't work\".", "rating": 5, "expected_grade": "A", "created": "2010-05-11T21:07:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "He is awesome! He is very fair. Go to class, do work during the hovercraft construction time, and you'll get an A. He is very positive and optimistic, and he wants you to succeed.\r\nI was very impressed how well he knows his stuff on fluid mechanics and general hovercraft design. Very friendly and personable, open to giving advice on variety of engineering majors. ", "rating": 5, "expected_grade": "", "created": "2009-05-12T19:17:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "Only gives homework for the first couple weeks (which you are allowed to work on with your hovercraft group).  Curves a lot and only one test, a midterm which is easy.  Attendance is important.  Show you are contributing to the hovercraft and you should be fine. ", "rating": 5, "expected_grade": "A", "created": "2008-12-20T05:36:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "This guy is really good, the previous comment is very true. Show him that you're working, and WORKING IN YOUR TEAM and you will exceed in this class. The man is also very knowledgeable about Engineering as a whole and I ask him for advice concerning things beyond ENES100.", "rating": 5, "expected_grade": "A-", "created": "2008-11-25T16:25:00Z"}, {"professor": "Peter Kofinas", "course": "ENES100", "review": "Best professor  ever!\r\nKnows his stuff on hovercraft design, especially fluids.  He is personable, funny, always willing to help. If you attend class, and show him you are participating in the construction of the hovercraft, you are guaranteed an A\n", "rating": 5, "expected_grade": "", "created": "2008-02-06T12:01:00Z"}, {"professor": "Luz Martinez-Miranda", "course": "ENES100", "review": "The course is easy and she does try really hard to help but you will get annoyed with the word \"actually\" by the end of the course.  As long as you show that you are trying you will get an A.", "rating": 2, "expected_grade": "A", "created": "2009-04-28T21:16:00Z"}, {"professor": "Luz Martinez-Miranda", "course": "ENES100", "review": "This class was a typical intro engineering course.  However, Martinez-Miranda made the class much more difficult to understand than it should have been.  She was a nice enough person and gave a good percentage of A's, but she was impossible to understand.  She said actually more times each lecture than a normal person would in a lifetime.  I you have a choice, go with another professor.", "rating": 2, "expected_grade": "A", "created": "2009-04-20T01:48:00Z"}, {"professor": "Luz Martinez-Miranda", "course": "ENES100", "review": "Note: the rating is for the professor, not the course in general.\n\r\nThe course itself is your typical rite-of-passage intro engineering course. However, this is one of those classes where you have to put in WAYYY too much work outside of class (about 3-4 hours per week OUTSIDE of class). At least Martinez-Miranda was pretty lenient with the A's.\n\r\nNow as for her...Where do I begin? IMPOSSIBLE to understand during lectures. Repeats herself way too much. I counted one time. She said the word \"actually\" 120 times in the span of one hour. I literally learned nothing from her class. If you're doing Materials Science, I'm sorry. If you're not, then STAY AWAY!", "rating": 1, "expected_grade": "A", "created": "2009-02-25T15:34:00Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "Peter is a great guy. You really only experience his teaching for the first half of the semester, but even then you can tell he is a good professor. If I were to take a ENFP class, I would take Peter.", "rating": 5, "expected_grade": "B", "created": "2015-02-02T03:28:00Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "Fair grader and really nice guy. Good teacher for the material in the first half of the semester but once you start actually building your hovercraft he really is of no help. But he does try to get you the highest grade possible so I would recommend him. Just don't expect him to do anything once you are building the hovercraft except stand towards the side of the classroom and look awkward.", "rating": 4, "expected_grade": "A", "created": "2010-12-14T01:37:00Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "Good teacher that does really care if your understanding the material.  ENES 100 is supposed to be a class you struggle through because it teaches you the basics of team design in engineering.   Sunderland helps you through this process and always have many review sessions for homework and the such.  \n\r\nLoves to give A's for those who both try their hardest and simply know the material.  Great teacher", "rating": 5, "expected_grade": "A", "created": "2009-05-01T08:43:00Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "He is excellent and cares alot about his students. He is very helpful and a fair grader. \n\r\nChose him over all the other teachers if you have the chance. ", "rating": 5, "expected_grade": "A", "created": "2008-12-17T00:24:00Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "He was overall a very nice and understanding teacher.  When it was clear that most hovercraft teams were stuggling with stuctural or technical components of the project he was forgiving and extended the deadline for a critical milestone.  His explanations of the Friday technical lectures were fairly clear.  The only downside is that for an engineering professor, he's very tough on grammar.  ", "rating": 4, "expected_grade": "A", "created": "2008-12-16T17:06:00Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "Dr. Sunderland is a really nice guy. Many of the other engineering teachers are nasty and arrogant in my opinion. Peter also takes the time to go over lecture material from Fridays during class and he is very encouraging. I sometimes find him annoying, though, when he constantly demands how your hovercraft is coming along. Overall, though, I would take Dr. Sunderland over many of the other teachers for ENES100!", "rating": 4, "expected_grade": "A", "created": "2008-12-02T00:47:00Z"}, {"professor": "George Syrmos", "course": "ENES100", "review": "He's nice but is confusing when he's trying to explain homework concepts and helping with the hovercraft project. He tries to give students a lot of leeway with the hovercraft project so if you ask him specifics, he'll probably tell you that the decision for something (or a certain part) is completely up to you. However, for the weekly homework assignments, he gives a lot of hints and is very approachable", "rating": 4, "expected_grade": "A", "created": "2011-12-21T23:07:00Z"}, {"professor": "George Syrmos", "course": "ENES100", "review": "Incredibly nice guy but an overall bad teacher for the hovercraft project.  He has a PhD in electrical engineering yet was completely worthless in helping my team wire our circuit.  Every time we asked him to show us how to use a component, such as a transistor, he would give a different response.  As long as you work hard and put effort into this project he will give you an A.", "rating": 3, "expected_grade": "A", "created": "2010-04-01T14:20:00Z"}, {"professor": "George Syrmos", "course": "ENES100", "review": "He's a nice guy and a pretty easy teacher, but he doesn't know too much about the hovercraft project.  He would rely a lot on our TA and the other people like Evandro that helped out.  ", "rating": 3, "expected_grade": "", "created": "2009-04-22T02:22:00Z"}, {"professor": "George Syrmos", "course": "ENES100", "review": "Dr. Syrmos is always eager to help his students. However, he can be a bit confusing (actually... a lot).\r\nBottom line, he is a great person, decent teacher.", "rating": 4, "expected_grade": "", "created": "2007-12-02T20:44:00Z"}, {"professor": "Isabel Lloyd", "course": "ENES100", "review": "Lloyd doesn't really know anything about the material so everything is left up the TAs. If you ask her a question she will usually defer it to TA since she doesn't know the answer. I'm starting to wonder why she is allowed to teach this class. ", "rating": 1, "expected_grade": "B-", "created": "2009-12-21T02:16:00Z"}, {"professor": "Isabel Lloyd", "course": "ENES100", "review": "She sucks. During lectures she spends about half the time talking about her ex's   family or about how she spent twenty years in industry and all that. She provides very little help during the hovercraft building time and relies on her TAs a lot. Her lectures are almost a copy of the common section lectures given a week before. Not much help on the midterm either. Her TA is much more helpful.   ", "rating": 1, "expected_grade": "A-", "created": "2008-04-29T03:58:00Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "Calabro is a pretty good lecturer. He knows how to teach the material very well. This thing is that he is a bit quiet and dry at times, especially if you have prior knowledge of the material. \r\nCalabro gives out a lot of 4/5’s on parts of reports if they are not perfect, which, in almost all cases, they aren’t. Our team got a 77 percent on the first report, and that was the highest grade in the class. He will rip apart your report and presentation for all possible flaws. Its for your own good though. You have been warned…\n\r\nDon't think that just because there are 50% A's, doesn't mean you can slack off in this class. The hovercraft project is a pain at first. You will easily spend hours with your team planning the hovercraft, building it, and testing it. It helps a lot to have someone who can program on your team because it is difficult to learn about programming if you have no knowledge. \n\n\n", "rating": 5, "expected_grade": "", "created": "2012-05-11T23:27:00Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "This class is quite easy and Calabro is a pretty good teacher.  I should have gotten an A in the class, but I played the points game and really didn't care about doing the homeworks, when I should have and it has come back to haunt me...  Anyway, Calabro is a nice guy and easy to talk to about any questions or concerns you have.  He is, however, as stated in another review extremely harsh when grading presentations and design reports, you most likely will not get an A on these assignments, because he is very nit-picky.  For example, in my preliminary design report, I got so many points taken off for formatting in regards to where captions should be for a table versus a figure.  But overall, nice guy, and you should at least learn the necessaries of the courses, not really detailed material", "rating": 4, "expected_grade": "B", "created": "2011-11-30T22:20:00Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "\"Calibro\" is a really nice guy, and a decent teacher. He really cares about his students, and is very down to earth. He almost seems more like a TA than an actual lecturer at times, but he is definitely well qualified to teach the class. He does, however, grade very harsh on presentations and the Design Reports.", "rating": 4, "expected_grade": "A", "created": "2010-12-15T06:27:00Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "Good teacher. Really cares about his students which is nice. He focuses more on getting you prepared for the mid-term than the hovercraft, but he's reasonably helpful with the hovercraft as well. He's very thorough on design reports, which is nice because you get a ton of helpful feedback for future reports. Homework was gradely a little harshly but it doesn't affect your grade to much in the end.", "rating": 5, "expected_grade": "A", "created": "2010-10-03T19:42:00Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "The course material isn't very hard and Kevin does do a good job explaining everything.  \r\nHe does go the extra mile to help you on your hovercraft.  As other people have said the presentations are graded pretty harshly, for me I got a B on every single one but I still ended up with an A+ in the class. \r\nAs long as you work hard in the class you should be able to get an A.\r\nJust a note he is a mechanical or aerospace engineer, I forget so he isn't very proficient on programing or electronics design however he will try his best to help answer your question or refer you to someone who knows the material.", "rating": 5, "expected_grade": "A+", "created": "2010-02-21T14:07:00Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "Be ready to work hard in this class.\r\nThe first half of the semester in enes100 was very time consuming between required special lectures (outside of class), homework, and team meetings (designing the hovercraft).  Depending on how productive your team is, meetings can take huge chunks of your time.  When the midterm comes around, study hard, it is important.\n\r\nThe second half of the semester is great.  Class time is reserved for working on your hovercraft, and you probably need very few, if any, team meetings.\n\r\nKevin really cares about how well your team does and is happy to help if you ask him.  He grades presentations and the PDR harshly because there is plenty of room for improvement.  Regardless, it doesn't really destroy your grade.  If you put in the effort on your team and show that you care about the project, you'll do well, and probably enjoy the class.", "rating": 4, "expected_grade": "A+", "created": "2010-01-03T17:40:00Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "he grades really hard on your group presentations. plus the midterm is extremely hard. I failed the midterm and did average on the presentations. I got a B in the class. he emphasizes how your hovercraft team and their evaluations have a huge impact on your grade but it really doesnt affect it that much. He is the hardest enes100 teacher. ", "rating": 2, "expected_grade": "", "created": "2009-12-23T00:58:00Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "Arguably the most difficult ENES100 teacher. Just do your HW, do decent on the midterm, and well on your hovercraft.", "rating": 3, "expected_grade": "B", "created": "2008-05-17T02:45:00Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "Probably the hardest ENES100 teacher. Grade really depends on how well your Hovercraft group does on its presentations. ", "rating": 4, "expected_grade": "B", "created": "2008-02-01T14:22:00Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "He is a good teacher. He does grade much harder and thoroughly than the other teachers. Kevin (as he asks to be called) probably prepares you best for the midterm, which is a major chunk of your grade. ", "rating": 4, "expected_grade": "B", "created": "2008-01-21T12:19:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "Dr. Lovell is a pretty good guy if you ask him for help. If you never ask a single question, you're going to be completely lost on your hovercraft. If you ask him for help, he will gladly help you if you continue to ask questions.\n\r\nOur class was one of the most prepared when it came to building the hovercraft. \n\r\nHe is a very harsh grader, and a pretty boring lecturer, but once you get to creating the actual hovercraft, it will be fine.", "rating": 3, "expected_grade": "A-", "created": "2012-12-07T03:21:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "**********************************\r\nAVOID THIS PROFESSOR AT ALL COSTS\r\n**********************************\n\r\nHe wastes your time every class.\r\nWhich could be cool, yeah...\r\nExcept for when you get to the homework, quizzes, and milestones, and ask yourself \"HOW THE HELL AM I SUPPOSED TO DO THIS?\" because you have never once seen Lovell do an example problem in class.\n\r\nENES100 is a stressful, difficult class for most students who have decent professors. ENES100 is HELL when it is taken with Lovell.\n\r\nDo yourself a favor.\n\r\nIf you find yourself in the same situation as I did, where the only ENES100 class that would fit into your schedule happened to be with Lovell...\n\r\nDROP THE CLASS BEFORE IT IS TOO LATE.\n\r\nTake it another semester. For your own sanity.", "rating": 1, "expected_grade": "", "created": "2012-10-05T05:36:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "Butthole. Doesn't really teach. Too harsh of a grader. Won't help you. ", "rating": 1, "expected_grade": "B", "created": "2011-12-28T22:08:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "He's a horrible professor. He's stern and overly critical. He grades so harshly on all of the presentations and design reports. After the last homework set, he showed up once every two weeks to class. And he never helped any group. Don't take him. ", "rating": 1, "expected_grade": "", "created": "2010-12-22T13:48:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "Dr. Lovell had a pretty good sense of humor, but he was often absent throughout the semester when we most needed his help in constructing the hovercraft. Also, after talking to friends in other sections, it seems as if Lovell is a much more harsh grader and is much later in giving grades back.", "rating": 3, "expected_grade": "B", "created": "2010-12-19T02:33:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "He's a chill guy. He, however, is very boring and does not teach well. He speaks monotonously through the whole class, whole 1 semester. Sometimes he jokes but not many laughs. He makes the class material hard and when we presented, he took off of unnecessary points, and gave criticisms which did not need to be addressed. BUT, if you know the material, then take him.", "rating": 1, "expected_grade": "", "created": "2010-05-04T21:41:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "Dr. Lovell is a great professor and is very helpful to anybody who asks. He does expect you to work hard, but his expectations are reasonable. He is also very knowledgeable about the field of engineering and is a great resource for ENES100 students.", "rating": 5, "expected_grade": "A", "created": "2008-12-19T18:40:00Z"}, {"professor": "Sheryl Ehrman", "course": "ENES100", "review": "Dr. Ehrman is one of the nicest ENES100 professors I've met. She teaches well, and helps out whenever she is needed. On the other hand, she can get terse at times, but if you have a strong personality also, you will work fine with her. She cares, which is something that I think a lot of the other teachers are missing. As opposed to someone like Evandro who can just be condescending and mean, or the other guy (forget his name) whose accent is impossible to understand, she will be a pleasure to work with. Her TF, Tuan, is leaving, though, and he was pretty much what made the class for me and my group, so take that into consideration - new TF might mean bumps in the road for a semester or two.", "rating": 5, "expected_grade": "A", "created": "2009-04-28T02:18:00Z"}, {"professor": "Sheryl Ehrman", "course": "ENES100", "review": "Nicest teacher ever. She'll go around taking pictures for her montage at the end of the year, you get the idea that she is very attached to the class and genuinely wants you to succeed. Good pick, especially because her teaching fellow Tuan Dang is the absolute best teacher/helper/friend anybody can ask for.", "rating": 5, "expected_grade": "B", "created": "2009-02-08T00:22:00Z"}, {"professor": "Sheryl Ehrman", "course": "ENES100", "review": "she was a nice teacher, and she was pretty lenient when grading the presentations. If you go to her in office hours, she will help you. The class itself was bullhit though.", "rating": 4, "expected_grade": "", "created": "2008-04-23T15:44:00Z"}, {"professor": "Sheryl Ehrman", "course": "ENES100", "review": "Nice, not condescending like other professors who think they're too good to teach introductory courses (I guess it's because it's fun for her to teach as well).  You will get \"supplementary assignments\" that other sections won't have to do but they're very easy to do.  ", "rating": 4, "expected_grade": "A", "created": "2007-11-16T02:22:00Z"}, {"professor": "Kristen Hines", "course": "ENES100", "review": "Kristen was only okay. She is an extremely nice woman, and I do feel like she cared about the class. However, the first 6 weeks of lecturing were insufferably boring and I felt totally unprepared for the weekly homeworks. Some of this is due to the class structure, but I still think she could've done a better job of teaching us. Once we got to the build stage of the class she was significantly better, offering encouragement and making us care more about the assignment. I love the enthusiasm she brought to the 2nd half. I would've given her a 5 star review for the 2nd half of the class, but that first half was so brutal and boring I had to settle with a 3. Still a pretty easy A though.", "rating": 3, "expected_grade": "A", "created": "2014-12-04T01:45:00Z"}, {"professor": "Anil Gupta", "course": "ENES100", "review": "This review is for Ayush Gupta.\n\r\nAyush was amazing at leading you though the creation of the hovercraft without simply telling you what to do. He is personable and approachable. He is amazing at taking something unclear, and there are many such things when building the hovercraft, and distilling it down to understandable ideas. He is funny, memorable, and a great teacher. I would absolutely want to have him again.", "rating": 5, "expected_grade": "A-", "created": "2014-05-28T21:12:00Z"}, {"professor": "Patrick McAvoy", "course": "ENES100", "review": "He is a great professor! Really chill guy and is super nice to all of his students. He is very understanding and has pushed back deadlines for our class multiple times because he knew that no one could get it done in such a small amount of time. I recommend his classes to anyone. ", "rating": 5, "expected_grade": "A", "created": "2017-11-30T21:46:51Z"}, {"professor": "Liangbing Hu", "course": "ENES100", "review": "Dr. Hu is such a cool guy. He’s so chill and relaxed and has this air around him of fame and importance because he has accomplished so many amazing things both just throughout his career and in his materials lab. It’s weird because you’d expect him to be a little more drab and information heavy, but for my class he emphasized the importance of brainstorming and teamwork and just let us go basically. There were a lot of people in my class that said they didn’t learn a whole lot, but really in ENES100 you don’t get a ton of useful lecture material, it’s all about learning the Engineering Design Process through the OSV project - something which, in my opinion, he did extraordinarily well. By the end of the course, he knew most of us by name and what majors we were and would check up with each group frequently to make sure they’re meeting their milestones. He would host several late afternoon/night lab sessions for us to catch up on building our OSVs. He even helped us in troubleshooting for why we couldn’t turn properly at one point. All in all, would recommend to anyone - though I’m not too sure he’ll be teaching this course again very soon, as he seemed to suggest he felt very overwhelmed by all that was happening and by the structure of the course.", "rating": 5, "expected_grade": "A", "created": "2018-06-02T10:03:19Z"}, {"professor": "Gregory Barr", "course": "ENES100", "review": "Greg is THE man!! Take him for ENES100 if you can. Super helpful, super chill, software engineering industry guy that wants you to talk to him about his job. ", "rating": 5, "expected_grade": "A-", "created": "2018-12-15T15:32:29Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "Sunderland's grading is pretty lax for the Milestone parts of your grade which is good, but his quizzes are not really fair for the content he had taught to the class. With the quizzes being 15% of your final grade and with the average on those quizzes to be about 60%, 60% of that 15 is already losing 6 percent of your grade assuming you score average. ", "rating": 2, "expected_grade": "B+", "created": "2018-12-22T21:30:43Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "ENES100 is still one of my favorite courses that I have taken at UMD. Mike cares about his students and takes steps to keep the material engaging and relevant. Have fun with the class and put forth an effort and you will gain valuable experience and a good grade.", "rating": 5, "expected_grade": "A", "created": "2019-01-24T15:39:33Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "His attitude can be a little polarizing since his humor is dry and he seems strict, but his lectures were solid. But his homework was tough. The majority of work is with teams, so he's not really too involved with the programming or building of the rover, but that's where the TAs come in. His quizzes are on random information he said like once. Overall, I would give ENES100's course difficulty a 4/5 with him, because although he grades fairly, if not a tad harshly, he expects you to know random information he said like once in lecture and he doesn't teach most of the content on these exams. ", "rating": 3, "expected_grade": "A-", "created": "2019-01-29T14:44:21Z"}, {"professor": "Taylor Myers", "course": "ENES100", "review": "Dr. Myers is a great professor! I had him when it was his first time teaching the class so he didn't do everything perfectly, but overall I learned a lot and as long as you show up and do the work you'll get an A. My OSV didn't even work and I still did well in the class.", "rating": 5, "expected_grade": "A", "created": "2019-04-16T23:40:28Z"}, {"professor": "W Ethan Eagle", "course": "ENES100", "review": "Avoid, there’s a reason he has an average rating of 2.17 when the Engineering department average is 3.5ish. He specifically states he’s a much harder grader than other ENES100 professors which almost every other professor give you a guaranteed A in.", "rating": 1, "expected_grade": "B", "created": "2019-05-14T22:25:08Z"}, {"professor": "W Ethan Eagle", "course": "ENES100", "review": "This other reviewer clearly didn’t put any work into this class. My opinion is just as anonymous as theirs, but I would highly recommend disregarding their review.\r\n\r\nEthan Eagle is not an “easy” teacher because he actually lets you learn things in ENES100. ENES100, in my opinion, is fundamentally flawed due to a lack of a clear concrete goal and the time constraints. However, Ethan is very good at taking this class and making it into a memorable and useful experience that most professors do not. Especially in the teamwork regard, Ethan is great at cultivating dynamic team relationships that will shape how you work with others. This is an incredibly useful skill, and I’m very thankful that he helped me with it. \r\n\r\nThat said, Ethan does make you do more work than most professors. He also has an unorthodox grading system where you basically don’t know what grade you will receive until the course has ended. This system isn’t for everyone, but once you can get over the uncertainty it is fine. He gives literally everyone who put effort into the class an A in the end. Don’t worry about grades in his class if you have a decent work ethic. You will do fine.\r\n\r\nIn the end, if you are looking for an “easy A” in ENES100, steer clear from Eagle because he will make you work. But if you actually want to get something out of ENES100, like one would expect when you’re paying a ton of money to learn things in college, I would highly recommend Eagle. The other reviewer mentions stats about the department - in Ethan’s professor evaluation the students reported learning a significantly higher amount of information than the average ENES100 student. ", "rating": 5, "expected_grade": "A+", "created": "2019-05-23T15:41:01Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "Kevin is awesome. He cares about all his students and wanted us to still do well, even when our OSV had about a million problems. He makes a hard class fun, and if you truly deserve an A you will get one.", "rating": 5, "expected_grade": "A", "created": "2019-05-25T01:19:26Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "I also had Mike for ENES102. Mike is a great guy who cares a lot about his students. He brought in candy and baked goods for the class on several occasions, and he generally worked hard to make sure everyone was having a good time in class. The ENES100 classes in general are all fairly disorganized and can be a lot of work, but Mike made the best of the situation and tried to keep everybody happy.", "rating": 5, "expected_grade": "A+", "created": "2019-05-26T20:32:03Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "I had him for ENES100 and I would say avoid him. He is a really nice guy and he does care about his students. However, if you are expecting the historical easy A from ENES 100, prepare to struggle. His quiz average was 60% and it was 15% of the final grade so you already are down a bit. And unless you have a very technical adept team (or a team that actually does their work on time without excessive reminders), you will struggle with accomplishing the milestones towards the end for the OSV. I have heard from other ENES 100 students in other classes that even though they were unable to achieve the final milestones, you still got credit for showing effort. But nope not with Sunderland. Take note of his ENES 100 grade distribution and it is almost a bell where 40% people get Bs. Anyway, choose your professor wisely. This class is a time sink as it is and with this professor it is not an easy A. ", "rating": 2, "expected_grade": "B", "created": "2019-08-22T01:20:58Z"}, {"professor": "Ayush Gupta", "course": "ENES100", "review": "Great professor, does not expect too much but pushes students to try their best ", "rating": 5, "expected_grade": "", "created": "2019-10-29T21:15:30Z"}, {"professor": "Taylor Myers", "course": "ENES100", "review": "Dr. Myers is truly an amazing professor and I would recommend everyone take his class. He is a cool guy who knows his stuff and is really helpful. ", "rating": 5, "expected_grade": "", "created": "2019-12-09T13:30:43Z"}, {"professor": "Jackelyn Lopez Roshwalb", "course": "ENES100", "review": "It is a very easy course and Roshwalb lays out the material in a way that is easy to understand. I wouldn't stress studying for the exams too hard and take your time to focus on other classes. With the group project for the OSV it boosts your grade. I got a C on two of the exams and an A on one and still got an A in the class. She is very understanding and even lets you retake exams if you need to. She really wants to see students succeed and helps a lot during the OSV project. I highly recommend taking her  ", "rating": 5, "expected_grade": "A", "created": "2019-12-16T17:14:54Z"}, {"professor": "Timothy Foecke", "course": "ENES100", "review": "I do not recommend you take this professor for ENES100. He grades very leniently and is kind/understanding, however he completely skipped the lecture material for the first 8 weeks of class. Some students might prefer this, but I found it detrimental to my team's progress on the OSV. The online lessons aren't very useful, so having the traditional in class lectures would have benefited my section greatly in terms of learning.", "rating": 2, "expected_grade": "A+", "created": "2019-12-17T22:42:08Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "Dr. Sunderland is a really nice professor and wants to see every person in ENES100 gain practical engineering skills. In my opinion, Dr. Sunderland is much better suited to teaching 300 level courses rather than a 100 level simply because of how high his expectations are. Except for his last quiz about Arduino programming, his quizzes are very easy to fail simply because the questions are 100x harder than any class material. He is not really forgiving with the milestone deadlines, so expect to get low grades on a ton of them unless your group is unusually good. Even with a great TA, taking ENES100 with Dr. Sunderland can be overly stressful.", "rating": 3, "expected_grade": "A-", "created": "2019-12-18T02:23:57Z"}, {"professor": "Taylor Myers", "course": "ENES100", "review": "Dr. Myers is an overall excellent professor. At first the class seems very daunting but he guided us through it very effectively. If you show up and do the work you'll do well. ", "rating": 5, "expected_grade": "A", "created": "2020-02-24T20:15:46Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "A passionate teacher who cares dearly about his students. He is easygoing and tries to encourage student participation as often as possible.", "rating": 5, "expected_grade": "A", "created": "2020-04-10T20:43:38Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "A calm teacher who truly does care about you and your wellbeing. He teaches the material in an engaging manner and is pretty easy on grading.", "rating": 5, "expected_grade": "A+", "created": "2020-05-13T18:36:30Z"}, {"professor": "Jarred Young", "course": "ENES100", "review": "Dr. Young cares about his students and is very easy to talk to. He has a great story and he grades fairly. He is concerned with making his students better engineers for the future, not just giving out hard grades.", "rating": 5, "expected_grade": "A+", "created": "2020-06-08T00:55:33Z"}, {"professor": "Jarred Young", "course": "ENES100", "review": "Very great teacher. Willing to work with students and will open up office hours for your help. Puts his students first and goes over all important material thoroughly. ", "rating": 5, "expected_grade": "A", "created": "2020-07-07T16:30:02Z"}, {"professor": "Timothy Foecke", "course": "ENES100", "review": "Foecke is a great and very understanding professor. He has a lot of industry experience so he constantly related what he taught to the real world.", "rating": 5, "expected_grade": "A", "created": "2020-08-31T18:57:31Z"}, {"professor": "Jackelyn Lopez Roshwalb", "course": "ENES100", "review": "ENES100 is a pretty boring class, but Jackelyn made it bearable. She clearly cares about what she's teaching, and she tries to make the class engaging. The grading is exceptionally light, but there is a lot of work that seems pretty pointless.", "rating": 4, "expected_grade": "A", "created": "2020-11-19T02:33:25Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "I am shocked that Mike doesn't have a 5.00 overall. He is such an amazing professor and absolutely hilarious. He is willing and happy to help any student in need and teaches very effectively. Mike makes this class fun. ", "rating": 5, "expected_grade": "A", "created": "2020-12-14T16:42:33Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "*Sigh* He is so so nice in lecture, but can be really difficult with his assignments. I am so grateful I had him during an online semester, because it seems he is way worse in person. When I took ENES100, all profs were TBA, so I was frustrated when I realized I had Sunderland. I can't really recommend him, but I also can't shit on him much. He does things a little differently from the other enes100 profs, so if possible, maybe take one that has better grade data. He was pretty good with the online thing. Very responsive to email. ", "rating": 3, "expected_grade": "A", "created": "2020-12-19T16:29:23Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is an outstanding professor and provides the best  for his students. He manages to make virtual ENES100, a class reliant on group work, a rousing success. I’d highly recommend taking Mike if at all possible, his jokes and attitude are infectious in the best way possible.", "rating": 5, "expected_grade": "A+", "created": "2020-12-24T16:31:40Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is the best professor you could possibly get for any course. He has a great sense of humor and is happy to assist students in their work and any way possible. 6 stars out of 5 for sure; you’d be crazy to take this course with any other professor. I’ve signed up to have ENES102 with him next semester. ", "rating": 5, "expected_grade": "A", "created": "2020-12-24T17:23:48Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Very enjoyable and interactive class, despite being online during the pandemic. Mike's videos and lectures are both entertaining and informative, and he often responds quickly to questions.", "rating": 5, "expected_grade": "A", "created": "2020-12-26T21:06:31Z"}, {"professor": "Isabel Lloyd", "course": "ENES100", "review": "Dr. Lloyd is a nice, friendly, and easy-going professor. However, going online proved challenging to her as the TA had to do most of the technical work over Zoom. The class is very straight forward, simple participation questions, quick homework, and in-class assignments mainly completed in groups. The entire class is group-oriented so you will never be alone or stuck if you have a question.\r\n\r\nSometimes the homework may include topics that were not covered in depth in class which makes them difficult, but if you go to any Office Hours you will find your answer. My one critique for Dr. Lloyd would be she may respond to emails really fast or sometimes awhile, and that she always goes on small tangents about her life and past family issues. ", "rating": 4, "expected_grade": "A", "created": "2020-12-30T00:54:43Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "Kevin's an extremely approachable guy and you can tell he loves what he does. He was always adamant that if we do good work, the good grades will follow.", "rating": 5, "expected_grade": "A+", "created": "2021-01-12T19:40:24Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "He is very disorganized. He is calm and has good intentions, but when it came to Arduino, he barely explained it and blamed our not being able to learn coding on the \"virtual environment.\" I went into his office hours for questions, and explained how I was struggling with coding (I have ZERO experience and this class kinda uses it second half) and he tried to write it off as I \"wasn't putting in the work\" and that \"as an ENGINEER i need to do things myself.\" He also said comments like this directed to me in class. I felt pretty disrespected. Once I brought my concerns to him again in office hours two days in a row, I PROVED to him that we couldn't do a temp sensor because we didn't even have that piece in our electronic kit. In yo face. Don't be so rude, dude!\r\n\r\nAnother problem was the ASSIGNMENTS. EVERY SINGLE TIME something was posted there was ALWAYS an issue with it. Literally. I had to email TAs and Dr. D continuously. Statements were unclear. Deadlines got switches. New rules announced days beforehand. It was annoying. I did a whole assignment and they decided it wasn't going to be graded and forgot to tell us.\r\n\r\nOverall, he is very chill... maybe too much. Class was very boring with little work. I feel like I got nothing out of it. The students in there were kinda uptight too. Dr. D is ok at lectures and keeping student interest. I wish we had more EXCITEMENT and FUN and learning to actually code!", "rating": 2, "expected_grade": "A", "created": "2021-04-02T03:45:58Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "Very nice professor and very accomodating. This class will be easy for most engineering students and points are largely given for completion rather than quality. There are a few assignments for which students unfamiliar with Arduino or material failure may need to look up some coding/wiring help or some formula, but this is allowed in this class and is very easy to do", "rating": 5, "expected_grade": "A+", "created": "2021-04-25T15:13:18Z"}, {"professor": "W Ethan Eagle", "course": "ENES100", "review": "This class can be summed up as a total waste of time, he of the most disorganized engineering professors I've had. The first half of his class actually went quite well, with him laying out what he would be teaching as well as a plan for each class. As we approached the second half of the course however, which was more project based, he constantly changed his requirements for projects and told different groups different things. Because of this, his class ended up being much more stressful than it should've been, with specifications for many assignments being contradictory - his canvas page would say to make a powerpoint, but then the rubric would ask for a word document. Halfway through projects, people would have zero idea what Professor Eagle wanted at all - he would send us a set of specifications but then completely disagree with it in-class. It's completely unreasonable for him to expect us to work \"40 hours in a month\" on just the projects for this class, especially when much of it is spent making useless progress update powerpoints every other class and he himself can't even be bothered to update his assignment pages to be more clear. You can learn just as much in ENES100 with another professor, without having to deal with Prof. Eagle's passive aggressiveness and disorganization.", "rating": 1, "expected_grade": "A", "created": "2021-05-08T17:03:42Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "He's great. Very accommodating, patient. Arduino coding was a challenge for the less experienced and the projects were annoying but he always tried to help. We had a hard time with our code for an assignment, and him and the TAs were very patient and walked us through it until we got it to work. He does put some focus on being able to troubleshoot issues and do your own research to solve problems, but he's also available if you are really stuck. ", "rating": 4, "expected_grade": "A+", "created": "2021-05-10T16:28:16Z"}, {"professor": "Taylor Myers", "course": "ENES100", "review": "He's awesome! Very nice and made ENES100 fun.", "rating": 5, "expected_grade": "", "created": "2021-05-21T17:38:07Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "This class would’ve been better in person, but like many have said there was nothing Dr.D could do about it. I really enjoyed this course and he was a great professor who genuinely cares about his students. If you can get him, I recommend taking this course with him. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-22T15:03:24Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "This class is very relaxed, and I personally didn't learn anything from it. That said, Dr. D is the most caring professor I have had at UMD, and wants his students to succeed. He pushed deadlines and worked one-on-one with students to help them if they needed it. \r\n\r\nHe was also a bit disorganized, and it was hard to know what needed to be done and when, but Dr. D and the TA's were very understanding about this and ultimately it didn't affect much.\r\n\r\nReviewing the class, it was a bit unexciting and and the 4 hours a week that the class met wasn't fully necessary. Dr. D was a nice professor though, which made the class more manageable. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-27T18:03:42Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike creates great videos to help keep you engaged in the content. He also gives grate feed back, is accessible outside of class, and is eager to communicated with his students. Great teaching style. %100 recommend you take what ever classes you can with Galczynski.", "rating": 5, "expected_grade": "A", "created": "2021-08-29T19:43:35Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike was an amazing teacher. He was very clear in all descriptions for assignments. He grades based on the efforts you put in. If you BS, you will get BS back. He encourages participation and works to ensure that all students understand the material. Even if it takes him 8 hours to video edit for the class.", "rating": 5, "expected_grade": "A", "created": "2021-08-29T23:11:55Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is a truly special instructor. He is extremely knowledgeable and is able to teach course material with great enthusiasm which undoubtedly rubs off on his students. In my opinion, his online lectures are the highlight of the course. They are thoughtful, entertaining, and a breath of fresh air in an online environment. The course material is easy to understand and if you have questions Mike is always there for help. He is also quick to recognize hard work and will reward you for it. I could not recommend taking one of Mike's classes more. He is one of the greats. \r\n\r\n", "rating": 5, "expected_grade": "", "created": "2021-09-08T00:03:14Z"}, {"professor": "Isabel Lloyd", "course": "ENES100", "review": "Dr. Lloyd can come off as very talkative and somewhat friendly during her classes, but she constantly brings up completely random stuff out of nowhere and goes n random tangents of irrelevant things of her life or one of her multiple ex-husbands or family members and does not really do a good job at teaching or reviewing the materials. The TA does a lot of the work for her and is the one that people go to for help and explanations because while some students are trying to learn the concept she would still be rambling about her \"Years of experience in the field\" rather than teaching it. The class is mainly group-oriented along with the occasional quizzes, so if you get placed into a good group, and have a decent TA, you'll be fine", "rating": 1, "expected_grade": "A-", "created": "2021-10-11T03:58:57Z"}, {"professor": "Isabel Lloyd", "course": "ENES100", "review": "She is the worst teacher, professor, and UMD employee I've encountered so far. She is extremely talkative and boring, always mentioning her son, ex-husbands, and her experience in engineering classes from 100 years ago. Her boring voice and teaching style makes it difficult to pay attention during lectures and lessons. Her anecdotes and dreadful stories go on forever and keep students from working on their project. She is terrible at answering questions and students are forced to hesitantly nod there head and walk away after asking three times for clarification. She expects students to have perfect assignments, milestones, and projects with no guidance at all, so be prepared to do a ton of research on your own and come into this class with knowledge of circuits and Arduino. This class itself is very poorly structured and laid out time-wise, but Dr. Lloyd makes it so much worse.\r\n\r\nDo everything you can to avoid having Dr. Lloyd.", "rating": 1, "expected_grade": "B", "created": "2021-11-22T17:22:18Z"}, {"professor": "Jackelyn Lopez Roshwalb", "course": "ENES100", "review": "I came into this class expecting a good professor due to her rating (4.5 at the time of this review). Boy was I wrong. If you look at the dates of the reviews, you will notice that the time of the reviews are both during COVID, specifically online school. Roshwalb is by far my worst professor this semester. Not only is she blatantly unfair in grading compared to the other professors, but she also makes the OTV project so much more painful than it needs to be. Although her quizzes are easy, they are by far outweighed by how much more difficult she makes the OTV project.\r\n\r\nUnfair grading example: The OTV project is split up into various pieces, called Milestones. For multiple milestones, she blatantly graded unfairly compared to other professors. Like in Milestone 6, where another professor gave everyone a free 25% of the grade (1% of the overall grade for the class), while Roshwalb did nothing of the sort, with the class getting a 3.3/6 on average. Btw, that 6 is 6% of the overall grade.\r\n\r\nTL:DR, she is a bad professor, don't trust her rating. This review isn't just some salty flame of her after doing bad in her class, I am doing quite well in it. It is just annoying how much more time and effort people in my class have had to put in to get the same grade as someone with a different professor. Don't take her unless you have no choice, it's not worth it.", "rating": 1, "expected_grade": "A", "created": "2021-11-23T17:15:22Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "He is a nice guy but he is truly one of the worst teachers I have ever had in my life. The man does not help you with your project at all, and he makes us do the most irrelevant work and grades it so harshly for no reason. Acts like ENES100 is an academic writing class every time we have to write anything and it gets to the point where you can't stand him. Stands around idly every class period doing absolutely nothing I have no idea how he does not get bored.", "rating": 1, "expected_grade": "B+", "created": "2021-12-14T20:31:11Z"}, {"professor": "Richard Blanton", "course": "ENES100", "review": "Prof Blanton was literally one of the nicest professors I've ever had. He always asked for feedback on his teaching and always took into account what students said. He extended many due dates and was ready to help with whatever he could. He let us do quiz corrections for half credit and was beyond fair and generally very generous with his grading. His expectations were very clear and he helped and encouraged students to meet them. Literally the best professor I've had so far. I wasn't familiar with Arduino coding which we were using in the class, so I went to office hours before our coding quiz and he spent two hours helping me learn how to and gave me a really good confidence boost for the quiz the next day. ", "rating": 5, "expected_grade": "A-", "created": "2021-12-15T22:56:58Z"}, {"professor": "Richard Blanton", "course": "ENES100", "review": "Throughout the semester, professor Blanton has been incredibly helpful to our team. He has always given and taken feedback, and has been remarkably understanding when it comes to due dates. ENES100 is a project-based class on a very tight schedule, but professor Blanton helped with the deadlines quite a bit. He is very knowledgeable about the subject matter, and helps teams troubleshoot their issues. I would definitely recommend taking his course, I think everyone learned a lot.", "rating": 5, "expected_grade": "A", "created": "2021-12-17T03:40:33Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "Nice guy, but a very harsh grader when it comes to writing. He's helpful when trying to give ideas to your team. When comparing his grade data to other ENES100 professors, it is clear that he gives out much fewer A's and that I find that slightly unfair because when registering each section has TBA listed as the prof and you just have to get lucky.", "rating": 2, "expected_grade": "", "created": "2021-12-19T15:21:27Z"}, {"professor": "Wesley Lawson", "course": "ENES100", "review": "Lawson is a pretty chill guy, who tries to teach the course at a pace that actually helps you learn the material without feeling pressured by the deadlines.\r\n\r\nHowever, when it comes to teaching the course itself, I would say the TA was more of a professor than Lawson. \r\n\r\nStill, he's a pretty chill guy and I did enjoy going to this class.", "rating": 4, "expected_grade": "A", "created": "2021-12-21T01:49:56Z"}, {"professor": "W Ethan Eagle", "course": "ENES100", "review": "If I could give a zero I would. Anyone who tells you that you need to just put in the work is obviously lying, Eagle graded you based on how much he likes you and there is essentially no rubric for any assignment as he changes it last minute. He is the most laziest teacher and you will not know your grade until the very end of the semester. AVOID HIM AT ALL COSTS.", "rating": 1, "expected_grade": "B+", "created": "2021-12-22T16:24:48Z"}, {"professor": "W Ethan Eagle", "course": "ENES100", "review": "Professor Eagle seems really cool at the beginning of the semester. Once the building phase of the OTV started he never really helped any of the groups in the class. Asking Professor Eagle for help he always gave a very brief and vague response that never really helped. If you are given a bad group you will have a hard time throughout the class.", "rating": 1, "expected_grade": "A", "created": "2021-12-25T23:45:19Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "This class is very relaxed. He was a chill and kind professor. Dr. D did his best online and made the class time enjoyable. ", "rating": 5, "expected_grade": "A", "created": "2021-12-27T03:01:38Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is an awesome guy!\r\n\r\nI love his teaching style and sense of humor. He got great video editing skills and ofc baking skills! This class is quite a lot of work so don't underestimate it cuz it's 100 lvl. But Mike was there for students at all times. He is very understanding and was not too strict on deadlines as the class was pretty fast-paced.\r\n\r\nThe only tip I can give future ENES100 students is, don't slack off!\r\nAnd make sure to stay on top of paperwork, not just the project!\r\nYou will have to spend extra time in the lab to make sure that your OSV moves before each deadline. It is what it is.\r\n\r\nIf you try your best you will get the grade you want and a good end of semester pizza party ;)\r\n\r\nsincerely,\r\nGreen Goblin\r\nFire Team (THE BEST PERFORMING SECTION OF ALL ENES100!!!!!!)", "rating": 5, "expected_grade": "A+", "created": "2021-12-30T05:38:07Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is very personable and energetic. ENES100 is basically a giant group project and he gives his students a lot of support and advice for how to succeed. Our group was struggling a lot near the end and he took the time to help us redesign parts of our OTV. Make sure you ask him and the TFs questions because they have a lot of useful knowledge and are always happy to help.", "rating": 5, "expected_grade": "A+", "created": "2022-01-04T18:03:47Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is an amazing teacher and always happy to help! Incredibly easy going and chill (that's not to say he's an easy grader, so make sure to still put effort into all your assignments)!\r\nJust an overall great professor and person, you should definitely take him!! \r\nHe also gives a lot of opportunities for you to do well in the class. Apart from providing you with the material you need to succeed, he also offers a lot of extra credit so take advantage of that! ", "rating": 5, "expected_grade": "A", "created": "2022-01-07T17:06:29Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is a truly special professor. Almost all of the reviews you read about him are spot on. He loves to teach, and you can tell by listening to just his first lecture. Mike has tons of knowledge to share and is always willing to lend a helping hand, no matter the time. Even better, Mike loves to bake and brings treats into class. \r\nWhile the course itself was time consuming and sometimes frustrating, knowing that you could always go to Mike for help was very encouraging. In addition, Mike turned many of the boring, lengthy assignments into shorter, easier assignments. He even offered numerous opportunities for extra credit (So take them!).\r\nFor someone who is looking for not only an A, but also a fantastic classroom environment, Mike is the way to go. His laugh is infectious and he's an all-round great person and professor. Do yourself a favor and take Mike!", "rating": 5, "expected_grade": "A", "created": "2022-01-12T23:09:11Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike deserves an extra star. I have heard so many engineering students with other professors saying they wanted to drop engineering because of this class alone, but any student who has witnessed just one of Mike's lectures would know that engineering is an exciting place to be. Mike brings his positive energy everywhere he goes and you can tell how passionate for teaching. He is also incredibly knowledgable and if you ever have a problem, he will almost surely be able to solve it. He can take a complicated topic and explain it to someone who has never heard of engineering in their life. \r\n\r\nIn ENES100, you get to apply yourself and watch your ideas come to life. Don't hesitate to ask your UTF or peers for help, this is an introductory class so make sure you take advantage of the learning opportunities. If you want to be successful in your project, I recommend alotting a decent amount of time on testing and editing code.  Time will catch up with you before you know it. Also, try to keep things as simple as you can but be creative! ", "rating": 5, "expected_grade": "A", "created": "2022-01-16T18:51:04Z"}, {"professor": "Wesley Lawson", "course": "ENES100", "review": "ENEE100 requires a lot of time and energy, and Professor Lawson made the experience more fun. He's witty and a good lecturer. Definitely will take him again.", "rating": 4, "expected_grade": "A+", "created": "2022-01-23T00:08:58Z"}, {"professor": "Jackelyn Lopez Roshwalb", "course": "ENES100", "review": "Prof. Roshwalb wants all of her students to succeed. She is very willing to offer advice and guidance throughout the creation of your autonomous robot. Prof. Roshwalb is upbeat and very knowledgeable. Her homework assignments help to keep your team on track. Be prepared to go to ALL of the open lab sessions (start early if possible)!", "rating": 5, "expected_grade": "A+", "created": "2022-01-23T17:16:09Z"}, {"professor": "W Ethan Eagle", "course": "ENES100", "review": "Honestly I think that a lot of the people who are complaining did not actually pay attention in class. Ethan was a great professor and if you actually asked him or emailed him about anything you would get a clear, timely response. That being said, lots of his grading methods were wishy washy. Usually you couldn't tell if you were going to get an A or not. However, I did notice that pretty much everyone who actually put in effort did well in the class. He taught useful skills and I would take this class again if I could.", "rating": 5, "expected_grade": "A+", "created": "2022-01-24T15:43:35Z"}, {"professor": "Mohammad Ali", "course": "ENES100", "review": "Fun introductory class, improves teamwork skills.  Cool teacher, one of my favorite classes from the previous semester.", "rating": 4, "expected_grade": "B+", "created": "2022-01-25T16:33:08Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "Peter is a nice person, and the assignments are easy, but the first two quizzes will melt your brain. Nobody on the first quiz got a 10. The last arduino quiz is very easy though. He is easy on you at first on the milestones, but eventually becomes tougher, and he does not like to push back milestone assignments like a few of the other ENES100 professors. What is listed is the due date. Sometimes I don't know if he's an English professor or an engineering professor. Tiny formatting errors will dock huge points on written reports. Sometimes the advice given is not practical cost-wise. He ultimately curved many people down (as well as me), contradicting everyone's statements that this class would be an easy A. Find another professor if you care about your grade. \r\n", "rating": 2, "expected_grade": "B", "created": "2022-02-04T05:46:59Z"}, {"professor": "David Kriesberg", "course": "ENES100", "review": "Very nice professor and is always there to help. He is very responsive to emails and is always hoping for the best for his students. ", "rating": 5, "expected_grade": "A+", "created": "2022-02-10T21:58:25Z"}, {"professor": "W Ethan Eagle", "course": "ENES100", "review": "AVOID THIS PROF AT ALL COSTS, Eagle was terrible when it came to trying to teach students about the necessary things that we needed for the course. The TA for my class practically carried that class and helped out more in the long run than what ever Eagle was teaching. Terrible teacher.", "rating": 1, "expected_grade": "A", "created": "2022-03-16T01:43:12Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "great prof! nuff said", "rating": 5, "expected_grade": "A+", "created": "2022-03-28T17:58:26Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is one of the best teachers I have ever had. The passion he has for the class and the energy he puts into teaching is incredible. Because of the difficulty of the class project, it is important for the professor and TA to be able to help the students when they run into an inevitable snag. Mike did this and then sum. Without asking, he would give the class hints for how to code for their OTV, or possible design ideas to help us in the design process. He was a fantastic professor and I would recommend him to anyone taking this course.", "rating": 5, "expected_grade": "A", "created": "2022-05-09T16:51:54Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is a very passionate professor and is truly one of a kind. I don’t think I will ever have a professor who is as interesting and knowledgeable ever again. You can tell he loves to teach, and every class period he came in with the same infectious up beat energy and dedication to helping us succeed. The class itself is not the easiest because you are essentially thrown into a major project that requires creativity, electrical wiring, building, and programming with little to no experience, but being in mike’s section definitely turned the difficult class into a fun and memorable experience that I will remember for the rest of my engineering journey and life. He was always very helpful in helping each team when we ran into design issues and strongly encouraged creativity in his classes. He also fuels education with his signature lemon bars. If you have the opportunity, choose mike’s section!", "rating": 5, "expected_grade": "", "created": "2022-05-16T06:22:30Z"}, {"professor": "Jackelyn Lopez Roshwalb", "course": "ENES100", "review": "Roshwalb is super for this class. While ENES100 is a stupidly hard class, especially if you get a bad group, she makes it bearable. Just make sure to communicate, because she won't reach out too too much. Honestly I talked and got help way way more from the TFs. \r\nHonestly we all know this class should be worth at least 4-5 credits, but try if you can to get one of the good profs, including Roshwalb. It is very easy to get a high grade, just prioritize assignments over OTV progress, since the former is worth much much more. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-20T21:27:02Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is an amazing teacher, no question about it. Every day in class he comes with an incredibly positive attitude and is genuinely very excited to be with us to teach us course material. Even if I may have had a bad day, going to his class cheers me up entirely. He has made the class so fun and interactive because of his enthusiasm. He also knows how to challenge us every day in class, as he makes us think about solving problems in a new way when it comes to completing the ENES100 project, which is to make the OTV work. He has also been greatly supportive of all our ideas as students trying to experiment with the concepts we learned in class as we built our OTV. Every day in class he shows up and checks with us to make sure we are all on track, working with us on how we can improve our ideas and move to the next steps. In addition, I, like many other ENES100 students, believe that this class is oftentimes difficult and can be stressful at certain times, either because of the workload, or because of having to deal with the frustration resulting from something not working. As such, I do not believe that just any engineering professor would have the skill to teach this class. Mike is one of the few people who truly has that ability, and I think that it is partly because of him that our section won the competition. He has really been amazing in so many ways, and if it were not for the 5 star limit, I would give him 6 stars. That is how great he was!", "rating": 5, "expected_grade": "A+", "created": "2022-06-06T14:44:01Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is an incredible professor, and is probably one of the best educators I have had in my entire career as a student. Mike is the master of using fun metaphors to explain rather complicated concepts and topics, and he makes you feel smart just by listening to him. His scores for the group project are far far higher than the other sections of the class and for a good reason. THIS DUDE IS A LEGEND", "rating": 5, "expected_grade": "A", "created": "2022-06-06T17:46:31Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is such an amazing professor and undoubtedly the best professor/teacher I've ever had in my entire academic career. His lectures are actually fun to sit through, something that is pretty rare to find nowadays. Mike combines his lessons with an incredible amount of humor that I found kept me thoroughly engaged and actually looking forward to class. Not to mention, it's obvious he cares about each and every one of his students, and will go miles out of his way to ensure his students find success. If you can, please take any of Mike's classes and I promise you're going to enjoy it. Also, don't miss his end-of-semester Wisdom Lecture!!", "rating": 5, "expected_grade": "A+", "created": "2022-06-07T00:51:54Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike genuinely cares about each and every one of his students. You really do get out what you put into his class, so work hard and always ask for help. His lectures are always full of great stories and are very informative--make the two hours fly by! He has lots of group activities to have you get to know your team better and make great friends!", "rating": 5, "expected_grade": "A+", "created": "2022-06-07T01:45:32Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "THE RATING IS ABSOLUTELY CORRECT. Professor Mike is without a doubt one of the best professors I've ever had. His lectures are extremely enjoyable and interactive, he can easily explain harder concepts in a way that everyone understands. He communicates so well with students and gives amazing life advice, and just makes a very interesting and interactive environment to learn in. DEFINITELY WOULD TAKE FUTURE CLASSES WITH HIM IF I COULD. highly recommend fitting professor Mike in your schedule if you can.", "rating": 5, "expected_grade": "A+", "created": "2022-06-07T04:11:41Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "If you are looking for a fruitful experience Mike is definitely the professor to go with. His ability and knowledge shows in how successful his teams are compared to other professors. This class is basically a big group project meant to give you experience in many aspects of engineering. Mike promotes a social and engaging atmosphere early on. So, whether you're nervous about working on a team or have no prior experience in engineering related skills. Mike operates and provides the means for you to be successful if you want to be. ", "rating": 5, "expected_grade": "A+", "created": "2022-06-08T00:16:48Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is such a fun teacher to have I cannot say enough good things about him (plus he would bake desserts for us). ENES100 is a class where you will only get as much out as you put in, and Mike really encourages us to think outside the box. Overall, take Mike for any class you can, he is one of the rare professors where you can really tell how passionate he is about teaching", "rating": 5, "expected_grade": "A", "created": "2022-06-08T01:12:11Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Such a cool and honest guy! Mike truly wants all of his students to succeed. Without him, I still wouldn't understand coding and Arduino circuits. I promise if you take Mike's Class you won't regret it! Mike taught us that engineering is more than just math and science, and that's what motivated to remain at the Clark School. You will forever remember his funny stories, lectures and energy!", "rating": 5, "expected_grade": "A", "created": "2022-06-08T03:24:26Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Professor Mike is an amazing professor who is truly passionate about the engineering and design process. His energy during every class session motivated my team and I to work as hard as we could. Professor Mike is also helpful, easy to talk to, and very considerate of everyone's particular situation. Professor Mike also pushes us to do our best in anything we do. ", "rating": 5, "expected_grade": "A+", "created": "2022-06-08T17:37:22Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is the best professor I've taken so far. He's very kind, knowledgable, and always makes class fun and interesting. Nothing but great things to say, if you see him for ENES100, take his class.", "rating": 5, "expected_grade": "A", "created": "2022-06-08T23:03:01Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Enroll in his section, I beg you. It's truly a life changing decision. It was more or less by chance that I ended up in his class, but I am forever grateful for it. Mike is deeply passionate about engineering and cares about his students very much. He is often more like a friend than a professor and I really appreciated that dynamic.", "rating": 5, "expected_grade": "A", "created": "2022-06-10T23:58:33Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "BEST professor. Inspired me to become an engineering major. I came into ENES100 with no prior experience with any engineering concepts; Mike made such a wonderful environment where we all learned from each other and friends with all of your classmates. He is a fair professor and a true mentor. He makes great baked goods so you'll be fed too!!", "rating": 5, "expected_grade": "A", "created": "2022-06-11T16:50:21Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike was an excellent professor. He really took the time to design the class to be as immersive as possible. I never felt like I was doing busy work or wasting my time, I always felt like I was learning. I had a lot of fun in this class, even though the task at hand was very difficult. Truly recommend taking his class!!!", "rating": 5, "expected_grade": "A", "created": "2022-06-14T15:47:00Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Very fun class and THE prof to take for ENES100. You will get the most out of this class with Mike as your prof and have fun doing it. He could be a comedian so it is a very entertaining class. Most entertaining and caring prof I will probably ever have. Also, easy class. You learn a lot. Extra credit. He brings in homemade baked goods too!", "rating": 5, "expected_grade": "A", "created": "2022-06-14T20:15:20Z"}, {"professor": "Amy Karlsson", "course": "ENES100", "review": "Dr. Karlsson has been a great teacher for ENES100. This was her first time teaching it but she knew her stuff and prepared for it. Her grading for major project presentations could be harsh at times, but she always made her expectations very apparent to the class. Expected a lot from you but was always willing to help you learn as long as you tried.", "rating": 5, "expected_grade": "A", "created": "2022-12-01T21:15:36.908800Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "Dr. D was great for ENES100. Helpful, taught the few bits of necessary material well, and a fun guy.", "rating": 5, "expected_grade": "A", "created": "2022-12-08T19:06:00.771802Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "The man to take for ENES100. The class over all is an easy A as long as you do the assignments in the first half of class and show up (which is easy because Mike is the GOAT) you will do good. The difference between Mike's section and all the other sections is that you get so much more out of this class if you have Mike. Towards the end you might need to spend a decent amount of time in lab hours with your team but the environment Mike creates makes that easy.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T04:04:00.350965Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Extremely good professor for ENES100, and should definitely be a primary choice. The first half of the class is pretty straightforward and there's never a boring moment in his class as he's always very energetic and engaging. There's also a lot of easy extra credit you can earn and the assignments are very forgiving. For the second half of the class, building the OSV was extremely fun and I definitely learned a lot. Mike was extremely helpful in answering any questions you may have and for any troubleshooting you may have to do.", "rating": 5, "expected_grade": "A", "created": "2022-12-12T19:43:22.447270Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "I highly recommend taking any class with this professor. He is so understanding and accommodating that made ENES100 extremely fun. There are no exams and the assignments are simple enough if you put in some time and care. Dr. D can be a little slow answering emails but I feel like he puts in a lot of effort to do well and takes the time to get to know his students unlike MANY teachers at UMD. He punched us with the OTV and we were ultimately graded on our process and not the result ( which was good cause my otv failed). I thought of this class more as a fun club and not work.  I did not learn the most in this class but still had a fun time.", "rating": 5, "expected_grade": "A+", "created": "2022-12-15T04:41:53.512418Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Literally the best professor I have ever had for anything. Mike has changed my life and I would genuinely recommend switching your entire schedule around just to have him. He built such a great community for ENES100 and created a class culture that was collaborative, and extremely successful. All of his sections score highly every single year because of the way he runs his class. Expect baked goods and lots of stories if you take his class. He puts so much time into his classes and caring for his students which is unlike any other professor I've seen before.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T03:31:09.822512Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Couldn't ask for more. Greatest enes100 teacher ever. Honestly probably one of the best professors as this school. I will be taking his 102 and any other courses he teaches.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T17:35:02.535096Z"}, {"professor": "Peter Sunderland", "course": "ENES100", "review": "Peter was not a great professor. He was not able to answer some very important questions when it came to building and coding the robots. He relied completely on the TF and never had good criticism. He was lazy, boring and unhelpful. I would not recommend taking his course. Take someone else.", "rating": 1, "expected_grade": "A", "created": "2023-01-08T00:52:14.734951Z"}, {"professor": "Joshua Cocker", "course": "ENES100", "review": "Josh is very nice but he is a hard grader. He expects a lot on his assignments without telling you any requirements. An A will probably be hard to get from him as the Milestone assignments he grades hard and they are the majority of your grade. Just hope you have a good group for the semester.", "rating": 4, "expected_grade": "A", "created": "2023-01-09T14:49:54.585460Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "Really nice guy. Really cares about the students. Definitely an easy course to get a good grade.", "rating": 5, "expected_grade": "A", "created": "2023-01-17T05:31:27.166246Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "mike is the man the myth AND the legend all in one. he is the cultivator of the most brilliant minds in the engineering school, as well as supportive of all the dumb ideas that we could come up with during this class. for the osv project some teams came up with greatness like creating lightning mcqueen and amazing class shirts/team bonding materials.", "rating": 5, "expected_grade": "A+", "created": "2023-01-22T07:02:17.406134Z"}, {"professor": "Kevin Cheng", "course": "ENES100", "review": "God given human form, I’d die for this man", "rating": 5, "expected_grade": "", "created": "2023-04-23T02:14:33.660364Z"}, {"professor": "Dillon Capalongo", "course": "ENES100", "review": "Very helpful with the projects. I attribute Dillon to obtaining my summer internship, incredible TF", "rating": 5, "expected_grade": "A", "created": "2023-04-23T02:15:14.858423Z"}, {"professor": "Joshua Cocker", "course": "ENES100", "review": "Good professor, would recommend for ENES100.", "rating": 5, "expected_grade": "A+", "created": "2023-05-03T18:14:34.150820Z"}, {"professor": "David Kriesberg", "course": "ENES100", "review": "Not a bad professor or person to take the class with and not as harsh as some other profs", "rating": 4, "expected_grade": "A", "created": "2023-05-05T07:12:55.798160Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Note that I love Mike as a person, and think he’s a wonderful, enthusiastic person. He makes learning incredibly fun, really brings up the class spirit, and really makes you get to know your classmates. However, I have had a couple issues with him this semester. Primarily, his grading, or lack of it- he still hasn’t graded assignments due in February, so I don’t actually know what my grade in the class is. Second of all, he has had some issues releasing assignments, assigning them to the right due dates, etc. \r\nFor example, about halfway through the first half of the class (the class is split into a “crash course about lots of things” and then “work on massive group project”), he pushed all our homework back by half a week. Except all the homework’s were still due in Elms the same time his posted schedule had them due, both of which were wrong, and had you panicking to do homework we had not been taught how to do yet.\r\nAlthough I will say I know Mike really worked hard to simplify a lot of the homeworks, which I am also really grateful for.\r\nAnother downside is that sometimes when you get to the team project part, you can ask him a question, and he’ll just answer something that is not in relation to your question/fixing the opposite of your problem/checking something you’ve already checked but ignoring you when you say you’ve checked it, etc.\r\n\r\nHowever, in terms of the class itself, the class SUCKS. Mike makes it as good as he can, but the class is a massive time suck (easily 12+ hours on average, occasionally getting to 15+ a week). There’s “open lab” hours which are the only times outside of class you can work on your project, but if they’re during class, oh well. I have skipped class, I dropped all my clubs, and significantly dropped my social life. And yet most of my team was actually helpful. I can’t imagine getting a bad team. I still haven’t started studying for any of my exams because I have spent about 20 hours on the project in the past week. If you can avoid this class, DO NOT TAKE IT!!! You get lots of “learning experience” but it only matters if you’re an engineering student (ignoring that the project has little/no correlation with majors like bioengineering, chemical engineering, etc). And most of that experience is “it worked right yesterday, but didn’t work today. Why? Who knows. Maybe it’s the vision system?” (The vision system is another monster of this course- an extremely buggy system created by UTFs that only works about half the time, makes you write convoluted code in order to do anything, etc)", "rating": 4, "expected_grade": "A-", "created": "2023-05-10T05:14:41.236180Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Outstanding professor! Mike was one of the most excellent professors I have ever taken. He brings a signature package of enthusiasm to every class, and genuinely wants to see you succeed. To that end, he awards class achievement with snacks, drinks, pizza, and home-baked desserts, and is always excited to see how your team is performing in-class. Mike releases an arsenal of high-quality lecture videos which are unrivaled by other instructors, and his in-person instruction is hardly uneventful! \r\n\r\nMike is definitely a 1-in-100 unicorn at UMD. If have the opportunity to take Mike for any class, go for it!", "rating": 5, "expected_grade": "A+", "created": "2023-05-11T18:37:43.163854Z"}, {"professor": "Catherine Hamel", "course": "ENES100", "review": "I don't really know why this class is one of the first classes you take as an engineering major. I get the idea behind it, expose us to hands-on learning right away, but the amount of information and things we need to know is insane. However, Catherine was so helpful in this class. She's probably the nicest professor on campus and is always available to help you with any issues you have from team management to engineering skills/calculations. She is extremely good at explaining things, and she made the best out of a poorly structured class. I'm extremely lucky to have taken her for ENES100, as she made my first year as an engineering major so much more fun.", "rating": 5, "expected_grade": "A", "created": "2023-05-12T00:56:18.903602Z"}, {"professor": "Kevin Calabro", "course": "ENES100", "review": "Kevin is an amazing professor and really cares about and engages with his students. He also did a great job in introducing the engineering design process at the beginning of the semester and following through with guidance as we moved towards spending all our time on the OTVs. He's also just a really cool and chill guy and knew when to give heavy guidance and when to let us develop on our own.", "rating": 5, "expected_grade": "A", "created": "2023-05-14T21:56:25.126251Z"}, {"professor": "John Cumings", "course": "ENES100", "review": "Very accommodating professor and a nice guy. Always gave partial credit when your OTV failed to meet some milestone which was nice, and I felt like he really wanted us to do well. But he did feel a bit disorganized sometimes, and would ask the TF what was going on which was more funny than annoying, given the class that 100 is.", "rating": 4, "expected_grade": "A", "created": "2023-05-17T16:06:38.434913Z"}, {"professor": "David Kriesberg", "course": "ENES100", "review": "He’s there to help and provides great feedback. While his grading can be confusing at times, he recognizes the effort you put in, especially if your OTV ends up failing.", "rating": 5, "expected_grade": "A", "created": "2023-05-19T12:26:30.394786Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "The class was not great and I didn't learn very much. If anything, it made me hate engineering even more, but it was fun to work with my group on the project. Even though he doesn't teach a lot, Danielak is a nice person who will push back deadlines for the milestone assignments.", "rating": 4, "expected_grade": "A", "created": "2023-05-20T17:54:31.744708Z"}, {"professor": "Joshua Cocker", "course": "ENES100", "review": "Had Josh for ENES100 this semester. I found his teaching to be very helpful and his assignments to be fair. He truly wants what is best for his students and was always happy to help with any questions anybody had. He also kept lab hours open for longer than they were originally supposed to be just so a few groups of students could work on their projects longer. I think this reflects very positively on him as a person and professor, as he sacrificed his free time just for the benefit of his students. Would definitely recommend for the class.", "rating": 5, "expected_grade": "A+", "created": "2023-05-20T23:49:53.069308Z"}, {"professor": "John Cumings", "course": "ENES100", "review": "Cumings strikes me as the kind of guy who probably didn’t want to teach ENES100 but tried his best to seem enthusiastic about it anyway. He hadn’t taught the class in a while so he didn’t really know course procedures and relied on the TA a lot. Also, he WILL put you to sleep during his lectures. He definitely seemed to care about student concerns but didn’t really do a whole lot to resolve them. It seems like overall ENES100 is just a bad class and it doesn’t make a big difference which professor you have.", "rating": 3, "expected_grade": "A-", "created": "2023-05-24T04:02:49.508167Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "This guy is AMAZING!!! He is always available if I ever needed help. He made learning actually fun, too. He always made lectures interesting with all his funny stories and jokes. It is the little things that distinguish a really good professor from any. He is always willing to answer your questions anytime during class and outside. He is a very practical grader and offers so many resources in order for you to do well in his class. I also took him for ENES102H and he made that class WAY easier than I expected. So, I purposely took him for ENES100 as well. I would 10000% take him for another class if I had the chance to. If you ever get the chance to take his class, DEFINITELY DO!!!", "rating": 5, "expected_grade": "A", "created": "2023-05-26T02:57:06.353620Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "He is enthusiastic, friendly, hilarious, and a great baker. Answers questions thoroughly and will explain as long as it takes for you to really understand the content. I never felt stupid for asking a question in his class. Grades fairly, you'll get what you give!", "rating": 5, "expected_grade": "A", "created": "2023-05-26T13:23:40.934760Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "I actually changed my schedule last minute just to have Mike for ENES100, and boy was it worth it. He's awesome and genuinely cares for his students; you of course have to put in a good amount of work, but Mike makes it fun and helps you see the value in everything you do in the class (which was pretty big for me). Even though ENES100 has the reputation of tanking your grade if your OSV doesn't do well, Mike has a lot of extra credit and other opportunities to make up for it. He also puts a lot of emphasis on cohesive teamwork and team bonding which I thought was really awesome.", "rating": 5, "expected_grade": "A", "created": "2023-05-26T14:25:24.340992Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is part of a rare breed of engineering professors who care about students drastically more than whether the final calculations were correct and whether the product was successful. The process of becoming an engineer, working with others, and learning valuable skills was highly emphasized by his words and his grading. The team for ENES100 grew together throughout the semester. Even the people who did not hang out with each other much had fun on the project as a team. Our team ended up being fairly successful so feel free to take this with a grain of salt, but I think no matter how you end up doing on the project, as long as your team works well together and reflects on what went wrong/what can be improved, then your grade should be fine (my friends with other professors had much different experiences).\r\nFor ENES100, this is true with any professor, but try to come in during open lab hours. The professors expect the teams to come in outside of class; the teams that did the best always seemed to be there testing or building. But Mike does a great job of telling teams to take advantage of the lab, and his TA would be there constantly to help. His TA, Sierra Raspa, was AMAZING, probably the best TA I’ve ever had. Sierra helped me learn about all sorts of machinery, and designing, and just like Mike, encouraged me to pursue out-of-the-ordinary ideas. \r\nMike exemplified fun and togetherness throughout the semester. At the end of the semester, he held a big party with food inclusive of different allergies which I appreciated. He would give speeches to motivate us and would give extra credit for doing stuff with team members and classmates. I made a lot of friends just from being in his class, and with a different professor, I don’t think that would have still been the case. I’m truly grateful to Mike for making ENES100 an enjoyable experience where I was able to learn about so many facets of engineering like laser cutting, 3d-printing, video editing (with Adobe Premiere Pro to showcase the robot), coding collaboration, project management, and so much more. This class was the perfect opportunity to improve my weaker skills, and I encourage people to take advantage of the resources and tools in the lab.", "rating": 5, "expected_grade": "A+", "created": "2023-05-26T18:33:15.461542Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is an amazing professor. Not only a professor but as a human being. He often makes us forget that we're taking a course and make us feel that we're just having fun! He implements little stories and jokes in his lectures to make us remember the things he taught and to keep us engaged. He is the best professor that I have ever met in my entire life. Teaching his kids with passion and showing people that. I assure you that you will never miss a class if you take Mike!", "rating": 5, "expected_grade": "A", "created": "2023-05-27T23:52:41.280977Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike's an absolutely amazing professor. He offers extra credit and always made an effort to show how much he wanted every student to succeed! I had so much fun in his class and loved his baked goods AND his hilarious stories. He made every lecture interesting and was so helpful during the entire course. I'd definitely recommend taking him, I don't think it gets any better than him.", "rating": 5, "expected_grade": "A", "created": "2023-05-30T00:29:19.996728Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is a great professor who truly cares about the success of his students. He makes his lectures engaging and entertaining while also effectively covering the material. He provided great feedback and advice that ultimately guided me and my team toward greater success. While this class may be time-consuming at times, he made it an overall enjoyable experience by emphasizing things like team spirit and learning from design failures. I would definitely recommend this class with Mike.", "rating": 5, "expected_grade": "A+", "created": "2023-05-30T16:42:15.626675Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "He is mostly good but he doesn’t handle the group project part well", "rating": 4, "expected_grade": "A", "created": "2023-06-03T23:35:34.439938Z"}, {"professor": "Joshua Cocker", "course": "ENES100", "review": "Josh is great. Even if you can't get your OTV to do much, he will get you the grade you need. But that is only if you put in the effort and show him. Go to some office hours, and genuinely try on the OTV. He gives a decent amount of points back that you lose for OTV performance to make sure you get an A.", "rating": 5, "expected_grade": "A+", "created": "2023-06-05T00:58:14.563761Z"}, {"professor": "John Cumings", "course": "ENES100", "review": "He's a friendly guy and seems to like talking to the students. Early in the semester, he relied a lot on the TA to explain the course and his lectures were a little boring (probably the fault of ENES100 itself, not the professor). Only thing I didn't like was how he'd take off points for things that he never specified or asked for. For example, my team had a few points off for pictures being too small or the background of CAD drawings not being pure white. Grading on the final design slideshow was also a bit harsh but other than that, it wasn't too bad. There's a lot of small annoying assignements, like watching a video of machine learning and answering questions, watching 20 videos of Mike, worksheet for participation grades with new skill learned (Arduino, circuitry), end of semester reflection paper.", "rating": 3, "expected_grade": "A+", "created": "2023-06-07T18:10:24.902678Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike makes topics he teaches really interesting and engaging, so in turn easier to learn difficult topics. He also makes an effort to connect with his students which is really rare from what I've seen. If I could have any professor again I would pick Mike.", "rating": 5, "expected_grade": "A", "created": "2023-06-12T15:57:26.456781Z"}, {"professor": "Catherine Hamel", "course": "ENES100", "review": "You're going to have a great time, Hamel is the most encouraging professor you could ask for. The objective of the class is pretty intimidating, but it's not the end of the world if things don't go your way. Feedback is constant and positive, Catherine will always keep a smile on your face.", "rating": 5, "expected_grade": "", "created": "2023-08-26T23:19:00.497629Z"}, {"professor": "Isabel Lloyd", "course": "ENES100", "review": "She is a guessing game. You will be assigned a project but I promise you, your grade will not be good. You will do exactly what the rubeic says but when you receive your scores back, you will get points marked off for things that are purely based off of opinion and not her rubric. You will get marked for things that she just thought of in that moment. She will go off on tangents that seriously hurt the time needed to understand the important aspects of the class. I know more about her family tree than anything else. Also, I came into this class knowing most of the material, if you aren’t like I was you will be so unbelievably lost. She has little to no knowledge of whats at hand. Pray you have a good TA but even still that wont matter. The highest grade in the class as of now is an 82. Do anything you possibly can to avoid having this professor.", "rating": 2, "expected_grade": "B-", "created": "2023-10-11T22:01:55.172773Z"}, {"professor": "Joshua Cocker", "course": "ENES100", "review": "Josh Cocker is a cool dude. He is excited about engineering in a laid back way. He is knowledgeable and happy to admit when he doesn't know something, a skill many professors lack. He will magnify your energy for engineering. He will also let you make the design decisions you want to make in Enes100. He is young and hip and also very professional at the same time.\r\n\r\nSecond note - Josh is incredibly involved in the Enes100 program as opposed to some (not all, but a few) other professors who don't care about Enes100 and just do it because they are required to. If you can, pick him. (The person who says he is a hard grader doesn't know what they are talking about...)", "rating": 5, "expected_grade": "A+", "created": "2023-11-15T22:48:35.161376Z"}, {"professor": "Anna Fulton", "course": "ENES100", "review": "Anna was the best TA for ENES100 - always super helpful with troubleshooting and with where things were located in JMP. Definitely brought good energy to class - for Halloween her, Mike, and his other TA performed Katy Perry's shark halftime show.", "rating": 5, "expected_grade": "", "created": "2023-11-29T01:04:50.819525Z"}, {"professor": "Joshua Cocker", "course": "ENES100", "review": "Josh is a great professor and definitely one of the best for ENES100. He is very young and laid back but is also super knowledgeable at the same time. He is very relaxed with grading and takes a while to grade stuff but he is not a hard grader. He also lets you experiment with new design ideas for the OTV. The only way for his class to suck is if you get a bad group. But Josh is really nice and will generally get you the grade you need if you show him you are trying with the OTV. Overall he's great and would definitely recommend him for ENES100.", "rating": 5, "expected_grade": "A+", "created": "2023-11-29T16:33:43.182455Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "He's Just the goat. He keeps the energy in the class, telling jokes and interacting with the class. Overall he just makes the class exciting and engaging which keeps me motivated to go. He encourages us to do a lot of team building and spirit activities and gives extra credit for it. Overall just a great professor.", "rating": 5, "expected_grade": "A", "created": "2023-12-01T03:31:26.619189Z"}, {"professor": "Joshua Cocker", "course": "ENES100", "review": "Great teacher, genuinely interesting in the material and engaging. The class is a great time and a really good experience. you learn a lot of necessary time management skills. Josh does a good job of guiding and leading you and your team in the right direction. 100% recommend for ENES-100", "rating": 5, "expected_grade": "A", "created": "2023-12-04T18:01:40.922057Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "Didn't help very much in designing and fixing our robot, the TA definitely carried all the work my group accomplished in the class. Grades pretty kindly, and the grade in ENES100 is not based on performance, rather effort and completion. I would suggest taking the other professor though.", "rating": 3, "expected_grade": "A-", "created": "2023-12-07T19:15:15.594761Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "I don't even have Michael but his videos online are amazing. A teacher who genuinely cares about his job.", "rating": 5, "expected_grade": "A", "created": "2023-12-09T00:17:03.891771Z"}, {"professor": "Jarred Young", "course": "ENES100", "review": "Sat on his stool the entire build phase. Was asleep during initial mechanic lectures. Offered no feedback throughout semester. Very judgmental.", "rating": 1, "expected_grade": "A-", "created": "2023-12-09T02:33:48.384820Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "The professor for this class doesn't really matter, but he's pretty good. Very nice and he is helpful, but I was kind of confused and weirded out at the beginning of the class when he told us a lot of deep stuff about his personal life. Overall, I wouldn't mind having him again and the class is pretty easy, but you get out of the class what you put in.", "rating": 4, "expected_grade": "A", "created": "2023-12-10T19:27:00.949539Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "He is a nice guy, but I honestly don't think he has any idea of what is going on in his own class. The TA was mainly the one helping out during the OTV project while danielak basically just sat there. He likes to assign work without mentioning or explaining it in class and expects you to finish it. There's also this website he uses called catme and I would often get emails saying that I had to finish this survey, but it was never announced in class and I bet that less than 5% of his students did them. He is extremely lenient in grading, however, and always says that he completely understands if something doesn't work. (probably because he doesn't get it himself). If you actually want to learn a solid base for engineering cus this is an intro to engineering class, I would recommend a different professor.", "rating": 2, "expected_grade": "A+", "created": "2023-12-11T17:13:57.879926Z"}, {"professor": "Jarred Young", "course": "ENES100", "review": "He's a great guy but I'm not a big fan of his teaching and grading style. He does not give out any partial points for tests. He grades based on whether your answer is correct or not, meaning that if you don't get any of your answers right, the only points you would probably get are for a correct Free Body Diagram (FBD). His lectures are not helpful; while he gets to the point, he often skips through some of the content and the examples that show up on the homework. There's not much structure to his lectures, and they don't make sense a lot of the time because he won't be clear with what he's saying. When he tries to work through examples, he makes mistakes. I learned the majority of the content through TAs and friends.", "rating": 2, "expected_grade": "", "created": "2023-12-12T01:36:40.908575Z"}, {"professor": "Danielle Barker", "course": "ENES100", "review": "Dr. Barker:\r\nThis was Dr. Barker's first semester teaching this course, so it's sort of understandable that she wasn't well-versed in the content or intent of the course. She had a good TA that was able to offset her inexperience in this course, but Dr. Barker is qualified in the mechanical engineering field. She is however not super entertaining during lectures nor is she very forgiving with grading.\r\n\r\nENES100:\r\nThis is a course in which the first half you are \"learning\" the material through lectures and the second half you are building a robot to accomplish an assigned mission. You will likely pay around $50 per group member for robot parts. If you have no experience with CAD, Arduino, C++, electrical components/schematics, and/or fabrication (laser cutter, 3D printer, power/hand tools, etc.), you better hope that you are put with a good group. The lectures do not teach you in enough detail to actually put it to use in this course. I was fortunate to have experience with most of the content from high school, but my group was not the most experienced. The workload of this course is how involved you are in the project and how much work your group members take on. Not a bad course if you are lucky.", "rating": 3, "expected_grade": "A", "created": "2023-12-14T04:52:41.533830Z"}, {"professor": "Muzzamil Khan", "course": "ENES100", "review": "Muzzamil:\r\nMuzzamil is a great TA that is well-versed in the content and intent of the course. He is very forgiving with grading and a great resource throughout the course.\r\nENES100:\r\nThis is a course in which the first half you are \"learning\" the material through lectures and the second half you are building a robot to accomplish an assigned mission. You will likely pay around $50 per group member for robot parts. If you have no experience with CAD, Arduino, C++, electrical components/schematics, and/or fabrication (laser cutter, 3D printer, power/hand tools, etc.), you better hope that you are put with a good group. The lectures do not teach you in enough detail to actually put it to use in this course. I was fortunate to have experience with most of the content from high school, but my group was not the most experienced. The workload of this course is how involved you are in the project and how much work your group members take on. Not a bad course if you are lucky.", "rating": 5, "expected_grade": "A", "created": "2023-12-14T04:56:36.473180Z"}, {"professor": "Aris Cleanthous", "course": "ENES100", "review": "Oh my god I do not know where to even start. First off, I am so puzzled by his high review. This was his first ever time teaching this course, and It absolutely shows. This class isn't like most, it's a really big group project lab-based course, and Aris had absolutely 0 idea what he was doing. Firstly, he provided 0 help on anything that wasn't related to mechanics, which sucks because the hardest part of this class is using Arduino, wiring and coding. Anytime I would ask him for help he would reply with \"I'm not sure ask a UTF\" which meant our professor was non existent and simply was in class getting paid to ruin the lives of prospective engineers.\r\n\r\nThe worst thing: the grading. Oh. My God. The. Grading. It is absolutely horrendous. The group project in this class is essentially meant to be a failure due to it being an intro course, and it being weighed only 15 points. The instructors expect you to have 0 idea on what you're doing, but they compensate for this by having a lot of other easy assignments that are free points and worth a lot more. Not with Aris, absolutely not with Aris. He will dock off points for the most obscure things, even on the easy assignments, just to take off points. There were numerous milestones that were worth 80 points each, and I had lots of friends who received 75+ on them, but in our class, the average was a 64. This was a common trend among every singly assignment we had. He would contradict his own directions. For instance, he told us to have tons of ideas in place for our robot to show that we were brainstorming, but when we presented all of our ideas, he tells us that we need to finalize a design. like WTF. He also goes out of his way to change the rules. for one the milestones, we literally proved that our robot could do one of the tasks but he would not give us credit for it because the way we did it was too \"simple\". Is the point of engineering not to work smart, not hard? He also never explains what he takes off points for. on the rubric, he will simply right \"good\" or \"ok\" and then give us a 8/10 or something. This class is meant to be an easy A, but my group and I, we have never devoted so much time on a class and put in so much effort just to get absolutely pummeled by an old man from Cyprus. \r\n\r\nHe is a nice guy at heart, and I am guessing that in a lecture-based class he is a great professor, but he is absolutely atrocious in this class and I have never disliked a class so much. I never recommend him and if you are in his class for ENES100, I pray you have a good team.\r\n\r\nOur TF, Maguire Ballard, was an absolute goat. He would always be on our side and it was so obvious him and Aris were not on the same page. Our TF has been a ta for this class for 3 semesters, so he actually knew what he was doing. It's a shame he did not have as much leverage as Aris because man if Maguire could have been our professor, I would have loved this class.", "rating": 1, "expected_grade": "B+", "created": "2023-12-15T16:35:41.898518Z"}, {"professor": "Isabel Lloyd", "course": "ENES100", "review": "She'll take points off on big assignments with little to no explanation. Your team will do everything the assignment says and still get a bad grade. She doesn't know much below the surface about Arduino or anything you need to know for the course. Any time we would ask her a question she'd make some reference to her ex-husband, her family, or where she used to work, and then refer us to the TA. Basically none of what you learn in this class will come from her. A lot of the learning we did was on our own, but the class itself wasn't that bad. Most other professors for this course are really good, and I wish I chose one them.", "rating": 2, "expected_grade": "B+", "created": "2023-12-18T03:31:28.742457Z"}, {"professor": "Michael O'Neill", "course": "ENES100", "review": "I have got to say in all honesty, with all of the semesters I've been here, Michael has got to be one of the top TA's of all time. The dude is simply talented, he knows his stuff. On top of that, he knows how to teach it too! He's also very energetic as well, gotta love that personality. I wish he could be my TA again... but hey, at least I will get to see him around campus for the time being.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T17:09:20.298036Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "PROFESSOR: Great professor!! He is fun and engaging and really makes an effort to bond with his students. His sections have historically done better in the competition and I think that says a lot about him as a professor. He also offers plenty of opportunities for extra credit. \r\n\r\nCOURSE: The course is split into two phases. The beginning is mostly classroom/lecture style, learning about various general topics such as the design process, Arduino, mechanics, electronics, etc. In the second part of the semester, the build phase, you are assigned a group of 6-8 other students and are expected to build a robot that will complete a given mission. The course is designed to be pretty generous (ie you can still pass the class even if your robot epically fails) but you will get out of the class what you put in. There are a lot of opportunities to learn new skills such as 3-D printing and laser cutting as long as you are willing to put yourself out there. The course is pretty time-consuming and, being a group project, it can be very frustrating at times. Overall it is a fun course and you learn a lot.", "rating": 5, "expected_grade": "B+", "created": "2023-12-19T22:49:45.254497Z"}, {"professor": "Aris Cleanthous", "course": "ENES100", "review": "Probably his first time teaching this class but minimal guidance and no real experience with the course objective meant that a lot of people struggled. Just take someone else.", "rating": 2, "expected_grade": "B", "created": "2023-12-21T16:35:42.166384Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "Dr. Danielak did not help very much over the course of the semester. Throughout the course we would continuously be given assignments with little help and parts that we faulty. In the end, my group was unable to do well because he provided little to no help. He penalized everyone in the group because individual group members did their part poorly and offered no way to improve grades at the end of the semester. In addition, he didn't even show up for the final presentation that was deemed mandatory. Pray that you get a good group if you take Danielak. Even if you take over majority of the workload he will not be empathetic.", "rating": 1, "expected_grade": "B", "created": "2023-12-22T18:40:50.378577Z"}, {"professor": "Amy Karlsson", "course": "ENES100", "review": "I would not recommend taking this professor for enes100. To start, she is a chemical engineer and this class is all about building an autonomous robot so it deals pretty much only with mechanical and electrical engineering and also coding. So she was no help whenever our group (or any other group) ran into problems as she had no idea what we were doing. I gave her 2 stars instead of one because as a person she is nice but is very very harsh on grading. this class is supposed to be an easy A class but I am pretty sure not a single student in our class ended with an A. She would not make her expectations clear on what she wanted from the design briefs as she just gave you the assignment and never even talked about it in class. On top of this, she is not very lenient on extensions. One of our laptops with all our code for the robot got fried from the Arduino and wouldn't turn on and she still wouldn't give us an extension. \r\n\r\nTLDR: nice person but way too strict on grading and can't help you with nearly anything in the class. if you want an A in the class take someone else.", "rating": 2, "expected_grade": "B+", "created": "2023-12-22T21:23:45.214989Z"}, {"professor": "Joshua Cocker", "course": "ENES100", "review": "Josh is young and smart and knows what he's doing when it comes to engineering an OTV. He is super willing to help and provides a lot of resources as he truly wants everyone in the class to succeed. That being said, he leaves it up to you to make good use of your time and get his help, so go into office hours and open lab if your team needs it. He grades pretty harshly on the first couple milestones but once you're in the build phase he emphasizes that he is not grading you on your ability to actually build an OTV but rather on your ability to apply the engineering design principles.", "rating": 5, "expected_grade": "A", "created": "2023-12-24T20:59:56.057327Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "He is very good at keeping the class interesting and engaging, and is very knowledgeable on many parts of the course. The only real place for improvement is in his electronics/coding background, but if you have a general idea of those, or if you have a good TA, you should be fine.", "rating": 5, "expected_grade": "A+", "created": "2024-01-02T23:01:42.991661Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "He's the best professor at UMD without a doubt. There is literally no one better. His class always comes in first place for the OTV project which is the vehicle we work on all year. He makes it extremely fun and clearly loves to teach. If you can, take him you won't regret it.", "rating": 5, "expected_grade": "A+", "created": "2024-01-03T21:30:49.963337Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "Nice person, but not very helpful in terms of the actual class. This can be forgiven because he is a lenient grader, but based on the way the class is structured, your team can be struggling for a long time without learning anything.", "rating": 3, "expected_grade": "A", "created": "2024-01-20T05:53:36.689574Z"}, {"professor": "Brian Danielak", "course": "ENES100", "review": "The class is a guaranteed A or A- as long as you put in a decent amount of work. Danielak is a pretty chill and nice guy but doesn't help out too much. He simply assigns you the work and you do it with your group and answer questions to the best of his abilities. Overall a chill guy, but any professor will be fine if you're taking ENES100.", "rating": 4, "expected_grade": "A+", "created": "2024-01-24T21:03:43.876187Z"}, {"professor": "Michael Galczynski", "course": "ENES100", "review": "Mike is enthusiastic, friendly, and always there to help. He really tries to form connections with his students and make them feel welcome, and is generally a ton of fun to be around. I met a lot of my friends through this class, and I have no doubt that the atmosphere Mike builds contributed to that. He was always cheering us on throughout the build phase of our project, and his class was one of my favorites to attend every week. The class itself is a blast, too; building the OSV was a lot of work, but extremely rewarding, especially in the later phases when everything comes together. If you can get him for ENES100, I absolutely recommend it.", "rating": 5, "expected_grade": "A+", "created": "2024-01-30T22:18:55.760588Z"}, {"professor": "Joshua Cocker", "course": "ENES100", "review": "Genuinely just a good person. He’s young so he’s pretty relatable and funny and is really easy to talk to. He’s also very helpful. Takes more effort to get a bad grade than a good one in this class imo.", "rating": 5, "expected_grade": "A", "created": "2024-02-07T21:43:01.270697Z"}, {"professor": "Danielle Barker", "course": "ENES100", "review": "Dr. Barker (or as she had us refer to her as- Dani) is a very nice person who cares about her students. It was very easy to reach out to her with questions and we got good questions. This was Dani's first semester teaching, so she was not super familiar with everything. The TA she had was very helpful however, and he was able to help a lot with the coding and building phase. As opposed to the other review, I found her grading to be very lenient, especially on large milestone projects (these milestones tended to be slideshows laying out what you have been doing/plans for what you will do.) I think the problem many people ran into was that they did not ask enough questions. Please do not be afraid to ask for clarification on what is required/wanted for these milestones. For my semester, we did not have input as to who we were grouped with or what our team's mission was. I wish we were able to give input on this since having a good team will make or break your grade. Once you do get your group, get to know them quickly because you will be spending a LOT of time together toward the end of the semester. ENES100 is a course where you \"learn\" and plan for half the semester and build for the other half, however you really do not learn much during the learning portion. You need to hope and pray that you or your team has the background knowledge for this or else you will need to go to a lot more office hours than your peers. If no one on your team has coding knowledge, please please please do not wait until the build phase to learn.\r\nOverall I found ENES100 is a fun class, however this will largely depend on if you have a good and knowledgeable group who is willing to put in time and effort outside of class.", "rating": 5, "expected_grade": "A+", "created": "2024-02-13T21:45:33.635490Z"}, {"professor": "Jarred Young", "course": "ENES100", "review": "As you've seen in other reviews, Young is very chill but wasn't a very helpful professor. He quite literally did not teach the mechanics lecture and barely showed up to class during the building phase. On the occasions that he does show up to class, he'll simply make a snarky remark about your OTV and leave. I can't complain too much tho because I had a 91% in the class and he bumped that up to an A.", "rating": 3, "expected_grade": "A", "created": "2024-02-14T16:20:16.323581Z"}], "department": "ENES", "course_number": "100", "name": "ENES100", "title": "Introduction to Engineering Design", "credits": 3, "description": "<b>Corequisite:</b> MATH140.\nStudents work as teams to design and build a product using computer software for word-processing, spreadsheet, CAD, and communication skills.\n<i>Credit granted for ENES100 or ENES100A. Non-engineering students can enroll for ENES100A and must request permis sion to do so at eng.umd.edu/keystone/courses.</i>", "is_recent": true, "geneds": null}