{"average_gpa": 3.55518588362069, "professors": ["James Green", "Satish Tamboli", "W Ethan Eagle", "James Green", "James Green", "Michael Pratt", "James Green", "Michael Pratt", "James Green", "Michael Pratt", "James Green", "Michael Pratt", "James Green", "Michael Pratt"], "reviews": [{"professor": "James Green", "course": "ENES210", "review": "Although the class was graded rather easy, i found it to be one of the most awful classes i have ever taken. Green gives pop quizzes to make sure you come to class, but you do not actually learn anything by going. The quizzes are only to lure you in so you have to listen to him ramble about cars and his achievements. Do NOT take a class of his.", "rating": 2, "expected_grade": "A", "created": "2014-04-24T07:47:00Z"}, {"professor": "James Green", "course": "ENES210", "review": "Dr. Green is an amazing individual. He is a bit abrasive early on, but his ENES course is extremely fair and incredibly informative. He is very experienced and knows what he is talking about. He provides several in-class activities that replicate real-world, entrepreneurial presentation-like settings. There are only 3 main essays and one final project, so it's definitely not the most time-demanding course. If you do the readings (never more than 30 pages) you'll truly appreciate everything he and the course have to offer. Definitely take one of his courses if you cannot or don't want to take ENES210.", "rating": 5, "expected_grade": "A", "created": "2014-01-15T01:31:00Z"}, {"professor": "James Green", "course": "ENES210", "review": "Wow, for such an easy class, I was given a ton of stress. He's got a really weird grading policy. He takes attendance by random quizzes here and there (usually every couple weeks, then near end of semester its highly unpredictable, like 3 back to back quizzes). The quizzes are easy as long as you get a general idea of the reading. However, if you mess up on one of them, it will bite you in the end. \r\nThis was honestly a bs class and I really didn't learn much at all. For example, the book we studied half the time they had a disclaimer that they need more information before they could draw a better conclusion.\r\nThe first essay was straight up dumb, They wanted 3 pages for 18 points, so that each paragraph was literally 4-5 lines and had not much substance at all. The later essays are much better though. The group presentations/project wasn't bad as long as you have a decent team. Participation does matter, although I having trouble seeing how I got my grade when there are 80 people in the class. If you have some issues with the grading on your quiz, don't hesitate to talk to the instructor, the TA's get a lot of stuff wrong. He offers a 2% curve on the final presentation if you fill out the end of semester class survey", "rating": 3, "expected_grade": "A", "created": "2012-12-30T14:21:00Z"}, {"professor": "James Green", "course": "ENES210", "review": "This class was def. a great laid back class. Take this with a hard scheudle if you want a breather! Grade consists of 3 main essays, which are easy to get an A on if you follow his instructions, and one big final group project(35% of your grade). Not much homework, except for reading assignments. Pretty much guarneteed an A if you do your essays and project", "rating": 5, "expected_grade": "A", "created": "2009-12-10T16:52:00Z"}, {"professor": "James Green", "course": "ENES210", "review": "Easy at first, but the group project requires a lot of work and the final was hard. The videos are ridiculously long and are not helpful. ", "rating": 3, "expected_grade": "A", "created": "2019-05-25T01:17:54Z"}, {"professor": "James Green", "course": "ENES210", "review": "This man does not know how to communicate with people. When I, a student, asked for HELP with content, he referred me back to the content he already posted (which I had already read, bc otherwise I wouldn't be asking for help). He was horrible with helping me with our final group project when some of my team members were not responding to our final project. I literally sent the dean of the engineering school an email about this man. Never got anything back lol but I figured maybe during this crazy time we'd see some leniency.\r\n\r\nOh and also, he makes you buy HIS book as the textbook for the class. It was a waste of $25", "rating": 2, "expected_grade": "A", "created": "2020-05-07T12:59:31Z"}, {"professor": "James Green", "course": "ENES210", "review": "Professor Green seems to be a nice man who is very sympathetic to the concerns of his students and can help you with any questions you have during the course. Unfortunately, the course itself is not very informative, and a good proportion of the students in the class have trouble with even the most basic topics, severely worsening the experience in a heavily group project-based course.", "rating": 4, "expected_grade": "A+", "created": "2020-08-15T00:43:36Z"}, {"professor": "James Green", "course": "ENES210", "review": "The other reviews are somewhat reflective of the truth.\r\n\r\nHe runs the course on autopilot, with the synchronous lectures being pre-recorded videos. Yes...The SYNCHRONOUS lectures are pre-recorded. Which means you're stuck watching a ~20 minute video at a specific time of the day, and can't watch it back later.\r\n\r\nThe average work week is around 1-2hrs of work (including watching module videos, reading, and note taking). There is a quiz each week, and 4 simulations. This semester, he dropped the simulation grades and just went off of completion (I.E., you do it, you get 100%).\r\n\r\nThe core of the grade comes from weekly group activities, which take around ~5 minutes per team member (4 of them). These weekly activities lead up to the final project, which is a 4,000 word writeup and summary of your theoretical startup company product/service. If you get inactive teammembers, you're stuck covering for them. \r\n\r\nAt the end of the semester, you do a final independent writeup of the team project, where you can list the members who did contribute or did NOT contribute to the project. He will then ask for a Google Docs link where he can see who did what, and substantiate your claims. My understanding is that their independent grade is docked accordingly.\r\n\r\nAs a whole, I don't mind him and I would take him again.", "rating": 5, "expected_grade": "A", "created": "2020-12-10T21:31:58Z"}, {"professor": "James Green", "course": "ENES210", "review": "He makes you buy his textbook that he written for $25 and you must buy this book as all the quizzes are based on it and the online simulations. The class itself is fairly easy with just simulations, weekly quizzes/assignments, and the final group project. You have to design an MVP with a group and go through the steps to build a startup around the product.  You'll work on it slowly throughout the semester through the weekly assignments. If you have a good group, you'll be fine and it'll be easy. If you get a slacking group, you'll have a lot of work to do. ", "rating": 2, "expected_grade": "A+", "created": "2020-12-15T00:51:02Z"}, {"professor": "James Green", "course": "ENES210", "review": "Took this and ENES461, easy As in both but they are genuine scam courses. I learned essentially nothing from them and you pay $27 for the textbook he wrote for each course, they are not the same textbook. Basically take them if you want an online grade booster, this is all the class is useful for.", "rating": 1, "expected_grade": "A", "created": "2021-05-23T23:27:33Z"}, {"professor": "James Green", "course": "ENES210", "review": "James V. Green is potentially the most hands-off professor that I have ever encountered at my time at this university. All of his lectures are pre-recorded, and, from what I have heard, have been reused for several semesters now. He makes a lot of money off of students buying his textbook that you have to buy for the class, and most of his assignments are extremely surface-level and do not teach you about the real nuance and strategy development skills behind entrepreneurship and other related skills that the course description claims to offer. In essence, he tells you that, in order to have a successful startup, you need a good idea, good people, and good strategy with little to no competition in your area. This, as mentioned earlier, is extremely surface level, and does not even begin to dive into the depth marketing and management skills needed to successfully run a startup company. His course claims that being the first and most innovative product design will lend you the most successful opportunity. This, however, is clearly not the case, as many product launches, including Apple's iPhone, were launched with preexisting technology but took advantage of other factors and markets to take over larger portions of market share. His class will NOT lend andy real skills that you can use later on. However, if you are looking for an easy three-credit gen ed, then you might want to consider taking it, as it is very low time commitment and all of his quizzes are easily ctrl+f-able (from his his textbook). ", "rating": 1, "expected_grade": "", "created": "2021-10-21T02:12:48Z"}, {"professor": "James Green", "course": "ENES210", "review": "Although the class is online, it is not a zoom lecture.  Instead, he broadcasts himself speaking and does not give you an opportunity to ask him questions.  He is only available through email and offers no office hours.  Although the class itself is straightforward, as someone who likes to ask questions and has needed help over the semester I did not feel like I was given many options to ask for help other than email.  The weekly assignment is based on the textbook (which he wrote and makes you pay for), which he then re-iterates in videos you have to watch before class, and then again in the broadcast lectures. I took this as a gen-ed and to learn more about business and entrepreneurship and I honestly don't know if it was worth it for the stress caused by not being able to get appropriate help. ", "rating": 1, "expected_grade": "", "created": "2021-12-01T01:40:34Z"}, {"professor": "James Green", "course": "ENES210", "review": "Yes, this class is still not very useful, pretty boring, but it is easy to get an A. Just make sure to actually try on the quizzes, and weekly activities, because they do actually sometimes grade the weekly activities, and don't put off the final project until the last day. I think everyone in the class got an A on the final project as long as they did all the questions. It's supposed to be 4,000 words which is kinda a pain, but I only give this class this high of a rating because of how little the workload was.", "rating": 4, "expected_grade": "A+", "created": "2021-12-26T00:39:25Z"}, {"professor": "James Green", "course": "ENES210", "review": "Not very accommodating and hard to reach. He makes it difficult to seek help and is quite rude and arrogant in general. This is definitely an easy class just because there isn't much work and not much material that is tough to understand. But I wouldn't take it if you're the type that likes to reach out to professors or engage with TAs to do well in school", "rating": 2, "expected_grade": "", "created": "2022-04-13T16:39:23Z"}, {"professor": "James Green", "course": "ENES210", "review": "People like to sh*t on this class, but everyone knows what they’re expect when they sign up, you buy a 20 dollar book, take a weekly quiz thats straight from the textbook, answer weekly questions about a potential product you are creating, and you’re basically done.\r\n\r\nfor the final you put all your weekly assignments together and add filler, get 3k words and you get an A", "rating": 4, "expected_grade": "A+", "created": "2022-05-18T22:36:08Z"}, {"professor": "James Green", "course": "ENES210", "review": "i mean it's just a free A which is why i give it 2 stars instead of 1. i can't say I learned anything at all in the class. it's pretty much a way for Green to scam a living. you're forced to pay $30 to access his textbook which you need to get assignments and such. assignments are all a joke though. take it if you need the gened and want a free A. if you want to learn anything at all, stay far away", "rating": 2, "expected_grade": "A+", "created": "2022-05-19T01:46:47Z"}, {"professor": "James Green", "course": "ENES210", "review": "These classes exist solely for James Green to make a profit off of selling his textbook, so if you take 210 or 140 to actually learn any of the material, you will quickly be disappointed. His online lectures are pre-recorded, and his (mandatory) textbook is often copied word for word onto assignments.  That being said, the class is an easy A that requires little to no effort aside from the final project. ", "rating": 2, "expected_grade": "", "created": "2022-05-19T23:22:37Z"}, {"professor": "James Green", "course": "ENES210", "review": "Easy A class but you don't learn anything.", "rating": 3, "expected_grade": "A+", "created": "2022-05-25T17:30:40Z"}, {"professor": "James Green", "course": "ENES210", "review": "Everyone complains about not learning anything but honestly the only reason anyone takes this class is for the easy A, which is exactly what it is. I fulfilled a few GenEd credits without putting any work so I’m not gonna complain", "rating": 5, "expected_grade": "A+", "created": "2022-05-28T00:46:13Z"}, {"professor": "James Green", "course": "ENES210", "review": "People don't like him because you don't really learn anything in this class, but for someone who took this class purely for the gen ed credit, it was great. Minimum amount of effort was needed for the class. Lectures were both in person and pre recorded so you could choose if you wanted to go into class or not. The pre recorded lectures were usually only 20 minutes long, the weekly assignments took 20 minutes max for more research focused ones, weekly quizzes are a big part of your grade but they're open book and the answers are almost always in the textbook. Plus class was only once a week and there are no exams of any kind. The only real downside is the final paper which is expected to be 3k - 4k words with 10 citations. As long as you start early it's really not even that bad, you use the weekly assignments for most of the answers and then to reach the word count you just talk about random stuff. Mine was around 3.5k words and I got a 100 and ended with like a 98% in the class. He was also very responsive to emails (would reply within 24 hours) and is very helpful in person if you're ever really struggling (I went to lecture in person in the beginning of the semester). Would definitely recommend if you're looking to fulfill a gen ed, but of you actually want to learn something, choose a different class. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-30T17:31:52Z"}, {"professor": "James Green", "course": "ENES210", "review": "Take this class ASAP! The easiest A I have ever gotten throughout my entire life. You really won't learn anything. The entire class is graded based on weekly activities that are based on the lectures which are very easy and there are weekly quizzes out of 4 points every week which are also a walk in the park no cap. The only part of the class that I actually had a hard time with was the final. It was a lot of work and took a couple days to complete but it wasn't too bad considering that I spent under 10 minutes a week for this class. Definitely take this class if you want the easy A but just be prepared to learn nothing. Also, James Green is a great guy and is really smart and knows his stuff very well. ", "rating": 5, "expected_grade": "A+", "created": "2022-07-25T22:44:02Z"}, {"professor": "James Green", "course": "ENES210", "review": "Bro if u want an A take this class, sure you wont get anything out of it but its still worth it", "rating": 4, "expected_grade": "A+", "created": "2022-10-29T11:38:38.945194Z"}, {"professor": "Michael Pratt", "course": "ENES210", "review": "I know absolutely nothing about business or engineering and this course was SO easy. His lectures are ok but lectures are mainly time for you and your team to submit a weekly assignment and you can leave after that. BE CAREFUL tho and do not leave class before you’ve been there for like 25-30ish minutes because he will give you a zero or knock some points off. The final project was pretty easy as you work on bits of it all semester. It’s a 4k word paper but it’s split between 6 people and it’s so easy so don’t let that scare you away from this course. If you need it for your gen eds I literally could not recommend this course more as it’s a GPA booster!", "rating": 5, "expected_grade": "A+", "created": "2022-12-14T00:11:14.399758Z"}, {"professor": "James Green", "course": "ENES210", "review": "This class is poetic. All of his pre-recorded \"lessons\" (common sense packaged into power-points that he reads directly, recorded 8 years ago) teach you how to become an entrepreneur. A $30 \"e-book\" (those same power-points copy-pasted onto a site he owns as an LLC (https://opencorporates.com/companies/us_md/W16090763) - he likely has near-zero expenses) is required for the hundreds of students that take his courses with this material each semester. You do the math.\r\n\r\nAnd not a single drop of sweat from James Green's bald head. That's passive income baby. \r\n\r\nAt some point you'll realize the real lesson is that you just got swindled by the one true entrepreneur: James Green. THIS is his business and you're just a customer. Welcome to the real world. \r\n\r\nAccepting what's happened, you turn a grin to your new friend, late-stage capitalism, and realize that this is more than just hustling students. He's really offering you a deal under the table: pay tuition for the course, give him his $30, and for 5 hours of total work you get an A for 3 credits! And what's that? You can do it again?? In ENES461: Advanced Entrepreneurial™ Opportunity Analysis™ in Technology Ventures™ for another easy 3 credits??? Sign. Me. Up.\r\n\r\nJames Green! You madman! Thank you for all the credits. It's been a pleasure doing business with you. \r\n\r\n5/5 stars.", "rating": 5, "expected_grade": "A+", "created": "2022-12-20T08:42:37.098562Z"}, {"professor": "James Green", "course": "ENES210", "review": "Take this class for what it is, an easy A. If you have a busy schedule, 210 is a great opportunity to catch a break and an A. The textbook is expensive and useless but it's the price of admission that lets the whole machine go round. Use quizlet for the weekly quizzes and don't do any of the reading (they are literally never relevant). Lastly, take the class with friends are form a good relationship with competent group members because taking care of the group project is actually the only important thing in this class. Overall, I spent about 30 minutes of critical thinking on this class this semester and got away with everything I needed.", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T01:51:10.559806Z"}, {"professor": "James Green", "course": "ENES210", "review": "You're paying the guy 30 bucks for an A, are you kidding me. I'm taking this deal any day of the week. Me 🤝 James Green", "rating": 5, "expected_grade": "A+", "created": "2022-12-25T19:11:37.831791Z"}, {"professor": "James Green", "course": "ENES210", "review": "Grading through the course is through weekly quizzes, product assessment, in-class activities, final project write-up, and individual analysis of final project write-up. For the weekly quizzes you can find the answers in the lecture videos and book this takes about 30 minutes max. The product assessments are a short questionnaire about your product they take 2 minutes max. The in-class activities never take more than 30 minutes max. Finally the final project write-up and individual analysis make sure you do every part required of these and hit the word count and you'll get an A. Overall this class is super straightforward and you'll never spend more than 90 minutes a week on it and get an A.", "rating": 5, "expected_grade": "A+", "created": "2023-01-12T23:32:59.603623Z"}, {"professor": "Michael Pratt", "course": "ENES210", "review": "Pay for the book and get a free A, don't learn anything, class is an easy GPA boost. The class is a 5, pratt is a 1. He doesn't know anything(granted it's ENES210 you don't learn anything), but he strives to be unhelpful and eogs off kids who don't care.  Take your free A+ and interact with him as little as possible", "rating": 3, "expected_grade": "A+", "created": "2023-05-11T00:16:40.367303Z"}, {"professor": "James Green", "course": "ENES210", "review": "Only took this course because it fulfills the SCIS requirement. Easy A, but you still need to put in minimal effort. Also you pay $35 for a textbook you don't need.", "rating": 3, "expected_grade": "A", "created": "2023-05-16T02:19:37.367176Z"}, {"professor": "James Green", "course": "ENES210", "review": "Freest A of all time but bro doesn't do jack, just sells you his textbook. Take if you need gened/credit. Class takes around 5 mins commitment per week.", "rating": 1, "expected_grade": "A", "created": "2023-05-16T04:46:15.834651Z"}, {"professor": "James Green", "course": "ENES210", "review": "The class is for 50 minutes once a week. You are basically paying this dude 40 bucks for an easy A in the class. He is a true entrepreneur. He makes you buy some ebook which is required for the class and it counts as like 25% of your grade. You just buy the book and you get the full points for that part. Its so easy.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T18:30:03.873071Z"}, {"professor": "James Green", "course": "ENES210", "review": "Free A+ this class is somehow even easier than ENES140. Take it for credit. James Green doesn't really do anything and just teaches the class to require everyone to but the textbook. Feels wrong to give him anything higher than a 1 star but I honestly respect the hustle. He's making BANK and I really don't care.", "rating": 1, "expected_grade": "A+", "created": "2023-06-04T18:01:14.193148Z"}, {"professor": "James Green", "course": "ENES210", "review": "Bro got his degree from Hustlers University", "rating": 3, "expected_grade": "A+", "created": "2023-09-10T18:07:20.680630Z"}, {"professor": "James Green", "course": "ENES210", "review": "da goat", "rating": 5, "expected_grade": "A+", "created": "2023-10-27T15:38:40.113018Z"}, {"professor": "James Green", "course": "ENES210", "review": "You only come to class once a week. Time flies very fast in it by working with your team mates. You make a product with a group of people for the whole semester. Quizzes are heavy but very easy if you read. You don't really have to thoroughly read the book to pass the quizzes. Ez A.", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T18:19:22.726434Z"}, {"professor": "Michael Pratt", "course": "ENES210", "review": "He's an old guy who goes up and talks for about 20 minutes. Free A", "rating": 5, "expected_grade": "A", "created": "2023-12-11T19:25:29.471287Z"}, {"professor": "James Green", "course": "ENES210", "review": "One of the best and easiest gen eds. You spend $35 and put in an two hours of the week in easy work to get an A. Take this class if you need one of the requirements.", "rating": 5, "expected_grade": "A", "created": "2023-12-17T06:24:05.370009Z"}, {"professor": "James Green", "course": "ENES210", "review": "pay $30 for the textbook and show up to class once a week for a free A+", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T06:23:49.442460Z"}, {"professor": "James Green", "course": "ENES210", "review": "If you’re deciding between 140 and 210 just take 210. Even though 140 is fully online, 210 meets once a week for 50 minutes and all you do is answer different questions in a google doc with your group members then turn it in at the end of class. The project is very easy because those questions you are answering every week pretty much give you what you need for the final project. The weekly quizzes for 210 are also much easier than the quizzes for 140.", "rating": 3, "expected_grade": "A", "created": "2023-12-22T23:24:39.182392Z"}, {"professor": "James Green", "course": "ENES210", "review": "Not giving the GOAT 5 stars is an insult. This man is the father I never had. Everything that needs to be said has been said.", "rating": 5, "expected_grade": "A+", "created": "2023-12-23T23:45:03.472988Z"}, {"professor": "James Green", "course": "ENES210", "review": "This may be the class for you depending on what you are looking to get from it. If I had to rate James Green as a professor and on his teaching abilities I would give him a 1/5. If you are genuinely interested in this topic then this may not be the class for you. You really do not learn anything throughout this semester. However, this class is perfect for you if you are looking for a GPA boost, easy Gen Ed, or a low time commitment 3 credit class. I am giving this a 5/5 because this is what I was looking for. Throughout the semester there is a very low time requirement. Outside of class you maybe spend 30 min a week (MAX) on work. (And the class is 50 min a week.) There is a $35 textbook you need and a 5 point quiz each week. These quizzes say to read the textbook, required readings, and the videos, however, this tends to be the same information 3 different ways. If you can use control F on the textbook you are fine. They are open note and open book as well so this is what he recommended to do. The end does require a fair amount of work because of the term project. You have around a week to work with your group to complete 4000 words and a wireframe. As long as your team equally contributes you'll be fine. Overall, if you want a free A and a GPA boost then I highly recommend this class. Just make sure to do all assignments since there are not many and each has a heavy weight on your grade.", "rating": 5, "expected_grade": "A+", "created": "2024-02-13T21:53:11.205901Z"}, {"professor": "Michael Pratt", "course": "ENES210", "review": "Mr. Pratt is constantly grumpy and condescending to his students. Sure, free A and and free gen-eds, but these reviews are supposed to be about the person and only secondarily about the class, and in my experience, Mr. Pratt is not a great person.", "rating": 2, "expected_grade": "", "created": "2024-02-29T02:11:25.201194Z"}], "department": "ENES", "course_number": "210", "name": "ENES210", "title": "Entrepreneurial Opportunity Analysis and Decision-Making in 21st Century Technology Ventures", "credits": 3, "description": "<b>Credit only granted for:</b> ENES210 or ENES461.\nThis multi-disciplinary course helps students learn the principles of entrepreneurial opportunity analysis and decision-making in an increasingly dynamic and technically-inclined society. Emphasis is placed on how aspiring technology entrepreneurs can develop their entrepreneurial perspectives to develop winning entrepreneurial plans for their future ventures.\n<i>All questions regarding this course should bedirected to mtecheducation@umd.edu.</i>", "is_recent": true, "geneds": null}