{"average_gpa": 3.3738192019236273, "professors": ["Mary Turner", "Karen Angeline", "Ceil Goldberg", "Ellen Blumner", "Clare Parsons", "Thomas Lowderbaugh", "James Mattson", "Elizabeth Fixsen", "Katherine Robinson", "Adam Lloyd", "Stewart Foehl", "Kelly Forsythe", "Elizabeth McClure", "Danuta Hinc", "Holly Smith", "David Miles", "Elliot Berger", "Jonathan Rick", "Daune O'Brien", "Kate Wilson", "Joshua Buursma", "Robert Oliver", "Blake Wilder", "Donald McNeilly", "Edward Helfers", "Rosalia Saklas", "Frederick Bolton", "Shayna Maskell", "Katherine Wilson", "Donald McGlew", "James Ball", "Alexandra Calloway", "Anna Szczepaniec-Bialas", "Joseph Wappel", "Kimberly Banks", "Lorenzo Deloatch", "Pamela Orel", "Radford Skudrna", "Tricia Homer", "David Brookshire", "Joseph Angelella", "Justin Lohr", "Kevin Wisniewski", "Kristine Morrissey", "Erica Cochran", "Robert Lucci", "John MacIntosh", "Nicole Cuffy", "Charles Jones", "Tom Hatcher", "Patrick Nelson", "Kelly Hebron", "Robert Crane", "Sheila Lalwani", "Carina Shi", "Eric Bond", "Robin Allen-Klein", "Daune O'Brien", "Adam Lloyd", "Anna Szczepaniec-Bialas", "Brandee Pettus", "Carina Shi", "Carol Cron", "Clare Parsons", "David Miles", "Elliot Berger", "Erica Cochran", "Eric Bond", "Eve Ettinger", "Holly Smith", "Jonathan Rick", "Adam Lloyd", "Anjula Batra", "Anna Szczepaniec-Bialas", "Blake Wilder", "Carol Cron", "Clare Parsons", "Daune O'Brien", "David Miles", "Elizabeth Parr", "Erica Cochran", "Esthus Amos", "Garth Libhart", "Holly Smith", "Jay Wilcox", "Jonathan Rick", "Joseph Angelella", "Joseph Wappel", "Adam Lloyd", "Anna Szczepaniec-Bialas", "Blake Wilder", "Clare Parsons", "Daune O'Brien", "David Miles", "David Todd", "Erica Cochran", "Garth Libhart", "Holly Smith", "Jay Wilcox", "Jonathan Rick", "Joseph Angelella", "Daune O'Brien", "Erica Cochran", "John Kim", "Brianne Friel", "Adam Lloyd", "Daune O'Brien", "David Brookshire", "Erica Cochran", "John Kim", "John MacIntosh", "David Todd", "Joseph Wappel", "Adam Lloyd", "Anna Szczepaniec-Bialas", "Blake Wilder", "Clare Parsons", "Erica Cochran", "Garth Libhart", "Holly Smith", "Jay Wilcox", "Jonathan Rick", "Anjula Batra", "Aubrey Zinn", "Daune O'Brien", "Dennis Winston", "Adam Lloyd", "Anna Szczepaniec-Bialas", "Aubrey Zinn", "Clare Parsons", "Daune O'Brien", "David Miles", "Erica Cochran", "Eric Bond", "Holly Smith", "John Rendeiro", "Blake Wilder"], "reviews": [{"professor": "Ceil Goldberg", "course": "ENGL394", "review": "I don't think anyone likes Engl394, and it's overall not the most worthwhile class I've taken at the university. Professor Goldberg isn't the worst teacher I've had, but I wouldn't take her for another class if I had a choice. She's very nitpicky, and small things like not signing your initials next to your name on a memo can make you fail an assignment. Her instructions also weren't totally clear all the time.\n\r\nMy advice is to pay a lot of attention during the first few classes, and do really well on the first few assignments. After you've proved yourself, she seems to keep giving you the same grade throughout the semester. On the other hand, if she decides she doesn't like you from the start, then the rest of the semester will be rough.", "rating": 3, "expected_grade": "A", "created": "2014-01-30T02:17:00Z"}, {"professor": "Ceil Goldberg", "course": "ENGL394", "review": "This is one of the worst professors I've had at UMD. Most of the reviews before me describe her well. She speaks on trivial points for a majority of the class. She's EXTREMELY stubborn. When you point out she's wrong, she lashes at you. It's terrible that this school still employs this woman. I could find you 10,000 students more knowledgeable, organized, and understanding than her. Which means if you've taken any stat course that about a third of her students should be teaching instead of her. I wouldn't take this class with her if I were you.", "rating": 1, "expected_grade": "", "created": "2013-02-11T16:39:00Z"}, {"professor": "Ceil Goldberg", "course": "ENGL394", "review": "Just read the posts below. They are all correct. Grades based on Goldberg's predetermined judgement of you as a student at the beginning of class. Goldberg retaliated against me for challenging her grading \"method\" by knocking enough points off my grade to give me a B+ (when I had an A wrapped up). Her grading \"method\" is basically downgrading for whatever she doesn't \"like.\" Do not expect a shred of objectivity in grading. She leaves rubrics vague so she can give you whatever grade she wants. \n\r\nThis teacher has only given out an A+ to 7% of her students in 20 semesters? This number would make sense if Goldberg was actually invested in the class; however, during summer, she acted like she would rather be any place else, came unprepared to class, REFUSED to read a final draft of a final paper - seriously! (out of sheer laziness, as Goldberg sat around in class reading a newspaper until letting us out early, rather than read a final draft of the final paper.) She consistently let out class early  which, again, reeks of laziness, since not all material was covered. \n\r\n\"One of the most incompetent professors I've had\" - totally agree. Never take her class, ever - you might actually learn something from the other teachers. The one 4 star review was obviously someone happy with the grade that was decided on for them. \n\r\n\"Very nitpicky in grading, takes points off for frivolous things. This perhaps is related to \"what grade you're supposed to get\" in her head......or maybe I'm just paranoid.\" - Absolutely correct, you are not paranoid. What an awful teacher at what is supposed to be one of the top public universities, teaching a required course. The word \"professor\" has been omitted purposely from this post, as this would imply a standard that is not met by this teacher.", "rating": 1, "expected_grade": "A", "created": "2012-08-30T11:12:00Z"}, {"professor": "Ceil Goldberg", "course": "ENGL394", "review": "one of the most imcompetent professors I've had. As far as \"professional business writing\" goes, she 's pretty much lost her  grasp on reality. She would focus on really trivial stuff rather than the important aspect of your work. (make sure to put down your signature for the assignments that require it, she takes off ridiculous amount of points otherwise). She's also stubborn as hell and probably won't concede to your argument(however reasonable it maybe). ", "rating": 1, "expected_grade": "", "created": "2011-12-25T17:18:00Z"}, {"professor": "Ceil Goldberg", "course": "ENGL394", "review": "Do not take this class with Ms. Goldberg. She's pretty strict when grading and extremely harsh in her feedback. She will also, at times, publicly rip apart your work in class on the projector without hiding your name. What earlier people said about how she forms an opinion of you very early on and is basically what your grade will be at the end regardless of your future efforts is completely true. You also will sit around in her class a lot and do nothing after you finish peer reviewing people's work because she'll walk around to literally every student and review their work personally. When she does this she'll shout out her thoughts to the person whose work it is regardless of how bad/good her thoughts are.\n\r\nI would recommend switching out.", "rating": 1, "expected_grade": "", "created": "2011-08-17T12:24:00Z"}, {"professor": "Ceil Goldberg", "course": "ENGL394", "review": "She is really not a bad teacher. She is nitpicky when it comes to grading, but she is fair. She can be pretty blunt, almost harsh but don't take it to heart. Compared to other business writing professors, I'd say she's one of the easier ones. I swear, the majority of the class was spent doing memos and emails. As long as you go to class and do all of the little assignments on time, you will be fine. \n\r\nI did have an issue with her \"textbook\" though. Even though it was cheap ($40) compared to textbooks for other 394 classes, it was just 100 pages of examples. Although they are helpful, I don't think that they are worth paying for.", "rating": 4, "expected_grade": "B", "created": "2010-04-29T02:12:00Z"}, {"professor": "Ceil Goldberg", "course": "ENGL394", "review": "Here's my opinion. Goes without saying that it should be taken with a grain of salt: \n\r\nProfessor Goldberg forms an opinion of what you're capable of very early on in the semester and metes out final grades accordingly. However you perform on the first couple of assignments is a very good indicator of what you're going to end up with in the course, no matter how much effort you put in afterwards. \n\r\nVery nitpicky in grading, takes points off for frivolous things. This perhaps is related to \"what grade you're supposed to get\" in her head......or maybe I'm just paranoid.", "rating": 3, "expected_grade": "B", "created": "2009-12-19T20:08:00Z"}, {"professor": "Ceil Goldberg", "course": "ENGL394", "review": "very blunt woman.\r\nHer common response to students' remarks is \"no\". \n\r\nEh...an okay professor. ", "rating": 3, "expected_grade": "", "created": "2008-11-22T23:01:00Z"}, {"professor": "Ceil Goldberg", "course": "ENGL394", "review": "Very bad teacher. \n\r\nSays her jobs for the past 20 years were as editor and writer. The first thing she will look for in your paper is grammatical and mechanical errors. \n\r\nHer grading is bad. \n\r\nSwitch out now!", "rating": 1, "expected_grade": "", "created": "2008-08-25T11:53:00Z"}, {"professor": "Thomas Lowderbaugh", "course": "ENGL394", "review": "Dr. Lowderbaugh is a great professor. He is very willing and open to help you out with whatever questions you may have, and he is very responsive and accomodating with his e-mails. \n\r\nThe class requires a good deal of effort and is different from the writing that most students are used to. Professor Lowderbaugh will teach you how to write appropriately for the business world, which most students don't already know how to do.\n\r\nIf you are willing to put in the effort and listen to Professor Lowderbaugh's suggestions and comments and incorporate them into your writing, you should have no problem with getting an A. However, if you choose to think that your writing is already good enough for the business world and that Professor Lowderbaugh's comments aren't representative of how the real world is like, your grades will suffer.", "rating": 5, "expected_grade": "A", "created": "2012-08-23T13:43:00Z"}, {"professor": "Thomas Lowderbaugh", "course": "ENGL394", "review": "You should not take this class with this teacher.  You do not understand just how awful he really is.  Every class is him talking about nothing and then repeating himself and then you work in groups to edit your papers.  Your group members are no better at writing than you and offer little help.  Additionally, you have to write all the papers on your own. Most of the other junior English classes have you working in groups.  Instead you spend an entire semester making up information for a proposal that is really stupid.  This class is way too much work to get the grade. This teacher just set you up to fail.", "rating": 1, "expected_grade": "", "created": "2012-05-12T00:24:00Z"}, {"professor": "Thomas Lowderbaugh", "course": "ENGL394", "review": "This was the most challenging course I have EVER taken in my life. Professor Lowderbaugh offers all his help so that his students receive the highest grades. He lets you rewrite papers and offers student conferences when asked. Taking his class, I feel, has extremely improved my professional writing skills. My final proposal from the class received good feedback with my supervisor (the proposal written in class is sent to the supervisor).\n\r\nUnlike other engl394 courses, you work on a proposal individually and the workload is immense. It requires research beyond mckeldin, and its unconventiality made it the most difficult class EVER.\n\r\nI worked really hard for my A, but at the end of day, I liked the class even though I had mini panic attacks every tues and thurs when I had the class.", "rating": 5, "expected_grade": "A", "created": "2010-06-01T14:34:00Z"}, {"professor": "Thomas Lowderbaugh", "course": "ENGL394", "review": "Mr. Lowderbaugh has to be one of the worst professors at the University of Maryland. I hated having to attend his classes, he has no idea what he is talking about and everyone would have to sit while he fumbled through his 'lecture'. I have no idea why he is allowed to teach, none at all. He should have been fired a long time ago. ", "rating": 1, "expected_grade": "", "created": "2009-05-24T08:48:00Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "Alright, so you will probably get a good grade in this class, but it comes at a price. \r\nClare Parsons is a very inappropriate professor. She requires you to follow her on social media, Instagram or Twitter or whatever her choice of the day is. She claims \"that is the only good way of contacting me\". I don't have any social media besides facebook, and I sure wasnt going to friend her there, so I got punished for it by her deducting points from my grade. That is one of the most inappropriate things a professor has ever done  that I have witnessed throughout my college career. She make announcements every class about how she \"tweeted something so cool yesterday\" or some idiotic thing like that continuously trying to make students follow her. \n\r\nShe also is extremely vague in all her assignments and stays vague if you ask questions, and deducts points if you don't have it exactly how she wants. \n\r\nShe is absolutely terrible with technology. She was unable to make the projector work for all except maybe 2 class periods, her ELMS page is completely disorganized with her assigning work from, for example, Modules 3, 6, and 11 in a single class period. She takes forever to respond to any form of communication, except perhaps social media like I mentioned before. \n\r\nI am fairly sure that there are other professors that you can get a good grade with, and honestly I think I would have taken a B with any other professor just to not have had the miserable experience I had with her. DO NOT TAKE CLARE PARSONS!", "rating": 1, "expected_grade": "A", "created": "2016-12-13T13:50:00Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "Compared to other teachers for ENGL394 (from what I've heard from friends), Parsons is one of the better teachers to have. The content is relatively easy, there are only a few assignments, and the blended learning meant less class time.\n\r\nOn the downside, I just really didn't like her as a teacher. She was really disorganized, I learned absolutely nothing about business writing from her. The only way I learned was by doing the assignment myself. I got the feeling she was thrust into business writing with no business knowledge whatsoever. Being a business major myself, I was thoroughly disappointed.\n\r\nShe is nice and all, but she's just not a good teacher. As long as you can stand some boring classes/assignments, you'll be fine.", "rating": 3, "expected_grade": "A", "created": "2014-11-06T03:30:00Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "I really don't understand these negative reviews. She's an extremely easy teacher for business writing. No textbook is required. No readings that we have to do write-ups on - my friend had a different teacher for business writing who made them read articles and write things about it. Parsons doesn't assign any homework. We have the same assignments as all other business writing classes (cover letter, resume, 2 memos, 15 page final paper, group project). The only groupwork that we had is a final presentation, but every professor assigns that. As far as the group practice work that another student mentioned, it's really not a big deal. We don't get graded on it. She'll just hand out a worksheet and in your group just come up with some bs to write down so you have something written. 1 of these worksheets per group. My class got let out 15-20 minutes every time. Every assignment that we have, she'll write on the board pretty much exactly how to outline it and what she wants to see. She's really nice and if you for some reason need help and go to her, she'd be more than willing to help. I put in a moderate amount of effort into all the assignments and ended up with an A-. Parsons is hands down one of the easiest business writing teachers. Try to get into her section!", "rating": 5, "expected_grade": "A-", "created": "2013-01-05T00:24:00Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "Business writing as a class is irritating but Professor Parsons managed to make it worse. There is an annoying amount of groupwork where there really was no need for it, including tedious group 'practice' work for assignments which was basically designed to keep us from being dismissed from class 15 min after the start. \r\nShe barely taught anything and demanded we follow a rigid and unfamiliar outline for simple assignments like the cover letter and resume. Her grading was extremely vague. As it has already been noted, her comments would be positive but she would make no comments as to why points were lost and wouldn't comment on the assignment when asked. Her samples and assignment sheets were unhelpful. \r\nFinal project is a 15+ page business proposal based on research. This is supposed to be an easy but helpful course for juniors and seniors trying to fill a ridiculous requirement and it ended up being way too much work. ", "rating": 2, "expected_grade": "A", "created": "2012-04-24T10:49:00Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "I disagree pretty strongly with the first review. While Parsons is pretty nice and does let you out of class early, she offers absolutely NO guidance on assignments and has no specificity to her grading whatsoever. Her comments will all be positive, yet somehow you will get docked 20 points. She is also really vague and ambiguous in class, which doesn't offer much support either. Finally, some of her guidelines for writing directly contradict with what the business school teaches, which is very frustrating. Overall, I would say avoid", "rating": 2, "expected_grade": "", "created": "2011-12-15T18:55:00Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "Dr. Parsons is a very nice lady and a good professor for the much dreaded business writing. Look at her grades for starters. Much better than other professors. She is a fair grader and doesn't make things too challenging. Also she has you email your assignments to her so she grades it that way and replies with comments and a grade. Saves paper and gives you time to turn it in online instead. Our class was for some reason in a hall far away from Van Munching so she let us out early. Definitely take this class with Parsons if you can, and if you get her don't drop it.", "rating": 5, "expected_grade": "A-", "created": "2007-12-08T16:43:00Z"}, {"professor": "William Schatz", "course": "ENGL394", "review": "Schatz is one of the best professors I've had at Maryland. If you're interested in pursuing law school, I HIGHLY recommend that you take the legal writing course with him - he teaches you how to think and write like a lawyer. If you can't manage his class, then you probably should reconsider your law school aspirations. He went to Georgetown Law, so he knows first-hand what it's like to attend law school, and is very willing to provide any kind of feedback (for law school applications, or for law school in general). He's a really nice guy! Great professor. But like the other reviews, his syllabus does tend to change, but not in any significantly drastic way. He may push deadlines back, or assign one extra assignment (if the class did really poorly on average on the first one). He's very reasonable, and you definitely have to attend class every day. ", "rating": 5, "expected_grade": "A-", "created": "2011-12-01T04:16:00Z"}, {"professor": "William Schatz", "course": "ENGL394", "review": "Professor can be funny, but is very demanding. You'll have several projects and/or papers you will need to complete. He doesn't give you a chance to procrastinate, he'll always have an assignment that you're spending time on and a paper you'll be writing or drafting. Expect to put time into this class whether you want to or not.", "rating": 3, "expected_grade": "B", "created": "2009-04-28T12:40:00Z"}, {"professor": "Elizabeth McClure", "course": "ENGL394", "review": "She is, hands down, THE worst professor I have encountered in my 3 years here. She overburdened us with many overlapping assignments that made it impossible to complete everything in a timely manner. For most of us, it meant not doing the reading one of the nights. She had told us at the beginning of the semester we would have quizzes, but after 2 months we hadn't had any. So that one night when no one had time to read because we were trying not to fail the heavier assignments, she decided to surprise us with a pop quiz. When none of us could answer the questions after, she stormed out of the room and told us to teach the material for that day to ourselves, since it wasn't her job to do so (what the ever loving fuck?). \n\r\nShe also was HORRIBLE about responding to emails. I don't know what was worst, that or the fact she would promise almost every day that graded assignments would be returned the following class, and they never were. I only knew 3 of my grades all semester, and it turns out they were incorrect anyways! She ignored repeated attempts by many students to receive comments on their turned in assignments. At least half the class hadn't received any real grade back as of the end of the semester. And the final grades were clearly graded on a whim, because all semester she complained how she was too busy to respond to anything because she needed to grade. Of the things she did hand back, she was quickly scribbling to grade them in the minutes before the end of one class. There's no way she took her time to grade them well...\n\r\nIn one-on-one meetings with her, she would say to students how she hadn't even looked at email updates she had required us to send beforehand to gauge how we felt about our progress. Had she read them, she would know how we all felt. But of course she was always \"too busy.\" \n\r\nTL;DR avoid McClure like the plague. Take a W even. I'm not one to write reviews, so listen to me when I say she is a horrible professor!", "rating": 1, "expected_grade": "", "created": "2015-06-19T01:59:00Z"}, {"professor": "Elizabeth McClure", "course": "ENGL394", "review": "DO NOT TAKE HER!\r\nDO NOT TAKE HER!\r\nDO NOT TAKE HER!\r\nDO NOT TAKE HER!\r\nDO NOT TAKE HER!\r\nDO NOT TAKE HER!\n\r\nShe treats her class like it is the only class students are taking. There are at least an average of three assignments due EACH CLASS. Not every week. EACH CLASS. \n\r\nThe readings are extremely long which I don't necessarily have a problem with since every single college class is going to have long readings. If you're not ready to read a lot, then you're not ready for this class or college period.\n\r\nThe problem is that we have long readings ON TOP of other written essays and assignments. Most students sign up for this class only to meet a requirement, not as part of their major so to get so much work is not fair considering the other rigorous courses which students are taking related to their career path.\n\r\nIn terms of personality, she is very smart and intelligent and personable. She's not a boring lecturer but she requires too much of her students outside of class compared to the other ENGL394 professors.\n\r\nYou will learn a lot from her but it will hurt your GPA.", "rating": 1, "expected_grade": "", "created": "2015-03-10T04:05:00Z"}, {"professor": "Elizabeth McClure", "course": "ENGL394", "review": "She sucks. Her grading is just not consistent at all. She never told us what was wrong what our writings exactly so we had no idea how to do better in class. \n\r\nShe never responds to emails either. and always late to appointments", "rating": 1, "expected_grade": "B", "created": "2014-06-06T22:29:00Z"}, {"professor": "Ellen Blumner", "course": "ENGL394", "review": "If you are reading this right now, then you are likely enrolled in her class.\n\r\nRUN. DROP. CLOSE THE PAGE.\n\r\nI am a 3.6 junior finance major at the University of Maryland. I have held two internships (one at Morgan Stanley) and currently going to work in NYC over the summer. Obviously, I have the ability to write professionally. I received a C+ in this class. The first C grade that I have ever received IN MY LIFE. \n\r\nHere is a breakdown of how shitty a professor she is:\n\r\n1) She can't communicate. Her voice sounds like death, and she fails to return emails that she doesn't know the direct answer to. She cannot keep anyone's attention in class, and she fails to elaborate on grading. She'll give you a B on an A paper simply because you used one too many spaces in between paragraphs. She once told me that one of my papers was incomplete. And that was it. She didn't say why or how. She just said I was wrong and it was over.\n\r\n2) WAY TOO MUCH WORK. She requires you to write a paper every week, and post in at least two or three discussions a week. You learn nothing from these discussions, and they're simply just time consuming. If we had this work and it actually MEANT something, I wouldn't be opposed. But it was useless. \n\r\n3) Not organized. On the first day of class, she asked the students if they could find her a TA. THE STUDENTS. Are you kidding me? She also was not prepared for the several snow days, and struggled to tell us when assignments were changed. \n\r\n4) Extremely bias. If you don't go to class everyday and participate, she'll hate you. I was actually not one of these people. She actually liked me, and believed I could succeed in this class. Until she paired me up with someone in the class that she hates. She gave us a crappy grade on our final project because SHE DIDN'T LIKE HIM. How do I know this? I compared projects. She gave us a 50% on format when the format was copied and pasted from an example project that she gave us. \n\r\nOverall, the worst teacher I've ever had in my life. I've seen challenged kids get A's in this class solely because their teacher wasn't insane.\n\r\nThis teacher is a disgrace to this University, and I'm disappointed that she represents our school. If you think that you'll get through this class with an A because you're better than everyone else at writing, think again. That was my process. And look what it did. ", "rating": 1, "expected_grade": "B", "created": "2014-05-15T13:44:00Z"}, {"professor": "Ellen Blumner", "course": "ENGL394", "review": "If it were possible to give this woman a negative rating I would. When you take this class and it says \"staff\" when you sign up and you realize on the first day that you have E. Blumner DROP IT IMMEDIATELY. TAKE IT AGAIN WITH SOMEONE ELSE (ANYONE ELSE). \n\r\nI am currently a junior at UMD and in all of the years of my schooling I have never encountered a more miserable teacher. Here is the breakdown of why: \n\r\nBlumner plays favorites and it is beyond apparent who her favorites. If you aren't one of her favorites, she absolutely despises you and makes sure that you are aware of it. I unfortunately upset her very early on in the year and have never (will never) recover from it. What upset her? The fact that after I finished my in class assignment, I worked on assignments for other classes. When she approached me about doing other work, I calmly asked her if she had any other work for me to do during the allotted class time. Her reply was a very snarky \"no\" and she marched away. From this point forward she went out of her way to make snide comments to me and about me to not only the TA but also other students in the class including \"well you aren't the worst writer in the class.\" \n\r\nAdditionally the amount of work that Blumner makes you complete for this class is insane. And once she marks you as one of her hated students, no matter how flawless the work you turn in, you will never receive the score you deserve. You will at best get a slightly better than average score. Her arbitrary point system of -.65 of a point for punctuation on your assignments diminishes your grade from an A to a B. The work she gives you is completely busy work and generally useless in terms of learning. She offers no actual insight into your writing but nitpicks specifics of your grammar or punctuation. \n\r\nAlso beware of her \"professionalism\" grade. She has an arbitrary point system for professionalism that includes (Direct quote) \" on-time, regular attendance; notification of absence in one or two cases all semester when class HAD to be missed; no other work but ours during classtime, including discussion board posts; phone usage; well done peer reviews; revision of projects and sending of surveys to clients.\" And when she determines that she doesn't like you, she gives you a 3/5 for professionalism because \"you have a negative attitude\" and should not be rewarded for that. A student in my class actually sent her an email calling her \"a completely incompetent person\" and still received a 4.5/5 on professionalism because he was on her \"hated students list.\" \n\r\nAlso: She does not follow the syllabus, she adds in extra assignments, and she makes you do discussion posts. These discussion posts (generally 3-4 per week) are the most USELESS waste of your time possible and they are completed for a grade. You even have to respond to 1-2 of your peers discussion posts which is even more irritating and pointless. Less than 1/2 of my class currently completes these worthless discussions. \n\r\nAnd finally. Just to give you an idea of how awful she truly is: The first day of classes we began with 23 students. 5 people dropped immediately. Since that point 6 students have WITHDRAWN from the course, one student with less than four weeks until the end of the semester. The fact that this woman drove away nearly half of her class is a very telling of her teaching ability. \n\r\nSUMMARY: \r\n-Miserable teacher who doesn't teach you anything.\r\n-Holds grudges against students. \r\n-Plays favorites and absolutely torments those who are not her favorites.\r\n-Arbitrary grading system \r\n-Grades work of students who are not her favorites EXTREMELY hard\r\n-Assigns BUSY WORK ALL THE TIME\r\n-Incredibly large work load. \r\nBonus: \r\n-Horrible speaking voice (nails on a chalkboard is a sweet symphony compared to her voice). ", "rating": 1, "expected_grade": "B+", "created": "2013-12-11T00:46:00Z"}, {"professor": "Ellen Blumner", "course": "ENGL394", "review": "I have been attending school for thirteen years now, and I can say, without a doubt in my mind, that Professor Ellen Blumner is the worst teacher I have ever encountered. Yes, I know this is a big statement, but I wholeheartedly believe it is deserved. She made attending this class and doing the subsequent work absolutely miserable. \n\r\nAs a professor, one of your goals is to instill knowledge and actually teach your students. Professor Blumner did not even come close to accomplishing either of these objectives. She would not “teach” anything, as all of the material that was learned came from other students making chapter presentations to the rest of the class. When presented with most questions, her response would be “go look at the textbook.” Oftentimes, the textbook disagreed with what she wanted anyways, thus reducing your grade. \n\r\nIn addition, much of the work we complete is tedious busy work. That is ironic because she stated at the first class that she prided herself on not assigning any busywork. However her way around this minor detail was to assign most every assignment we handed in, a value. This led to a few worth 1% or 2% of the final grade, or them being looped into her wide-arching “professionalism” grade. A prime example of this is the in AIDA class writing assignment that took many students an hour or so after class to complete. This was graded on a credit/no credit basis, worth 1% of the final grade. On top of this, she offered zero feedback on the grades, and the only thing students saw was the grade on ELMS. Unfortunately, many of those assignments took hours to complete. \n\r\nThe sad thing is that this class had the potential to be very useful, if taught correctly (or at least, any bit better than Professor Blumner displayed). I know that I will have to write many business propositions and memos and other professional documents as I enter and thrive in the corporate world. Sadly, this course did not help prepare me to do this. She would flip-flop on her own ideas of how to do something; sometimes she would tell us to consult the textbook, while other times instructing us the book was wrong. Mind you, this would be for the same assignment/part of an assignment. \n\r\nThat covers much of the academic area of Professor Blumner. Lets move on to an area that she could possibly be worse in: her behavior.\n\r\nPlaying favorites is something that should be avoided as much as possible, especially in a school or University setting. It is not fair to the students are “favorites”, and much less fair to the ones that draw the ire of their instructors. Evidently Professor Blumner was never made aware of this. \n\r\nFrom day 1 of the class, it was apparent who she liked and who she did not. I was fortunate to be one of the ones who did not irk her. However, some of my classmates were not as lucky. For the entire semester, she would offer snide comments and pick on them. While I have no proof, myself and other students strongly believe that she graded the students she did not like much harder than the ones that she did. That is simply not fair, as students should be graded on the quality of their work, not whether they are loved or loathed by the professor. \n\r\nOn top of that, she used very elementary methods of getting our attention. If she had the smallest thing to say, Professor Blumner would incessantly clap her hands until we all were paying attention. While this was an effective method because all of the students just wanted the obnoxious noise to come to a halt, there has to be a better method of doing so. And we were by no means an obnoxious or unruly class. \n\r\nHer voice, while certainly out of her control, did nothing to contribute to the learning of the class. It was almost impossible to understand her, thanks to the scratchiness and low volume of her voice. In addition, she would often cut herself off mid sentence and say, “you know what I mean. ” Unfortunately, we rarely knew what she meant, and she was not making any effort to clarify things. I know you shouldn’t be prevented from doing something by something natural, like your voice, but there has to be some type of way around this. It really pained me to listen to her speak. \n\r\nI contemplated dropping this class very early in the semester, but we were assigned a partner and assigned a semester long consulting project. I did not want to disappoint my partner, and make him take on the gargantuan task by himself, so I decided to stick it out. In hindsight, that was one of the worst decisions I have made, academics-wise in all of my life. I should have convinced him to drop with me and take it next semester taught by a professor that was capable and not miserable.\n\r\nAs you can probably tell by now, I had a horrible experience with this class, and more importantly, the professor. One of the very few positives that I can draw from this is that I am happy her name is not associated with the business school. I feel like she is a serious detriment to the university as a whole. The fact that I am paying tens of thousands of dollars to attend this fine institution, and this is the quality of instruction I receive; well I find that to be completely unacceptable. \n", "rating": 1, "expected_grade": "B", "created": "2012-05-17T23:24:00Z"}, {"professor": "Ellen Blumner", "course": "ENGL394", "review": "Blumner may go down as one of the worst teachers the university has ever had. If Blumner does not like you on the first day of class your grade will be affected tremendously.  She plays favorites, and holds grudges for the entire semester.  Additionally, it is not that she simply holds grudges, she will attempt to make your life miserable and call you out in every class and grade you harder than other students in the class.  She has no problem sounding like a bitter/grumpy old lady.  \n\r\nIn terms of the actual class, everything is completely useless and tedious.  She believes that assignments are not busy work if she attaches a grade to them, so she will simply make assignments worth 1% of your overall grade that will take you hours to complete.  On top of that she does not follow her syllabus at all, and will change her guidelines and expectations on a person to person basis and will never clearly state what she wants.  Your grade will essentially come down to how much she likes you (and you will realize she likes NO ONE!)\n\r\nAdditionally, Blumner never really taught any classes.  For class, she would have groups of students present chapters from the textbook. Beyond that, she would instruct us to do meaningless book exercises, and then offer little feedback on the correctness of our answers. If you asked her a technical question, her response, more often than not was “consult the textbook.” Beyond that, she had one of her TA’s present a chapter lesson. I can hardly recall learning something of value from her. \n\r\nLastly, another point that I would like to touch on is the voice of the professor.  Now, i know this is nothing that she can control, but when teaching a class to numerous students throughout the day it really is important that the professor can speak.  Her voice might possibly be one of the most irritating sounds you will ever hear.  And i know many students can attest to this fact that it was indeed painful to listen to and became quite the distraction.\n\r\nIn conclusion, Do NOT TAKE HER CLASS or consider yourself warned!!", "rating": 1, "expected_grade": "A", "created": "2012-05-12T03:27:00Z"}, {"professor": "Ellen Blumner", "course": "ENGL394", "review": "Blumner is easily the worst teacher I have ever come across at this school.  I signed up for the class when it still said \"Staff,\" and what a mistake that was.  First day of class I came to realize that this professor had clearly just suffered a stroke because her speech was horrible.  Funny how the women who can't string a sentence together without stuttering is teaching English.\n\r\nI should have dropped the class the first day.  The project you complete for this class if beyond ridiculous.  You find a real world client and then complete 10 pages of single spaced writing per group member on the client's problem.  The syllabus in this class is meaningless.  She changes every assignment and due date.\n\r\nI got an A in ENGL101 and mistakenly took this class for business school purposes. I barely scraped by with a B from this professor.  She refused to acknowledge her mistakes and ended up giving me a 50% on an assignment that she deleted from my ELMS folder because after I uploaded it again it was past the due date.\n\r\nThe professor would consistently rip on her other sections.  I had a friend in the class before mine, and he would always tell how she hated my class.  At one point she even told our entire class that we were all lazy.  She told a few people they should drop the class and receive the 'W.'\n\r\nDon't take this class with this professor.  She is a miserable human being.  This class and this professor is the reason I got drunk Mondays and Wednesdays.", "rating": 1, "expected_grade": "B", "created": "2011-12-15T18:13:00Z"}, {"professor": "Ellen Blumner", "course": "ENGL394", "review": "I would not recommend this professor at all. She is very grumpy and takes every assignment very personally. She holds grudges about everything, especially if you miss a class (although I never did, I saw her do it to many other students). If you say something to her that she doesn't like, she gets very angry and can be outright mean. She called out or yelled at several students right in the middle of class in front of everyone.\n\r\nIf she decides she does not like you (which I think was more than half of the class by the time the class was over) she will never be nice to you again. She grades very unfairly. I actually heard her say to a student: \"I can't believe what your GPA is here at the University, I am going to make sure that is changed by the end of this course.\"\n\r\nThe other major problem was that she gave us a class syllabus, than basically did the exact opposite of anything the syllabus said. Every assignment was changed or completely unclear. She would say one way to do it in class, than post another way to do it online, than say to refer to the book, which was never the way she actually wanted us to do it. Than, when we got to class she would be in another one of her moods and would decide to throw in another part that essentially no one did, than proceed to mark down everyone else for not doing it, using the justification that one or two students did it as proof that we all should have known it was necessary. \n\r\nAlso, syllabus due dates were ALWAYS changed. I don't think a single one was the same as the syllabus said. This makes it extremely hard to plan out when to do the work ahead of time (as I have to do with an extremely busy schedule).\n\r\nI could go on even more about the problems with this professor, but to sum it up she is a grumpy old lady and a terrible teacher. Plus, the class material in ENGL394 was tedious and pointless. It was nothing anyone will ever use in the real world. STAY AWAY!", "rating": 1, "expected_grade": "B", "created": "2009-11-04T00:21:00Z"}, {"professor": "Ellen Blumner", "course": "ENGL394", "review": "sincere advice to fellow students: Stay away from her!!! \n\r\n-Strict grader/not fair grader (will not hasitate to give you \"zero\" on any assignment)\r\n-Not Friendly AT ALL (sometimes worse)\r\n-assignment instructions NOT CLEAR\r\n-WISPERS the ENTIRE LECTURE!!!!!!!!!!! it is very difficult to hear her.\n\r\nThat's All... wish you good luck if you take her cuz you gonna need dat :P\n", "rating": 1, "expected_grade": "B", "created": "2009-05-28T01:20:00Z"}, {"professor": "Katherine Robinson", "course": "ENGL394", "review": "She's nice and sweet. The work load in the class is not overwhelming. The group project was to put on a fake fundraising event for a non-profit organization. There's a big research proposal due at the end of the semester which had to be 2500 words long. \r\nOnly thing that annoyed me about the class was that she doesn't post grades online so you're left wondering where you stand in the class. \r\nMake sure you come to class because attendance is a part of your grade. And like any English class you write journal entries almost every day. ", "rating": 4, "expected_grade": "", "created": "2016-12-18T23:21:00Z"}, {"professor": "Karen Angeline", "course": "ENGL394", "review": "Easily one of the best professors for ENGL394. Took it online, so very difficult to be in touch but when you are - exceptional. Straight forward advice and a curriculum for a class which really makes you think about how to intellectually become a better writer.", "rating": 5, "expected_grade": "A", "created": "2016-04-17T21:11:00Z"}, {"professor": "Karen Angeline", "course": "ENGL394", "review": "I took this course the first semester she taught it online. There were some glitches at points in the semester, but overall she did a really good job teaching us. There was some busy work here and there, but it was a very relaxing professional writing course. The only thing I would suggest is that, during the beginning of the class, we had barely any work for about a month to 2 months. However, for the last month and a half, we had a major assignment due every 2 weeks. She is a very relaxed grader, so just make sure you follow her directions. I highly recommend taking her, this class was a very relaxed business writing class that did not require a lot of work, and I received an A.", "rating": 5, "expected_grade": "A", "created": "2015-12-20T00:40:00Z"}, {"professor": "Karen Angeline", "course": "ENGL394", "review": "Professor Angeline is one of the best professors at UMD and definitely the best writing professor I've ever had. She's extremely helpful and wants you to do well. She gives you practical advice that will actually be relevant to your career, and the workload is not overwhelming. Take this class!", "rating": 5, "expected_grade": "A", "created": "2014-02-17T20:37:00Z"}, {"professor": "Karen Angeline", "course": "ENGL394", "review": "Professor Angeline is a very nice woman. If you pay attention in her class, you will get an A. Four 2-3 page papers all year and the assignment sheet is very specific so you can do well.\n\r\nThe final seems daunting because it's 10 pages but it's actually very easy to write because of the format and topic. \n\r\nHighly recommended.", "rating": 5, "expected_grade": "A", "created": "2013-12-23T02:40:00Z"}, {"professor": "Karen Angeline", "course": "ENGL394", "review": "This class is a lot different than a lot of other junior english classes.  You don't have to work with a group at all, which is nice.  You have to think of a problem which exists at the university, then spend all semester writing different papers in different formats about the same topic.  Professor Angeline is really nice, and wants you to be succesful. Take this class!!", "rating": 4, "expected_grade": "A", "created": "2009-12-19T14:33:00Z"}, {"professor": "Blake Wilder", "course": "ENGL394", "review": "Not a great teacher in terms of prompt and or constructive feedback.  Expectations are certainly reasonable and he isn't an unpleasant person.  Not much else to say it's a professional writing course.  Wouldn't take a class because he was teaching it, wouldn't avoid one I wanted to take because he was either.", "rating": 3, "expected_grade": "", "created": "2018-05-11T06:39:33Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "As said below, you'll get an A but at a price.\r\n\r\nShe doesn't know how to use Google Drive or ELMS, but insists those are the best mediums. \r\n\r\nShe's bad at setting times to meet for the required conferences. Just overall unprofessional in communications - which makes me question why she's allowed to teach a professional writing class!", "rating": 1, "expected_grade": "A", "created": "2018-12-11T17:09:18Z"}, {"professor": "Pamela Orel", "course": "ENGL394", "review": "Very nice professor but so much work... :( \r\n5 stars for her personality, 1 star for the unnecessary work", "rating": 5, "expected_grade": "A", "created": "2019-04-01T23:41:29Z"}, {"professor": "Robert Oliver", "course": "ENGL394", "review": "He is a joke and takes everything too seriously. Be prepared for endless useless handouts that he'll read back to you all class. Nothing at all is taught in class but he takes extremely strict attendance. Missing more than 2 classes can have up to a 20% swing on your grade. Sit up front and kiss his butt (laugh at his stupid jokes, keep eye contact when he stares at you, ask two questions every class) if you want him to grade you fairly. Otherwise, be prepared for random 60%'s on assignments/papers without explanation (or maybe a single \"stronger analysis\" comment).  Avoid this man at all costs, this class is as pedantic as it gets. ", "rating": 2, "expected_grade": "B", "created": "2019-04-24T23:07:44Z"}, {"professor": "Holly Smith", "course": "ENGL394", "review": "She is such a great teacher. Never assigned work that was unnecessary. Business is all about short writing and that is what she taught in her class. If you are looking for a professional writing class this is extremely practical and the minimum amount of work, take 394 with Holly!  ", "rating": 5, "expected_grade": "A", "created": "2019-05-14T15:57:43Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "I can’t believe I have to take him. My father saw us on zoom and heard a snippet of class, and was shocked and amused with how he stated subjective things as fact in such an arrogant manner. I feel like I will do well in his class, but he is an annoying teacher to have- not someone I would want to know in a personal or professional setting. And he does love talking about himself.", "rating": 1, "expected_grade": "A", "created": "2020-09-20T14:51:27Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "SHE IS SUCH A NICE WOMAN. She is so sweet to all her students I do not know what these people are talking about. Although I have not finished her class, I know she truly cares about her students, and makes this class a lot of fun. ", "rating": 5, "expected_grade": "A", "created": "2021-02-05T02:35:08Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "This class was great! The course material was relevant and customized to each student. The class is based on a few discussion posts, minor assignments regarding thank you letters, and multiple drafts and discussions of the final paper. Our online class only met once a week, but perhaps class structure will change as we go in-person. The final paper regards a problem and solution of your choice and is easier to write because you get to choose the topic which can be based on your major. The class is also heavy on peer review. I highly recommend giving detailed and full responses to peer review as it helps your own writing and comprehension, but is also very important to the professor when grading. The professor was amazing and is genuinely interested in the topics he teaches. He is also available for discussions regarding assignments and is very understanding of any valid excuses that may arise. I recommend going to lecture as you'll most likely not be bored and group work is a priority for the professor. There is also no extra or \"busy\" work as in other English classes, only thoughtful reflection. Overall, I thoroughly enjoyed the class and strongly recommend this professor. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-17T17:13:54Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "She is sooo nice. Wasn't at all like the older reviews describe her as. I had a great experience with her. Assignments are relatively easy and she gives clear and concise feedback. She also tries to make class engaging, which I appreciate.", "rating": 5, "expected_grade": "A", "created": "2021-05-28T21:19:05Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Professor Rick equips you with practical tools needed in the real world. He’s passionate & informative about what he teaches!", "rating": 5, "expected_grade": "", "created": "2021-06-14T23:37:34Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "This course makes you think and gives you a chance to learn real life job skills. This course from any other prof is useless and boring. He runs this course like a workshop which makes it more engaging and participation-based than a regular class. \r\n\r\nHis bad reviews are from people who don't read his (detailed, and very clear) hw instructions.\r\nSorry, in the real world, you need to read instructions, or you don't get paid. \r\n\r\nWant to goof off and get an easy A? Want to waste your time and not learn? \r\nTake a different course.   ", "rating": 5, "expected_grade": "A-", "created": "2021-06-23T12:42:44Z"}, {"professor": "Karen Angeline", "course": "ENGL394", "review": "I definitely recommend Prof. Angeline for ENGL394 without a doubt. This was one of the most useful and informative classes I've taken at UMD. Prof. Angeline gave many opportunities to receive REAL feedback on your work to maximize your learning experience, and you can resubmit work for a higher grade once you've learned from your mistakes. If you put in effort and choose harder topics that challenge you to make the most out of the class, you can come out with a lot more knowledge and experience in business writing. ", "rating": 5, "expected_grade": "A+", "created": "2021-07-10T14:25:04Z"}, {"professor": "Karen Angeline", "course": "ENGL394", "review": "Taking this course over the summer has been quite a ride but Professor Angeline has made the experience informative and better. She gives very helpful feedback and allows you to re-write your essays to get a better score. I found using the peer-edit methods she presented to us allowed us to also learn where we went wrong from other classmates point of view. By the end of this class, you have learned and gained so much skills and leave as a better writing overall. Definitely take her class!", "rating": 5, "expected_grade": "A+", "created": "2021-08-18T17:24:30Z"}, {"professor": "Karen Angeline", "course": "ENGL394", "review": "Excellent professor! The lectures are very clear. The best part of taking her class is the feedback. She is really good at giving feedback and providing you with an opportunity to learn from her feedback.", "rating": 5, "expected_grade": "A", "created": "2021-08-31T15:21:52Z"}, {"professor": "Holly Smith", "course": "ENGL394", "review": "Wonderful teacher! Is enthusiastic about the subject matter, and has clearly laid out course requirements. Final project is a monster, but is assigned with MONTHS left in the semester. ", "rating": 5, "expected_grade": "", "created": "2021-12-15T17:30:18Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "Prof. Hatcher genuinely wants his students to do well. It's a small class and he really tries to connect with everyone he definitely knew everyone's name by the end of the semester. Definitely participation heavy but he makes it enjoyable to come to class. Very focused on peer review but that is pretty much the only homework there will be besides long term papers that he give many opportunities for one on one feedback. if you ask him good questions during class time and follow all the steps on time for the assignments you should get a good grade in the class. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-20T19:52:46Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Professor Rick is an extremely entertaining and engaging professor. He made a 3 hour long 6-9pm English class bearable and interesting. This class is not a cakewalk however and professor rick has very clear expectations that are outlined in his assignment instructions. If you follow his instructions and take his feedback to heart and apply it to future assignments then you're golden. Every time I met with him after class he would outline each and every thing I did right and wrong and how to improve in a respectful and kind manner. \r\n\r\nProfessor Rick also provides you with valuable writing skills that have helped me in all of my future classes and even with landing a job.", "rating": 5, "expected_grade": "B+", "created": "2022-02-02T16:19:03Z"}, {"professor": "Karen Angeline", "course": "ENGL394", "review": "This is an easy class but the professor is just rude. Terrible feedback on projects and doesn't even try to help. Honestly don't even know what her problem is. Course work is easy but I feel like the reviews on the professor as a person are a little outdated. ", "rating": 2, "expected_grade": "A", "created": "2022-02-25T16:39:23Z"}, {"professor": "Daune O'Brien", "course": "ENGL394", "review": "Actually terrible. The workload is so much more than all of the other teachers and she just doesn't care. Choose another professor if you can.", "rating": 2, "expected_grade": "", "created": "2022-03-04T16:25:14Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "She is a very nice professor and gives good feedback on the assignments. The class is not too difficult and a lot of it is group work.", "rating": 5, "expected_grade": "A+", "created": "2022-05-04T22:50:32Z"}, {"professor": "Carina Shi", "course": "ENGL394", "review": "Lots of work", "rating": 2, "expected_grade": "A", "created": "2022-05-11T17:32:28Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "Overall, he is nice and understanding professor. However, it was his first semester teaching, so he was a little bit disorganized. He didn't give us his instructions for the assignment until a couple days before the assignment was due. This is an easy class as long as you keep up with assignments and turn them in on time. Make sure you complete your rough drafts also because he will grade it on completion. Also, don't waste money on the textbook you will not need it. ", "rating": 3, "expected_grade": "A", "created": "2022-05-17T00:44:36Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "Professer Hatcher can be rude and a bit snarky. If your attendance is not perfect he will deduct points from your assignments even if you provide quality work. The overall workload is not heavy but your grade is pretty much completely dependent on attendance. I would recommend a different professor to fulfill PW requirements if possible. ", "rating": 1, "expected_grade": "", "created": "2022-05-19T20:30:52Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "Maybe the other comments on here were written by students who took the class online, but this class was by far the worst one I've taken at UMD. English has always been my favorite subject, but Hatcher changed my mind. Very rude in class and shows no understanding regarding other priorities students may have. Literally assigns dozens of peer review workshops to give himself less work when it comes to grading assignments. You'll receive little to no feedback from him, while your grade is basically based on your attendance. If you can't make it to every single class on time and do not get up to use the bathroom, good luck! There's no way to feel comfortable in the class, as he is weird. If possible, opt for another professor.", "rating": 1, "expected_grade": "", "created": "2022-05-19T20:34:34Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "Great professor for Professional Writing. Actually felt like I learned something from his class. Attendance is mandatory, but it is not taxing. Not too many assignments overall in the class; just a large focus on working on a semester-long proposal on a topic of your choice. Highly recommend. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-20T11:46:00Z"}, {"professor": "Radford Skudrna", "course": "ENGL394", "review": "Great choice for ENGL394. Not too many assignments, and provides great feedback. As long as you put in the time and don't procrastinate, his business writing course is very manageable. ", "rating": 5, "expected_grade": "A", "created": "2022-05-20T16:22:35Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Professor Rick provides everything you need and more as a business writing professor. His interactive lectures teach you in depth tactics to create a resume, produce a proper email/memo, and enhance your overall writing ten fold in just a semester. He uses gives his students the same advice that he would give to his professional peers.\r\n\r\nThe grading is extremely clear but tedious. If you pay attention to details it wont be a problem.", "rating": 5, "expected_grade": "B", "created": "2022-10-24T02:25:25.432124Z"}, {"professor": "Adam Lloyd", "course": "ENGL394", "review": "he's a real one. super understanding, considerate. the class material is inherently boring but he does his best. just turn work in, listen for important announcements, and you should be fine", "rating": 5, "expected_grade": "A", "created": "2022-10-25T20:53:48.344007Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "Never take his class. His class is extremely tough. His lecture is so boring and he doesn't give us any examples of essay but he expects us to write exactly how he want. Because of his too high expectation, the average grade on final draft of an essay was 53!! Also, I was so shocked when he announced that there is an Exam in the class cuz I never had exam in English class before. Anyways, never take his class. it's better to eliminate him from the UMD!!", "rating": 1, "expected_grade": "", "created": "2022-10-29T17:33:20.757957Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "Just don't. Avoid his class at all costs.", "rating": 1, "expected_grade": "", "created": "2022-11-03T04:22:41.764363Z"}, {"professor": "Jay Wilcox", "course": "ENGL394", "review": "Professor Wilcox is an exceptional professor who really cares about Business Writing and puts in the effort to make the class as enjoyable as possible. He is very well-spoken, extremely friendly, and is always there to help you. His classes are some of the most engaging I've ever been to, which really helps you to remember the content that is closely aligned with the major writing assignments. He prepares you well for the assignments by going over examples and peer-reviewing papers to highlight what he's looking for, as well as detailed feedback on each paper to help you on the next. There are many opportunities for extra credit and ample time to complete each assignment. Jay Wilcox is one of those professors you just never forget, and I guarantee you won't regret taking ENGL394 with him.", "rating": 5, "expected_grade": "A+", "created": "2022-12-05T23:44:44.739766Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "This professor is great. She enjoys teaching the class and is more than happy to help if you make mistakes. There is a lot of group work so your group can make or break the class.", "rating": 5, "expected_grade": "A", "created": "2022-12-24T01:13:58.067887Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "Pros: Absolute sweetheart of a professor. Responds quickly to messages and deeply cares about all her students.\r\n\r\nCons: One of the most boring classes I have ever taken. Class is in person rather than online. During class it is just reading the class page word for word and boring discussions. A crap ton of group work and busy work. Assigned a random group for the final paper - if your group sucks, good luck. \r\n\r\nThe class is not as free of an A as the distribution may suggest. You have to stay on top of the many boring assignments and the professor grades pretty strictly - she does allow resubmissions which is nice but time consuming.", "rating": 3, "expected_grade": "A", "created": "2022-12-28T17:32:31.400794Z"}, {"professor": "Jay Wilcox", "course": "ENGL394", "review": "If Wilcox is teaching, Just take the class! Seriously!! You wont regret it....", "rating": 5, "expected_grade": "A+", "created": "2023-01-06T12:06:17.949904Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Great professor! His knowledge and enthusiasm for Business Writing is legitimately off the charts. He wants you to succeed as much as possible, as well. Though, his teaching style can strike you the wrong way (at first) if you're not ready for it. He constantly calls on random individuals to read/participate whether they want to or not. Personally, I did not find this to be a problem (as it's really not a big deal if you mess up). Though, this caught me off guard the first couple of lectures.", "rating": 5, "expected_grade": "A-", "created": "2023-01-11T21:40:11.153495Z"}, {"professor": "David Todd", "course": "ENGL394", "review": "Professor cares about his student's success but does not communicate assignment procedures well. He is very unorganized, his elms page is a mess and as a result, much of his instructions are unclear. Additionally, he often leaves the beginning of class for 5 min or so to get TEA which I find discourteous considering students are paying for the course.", "rating": 2, "expected_grade": "B", "created": "2023-02-24T17:13:50.354913Z"}, {"professor": "David Todd", "course": "ENGL394", "review": "The most logistically challenged professor. Avoid him at all costs. Somehow finds a way to overcomplicate the most simple tasks and manages to waste your time through it all. \r\n\r\nMany people complain about his habit of starting every class fifteen minutes late but that's not even that bad when considering just how complicated he makes the structure of the class. His ELMS course has a thousand different due dates on it, half of which he tells you to ignore- whch makes it even harder to find what's actually due. The frustration when realizing you lose a couple points from an assignment simply because the course structure on ELMS didn't prepare you for it is nothing short of an embarassment for this institution.\r\n\r\nJust a terribly organized professor who ought to change his ways. In terms of his teaching ability however, I would say he is average and unremarkable. You'll certainly gain some value from this class but it'll be a hell of a lot easier with a professor who knows what they're doing.", "rating": 1, "expected_grade": "", "created": "2023-02-28T18:39:14.697763Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "Literally could be the worst professor I've ever had. Started the semester a fairly chill prof, and then idk what happened but he did a complete 180. Started lecturing us every day about how we aren't meeting his expectations and half the time it felt like he was bringing personal feelings into class. I seriously think he should pursue a different career bc it feels like he HATES teaching. \r\nHe came to the first day of class about 30 min late. This wasn't the only time he was late for class. He once said the only way late work will be excused is if you're in a coffin or if you're in a hospital bed. He once gave us what felt like a pop midterm where it was 3 pages front and back and handwritten. We had 30 min to do the MIDTERM. For the last 10 min, he goes ' I don't wanna be an asshole so you can use notes ' as if that was a saving grace. He would constantly talk about how he gets paid at the end of the week so he doesn't give a fuck. \r\nI really hope he quits or gets fired because I don't think he himself OR his students want him to be a professor.", "rating": 1, "expected_grade": "", "created": "2023-03-06T17:43:30.239227Z"}, {"professor": "Daune O'Brien", "course": "ENGL394", "review": "We did not really learn about business writing, if you are okay with learning about other things then its okay, but this class is just not what I signed up for. We do not really go in depth about the concepts of professional business writing, throughout the semester we did more research and humanities related stuff.", "rating": 2, "expected_grade": "B+", "created": "2023-03-29T03:12:37.446136Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "Dont know why she gets so much hate. Such an easy professor to take this class with. Its not possible to get lower then an A on each assignment as long as you follow the instructions.", "rating": 5, "expected_grade": "A+", "created": "2023-04-08T18:32:12.561190Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "This is quite literally the worst professor I have ever had. I try not to be dramatic when it comes to these thing's but he is genuinely horrible. Hatcher will treat you like you are in high school. He has told people to put phones away and AirPods away. He has no completion grades. He says he does, but he grades them based on quality as well. The most passive aggressive professor I have ever had. The harshest grader and overall, very unpleasant to be around. Take this class with one of the other thousands of professors who teach it.", "rating": 1, "expected_grade": "", "created": "2023-04-11T19:53:59.576779Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "Great professor, communicates quickly, and for all assignments, she encourages you to message her to ask about questions on assignment and she replies fast as hell", "rating": 5, "expected_grade": "A+", "created": "2023-04-23T22:52:06.707564Z"}, {"professor": "Erica Cochran", "course": "ENGL394", "review": "Nice professor, but she takes forever to grade. She just graded a major assignment for the course two months after it was due, and gave me a poor score, dropping my grade significantly. this major assignment was also the foundation for any future assignments (which have not been graded), and I could not improve my work based off of feedback since she graded the major assignment after I had already submitted other supplemental assignments. I have no idea what grade I will earn, since she has yet to grade any more heavily weighted assignments for the course.", "rating": 2, "expected_grade": "B+", "created": "2023-04-24T15:16:18.394944Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "Don't know why she is so low in reviews, its a free A, all the bad reviews they got A's , all you need to know", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T04:08:36.393170Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "Goated, easy ass class, avg for assignments 88+", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T04:08:46.741187Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "Great professor, easy and friendly", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T04:08:56.420052Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "Clare parsons is a great professor, her assignments are easy and straightforward, and she replies to emails super quick", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T04:09:14.873108Z"}, {"professor": "Garth Libhart", "course": "ENGL394", "review": "He's the man. Truly cares about his students and very welcoming class overall. His structure also makes it so you are hardly overwhelmed by big writing assignments. Definitely take him", "rating": 5, "expected_grade": "A", "created": "2023-04-25T18:32:21.594905Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Professor Rick is easily one of the best professors at UMD. He openly admits that he is a stickler for details, but if you really try on the assignments that are only due once or every other week, it's not hard to get an A on every assignment. There's no busy work, the readings take 10 mins max to do, and the class itself is extremely engaging. He is a great speaker and does an awesome job at not making the 3 hour class feel so daunting. Professor Rick is extremely knowledgeable and makes the course content really stick. The class was honestly fun, there was never a dull moment and he is relatable! I got so much out of his class, he really wants you to do well and learn. An easy A if you take his feedback with a grain of salt, pay attention, and show genuine interest.", "rating": 5, "expected_grade": "A", "created": "2023-04-25T23:51:18.993760Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "His assignments aren't hard as long as you follow instructions. His classes are a lot of fun, and he makes it a point to constantly interact with students.", "rating": 5, "expected_grade": "A+", "created": "2023-05-04T16:38:35.802133Z"}, {"professor": "Sajeela Yaqub", "course": "ENGL394", "review": "Terrible professor. Does not care about her students or respect their time at all. This was an asynchronous, 3-credit class, and we had 3-6 hours, sometimes more, of work to do every week. There are 4 major assignments that make up your grade, and if they weren't time-consuming enough, she also posts irrelevant discussions to add on to the course load. We had to write a MINIMUM 18-page research paper in under 2 weeks! Would not recommend at all. Even though she's a generous grader it's not worth the stress and hours upon hours of work per week. Take it with anyone else. The TAs carry this class and grade everything but the final submissions-- they were more active and engaged with the class than the actual prof. Awful, awful professor.", "rating": 1, "expected_grade": "A", "created": "2023-05-04T17:11:28.995895Z"}, {"professor": "Blake Wilder", "course": "ENGL394", "review": "Blake is a pretty cool guy. The class itself is pretty boring and there can be a decent amount of assignments that seem redundant but he tries to make the class engaging. Reasonable grading expectations and gives flexibility for absences.", "rating": 4, "expected_grade": "A", "created": "2023-05-10T15:25:56.211525Z"}, {"professor": "Blake Wilder", "course": "ENGL394", "review": "Takes a while to get feedback, but overall he is a good professor. I suggest you take him for business writing if he is available. Make sure you attend class because he does take attendance.", "rating": 4, "expected_grade": "A", "created": "2023-05-10T15:29:59.945798Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "Overall the class was fairly easy and manageable. The biggest issue was with prof Hatcher whose lectures were boring and felt pointless. Most of the stuff he lectured about I already knew and he would lecture about readings from weeks before. Prof Hatcher means well but can be annoying to deal with, especially when class participation is slow he gets upset and makes snarky comments. Treats students like high schoolers.", "rating": 1, "expected_grade": "A", "created": "2023-05-10T16:37:38.984195Z"}, {"professor": "Garth Libhart", "course": "ENGL394", "review": "Chill guy. He sometimes talks a lot and you'd get bored easily. His comments were very helpful on our assignments. Sometimes, he'd make us read poems from famous poets such as Shakespeare. I still don't understand why he made us read the sonnet from William Shakespeare. Say it was really awkward in class. I still don't get it how it related to the business writing. Also, this business writing class isn't like teaching you how to write an email or memo in a professional way. You'd have a big project (a big paper) you'd be working on over the semester and bunch of assignments that pile on that.", "rating": 5, "expected_grade": "A", "created": "2023-05-16T00:37:25.362653Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Attendance is mandatory, he reviews slide decks each class with a few exercises. Very particular - flexible with some things but unmoving with others.", "rating": 2, "expected_grade": "A-", "created": "2023-05-21T23:34:14.173715Z"}, {"professor": "Daune O'Brien", "course": "ENGL394", "review": "Professor is quite flexible with timelines and gives chances for each student to provide feedback, or ask questions through weekly check-ins. Expectations for assignments are pretty clear. There is a major project throughout the course which can be done with group mates as an option. Overall workload is reasonable and there are chances for extra credit.", "rating": 5, "expected_grade": "A+", "created": "2023-05-24T20:51:32.654050Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Ignore the other reviews they’re fake. This class is up to you, if you want highly involved class participation and hard grading. The assignments aren’t bad and he does make class fly by, but compared to other ENGL394 courses, they have less coursework and much easier grading.", "rating": 2, "expected_grade": "A-", "created": "2023-05-27T22:21:14.379870Z"}, {"professor": "David Brookshire", "course": "ENGL394", "review": "Dr. Brookshire is hands down one of my favorite English professors I've had. I took his business writing class asynchronously over the summer and the class content was really easy, he is lenient with due dates and is really considerate. His Zoom office hours were very helpful when it came to the big assignments. I highly recommend him!", "rating": 5, "expected_grade": "A+", "created": "2023-07-02T16:22:11.727882Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "one of the most boring classes. everything feels like busy work and I don't feel like I learned anything whatsoever. too much unnecessary group work as well. you should look for a prof that allows this class to be online instead of in person.", "rating": 2, "expected_grade": "A", "created": "2023-08-31T13:10:45.874242Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Probably one of the best teachers I've ever had. My class period was long and late at night, however, Professor Rick never failed to keep the class's attention. He's funny, energetic, and genuinely cares about his students. You will learn so many skills that you actually use in the real world (how to send professional emails, present/create engaging slideshows, and create effective résumés). I don't think other professional writing courses offer what this class does. You'd be foolish not to go with Professor Rick.", "rating": 5, "expected_grade": "A", "created": "2023-08-31T14:23:04.269070Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Professor Rick's ENGL394 course has been one of the most useful courses I've taken at UMD. He's 100% committed to helping students grow both professionally and personally. GREAT sense of humor, and what you learn in class you WILL apply to your real life. Professor Rick is very open to feedback and genuinely cares about his student's success. Show up to every class, ask questions, do the readings, and it's the easiest A you'll get.", "rating": 5, "expected_grade": "A", "created": "2023-09-14T14:28:08.708059Z"}, {"professor": "Holly Smith", "course": "ENGL394", "review": "Do not take her. She has a weird grading scale which only allows you to get an A, B, C, D, or F in the class (no plus or minus). She is an extremely tough grader, and at times it seems like she is just making things up. There is never a strong rubric and she does not provide feedback in comments so you must explicitly seek it out. Final paper will usually drop you a letter grade. Will not give you above a 90 if you mess up formatting on your papers (this includes missing a singular space between lines). But she is very nice and approachable! Lectures are short and workload is extremely manageable.", "rating": 1, "expected_grade": "A", "created": "2023-10-31T16:23:31.791136Z"}, {"professor": "Anjula Batra", "course": "ENGL394", "review": "She is definitely not the professor you want to choose for ENGL 394. Her instructions are unclear and she is strict with the papers and group works. She has some conflicting instructions which make people confuse.", "rating": 1, "expected_grade": "", "created": "2023-11-10T02:09:13.489992Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "Class busy work activities are not tough but they are time consuming at times but thats to be expected as a writing class. However, on big writing assignments it is like he expects you to read his mind when it comes to grading. He gives draft assignments and gives little to no crucial feedback and you'll think you're fine and then you'll get your final grade back he'll give completely different feedback. He should work on his feedback and make it more valuable instead of it just being surface level. Overall a \"fine\" professor but with hindsight I'd probably take a different professor.", "rating": 2, "expected_grade": "A", "created": "2023-11-10T21:03:25.777049Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "I don't really understand the bad reviews. Granted, I took ENGL 394 in an asynchronous style, but he wasn't a bad professor. The only part of the class that I didn't like was how we were put into groups of 3 for each discussion post and part of the grade was replying to a peer, but the peers I was with would never complete the post in a timely manner, so I would often forget to reply and get points off. But that is my fault.", "rating": 5, "expected_grade": "A", "created": "2023-11-13T22:10:31.422586Z"}, {"professor": "Blake Wilder", "course": "ENGL394", "review": "Very laid back and approachable. The course is easy and if you come to class and do your assignments you will get a good grade. He is also very lenient on absences but does take attendance.", "rating": 5, "expected_grade": "A", "created": "2023-11-14T14:51:20.363029Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "this man is a very poor communicator, especially for an asynchronous class.  he also accepts no late work, so 12:01 means that you could get a zero on an assignment. the grading is also very skewed, making some assignments worth significantly more than others, so be sure to keep an eye on that.  the discussion groups are also made of about 3 people, which makes it nearly impossible to get ahead on discussion assignments, as you are waiting for the same 2 people to make a post to comment on because if you don't do this you will also lose a lot of points.  Take this class for the easy A and Rob is making that a much harder-to-read goal. taking it fully asynchronous is also very hard to remember that it exists, especially because this is a junior-level writing class and quite literally everyone taking it has more important things to think about", "rating": 1, "expected_grade": "B+", "created": "2023-11-15T04:22:42.726648Z"}, {"professor": "Pamela Orel", "course": "ENGL394", "review": "Pros:\r\n- The way we kept at the same assignment through multiple attempts was helpful for improving grades and understanding content.\r\n- The peer evaluations were a great way to see whether you were on the same page as other students, and there was often helpful feedback from other students' reviews.\r\n- There was a good balance between small assignments and large assignments, and the time commitment each week was fair.\r\n- The leeway in terms of extensions was great. I almost never ask for extensions, but this semester I had a particularly tough workload and needed to move my schedule around fairly often. The instructor was both gracious and generous with extensions.\r\n- The extra credit offered in this course is extensive. It gives students a little more comfort about their grades, while still making them put in some work to gain that credit.\r\n\r\nCons:\r\nThe assignment descriptions, the resources offered to students, and the instructor's feedback/grading left a great deal to be desired.\r\n- The assignment description were usually many paragraphs of muddled suggestions about what that a given assignment's theoretical purpose was. The fact that I had to reread the descriptions 4+ times for each assignment just to figure out where to start is an indication that it was poorly written/organized. I spoke with other students in the course about this, and they also commented on how confusing, long, and poorly structured each assignment's instructions were. Since this is an English course, I was very disappointed to see that the instructor was not held to the same standard as students when it came to clear, concise writing.\r\n- The resources offered were typically just articles or websites that had even more theoretical descriptions of the given assignment. Oftentimes, all a student needs is A) examples of completed works and B) a template. There were a few examples of completed works for larger assignments, which I greatly appreciated. Templates were few and far between, unfortunately.\r\nMultiple times, the instructor added this suggestion on the assignment description: \"There are some templates available in Word that you can use.\" This was confusing, because Word has hundreds of templates, most of them very different from each other. I want to be able to focus the quality of my writing, NOT whether I have the correct template. Another way of saying this: this course made the wrong tasks difficult. I would have loved to see one, simple template/outline available for each assignment.\r\n- The instructor's feedback was sometimes baffling. She would leave comments that made very little sense; I was genuinely confused by the meaning sometimes. I don't mean that I disagreed with her feedback, I mean that I sometimes had to ignore her suggestions (or take a guess at what she meant), because the comments she left could be interpreted in multiple ways. It is understandable that there is a lot of content coming in that she must grade, and it is probably hard for her to keep up, but I wish she had taken a few extra minutes to make sure that the feedback was more clearly actionable.\r\nE.g. \"Add more sources here, to support concept X\" or \"Add more research-backed arguments in this section, similar to what you had in section Y\", etc.\r\nIt is important for the instructor to provide feedback on the ideas and overall feel of each paper, yes, but if her advice is going to be broad then it should be much clearer than it was for most of my assignments.\r\n- The instructor's grading was a little questionable. The range for most assignments was roughly 85%-95%, with very little deviation from assignment to assignment. That tells me that this instructor was mostly grading based on the grade range she wanted the course to have, and she was not necessarily giving grades based on what a student actually deserved.  While I understand that compassionate professors often give a little leeway to students whose work is subpar, I was very surprised to see how infrequently students were given A+ grades.", "rating": 3, "expected_grade": "A", "created": "2023-12-06T15:43:10.072739Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "She is the best teacher ever! Grades leniently and makes the classroom fun to work in. This is coming from someone who doesn't like writing that much.", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T20:47:07.837289Z"}, {"professor": "Kara Pleasants", "course": "ENGL394", "review": "I took ENGL394 this fall and would 100% recommend Professor Pleasants. She is very structured and organized, and her lectures and assignments reflect that. Even though this is an asynchronous course, I always felt like I stayed on top of my work because she would send out weekly announcements detailing the schedule we should follow. She is a fair grader, but you definitely need to allot time to do assignments, especially the business proposal.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T00:43:37.036007Z"}, {"professor": "David Todd", "course": "ENGL394", "review": "Please God do not take any classes taught by this professor. This is probably the first review I have ever written on this site and it is because I believe it is imperative to avoid this professor at all costs. The workload for his version of this class are far more then basically every other version of ENGL394, and the way he explains everything makes no sense. He also just makes everything far more complicated then it needs to be, and the final project for the class can be basically over 20 pages. I haven't even mentioned the worst part about this professor, which is the fact that he basically shows up 15-20 minutes late to every class. It is actually unreal how often he would just stroll in 20 minutes late. It was probably the most disrespected I have felt as a student. I agree with the other comments, do not take this class with him no matter what.", "rating": 1, "expected_grade": "A-", "created": "2023-12-07T17:59:10.473290Z"}, {"professor": "Clare Parsons", "course": "ENGL394", "review": "The class is an easy A and she would give us 100% on basically everything even if I handed it in like 4 days late. However, it does feel like a lot of work for an English class that's required. I don't really feel like I learned anything and just did a lot of busy work for nothing.", "rating": 4, "expected_grade": "A", "created": "2023-12-11T20:23:17.493842Z"}, {"professor": "Kara Pleasants", "course": "ENGL394", "review": "Amazing professor, she expects quality work but gives great feedback and is flexible with deadlines.", "rating": 5, "expected_grade": "A", "created": "2023-12-12T04:16:46.259784Z"}, {"professor": "Nicole Cuffy", "course": "ENGL394", "review": "Not that much writing to do. Two things are due every week but most of the time it was just a discussion post. There was a paper, infographic, resume, and eportfolio throughout the semester. She does accept late assignments most of the time. \r\nShe was not very clear with her grading and took a long time to grade the assignments.", "rating": 3, "expected_grade": "A-", "created": "2023-12-23T15:24:35.889842Z"}, {"professor": "Nicole Cuffy", "course": "ENGL394", "review": "She was nice, and the course was pretty easy. There were very few assignments. However, she was not very responsive and took too long to grade. Towards the end of the semester, she graded many of the assignments which left students unsure about their grades for most of the semester.", "rating": 3, "expected_grade": "A", "created": "2024-02-01T04:03:07.766717Z"}, {"professor": "Pamela Orel", "course": "ENGL394", "review": "Everything in the reviews is 100% spot on. She makes it very hard to perform well and improve when you're basically just thrown into a fire to start writing without any kind of instruction, template, references, examples, etc. Very poorly written assignment descriptions especially for an English course. Grading and feedback is extremely questionable and makes it feel as though she didn't actually read your work. I really regret taking this professor, I feel as though I did not have a chance to learn anything nor grow as a writer.", "rating": 1, "expected_grade": "", "created": "2024-02-27T03:57:49.142930Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Professor Rick’s class is super engaging and informative. He’s very passionate and knowledgeable about writing and wants everyone to learn. There’s no busy work or textbook for the class. Overall, if you follow the instructions on assignments and don’t rush them, you’ll do well.", "rating": 5, "expected_grade": "A", "created": "2024-03-11T01:59:47.225247Z"}], "department": "ENGL", "course_number": "394", "name": "ENGL394", "title": "Business Writing", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits.\nIntensive practice in the forms of written communication common in the business world: letters, memos, short reports, and proposals. Focus on the principles of rhetoric and effective style.\n<i>Click here for more information on professional writing courses.</i>", "is_recent": true, "geneds": null}