{"average_gpa": 3.6109514118544896, "professors": ["Daniel Pendick", "Scott Wible", "Christopher Crane", "Joseph Wappel", "John Matthews", "Martha Thomas", "Kisa Lape", "James Goodwin", "Eleanor Tipton", "Joseph Angelella", "Michael Schmidt", "Ruth Osorio", "Justin Lohr", "Barbara Berman", "Candice Shaifer", "Rachel Box", "Walter Knorr", "Bethea Kleykamp", "Tanya Paperny", "David Kohn", "Meredith Gray-Grener", "Erin Wilson", "Kyle Garton-Gundling", "Ashlie Kauffman", "Kevin Wisniewski", "Michelle Moncrieffe", "Nicole Cuffy", "Michael Kolakoski", "Robert Lucci", "Peter Witte", "Zachary Frank", "Eric Bond", "Sheila Lalwani", "David Miles", "Elizabeth Marshall", "Danielle Griffin", "James Goodwin", "Justin Lohr", "Kisa Lape", "Aysha Jawed", "Elizabeth Marshall", "James Goodwin", "Michael Schmidt", "Michelle Moncrieffe", "Nasim DarouieHaghighi", "Zachary Frank", "Danielle Griffin", "Elizabeth Marshall", "Eric Bond", "James Goodwin", "Jay Wilcox", "Joseph Angelella", "Justin Lohr", "Katherine Oneill", "Kisa Lape", "Michael Schmidt", "Michelle Moncrieffe", "Aysha Jawed", "Elizabeth Marshall", "James Goodwin", "Joseph Angelella", "Joseph Wappel", "Justin Lohr", "Kisa Lape", "Michael Schmidt", "Michelle Moncrieffe", "Roberto Leon", "Simone Daleo", "Zachary Frank", "David Miles", "Joseph Angelella", "Michael Schmidt", "David Miles", "Joseph Angelella", "Michael Schmidt", "Joseph Angelella", "Justin Lohr", "Kisa Lape", "Joseph Wappel", "David Miles", "Elizabeth Marshall", "Eric Bond", "James Goodwin", "Kevin Wisniewski", "Elizabeth Chang", "Michelle Moncrieffe", "Rachel Cote", "Rachel Penman", "Anney Bolgiano", "Aysha Jawed", "Elizabeth Chang", "Elizabeth Marshall", "Greg Deinert", "James Goodwin", "Justin Lohr", "Kevin Wisniewski", "Kisa Lape", "Lucy Sheehan", "Michael Schmidt", "Michelle Moncrieffe", "Nasim DarouieHaghighi", "Joseph Angelella", "Justin Lohr", "Kisa Lape"], "reviews": [{"professor": "Arthur Reynolds", "course": "ENGL395", "review": "I love this guy.  Yes, he's late to class.  Yes, he doesn't really teach anything throughout the semester.  Yes, he goes off on tangents throughout the entire class.  But the tangents are HILARIOUS.  He really has a gift for words and is willing to help you with all the assignments to ensure that whatever you turn in to him will always come back an A.  Almost all the assignments he gives are assignments you would have to have done anyway: cover letter, CV, personal statement.  There's one final research paper on any topic, but he lets you do it in groups so it ends up at around 7 pages per person.  Show up for class, participate a little, bring in your paper for him to review and he'll love you.\n\r\nAs for class time, just do the crossword or sudoku.  Bring your laptop and work on homework.  Study for another class.  As long as you don't disrupt class, he's perfectly fine with it.  \n\r\nFor a class that is required for graduation, he's the best and easiest teacher to have.  Highly recommend!!", "rating": 5, "expected_grade": "A", "created": "2009-12-15T13:17:00Z"}, {"professor": "Arthur Reynolds", "course": "ENGL395", "review": "Dr. Reynolds is disorganized and always late to class. He wastes class time by talking about random current events and only spends maybe 5-10 minutes actually covering his advice for assignments and tips for writing them.  He will read drafts and make comments on them, so try to make the drafts as close as possible to final so you can incorporate any suggestions.  Dr. Reynolds' lack of organization and advic annoyed me a lot, but it seems like many people worked a lot harder in other sections and still didn't learn very much, so maybe he's ok after all.", "rating": 3, "expected_grade": "A", "created": "2009-03-08T01:07:00Z"}, {"professor": "Arthur Reynolds", "course": "ENGL395", "review": "The ideal Tech. English professor. \r\nHe's laid-back and minimizes the amount of work you have to do, but if you want honest feedback on your personal statement or resume, he's helpful. \n\r\nThe actual class-time however, is just a waste of time. He'll let you do other work in his class, though, so I suppose you could make good use of it. ", "rating": 5, "expected_grade": "", "created": "2008-07-01T23:10:00Z"}, {"professor": "John Matthews", "course": "ENGL395", "review": "Dr. Matthews was straightforward in his expectations. It is not difficult to do well in this class if you make sure you are meeting the criteria he asks for. Class can get awkward sometimes.", "rating": 5, "expected_grade": "A", "created": "2013-12-30T02:34:00Z"}, {"professor": "Joseph Wappel", "course": "ENGL395", "review": "Really nice guy.  Overall I didn't learn that much specifically on health writing, but learned a lot about grammar and consision/cohesiveness and how to cater my writing to different kinds of audiences. He's really intent on grading based on grammar/concision/cohesion so make sure to focus on what he says in class.  Make sure to get 100% on his quizzes and they will help your grade a lot.  Not that much work throughout the semester but do not procrastinate on the final project which is a pretty long paper.  ", "rating": 4, "expected_grade": "A", "created": "2012-05-25T09:19:00Z"}, {"professor": "Joseph Wappel", "course": "ENGL395", "review": "Great professor as long as you respect him and his assignments.  Highly recommended.", "rating": 5, "expected_grade": "A+", "created": "2011-09-06T21:13:00Z"}, {"professor": "Joseph Angelella", "course": "ENGL395", "review": "Fantastic professor!He tells you exactly what he wants from you, and doesn't grade outside the rubric. His class is also really fun for an ENGL class, so much so, that I enjoy going to it. Take him!", "rating": 5, "expected_grade": "A", "created": "2019-04-03T13:15:19Z"}, {"professor": "Joseph Angelella", "course": "ENGL395", "review": "BEST PROFESSOR. Ross is fantastic! Even though this class was online this semester, Ross was very accommodating and encouraging throughout and would always give personalized feedback. Definitely a decent workload but he structures the class so that everything throughout the semester contributes to the final project. Always quick to respond to questions and emails. Great guy and awesome professor!", "rating": 5, "expected_grade": "A", "created": "2020-12-09T22:16:05Z"}, {"professor": "Zachary Frank", "course": "ENGL395", "review": "Amazing!! He is the best.", "rating": 5, "expected_grade": "", "created": "2021-01-26T01:26:05Z"}, {"professor": "Joseph Angelella", "course": "ENGL395", "review": "The most amazing professor at UMD, hands down. He has so much respect for his students and really gives everyone room to grow on their own and is extremely understanding and caring. Ross is really inspiring and hysterical and has taught me so much about professional writing and even life! Highly recommend that you take this course (or any course) with him, even if you aren't necessarily planning on being in the healthcare profession. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-09T16:45:36Z"}, {"professor": "Danielle Griffin", "course": "ENGL395", "review": "Gives the best writing feedback I have ever received at a college level. Extremely friendly and is passionate about the topics she covers. Very solid instructor with my only note being that her section of 395 seems a bit more labor intensive than her peers, but you will come out of it with actually useful professional documents and improved writing skills. ", "rating": 5, "expected_grade": "A-", "created": "2022-01-06T19:26:19Z"}, {"professor": "Aysha Jawed", "course": "ENGL395", "review": "Professor Aysha is a very devoted teacher and gives you assignments that will help you in the future too. Easy grader, will first suggest edits on your draft and then grade it after you work on your mistakes. Lecture does get very boring especially because it is a 3 hour long class, but very helpful too.", "rating": 5, "expected_grade": "", "created": "2022-04-11T23:33:39Z"}, {"professor": "Joseph Angelella", "course": "ENGL395", "review": "Prof. Angelella was awesome. Super nice guy and very accessible by email or zoom if you needed. Also very understanding when I had some late assignments. 100% recommend him. Online in the summer btw but I would take him in person in the school year too.", "rating": 5, "expected_grade": "A+", "created": "2022-07-04T22:40:09Z"}, {"professor": "Jay Wilcox", "course": "ENGL395", "review": "Professor Wilcox is definitely a professor I will never forget! Professor Wilcox was a great professor who genuinely wanted his students to be better writers in the professional setting while at the same time providing multiple opportunities to excel in his class. The class was at 11 am at Tawes so it was quite a walk from where I lived, but I always tried to attend class even though attendance wasn't mandatory. Professor Wilcox made the class very interactive, interesting, and fun while still keeping a very professional setting. He even allowed us to revise any major assignments for points back if you did poorly. If Professor Wilcox is teaching for your semester, he is an absolute MUST PICK of a professor, you will not regret it!!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T08:06:12.718567Z"}, {"professor": "Simone Daleo", "course": "ENGL395", "review": "Very kind, flexible, and understanding professor. Really enjoyed the project the second half of the semester. Was a very social class with frequent laughs. If you do the work, you will get an A.", "rating": 5, "expected_grade": "A", "created": "2022-12-27T14:40:04.475838Z"}, {"professor": "Kisa Lape", "course": "ENGL395", "review": "She was such an amazing professor and really cared about her students. She has given students extensions if they needed them and was willing to meet with you if you needed extra help. I highly recommend taking her!", "rating": 5, "expected_grade": "A", "created": "2023-02-01T17:24:24.112767Z"}, {"professor": "Nicole Cuffy", "course": "ENGL395", "review": "Oh damn, she's not teaching here anymore? That sucks. She's a great professor honestly. The cons are that she took a long time to grade stuff but that's all I can think about. \r\n\r\nWe took this class for one night a week for a semester for 3 hours and somehow it was not an insufferable experience. She gave us everything we needed to know each week for a month and we had like 5 writing assignments due. She gave us full autonomy over what we could write, as long as we stuck to a general \"theme\", which I loved. She also taught us some insider secrets and unspoken rules, like reading the room before revealing your pronouns and how you can actually be too informal in applications and you should \"match their tone\". That sounds like common sense but there's actually a lot of hidden details in navigating healthcare applications. \r\n\r\nIt was one of my favorite classes here at UMD.", "rating": 5, "expected_grade": "A", "created": "2023-03-21T19:34:03.993890Z"}, {"professor": "Kevin Wisniewski", "course": "ENGL395", "review": "Great Teacher! I always looked forward to this class. He is super understanding are genuinely cares about everyone.", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T23:35:45.644897Z"}, {"professor": "Kevin Wisniewski", "course": "ENGL395", "review": "Literally so understanding and truly wants the best for you! He would cancel classes on days that were meant for peer review or if it wasn't needed. He didn't like to make us do busy work. Had a blast in this class.", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T23:38:39.726140Z"}, {"professor": "Michelle Moncrieffe", "course": "ENGL395", "review": "I'd start off by saying that if you don't want to go into the medical field/this isn't a required class for you, then you might not want to take it. ENGL395 is very heavy on research, and there are consecutive assignments based on the same exact topic where you're essentially building off each assignment. Since the class is small, Prof Moncrieffe also encourages participation and discussion, though she's kind, understanding, and flexible regarding anything participation based. She makes her expectations clear several times, and she will deduct points from an assignment if you didn't follow the directions, but to be fair, it's on you at that point. This class can be very eye-opening in terms of the focus you want to have within your medical field, so for those who are certain about their career in medicine, this is perfect for them. For everyone else, this class would probably just seem like a professional writing class that takes too much time and effort - for them, it's better to just do the other classes, online or otherwise.", "rating": 4, "expected_grade": "A+", "created": "2023-05-11T17:06:14.365367Z"}, {"professor": "Michael Schmidt", "course": "ENGL395", "review": "Professor Schmidt is so cool to work with! He is very lowkey and his class is organized so well. I find that he is pretty easy to talk to and easygoing in class as well. He grades fairly and strictly off the rubric. Assignments are spaced out well, and he does well to cover the content in class. He has a large block of office hours to help you if you need the time/support, and he is very communicative with the class. Overall, I had such a good time in this class and got a lot out of the assignments.", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T00:49:39.191691Z"}, {"professor": "Kevin Wisniewski", "course": "ENGL395", "review": "Best professor I've had at UMD. Super understanding for busy midterms weeks and would push assignments and cancel classes for students to study. Being someone that hates writing, he made assignments in such a way that it was fun to write. Take him.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T02:20:51.404882Z"}, {"professor": "Michael Schmidt", "course": "ENGL395", "review": "Professor Schmidt is definitely a teacher that cares a lot about his class and will actually take the time to grade rather than just hand out As. However, he structures his class in such a way that you learn a ton. He really cares about all of his students and tries his hardest to get to know each and everyone of them. This class definitely takes some effort and care and it won't be a mindless A, but he is definitely someone that you could form a meaningful relationship with.", "rating": 5, "expected_grade": "A", "created": "2023-05-29T06:38:54.148746Z"}, {"professor": "Joseph Angelella", "course": "ENGL395", "review": "This professor is such an angel. Although this was a summer course, he truly made his welcoming spirit known. You could tell how much he cared about his students. If taken in the summer, there will be something due just about every day of the week, but it is manageable. I don't know how it is in the fall and spring semester, but during the summer we weren't required to write any papers. He always gave really great, detailed feedback and is a VERY lenient grader. Just make sure you complete all aspects of an assignment and take into consideration feedback given from him and your peers. I don't see how anyone could not get an A. Take him!!!", "rating": 5, "expected_grade": "A+", "created": "2023-07-10T16:35:59.981843Z"}, {"professor": "Joseph Angelella", "course": "ENGL395", "review": "Took this course in the summer. Honestly, you're an idiot if you don't take Prof Ross to satisfy the professional writing requirement. He is the easiest grader and gives full points as long as you follow the directions and submit completed work. Gives good feedback. Although the class was 100% asynchronous, I could tell Prof Ross is kind and humble. He has a really welcoming spirit and cares about his students. I don't know if it's because I took it in the summer, but we were not required to write any papers.", "rating": 5, "expected_grade": "A+", "created": "2023-07-22T19:28:31.580311Z"}, {"professor": "Michael Schmidt", "course": "ENGL395", "review": "He is such a kind professor that really cares about students doing well in the class. Gives additional points to help you get a good grade, and also grades really good. He helps you out a lot and has long office hours if you need help.", "rating": 5, "expected_grade": "A", "created": "2023-11-01T01:19:50.183117Z"}, {"professor": "Kisa Lape", "course": "ENGL395", "review": "She is sooooo sweet and super understanding of the hard classes a student has outside of ENGL395! She gave frequent extensions and opportunities to make up work. A lot of the assignments were busy work though, and I felt like I was wasting my time by doing the assignments/attending her lecture.", "rating": 4, "expected_grade": "A", "created": "2023-11-20T20:25:15.338367Z"}, {"professor": "Zoe Alsop", "course": "ENGL395", "review": "She's new to the university, but genuinely one of the best professors I've had here; very friendly and approachable. She is very flexible and always took class feedback into moving deadlines for the assignments around.\r\nHer draft feedback tends to be a little long-winded and it may seem at first she is asking a lot of you, but for me, this wealth of feedback was always very helpful and constructive going into the final submissions.\r\nIn-class lecture activities don't ask much of you, quite a bit of (sometimes helpful, sometimes not) peer review in class.\r\n\r\nLots of writing (to be expected, it's in the course description.)", "rating": 5, "expected_grade": "A-", "created": "2023-12-07T19:29:06.034407Z"}, {"professor": "Michelle Moncrieffe", "course": "ENGL395", "review": "Professor Moncrieffe was an amazing teacher! She was very upfront on what she is looking for, and is very understanding on the difficulties of being a college student. While she does challenge us, she doesn't go out of her way to put extra pressure on us. If you do the work, you will succeed in this course. I would love to take her again. You can tell she genuinely cares about her students and wants to hear our opinion on certain topics. I'd definitely recommend her if you are planning on taking this course.", "rating": 5, "expected_grade": "A", "created": "2023-12-12T03:19:37.792200Z"}, {"professor": "Kisa Lape", "course": "ENGL395", "review": "Prof Kisa is so nice and she was always willing to give extra time on assignments. She also frequently moved back assignment due dates for us during the semester. That being said, I found engl395 kind of difficult and annoying because I don't think I will use a lot of the stuff we did, and a lot of it was busy work. I would recommend looking at engl390 or some other engl39_ because this was honestly a lot of work, but I don't think it was Prof Kisa's fault. Our large assignments included an Eportfolio, research review article, grant proposal, and public health campaign. You do a rough draft and peer review for each large assignment, and the first half of the semester has a lot of discussion posts that were useless in my opinion. She never gives anyone 100%, but in my experience doesn't grade too hard. Her canvas page is honestly somewhat difficult to navigate and she's pretty unorganized. There would be different directions for the same assignment in different places, and it was difficult to know where to find some stuff on canvas. She takes FOREVER to grade. You will not know your grade until the end of finals, but as you can see in the grade distribution she gives a lot of As. For me, the work slowed down after the research review article because we were in groups for the grant proposal and public health campaign, which is nice since everyone is dealing with their science classes, but this class felt like so much work in the beginning. Overall, prof Kisa is a kind professor who wants you to succeed and is always willing to help, but the class is really annoying.", "rating": 4, "expected_grade": "A", "created": "2023-12-17T23:21:04.148819Z"}, {"professor": "Zoe Alsop", "course": "ENGL395", "review": "Professor Alsop was a great professor and made this class very manageable. It was her first semester teaching, but she did her best to give us as much information and resources as possible. She was super flexible with deadlines as long as we got our assignments in by the time we said we would and her smaller assignments were helpful to prepare for the big ones.\r\nDefinitely ask her for help if you need it, she gave me a lot of comments while I was working on my papers and it was super helpful. She’s very approachable and happy to help!", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T19:50:06.417094Z"}, {"professor": "Rachel Cote", "course": "ENGL395", "review": "Dr. Cote was not initially supposed to be teaching this course, but I'm very glad she ultimately did. Dr. Cote was not only extremely accommodating when it came to adjusting submission dates for work, but she also provided excellent feedback on writing assignments. Additionally, despite providing extensive feedback and improvements on minor issues, these minor issues wouldn't reduce your grade heavily, ensuring that you will do well in this class as long as you submit everything on time and follow the requirements. There was one group project that was relatively annoying, and it sucked that we didn't do a personal statement assignment, but as far as improving my writing, I definitely feel that I did that upon completion of this course. I definitely would recommend Dr. Cote for ENGL395.", "rating": 5, "expected_grade": "A+", "created": "2023-12-27T23:17:46.906278Z"}, {"professor": "Aysha Jawed", "course": "ENGL395", "review": "Dr. Jawed has been my favorite instructor from my time at UMD! She is incredibly kind and devoted.\r\n\r\nDr. Jawed also gives you incredible advice on your writing, and will help you become a writer. In this class you will work on a resume, cover letter and/or personal statement that you can use for professional/graduate life. You will also work on a review paper that is a great learning process.", "rating": 5, "expected_grade": "A+", "created": "2024-01-24T19:51:22.574048Z"}, {"professor": "Kevin Wisniewski", "course": "ENGL395", "review": "incredible professor, cares about students, doesn't care about deadlines. class is fun and he makes the experience enjoyable. Easy grader and he really gives people good feedback. one of the best profs at umd.", "rating": 5, "expected_grade": "A+", "created": "2024-01-29T20:11:09.573281Z"}], "department": "ENGL", "course_number": "395", "name": "ENGL395", "title": "Writing for Health Professions", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits.\nFocus on accommodating health-related technical material and empirical studies to lay audiences, and helping writers to achieve stylistic flexibility and correctness.\n<i>Click here for more information on professional writing courses.</i>", "is_recent": true, "geneds": null}