{"average_gpa": 3.460469667318982, "professors": ["Scott Wible", "Danuta Hinc", "Anna Szczepaniec-Bialas", "Gerard Holmes", "Radford Skudrna", "Joseph Good", "Joshua Buursma", "Alexandra Calloway", "Justin Lohr", "Christopher Crane", "Katherine Joshi", "Sarah Dammeyer", "Konstantinos Pozoukidis", "Peter Rouleau", "Katie Bramlett", "Blake Wilder", "Marina Ellis", "Elizabeth Marshall", "Kathleen Orr", "Elizabeth Marshall", "Elizabeth Marshall", "Sonney Wolfe", "Elizabeth Marshall", "Rebecca Holden"], "reviews": [{"professor": "Alexandra Calloway", "course": "ENGL297", "review": "She is a very nice person and cares about her students. Her class was an hour and 15 minutes and for the most part, she just chatted about random stuff which was annoying. I'd rather be talking about the class but who am I to complain. The class is an easy A and she is willing to work with students. You don't need the team writing book and I found a pdf for the technical writing textbook. You only need to read the textbook when she assigns something related to it. It's common sense stuff though. Overall, if you need an easy DSSP I would talk this class.", "rating": 4, "expected_grade": "A+", "created": "2021-01-22T22:28:43Z"}, {"professor": "Elizabeth Marshall", "course": "ENGL297", "review": "This class turned out to be professional writing in the workplace and not an introduction to professional writing. I was told the class is an easy A and yes it is, most of the grades are based on completion and the course load is really small there are only a few larger assignments where you have to interview a writer for an individual project and group project and you have to write papers about it but it is pretty easy. The professor is just trying to get people to work well in groups as if they were in the workplace. The professor overall is very unorganized and confusing at some points, assignment due dates usually get pushed because she didn't do something she was supposed to do. Attendance is not mandatory but some days there will be in-class graded assignments and if you aren't there it is sometimes difficult to make it up without an excused absence. The class is pointless but I took it as a gen-ed and didn't really have to worry about this course and my grade in it.", "rating": 3, "expected_grade": "A", "created": "2023-05-08T17:14:10.650788Z"}, {"professor": "Elizabeth Marshall", "course": "ENGL297", "review": "I really enjoyed the class because the class focused on working in team, finding professional writer for interview. There are very few assignments outside of the class. The course follow labor based grading, so turning assignment will ensure the points. Indeed, it is an easy general education class.", "rating": 5, "expected_grade": "A", "created": "2023-12-22T15:32:49.684409Z"}, {"professor": "Elizabeth Marshall", "course": "ENGL297", "review": "Liz is honestly a really solid teacher. I'd give her 5 stars but her class was just annoyingly boring and slow at times. The workload for this class was very easily manageable, but just make sure you pay attention to deadlines as you have to plan ahead for some things. The actual assignments are relatively open-ended, and Liz is really good at working with you if you need direction or help. A lot of this class in class is discussion-based, so be prepared to talk and speak up. That being said, my experience was it doesn't really matter what you say as long as you say something so don't stress it's not that deep. The only other thing was that attendance is important. I missed a few classes which set me back on deadlines and most notably participation assignments in class. Legit just show up, engage a bit here and there, do your work on time, and you're golden. The course had one big group assignment, one big independent assignment, a few in-class participation assignments, like a minor essay or two, and just a few discussions. Also, the textbook is useless I didn't buy it and never needed it.", "rating": 4, "expected_grade": "B+", "created": "2024-01-25T18:45:30.223166Z"}], "department": "ENGL", "course_number": "297", "name": "ENGL297", "title": "Introduction to Professional Writing", "credits": 3, "description": "<b>Prerequisite:</b> ENGL101.\nIntroduction to the rhetorical principles and professional practices of professional writing, particularly the research, writing, communication, analytical, and technological skills needed for the Professional Writing minor. How culture and technology relate to the work of professional writing; design principles and rhetorical moves; digital tools, research skills, and writing strategies of professional writers. Develops skills needed to publish a writing portfolio that showcases students' professional writing competencies and projects your professional writer identities.", "is_recent": true, "geneds": null}