{"average_gpa": 3.0725806451612905, "professors": ["Michael Winett", "Ann Mason", "Michael Winett", "Anna Josephson", "Konstantinos Pozoukidis", "Elizabeth Catchmark", "Joseph Wappel", "Dylan Carpenter"], "reviews": [{"professor": "Michael Winett", "course": "ENGL398E", "review": "Pretty terrible and the class did nothing to improve my \"professional writing\". Takes months to grade your assignments and when you get it back it has very little feedback on the actual quality of the paper...all he does is grade on grammar and comma usage. He takes off points from your participation grade if you send him emails in the wrong format. Seriously. I felt like I was in the 6th grade again or something. Also the grade distribution here is not accurate whatsoever alot of the class ended up with C's", "rating": 2, "expected_grade": "", "created": "2011-12-18T20:03:00Z"}, {"professor": "Michael Winett", "course": "ENGL398E", "review": "Winett is by far the worst professor I have had at Maryland.  Since it is an English class, attendance is mandatory (and boy is it painful).  Most of his classes consist of him half-heartedly going over the assignments and then talking about nothing for the rest of the class.  He is extremely meek and soft spoken.  He is also very indirect when asking people to do things.  He has an extremely specific way of sending him emails and assignments and if you don't follow his format perfectly, you get points off, which is ridiculous.\n\r\nAt the beginning of the year, he said he would focus on the content of your writing, not the grammar or little mistakes.  HOW WRONG THIS IS.  In all of the assignments, he took off for the small things such as missed commas or a misspelled word.  This leads me to my next point.  Out of the 6 assignments in the class, we only got the grades back from 2 of them before the class ended.  How are we supposed to know where to improve if we have no feedback?\n\r\nThe class consisted of 6 assignments.\n\r\nThe first assignment was a rhetorical analysis of a paper that you had written prior to the class.  Let me start by saying Winett is obsessed with these rhetorical analyses.  I believe they are some of the most pointless assignments I have done in my 3 years at Maryland.  They are hard to explain without you seeing them, but they are basically just restating what the purpose of the original assignment is.\n\r\nThe second assignment is an analysis of a peer-reviewed journal article.  Luckily, the article doesn't have to be about economics and can be about anything.  This assignment wasn't that bad.  Basically, it was just an analysis of the different parts of a journal article based on the criteria that Winett created.\n\r\nThe third assignment was a planning memo.  This was another one of those stupid rhetorical analysis papers.  This time, it was related to the final paper, which I will get to in a little bit.\n\r\nThe fourth assignment was a resume and cover letter.  I thought this would be easy because I already had a resume and cover letter that had gotten me multiple interviews and offers with some of the biggest names on Wall St and in the accounting world, but in all actuality, it was completely different than what I thought.  I had a resume and cover letter based on the templates provided by the Office of Career Services at the business school.  However, this was not sufficient for Winett.  Unless our job experience was directly related to the job we were applying for, Winett wanted us to delete our work experience and instead put in statements of what we had done in our classes.  For the last 3 years, I have been taught to NEVER EVER do that because everyone takes the same classes and does the same thing.  I have been taught that any work experience is good to put on the resume because it shows you can hold a job and can ultimately relate to a different job (ie. restaurant job = experience in a fast paced environment, working with deadlines, etc).  Also, we had to do a stupid rhetorical analysis for our resume and cover letter too, which was again completely pointless.\n\r\nThe fifth assignment was a persuasive presentation.  It might as well have been any kind of presentation you want, because ultimately Winett didn't give two shits about what you talked about as long as you gave the audience an \"experience\".  I honestly think Winett didn't care if it was persuasive or not.  Every time we talked about the presentations in class, he always talked about giving the audience an \"experience\", but never about how to persuade the audience.  Most of the presentations ended up being informative presentations about some hobby that the student was interested in, but he seemed to love them because they got the audience involved and gave them an \"experience\".  Don't forget, we had to write a freaking rhetorical analysis for this too.\n\r\nLast but not least, the sixth assignment was a journal document.  This meant we were to write an article that would be published in an undergraduate peer-reviewed journal.  This is the biggest assignment of the course, and he spent forever talking about it.  However when he talked about it, he never really said anything useful.  This project was such a pain.  Of course, lest you forget, we had to write a rhetorical analysis for this too.\n\r\nOverall, DO NOT EVER TAKE A COURSE WITH WINETT.  He is a terrible professor.  The assignments are totally pointless.  This class sucked.", "rating": 1, "expected_grade": "A", "created": "2011-12-13T22:18:00Z"}, {"professor": "Michael Winett", "course": "ENGL398E", "review": "He changed the content of the course.  Often, his expectations were unclear and students were frequently confused about what he wanted.  He was willing to help clear things up though.\n\r\nHe doesn't teach that much about writing itself, more about rhetoric.\n\r\nHe required that the major semester paper be published in a journal.  For a undergrade, this can be very difficult.\n\r\nOverall, he's a nice guy and he grades pretty leniently.  Now that he has taught 398E, he may have a better feel for it in the future.", "rating": 3, "expected_grade": "A", "created": "2009-06-16T10:30:00Z"}, {"professor": "Konstantinos Pozoukidis", "course": "ENGL398E", "review": "The actual class was fine and straightforward. For some reason, he was so rude to me when giving feedback and answering my emails. I'm really unsure whether this was targetted at me or if he just spoke to every student this way. He was also very condescending when answering questions. It doesn't affect learning in the class tbh, but it just made the experience unpleasant.", "rating": 1, "expected_grade": "A", "created": "2023-05-02T17:21:53.550863Z"}, {"professor": "Anna Josephson", "course": "ENGL398E", "review": "Great teacher. Class is a lot of work, although I assume all of the professional writing classes are similar. She's really nice, comes off as very genuinely interested in helping students, and has very good feedback for all assignments. You should take her for professional writing even if the class itself may not interest you. Best teacher i've had at this school.", "rating": 5, "expected_grade": "A", "created": "2023-05-19T01:32:25.385686Z"}], "department": "ENGL", "course_number": "398E", "name": "ENGL398E", "title": "Writing About Economics", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits.\nExamines the characteristic genres of writing in modern economics, including theoretical and empirically based journal articles, reports for government and commercial clients, and economic information presented to a variety of non-professional audiences, such as citizen-oriented and public policy organizations. Students learn how to analyze these documents rhetorically and how to communicate economic information using the content, arrangement, style, and visual graphics best suited to the purposes and standards of particular audiences. Core assignments include a genre-based journal and document analysis, presentations on economics-related topics for both economists and non-professional audiences, and a major research-based writing project for an audience outside of the classroom.\n<i>\n<b>Prerequisite:</b> 60 credits and completion of ENGL101 or equivalent. This course satisfies the professional writing requirement.</i>\n<i>Click here for more course information.</i>", "is_recent": true, "geneds": null}