{"average_gpa": 3.1070684758598923, "professors": ["Robin Earnest", "William Schatz", "Michael Winett", "John Kim", "Nicholas Hoffman", "Barbara Lauren", "Kenton Camper", "Seema Vithlani", "Anne-Marie Carstens", "Roberta Ward", "Kelly Hebron", "Erica Smith", "Brandee Pettus", "John Kim", "Michael Winett", "John Kim", "Kelly Hebron", "Michael Winett", "Sara Faradji", "Esthus Amos", "John Kim", "Sara Faradji", "Simone Daleo", "Nasim DarouieHaghighi", "John Kim", "Esthus Amos", "Kelly Hebron", "Sara Faradji", "Esthus Amos", "Janet Shim", "John Kim", "Sara Faradji", "John Kim"], "reviews": [{"professor": "Robin Earnest", "course": "ENGL392", "review": "This ended up being a fairly easy class, but I would also agree with the previous reviewer in that Professor Earnest probably means well, but the most challenging aspect of the class is knowing what she wants. Compounding this problem is the fact that she is slow with returning grades back and by the time the final paper was due, we only had about 15%-20% of our graded work back (this was a summer class, but still). I tried working around this issue by emailing her, only to have specific parts of the email answered, and a follow-up email asking why I had received a certain grade was not responded to at all. I’m still not exactly sure what she wanted and while taking class I even heard two other classmates talking, one of whom had actually turned in the wrong assignment and received a B+.\n\r\nThe class itself consisted of a lot of grammar exercises, like how not to use ‘not,’ to be moderate in the use of passive voice, and avoiding 'big' words like prior. If you’d really like to learn, however, and increase your writing skills, I would recommend Mark Forrester for the junior English, who is harder, but really pushes you to become a better writer with great feedback and a college-level discussion.", "rating": 2, "expected_grade": "", "created": "2012-10-08T23:18:00Z"}, {"professor": "Robin Earnest", "course": "ENGL392", "review": "Earnest means well but doesn't go over things a lot. She is confusing and muddled. She is often late to class and rarely collects homework. Then she'll randomly ask for an assignment out of the blue for the first time in three or four weeks. The knowledge will prepare you but be wary of taking her course. She moves super slowly and then super quickly, but not necessarily in accordance with how the class is going. ", "rating": 2, "expected_grade": "B-", "created": "2012-04-09T17:19:00Z"}, {"professor": "Robin Earnest", "course": "ENGL392", "review": "Dr. Earnest is one of the best professors I've had so far. Her background in law has given her extensive knowledge about the legal system, so if you are considering a career in law, then she can help answer any questions you might have.\n\r\nSome of the work is challenging, but the grades are fair, the workload is fair, and Dr. Earnest really does go out of her way to help you improve, so you should do fine.\n\r\nProbably the two best things about the class were that A) Dr. Earnest is very nice and helpful to everyone, and B) the work you do is very relevant to law and can serve as an introduction to the type of work one is asked to do in law school. ", "rating": 5, "expected_grade": "", "created": "2009-05-23T15:03:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "I will, from this day on, tell every one of my friends who are considering taking ENGL392 to not take it with Schatz. \n\r\nI am and English major and am going to law school, so I figured that a rigorous writing class would be good for me. Not to toot my own horn, but I am VERY proficient in grammar and professional writing, so I thought I would do relatively well. \r\nMy papers have been drenched in red ink for mistakes that I'm sure don't exist outside of Schatz's mind. I don't mind being wrong; if I blatantly went against something the professor said, then I'm wrong and that's fair. But when I get points off for things that were NEVER mentioned in class, not intuitive at all, and are superfluous at best, I'm pissed. \r\nFighting for your grade or against Schatz is pointless. I've spent many office hours trying to convince him that he never mentioned the problem in class with proof from other students, and I received nothing but condescension in return. \r\nI understand that legal writing is hard and legal writing in law school is hard. I shouldn't be getting A+ on every paper I spit onto and turn in. But this class is not academically challenging, it's personally challenging, to the point where I feel like I'm playing Frogger with my grade. The professor is disorganized, condescending, and hypocritical (he has at least 1 spelling error in every email; how can he hold me to a high standard when he himself can't spell?).\n\r\nIn short: arbitrary grading based mostly on personal preference, barely any help for those who question their grade, no respect for timeliness, and your hard work and actual knowledge of the material is not reflected in your grade", "rating": 1, "expected_grade": "A-", "created": "2014-05-15T19:06:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "EDIT... I am updating this review one year later to reflect my refined opinion of this professor now that I have been most of the way through 1L at UC Berkeley (top ten law school).\r\nI am about to submit a brief for an *actual* law school writing class, and it made me reflect on this horror of a professor. I have just a couple points.\r\n1) Schatz's grading in no way resembles how the grading is done in law school. Especially true for legal citations which Schatz is ultra critical about, but the law schools aren't. Indeed, I can discern no logical reason for the way he grades.\r\n2) Schatz grades on a worse curve than law schools do (Schatz gives about 1 A for every 25-30 students).  We are required to take legal writing first two semesters, but in the first semester, Berkeley doesn't even put our grades on the transcript because they knew legal writing has such a steep learning curve.\r\n3) This class only marginally helped me for my actual legal writing class.\n\r\nRegarding everything else, I think it's all covered pretty well in the reviews below. You guys are paying for your education and you deserve a competent, useful teacher, and a reasonable shot at getting an A comparable to the rest of the professional writing classes. They all effect your GPA the same. My advice, skip this class... and demand your money's worth.", "rating": 1, "expected_grade": "A-", "created": "2014-03-06T00:12:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "I left this course shocked at the level of disregard for student concerns and Schatz's exorbitantly brutal grading methods (many of which I will probably never understand). \n\r\nI nearly dropped this course a couple months ago, and it appears that I should have done so. If you take Schatz you will learn something about legal writing, but your scores will probably not reflect your effort or quality of work on any level.\n\r\nSchatz graduated from Georgetown Law, and that's great--awesome. Doesn't make him an expert on everything or his interpretations correct. This seems to be his view, and it handicaps any ability he might have once had to teach anyone who isn't a 3L student.\n\r\nWAKE UP, Schatz. This is UMD, not Georgetown Law. We have jobs. We have other classes. And we most certainly did not enter your class with the ability to read minds and with experience enough to enable us to write \"at the A+ level\" (with legal writing) you said you came in expecting to see!\n\r\nObviously, a few students have had exceptionally good experiences with Schatz (mostly his TAs). Good for you. You'll probably have an easier time in law school than the rest of us, if you go.  \n\r\nThis review is for the purpose of informing other students of professors' quality of teaching and that is what I intend to do. A friend of mine said she had Ernest and that she was easily approachable and worked well with most people. I don't know if she still teaches this class, but if you still want to take it, try it with her.\n\r\nAs terpalum said, you will not receive any form of clear direction when you're trying to write for assignments. I just tried disputing a grade and his explanation was that I was wrong. What a joke! On top of it, he is someone who rarely (if ever) admits he is wrong (which, ironically, is most of the time). \n\r\nI felt that I was teaching the class half the time because people would come to ME asking me what was going on and how to do it, yet I also consistently received grades that were FAR below fair. Clearly, I was one of the few people who could even GUESS correctly at how to approach some of these assignments.\n\r\nHis rude and unapproachable demeanor only makes things worse. It almost doesn't matter how well you do your job, because he will not do his.\n\n", "rating": 1, "expected_grade": "A", "created": "2013-12-13T10:55:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "This guy is really the worst professor I have had at UMD. He is extremely unclear with assignments. He is messy and unorganized. You will do nothing of value in class but critique articles in the Diamondback and peer review.. except nobody understands what is going on because the professor doesn't tell you. Yet this terrible professor somehow thinks its cool or of value to give super harsh grades. Quite ironic. Take another class or switch professors. This guy should be fired. ", "rating": 1, "expected_grade": "", "created": "2013-05-13T01:27:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "This professor is terrible. Don't be fooled by the 2 or 3 good reviews, read further down and you will see a half dozen reviews that are much more accurate. Prof. Schatz is the most unorganized, unhelpful and most unfair professor I have had. Yes, the class will help prepare you for law school, but only because you are forced by the assignments to think like a lawyer. You would learn equally much if the class were taught by a monkey, but you would be much happier.", "rating": 1, "expected_grade": "A-", "created": "2013-02-28T11:29:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "I would strongly advise not taking this class with Professor Schatz. He is very unclear about what he wants. He is very disorganized. He grades extremely harshly. You will be very stressed out about this class. It is helpful if you are going to go to law school, but it is NOT worth it.", "rating": 1, "expected_grade": "A-", "created": "2013-01-09T11:53:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "Please don't think you'll be the exception. I took this class thinking hard work would defy the poor grade distribution. I was wrong. This was my only C in college and probably my biggest mistake. If you don't have to take this class, don't. \r\nGoing to class is pointless but attendance is mandatory. Literally useless peer reviewing 7/10 classes. Subjective grading doesn't even begin to cover it. And harsh grades on assignments are his thing (Cs and Ds on personal statements anyone?). Expect unrelated examples of assignments and then be told to go do it for the next class. And completely illegible comments on assignments.\n\r\nNice enough guy but a little full of himself. Skip it if you can and pick another professor if you can't. ", "rating": 1, "expected_grade": "C", "created": "2012-12-21T10:42:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "Legal Writing with Schatz was one of the more difficult classes I have taken at Maryland. The assignments are challenging and will prepare you for 1L writing assignments. I learned a lot from them and  improved as a writer. However, in comparison, the assignments are much easier than dealing with Schatz. Don't expect him to follow the syllabus at all. Expect assignment sheets to be emailed out 12 hours before the assignment is due. He is extremely disorganized and can be a pain to deal with.", "rating": 4, "expected_grade": "A-", "created": "2012-05-22T11:48:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "Schatz is a great professor and a great guy. He is willing to listen to students' concerns and help where he can. He provides very useful feedback on assignments and is willing to change the date of assignments if need be. \r\nThe class was overall pretty good, it seemed to go by quickly each time. The assignments in the beginning of the semester aren't very hard but they become prgressively harder. However, this is to your benefit if you want to go to law school because it prepares you for your first year.\r\nThe key to doing well is to attend every class. By the end of the semester, the only students to show up and/or to complete the final project were students that showed up 99% of the time because they actually knew what they were doing.\n\r\nOverall, if you're planning on going to law shcool, I would definitely take this class. If not, take another junior english.", "rating": 4, "expected_grade": "B+", "created": "2012-05-21T14:03:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "If you are at all considering going to law school - TAKE THIS CLASS, and TAKE IT WITH PROFESSOR SCHATZ! He is by far the best professor I've ever had at Maryland, and his was also the most challenging class I've ever taken at Maryland. If you take this class, Schatz will definitely push you beyond any limits you may have thought you had, and he will bring out potential that you never thought you had in you. You will no doubt come out of this class thinking and writing like a lawyer, and you will be 100% more prepared for law school. He is extremely responsive to student concerns, and he has this amazing way of connecting with each and every one of his students. He is a tough grader, but only because he has justifiably high expectations for his students and wants to see them succeed. Don't get me wrong, the class is not impossible by any means. I worked my ass off and got an A-. TAKE THIS CLASS WITH SCHATZ! You won't regret it. ", "rating": 5, "expected_grade": "A-", "created": "2012-05-19T19:49:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "Schatz will help you write a great personal statement. He may give you a great recommendation for an internship. However, you are rolling the dice if you think hard work will get you an A in his class. No amount of hard work or following instructions will result in an A. The rules change and shift arbitrarily. If you ask why you lost points on assignments, there will be an awkward silence. If you want to improve your chances of getting an A, then brown nose. Don't question his grading criteria because it is vague if not non-existent and he will become threatened. Do be critical of your classmates and the Diamondback. Again, there is no amount of hard work that will get you an A in this class. I thought I was the exception when I read these reviews before taking the course. I wasn't.  ", "rating": 2, "expected_grade": "B", "created": "2010-12-18T18:47:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "Schatz is a hard grader and is not particularly organized. However, if you want to go to law school, this class will put you way ahead of your peers. Whether you like it or not, you will learn how to write, research, and think better in this class. I would absolutely take this class again. ", "rating": 4, "expected_grade": "A-", "created": "2010-12-16T16:31:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "Professor Schatz handed us the syllabus on the first day of class and that was the first and last time he ever looked at it.  Assignments were emailed to us the night before the class they were due.  Our \"semester\" project was given to us about a week and a half before it was due, and he even had the nerve to change it to a group assignment a few days later, changing the whole dynamic of the project about a week before it was due.\n\r\nOverall, he is extremely disorganized, unprofessional, and VERY frustrating as a teacher.", "rating": 1, "expected_grade": "", "created": "2010-12-09T12:24:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "This was possibly one of the worst classes I have ever taken at this University.  I'll admit, I learned a lot but it was not worth the frustration and unrewarded effort I experienced throughout the semester.  \n\r\nI would not suggest taking ENGL392 with Schatz unless you really have nothing else going on and can dedicate all your time to this class.  \n\r\nAdditionally, it was hard to determine where I stood in this class (grade-wise) because 25% of your grade is based on participation.  Also, the assignment break down did not work out how he had planned so it was hard to tell what each assignment was really worth. I'll be interested to see what I get in this class.", "rating": 1, "expected_grade": "", "created": "2009-12-16T17:50:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "I received a B on this class. I was a frustrating class, Prof. Schatz is by fat the worse professor I have ever had.  He gives you assignments that are due hours before class starts, he posts stuff on elms very late. He is not understanding at all.  ", "rating": 1, "expected_grade": "b", "created": "2009-09-01T14:57:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "Class was always interesting and useful, but I was often frustrated because assignments were posted hours before class or hidden deep in elms.  \n\r\nVery tough grader.  I never had any idea what my grade in the class was... I was shocked when I got an A. I definitely was more stressed out over this class than I have ever been before. ", "rating": 3, "expected_grade": "A", "created": "2009-06-01T14:56:00Z"}, {"professor": "William Schatz", "course": "ENGL392", "review": "Although I received an A in this course, I would advise going another route.  Minimal instruction is provided with maximum expectations.  The class was repeated scolded for getting something wrong that he never taught us.\n\r\nAlso, expect to get homework via email a few hours before its due.\n\r\nENJOY", "rating": 1, "expected_grade": "A", "created": "2009-02-05T18:30:00Z"}, {"professor": "Michael Winett", "course": "ENGL392", "review": "For those of you who want to go to law school, close your ears during class, go home, and study for the LSATs. I honestly have no idea how this man has a job. He tries to teach you how to be clear and concise by enabling readability statistics on Microsoft word. If you use too big of a word, you will have to change it to a more basic word because that really makes you a better writer (sarcasm). Stupid class. ", "rating": 1, "expected_grade": "", "created": "2016-08-31T00:04:00Z"}, {"professor": "Michael Winett", "course": "ENGL392", "review": "Winett is a terrible professor and did very little, if anything at all, to help improve my professional writing.  For every assignment we had to do these \"rhetorical analyses\" that weren't based on any sort of rhetoric, but were instead a pointless and arbitrary outline we had to fill out. The only purpose these served were to show him how much effort we put into our work, because apparently he couldn't figure that out from the quality of our writing.  His instructions were vague at best. One time I was trying to understand an assignment and he simply said, \"well the point is very subtle.\" When I asked him for more guidance, he just smiled and walked away.  Seriously, if you can avoid taking a class with him, do.", "rating": 1, "expected_grade": "A", "created": "2016-01-28T20:02:00Z"}, {"professor": "Michael Winett", "course": "ENGL392", "review": "DON'T TAKE THIS CLASS.  LISTEN TO ALL OF THE REVIEWS.  IT IS THE WORST MISTAKE YOU WILL EVER MAKE.  Most of the time, I just assume that negative reviews are students who slack off. I AM NOT ONE OF THOSE STUDENTS, AND I HATE THIS CLASS.  It was the worst decision I've made at UMD.  Almost 10% of his students drop the class; how is he still an instructor here!!!!!!  He doesn't teach ever, and he only care about his stupid \"rhetorical analysis\" which he made up entirely himself.  If he marks you off for grammar, it's based on his own subjective interpretation of his preferred writing style. MOST IMPORTANTLY, he claims that the goal of professional writing is to write at an 8th grade level WHAT THE ACTUAL F.  YOU WILL LEARN NOTHING TAKING THIS CLASS.", "rating": 1, "expected_grade": "B", "created": "2014-03-08T19:04:00Z"}, {"professor": "Michael Winett", "course": "ENGL392", "review": "I am pretty sure he is one of the worst professor's that I have had. Finals have just started and I honestly have no idea what grade I will be getting in this class. He does NOT give assignments back in a timely manner and when he does give them back his grading is absurd. I sincerely wish that I had not taken ENGL392 with him. Even if I get an A, I will still agree that he is a horrible teacher. ", "rating": 1, "expected_grade": "", "created": "2011-12-15T12:45:00Z"}, {"professor": "Michael Winett", "course": "ENGL392", "review": "Horrible professor, at an intellectual and professional level. It's true that it's easy to get a good grade but he is also inconsistent with his grading (It is obvious he doesn't put any effort into grading). He makes things unclear and unnecessarily boring, and is not ashamed to be blatantly ignorant about the subjects he teaches. By far worst professor I've had at UMD. Take someone else if you care to learn something. If you want an easy A, just know you'll be miserable for three hours a week .", "rating": 1, "expected_grade": "A", "created": "2011-04-25T15:06:00Z"}, {"professor": "Robin Earnest", "course": "ENGL392", "review": "Overall, I really enjoyed Dr. Earnest's course. I do feel like I learned a lot. She is very kind and enthusiastic about teaching, so I felt comfortable about participating in class. However, I definitely agree with the other reviewers who mentioned that it is difficult to know what she wants. \r\n\r\nMy TA, Blanca was so helpful and kind. She even helped me when she was busy studying for her exams when I emailed her about an issue with my open legal memo assignment. Blanca is amazing!!", "rating": 5, "expected_grade": "B+", "created": "2018-05-31T22:46:30Z"}, {"professor": "John Kim", "course": "ENGL392", "review": "A genuinely kind professor who cares about his students and does a lot to make the learning experience fun.", "rating": 5, "expected_grade": "A-", "created": "2019-12-18T04:25:12Z"}, {"professor": "Michael Winett", "course": "ENGL392", "review": "Okay I get everyones concerns like I really do but at the same time this class was cake if you just moderetly pretend you care. I have absolutely no idea what happened and learned basically nothing but got an A because if you just ask him to explain stuff and email him and ask questions privately he remembers your name and wants you to do well. Like I read these reviews and was so convinced I was going to fail but I did completely fine and put like 0% effort in. Take him because its easy if you just try to pretend lol ", "rating": 4, "expected_grade": "A", "created": "2022-01-24T22:01:11Z"}, {"professor": "Michael Winett", "course": "ENGL392", "review": "Hes a very kind man, and he has the best intentions for his class, but his lectures got to be unbelievably frustrating at times. He's one of those people that will never outright answer your question, hell answer it with a question or just you a hint and prompt you to answer your own question. I would highly recommend you read the material for the module before you come to class because he prompts discussions on it and my class looked like a bunch of idiots when clearly only 2 of us had read the material before class. Its not even that much, like 10-15 minutes maximum. He remembers your name after a few weeks if you participate and he definitely seems to care about the success of his students. I don't understand why people give his such a hard time. If you show up to class, do the work, and take the critiques, you'll get an A, guaranteed. The class is barely any work at all, Im not even pre-law, or a polisci or journalism major, I'm a finance major and I got an A+ in his class. The people writing bad reviews are just lazy or have never had an ACTUAL bad professor before.", "rating": 5, "expected_grade": "A+", "created": "2023-01-18T15:46:07.526262Z"}, {"professor": "Esthus Amos", "course": "ENGL392", "review": "I strongly recommend Professor Amos for Engl392. He is a great teacher who is laid back yet manages to get his teaching points across. The class was designed to mimic what a student would do in Law School, and I felt that it does a good job at giving you a sense of what to expect to do in law school and if it is a career that is right for you. Although Professor Amos's instructions were a bit vague at times, he is very reasonable on grading, so that made up for it.", "rating": 5, "expected_grade": "A", "created": "2023-05-22T16:01:40.421083Z"}, {"professor": "John Kim", "course": "ENGL392", "review": "Nice guy, and the class is super easy now, since he structured so that he doesn't actually give out letter grades for assignments. It's a contract grading system, so pretty much if you do what the prompt says and show effort, you'll be fine.\r\n\r\nThe class being so easy is nice, but as a result, you don't come away with much knowledge about legal writing or law school, even though that's a stated goal of the course. Kim seems pretty knowledgable about the material, but often gets sidetracked and just doesn't really engage the class that much. But again, it's a class that you don't have to stress about at all.", "rating": 4, "expected_grade": "A+", "created": "2023-09-04T15:34:13.080030Z"}, {"professor": "Sara Faradji", "course": "ENGL392", "review": "Had her for ENGL394 but its basically the same thing. She is super nice, easy grader, and SIGNIFICANTLY less work than other english professors. Seriously I had about half the assignments my friends did with other professors. Take her if you can", "rating": 5, "expected_grade": "", "created": "2023-12-12T18:51:17.185300Z"}], "department": "ENGL", "course_number": "392", "name": "ENGL392", "title": "Legal Writing", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits.\nConventions of legal writing and research. Students learn how to read and write about cases, statutes, or other legislation; how to apply legal principles to fact scenarios; and how to present a written analysis for readers in the legal profession. Assignments may include the law-school application essay, case briefs, legal memos, and client letters.\n<i>Click here for more information on professional writing courses.</i>", "is_recent": true, "geneds": null}