{"average_gpa": 3.100122549019608, "professors": ["Rachel Penman", "Sarah Bonnie", "Virginia Butler", "Danielle Griffin", "Susanna Compton", "Kayla Harr", "Lindsey O'Neil", "Liora Moriel", "Ellen Moll", "Sarah Sillin", "Jennifer Wellman", "Christin Taylor", "Isabella Cooper", "Amanda Dykema", "Lindsay Bogner", "Elizabeth Depriest", "Elise Auvil", "Emilee Durand", "John MacIntosh", "Susanna Underland", "Manon Soulet", "Justin Thompson", "Fatima Taha", "Katie Bramlett", "Melanie Rio", "Justine DeCamillis", "Kerishma Panigrahi", "Jeannette Schollaert", "Annika Thiem", "Jeannette Schollaert", "Danuta Hinc", "Morgan Robinson"], "reviews": [{"professor": "Marilee Lindemann", "course": "ENGL250", "review": "overall she is a really bad teacher.  She always gives her opinions way to much and does not even explain anything.  ", "rating": 2, "expected_grade": "B", "created": "2009-01-06T21:21:00Z"}, {"professor": "Martha Nell Smith", "course": "ENGL250", "review": "If you come across this class for some reason, let me save you a semester of HELL. RUN THE OTHER WAY! AND NEVER LOOK BACK! I initially thought I was registering for Engl250, not knowing that it was also referred as WMST255- it makes a HUGE difference. I have never regretted a class like this one since I've been at the university. The professor is just a closed minded bigot- if it's not her opinion, a. its wrongs, b. it doesn't matter and c. you WILL FAIL!! No consideration for the fact that students have other classes. This should not be considered a CORE- this is a freaking 400level class, i swear! 3 papers (10%, 15%, 25%), a final (25%), discussion- including random quizzes in disc sec and lecture when she's mad cuz no one shows up to class, or someone leaves early, and 5 discussion posts(25%). T.A.'s are fickle- one minute their helping you, the next, they don't even respond to your emails. Don't even bother emailing the professor-she won't respond.She openly discriminates against the guys in the class, and it's just sick! I'm a girl, and I kept an open mind about women's studies but honestly-it's a bunch of bull, common sense that's spun into nice little themes and lessons designed to fool the students into believing that there's actually some profound thought, and critical thinking going on. The Amount of reading- surpassed all my other classes combined! One of the books we had to purchase- Norton's anthology of literature by women: all I ask is that you look this book up, and see how many pages it has, and I promise you, no page will go unturned!!! Never mind the fact that she doesn't go over half of the lecture slides in lecture, but still holds you accountable. This teacher definitely ruined any hopes of me liking the subject. I'm telling you- RUN FOR THE HILLS!!! Don't say I didn't warn you.   ", "rating": 1, "expected_grade": "", "created": "2011-12-27T06:45:00Z"}, {"professor": "Martha Nell Smith", "course": "ENGL250", "review": "Dr. Smith knows what she's talking about, but the whole class seems to have no main message. There is an insane amount of reading including very long critic articles required, and at least 5 pop quizzes are given throughout the semester so you've got to make sure you do the readings. There were so many \"themes\" in the class and readings that studying for the final (pretty much our only grade next to 3 papers) became very difficult. Discussion class is fun and really helps understand the reading outside of the unclear power points presented in class, but sadly that was only 50 minutes once a week. ", "rating": 3, "expected_grade": "", "created": "2011-11-17T16:59:00Z"}, {"professor": "Martha Nell Smith", "course": "ENGL250", "review": "This class was boring, but not as terrible as the other comments make it sound. She does teach one-sided, but it's kind of your fault if you didn't expect that when you signed up for a WOMENS LIT course. Grades depend entirely on your TA, so try and switch to a good one during the first week of classes. There is a lot of reading, but you can definitely sparknotes and skim things and still keep up. Some of the literature is a little graphic, but there is a pretty good mix of readings. It isn't the easiest CORE class, but if you can write decent papers you should be fine. Also, if it is in KEY 0106 like it was last Fall be prepared for some extreme temperatures, it was always really hot or really cold.", "rating": 3, "expected_grade": "A", "created": "2011-06-02T14:17:00Z"}, {"professor": "Martha Nell Smith", "course": "ENGL250", "review": "Professor Smith wasn't so bad, although she was almost always late to class. She has really high expectations for her students yet rarely even got through more than 2 or 3 slides in her 10-15 slide powerpoints. And yes, you are still responsible for the material on the other slides. She doesn't grade anything and doesn't respond to e-mails so don't even bother. Basically everything is up to your TA. Definitely make the effort to go to office hours and participate in discussions. I don't really recommend this course, there is so much reading that it is nearly impossible to keep up with. Basically don't take it unless you are willing and have the time to put considerable effort into it. ", "rating": 3, "expected_grade": "B", "created": "2010-12-16T22:46:00Z"}, {"professor": "Martha Nell Smith", "course": "ENGL250", "review": "Interesting class but not worth it if you are looking to get a good grade. Prof. Smith is very one sided with the information given and if you don't agree then your grade will be greatly affected. 3 papers, each having difficult prompts that you will either understand or you will completely write off topic. We had 2 TAs for the class one was an easy grader and the other was very difficult to please. There are random pop quizzes that start off only in discussion, but once people start not showing up to lecture many were in lecture. She puts the power points on blackboard, but they are hardly notes mostly just general questions of what it is like to read the readings. There is an unbelievable amount of readings that is very difficult to keep up with even if you read a couple each day, the understanding of having other classes is not seen here. The final is based off all of the readings on the syllabus even if we never went over them in class and it consists of identifications, short answer, short essay, and a longer one. Avoid if possible!!", "rating": 2, "expected_grade": "C", "created": "2010-12-12T15:08:00Z"}, {"professor": "Jeannette Schollaert", "course": "ENGL250", "review": "amazing. uses contract grading and is very engaging in class. she really cares about your writing and ideas and it shows with the kind of classroom environment she has. easy to do well if you are good at reflecting and connecting themes between texts.", "rating": 5, "expected_grade": "A+", "created": "2022-05-16T02:27:11Z"}, {"professor": "Jeannette Schollaert", "course": "ENGL250", "review": "Loved her and this class. The books we read were a little dry that that's just a personal issue, the in-class discussions were very engaging and thought-provoking. Also the workload was pretty light; a few essays, a reading journal, and other small assignments for in-class group work. Attendance being mandatory without a virtual option was my only pitfall but otherwise a pretty fun class for everyone!", "rating": 5, "expected_grade": "A", "created": "2022-11-15T23:03:03.480283Z"}, {"professor": "Annika Thiem", "course": "ENGL250", "review": "Kind and knowledgable professor. I honestly learned a lot in this class. It is easy to have interesting discussions in class with her. However, the grading and expectations are a bit unclear and inconsistent. The work was not super time consuming. Would recommend the course.", "rating": 3, "expected_grade": "A-", "created": "2022-12-06T21:24:23.154516Z"}, {"professor": "Jeannette Schollaert", "course": "ENGL250", "review": "Brilliant, funny, and principled teaching style. Discussions were always insightful and interesting. She makes a lot of space to entertain everyone's thoughts and theories. She makes everyone feel comfortable sharing and provides multiple ways to participate and discuss your thoughts.", "rating": 5, "expected_grade": "", "created": "2023-04-27T19:08:16.707021Z"}, {"professor": "Jeannette Schollaert", "course": "ENGL250", "review": "Seems nice in class and is engaging with good insights. However, she is a terrible grader, the class has a lot of work, and the structure is very unforgiving. She takes up to one month to grade one assignment, does not allow for any edits or re-dos, and is way too strict on grading overall. I do not recommend it.", "rating": 1, "expected_grade": "B", "created": "2023-05-23T20:31:53.198021Z"}], "department": "ENGL", "course_number": "250", "name": "ENGL250", "title": "Reading Women Writing", "credits": 3, "description": "<b>Cross-listed with:</b> WGSS255.\n<b>Credit only granted for:</b> ENGL250, WMST255 or WGSS255.\n<b>Formerly:</b> WMST255.\nExplores literary and cultural expressions by women and their receptions within a range of historical periods and genres. Topics such as what does a woman need in order to write, what role does gender play in the production, consumption, and interpretation of texts, and to what extent do women comprise a distinct literary subculture. Interpretation of texts will be guided by feminist and gender theory, ways of reading that have emerged as important to literary studies over the last four decades.", "is_recent": true, "geneds": null}