{"average_gpa": 3.5827133479212248, "professors": ["Douglas Kern", "Heidi Scott", "Paul Cote", "Liam Daley", "Joseph Angelella", "Stan Waring", "Melanie Rio", "Jesse Brooks", "Melanie Rio", "Liam Daley", "Jesse Brooks", "Radford Skudrna", "Jay Wilcox", "Jay Wilcox", "Anna Josephson", "Shalom Rosenberg"], "reviews": [{"professor": "Heidi Scott", "course": "ENGL275", "review": "I felt like the course was a bit too much work for a gen ed class, but it was fun to learn how to write a script. I was expecting a B+ because I got A-'s/B+'s for all my assignments no matter how much effort I put in, but I ended up with an A, so I think she doesn't follow the +/- system. It's a fun class if you're interested in screenwriting, but not an easy A. ", "rating": 4, "expected_grade": "A", "created": "2017-12-21T00:41:10Z"}, {"professor": "Radford Skudrna", "course": "ENGL275", "review": "Radford is a fantastic professor. Really passionate about what he teaches and he's eager to work with each student during class in order to get them more comfortable with sharing their writing and giving and receiving constructive criticism. Very personable, dude loves icebreakers for the first few weeks, and they really help you to get more relaxed when it comes time to share and workshop your writing with peers.", "rating": 5, "expected_grade": "A+", "created": "2023-01-23T07:56:36.337190Z"}, {"professor": "Jay Wilcox", "course": "ENGL275", "review": "Professor Wilcox is one of the best professors I have had at the university. His priority is not harsh grades or strict criteria, rather his sole focus is helping you improve as a writer. His classes were engaging and entertaining while also providing valuable insight. I highly recommend taking this course or any other taught by him.", "rating": 5, "expected_grade": "A+", "created": "2023-12-04T15:33:36.321454Z"}, {"professor": "Jay Wilcox", "course": "ENGL275", "review": "BEST TEACHER EVER!! I love how encouraging he is towards your work and makes an effort to seem as engaging as possible. If you're trying actually to improve in your writing pick him, I would do it a hundred times over.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T03:56:07.045212Z"}], "department": "ENGL", "course_number": "275", "name": "ENGL275", "title": "Scriptwriting for Theater, Film, and Television", "credits": 3, "description": "<b>Cross-listed with:</b> ARHU275.\n<b>Credit only granted for:</b> ENGL275 or ARHU275.\nIntroduction to the theory and practice of scriptwriting with an opportunity to read, view, evaluate, write, and revise texts meant to be performed. Students will practice writing for the stage, film, and television and also examine selected scripts, performances, and film and television clips as models for their own creative work. Students will complete frequent writing exercises, participate in workshops, and learn to apply scholarship to the analysis and critique of scripts.", "is_recent": true, "geneds": null}