{"average_gpa": 3.8890510948905113, "professors": ["Thomas Lowderbaugh", "Thomas Lowderbaugh", "Thomas Lowderbaugh", "Blake Wilder"], "reviews": [{"professor": "Thomas Lowderbaugh", "course": "ENGL381", "review": "Prof Lowderbaugh really cares about his students.  He was readily available to talk to me after class (and office hours).  Taking a 3 hour class can become boring, but he tried to keep us awake.  In my opinion, he shouldn't have done the exact same thing every class - it became old fast.  ", "rating": 5, "expected_grade": "A", "created": "2010-12-22T18:50:00Z"}, {"professor": "Thomas Lowderbaugh", "course": "ENGL381", "review": "Professor Lowderbaugh is a great Professor. Though sometimes he rambles with random stories, he provides some great advice to improve your resume and personal statements. I felt very well prepared for my internship at the Maryland General Assembly. I highly recommend this course. ", "rating": 4, "expected_grade": "A", "created": "2009-12-07T22:33:00Z"}, {"professor": "Thomas Lowderbaugh", "course": "ENGL381", "review": "He's a little old school but really cares about his students. He expects you to work for a grade but I don't think it's to an unreasonable extent. I've learned so much in his class and have improved drastically as a writer. He's old and a little disorganized and incompetent at technology but he cares about helping you write better and is very good at orating how to do that. He's a teacher through and through", "rating": 5, "expected_grade": "A+", "created": "2023-11-28T19:57:36.914280Z"}], "department": "ENGL", "course_number": "381", "name": "ENGL381", "title": "MGA Legislative Seminar", "credits": 3, "description": "<b>Prerequisite:</b> Students who have taken courses with comparable content may contact the department; or ENGL101.\n<b>Restriction:</b> Permission of ARHU-English department.\n<b>Cross-listed with:</b> HONR368A.\n<b>Credit only granted for:</b> HONR368A or ENGL381.\n<b>Additional information:</b> Application required. Contact english@umd.edu for more information.\nPrepares students to intern for the Maryland General Assembly. Introduces standard legislative genres and assigns extended practice in researching legislative issues.\n<i>Cross-listed with HONR368A. Credit only granted for one of the following : ENGL381 or HONR368A. Admission to this course is by application only.    Click here for more details.</i>", "is_recent": true, "geneds": null}