{"average_gpa": 3.5234268385140264, "professors": ["Pamela Gerhardt", "Stewart Foehl", "Timothy Denevi", "Rachel Feingold", "Joseph Angelella", "Danuta Hinc", "Jesse Brooks", "Mark Fitzgerald", "Lyra Hilliard", "Alysia Sawchyn", "Sarah Dammeyer", "Danuta Hinc", "Lyra Hilliard", "Pamela Gerhardt", "Jesse Brooks", "Danuta Hinc", "Lyra Hilliard", "Pamela Gerhardt", "Daniel Sidman", "Danuta Hinc", "Lyra Hilliard", "Pamela Gerhardt", "Sarah Dammeyer", "Danuta Hinc", "Lyra Hilliard", "Pamela Gerhardt", "Daniel Sidman", "Danuta Hinc", "John Tobin", "Lyra Hilliard", "Pamela Gerhardt", "Danuta Hinc", "Pamela Gerhardt"], "reviews": [{"professor": "Pamela Gerhardt", "course": "ENGL398R", "review": "This is the best professional writing class you can take! Everyone writes a 5 page nonfiction narrative - meaning a story about something that happened to you - and then we workshop them in class. You get to read people's crazy stories, like one guy who proposed after 5 months. It's fun and you learn stuff you will need to know in any business - like how to write about yourself, give a presentation, a memo, a resume, etc. If you have to take Junior English, take it with Gerhardt!", "rating": 5, "expected_grade": "A", "created": "2010-05-13T10:52:00Z"}, {"professor": "Sarah Dammeyer", "course": "ENGL398R", "review": "This is one of my FAVORITE professors and courses at UMD!!  The course consisted of abut 4-5 essays as major assignments and collaboration with others students. Sarah is very accommodating and left me the best comments on my assignments and really helped us to see how our work could be applicable in the real world and I was never stressed about my grade.  10/10 would recommend this professor and course for your professional writing credit!!!", "rating": 5, "expected_grade": "A", "created": "2021-12-22T22:14:35Z"}, {"professor": "Pamela Gerhardt", "course": "ENGL398R", "review": "Really fun class, for sure the best of all the professional writing options. The entire class was just mini completion assignments, a 500-word essay, a five-page essay, and this portfolio thing. Spread out so the workload is really manageable, actually interesting and engaging. ", "rating": 5, "expected_grade": "A", "created": "2022-04-27T00:04:39Z"}, {"professor": "Danuta Hinc", "course": "ENGL398R", "review": "Amazing Professor. She cares so much about her students and helping them improves in their writing. Definitely a class I would take ten times in a row. Very chill with deadlines and just gotta complete the work really. Very free to write about whatever you want which is great too and she will read all that you write. Amazing Class.", "rating": 5, "expected_grade": "A", "created": "2022-12-15T00:42:44.278653Z"}, {"professor": "Daniel Sidman", "course": "ENGL398R", "review": "Professor Sidman is awesome. Very understanding/ caring professor who is very knowledgeable. He wants to expose his students to Non-Fictional Narratives, and throughout the semester your write 3 essays (all under 1200 words) and create an e-portfolio. He doesn't grade the essays by letter grades since \"they're subjective\" and will give you a pass/ fail based on if you completed the assignment correctly or not, which is sweet. Even though it's only 3 essays, you really work on making these essays great through in class workshops and peer/ teacher review. I know he offers his classes pretty early but if you can make 80% of the classes, I would recommend taking him.", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T13:20:46.311839Z"}, {"professor": "Danuta Hinc", "course": "ENGL398R", "review": "Class is super easy and Professor Hinc is very nice. If you have a problem with deadlines just talk to her, and you can work something out. \r\n\r\nIt is a gen-ed, so there are a ton of useless assignments that the department requires her to give us. Luckily, you basically just have to complete them. I think there were too many readings, but you could probably get by without reading all of them if you are more strategic than I am.\r\n\r\nI didn't find her essay feedback very helpful. She usually only wrote a sentence or two in response to a 5-page essay. She wasn't very clear with the instructions on the three main essays, but this is because she wants you to focus on writing something good, not towards a rubric.\r\n\r\nThe class should probably be called \"(non-fictionish) Creative Writing\"\r\n\r\nDefinitely an easy A if that's what you're looking for.", "rating": 4, "expected_grade": "A+", "created": "2023-04-30T19:22:46.942953Z"}, {"professor": "Danuta Hinc", "course": "ENGL398R", "review": "There are a ton of busywork assignments, but that's to be expected from a professional writing course. Most assignments are graded based on completion, and the only real grades are the three main essays and participation. It's an easy class but a lot of work. Participation is worth a huge amount of your grade (30%), but the way she grades feels unfair and she is very harsh with this grading. Most of the class is discussion-based, and I thought it was chill but also very shallow. I disagree that Professor Hinc is nice, as many of her comments seem very egotistic, aggressive, or inappropriate. Much of the class is just her talking about herself. She does not like to be disagreed with, and it may affect your participation grade. Her essay feedback is not very helpful, as it seems she only leaves a few unrelated comments. I did not feel like I improved as a writer through this class, and would recommend a different PWP class if you're interested in that.", "rating": 2, "expected_grade": "A", "created": "2023-05-29T18:44:24.026277Z"}], "department": "ENGL", "course_number": "398R", "name": "ENGL398R", "title": "Writing Non-Fictional Narratives", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits.\nApproaches nonfiction narrative-a kind of writing influenced by fiction, magazine journalism, memoir, and personal essay--as a form of professional writing used in publishing and a range of careers involving proposal writing, work documentation, lobbying, social marketing, and political commentary, among others. Students learn to use many of the same tools as fiction writers, such as dialogue, vivid description, developing characters, nonlinear structure, and shifts in tense, time, and points of view. They also learn how to edit their own work as well as that of their peers, doing multiple revisions of the major assignments for a final portfolio. Major assignments include essays targeted to specific publications, query letters, audience analysis, and a publisher analysis.\n<i>\n<b>Prerequisite:</b> 60 credits and completion of ENGL101 or equivalent. This course satisfies the professional writing requirement.</i>\n<i>Click here for more course information.</i>", "is_recent": true, "geneds": null}