{"average_gpa": 3.834183673469388, "professors": ["Leigh Ryan", "Douglas Kern", "Thomas Earles", "Heather Lindenman", "Nabila Hijazi", "Thomas Earles", "Thomas Earles", "Thomas Earles", "Thomas Earles", "Thomas Earles", "Thomas Earles"], "reviews": [{"professor": "Thomas Earles", "course": "ENGL388W", "review": "Great guy. Very funny. Led class well but I hated how long it was. ", "rating": 5, "expected_grade": "", "created": "2021-12-07T18:20:32Z"}, {"professor": "Thomas Earles", "course": "ENGL388W", "review": "Tom was great! The internship was a lot of fun. I agree with others in that I didn't learn much about the mechanics of writing in this class. Luckily, I'm an English major and write well already, but if I didn't have a really solid grasp of English or how to write a paper, I don't think I'd do very well. Despite its length, I looked forward to ENGL388W every week. It was my favorite class this semester!", "rating": 5, "expected_grade": "A+", "created": "2022-05-22T00:39:03Z"}, {"professor": "Thomas Earles", "course": "ENGL388W", "review": "Took 388W during Spring 2022, but I want to add a review for anyone who's considering the internship because they want to tutor at the writing center. Prof Earles is a wonderful guy and really easy-going and funny. He's only harsh if you don't show up to your scheduled shifts, which is understandable, because this internship is supposed to prepare you to become an actual tutor. Classes were long, but they were only once a week, and they were enjoyable. You don't learn much about the mechanics of writing because the class is about tutoring and learning the mechanics of the WC - you're pretty much expected to already know the mechanics of writing. (If you didn't, when you applied for permission to take the class, you'd be rejected.) The workload can get a little overwhelming (readings were very long, there are a couple of group projects and discussions that every person needs to lead), but again, given that the class is once a week, it's not horrible. It also satisfies the Scholarship in Practice gen-ed req, which is an added bonus. Overall, this class is worth it, and if you'd like to try for it and you want to become a tutor, I highly encourage applying and taking the internship.", "rating": 5, "expected_grade": "A+", "created": "2022-12-01T19:43:49.858406Z"}, {"professor": "Thomas Earles", "course": "ENGL388W", "review": "Can be scary at times, but overall super funny and nice. He grades relatively fairly, and he can be strict at times although it is always about things that make sense i.e. showing up to tutoring on time and other things related to the job.", "rating": 4, "expected_grade": "A", "created": "2023-05-14T18:06:30.385083Z"}, {"professor": "Thomas Earles", "course": "ENGL388W", "review": "Can seem scary at first but he's really funny and generally nice! He can be a bit strict in the writing center but I don't blame him. Would recommend.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T21:59:30.900108Z"}], "department": "ENGL", "course_number": "388W", "name": "ENGL388W", "title": "Writing Center Internship", "credits": 1, "description": "<b>Prerequisite:</b> Permission of the Writing Center (1205 Tawes Hall). Repeatable to 12 credits.\nExamines face-to-face and online writing center theory and practice through readings, exercises, and supervised tutoring. Students investigate the writing process and help other writers to negotiate it.\n<i>\n<b>Prerequisite:</b> permission of department. Repeatable to 12 credits. To apply, go to http://www.english.umd.edu/academics/writingcenter/ internship. Students taking ENGL388W for the first time should register for section 0101 for 4 credits. When taking the course a gain in subsequent semesters, students should register for 2001.</i>", "is_recent": true, "geneds": null}