{"average_gpa": 3.319207751496153, "professors": ["Rebecca Holden", "Katherine Robinson", "Elizabeth Fixsen", "Kara Pleasants", "David Todd", "Nicholas Hoffman", "Rachel Feingold", "John Mancini", "Jacob Eckstein", "Zahara Heckscher", "Alysia Sawchyn", "Heidi Scott", "Peter Witte", "Cheryl Spinner", "Benjamin Baker", "Stan Waring", "Uchechi Okereke-Beshel", "Michael Schmidt", "Ruth Phillips", "Kevin Tervala", "David Todd", "Rebecca Holden", "Cheryl Spinner", "Sarah Goodson", "David Todd", "Gerard Holmes", "Michael Schmidt", "Rebecca Holden", "Sarah Goodson", "David Todd", "Gerard Holmes", "Rebecca Holden", "Sarah Goodson", "David Todd", "Rebecca Holden", "Gerard Holmes", "Michael Schmidt", "Rebecca Holden", "Alexandra Omogbadegun", "David Todd", "Kevin Wisniewski", "Michael Schmidt", "Rachel Cote", "Rebecca Holden", "David Todd", "Rebecca Holden", "Ruth Phillips"], "reviews": [{"professor": "Rebecca Holden", "course": "ENGL398N", "review": "Professor Holden was a great professor I highly recommend her class! \n\r\nAlthough there are assignments due almost every class she returns assignments in a timely manner, with feedback and is always open for discussing work.", "rating": 4, "expected_grade": "B", "created": "2014-01-08T01:45:00Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "Do not take this class. She is a nice enough teacher but not when it comes to grading. She bombards you with so many writing assignments the entire semester that you are writing almost every class. She even takes attendance every class and takes points off for being late. This class took so much of my time. This class sucked.", "rating": 2, "expected_grade": "B", "created": "2013-12-08T22:28:00Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "This is an amazing course, and Professor Holden is an excellent professor. Yes, there is an assignment due nearly every time the class meets. But the assignments build on each other and it makes sense why they are part of the course. Holden is a clear speaker and speaks with purpose in class. I learned a lot of applicable information for future jobs.", "rating": 5, "expected_grade": "A-", "created": "2018-01-02T00:19:22Z"}, {"professor": "David Todd", "course": "ENGL398N", "review": "Literally the worst professor ever. Is always at least 5-10 minutes late to every class, and is NOT clear at all on any instructions whatsoever. We are doing class online and he spends at least an hour explaining what is due and changing due dates and deadlines when he could just make a SCHEDULE ON THE SYLLABUS and an ASSIGNMENTS TAB. His writing is incoherent even though he’s a lawyer. Very disorganized and nobody ever knows what is due. Do not take his class.", "rating": 1, "expected_grade": "", "created": "2021-02-25T13:42:06Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "Gives way too much work for a gened", "rating": 3, "expected_grade": "A-", "created": "2021-03-09T23:20:34Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "She is a very nice professor and she is lenient with due dates due to COVID (Not sure how she will be in the future). Obviously, there is a lot of writing in this class but Holden gives ample time to complete the work in my opinion and lays out due dates that help you along the way to each final draft. Very helpful with questions and takes the time to work with each student if you need help.", "rating": 5, "expected_grade": "A", "created": "2022-05-17T15:00:11Z"}, {"professor": "Sarah Goodson", "course": "ENGL398N", "review": "Rating 2 stars only because this is Professor Goodson's first semester teaching at UMD and maybe once she settles in things will improve. Also, she is peppy and engaging during lectures which is helpful for a 5pm class. Otherwise pretty bad. \r\n\r\nPacing of assignments was way off. The semester started off with two class sessions dedicated to peer-editing and revising a single paragraph(!) and ended with three concurrent projects that accounted for 45% of the final grade. Instructions and deadlines for these assignments were not communicated until midway through the semester, well after the add/drop period. There was no semester calendar- instead we got sporadically updated handouts that covered about 3-4 weeks at a time. I also spent hours (plural!) simply locating assignment instructions and hand-in methods, since practically every one was housed somewhere different- terrible organization.\r\n\r\nCommunication was also bad. Echoing other commenters, Professor Goodson did not respond to emails or enter grades in a timely manner. There were assignments from the first month that were graded in mid-December with no feedback! The real kicker is that this professor presents early on as someone caring. She is quick to bring up the importance of self-care, checking in, and how she is always here for students. However, when other students and I came to her with legitimate grievances like illness or personal loss she was completely inflexible. She's not so much a wolf in sheep's clothing as a candy-coated pedant.", "rating": 2, "expected_grade": "", "created": "2022-12-18T05:17:45.244890Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "it's only the third week of class and i already hate it here tbh. holden's a really nice professor but there's just SO MANY assignments, each with super long and complicated instructions that it makes it confusing for me and others with learning disabilities. i've come to dread having to do each assignment that's due almost everyday with inconsistent times. this honestly feels like a high school class but wayyy more work.", "rating": 2, "expected_grade": "", "created": "2023-02-09T04:50:24.640437Z"}, {"professor": "Gerard Holmes", "course": "ENGL398N", "review": "The actual GOAT. His class and rules are exceedingly simple: You do the assignments with a modicum of effort and you get an A+ in the class. (The reason I have an A and not an A+ is that I skipped a lot. Now before you sound the alarm bells over attendance!! hear me out)\r\n\r\nGrading: \r\n1. Bi-weekly discussion posts and mini-writing assignments. May seem an annoying time chore but these are graded on COMPLETION only, so you just need to write something. It's free points and takes like 20 minutes of your day. \r\n\r\n2. About 3 big papers split up into multiple sub-sections. These are graded VERY leniently (esp the drafts) so as long as you stick with the deadlines (which are fair as you have weeks to complete assignments) you will get 90+ on everything\r\n\r\n3. Effort grading. Show up at least twice for the in-class peer review (end of semester), and at least once a week. Also, make sure to provide peer feedback whenever assigned on elms and you get both of these credits for free.\r\nThat's literally it. No exams no nothing. Holmes grades pretty much everything on completion more or less as long as it looks like you tried decently well. As long as you keep up and do the work on time this is a free A. The sole difficulty of this class is just that there are a lot of little weekly assignments (the discussion posts and other minor mini-writing assignments) so you just need to remember that they exist and do them. Look at your Canvas calendar every day and you will be fine.\r\n\r\nClass Content:\r\nIt's about non-profits and as a CS major it wasn't terribly interesting or applicable to me. The content itself is also somewhat surface-level and easily learned from Google and can be seen as an intro to writing grant proposals and public relations papers. Not the most exciting of content but hey you're here for the free GPA and the PW credit anyway. \r\n\r\ntl;dr: Easy A, W prof, he's the goat take this class. (Also like no one ever signs up for this since it's so obscure so if he is teaching this or any PW class take it)", "rating": 5, "expected_grade": "A", "created": "2023-05-26T05:13:04.003131Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "Don't take this class. It is so much work and she is a strict grader- way too strict for the amount of assignments we have. I am a senior and this class reminded me that some gen eds are just a collection of meaningless assignments. The assignments and their directions have such long instructions it's actually absurd and only serves to stress you out. Emails are way too long as well. I really don't recommend this class in the slightest, and I'm only on week 2. Every assignment that you're graded on is so meaningless it's honestly a little disrespectful...", "rating": 1, "expected_grade": "", "created": "2023-09-08T20:03:45.577921Z"}, {"professor": "Rebecca Holden", "course": "ENGL398N", "review": "Prof. Holden is a good professor teaching a tough class. She was very friendly and helpful throughout my time in 398N. She does assign a ton of work per week and makes sure you stick to the rubric like glue. If you’re not even the least bit interested in the nonprofit sector, find something different for your professional writing req. However this was not a bad course and if you get cracking on assignments as they’re released, follow the guidelines, and don’t procrastinate, you will be fine. I promise.", "rating": 4, "expected_grade": "A", "created": "2023-09-19T15:45:03.782062Z"}, {"professor": "Gerard Holmes", "course": "ENGL398N", "review": "Gerard Holmes is the GOAT, I cannot say enough nice things about him. If you have the option to take him absolutely do, one of the nicest and most understanding professors I have ever had he is an engaging professor, doesn't take himself too seriously and is willing to work and help you with anything that you need an absolute king.", "rating": 5, "expected_grade": "", "created": "2023-12-01T20:35:54.131794Z"}, {"professor": "Gerard Holmes", "course": "ENGL398N", "review": "As a CS major, this was an easy/rewarding course. Professor Holmes is an amazing professor and makes every step of the process extremely clear. The assignments fall into two categories: discussions and assignments. The discussions are pretty self-explanatory and very reasonable. The assignments aren't too lengthy (expect 1-2 pages per assignment). The final grant-proposal (the majority of your grade) is a culmination of all the previous assignment with some tweaking you've done along the way. Overall, great course if you're looking to fill your FSPW requirement or just looking for a great class to learn about the non-profit sector.", "rating": 5, "expected_grade": "A+", "created": "2023-12-29T03:55:40.749301Z"}], "department": "ENGL", "course_number": "398N", "name": "ENGL398N", "title": "Writing for Non-Profit Organizations", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits.\nExamines professional writing and communication work in the non-profit sector. Students will analyze the audiences and document genres that they may encounter in real-world non-profit work and will learn how to compose many of these documents, from press releases and other public relations material to position papers, reports, and grant proposals. Students may also have the opportunity to add a service-learning component to the course by working with and for an area non-profit.\n<i>\n<b>Prerequisite:</b> 60 credits and completion of ENGL101 or equivalent. This course satisfies the professional writing requirement.</i>\n<i>Click here for more course information.</i>", "is_recent": true, "geneds": null}