{"average_gpa": 3.3107929515418504, "professors": ["Mark Forrester", "Daniella Berger", "Mark Forrester", "Mark Forrester", "Mark Forrester", "Mark Forrester", "Mark Forrester", "Mark Forrester"], "reviews": [{"professor": "Mark Forrester", "course": "ENGL398L", "review": "Mark is an excellent professor and really cares about his students! You have to have some interest in the humanities (movies, literature, history, languages, etc.) to truly appreciate the class, but overall his grading is fair and he's committed to making sure your writing is the best it can be.\n\r\nYou'll learn how to write more concisely and how to sustain an argument through a long paper, as well as how to write a resume, cover letter, grad school app essay/personal statement, etc.", "rating": 5, "expected_grade": "A", "created": "2014-06-16T21:30:00Z"}, {"professor": "Mark Forrester", "course": "ENGL398L", "review": "Very nice and funny guy. Easy to talk to. Assignments not too difficult, he lets you pretty much pick whatever topic you want. Grading is pretty consistent. Good professor for JuniorEnglish.", "rating": 5, "expected_grade": "B", "created": "2008-12-17T01:45:00Z"}, {"professor": "Mark Forrester", "course": "ENGL398L", "review": "I was expecting to hate my professional writing class, but it was one of the best classes I've taken. There are a couple of big assignments due throughout the semester leading up to the final paper. The paper can be about anything you want, and he grades fairly for all the assignments. He also allows rewrites for a couple of them, but as long as you put in some effort you shouldn't have to do the rewrites. The highest grade he gives is a 95% but for final grades, a 92% is an A. ", "rating": 5, "expected_grade": "A", "created": "2017-12-21T00:30:33Z"}], "department": "ENGL", "course_number": "398L", "name": "ENGL398L", "title": "Scholarly Writing in the Humanities", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits.\nExamines scholarship in the humanities as a genre of professional writing and investigates the norms and procedures of advanced academic writing. Assignments parallel the writing demands that students will face in the academic workplace, including a graduate school application essay, a genre review, an annotated bibliography, a journal article, and an oral presentation of article subject matter.\n<i>\n<b>Prerequisite:</b>60 credits and completion of ENGL101. This course satisfies the professional writing requirement.An advanced composition class focusing on the norms and procedures of advanced academic writing.</i>\n<i>Click here for more information.</i>", "is_recent": true, "geneds": null}