{"average_gpa": 3.286131013306039, "professors": ["Caroline Wilkins", "Rebecca Ritzel", "Douglas Kern", "Rachel Feingold", "Robert Oliver", "Dennis Winston", "Kevin Tervala", "Peter Witte", "Elizabeth Benton", "Danuta Hinc", "David Miles", "Caroline Wilkins", "Emily Lyons", "Peter Witte", "Caroline Wilkins", "Mark Fitzgerald", "Sara Faradji", "Sarah Goodson", "Thomas Earles", "Alexandra Calloway", "Caroline Wilkins", "Simone Daleo", "Sara Faradji", "Caroline Wilkins", "Emily Flamm", "Mark Fitzgerald", "Caroline Wilkins", "Dennis Winston", "Emily Flamm", "Gerard Holmes", "Caroline Wilkins", "Mark Fitzgerald", "Peter Witte"], "reviews": [{"professor": "Caroline Wilkins", "course": "ENGL398A", "review": "I have no idea why there are no reviews for Wilkins. She's a fantastic professor, and makes English interesting. She has high expectations, but is still fun and understanding. The papers you write are about stuff you care about, and about 5 response papers on some readings. One kinda bad thing is that she doesn't hand back papers in a timely fashion, and I have only one grade currently on ELMS, so I'm not exactly sure what my grade is.", "rating": 5, "expected_grade": "B?", "created": "2012-05-05T00:21:00Z"}, {"professor": "Dennis Winston", "course": "ENGL398A", "review": "Awesome professor, really chill and down to earth. Also a big hip hop fan if you're into that.", "rating": 5, "expected_grade": "A", "created": "2018-12-14T11:13:13Z"}, {"professor": "Peter Witte", "course": "ENGL398A", "review": "I really enjoyed this class, probably because Peter was such a great professor. He's super understanding, outlines assignments in a really thorough and helpful way, and conducts peer review so that everyone gets both positive and constructive feedback. I definitely recommend taking this class, especially if you're an artist or enjoy interested in art.", "rating": 5, "expected_grade": "A", "created": "2020-12-02T00:03:14Z"}, {"professor": "Thomas Earles", "course": "ENGL398A", "review": "Took this class for professional writing, specifically for the arts. This was a really good class. We had 5 main assignments: manifesto, press release, long review, grant paper, and e-portfolio. And also a few smaller assignments. All the main assignments felt practical and important for a working creative person / arts adjacent career. He's a really nice person. I found him to be an easy grader, but I already came in with good writing and grammar skills. He also left comments back on my papers, which I appreciated.", "rating": 5, "expected_grade": "A", "created": "2022-12-15T19:02:41.310470Z"}, {"professor": "Mark Fitzgerald", "course": "ENGL398A", "review": "If you're artsy and don't want to take a professional writing course that's stale, take this class. His lectures are definitely easy to be distracted from and class is skippable at times. All you have to do is 3 major assignments, write 2 paragraphs about a reading passage every week and do a few peer reviews that require low effort. You get enough time to turn in assignments and he's flexible in terms of turning in assignments late and extending work. \r\n\r\nClass discussions are nice discussions about art that you can follow and contribute to and I can say my writing has improved from this course.", "rating": 5, "expected_grade": "A+", "created": "2023-01-03T01:53:59.392569Z"}, {"professor": "Sara Faradji", "course": "ENGL398A", "review": "I am not in the arts but decided to take this for my professional writing course, and I do not regret it at all! Prof. Faradji genuinely wants everyone to succeed. Her suggestions helped me improve various aspects of my writing while also improving my resume and portfolio. Would definitely recommend to anyone taking this course or others.", "rating": 5, "expected_grade": "A", "created": "2023-05-24T16:53:23.031811Z"}, {"professor": "Caroline Wilkins", "course": "ENGL398A", "review": "She's a good professor in terms of knowing a lot about the arts. She's well versed and it definitely shows. She can be a bit snarky and even offensive at times. I really only took the class because I needed it. Unless you are really involved in the arts, I wouldn't take the class. A lot of the work relates to the art you produce. She also doesn't put in grades for major assignments until the last minute, so I don't really know what grade I'm going to get. I don't think I would take a class with her again.", "rating": 3, "expected_grade": "A", "created": "2023-12-05T14:52:08.516767Z"}, {"professor": "Caroline Wilkins", "course": "ENGL398A", "review": "Kind of a harsh grader, very loud and lively even early in the morning. Not super available on email. She will tell you that she ignores emails from students if they are stupid questions. Also makes out of pocket and braggy comments. The TAs are great though. I wouldn't recommend taking this section with her.", "rating": 2, "expected_grade": "A", "created": "2023-12-13T14:41:48.929925Z"}, {"professor": "Caroline Wilkins", "course": "ENGL398A", "review": "Positives: Professor Wilkins is very passionate about English and writing and she has good course materials for us to learn about how to be a good professional writer. She is willing to work with you and make accommodations and extensions as needed. The assignments and work themselves are not bad at all, and you get to write about things that you are passionate about. There was a lot of peer editing which was helpful. There were 2 great TA's who were very willing to help with any questions we had. We also got to learn about our classmates and their connection to the arts throughout the semester which was really cool!\r\n\r\nNegatives: Professor Wilkins talks a lot during class, which does not give us much time to participate (and participation grade is very much enforced). She also often makes a lot of inappropriate and just unnecessary comments for our classroom setting, including sharing a lot of personal opinions and talking about students without their knowledge. It just didn't seem very kind and I was worried that at some point in the semester I would become a talking point just for sending in an email. However, my absolute biggest complaint is that I received no grades at all for any of the major assignments until the end of finals week. The end of finals week! This is really unacceptable and I'm not sure if this is even allowed. So if you are someone who wants to know how they are doing in their class throughout the semester, this is not the professor for you. I was very diligent with the work I put into this class, never missed a class except for being sick, and never turned in an assignment late. So I'm just a little disappointed that I'm only now finding out I didn't do as well on some of the major assignments as I thought. With 2 TA's in the class, it's really not good that we didn't get any major assignment grades (besides participation and some hw's) until the last minute. If we don't get feedback throughout the semester on our writing, how are we supposed to learn how to be \"professional writers?\" The class would have been perfect if it weren't for these 2 things and I really wish it could have been different.\r\n\r\nOverall, if you're involved in the arts, this is an awesome and enjoyable professional writing class to take, provided you are okay with the negatives I mentioned above.", "rating": 2, "expected_grade": "A", "created": "2023-12-19T23:43:54.511678Z"}], "department": "ENGL", "course_number": "398A", "name": "ENGL398A", "title": "Writing for the Arts", "credits": 3, "description": "<b>Prerequisite:</b> Must have fulfilled the Academic Writing (FSAW) requirement.\n<b>Restriction:</b> Must have earned a minimum of 60 credits.\nExamines the situations and genres in which working professionals (practitioners, advocates, administrators, and educators) write about art, culture, and artists. The course covers the complex process that writers need to learn, including how to accommodate information to specific audiences, how to use stylistic and visual devices to make information more accessible, and how to edit their own work as well as that of their peers. Assignments parallel the writing demands that students will face in the workplace, including analyzing and composing artist statements, an arts manifesto, art education guides, press releases about artists and their work, critical reviews of exhibits and performances, and proposals to funding agencies and foundations.\n<i>\n<b>Prerequisite:</b> 60 credits and completion of ENGL101 or equivalent. This course satisfies the professional writing requirement.</i>\n<i>Click here for more information on professional writing courses.</i>", "is_recent": true, "geneds": null}