{"average_gpa": 3.700283822138127, "professors": ["Bruce James", "Joanna Goger", "Joseph Sullivan", "Melissa Kenney", "Michael Gerst", "Rachel Lamb", "Emma Roach", "Caroline Boules", "Mark Carroll", "Annette Spivy", "Joanna Goger", "Mark Carroll", "Annette Spivy", "Caroline Boules", "Joanna Goger", "Mark Carroll", "Annette Spivy", "Annette Spivy", "Caroline Boules", "Colleen O'Donnell", "Joanna Goger", "Mark Carroll"], "reviews": [{"professor": "Joanna Goger", "course": "ENSP400", "review": "Easy, sort of a pushover. Very interested in policy, obviously. Her tests are a breeze. Values participation and attendance, but it won't make or break your grade. Take advantage of extra credit if you want an A+, I guess. ", "rating": 4, "expected_grade": "A-", "created": "2012-12-19T13:09:00Z"}, {"professor": "Bruce James", "course": "ENSP400", "review": "Since I can only post one review, I've included my reflections on both ENSP101 and ENSP400:\n\r\nENSP101 - Dr. James is a really cool guy who really cares about the class and tries to make it enjoyable! The downside to the class is that the exams are really long, and it can be quite a bit of work, especially since you have to write a lot! Plus, sometimes, it doesn't always seem like the questions on the exams really demonstrate your knowledge and they seem to be somewhat tough on the grading. Therefore, be prepared to study hard! However, even if you don't do well (which, for the first exam, is typical of most people), he does provide plenty of extra credit opportunities to make up for them! There are a couple papers and problem sets throughout the semester in addition to the two midterms and the final (the final is worth the same as both midterms combined). Make sure you really read the directions for the papers carefully and don't procrastinate! They do require some effort (and you need stuff such as outside sources, which can require more time than you might think)! The problem sets, although not too bad in general, were one thing that I wasn't so keen on, because they could be kind of vague and almost too \"open\"-sometimes you aren't able to know if you answered them correctly and it was frustrating when I lost points when I thought I shouldn't have!\r\nOne cool thing about Dr. James is that he does not rush through his lectures, and he uses powerpoint-which he made available to students if they came to his office (and the TAs each presented some lectures as well on their own areas of expertise).\r\nBesides the papers and assignments, the homework is essentially just the assigned readings, most of which are discussed in discussion section (some are from the book, others from websites, etc). Make sure to attend discussion because participation is 10% of your grade! Discussion sections mostly talked about the assigned readings, and not necessarily the work from class so much, so it was a bit odd not having discussion and class related, but my TA was pretty cool and laid back (and my discussion was right before the lecture slot, which made it convenient), so I have no complaints about it! Plus, most of the readings were very interesting!\r\nOverall, a very cool class! Expect to struggle a bit early on in the semester, so don't get too frustrated, just work hard and take initiative, and you should be able to pull through in the end.\n\n\r\nENSP400 - Dr. James makes the class interesting.  The first half of the semester is lectures and discussion about environmental ethics.  It's pretty straightforward, so be sure to do the readings and pay attention in class (the powerpoint slides aren't posted until close to the exam).  The exam consisted of a bunch of short answers and essays so be sure to understand the concepts well.  The second half involved a group research project and presentation.  The project was interesting and involved putting together an individual and a group paper about the future energy sources of an island, as well as a presentation (using powerpoint) to the class.  You meet with Dr. James and the TA on a weekly basis to assess progress and make sure everything is on par. Be sure not to procrastinate as the project is very in depth and time-consuming.  There is also a small reflective project as well.  Most of the grade involves the individual components of the project as well as the first exam.  Don't be afraid to ask questions and make use of Dr. James as a resource.  He's a great guy and very wise!", "rating": 4, "expected_grade": "", "created": "2011-05-30T15:32:00Z"}, {"professor": "Joanna Goger", "course": "ENSP400", "review": "Goger is my inspiration for joining ENSP and teaches in a way where law is actually fascinating. She is super approachable, exams in ENSP330/ENSP102 are fair, and has clear expectations for all of her courses (including ENSP400). ", "rating": 5, "expected_grade": "A", "created": "2018-12-11T22:52:55Z"}], "department": "ENSP", "course_number": "400", "name": "ENSP400", "title": "Capstone in Environmental Science and Policy", "credits": 3, "description": "<b>Prerequisite:</b> ENSP101; and ENSP102.\n<b>Restriction:</b> Must be in Environmental Science and Policy program; and senior standing; and permission of the Environmental Science and Policy Program.\nIntegration of physical, biological, and social sciences with applications to environmental science and policy.  Problem-solving and multi-disciplinary case study evaluations pertinent to contemporary and future issues related to the environment.", "is_recent": true, "geneds": null}