{"average_gpa": 2.779037610619469, "professors": ["Raymond Weil", "Matthew Bright", "Maxine Levin", "Eni Baballari", "Maryam Foroughi", "Eni Baballari", "Raymond Weil", "Eni Baballari", "Eni Baballari", "Raymond Weil", "Eni Baballari", "Eni Baballari", "Raymond Weil"], "reviews": [{"professor": "Raymond Weil", "course": "ENST200", "review": "My favorite professor so far, and taught my favorite class so far. He has so much experience in the field, and he brings that into the classroom to help make it engaging. However, I think that you do have to think that studying soil is fun to have fun in his class (It's something I didn't expect to do, but I definitely do now!)", "rating": 5, "expected_grade": "A+", "created": "2017-12-30T20:33:47Z"}, {"professor": "Eni Baballari", "course": "ENST200", "review": "This professor is nice to her students, but it doesn't really help with her class structure / teaching style. When asked a question, she usually doesn't give a great answer. Her lectures go really fast and they're also pretty boring. The worst part is her exams -- no one ever knows how to prepare because she says to skim the textbook, but then there will be really crazy questions on the exam that you wouldn't know just from lecture. Then there's even questions you wouldn't know at all from this class' content. She will also put questions from other units into the exam you're taking even though it is not cumulative, or relevant to the current unit. She has a test bank that she takes from so some students can get really hard questions that involve a lot of math and so take more time, but others will get simpler ones. The fact that everything is multiple choice makes it really hard because her opinion on the \"best\" answer choice can be a bit confusing. Overall, it's a very unbalanced class and has been unnecessarily difficult.", "rating": 1, "expected_grade": "A-", "created": "2021-04-28T22:23:30Z"}, {"professor": "Eni Baballari", "course": "ENST200", "review": "First off, enst200 is a really hard course and no one really tells you that. There is a lot of complex concepts that you need to learn. If you are taking other AGNR classes, try your best to learn and retain the basic information because you'll definitely need it for upper-level courses. Also, the lab portion of this class is no joke! \r\nAs for this professor, she is really kind and understanding. The lectures are very boring, but personally, I think it's just the subject. The textbook is somewhat helpful. I recommend going to her office hours, especially if you have questions about your exam grades. \r\nbtw I took this spring 2020, completely online during COVID.", "rating": 4, "expected_grade": "B", "created": "2021-11-12T21:25:30Z"}, {"professor": "Eni Baballari", "course": "ENST200", "review": "Dr. Baballari is a very nice person, but her class is highly disorganized and her exam prep is very unhelpful. The study guide is a bunch of random terms (many of which were not discussed in lecture or in the slides) and no idea of what exactly you should know about the topics. I've genuinely never felt less prepared for an exam in my life.", "rating": 1, "expected_grade": "", "created": "2023-03-02T05:01:38.482280Z"}, {"professor": "Eni Baballari", "course": "ENST200", "review": "The Professor is very kind and cares a lot about the topic. When compared to lab courses in bio and chem I would say this is easier than those. I personally found the subject of soils to be really interesting so I enjoyed it. There are a lot of study materials provided. You really need to read the book and attend lectures to do well in the class.", "rating": 5, "expected_grade": "A-", "created": "2023-05-05T13:39:55.338762Z"}, {"professor": "Eni Baballari", "course": "ENST200", "review": "Professor Baballari teaches you everything you need to know to succeed. Students probably don't understand content very well since ENST 200 is so intense and they don't read the textbook. The textbook really helps you breeze by. She is extremely nice and you can always ask to review lectures, exams, or quizzes. Plenty of opportunities to succeed in her class.", "rating": 5, "expected_grade": "A", "created": "2023-05-05T13:45:19.580701Z"}, {"professor": "Raymond Weil", "course": "ENST200", "review": "This is probably the most difficult class I have ever taken at this school. DO NOT TAKE THIS FOR A GED ED. I unfortunately made that mistake. Most people are in this class to meet a degree requirement. I foolishly took this as my lab. The professor only lectures, leaves very little time for questions (if he calls on you), and makes office hours unclear. He is nice and sometimes told interesting stories, but he is took distinguished in his field to actually care about our learning. He cares about sharing his knowledge, but not preparing us for the exams. There is no exam reviews or anything like that. He'll post an extremely long list of terminology to study, which is barely any help. There are no recent practice tests available. Luckily, he curves the tests a few points when everyone did bad and the class is EXTREMELY curved. For reference, my 68 was equivalent to a B. But it was a grind to say the least", "rating": 3, "expected_grade": "B", "created": "2023-05-17T23:03:32.920409Z"}, {"professor": "Eni Baballari", "course": "ENST200", "review": "Eni is a kind soul who I have met with in office hours, after lecture, and during lab with questions and she has always shown that she wants her students to succeed. Yes, she is not the best lecturer in the department, but she genuinely cares and will do as much as she can to help you. ENST200 is sort of a weed out course so yes I got 70% on two of the midterms but I met with her after each and tried to make my studying mimic the prior exams, and because Eni was very generous with extra credit and the course curve I got an A-. So yes, I would recommend taking a class with Eni.", "rating": 5, "expected_grade": "A-", "created": "2023-07-14T12:09:28.642583Z"}, {"professor": "Raymond Weil", "course": "ENST200", "review": "DO NOT TAKE THIS CLASS AS A GENED! If you do have to take this class as a major requirement, try to get Eni Baballari as your lecture professor--she is much more helpful and responsive about questions. I had to take this class as a major requirement and it is one of the most difficult classes I've taken at UMD. Dr. Weil constantly gets off track during lecture (to the point that I stopped going and just read the textbook to learn the content) and does not provide any sort of support for office hours or exam reviews. He puts out a \"study guide\" which is really just a long list of general terms and concepts to know, but then the exams are really specific and detailed. Also if you miss an exam- even for an excused absence- they will NOT let you take a makeup exam, so be prepared to try your best on every exam. Overall not a great professor- he's accomplished and seems nice as a person but just doesn't know how to teach and needs to retire (I mean come on you've been teaching it for 10 years and still can't provide any support or structure for students?). \r\nIf you can't get Eni for your lecture professor just make sure to regularly read the textbook as it has all the lecture content without any of the drifting off topic that Dr. Weil constantly does.", "rating": 1, "expected_grade": "B", "created": "2023-11-30T01:22:33.383079Z"}, {"professor": "Raymond Weil", "course": "ENST200", "review": "He's a really great teacher who knows a TON about the subject. He is extremely knowledgeable and explains things REALLY well. However, he is not the most captivating teacher although his tangents and extra tidbits are pretty interesting. Tests are pretty hard but nice curve.", "rating": 4, "expected_grade": "B+", "created": "2023-11-30T04:16:05.539540Z"}, {"professor": "Raymond Weil", "course": "ENST200", "review": "This class is extremely hard and time consuming. The exams are the majority of your grade for the class and all other work you have to do is a very minimal percentage. Ray is very knowledgable in the content but does not know how to teach. He goes on rants about stuff that although might be interesting, it is not beneficial towards doing well on exams. There are 3 midterms and a final in the class which makes for a lot of studying. The class average on exams tends to be around 65% which is awful. He does curve the exams and the final grade but it does make it stressful right until the end. I would not recommend taking this class with him. I have heard Eni is a much better teacher so maybe take it with her if you have too.", "rating": 1, "expected_grade": "B", "created": "2023-12-14T15:08:20.932245Z"}, {"professor": "Raymond Weil", "course": "ENST200", "review": "Honestly, I think the other negative reviews on here should be taken with a grain of salt, and are most likely people who don't really understand how to study properly for this class and/or didn't take advantage of the many resources provided by Dr. Weil and Eni. Pretty much every concept in this class all builds off each other, so all you really have to do is stay on top of your studying, and make sure you're studying in a way where you're actually applying and understanding the concepts rather than just memorizing terms. The textbook is written by Dr. Weil himself which is really helpful for studying, and he makes it clear what topics you should/shouldn't study before each exam. Overall I never spent more than a few hours a week studying for this class and ended with an A- and only a few points away from an A. \r\n\r\nThe class is also super interesting in general, and Dr. Weil is an incredibly knowledgeable and awesome guy with so many cool and unique experiences around the world, and he can be really funny during lectures. I went into this class thinking it was a bit silly to learn about soil, but soil science is definitely one of the most interesting classes I've taken at UMD. Both Dr. Weil and Eni are extremely kind and caring and you can tell they want their students to succeed. In fact, I was going through a pretty hard time during the semester especially after the first exam, and Dr. Weil noticed and went out of his way to reassure me of my academic abilities despite having never met me before (I am very quiet in class and never go to office hours) which I was extremely appreciative of. \r\n\r\nOverall this class gets a reputation for being pretty hard but really you don't have much to worry about. I'm not going to lie, the exams are very challenging, but Dr. Weil does this for a reason and always has a very big curve which he explains very well in the syllabus and is incorporated into ELMS grading throughout the semester, so I never worried about what my grade was. Lab was also pretty fun in my opinion but can be very messy at times so don't show up in white or any clothes you wouldn't want to get stained.", "rating": 5, "expected_grade": "A-", "created": "2024-02-09T16:36:00.517653Z"}], "department": "ENST", "course_number": "200", "name": "ENST200", "title": "Fundamentals of Soil Science", "credits": 4, "description": "<b>Corequisite:</b> CHEM131 and CHEM132; or permission of AGNR-Environmental Science & Technology department.\n<b>Credit only granted for:</b> ENST200 or NRSC200.\n<b>Formerly:</b> NRSC200.\nStudy and management of soils as natural bodies, media for plant growth, and ecosystem components. Morphology, composition, formation, and conservation of soils. Chemical, biological, and physical properties are discussed in relation to the production of plants, the functioning of hydrologic and nutrient cycles, the protection of environmental quality, and engineering uses of soils.", "is_recent": true, "geneds": null}