{"average_gpa": 3.152215114901682, "professors": ["Elisabeth Maring", "Christine Schull", "Lauren Messina", "Amy Lewin", "Yoonjoo Lee", "Deirdre Quinn", "Barbara Singer", "Tiffani Stevenson Lloyd", "Amanda Ginter", "Mili Duggal", "Julie Fife", "C Conway", "Deborah Shelef", "C Conway", "Christine Schull", "Deborah Shelef", "Jingshuai Du", "Charles Conway", "Amy Lewin", "Christine Schull", "Amy Lewin", "Christine Schull", "Amy Lewin", "Amy Lewin", "Amy Lewin", "Christine Schull", "Martha Yumiseva", "Christine Schull", "Martha Yumiseva", "Amy Lewin", "Christine Schull"], "reviews": [{"professor": "Amanda Berger", "course": "FMSC332", "review": "easy professor! makes the material interesting. ", "rating": 5, "expected_grade": "A", "created": "2010-12-30T02:27:00Z"}, {"professor": "Amanda Berger", "course": "FMSC332", "review": "Loved this professor, she is so cute and very nice, she give weekly quizzes and there are two papers..also she loves Mean Girls movies that you will need to watch for one her assignment..what else yes her Exams...study her notes and try reading the textboook as well..and the finale exam was pretty as well..it was not cumulative I hope I helped! :)", "rating": 4, "expected_grade": "B", "created": "2010-09-02T00:44:00Z"}, {"professor": "Amanda Berger", "course": "FMSC332", "review": "She gives you notes to fill in during lecture. Her examples are very inetersting and she keeps you engaged in the subject. You should really study for the test, but alteast you know what the test will be on, unlike some professors!", "rating": 5, "expected_grade": "A", "created": "2009-11-11T16:18:00Z"}, {"professor": "Elisabeth Maring", "course": "FMSC332", "review": "Dr. Maring is a very kind, approachable woman. Her class is very easy-4 midterms, 6 online quizzes, and a few in class activities.  She also shares a lot of stories from her own experience parenting, which is very cute.\n\r\nHowever, I will add that she does dumb down course material quite a bit, and her lectures move very slowly.  Not the best class/professor if you're looking to stay engaged or challenged.", "rating": 3, "expected_grade": "", "created": "2011-04-11T12:44:00Z"}, {"professor": "Amy Lewin", "course": "FMSC332", "review": "save yourself the work and headache. If you are here for an upper level elective, The amount of work for this class is a shit ton. take online courses during winter and summer.  never again. ", "rating": 2, "expected_grade": "A-", "created": "2018-10-25T15:24:27Z"}, {"professor": "Amy Lewin", "course": "FMSC332", "review": "Great professor, I learned a lot from this class", "rating": 5, "expected_grade": "A", "created": "2019-04-17T17:28:52Z"}, {"professor": "Christine Schull", "course": "FMSC332", "review": "Professor Schull is okay. She gets the job done. Nothing special but an easy grader on papers. Quizzes are hard but the other assignments make up for it", "rating": 4, "expected_grade": "A", "created": "2020-12-03T15:48:10Z"}, {"professor": "Amy Lewin", "course": "FMSC332", "review": "Fantastic! Communicates material clearly and tries to make it engaging and applicable. Cares so much about her students. Really fair assessments, very flexible. ", "rating": 5, "expected_grade": "", "created": "2020-12-20T20:09:56Z"}, {"professor": "Amy Lewin", "course": "FMSC332", "review": "Prof Lewin is the best. I  just took FMSC 332 online in a 3 week semester. I  cannot recommend this class enough. It was a very intense 3 weeks but the topics were super interesting and the class was asynchronous. There were 5 discussion boards, 5 quizzes from the textbook, 2 papers, and a family project. It def kept me busy but I  am so glad I signed up for this class.", "rating": 5, "expected_grade": "A", "created": "2022-06-20T18:55:55Z"}, {"professor": "Christine Schull", "course": "FMSC332", "review": "Really nice and understanding professor. Class is very manageable, organized, and overall it's pretty easy. Class is structured so that if you miss class, all the content is uploaded so you don't need to worry about falling behind.", "rating": 5, "expected_grade": "A", "created": "2023-05-13T22:49:19.443551Z"}, {"professor": "Amy Lewin", "course": "FMSC332", "review": "It's clear that Professor Lewin genuinely cares about the class and the students that take it. She is passionate about the course content and is very very accommodating to everyone. The class overall was quite light so long as you make the effort to attend lecture.", "rating": 5, "expected_grade": "A", "created": "2023-07-07T15:29:49.517515Z"}, {"professor": "Christine Schull", "course": "FMSC332", "review": "She isn't the worst professor. The way she lectures is pretty interesting. The problem I have with her is her attitude and the time she takes to respond to emails. She will wait until the day before an assignment is due to respond to your question. On top of that won't answer your question and tell you to choose a different assignment out of the six assigned. She also gets upset when people ask certain questions.", "rating": 3, "expected_grade": "", "created": "2024-03-16T02:16:16.266948Z"}], "department": "FMSC", "course_number": "332", "name": "FMSC332", "title": "Children in Families", "credits": 3, "description": "<b>Prerequisite:</b> PSYC100 or FMSC105.\n<b>Credit only granted for:</b> FMSC332 or FMST332.\n<b>Formerly:</b> FMST332.\nA family life education approach to the study of children and families. Emphasis on the interaction of children with parents, siblings, extended kin, and the community.", "is_recent": true, "geneds": null}