{"average_gpa": 3.0615445859872614, "professors": ["William Knight", "Manouchehr Mokhtari", "Katherine Speirs", "Jesse Jurgenson", "Manouchehr Mokhtari", "William Knight", "Jesse Ketterman", "Manouchehr Mokhtari", "William Knight", "Isha Chawla", "Manouchehr Mokhtari", "William Knight", "Manouchehr Mokhtari", "Manouchehr Mokhtari", "Isha Chawla", "Manouchehr Mokhtari", "Manouchehr Mokhtari"], "reviews": [{"professor": "Manouchehr Mokhtari", "course": "FMSC341", "review": "Probably one of the worst lecturers I've ever had. The course is greatly structured around cengage and the lecture slides are from the same company -- never in his own words or inclusive of anything he rambles on during lecture. He is very incomprehensible and generally a terrible public speaker; the lecture slides tend to be 56 slides, which he only goes over ~20 if you're lucky. He also is very unapproachable outside of class and can never be contacted via ELMS or email. \r\n\r\nFor homework, it is weekly and you will have to purchase cengage ($130); the interface itself is also incomprehensible and the syllabus does not specifiy what you are to complete -- it just says assignments, while there are three different assessments on cengage. For this sake, 3/4ths of the class missed four homeworks. When asked, he aggressively avoided the question and said to review the syllabus -- this happened three times during class, it's actually quite scary how combative the classroom was. \r\n\r\nOverall, I would strongly recommend taking another lecturer, but FMSC341 and FMSC290 are only taught by him, so you can't escape any of these experiences. Hopefully these issues will be addressed for future courses, otherwise you will feel just as vulnerable as our class did.", "rating": 2, "expected_grade": "B+", "created": "2020-03-13T20:46:19Z"}, {"professor": "Manouchehr Mokhtari", "course": "FMSC341", "review": "Professor Mokhtari is extremely lenient on due dates and grading. At the end of the semester, he changed the due dates to every past assignment to the last day of class so we could go back and increase our grades and turn in anything we hadn't already. My only complaint is that his lectures are very boring and if you ask him a question, he will spend 20 minutes explaining his answer.", "rating": 5, "expected_grade": "C", "created": "2020-12-27T15:16:35Z"}, {"professor": "Manouchehr Mokhtari", "course": "FMSC341", "review": "The best prof at the UMD. Has a great passion for helping  students. Thoughtful and considerate. Responds to emails real fast. A great lecturer. He makes the course easy by being there for you. Assignments and the tests follow the main topics in the course. ", "rating": 5, "expected_grade": "A+", "created": "2021-04-13T01:25:42Z"}, {"professor": "Manouchehr Mokhtari", "course": "FMSC341", "review": "Dr. Mokhtari is a great professor overall. You can tell he truly cares about his students, he tries to make sure that his lectures are applicable, and his grading is very lenient. From my understanding, due dates are also very lenient as well. The only heads up for this class is that he makes it extremely mathematically based, so if you're not good at math, this probably is not the greatest choice for a gen ed.", "rating": 5, "expected_grade": "A+", "created": "2021-12-22T00:14:21Z"}, {"professor": "Jesse Ketterman", "course": "FMSC341", "review": "Well organized professor, class was interesting", "rating": 5, "expected_grade": "A+", "created": "2022-12-20T18:30:53.649917Z"}], "department": "FMSC", "course_number": "341", "name": "FMSC341", "title": "Personal and Family Finance", "credits": 3, "description": "<b>Credit only granted for:</b> FMSC341 or FMST341.\n<b>Formerly:</b> FMST341.\nIndividual and family financial strategies with emphasis on financial planning, savings, investments, insurance, income taxes, housing, and use of credit. Planning, analyzing, and controlling financial resources to resolve personal/family financial problems and to attain financial security.", "is_recent": true, "geneds": null}