{"average_gpa": 3.171754700089525, "professors": ["Kevin Roy", "Damian Waters", "John Hart", "Allison Schroeder", "Laura Golojuch", "Shinta Hernandez", "Stephanie Grutzmacher", "Ashley Munger", "Izidora Skracic", "Natasha Williams", "Natasha Williams", "Kevin Roy", "Natasha Williams", "Natasha Williams", "Kevin Roy", "Natasha Williams", "Natasha Williams", "Kevin Roy", "Natasha Williams"], "reviews": [{"professor": "Kevin Roy", "course": "FMSC381", "review": "I'm just gonna throw this out there - Kevin Roy changed my life. Ok, maybe not. \r\nBut FMSC381 with Dr. Roy *was* one of my favorite classes of college - it opened me eyes to so many new aspects of our society that I was simply unexposed to for the first 20+ years of my life. \r\nAlso, Professor Roy is just a great lecturer. He brings in a lot of statistics and relevant, practical examples that really highlight the points he is trying to convey through out the course, Plus, he really keeps your attention, if you know what I mean. The only downside of the class is that it's at 9am. But honestly - it's worth it. \r\nThere are a bunch of assignments and papers, but they are all very doable if you give yourself enough time. Also, Dr. Roy is a very fair grader, so if you put in the work, you'll likely do well.\n\r\nA genuinely sweet professor, really interesting course content, and a class that changed my outlook forever. Takeittakeittakeit!\n\n\n\n", "rating": 5, "expected_grade": "A", "created": "2013-01-19T11:46:00Z"}, {"professor": "Kevin Roy", "course": "FMSC381", "review": "Dr. Roy is a great lecturer, he lectures outside of his power point slides. If you pay attention in class and keep up with the readings this class should not be difficult. There are two projects in this class but if you start them early you will be fine. ", "rating": 5, "expected_grade": "B", "created": "2010-07-20T12:32:00Z"}, {"professor": "Laura Golojuch", "course": "FMSC381", "review": "Prof. Golojuch is the nicest person ever! She's a great professor and always finds a way to keep the class engaged. Her tests are straight forward. The readings are very interesting (I'm not much of a reader) but I found myself just wanting to read more. This course is one of my favorites so far at my time at UMD. ", "rating": 5, "expected_grade": "A+", "created": "2020-08-09T19:33:54Z"}, {"professor": "Natasha Williams", "course": "FMSC381", "review": "Not a huge fan. Makes her TAs do everything throughout the semester and then grades the midterm and final essays herself REALLY harshly for no reason. I don't understand why she is such a harsh grader when she barely even teaches the class. All lectures were asynchronous and from last semester. It was like no effort was put into the class, but it's then graded brutally. It's any easy class just with unreasonable grading. ", "rating": 2, "expected_grade": "A-", "created": "2021-05-04T14:47:04Z"}, {"professor": "Kevin Roy", "course": "FMSC381", "review": "I changed my major from community health to family science because of this course. You learn so much and dr.Roy made my experience better. He is a good lecturer and made this class relatively easy. This class doesn't require much besides few quizzes, writing a few papers, and 3-4 exams throughout the semester that are open note. Would take another class with Dr.Roy if possible.", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T04:16:21.606021Z"}], "department": "FMSC", "course_number": "381", "name": "FMSC381", "title": "Poverty, Affluence, and Families", "credits": 3, "description": "<b>Prerequisite:</b> SOCY100 or SOCY105.\n<b>Restriction:</b> Must be in a major within SPHL-Family Science department.\n<b>Credit only granted for:</b> FMSC381 or FMST381.\n<b>Formerly:</b> FMST381.\nSocial, political, cultural and economic factors influencing income and wealth in American families.", "is_recent": true, "geneds": null}