{"average_gpa": 3.3943314849044977, "professors": ["Martha Geores", "Rachel Berndtson", "Byron Marroquin", "Rachel Lamb", "Rachel Haber", "Rachel Haber", "Rachel Lamb", "Kaihui Song", "Rachel Haber", "Rachel Haber", "Rachel Haber"], "reviews": [{"professor": "Allen Eney", "course": "GEOG330", "review": "Eney is the man. He only requires you to show up to class and write 2 10 page papers. A little advice on the papers, do them ASAP! They are usually due during midterms week, free up your time. He gives you a review of final before hand so you're pretty much given what you need to know/study for. He's not a bad man either, you just can't piss him off.", "rating": 5, "expected_grade": "A", "created": "2008-09-14T16:38:00Z"}, {"professor": "Martha Geores", "course": "GEOG330", "review": "Although Geores is an extremely nice woman, I felt the class itself was not worth a lot of my time. Her PowerPoints are very messy and disorganized. The textbooks she used were very dense with information and detail, especially for an I-Series. She didn't curve any of the exams, and the average on the final was a 50/75, with no one getting an A on it.  ", "rating": 2, "expected_grade": "", "created": "2015-01-12T20:41:00Z"}, {"professor": "Rachel Berndtson", "course": "GEOG330", "review": "Her lectures were really well done. Her exams were quite fair , the only issue is some of the essays and sources required for example felt quite excessive. She assigned alot of readings too, but you did not really need to do them to do well.", "rating": 4, "expected_grade": "A", "created": "2020-12-23T22:41:58Z"}, {"professor": "Rachel Berndtson", "course": "GEOG330", "review": "Dr. Berndtson is amazing! I definitely recommend this class to students who want to fulfill GenEd requirements (DSHS, DVUP, SCIS) but don't want to do a final exam. Her class was very enjoyable or at least manageable: group assignments in discussions on Friday (aka reflection activities) that is due before the next discussion, short lecture responses that she posted at the end of the class (just write your opinion using terms or knowledge you learn from the lecture), a big debate, a video assignment, a long paper, 2 midterms, and 1 final paper. This year the final paper is optional!\r\n\r\nAttend every lecture and discussion and you will pass the class! Although Dr. Berndtson posts her lecture slides on ELMS, she blocks out important info written in red that's only shown in class. Also, she gives the exam layouts and debate/presentation formats only during lectures. This year, Dr. Berndton didn't seem to take attendance during lectures, but the TAs in the discussion do (and you lose lots of points for it). The TAs are also awesome (Natalie and Jeff). Ask questions when you don't know! Don't be shy because they will help you until you get it.\r\n\r\nOverall the class is easy, but make sure you and your group communicate well, divide the work clearly, and put full effort into every assignment. Watch out for small mistakes (the TAs will deduct points for missing page numbers, in-text citation, etc). Also, study well for the exams! They are completely based on what's taught in lectures so review the notes well.", "rating": 5, "expected_grade": "A", "created": "2021-12-06T18:51:41Z"}, {"professor": "Rachel Berndtson", "course": "GEOG330", "review": "This class was fairly easy, and the material is mostly common sense revolving around sustainability. There are a lot of readings every week, but you don't really need to read them to do well. She also usually goes the information from the readings in the lectures, and specifies what readings you will need to go back to for assignments. There were only two exams the whole year and she provided a review for both. Her lectures are really thorough and they are all posted online. However she withholds some info on the ones she posts, so you will only get the full information if you come to lecture. There are also lecture responses that you can only respond to in class which can impact your grade. There were three big papers throughout the semester, but they were not that hard, and they do require a lot of scholarly sources. There is also a lot of group work and writing in this class. There is usually a group paper due every week, so if you have a good group it is not that hard. If you enjoy learning about climate change this class is definitely very interesting and fun. Attendance is only \"mandatory\" for discussion, they required you to fill out a form every week in discussion, but you can also do that at home since the link doesn't change. Overall I really enjoyed the class, loved the professor and TA's, and would recommend it to everyone. ", "rating": 5, "expected_grade": "A-", "created": "2021-12-06T19:47:26Z"}, {"professor": "Rachel Haber", "course": "GEOG330", "review": "Dr. Haber (previously Dr. Rachel Bernstdon) is a world-class lecturer. She always explains concepts in a way that is very clear and easy to follow. She does have a few weird course policies, though. Either way, I would highly recommend taking a class with her!", "rating": 5, "expected_grade": "", "created": "2022-11-08T16:37:27.336915Z"}, {"professor": "Kaihui Song", "course": "GEOG330", "review": "I took this class asynchronously for the Summer semester. Although asynchronism is not my favorite way to learn, Professor Song kept it concise and interesting. The workload is slightly more intense than typical long semester (like Fall or Spring), but given the short semester, I think the workload is pretty decent. Some ideas I learnt from in this class really shaped my thoughts about sustainability. I highly recommend this class!", "rating": 5, "expected_grade": "A", "created": "2022-11-13T18:49:11.054280Z"}, {"professor": "Rachel Haber", "course": "GEOG330", "review": "Lecture material is easy to understand, exams are fair, and overall a great class. I would recommend taking this class.", "rating": 5, "expected_grade": "A", "created": "2022-12-07T21:33:10.496318Z"}, {"professor": "Rachel Haber", "course": "GEOG330", "review": "Professor Haber is incredibly intelligent and knowledgable. Her lectures are straightforward, and the content is generally easy to digest. The material covered in lectures are almost directly based off of the textbook readings. She has a no laptop policy, but she'll let you write on an iPad or tablet (most people just wrote in a notebook though). Despite this policy, she talks fast sometimes, and it can be hard to keep up. There are two exams, two papers (there's another optional one for extra credit), and group projects. The papers are research and creatively based, but make sure to get an early head's start, as they are longer papers. Overall, I felt like there was a lot of work to complete for a gen-ed, and lectures got boring towards the end, but it wasn't a bad class to take (especially since it fulfills 3 gen-ed requirements).", "rating": 4, "expected_grade": "A+", "created": "2023-12-06T22:40:48.571505Z"}, {"professor": "Rachel Haber", "course": "GEOG330", "review": "Dr. Haber is a fantastic lecturer. Everything was organized and made sense, and the material was really interesting! The exams were fair, and though discussion was mandatory, the activities we did helped me understand the concepts better. I didn't really like how group work was emphasized so much. We did a debate during discussion, which in principle, wasn't so bad, but the TA basically held our hand through the entire thing. Overall, I didn't have to worry too much about the course except for exams, and I appreciated being able to just attend lectures and absorb the material.", "rating": 5, "expected_grade": "A", "created": "2023-12-12T21:16:26.441344Z"}, {"professor": "Rachel Haber", "course": "GEOG330", "review": "Dr. Haber is a very good lecturer, very patient, informed, and kind. She is always willing to take questions and meet during her office hours for extra help. She does not allow laptops open during lecture (only paper notes/ iPads or tablets that can lay flat) but the policy honestly saved me a lot of time studying because I was very infrequently getting distracted during lecture. There are two exams total (the final is a non-cumulative second exam) and they are both very short and extremely fair to the content. You will get points each week for attending discussion, so attendance is mandatory but the TAs are very nice and keep discussion entertaining (shoutout Amanda). There is one initial (short, creative) paper, one midterm paper which definitely requires a good amount of effort, and an optional paper at the end of the semester for extra credit if needed. Overall, I would definitely recommend others that are interested in sustainability/the environment/geography/development to take this class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-13T03:37:00.971513Z"}, {"professor": "Rachel Haber", "course": "GEOG330", "review": "Pretty fair grader, will allow regrades if you think anything was inconsistent. The lectures were very digestible, but honestly the content is so simple it doesn't really matter. Exams were very similar to the practice ones, just study with quizlets and you will be fine. Discussion section had some interesting projects and group work, like a mass debate that was kinda fun. All around a fun and easy course.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T17:30:05.145250Z"}, {"professor": "Rachel Haber", "course": "GEOG330", "review": "Professor Haber definitely has a passion for geography and sustainability, which is displayed throughout her lessons. The exams are not too bad as long as you pay attention to the lectures. You are graded on participation during the discussion sections. Though attending lectures isn't required, it is crucial to go because she does not post the lessons on Canvas. For a 300-level class, it was not too bad and was easy to pass.", "rating": 4, "expected_grade": "A-", "created": "2023-12-19T20:53:43.562145Z"}, {"professor": "Rachel Haber", "course": "GEOG330", "review": "she takes her job seriously and has extra credit", "rating": 5, "expected_grade": "A", "created": "2023-12-24T04:27:38.319731Z"}], "department": "GEOG", "course_number": "330", "name": "GEOG330", "title": "As the World Turns: Society and Sustainability in a Time of Great Change", "credits": 3, "description": "<b>Credit only granted for:</b> GEOG330, GEOG360, or GEOG362.\n<b>Formerly:</b> GEOG362.\nCultural geography course on society and sustainability. Culture is the basic building block that is key to sustainability of societies. Course will cover sustainability of societies on different scales, examining local, regional, and worldwide issues. Sustainability will be examined as a key element of environmental sustainability. How societies adjust to rapid world change will be examined as a positive and/or negative factor in sustainability.", "is_recent": true, "geneds": null}