{"average_gpa": 3.1452789699570816, "professors": ["Michael Evans", "Rachel Pinker", "Derrick Lampkin", "Michael Gerst", "Melissa Kenney", "Jeffrey Henrikson", "Laura McBride", "Samantha Kemper", "Jeffrey Henrikson", "Jeffrey Henrikson", "Tracey Centorbi", "Samantha Kemper", "Samantha Kemper", "Samantha Kemper", "Jeffrey Henrikson", "Rachel Pinker", "Jeffrey Henrikson"], "reviews": [{"professor": "Rachel Pinker", "course": "GEOL123", "review": "This class is really not too challenging at all.  Almost all the lecture material is posted online and the exams aren't too overwhelming.  The only downside to this class is that is usually work done in discussion, so you really should attend-there's also quizzes every couple of weeks, too.  However, most of the time discussion will at least be an opportunity to boost your grade and depending on who your TA is, it might not be a lot of work.  The only big discussion assignment was the Kyoto project near the end, but that wasn't even bad.\n\r\nAlthough most of this class is okay, a big negative about this class is that it's co-taught by 3 professors, so it seems a big \"scattered\" and overwhelming at times.  Just make sure you go through the slides before exams (there are two midterms and a final) and ask any questions about the material and you should be okay...Pinker is not the greatest lecturer at all though, so my advice is sit near the front when she lectures so you can pay close enough attention to what she says...and make sure you look at her material very closely......good luck!", "rating": 3, "expected_grade": "A", "created": "2009-06-01T22:27:00Z"}], "department": "GEOL", "course_number": "123", "name": "GEOL123", "title": "Causes and Consequences of Global Change", "credits": 3, "description": "Cross-listed with AOSC123.\n<b>Credit only granted for:</b> AOSC123, GEOG123,  GEOL123, or METO123.\nStudy of the major components of Earth's climate system and climate change history. Discussion of 21st century climate change prediction, mitigation and adaptation efforts.", "is_recent": true, "geneds": null}