{"average_gpa": 3.1336334984241327, "professors": ["Sarah Croco", "Johanna Birnir", "William Reed", "Ted Plettner", "Pavel Coronado-Castellanos", "Rithvik Yarlagadda", "Sarah Croco", "Johanna Birnir", "Rithvik Yarlagadda", "Ojashwi Pathak", "Johanna Birnir", "Sarah Croco", "Johanna Birnir"], "reviews": [{"professor": "Sarah Croco", "course": "GVPT201", "review": "A loud and fun personality in the classroom.  GVPT 201 is a dreadful course but if you need to take it, she's the professor you want.", "rating": 5, "expected_grade": "", "created": "2019-05-01T16:55:24Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "Dr. Croco helped enliven an otherwise (kinda) boring stats class. It was a requirement for me (GVPT major). \r\nI had never taken a stats nor programming course before, so I knew it was going to be interesting. There are several (~11) coding HW assignments throughout the semester, but the coding wkbk kind of *gives* you the code to rework. Yes, it’s time-consuming, but it’s a lot easier once you get into a habit.\r\nMake sure to read the chapter in the textbook *before* lecture, otherwise you’ll fall behind quickly.\r\nI also found it easy to schedule office hrs with my TA to discuss some minor coding stuff, and stop by Dr. Croco’s during open office hrs to ask questions.", "rating": 5, "expected_grade": "A+", "created": "2019-12-18T02:38:30Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "Johanna is a wonderful lady and knows her stuff, but the course really sucked. It's half statistics half coding in R. You have to really enjoy that type of thing to enjoy the class. I figure taking it at the undergrad level also helps gov majors figure out if they'd wanna go into political science ", "rating": 4, "expected_grade": "A-", "created": "2020-05-16T04:19:57Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "Words cannot express how much this course ruined my semester.  BUT Croco is awesome and keeps the lectures very entertaining.  She is a great prof, but your TA's run the show.  They're the ones grading your assignments and teaching you the detailed stuff.  Exams are no joke.", "rating": 5, "expected_grade": "B-", "created": "2020-06-13T02:33:48Z"}, {"professor": "Rithvik Yarlagadda", "course": "GVPT201", "review": "Rithvik was an amazing professor this summer. I took the course online from june to july. He was super easy to reach, was extremely helpful when answering questions, and just made the course a lot less scary. This course was super intimidating for me as a gov major who knows nothing about coding/programming. But, I completed all of my assignments and asked Rithvik for help whenever I needed it, and I was able to receive the grade I wanted. Would definitely recommend him!", "rating": 5, "expected_grade": "A", "created": "2020-07-21T01:42:51Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "This class is not fun but Professor Croco is so entertaining. It's essentially a statistics and coding class. Not sure why it's labeled a gov class. Glad I'm done with it. ", "rating": 3, "expected_grade": "A-", "created": "2020-11-24T00:20:49Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "Not the hardest class in the world but it's certainly challenging especially if you don't know coding. I had to go to office hours every week to get help on the weekly coding assignments. I could not have gotten through this class without my TA. They're also time consuming so manage your time. If you do that, you can make the class less overwhelming. Unless you're a GVPT major or are good at coding, I wouldn't recommend this class just because of how time consuming and complicated it can be. ", "rating": 4, "expected_grade": "", "created": "2021-05-14T03:07:50Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "The TA's basically teach instead of her. She relies on previously recorded lectures and her in person stuff is boring. 201 is a coding class disguised as a gov class, wouldnt reccomend.", "rating": 2, "expected_grade": "A+", "created": "2021-12-20T05:20:26Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "While she is a nice teacher, she barely discussed coding which is a vital CRUCIAL part of this course. I'm not sure why she didn't discuss coding more. However, if you asked her about it outside of class she was helpful. Be aware, however, that this class is very boring and requires persistence to get an A especially if you have no coding experience like I did.", "rating": 3, "expected_grade": "A", "created": "2022-08-05T18:24:51Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "I agree with the other reviews - avoid this class at all costs, but if you MUST take it, then you want this professor. She records each lecture and uploads them so attendance is not necessary. I did not go to class and it made our two exams very difficult, but I would rather cram the week of if it meant my weekly schedule was lighter. They are online and the second is worth much more points. The HW consists of a coding assignment each week due Wed night at 11:59 (based on accuracy). Our class did so bad as a whole, she curved the final 19 points- the mean was a 71, so basically a D. She is generous when she needs to be and is very good at addressing issues, answering questions, and being clear about what is to be expected. TA's go over homework code in sections so attendance for those are required and HELPFUL. She seems intimidating on day one, don't let that scare you off. It is not her fault this class sucks, she even said she is required to teach some things even if she doesn't think we will ever use it.", "rating": 5, "expected_grade": "B+", "created": "2022-12-13T06:35:39.024447Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "I really liked professor croco. Her lectures can be kinda boring but she makes it as engaging and fun as possible. Honestly, her assignments are super cool if you let them be. The final memo was super fun to do, which I know sounds crazy to say about a 4 page regression analysis. GVPT201 has a bad reputation but croco will make sure you are taken care of", "rating": 4, "expected_grade": "A", "created": "2022-12-17T04:39:09.583199Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "When I initially signed up for this course, all I had heard was how much of a nightmare it could be. However, Dr. Croco was AMAZING. Her lectures are great and I highly recommend listening to them a few times to comprehend the material. The coding seems intimidating at first, but as long as you attend discussion and read the workbook, you will be fine. Also, do not be afraid to reach out to Dr. Croco, she is always happy to answer questions and will respond very quickly. If you are interested in political science research, then take this class!!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T02:53:56.245355Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "This class is mostly about stats and that jazz and basically serves as an intro to political research. It's boring, but she tries her best to make it interesting. R is used in this class like a calculator and you have coding assignments every week. Go to discussion for participation points. Other than that, the exams scores weren't the greatest and even though she said that she wouldn't give extra credit, she had like two extra credit opportunities.", "rating": 4, "expected_grade": "A", "created": "2023-01-09T20:33:43.163474Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "This is probably the worst class I have ever taken at UMD. The lectures and the homework are two totally different things that are technically related so they get away with lumping these two topics into one course. The lectures are fine they are just incredibly boring and dull. The homework however is a complete nightmare. If you have never taken Statistics or any type of coding, then you will be in a world of hurt. The homework has nothing to do with research methods but is all about statistics and data analytics using R. The workbook assigned for R is an incredibly poor resource for learning how to use the software and half expects you to understand the software beforehand. The Professor never teaches you how to use R, this is up to the TA and they dont teach, it's just a quick rundown on the assignment for that week. If you dont like data analytics and dont want to have to teach yourself how to code then avoid this class at all costs.", "rating": 1, "expected_grade": "C-", "created": "2023-04-07T18:11:38.940594Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "Come into this class with a stat background. Can not stress enough. You can expect to spend multiple hours on the weekly homework assignments and being familiar with R coding language and the concepts will cut down that time significantly. Getting the  R Companion to Political Analysis is a MUST but the other textbook you don't need. However, she does pull her midterm questions straight out of the textbook and the midterms are open notes so it can help. You will never have to read it though.  While Dr. Birnir's in-class lectures are lacking, her pre-recorded videos of all of her lessons are infinitely better. This is not a class that takes attendance even for the \"mandatory\" speaker. Your TAs in this class will be your lifeline. That being said if you do the work and go to discussion you should be able to easily succeed.", "rating": 3, "expected_grade": "A+", "created": "2023-04-26T02:12:56.362517Z"}, {"professor": "Ojashwi Pathak", "course": "GVPT201", "review": "Very helpful and accommodating with R, which is a difficult software to use even for students who may have used it in STAT100. She takes time in discussion sections to answer any questions about concepts and codes, and has helpful office hours as well.", "rating": 5, "expected_grade": "B-", "created": "2023-04-26T23:39:42.016762Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "Very good professor. She provided so many videos and chapter notes for all the course materials, was available during office hours, explained things very well in lecture and made sure to answer all questions, and was a knowledgable resource in this course. I was very nervous going into this course with all the negative reviews. However, I learned that the class is a lot of work. The class has a workload of a true 3 credit course, not a traditional GVPT course. If you enjoy data analysis, and you are willing to put in the work, Prof. Birnir will provide you with MORE than enough resources to succeed. Don't be scared by the negativity surrounding this course-I really enjoyed it and I'm glad I took it. Data analysis is the future, and is necessary for jobs in government. If this is not your thing, don't blame the class/professor, and they did a phenomenal job.", "rating": 5, "expected_grade": "A", "created": "2023-05-02T17:49:36.515348Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "Dr. Birnir is a lovely woman, and she really does her best with this class, and conveys the necessary info.  She gives plenty of resources and is always nice when you ask her questions. This being said, this was one of the worst classes I’ve ever taken. I’m not a statistically inclined person, so this class was my own personal hell. The weekly coding homeworks were long, confusing, and frankly not very useful. Your TAs really make it break this class, and unfortunately mine weren’t the best. If you’re a gvpt major, you need to take this class, but if it is not required for your major do NOT take it. I can understand why some people liked it, but a vast majority end up really disliking this class.", "rating": 2, "expected_grade": "", "created": "2023-05-08T19:32:48.269321Z"}, {"professor": "Sarah Croco", "course": "GVPT201", "review": "overall:\r\nso this class was definitely difficult at first, but after some time you start to get used to it. you learn how to use r-studio which isn't easy but as long as you go to discussion and use the textbook you'll be fine. the midterm was a lot of material, but the project she has you do at the end really boosts your grade and is pretty easy. the final was a bit easier than the midterm and there was a big curve at the end. she also gave my class extra credit opportunities. her lectures are pretty interesting and I would definitely recommend going in person instead of watching her online. discussion sections are boring but do go because they take attendance and my TA would work through our homework problems to give us answers which helped my grade a lot \r\n\r\nrecommendations/heads up\r\ngo to discussion, go to lectures in person, give yourself time to do the homework assignments (your TA will be your best friend for the homework assignments), take time to study the midterm and you'll be good", "rating": 4, "expected_grade": "A+", "created": "2023-05-10T16:04:42.159545Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "Do not fall for how this course is listed under 'GVPT'; it is not a government course. There are no prerequisites to this class, but you should have a background in statistics and coding if you are considering applying. Dr. Birnir flies through material in lectures so your best bet is reading the textbook to understand what's going on. The TA's are usually pretty helpful with the coding homeworks, though. Some people complain that the midterm exams and final project don't relate to what goes on in class, but they actually test directly on what is talked about in class and on homeworks. I wouldn't recommend this class if it's not required for you to take, or if you're not really interested in data/information science.", "rating": 3, "expected_grade": "A+", "created": "2023-05-12T16:57:44.431613Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "I had heard some negative things about Professor Birnir, but i had a great experience with her. The class was hybrid so i didn’t have to physically go to class, but you could if you wanted to and sections were over zoom/in person. I like the flexibility of having options on whether you wanna attend in person or over zoom. The coding is pretty hard, but as long as you do every assignment you’ll pass. The final memo was a bit difficult for me since coding and statistics wasn’t my strong suit, but I got an 100% on it surprisingly. If you do all the work and at least try you’ll pass with at least a B. I would recommend this professor!", "rating": 5, "expected_grade": "B", "created": "2023-05-28T18:48:37.264928Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "I had Dr. Johanna Birnir in Spring 2023. Dr. Birnir is an average professor however, her research in the field has made her respected. GVPT201 was not easy and there were hard quizzes every week on the content of the class. The class is extremely challenging, especially if you do it on your own so make friends in the class! Dr. Birnir is okay.", "rating": 3, "expected_grade": "A-", "created": "2023-12-11T20:56:26.642648Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "GVPT201 has very similar concepts to that of a statistics class but with different coding in R. During the lectures Prof. Birnir is hard to pay attention to but she posts the slides and there is a textbook with the concepts she goes over in class to help explain what is going on. The coding isn't too bad, they typically provide samples that are really helpful for all the homework. The coding definitely doesn't always relate to what she is talking about in class, but her tests are fair. There are also a lot of resources including sample quizzes, and online videos explaining the concepts again that can be really helpful.", "rating": 4, "expected_grade": "A", "created": "2023-12-19T19:42:48.637018Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "Super clutch. One extra credit assignment, drops lowest HW if 80% of class does course review. Exams are online, open book. You can zoom into your lecture and discussion live. Lots of practice assignments, etc. Final project is a big chunk of your grade. The whole concept of the course is really cool, learning to improve data analytics skills, creating and sending out a massive survey, then conducting a project based on the data of that survey.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T19:57:25.760455Z"}, {"professor": "Johanna Birnir", "course": "GVPT201", "review": "as a teacher 6/10, as a person 10/10. I passed with a B-, for the hw honestly work as groups. codes are very unqiue and you will get stressed.", "rating": 5, "expected_grade": "B-", "created": "2024-02-13T17:44:53.253716Z"}], "department": "GVPT", "course_number": "201", "name": "GVPT201", "title": "Scope and Methods for Political Science Research", "credits": 3, "description": "<b>Credit only granted for:</b> GVPT100 or GVPT201.\n<b>Formerly:</b> GVPT100.\nAn introduction to empirical research in political science.", "is_recent": true, "geneds": null}