{"average_gpa": 3.8501098901098905, "professors": ["Michel Cukier", "Zhi Lin", "Zhi Xiang Lin", "Michel Cukier", "Zhi Xiang Lin", "Michel Cukier", "Zhi Xiang Lin", "Mohammad Islam", "Michel Cukier", "Mohammad Islam"], "reviews": [{"professor": "Michel Cukier", "course": "HACS200", "review": "\"Dumpster fire\" barely suffices to describe the horror of this course.\r\n\r\nTLDR: \r\ncourse: absolute train-wreck, 0/10 would not take again. The students being so happy that a course is over is really something.\r\ninstructor: performance beyond awful in running the course and for encouraging p-hacking. Would rate 0 stars if I could.\r\n\r\nFirst and foremost, this was way to much work for a 2cr 200-lv course.\r\n\r\nLack of documentation / spec doesn't help either. \r\nUsing MITM software provided by the course staff is virtually required, which wouldn't be too bad except for the fact that it's broken and lacks documentation.\r\nImportant bug fixes to it were made multiple weeks into the semester, and the entire setup relies on deprecated packages, so updating breaks it.\r\nEven after those fixes, it's still bugged. (This is treating the \"it's a feature, not a bug\" aspects as features)\r\n\r\nNext up is asinine / lack of grading criteria. \r\nInitially, assignments at least had rubrics provided. (Marking in adherence to the rubrics, not so much)\r\nPeer reviews were used to give feedback (rather than instructional staff) for a large assignment early on, which wouldn't be an issue if the peer review comments correlated with the marks given.\r\nGrades were assigned here pretty arbitrarily, using justifications like 'this section was not 2 pages' (paraphrased) to deduct points from groups that had slightly above 2 pages as well as those with slightly below.\r\nWith margins though, no group could possibly have exactly 2 pages. \r\n\r\nEarly on, there were also marks for more subjective things like presentations, for which grades were not released until months later.\r\nThe thing is, no rubric was used in grading these -- just \"a general feel[ing]\" (direct quote). (???) This is MONTHS after the actual presentation! \r\nI barely remember what my teammates talked about, much less little details of other groups; there is no way the course staff remembers details sufficient to assign meaningful grades months later.\r\n\r\nWhen confronted about this, though, they doubled down and refused to provide grading criteria for the final presentation/paper.\r\nNow, rumor has it that Dr. Cukier was attempting (successfully?) to make the course appear \"rigorous\" by assigning low grades.\r\nI personally have no evidence of this one way or another, but consider this case:\r\n\r\nThe course staff told students that our proposals (worth about 20% of the overall grade) would be rejected and we would be asked to repeatedly revise them if they were not sufficiently well written.\r\nHowever, one entire group's proposal was accepted and subsequently scored 11.3/20 (probably 11.25 actually due to ELMS rounding) -- an F (mean was 15.3/20). \r\n\"F denotes failure to understand the subject and unsatisfactory performance.\" An unsatisfactory proposal should have been rejected, no? \r\n\r\nWhile other students undoubtedly have a long list of grievances about this course, I'll just touch on this one.\r\nHe actively encouraged p-hacking (see https://xkcd.com/882/) to groups who initially failed to reject their null hypotheses.\r\nThis included suggesting \"regrouping the data\" and even as far as \"just looking at one week [of 1-2 months worth]\" (paraphrased).\r\nThis is questionable at best, and most researchers view it as cheating in the experiment -- perhaps just shy of scientific fraud.", "rating": 1, "expected_grade": "B", "created": "2018-12-13T22:53:30Z"}, {"professor": "Zhi Xiang Lin", "course": "HACS200", "review": "Despite having been involved in the design of this class and the academic direction of the ACES program for many years, Toby is still not able to facilitate anything close to a smooth or purposeful learning experience. Students are sorted into teams of four in order to complete a honeypot research project throughout the semester; at no point is anyone taught any research methods or ways to approach experiment design. We were expected to just totally understand how to ask meaningful (good) questions to produce interesting results without any actual background in previous bodies of work. Additionally, nobody taking this class feasibly has the technical background or time needed to set up data collection mechanisms to actually track the behavior of attackers over time, but the instructors expect students to draw results and write papers from a mountain of useless spam reconnaissance attempts.\r\n\r\nI personally found Toby to be condescending and snide whenever my team asked for help. Every team is essentially forced to use buggy, undocumented software maintained by Toby himself in order to meter and track access to their honeypots by attackers. This software was updated without notice throughout the semester, and some options that are necessary for proper operation are not documented anywhere. I even went back and checked the HACS101 slides - the only way we were able to get our setup to work was by asking Toby himself, for which we were chastised for not doing it right in the first place. By the end of the class, I felt that I had learned nothing about cybersecurity research. The sum total learning from my \"Advanced Cybersecurity Experience for Students\" honors classes is a collection of disjointed Linux command line knowledge, much of which I already knew when entering ACES.\r\n\r\nThis class is a total waste of time and needlessly stressful for its two credits.", "rating": 2, "expected_grade": "A", "created": "2022-12-25T03:48:47.450244Z"}, {"professor": "Michel Cukier", "course": "HACS200", "review": "Cukier has way too high expectations. He expects all students to come in with an understanding of statistics as if that's a prerequisite for this course (which it's not at all). He complained about the way we did our statistics despite not actually teaching us anything. Thankfully it didn't end up impacting our grade, but it made the course unbearable entirely. We had to repeatedly explain our entire research project every time we spoke with him and it required multiple people explaining it each time before he understood. Literally a waste of time.", "rating": 1, "expected_grade": "A", "created": "2023-01-03T17:31:44.074255Z"}, {"professor": "Zhi Xiang Lin", "course": "HACS200", "review": "Toby clearly cares about his students, but he doesn't actually do anything to try to make their lives easier. He didn't show up to half of our classes (which apparently was in his contract but not at all helpful for us). We have to use his software for our project, but it was extremely buggy which led to some students rewriting it. We tried to not use his software at all but quickly realized without it we wouldn't have enough data to do our research and my group didn't have the time or technical experience to rewrite it. It's poorly documented which means we barely knew how to set it up or use it, even though it had a lot of features that could've been helpful (if it was written properly). He tries to help, but has a hard time doing it meaningfully.", "rating": 3, "expected_grade": "A", "created": "2023-01-03T17:37:00.929513Z"}, {"professor": "Toby Lin", "course": "HACS200", "review": "Honestly, I took Toby in Fall of 2021 and came across these reviews and felt I could expand. When completing the honeypot project, he was pretty hard on our group. However, I am thankful to him because I think he made me better at presenting and creating slides after he roasted our slides and presenting method after the first presentation. Though I felt it was pretty harsh at the time and I was quite angry, I realize now that I learned a lot because of that experience. With that being said, Toby does come off as patronizing and rude but he does have good intentions(I think). If he can just reflect on this issue and slow down when explaining concepts, I think he can be a solid professor in the future", "rating": 3, "expected_grade": "A", "created": "2023-05-26T14:54:36.352024Z"}, {"professor": "Julian Burgos", "course": "HACS200", "review": "Overall, he is a very helpful TA. He is very knowledgeable on the technical side of the honeypot project so I would recommend going to him for help with technical issues you may face while working on the project. Grades honestly and fairly. He is always willing to help and makes understanding unclear or complex concepts easy.", "rating": 5, "expected_grade": "A", "created": "2023-12-30T20:50:47.297704Z"}, {"professor": "Zhi Xiang Lin", "course": "HACS200", "review": "He was extremely helpful as the advisor for HACS200 and provided a lot of guidance on resources to review, ideas to consider and things to look out for. We ran into an issue with implementing randomization for our honeypot and we had this overly complicated system that we had designed, we ran it by Toby and his suggestion made it 100x easier to implement and saved us probably a whole week's worth of time. The class was extremely unconventional given it's a full semester project class and to be honest was a bit stressful with Cukier's data requests, but we always managed to deliver with Toby's help! HACS101 was also a blessing that I only realized in 200 because we'd ask Toby for how do we do something and he'd basically just pull up 101 slides and go over those with us again which helped us connect it back to what we had done last semester. Our group ended up referring back to the 101 slides for literally 90% of the commands and scripts we wrote.\r\nI also had a really enjoyable time chatting with him on career advice, it's really refreshing to hear from someone who's been in the ACES program and how the ACES curriculum helps with full time jobs in the future.", "rating": 5, "expected_grade": "A", "created": "2024-01-02T22:53:13.369873Z"}, {"professor": "Michel Cukier", "course": "HACS200", "review": "cukier is a poor communicator and unnecessarily aggressive all the time. he had very unclear expectations which he did not even seem to understand himself at times.", "rating": 1, "expected_grade": "", "created": "2024-01-30T04:11:01.097240Z"}], "department": "HACS", "course_number": "200", "name": "HACS200", "title": "Applied Cybersecurity Foundations II", "credits": 2, "description": "<b>Prerequisite:</b> Minimum grade of C- in HACS101.\n<b>Restriction:</b> Must be a student in the ACES (Advanced Cybersecurity Experience for Students) Living-Learning Program.\nStudents will apply the skills learned in HACS 100 and 101 to practice cybersecurity research through team led projects employing honeypots, carrying that project through all stages - proposal, implementation, and analysis. Weekly lectures will supplement project work by addressing trends observed in honeypot attacks and protections needed, along with data collection and analysis tools, and other foundational cybersecurity concepts.\n<i>Must be a student in the ACES (Advanced Cybersecurity Experience for Students) Living-Learning Program.</i>", "is_recent": true, "geneds": null}