{"average_gpa": 3.6914463452566095, "professors": ["Aaron Allen", "Sara Schotland", "Jason Kuo", "Aneta Georgievska-Shine", "Michelle Butler", "Dana Carluccio", "Sarah Sillin", "Abram Fox", "Colleen Ho", "Kathleen Spanos", "Luka Arsenjuk", "Karin Rosemblatt", "Sahar Khamis", "Lara Payne", "Aleia Brown", "Gero Bauer", "Mark Forrester", "Aleia Brown", "Aneta Georgievska-Shine", "Annika Thiem", "Dorith Grant-Wisdom", "Ingrid Satelmajer", "Kathleen Spanos", "Marilyn Matar", "Aneta Georgievska-Shine", "Heidi Scott", "Kathleen Spanos", "Anthony Obute", "Van Tran Nguyen", "Aneta Georgievska-Shine", "Kathleen Spanos", "Mark Forrester"], "reviews": [{"professor": "Colleen Ho", "course": "HHUM205", "review": "Prof. Ho is a fantastic lecturer and extremely knowledgeable. Though she tends to assign a lot of reading, the material is always so well curated. She really makes class very interesting. She is also a really nice person; if you ask her a question, she always gives you a thorough, thoughtful answer, and she often goes out of her way to look into a question further and answer it in the next class.", "rating": 5, "expected_grade": "", "created": "2018-10-17T19:51:16Z"}, {"professor": "Lara Payne", "course": "HHUM205", "review": "Loved how she incorporated current events and personal stuff into class meetings. She kept things lively and always found a way to connect our readings to something relevant. We didn't have many assignments, however, so it was a little difficult not knowing what my grade was until much later in the semester.", "rating": 5, "expected_grade": "A+", "created": "2021-01-12T07:54:09Z"}, {"professor": "Lara Payne", "course": "HHUM205", "review": "Lara is great, she's super nice and loves to talk. She ran this class just like a book club, and helped create a really relaxed vibe where we just talk. Some days we would spend 5 minutes or so just doing creative writing. The reading load was quite heavy; we read 5 books completely, and partially read several others. Outside of reading though, there are very few assignments. Most weeks, there was a discussion board we had to post to. We also had to do a book report on any middle grade or YA book, with someone presenting at the start of each class. The final project was very open with a lot of options for the format, and it could relate to any aspect of the class. \r\nYou could really tell Lara loves teaching this class, and it was definitely an enjoyable break from the stress of every other class, so I strongly recommend it.", "rating": 5, "expected_grade": "A+", "created": "2021-12-18T17:55:56Z"}, {"professor": "Ingrid Satelmajer", "course": "HHUM205", "review": "Satelmajer loves to talk and expects you to complete all the readings. She doesn't believe in giving students 100% on writing assignments, so if you're a perfectionist watch out. Attendance is required. Decent professor, kind human.", "rating": 4, "expected_grade": "A", "created": "2022-11-15T17:03:31.830491Z"}, {"professor": "Kathleen Spanos", "course": "HHUM205", "review": "Professor Spanos is lovely! I took a dance class with her for Honors Humanities. She is very passionate and knowledgeable, and in HHUM205 she brings in lots of guest dancers to keep the class interesting. She’s very understanding about extensions and personal situations as well.  If you aren’t very invested in the subject of dance (like me) the content can drag a little sometimes, but if you find it interesting I would absolutely recommend this class!", "rating": 5, "expected_grade": "A", "created": "2022-12-03T20:35:25.220309Z"}, {"professor": "Ingrid Satelmajer", "course": "HHUM205", "review": "I loved Professor Satelmajer. At first, I was iffy and I just wasn't sure about the vibes I got from her, but she's really nice and you can tell she has a lot of experiences and knowledge that inform her teaching. She's passionate about what she teaches. She also takes care to notice and remember personal interests that are brought up in class. She does talk a lot sometimes though and she expects you to participate in discussions, complete readings before class, and do brief but thoughtful journal entries.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T18:39:28.979888Z"}, {"professor": "Ingrid Satelmajer", "course": "HHUM205", "review": "Dr. Satelmajer talks a lot, so the full 75 minute lectures can get a little boring. Really passionate about what she teaches, and is always willing to talk to her students. Participation is factored into your grade so you definitely have to keep up with the assigned readings.", "rating": 4, "expected_grade": "A", "created": "2022-12-19T22:01:06.655815Z"}, {"professor": "Marilyn Matar", "course": "HHUM205", "review": "Dr. Matar is the sweetest person ever and really cares about her students. There is some reading that comes with this class but most of it is actually really interesting. She really knows her stuff and shares so much of her knowledge with her students which is something I really appreciated.", "rating": 5, "expected_grade": "A", "created": "2022-12-26T03:50:55.102540Z"}, {"professor": "Ingrid Satelmajer", "course": "HHUM205", "review": "Amazing class and professor! She made participation a part of the class grade and worked to create a discussion environment where everyone in the class shared stories and opinions. A large part of the class is discussion based, which I enjoyed. The other part centers around her providing background information on topics, which is interesting but lengthy. In terms of the work, there were sources to interact with for every class, reflection pop quizzes, short responses, a final project, and a field trip to D.C. (for extra credit). A lot of the class content centered around balancing the humanities and work, so if you are interested in exploring past of future artistic endeavors, then the class will let you do so.", "rating": 5, "expected_grade": "A+", "created": "2022-12-27T16:51:31.690474Z"}, {"professor": "Heidi Scott", "course": "HHUM205", "review": "The class was fine and she's a nice woman, but sometimes she just randomly graded things too hard and she can be very critical", "rating": 3, "expected_grade": "A", "created": "2023-12-20T01:26:41.871409Z"}, {"professor": "Aneta Georgievska-Shine", "course": "HHUM205", "review": "Dr. Shine is accommodating and kind. I genuinely believe she doesn't mean to be difficult or backhanded in any way. However, she has made some concerning comments, especially in relation to mental health issues and classist/racist government practices. In addition, her teaching style is a bit frustrating. While she is very knowledgeable about what she teaches and the course content is interesting, she takes very few grades and is a harsh grader. She gives super long study guides for exams and then puts material on the test that wasn't on there (so... what's the point?). Throughout the entire semester, we took four grades. We had to revise our papers many times over until they were exactly to her liking, down to the word choice (swapping one adjective for another synonym). The assignments didn't have rubrics, only guidelines. Once she even put our papers up on the board in front of the entire class and told us all the things we had down wrong. Ultimately I did learn a lot and the content was interesting, but I felt more frustrated more frequently than I feel I should have.", "rating": 2, "expected_grade": "A", "created": "2023-12-21T21:55:57.095948Z"}, {"professor": "Anthony Obute", "course": "HHUM205", "review": "Professor Obute's class was incredibly boring and lacked structure. There were never any slideshows or well-planned notes. He expected us to read about 100 pages a week and all we would do in class was talk about what we read. Many of the readings felt very repetitive and drawn out. By the end of the semester, we only had two grades and it was hard to know where we stood with our final grade. He was a somewhat harsh grader. When our final paper came, he added an optional extra credit assignment and when I did not intend to do it, he emailed me and suggested I do it. However, I had no idea what my grade was, and when I asked he gave a vague answer and still did not tell me. The whole semester I had an A, but after he decided to put in the final and extra credit I had a B+. He even made it a challenge to see our final grades, so by the time we saw it, it was too late to do anything about it or ask any questions.", "rating": 2, "expected_grade": "B+", "created": "2024-02-08T15:22:45.449542Z"}], "department": "HHUM", "course_number": "205", "name": "HHUM205", "title": "Second Year Seminar in Honors Humanities", "credits": 3, "description": "<b>Credit only granted for:</b> ARHU205 or HHUM205.\n<b>Formerly:</b> ARHU205.\nSeminar on basic issues and methodologies in the humanities and arts.", "is_recent": true, "geneds": null}