{"average_gpa": 3.8701612903225806, "professors": ["Valerie Orlando", "Gregory Staley", "Randy Ontiveros", "Randy Ontiveros", "Randy Ontiveros", "Randy Ontiveros"], "reviews": [{"professor": "Gregory Staley", "course": "HHUM105", "review": "Prof. Staley is like Santa Claus, Papa Smurf, and Aristotle all rolled into one lovely old philosopher. As someone in the Honors Humanities program, I suppose I have had more personal interaction with him than the average student who's just taking one of his classics courses, but he's a wonderful person who is really invested in his students and in his subject. Would highly recommend taking any class with him.", "rating": 5, "expected_grade": "A+", "created": "2018-04-11T22:30:19Z"}, {"professor": "Gregory Staley", "course": "HHUM105", "review": "I had Prof. Staley in my first-semester Honors Humanities course. He’s a wonderful person/professor who can speak about the humanities well, and who has a lot of stories to tell (of course, not on class-time). In discussion, he welcomes any and all ideas, but also challenges us to develop them on a deeper level. \r\nThe only thing I’d warn people is that, since the “humanities” is really broad, taking this course requires a lot of personal interpretation and it may seem that you’re going in circles and circles. But it’s definitely manageable.\r\nI believe he’s retiring next year, so I’m grateful to have had him in at least one of my classes!", "rating": 5, "expected_grade": "A+", "created": "2019-12-18T02:48:11Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "Dr. Ontiveros is absolutely wonderful, and one of the nicest, most approachable, and most understanding professors you can get. This was his first semester as a part of Hohum, and I think he did a great job. Hhum105 can be a lot of work, but none of it is particularly difficult. Dr. Ontiveros actually restructured the course partway through the semester to make it easier on us, and occasionally would cancel/postpone readings or assignments to lessen our work load. The only downside to this class was the reading. The main textbook  is very dense and drags on a lot. There are also many supplemental readings throughout the semester, but as long as you just push through them you're good. Other than that, hhum105 was a lot of fun, and people were always willing to participate and discuss in class. There are a couple of smaller projects and then one big capstone at the end of the semester, which counts as the final, and they are only as hard as you make them. The grading was super easy, so as long as you turn things in on time, you'll probably get an A.", "rating": 5, "expected_grade": "A+", "created": "2020-12-16T21:18:56Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "The class was pretty easy. The material was pretty interesting, but there was very little order to it. He often just kinda had assignments that were pretty random and didn't have to do much with the course itself. It seemed a lot like just having an assignment so that we don't ever not have an assignment.", "rating": 4, "expected_grade": "A+", "created": "2020-12-18T17:27:28Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "Awesome professor! He obviously cares about his students and about the course material. He offered to take students out to lunch and just talk about life, which is a really cool way to make a connection especially during online learning. \r\nThe class itself is not too difficult, and as long as you do the work and keep up with the readings (so that you can speak up in class) you should be fine. Love Dr. Onitveros, and if you have a chance to take one of his classes before you graduate do it!", "rating": 5, "expected_grade": "A", "created": "2020-12-20T04:20:11Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "AMAZING PROFESSOR! SO FREAKING COOL! he is always so hip and vibey with his class. There are literally no words I could say to describe how chill this man is. Do yourself a favor, and TAKE HIS CLASSES. Although I only had him for my honors program class, I can just tell he is such a fantastic human being and would be a good professor in any course that he teachers. Randy, if you read this I just wanted to let you know that you have really nice hands. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-17T05:52:28Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "(took class Fall 2021)\r\nDr. O is really an amazing professor. I took this as a part of my Honors Humanities program (so I didn't really have a choice), but I really encourage that anyone take his classes. He is one of the kindest professors I've had at UMD. Despite having over 100 people in the class, he took the time to speak to every student one-on-one just to get to know them. It is also a very easy class, I think I ended up with something like a 99.5%, but the material is very interesting, and he took time to draw relations with the humanities and other disciplines. He is a fun guy, jokes with his students, but also respects our needs (he made the final open book).", "rating": 5, "expected_grade": "A+", "created": "2022-04-27T18:09:30Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "Prof. Ontiveros is an enthusiastic lecturer and I could tell that a lot of care went into this class. The readings were interesting and wasn't too much work. However, I often found myself frustrated by the class' disorganization. Discussion boards were not graded according to any kind of rubric/varied across TAs in the beginning which was frustrating. Throughout the semester, I also had no idea what grade to expect on each project I turned in which was not something I've experienced with previous professors. The content was also not reinforced within assignments and much of it felt randomly assigned. \r\n\r\nIn saying this, also I appreciate Prof. O's openness to talk with students about the course. I'd consider taking another, smaller class with him.", "rating": 3, "expected_grade": "", "created": "2022-12-19T19:38:12.234529Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "I took this class fall 2022. He's a cool guy. the only criticism i have is that grading, especially with discussion boards, was a little bit inconsistent. but as long as you put effort in and really do your best with your responses, i don't think it's anything too wildly concerning. otherwise, he's a cool guy and he does make an effort to ease you into academic college life. just keep up in this class (the material is a little random; i don't necessarily agree with how it's formatted but it's possible to learn all the necessary content for the exam) and make sure you study, and im sure you'll do fine.", "rating": 5, "expected_grade": "A", "created": "2023-01-26T00:54:03.185523Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "Class was abit fast in pacing and alittle scattered organizationally but otherwise was pretty fun.", "rating": 5, "expected_grade": "A", "created": "2023-05-03T21:48:29.699201Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "There's a lot of reading and their were reading quizzes every lecture. Honestly this class is pretty miserable, but it's doable and Dr. O is very chill and a nice guy.", "rating": 4, "expected_grade": "A", "created": "2023-09-18T15:38:12.221516Z"}, {"professor": "Nisa Asgarali-Hoffman", "course": "HHUM105", "review": "Takes a little bit longer than other TAs with grading but very nice and tries to expose students to a variety of new concepts. Expect discussion to consistently run over by a few minutes.", "rating": 4, "expected_grade": "A", "created": "2023-11-29T01:02:07.549011Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "if you put in the effort, there is no way ur getting less than an A in this class. it's one of the most bare minimum classes i've ever taken. they are super understanding and lenient. the actual course content is fairly interesting (you should be expecting this content because you signed up for honors humanities... so don't expect to learn much outside of arts and humanities). the only complaint i have is the five minute quizzes but you get used to them after a while. there is regular reading but every year, they honestly lessen the courseload so don't even worry about it.", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T01:10:27.399304Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "Didn't love the class, but Dr. O was a good professor. Readings ran the gamut from downright silly to incredibly interesting to painfully boring. Dr. O was clearly passionate about what he was teaching, but I'm just not sure his and my interests were the same.......... guess you need to love the humanities for some of these things. Overall, friendly and approachable, readings almost every week and quizzes on all the readings, definitely needed a couple hours a week for homework but the exams are easy. I mean, it's humanities, you can always bs anything.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T03:11:35.381065Z"}], "department": "HHUM", "course_number": "105", "name": "HHUM105", "title": "Honors Humanities: Introduction to the Arts and Humanities", "credits": 3, "description": "<b>Restriction:</b> Must be an entering freshmen in the Honors Humanities Program.\n<b>Credit only granted for:</b> ARHU105 or HHUM105.\n<b>Formerly:</b> ARHU105.\nIntroduction to the university, the different fields of the arts and humanities, and the history of how the university and the humanities have evolved across the world from ancient times to the present. Primary emphasis on reading and discussion of literary artifacts to assess the meaning and social status of the arts and humanities in the past and their personal and social value for the future.", "is_recent": true, "geneds": null}