{"average_gpa": 3.228012519561815, "professors": ["Michael Ross", "Michael Ross", "Michael Ross", "Michael Ross", "Michael Ross", "Michael Ross"], "reviews": [{"professor": "Michael Ross", "course": "HIST134", "review": "Dr. Ross is the BEST professor I have ever had at UMD. I originally took this class because I needed an I-Series gen-ed, but I was scared of taking a history class, since I've never really done well in history before, let alone enjoyed it. Dr. Ross made the subject matter so engaging and interesting! This was the one class I never even considered skipping for a second. I wish all my teachers made my courses as interesting as Dr. Ross did. Do yourself a favor and take whatever class he's teaching!", "rating": 5, "expected_grade": "A", "created": "2016-12-07T13:30:00Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Dr. Ross is a fantastic lecturer, undoubtably one of the best at UMD. However, you have to be willing to work hard for his class. He gives over 100 IDs to study for each exam and his \"short\" papers are actually 8 pages long. Would audit if possible", "rating": 3, "expected_grade": "A-", "created": "2018-12-20T04:07:24Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Dr. Ross is an engaging professor who is entertaining but if you're looking to take HIS134 as an easy GenEd, run. DO NOT DO IT. You have to read 3-4 books and write 3-4 papers and the final paper requires you to include hundreds of terms synthesizing all the cases and themes. The final paper is worth 40% of your final grade. Yeah. FORTY PERCENT. My entire class was in over their head with the workload. There is also a required discussion section each week about outside material and you must participate for points to boost your grade. ", "rating": 3, "expected_grade": "P", "created": "2021-05-10T19:50:22Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "I took this thinking it was interesting and would be an easy GenEd. Neither were true since Ross is unfair with his assignments and is overall just boring. DO NOT TAKE THIS CLASS.", "rating": 1, "expected_grade": "P", "created": "2021-05-11T15:50:17Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Definitely not an easy gen-ed, it's an I-series for a reason. However, the class itself is super interesting and Dr. Ross is a great lecturer, you will not be bored and class is almost like getting told stories for an hour. You will have to write several long papers and the TAs grade fairly harshly. For some reason the final paper is worth 40% of your grade and you have to include over 100 terms from the class in it, making it a fairly difficult assignment. ", "rating": 3, "expected_grade": "", "created": "2021-05-19T03:14:00Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Loved the way every lecture felt like a story more than a lecture itself. The essays we wrote, although still essays, were fun and exciting. I loved this class and anyone, either into history or not, will love it too. ", "rating": 5, "expected_grade": "A+", "created": "2021-06-16T22:03:13Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "the class itself was particularly interesting and i really enjoyed the content. the issue was the speed he went through the lectures and the minimal amount of grades that do not give much opportunity to excel. nothing to do with the professor in that regard since he did not grade them but overall the class was okay. my only issue was the TA but otherwise i would say think twice about taking the class and be sure you’re good at retaining information. ", "rating": 3, "expected_grade": "", "created": "2022-01-17T15:56:11Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "History has always been my least favorite subject and I had been dreading filling my remaining history credit, however Dr. Ross taught this class in such an amazing way ended up I looking forward to every class. His classes were more like a story than a boring lecture and he was so thorough in setting up the  context that led to the historical events we were discussing that by the time we got to the actual event the actions of everyone involved made sense for the context of the time. And just the way and passion with which he discussed history was so refreshing and there were times where things he said changed my entire perspective. Our discussion topics each week invited a deep conversation surrounding issues discussed in class with enough room for forming opinions and our TA did a great job of balancing everyone who wanted to talk. I will say that his final paper was very tedious, but I put in a little extra work and ended up with a 100% on the paper. As long as you're willing to put in some effort you shouldn't have any problem in this class, and the workload was still far less than any of my in major classes so it was a nice break from my more STEM heavy classes. ", "rating": 5, "expected_grade": "A+", "created": "2022-04-14T01:53:03Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Fun class, he's great at making the lectures interesting and something I look forward to. The only thing is though theres like 5 grades for the entire year, two exams, two essays, and participation. This makes it very stressful and unclear if I will get an A or not.", "rating": 3, "expected_grade": "B+", "created": "2022-12-08T16:13:24.922317Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Very interesting lectures but definitely makes it very clear where he stand on certain issues, almost enough to make it annoying (we get it, you don't like communism). Grading was fair but there are only a few grades for the course, so if you mess up on one thing it would be easy to get screwed over.", "rating": 4, "expected_grade": "B", "created": "2022-12-09T16:39:40.232267Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "He's awesome! He makes jokes throughout the lectures and engages with students to make sure the class is not all boring notes. He's very chill and personable but also gets through the material pretty clearly. This class not a breeze, but definitely manageable and the discussion section I had with my TA was always one of my favorite classes to go to. Take this class!", "rating": 5, "expected_grade": "", "created": "2022-12-09T17:49:39.364370Z"}, {"professor": "Christopher Wise", "course": "HIST134", "review": "Looks for reasons to take points off and doesn't seem like he wants you to do great in the class. Holds obvious favorites in the class. Way too harsh of a grader for a level 100 general education course. Highly do not recommend.", "rating": 1, "expected_grade": "B", "created": "2022-12-15T18:00:36.896857Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Professor Ross was the best lecturer I had for the fall semester. Very funny and very informative. The only issue with the class is that there are really only 4 assignments for the whole semester plus the participation grade for attendance. Grading is completely fair imo, the assignments I did not do so well on were the two essays in which I did not read the books.", "rating": 4, "expected_grade": "A", "created": "2022-12-27T22:39:01.461302Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "HIST134 was my favorite course this semester! Professor Ross is a pro at making lectures fun and immersive whilst keeping them informative. This class covers a lot of different historical time periods and Prof. Ross does a great job of equipping you with all the context you need to know for all of them in the lectures. With all of that said, this is a time-consuming course, not an easy gen-ed. You will have to do a lot of reading, and there are only a few assignments in the class so doing poorly on one can dock your grade by a lot. TA's also take a while to grade so you may not know where you stand in the course until very late in the semester. It's not easy, but its worth the effort you put into it.", "rating": 4, "expected_grade": "A", "created": "2023-01-25T23:53:29.305709Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "He's an incredibly nice teacher and honestly, my favorite from last semester. He makes class so interesting to follow and he's just really good at talking. The class itself was a little difficult, as it is a lot of history and he throws so many unnecessary facts at you. You will know more than just the story, which can be overwhelming for exams or papers. But I think it's better to be overprepared than underprepared. And the stories he picks are truly so fun and interesting. I ;pve his teaching style and if you want a GenEd or a History course, make this your one", "rating": 4, "expected_grade": "B+", "created": "2023-04-11T15:15:53.418743Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "I loved Dr.Ross for HIST134. I am not a history major but was always totally engaged in lecture and was able to keep up with what was going on. There are little to no grades for the class just a few book reports and a few exams which are pretty easy to take if you pay attention and come to lecture. TAKE THIS CLASS!!!!", "rating": 5, "expected_grade": "A", "created": "2023-09-18T01:28:57.918861Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "He was a pretty entertaining lecturer and great at telling the stories about the course content. The grading system was absolutely WILD  in this class. The TAs were harsh graders on the exams and in discussion participation for no reason this is a 100 level class. If you want an interesting class take it. If you want an A you might have to work hard on the exams, papers, and participation to get that grade.", "rating": 3, "expected_grade": "", "created": "2023-10-03T00:34:47.411807Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Dr. Ross is an exceptional professor. He is engaging, thorough, and super passionate. You can really tell he loves what he teaches. This class is very laid back! There are only a few assignments you have to turn in throughout the entire semester, the rest of your grade is based on exams and discussion points. I 10/10 recommend this course!! The subject matter is super interesting and its an easy A!", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T01:33:53.591342Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Love this class and love Dr Ross. There were two short (three page) papers, a midterm, a final, and graded discussion each week. His lectures are so interesting and he really seems to care about each students' understanding of the content. He doesn't record lectures or post any of his notes which is annoying, but as long as you're paying attention it is pretty easy to keep up during class.", "rating": 5, "expected_grade": "A-", "created": "2023-12-09T00:14:13.024405Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "This class was a good gened to take. You need to show up to every lecture because he doesn't post the slides and it's really important information. There is a lot of assigned reading but if you skim it it's fine, you just need to know most of it to be able to talk a couple times in discussion. Also, Dr. Ross is hilarious and is passionate about the trials. Overall, take this class it's great.", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T17:18:26.102254Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Professor Ross is one of my favorite professors at UMD so far! I definitely plan on taking another course with him in the future. His lectures are very engaging and he genuinely cares about students' learning and benefit from his course. I took this class as part of my history major but also feel that it's an excellent choice for anyone looking to get a Gen Ed credit or just take it as an elective.", "rating": 5, "expected_grade": "A", "created": "2023-12-14T22:45:02.540015Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "If you need any gen eds covered and this class fits into them, I would highly recommend taking it. The course work is very light and the topics are very interesting. Attendance isn't required for lecture but I still went to all of them because Dr. Ross teaches in a very engaging and interesting way which made class enjoyable. He doesn't record his lectures which can be annoying, but in the end I think is better because the mid term and final quiz you on things from lecture. \r\nDr. Ross is a really entertaining guy with a good sense of humor. You can tell he is a very passionate about what he teaches because he will give great detail about the trials. \r\nHighly recommend this class BUT make sure you study well for the midterm and final because there are only 4 grades for this class which include those and 2 essays.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T17:23:06.101542Z"}, {"professor": "Chloe Kauffman", "course": "HIST134", "review": "Chloe was a AMAZING TA for this class and I am really happy I ended up being in her section. She is a very kind and understanding person and it is apparent that she is highly educated about what we are learning, and in history in general. She is very well spoken and asked great follow up questions in discussion. She was definitely one of the reasons I did good in the class because she was open to edit our essays (with good feedback) before submitting them. \r\nOverall, I really enjoyed having her as a TA!", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T17:34:46.739161Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Definitely the most entertaining and engaging lecturer I've had so far at UMD. He teaches HIST134 really well. One thing that was weird about this class is that there are only 5 grades for the semester: Discussion grade, two essays, and two exams. One thing that ticked me off was that the lectures aren't recorded, and I did sleep through a lot of them. The exams were a bit difficult because of the quantity of IDs but it was doable. Discussion participation is pretty crucial in this class and there are a lot of readings, but if you just pay attention during lecture and skim through the documents, you should be fine. Shoutout to TA Ashley, she was a fair grader and gave opportunities for extra credit, which helped bump my grade up from an A- to an A.", "rating": 4, "expected_grade": "A", "created": "2023-12-20T03:44:09.647582Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Dr. Ross himself is an amazing professor. He makes his lectures super engaging and is genuinely passionate about the subject! However, he does teach at a very fast pace. So be prepared for that! \r\n\r\nPLEASE NOTE, the lectures are NOT recorded and the presentation slides are NOT posted. He does this so that students don't skip the class. I accidentally overslept once and missed a lot. I almost felt like I was done for. That's one thing I didn't like...but I understand why he does that. :(\r\n\r\nThere are two essays, a midterm, and a final. The first essay I didn't read the book and got a B. The second one I read it and got an A+. That is to say, you'll get the grade that corresponds to the effort you put in this class. Especially with the fact that there are only 4 graded assignments apart from the discussions, make to study well! Don't think this is an \"easy gen-ed\", but it's an interesting one for sure! \r\n\r\nI will add that the GTA you have really makes the difference. I LOVED the GTA for my section. SHE WAS AMAZING. I never considered myself a history person, but she and Dr. Ross made the course a fun break between my STEM classes. :)", "rating": 5, "expected_grade": "A+", "created": "2024-01-13T18:49:03.236905Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Professor Ross was so amazing! He was my favorite teacher this semester since his class always felt like story-time rather than a lecture. He liked to engage the students. The content is so interesting and I am not a history person! Very straightforward midterm and final. My TA (Chloe) was so helpful and was so prompt with responding back to emails. I would 100% take the class over again!", "rating": 5, "expected_grade": "A+", "created": "2024-01-20T01:28:06.872887Z"}], "department": "HIST", "course_number": "134", "name": "HIST134", "title": "Spies, Assassins, Martyrs, and Witches: Famous Trials in American History", "credits": 3, "description": "Examination of some of the most famous trials in American history and their enduring hold on the imagination.", "is_recent": true, "geneds": null}