{"average_gpa": 3.327570093457944, "professors": ["Sabrina Baron", "Sabrina Baron", "Sabrina Baron", "Sabrina Baron"], "reviews": [{"professor": "Sabrina Baron", "course": "HIST215", "review": "HIST215 was a very interesting course and Professor Baron is very knowledgable. There were 3 assignments the entire semester and a take-home final. You do have to attend lectures and take notes, because not much more than pictures is on her powerpoints so you have to write down what she is saying. Your notes will definitely help you on the final. If you attend her lectures then the reading assignments aren't necessary. My only problem with her throughout the semester was how long she took to grade and respond to emails (she graded one of my assignments that was due in late September in December).", "rating": 5, "expected_grade": "A", "created": "2023-01-13T04:50:34.417966Z"}, {"professor": "Sabrina Baron", "course": "HIST215", "review": "This was the easiest course I have ever taken, it is a literal joke. There a three assignments - a book review, a project, and the final. The project is work 40% of the grade on the only instructions on the rubric beyond guidelines for choosing a topic were to make a powerpoint and make it look nice. I also got a whole letter grade taken off my paper for grammatical mistakes and minor citations errors, so she is one of the most particular graders I have ever come across.", "rating": 2, "expected_grade": "A", "created": "2023-12-13T23:31:14.135488Z"}], "department": "HIST", "course_number": "215", "name": "HIST215", "title": "Women in Western Europe to 1750", "credits": 3, "description": "<b>Credit only granted for:</b> HIST215 or HIST219A.\n<b>Formerly:</b> HIST219A.\nAn exploration of the theories and rhetoric about the nature and existence of women in the West, focusing on the experience of women from the hegemony of Classical Greece to the French Revolution, an era that marks the beginning of a continuous process of change. Emphasis will be on the period between 1250 and 1750, when the Western European world was fundamentally altered in every aspect and in every level of society, culture, and government.", "is_recent": true, "geneds": null}