{"average_gpa": 2.4102803738317755, "professors": ["Marsha Rozenblit", "Lauren Strauss", "Marsha Rozenblit", "Marsha Rozenblit"], "reviews": [{"professor": "Marsha Rozenblit", "course": "HIST106", "review": "I know Dr. Rozenblit is a really sweet lady and cares a lot about her students, but do not take this class. It is way too hard for a gen ed / elective, so please do yourself a favor and take another history class. There are four assignments for the entire semester, and she can be a very tough grader, not necessarily with just the history aspects of your paper but also English conventions, too. Also, her exams are entirely essays - no multiple choice / true false / fill in the blank / etc. ", "rating": 3, "expected_grade": "A", "created": "2021-12-26T16:53:58Z"}, {"professor": "Marsha Rozenblit", "course": "HIST106", "review": "Personally, I loved this class. I feel like the information is very valuable and interesting. Each class is a lecture, so be prepared to sit for a long time. My friend and I always take bathroom breaks halfway through LOL. Rozenblit is a very good professor. I know she doesn't have great reviews, but I loved learning from her. Highly recommend talking to her after class and getting to know her a little so she has motivation to give you a good grade in class. The grade consists of a midterm (25%), 5-page paper (25%),Response paper (15%), final (30%), and class participation (5%). I will say that she is on the harsher side of a grader, but I really didn't mind. In short, if you don't mind putting in a little more work than anticipated for a 100-level class, I would highly recommend this course if the subject matter is interesting to you.", "rating": 4, "expected_grade": "B+", "created": "2023-12-01T16:25:58.040796Z"}], "department": "HIST", "course_number": "106", "name": "HIST106", "title": "American Jewish Experience", "credits": 3, "description": "Cross-listed with JWST141.\n<b>Credit only granted for:</b> HIST106 or JWST141.\nHistory of the Jews in America from colonial times to the present. Emphasis on the waves of migration from Germany and Eastern Europe; the changing nature of the American Jewish community and its participation in American social, economic, and political life.", "is_recent": true, "geneds": null}