{"average_gpa": 3.338383838383839, "professors": ["Bernard Cooperman", "Bernard Cooperman", "Bernard Cooperman", "Bernard Cooperman"], "reviews": [{"professor": "Bernard Cooperman", "course": "HIST135", "review": "Cooperman is a pretty dynamic teacher. Old Jewish man who doesn't give two shits. He's funny, though a little bad with technology. He tries to engage the class when people seem bored.\n\r\nThe class itself is interesting, though if you pay attention and review the material, it's easy. He does take home exams, which are a god send in my opinion. ", "rating": 4, "expected_grade": "A-", "created": "2016-03-27T19:31:00Z"}, {"professor": "Bernard Cooperman", "course": "HIST135", "review": "Professor Cooperman is a funny guy that brings a lot of energy even to very early lectures. The lectures are a bit confusing in terms of their importance, but you definitely need to do the readings and get the gist of what is being talked about. Discussion is vital as there are weekly quizzes and a more focused explanation about things. \n\r\nThis course is tremendously back loaded in terms of workload, so be prepared for that. The tests are not hard at all as you always are given exactly what you need to do well. \n\n", "rating": 4, "expected_grade": "A", "created": "2016-01-04T15:23:00Z"}, {"professor": "Bernard Cooperman", "course": "HIST135", "review": "I'm no history major, so I'm not sure about how he is compared to other history professors, but if, like I did this past semester, you need to finish an I-series requirement and can't find one you're interested in, Cooperman and his history course that's all about riots is an okay choice. \n\r\nThere are two lectures a week and one discussion section per week. During lectures he talks about certain riots and how they relate to the class as a whole, the readings, and how they might help your essays you'll write later on. He uses powerpoint, but he goes through them quickly so be careful not to get a hand cramp from writing too much too quickly. In retrospect, what he has to say was probably more important that what was on the slides. His TA accompanies him in class while he lectures. The TA, however, mostly sits there, listening, though he does occasionally chime in with questions and thoughts for the class, and helps Cooperman with names of events and people when he can't quite come up with them himself. \n\r\nTo encourage you to come to class, he awards participation points through slips of paper that you sign and return to the TA if you earn one in class. To earn one, you need to do one of two things. 1: Answer a question(intelligently, that is), whether you're lucky enough to get him to acknowledge your raised hand or unlucky enough to have him put you on the spot when you can't quite process what he said fast enough, or 2: Come to class with a riot ready to present for the class briefly but completely. Either be prepared to answer subsequent questions about it from the TA(he was a PhD history student, so he keeps up with these things; he knows just about ABSOLUTELY EVERYTHING; it's kind of scary to a non-history buff like me), or provide a complete enough speech about it that he doesn't feel the need to ask questions. If you struggle to quickly digest what Cooperman said in lecture, way number 2 is how you're going to have to get them. You need 5 paper slips to get full lecture participation credit, and I had to get all 5 from riot presentations. Just come in with a riot ready every single class, and if the TA wants riots, you'll be ready. If not, save it for next time. Have a backup riot just in case someone uses yours and happens to go before you (though you could be awesome like I was and do enough work on it to expand on what was said before and get a slip that way :D ). Do what you gotta do to get those paper slips. \n\r\nIn lecture, Cooperman may put you on the spot with a question, but in discussion, the TA will NEVER call on you without your wanting to. It sounds like a relief, but  you still need to answer questions and participate in intelligent discussion about the readings and debates you were assigned in order to get discussion participation points (they are different from lecture participation points). The first half of them comprised of debates about a riot; you participate in one and observe the others. The second half involved breaking off into groups and reading together, preparing to answer questions he asks afterward. One of the last discussions involves an 8-minute presentation among your five-person group over a riot. Cooperman made a surprise appearance, so be ready for that and make it good, though my section was apparently the only one he appeared in.\n\r\nThere are a few papers in this course. One is about the portrayal of riots in certain movies you have to watch (there's a list, so pick your favorites or the shortest ones). Another is about a riot that you did your group presentation with. The last one is an evaluation of an argument for an author on a book I can't remember off the top of my head. Blah blah blah, don't leave them to the last minute, remember your bibliography, don't exceed the maximum page count. You'd be surprised how much you have to cut out to meet the page constraints; the TA won't read past the 5th page in a 5-page paper, for instance.\n\r\nThere is a midterm and a final. The midterm consists of an essay on a book and some \"IDs.\" IDs are basically the \"who, what, where, when, and why\" on riots, people, another other things emphasized in the course. Essay was graded surprisingly easily in my opinion. The outline is the most important part, in case you run low on time. The final consists of IDs only, and there is a list of IDs given that might possibly be on the exam. They emphasize that the paper on the author is \"part of the final exam\", but it's really just the IDs. They give you lots of time and you should be prepared with them.\n\r\nAnd that's Cooperman's HIST 135. He's funny; he tries to engage the class whenever he gets the sense that people are getting bored. Lots of readings to go over, so keep up with those. The syllabus is online, but it CHANGES OVER TIME, so keep an eye on it regularly. Again, if you need an I-series/diversity/history/social sciences course for your gen-ed requirements and couldn't find anything interesting, this is at least a decent choice. It knocks out a lots of requirements at once and you probably won't be bored. (Wow, that was long. Sorry about that... just trying to help future students, that's all.)", "rating": 4, "expected_grade": "", "created": "2014-07-14T02:30:00Z"}, {"professor": "Natalie Salive", "course": "HIST135", "review": "If it wasn’t for Natalie Cooperman’s rants would have never made any sense. She’s very chill with grading too, which makes her even better. Overall really great and approachable!", "rating": 5, "expected_grade": "A", "created": "2019-12-18T00:15:44Z"}, {"professor": "Bernard Cooperman", "course": "HIST135", "review": "jewish man thats funny but also has no filter. class was fun but he said racial slurs and heiled hitler. great class though.", "rating": 3, "expected_grade": "A", "created": "2021-12-07T03:58:56Z"}, {"professor": "Bernard Cooperman", "course": "HIST135", "review": "This class is pretty interesting and the professor is really interesting but can scare some off, he will cold call on you sometimes but really just wants you to make an argument with him. You have to participate and get slips every time you do and discussions are mandatory. There are two papers, a midterm, and a final, and weekly article discussion boards. There were supposed to be more assignments but he ended up not doing them, there are also extra credit opportunities throughout. The papers and exams are weighted heavily so you want to do your best on those. The class is again interesting but he does get carried away and it is hard to take notes sometimes that will help in exams.", "rating": 4, "expected_grade": "A-", "created": "2023-05-11T18:54:56.211108Z"}, {"professor": "Bernard Cooperman", "course": "HIST135", "review": "He is very passionate and engaging. He is knowledgeable and helpful. He puts students on the spot, but it helps them learn. Great guy and teacher. The only issue is that he grades very very very slowly.", "rating": 4, "expected_grade": "B+", "created": "2023-11-30T15:28:20.986311Z"}, {"professor": "Bernard Cooperman", "course": "HIST135", "review": "Dr.Cooperman is amazing, this was a super fun class, and he is super funny and engaging. Because of my heavy course load, going to his class felt like a nice uplifting break at the end of the day. \r\n\r\nThe class itself: Personally I would say this class is not skippable. there is participation credit and he gives very specific examples of things that will be on the exam. He does post slides before the midterm and final, but he uses his slides more for pictures and guides in class, so I wouldn't say they are helpful. When I was in class, I just had a word doc open and jotted down everything he said for the 50 minutes. You do not need to always read the textbook (except for conversation in section), but you need to utilize it when studying for the Midterm and Final. The textbook is super straightforward and easy to read.\r\n\r\nThere are two papers, with one book per paper. I didn't read both fully; I just skimmed. Because the TA grades everything, would be your best bet to meet with them instead of Cooperman for these essays.\r\n\r\nExam: study guide is exactly what is on the exam, no tricks. only difference is that you will not be given ALL of the questions on the study guide. (ID section and Essay) \r\n\r\nOverall I got an A- because I had a 88-90 average on every assignment. Grading is a bit tough, but if you put effort in you will be fine. My two essay grades were 88 and 90-something because I did them the night before, If you start early and get feedback you will do well.", "rating": 4, "expected_grade": "A-", "created": "2024-01-09T03:36:57.120614Z"}], "department": "HIST", "course_number": "135", "name": "HIST135", "title": "Civil Discourse or Urban Riot: Why Cities Don't (Often) Explode", "credits": 3, "description": "<b>Cross-listed with:</b> JWST289E.\n<b>Credit only granted for:</b> HIST135 or JWST289E.\nAn examination of the mechanisms that promote peaceful co-existence in urban societies and a discussion of how and why city streets sometimes become violent.\n<i>Jointly offered with JWST289E. Credit granted for HIST135 or JWST289E.</i>", "is_recent": true, "geneds": null}