{"average_gpa": 3.1715150181538125, "professors": ["Katarina Keane", "David Sicilia", "Robert Chiles", "Thomas Castillo", "Michael Ross", "Howard Smead", "Jeffrey Coster", "Edwin Smead", "Mark Goldstein", "Emily Landau", "Donald McNeilly", "David Freund", "Howard Smead", "Robert Chiles", "Howard Smead", "Robert Chiles", "David Freund", "Howard Smead", "Robert Chiles", "Robert Chiles", "Robert Chiles", "Robert Chiles", "Howard Smead", "Robert Chiles", "David Freund", "Howard Smead", "Robert Chiles", "Howard Smead", "Robert Chiles"], "reviews": [{"professor": "Katarina Keane", "course": "HIST201", "review": "She is a great teacher! Take this class!", "rating": 5, "expected_grade": "A", "created": "2014-01-26T00:02:00Z"}, {"professor": "Katarina Keane", "course": "HIST201", "review": "Dr. Keane is a great professor and lecturer. She is always available for help if you need it and her lectures are just interesting. 2 papers, a midterm and a final, as well as attending discussion, are what the grade is based on. I would 100% take another class with Dr. Keane if it would count towards my major. ", "rating": 5, "expected_grade": "A", "created": "2012-12-18T11:36:00Z"}, {"professor": "Michael Ross", "course": "HIST201", "review": "Professor Ross is an extremely knowledgeable professor! He has a lot to say about History, but he also says it in a very interesting manner. The way he approaches is lectures kept me interested the whole time and I would suggest everyone take at least one of his classes!", "rating": 5, "expected_grade": "", "created": "2015-05-07T18:21:00Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Smead is an absolute delight! You may think the subject of history is boring but honestly his lectures are pretty interesting. He also has a great sense of humor and throws in jokes here and there and that can make the lectures fun. \n\r\nThe coursework is not a heavy load - 2 midterms, 1 final, and your discussion grade.\n\r\nI honestly would have aced this class but it was my discussion part that killed me. I had Greg as a TA and he talked so much and we barely had time to participate.. so yeah participate for sure every week in discussion.\n\r\nOtherwise, this class is great! A great, light class if you are looking for something to fulfill a GenED credit. ", "rating": 5, "expected_grade": "B", "created": "2016-05-12T12:19:00Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Strongly recommend taking a class with Smead. Funny and entertaining lecturer where I wish HIST201 was longer than 50 minutes, makes a potentially dull class/lecture very exciting and interesting. Terrorism seminar is also highly recommended - not a lot of work needed to be done while still being interesting and informative for people with little subject knowledge. ", "rating": 5, "expected_grade": "A", "created": "2014-12-14T17:46:00Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Amazing!! Professor Smead lectures as if he's telling a story. He doesn't put much information on his powerpoints, but you get used to that quickly. He always seems so interested in what he is teaching. I actually looked forward to his lectures. The class was only 3 exams and reading several books. The books were relatively short and interesting, but you need to stay on top of the syllabus because they won't warn you that you have to read an entire book by next class. Strongly recommend for history and non-history majors. ", "rating": 5, "expected_grade": "A", "created": "2013-05-21T21:39:00Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Smead is a great lecturer. He knows his stuff and goes through the PowerPoints quickly. Exams are very straight to the point and the TAs are all very good. Smead offers 5 percent added to your grade at the end if you send a weekly email for the semester about a topic you learned about. Lots of books to read though.", "rating": 4, "expected_grade": "A-", "created": "2013-05-01T19:45:00Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Dr. Smead is a great lecturer and he seems like a nice guy. He brings a great energy to every lecture. I would definitely recommend him.", "rating": 5, "expected_grade": "B", "created": "2017-11-19T18:52:18Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Greatest professor of all time. ", "rating": 5, "expected_grade": "A", "created": "2018-01-23T21:06:01Z"}, {"professor": "Jeffrey Coster", "course": "HIST201", "review": "I had HIST201 with him and the class was slight work. He was behind in his grading so I never knew my updated grade. But, he is really lenient with grading because he wanted us to learn the material more. He was a great lecturer and kept everyone interested. He also cares about his students. ", "rating": 5, "expected_grade": "A", "created": "2018-05-05T22:27:55Z"}, {"professor": "Jeffrey Coster", "course": "HIST201", "review": "Jeff is a great lecturer and one of the nicest teachers I've ever had. The class material is fairly easy, but lectures are fascinating and are so much more than just blind memorization of names and dates. Would definitely recommend that any FC student looking for a class takes this one; it's worth your time.", "rating": 5, "expected_grade": "A+", "created": "2018-07-12T21:46:17Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "One of my favorite professors at this school. He has so much charisma. Go to discussion and participate. Learn the term definitions for the tests, and you will receive a B even if your writing skills are terrible (like mine are).", "rating": 5, "expected_grade": "B", "created": "2018-09-06T16:49:22Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Great professor that keeps you engaged in the subject.", "rating": 5, "expected_grade": "A", "created": "2018-11-29T03:17:07Z"}, {"professor": "Jeffrey Coster", "course": "HIST201", "review": "This was the highlight of my semester. He's an amazing guy, with so much knowledge and depth when it comes to the class. He really wants everyone to succeed and with a little bit of work, it's totally achievable. Two exams (all essays, midterm and final), weekly online discussions, and two short document analysis papers. Couldn't be happier!!!!", "rating": 5, "expected_grade": "A+", "created": "2018-12-27T16:55:46Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Lectures are very entertaining, but for each exam, you have to write two essays which can be stressful if you are not the best writer", "rating": 5, "expected_grade": "A-", "created": "2019-12-18T04:43:41Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Best lecturer I've had at the university. The only reason I'm not giving him 5 stars is that he leaves too much up to his TAs. This means that lots of grading is inconsistent and things can take a long time to get back to you.", "rating": 4, "expected_grade": "A-", "created": "2020-05-15T19:11:19Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Great professor. Dr. Smead was one of the best and most entertaining professors I had at UMD. He somehow made history entertaining. A lot of grading is dependent on the TA, however. ", "rating": 5, "expected_grade": "A", "created": "2020-09-01T02:03:12Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "I had Mr. Chiles fully online this semester and all his lecture were through YouTube video which wasn't to bad because you could re-watch them as many times as you want. But since I had ADHD it was kind of hard to pay attention but the class was very flexible because you could watch the videos at anytime. Also the weekly writing discussion weren't to bad as long as you watch the videos and the class discussion with the TA were really helpful. Also if you participated you'll get all the points, if it's verbally or even through the chats. My TA was so nice too she's Ms. Kocher and I would contact her instead of Mr. Chiles If I wanted a faster response with my emails. She was also very understanding with my disability and my commendations when it came to the essays and the only reason I got a C was because I never completed one of the major essay's which was my fault. If I had done so I would've probably gotten a B or A but other then that this class was pretty nice and I really love history so other then that I would recommend it. ", "rating": 4, "expected_grade": "C", "created": "2021-01-08T02:45:11Z"}, {"professor": "Taylor Kocher", "course": "HIST201", "review": "I had Ms. Kocher as my TA for Dr. Chiles this last semester and she was amazing. She was the best honestly and as a freshman starting college fully online, she was really understanding and welcoming. Especially since I have a few learning disability it made things a little hard and stressful for me but thankfully she completely understood. Ms. Kocher is also very friendly and I'm going to miss her. Also the only reason why I'm getting a C was my own fault, if I had turned in 1 assignment I probably would've gotten a B. Overall, if you have Ms. Kocher I truly believe you're in good hands but don't forget to communicate with your Professors in general. ", "rating": 5, "expected_grade": "C", "created": "2021-01-22T05:38:52Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Prior to taking HIST201 I read a ton of reviews on Chiles and HIST201 saying it would be one of the more interesting and easy geneds. I am here to warn you that this is definitely not the case. Chiles does put alot of effort into his video lectures but he should have added additional materials likes slides so that we could separate the important points from the trivial points instead of having to digest all the info from the entire video.\r\n\r\nI guess the grading depends on your TA but my TA was absolutely ruthless and nitpicky for even the smallest details on the exams and essays. I felt like she was doing this just to lower the average, even when my responses were detailed enough. You think your essay deserves a 100? Nah you're probably gonna get an 85, best case 90. There was busy-work every week in the form of discussion boards which did not help me learn or prepare for exams whatsoever.\r\n\r\nSo the bottom line is if you hate writing, avoid this course. 3 stars for Chiles, 1 star for the overall way this course was set up, and -10 stars for the TAs for their grading style. A course that was supposed to be interesting was unnecessarily transformed into a super boring and tedious course.", "rating": 1, "expected_grade": "A-", "created": "2021-02-09T21:58:24Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Chiles is GOAT plain and simple. \r\nClass has some writing and 2 books for reading but there used to be weekly reading which he got rid of. Exams were identifying major events and he gives you a study guide with ones that may appear. Overall very straightforward. However, TA has a lot to do with your grading.", "rating": 5, "expected_grade": "A+", "created": "2021-04-08T19:51:23Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Prof. Smead is ok! I took his class in Spring 2020, so I did not get to experience his in-person discussions. He really knows his stuff and is interesting to listen to if you have all day...but if you don't, I recommend listening to his lectures at 1.5-2x speed. He often goes off on tangents which can be frustrating when you're not interested in the subject but I imagine could be interesting if you are. He's a goldmine of knowlege for sure. My main complaint would be that he leaves so much up to his TAs - they can make or break a class. My TA, Kyle Stelzer, was ok but didn't respond to emails very quickly. ", "rating": 4, "expected_grade": "", "created": "2021-05-03T13:37:59Z"}, {"professor": "Kyle Stelzer", "course": "HIST201", "review": "Mediocre at best. Kyle does his best but he is nto a very engaging nor communicative TA. He's made the class feel more like a chore than something I should be interested in.", "rating": 3, "expected_grade": "", "created": "2021-05-03T13:40:32Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Chiles is an absolute beast. The man is a living encyclopedia. He rolls up to lecture in a suit everyday and shoots endless information about any topic throughout history. If you want a professor that knows every single thing about the subject, take Chiles.", "rating": 5, "expected_grade": "", "created": "2021-11-15T00:38:15Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Literally the best professor I've ever had at this University. I was ENGAGED every day in his content, and you can clearly tell he is too. I've never written a review and I probably never will again, but he deserves to hear this and people deserve to know. ALSO!!! One of the best books I've ever read in school was in his class. Driving While Black. Absolutely highly reccommend to read. Simply put, thank you Dr. Chiles. Truly the definition of an increbile educator.", "rating": 5, "expected_grade": "A", "created": "2021-11-17T03:14:29Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Good class, really interesting. Two essays, two midterms and a final. We were behind though, and missed like 3 weeks worth of content. Other than that really solid class.", "rating": 5, "expected_grade": "A", "created": "2021-12-04T13:16:15Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Dr. Chiles is great. His lectures are engaging and you will not get bored. The midterm and final were very straight forward and easy to prepare for. He did sometimes go over the class time but overall amazing professor. ", "rating": 5, "expected_grade": "", "created": "2021-12-19T19:43:25Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Professor Smead is really really nice and he makes his class interesting. He gets sidetracked pretty easily, especially if someone asks a question. We were supposed to cover post-civil war America all the way to Trump but we hardly made it to Vietnam, so we missed a lot. I don't mind this because it made us have to study less for the final. Discussion awards points based on participation. There are 2 essays and 2 midterms but everything is graded by the TA, so it's usually lenient. I recommend this class and professor Smead", "rating": 5, "expected_grade": "A-", "created": "2021-12-22T02:09:23Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Dr. Smead is a great lecturer. His slides are very informative and great materials to prepare for the exams.", "rating": 5, "expected_grade": "A", "created": "2022-01-02T17:45:19Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Great professor", "rating": 5, "expected_grade": "A", "created": "2022-01-24T02:21:21Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Top 5 lecturer at UMD. Take this class, you won't regret it.", "rating": 5, "expected_grade": "A+", "created": "2022-03-23T00:49:21Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "He is a pretty good teacher most of the time, but there are some days we he just randomly Strats listing event after event with no explanation. Your TA kind of dictates your class. \r\nOnly 2 tests, a final and a discussion grade so you have to do well on the tests, but I found them incredibly hard. You get 2 hours to write 2 essays on undisclosed questions. If you're good at history and a good writer, definitely take this class because there is minimal work. However, if you are not one of those, AVOID", "rating": 4, "expected_grade": "B+", "created": "2022-05-13T01:05:12Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Dr. Chiles is an amazing college professor and I highly recommend him if you are planning on taking any history classes. The midterm was online for me and I was having technical issues and he was very lenient about it so I was still able to take the midterm.", "rating": 5, "expected_grade": "", "created": "2022-05-14T20:26:27Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Smead is a fun guy. As a lecturer, I thought he was interesting, funny, and informative. Some lectures can be a bit boring, while others will be more fun but that is just how a history class usually goes. Attendence is not mandatory, and all my lectures were recorded so if you missed class, you could just watch the recording on your own time. Overall, I definitely recommend Smead, you cannot go wrong with him as your professor.\r\n\r\nBut there is a reason that I put 4 stars:\r\n\r\nThe only issue with this class is that there are 2 exams, a final, and a discussion grade. So you need to do well on each exam and discussion to get an A- or better. Therefore, show up to every discussion and make sure to prepare well for all exams. The TA grades everything that you write (including your tests) so make sure that if you have any clarifying questions that you ask your TA first. Tests are usually 2 essay questions. Other than tests and the occasional discussion response paper, work is very minimal just make sure to look at the syllabus ocassionally to make sure that you are not missing any required readings.", "rating": 4, "expected_grade": "A", "created": "2022-05-20T04:47:43Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "overated professor ", "rating": 1, "expected_grade": "", "created": "2022-05-28T06:31:16Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "As most people said, Chiles is the best history professor. Take his class if you need a gen ed or even as an elective. Don't skip class though. He doesn't post slides online.", "rating": 5, "expected_grade": "B", "created": "2022-12-12T20:54:27.307061Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Goated professor. Made a history class interesting to a computer science major. This dude is so passionate about history its insane. Really great class, but I have to say, your grade really depends on the TA. My TA kyle was great and very understanding, but students with the other TA did not exactly share the same sentiment. Other than that, great class.", "rating": 5, "expected_grade": "A", "created": "2022-12-22T16:15:47.183295Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Dr Smead's lectures were interesting but he would never make it through all of the material he intended too. Lots of tangents and he would show up to lecture 5 minutes late every day. Class was supposed to make it to 9/11 but we only made it to Watergate. Class consisted of 2 exams and a final (all essay based) and weekly discussion sections with one mini essay. As long as you do everything you are guaranteed an A or a B.", "rating": 3, "expected_grade": "A-", "created": "2022-12-24T02:40:18.545471Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Will never answer your emails, but love the guy nonetheless. His lectures are extremely engaging, and if you have any interest in history whatsoever you'll definitely like 201. It might differ from TA to TA, but my only assignments were 2 midterms, a final, and a graded essay (which lumps into your discussion grade). This is nice in terms of workload, but it puts all the focus on the exams when it comes to determining your final grade. I found the exams to be difficult (2-3 essays within a tight time limit), but doable as Smead \"does not have a policy on notes during exams\".", "rating": 5, "expected_grade": "A", "created": "2023-01-03T20:50:53.757519Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "His lectures are interesting, but can be boring if you don't like history. There is quite a bit of reading for this class. Your grade will consist of 2 exams + a final, and a discussion grade. Attendance is mandatory for discussion, as there is a weekly quiz (open note). Participation is also a grade in discussion. His exams are fair. The reading is the only killer thing in this class.", "rating": 4, "expected_grade": "A", "created": "2023-05-03T19:03:02.175654Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Great lecturer, keeps things interesting and is funny. The coursework isn't bad at all, only a few essays and weekly readings for discussion. Can't go wrong with this gen ed class.", "rating": 5, "expected_grade": "A-", "created": "2023-05-04T20:19:27.440790Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Easy A. CHAT GPT is your friend. Dont forget to rewrite it in your own words", "rating": 5, "expected_grade": "A+", "created": "2023-05-12T18:47:15.499863Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Great Professor, his lectures tie into exams if you do miss a lecture though dont worry, you'll probably be able to catch up on it in discussion. 2 exams. Essay based. as long as you explain the questions throughly you should be able to get 100's on both", "rating": 5, "expected_grade": "A", "created": "2023-05-14T17:50:48.283014Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Attendance for lectures wasn't mandatory but I always went anyways because they were really interesting. Super cool guy, clearly very knowledgable about what he's teaching and doesn't take crap from people asking stupid questions. Your TA kind of dictates how much work the class will be, all Smead gives is 2 writing assignments and the exams. Lots of reading, but they were super interesting so I never had an issue with it.", "rating": 5, "expected_grade": "A", "created": "2023-05-22T00:12:49.117591Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Most passionate professor I've taken a Gen Ed with. Took this class for the Gen Eds. One of the easiest Gen Eds. His lectures were super engaging. It was like watching a movie and this is coming from a CS Major. My TA was very nice and posted her own lecture notes. I still took notes during class. Structure of the class: \r\nMidterm (20%) and Final (25%): same format and you just write an essay and explain some ID Terms. There is a study guide that is very very very helpful in helping you study for this. Basically gives you all the possible ID terms they might ask and the essay prompts.\r\nPaper (15%): 5 page paper on a book that you have to read. Used audible and just listened to it over the span of a week and then wrote the paper. \r\nDiscussion participation (25%): yes, discussion attendance is mandatory, but just say something every time and you should be good.\r\nDiscussion board (15%): just post on canvas discussion page thoughts about the lectures\r\n- Joe", "rating": 5, "expected_grade": "A+", "created": "2023-05-25T03:37:32.943339Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "THATS WHY HES GOAT THE GOAT. Actually just a great professor and an easy A as long as you pay attention and take good notes.", "rating": 5, "expected_grade": "A+", "created": "2023-06-09T00:15:02.973700Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Great professor, explains topics in digestible fashion and is interested in the subjects. Lenient grader and class has a simple structure.", "rating": 5, "expected_grade": "A", "created": "2023-09-26T16:34:39.120445Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "It really shows that Professor Chiles not only cares deeply about history, but that he wants to share this passion with his students. In my experience, his lectures are always engaging and humorous. Although I will note that if you lose focus during his lectures it can be really difficult to get back on track because they are pretty fast-paced. Also, you definitely have to pay attention during the lectures because the slides are not very self-explanatory- they are mostly just talking points. Nonetheless, he is probably the most knowledgable History teacher I've ever had and his mastery is well reflected in his lectures. He often connects points back to previous themes and characters which, I think, makes history much more palatable and comprehendible. His assignments and exams are fair and not super challenging as long as you pay attention in his lectures. Would definitely recommend!", "rating": 5, "expected_grade": "A", "created": "2023-10-10T22:24:56.987595Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Overall, this class is pretty easy. No electronics are allowed in the classroom. Exams consist of 2 essay questions that can be about any chapter that you learned, but they are not cumulative. Dr. Smead is very passionate about what he teaches and the TAs are helpful, but grading can take a little. Discussion is important to go to as there are readings each week but you don't have to prepare much. Would recommend for an easy Gen-Ed.", "rating": 4, "expected_grade": "B+", "created": "2023-12-03T22:28:08.861574Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Robert Chiles is the most amazing professor. He literally made me want to be a history double major. His class was very engaging and the lectures were so much fun. He is so passionate about the subject and you could really tell. There were only 2 essays and the midterm which he gave us the prompt for ahead of time. He always was a very lenient grader and just wanted the best for us. I would recommend anyone to take this class and i can’t recommend Chiles enough!!", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T01:07:11.136949Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "He is so great and so fun and so passionate. His lectures are incredibly entertaining. He doesn't post lectures, so you have to go to class. It doesn't matter that he doesn't post anything, because he doesnt have anything on his slides anyway most of the time. He likes pictures and to speak. So you need to take notes on what he says while lecturing, so type your notes. His TA's are the ones that grade basically everything, so being super nice to them, go to discussions and talk to them; just form a relationship because being on their good side is important. His exams are kinda easy, but again, it depends on your TV because they grade them. Overall, thumbs up for this class and for Chiles. Love him \r\nPS. not as important, but he is incredibly great-looking.", "rating": 4, "expected_grade": "A", "created": "2023-12-08T16:13:55.075555Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "I had Dr. Smead in Spring 2023. He is hilarious and knows a lot about history. He is an excellent lecturer and the class was amazing and I learned a lot. The midterm and final exams in the class are take-home, which is great. I did however give Dr. Smead a 4 and not a 5 because he makes you buy his own book and laptops/phones are not allowed in class.", "rating": 4, "expected_grade": "A-", "created": "2023-12-11T20:47:31.896062Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Funny guy and great lecturer it's not impossible to get an A but it's very hard since it's impossible to ever get a 100% in anything even participation the max people always get is a 97%.\r\n\r\nThe workload consists of two exams, participation, and a final. The final and exams are just an essay based response under a time limit that being 1 hour for the midterms and 2 for the final. They are online so you can take them at your own time and there not monitored.\r\n\r\nGreat class to take with low workload but don't except an A so easily I would recommend taking it with smead if you liked what you read all the above like I said don't except an easy A.", "rating": 5, "expected_grade": "A-", "created": "2023-12-21T15:39:26.809684Z"}, {"professor": "Howard Smead", "course": "HIST201", "review": "Course is super easy! Only need to go to discussions and take exams/a paper. With that being said this is an easy A- NOT an easy A.", "rating": 4, "expected_grade": "A-", "created": "2023-12-22T01:47:32.686163Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "Dr. Chiles is an outstanding lecturer who made history very enjoyable. He tells a story at every lecture, which makes the content accessible and entertaining. Attendance at lecture is important, because there are no officially posted notes or slides available, but depending on your TA, they might post a slide recap at the end of the week. Most grades came from the midterm, final, and a paper which were fairly graded (class avg 90% for all). Other grades were from discussion (in-class participation and online discussion post 2x weekly). I highly recommend taking this course with Dr. Chiles. You will get a good grade if you put in moderate effort.", "rating": 5, "expected_grade": "A+", "created": "2024-01-04T00:44:03.998155Z"}, {"professor": "Robert Chiles", "course": "HIST201", "review": "I took him in winter term, I can say he's amazing really passionate about history, his grading and assignments are pretty fair, with a good structure, and he is generally pretty fun, so lectures are never boring. So, he is a 10", "rating": 5, "expected_grade": "A+", "created": "2024-01-23T04:03:16.078147Z"}, {"professor": "David Freund", "course": "HIST201", "review": "Good professor with entertaining lectures, but the grading system is a little strange. There are only five graded assignments for the entire semester and he's a harsh grader, not a lot of room for error.", "rating": 4, "expected_grade": "B+", "created": "2024-03-28T12:12:14.711626Z"}], "department": "HIST", "course_number": "201", "name": "HIST201", "title": "Interpreting American History: From 1865 to the Present", "credits": 3, "description": "<b>Credit only granted for:</b> HIST157 or HIST201.\n<b>Formerly:</b> HIST157.\nThe United States from the end of the Civil War to the present. Economic, social, intellectual, and political developments. Rise of industry and emergence of the United States as a world power.", "is_recent": true, "geneds": null}