{"average_gpa": 3.3579268292682922, "professors": ["Clare Lyons", "Clare Lyons", "Clare Lyons", "Clare Lyons"], "reviews": [{"professor": "Clare Lyons", "course": "HIST289N", "review": "DO NOT TAKE HIST 289N. I went into this thinking it would be a fun, interesting class. Instead, I was met with boring lectures, extremely harsh grading, and lack of instructions. There’s not a rubric for any of the assignments in the class, yet on almost every assignment there are a ton of points taken off with no explanation as to why. Most of the assignments the high isn’t even a 100, which does not make any sense. Anyways, this class has been my main source of stress this semester and makes me extremely angry. Do not take it.", "rating": 1, "expected_grade": "", "created": "2022-03-31T12:34:33Z"}, {"professor": "Clare Lyons", "course": "HIST289N", "review": "The class is interesting and the things we learn about are very new/do not come up in your average history class. But the professor is VERY vague about grading and we do not get a rubric for any papers. For the first half of the semester we got video lectures but once we got to the second unit on LGBT history we only got power point slides to read through. Considering the loose structure of the class the grading is pretty harsh as well. ", "rating": 3, "expected_grade": "A", "created": "2022-04-25T16:16:39Z"}, {"professor": "Clare Lyons", "course": "HIST289N", "review": "I loved the class, it was very interesting and educational. If you want to do well on her assignments be as detailed as possible when answering questions, unfortunately there are no rubrics to work from but that’s the pattern I’ve picked mid semester, the more I write the higher the grade. I wouldn’t call this an easy class, I had to put a lot of time into it due to all the assigned readings, but it was also not too difficult, definitely time consuming. ", "rating": 4, "expected_grade": "A-", "created": "2022-05-18T23:53:54Z"}], "department": "HIST", "course_number": "289N", "name": "HIST289N", "title": "The Politics of Sexuality in America: A Historical Approach", "credits": 3, "description": "Why do particular issues about sexuality hold such an important place in American political debates? What animates these controversies and what can a historical perspective on these issues add to our understanding of modern sexual politics? This class explores the historical sexual politics that undergird contemporary debates concerning sexuality in America. It focuses on topics that garner significant public attention - Reproductive rights - LGBTQ rights - Sexting - and explores the histories that undergird Americans disagreements.", "is_recent": true, "geneds": null}