{"average_gpa": 2.936491228070176, "professors": ["Tracy Zeeger", "Sylvette La Touche-Howard", "Erin Tagai", "Neha Trivedi", "Hannah Allen", "Sharon Desmond", "Sharon Desmond", "Zahra Saboori", "M Reynolds", "Sharon Desmond", "M Reynolds", "M Reynolds", "M Reynolds", "M Reynolds"], "reviews": [{"professor": "Tracy Zeeger", "course": "HLTH285", "review": "This course was really simple and most of the questions on the exams were intuitive/common sense. Saying that, in order to get an A you definately have to note what she emphasizes in class. The textbook is not needed at all. She has points for random in class lecture assignments. There was a book review in which the rubric was not given out beforehand, and even if you complete all the points she wants in the book review, you can still get a B C or D. Her TA was not helpful in my opinion and wasn't too approachable. Overall a good class but 8am in the morning makes you not want to go.", "rating": 4, "expected_grade": "A", "created": "2012-12-19T00:24:00Z"}, {"professor": "Tracy Zeeger", "course": "HLTH285", "review": "", "rating": 5, "expected_grade": "A-", "created": "2012-06-28T21:47:00Z"}, {"professor": "Tracy Zeeger", "course": "HLTH285", "review": "Professor Zeeger is awesome!!  I ended up signing up for classes late because I switched majors over break, and didn't have much to choose from.  The class is at 8:00 am and the only reviews I saw were the bottom 3 that were horrible.  I was worried, but it was too late to change my mind.  I am SO HAPPY that I had no other choice.  I love this class.  Zeeger's class really is as simple as going to class and studying.  Tests aren't hard at all, multiple choice.  There are some journals, but they are actually helpful.  You just write about what was stressing you out and how you dealt with problems (big or small).  You can't miss class too much though, because she does have random in class activities worth 5 pts each. Zeeger is such a great professor though, I have no idea how anyone could say anything negative about her.  She makes class really fun, and that is saying a lot for someone taking her class at 8:00 am. She also teaches some really good techniques for dealing with stress that I will probably keep doing.  I would recommend this class to anyone and everyone.  Great professor, great class.", "rating": 5, "expected_grade": "A", "created": "2012-04-01T00:01:00Z"}, {"professor": "Sharon Desmond", "course": "HLTH285", "review": "The class is really good! I didn't really talk to Dr.Desmond much since the whole online class was asynchronous, but she was nice in the emails I have received from her. Her grading of the writing assignments is very fair, as long as you answer every part of the question or prompt. The only downside was that the in-class assignments in the powerpoints were HARD to find and easily missed. Also if she says some is \"extra credit\", it really isn't and it WILL count towards your grade if you don't do it. ", "rating": 3, "expected_grade": "A+", "created": "2021-01-13T17:41:47Z"}, {"professor": "Zahra Saboori", "course": "HLTH285", "review": "She's a super nice person but lectures were boring and you had to go to them because you didn't know when there would be an in-class assignment. lectures are very text heavy and she often incorporates a bunch of non-important information and she reads directly from the PowerPoint. Class is very writing-heavy too, with lots of reflection and papers which was crazy for a 200-level course. I wouldn't take or suggest this class honestly. ", "rating": 3, "expected_grade": "", "created": "2022-04-21T12:17:59Z"}, {"professor": "M Reynolds", "course": "HLTH285", "review": "Professor really tries to keep you engaged during the lectures with silly little activities during class which I appreciated. Pretty easy class with a do-able amount of work for what this class is. Very nice and understanding person as long as you don't push it. I took her at 8am and she was a little too much for me that early in the morning but she really does care about her students and the material and tries her best to make it fun for everyone.", "rating": 3, "expected_grade": "A-", "created": "2023-12-06T05:12:23.589627Z"}, {"professor": "M Reynolds", "course": "HLTH285", "review": "She's really an angel. Super nice and her assignments are so helpful. Just do the work and go to class.", "rating": 5, "expected_grade": "", "created": "2024-04-10T23:37:28.792072Z"}], "department": "HLTH", "course_number": "285", "name": "HLTH285", "title": "Controlling Stress and Tension", "credits": 3, "description": "Health problems related to stress and tension. Analysis of causative psychosocial stressors and intervening physiological mechanisms. Emphasis on prevention and control of stress through techniques such as biofeedback, meditation and neuromuscular relaxation.", "is_recent": true, "geneds": null}