{"average_gpa": 3.768292682926829, "professors": ["Behzad Gohari", "Behzad Gohari", "Behzad Gohari"], "reviews": [{"professor": "Behzad Gohari", "course": "HNUH239P", "review": "Behzad's a great professor. He tells you exactly how to get an A in his class.\r\n\r\nHe spends as much time with us as we need to help us get a good grade.\r\n\r\nHe expects you to be able to think for yourself, but he's super chill about it, and will help you get an A.\r\n\r\nYou just have to be willing to think for yourself.", "rating": 5, "expected_grade": "A", "created": "2023-10-24T17:47:04.295597Z"}, {"professor": "Behzad Gohari", "course": "HNUH239P", "review": "This is one of my favorite classes I've taken at UMD. Behzad is an absolutely brilliant (and hilarious!) guy, and the content is both surprisingly interesting and extremely relevant to today's world. Have a sense of humor, do the readings, watch the films, think deeply about the material, and (most importantly!) have fun, and you will do great in the class and learn a lot. Pizza is also provided!", "rating": 5, "expected_grade": "A", "created": "2023-12-07T02:06:25.020749Z"}, {"professor": "Behzad Gohari", "course": "HNUH239P", "review": "Behzad's a great teacher. His course is definitely worthwhile. It's worth the time and effort. If you're in UH, take his class.", "rating": 5, "expected_grade": "A", "created": "2023-12-18T00:10:38.908011Z"}, {"professor": "Behzad Gohari", "course": "HNUH239P", "review": "One of the best professors I've ever had. Clearly put in a ton of effort to make the simulation a roller coaster that you just have to sit back and enjoy. Be opinionated and informed and you'll be totally fine on every assignment. You just have to think deeply and remember the f-word.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T18:21:32.278017Z"}], "department": "HNUH", "course_number": "239P", "name": "HNUH239P", "title": "Geopolitics of Finance: A Simulation of the Roller Coasters of Capitalism", "credits": 3, "description": "In this course, we explore the intersection of money, markets, politics, and power; and the periodic financial crises that leave a lasting, sometimes devastating impact on the global landscape. Students will examine the detritus of 200 years of crises in the United States, from 19th-century booms and busts, to early 20th-century crashes. They will take the roller coaster ride of the 2008 financial crisis, reliving events that left the world reshaped. Students will be primed to examine the ripple effects of financial crises and the role they have played in changing the global socio-economic landscape over the last two centuries. This course is self-contained but paired with HNUH239T in the Geopolitics of Finance track, which explores how globalization has brought about fundamental changes to our daily lives by making the world more interdependent.", "is_recent": true, "geneds": null}