{"average_gpa": 3.695502645502645, "professors": ["Anthony Pagnotti", "Edward Priola", "Eric Dunning", "Robert Ballenger", "Robert Ballenger", "David Gormong", "Robert Ballenger", "Robert Ballenger", "Robert Ballenger", "Robert Ballenger", "Robert Ballenger"], "reviews": [{"professor": "George Kurtzweil", "course": "INAG110S", "review": "Amazing and chill professor. Tells a lot of good stories and is super friendly. Easy and fun class. A must take professor. ", "rating": 5, "expected_grade": "A", "created": "2021-04-04T00:10:18Z"}, {"professor": "Robert Ballenger", "course": "INAG110S", "review": "Mr. B is a really nice teacher and you can tell he's a professor who's really enthusiastic about what he teaches. Talking in front of a class is hard enough but he's a really non-judgemental guy. The only bad thing i would say is he doesn't give grace periods for the length of speeches so if you're over or under time even by a second you will get docked a good amount of points. other than that he is a pretty fair grader", "rating": 5, "expected_grade": "A", "created": "2023-05-11T03:34:35.788051Z"}, {"professor": "Robert Ballenger", "course": "INAG110S", "review": "Mr. Ballenger is great. Already took COMM107, so I decided to take this class as an elective and also to practice more with my speaking. He is very friendly and patient, and he is very encouraging and understanding of his students. He is also a very fair grader. Take this class with him.", "rating": 5, "expected_grade": "A", "created": "2023-09-19T17:07:44.434026Z"}, {"professor": "Robert Ballenger", "course": "INAG110S", "review": "My goat, W mans. Assignments are graded fairly, fun class,", "rating": 5, "expected_grade": "A+", "created": "2023-11-07T21:50:27.694728Z"}, {"professor": "Robert Ballenger", "course": "INAG110S", "review": "I LOVED Mr. B. He was so chill and nice. I never missed a class because it never felt draining or annoying to go to. He creates an environment of encouraging comfortable vibes to help you with public speaking. He understands that many people do not enjoy public speaking and helps you figure out ways to succeed in his class. His little jokes make such a difference. I really enjoyed having him and 100% recommend taking him for this Gen Ed requirement.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T16:21:06.533749Z"}, {"professor": "Robert Ballenger", "course": "INAG110S", "review": "The BEST professor I've ever had. He's funny, encouraging, understanding, and makes it clear he really cares about his students and wants them to succeed. He's a very lenient grader, offers great feedback on speeches, and offers plenty of opportunities to practice your speaking through impromptu speech activities.", "rating": 5, "expected_grade": "A+", "created": "2024-02-06T02:31:37.320784Z"}], "department": "INAG", "course_number": "110S", "name": "INAG110S", "title": "Oral Communication", "credits": 3, "description": "<b>Credit only granted for:</b> COMM107, COMM200, INAG110, JOUR130, THET285.\nA study of how perception, self-concept, and verbal and nonverbal communications affect the communication process as it emerges in the workplace.  The course provides skill training in speech writing, public speaking, group communication, interpersonal communication, listening, and responding.", "is_recent": true, "geneds": null}