{"average_gpa": 3.4789473684210526, "professors": ["Daniel Greene", "Wayne Lutters", "Daniel Greene", "Wayne Lutters"], "reviews": [{"professor": "Daniel Greene", "course": "INST204", "review": "Really easy class. 3 major assignments, 2 of them being written. Prof grades sorta harshly. The weekly quizzes are based on readings you don't really need to do, just ctrl f. The lowest 3 quizzes get dropped. You're graded on attendance which sucks but you get a few freebie days", "rating": 3, "expected_grade": "A", "created": "2022-12-16T20:42:31.944138Z"}, {"professor": "Daniel Greene", "course": "INST204", "review": "I had a great time in Professor Greene's class. We were assigned readings twice a week, and on the day of class, we'd review the readings, as well as discuss them for our warmups. On a week-to-week basis, we'd then be given quizzes on said readings. I think that with this fact alone, there's no reason for one to fail this class unless they don't try. Professor Greene uses a points system, so there isn't any rounding of percentages at the end of the semester — the grading is transparent, understandable, and clearly outlined in the syllabus. Aside from such, class activities were fun and interactive — something I enjoyed the most. One day we're playing a game to test our morality, and the other day we're investigating real-life events of how algorithmic biases have caused distrust in self-driving vehicles. And the enthusiasm from Professor Greene made me love the course even more. You can tell he loves teaching, and he's also understanding of his student's unexpected circumstances. He allows a set amount of absences, drops three quizzes, and grades fairly. Also, he's also a great professor to converse with!", "rating": 5, "expected_grade": "A", "created": "2022-12-21T17:33:45.309807Z"}, {"professor": "Daniel Greene", "course": "INST204", "review": "Professor Greene is an outstanding and caring teacher. He has made this class fun, and I honestly took this course to fulfill a gen-ed requirement but also because I thought it would be interesting. I would have never thought to actually enjoy this class a lot. The course consists of readings every week (some of them are long, but if you learn how to skim you will be fine), two major assignments (I think), warm ups, easy weekly quizzes about the readings, and a final project (this was so fun to do and it was low-stress). The grading was a little harsh, but if you check in with TAs or professor Greene and put in the effort into your work, you will end up with an A. He is engaging with the class and makes the class very interactive with what we learn about. I enjoy taking INST204 with him this semester as I have learned a lot of cool things and even made hopefully long-lasting friends in his class. The TA's were super chill and nice too. Overall, I found this class to be low-stress (as it was intended to be that way) and fun. If you ever take this class, take it with professor Greene if possible! :)", "rating": 5, "expected_grade": "A", "created": "2022-12-24T00:16:19.516100Z"}, {"professor": "Daniel Greene", "course": "INST204", "review": "Very very passionate about his craft! It is really inspiring!", "rating": 5, "expected_grade": "A", "created": "2023-01-22T23:17:19.951717Z"}, {"professor": "Wayne Lutters", "course": "INST204", "review": "Amazing professor, couldn't recommend him more. He's very caring and enthusiastic about the information. Each class included simple yet engaging group work that counted as your attendance grade. A lot of easy reading quizzes and two group projects that he is very helpful with. Favorite professor I've had to date. Easy and interesting gen ed class. It's a no brainer!", "rating": 5, "expected_grade": "A", "created": "2023-05-04T20:13:55.737735Z"}, {"professor": "Daniel Greene", "course": "INST204", "review": "Super chill professor and pretty straightforward class. There's a couple weekly readings and then two big group projects. Dr. Greene is friendly, willing to talk and help students on their projects despite the class being huge. The TAs were also wonderful and helpful. \r\n\r\nThis class focuses on automated systems and biases present in these systems (think AI and discrimination). If this is something you want to learn about, definitely take it with Dr. Greene!", "rating": 5, "expected_grade": "A", "created": "2024-01-31T18:06:08.581496Z"}], "department": "INST", "course_number": "204", "name": "INST204", "title": "Designing Fair Systems", "credits": 3, "description": "Reviews how specific values are built into different automated decision-making systems as an inevitable result of constructing mechanisms meant to produce specific outcomes. These values create differential outcomes for the different people enmeshed in these systems, but both these values and these systems can be changed to support different values and different outcomes. The class serves as an introduction to the emerging field of algorithmic bias that bridges the disciplines of information science, computer science, law, policy, philosophy, sociology, urban planning, and others.", "is_recent": true, "geneds": null}