{"average_gpa": 3.535830931796349, "professors": ["Pamela Duffy", "Vedat Diker", "Pamela Duffy", "Vedat Diker", "Pamela Duffy", "Vedat Diker", "Donal Heidenblad", "Christopher Dempwolf", "Donal Heidenblad"], "reviews": [{"professor": "Pamela Duffy", "course": "INST123", "review": "Not a very interesting lecturer, but very reasonable in terms of grading.  Class was well taught and easy.", "rating": 5, "expected_grade": "A+", "created": "2020-05-03T16:48:53Z"}, {"professor": "Vedat Diker", "course": "INST123", "review": "I am taking family mediation and this INST123 is still the stupidest class I'm taking. Technical content is easy. But not sure why we have so much busy work. Every week we have discussion posts that are ~500 words. Since the class goes so slow, there's nothing to really talk about in those posts. ", "rating": 1, "expected_grade": "A+", "created": "2021-04-22T00:12:58Z"}, {"professor": "Vedat Diker", "course": "INST123", "review": "Firstly, very easy course. However a TON of bullshit work (ex: discussions). Diker himself is very helpful and wants to see everyone succeed, however half the activities are unnecessary. Will say I did learn a good amount of SQL in the course.", "rating": 4, "expected_grade": "A", "created": "2021-12-24T21:33:17Z"}, {"professor": "Pamela Duffy", "course": "INST123", "review": "Firstly, very easy course. However a TON of bullshit work (ex: discussions). Duffy is a very nice professor and will help you out when needed. I cant speak much for her lectures though cause tbh i didnt even go to them.", "rating": 4, "expected_grade": "A", "created": "2021-12-24T21:34:08Z"}, {"professor": "Pamela Duffy", "course": "INST123", "review": "Easiest class I've taken in my entire life. You don't ever have to attend lecture.\r\n\r\nHowever, this class was the worst class I've ever taken. Pamela Duffy/Vedat Diker are stuck in the past with how they teach. Frankly, they have no idea how students actually learn, and they assign a stupid amount of pointless work which teaches you absolutely nothing.\r\n\r\nLong ass discussion boards every two weeks, required presentations which are nothing but busy work, and you're required to attend discussions every week, where literally all you do is wait until the TA gives you answers for work that you could just do yourself at home. Discussions in this class were the worst thing I've ever done in school or at UMD in general. Worst class I've ever taken. ", "rating": 1, "expected_grade": "A+", "created": "2022-05-07T20:09:34Z"}, {"professor": "Vedat Diker", "course": "INST123", "review": "Easiest class I've taken in my entire life. You don't ever have to attend lecture.\r\n\r\nHowever, this class was the worst class I've ever taken. Pamela Duffy/Vedat Diker are stuck in the past with how they teach. Frankly, they have no idea how students actually learn, and they assign a stupid amount of pointless work which teaches you absolutely nothing.\r\n\r\nLong ass discussion boards every two weeks, required presentations which are nothing but busy work, and you're required to attend discussions every week, where literally all you do is wait until the TA gives you answers for work that you could just do yourself at home. Discussions in this class were the worst thing I've ever done in school or at UMD in general. Worst class I've ever taken. ", "rating": 1, "expected_grade": "A+", "created": "2022-05-07T20:09:54Z"}, {"professor": "Vedat Diker", "course": "INST123", "review": "Very easy class but a horrible professor in terms of understanding students' needs and issues. Even with sicknesses and important private matters, he did not show any leniency and is very hard set on being a difficult person. He did not put any effort into helping me through my situation or understanding it. Horrible experience but very easy class. ", "rating": 2, "expected_grade": "A", "created": "2022-06-15T16:21:57Z"}, {"professor": "Pamela Duffy", "course": "INST123", "review": "easy class just lots of busy work. professor duffy is great though, she's very considerate and understanding and just wants the best for her students. she really wants you to succeed. the class is filled with busy work like weekly quizzes, biweekly discussion posts, & biweekly group presentations that are done online and can be finished in 30 minutes. there is a group project due at the end and you have check ins and progress reports throughout the semester but my group only met a couple times and we were able to finish everything on time. make sure you have a good group, i got lucky and even though we only met a few times we were super productive and agreed on everything so the work was well split and it went really smooth. you won't have any problems with professor duffy though, i had her and professor diker so they switched every week with who was lecturing. lecture does get boring & there's mandatory discussions every week but everyone is super helpful.", "rating": 5, "expected_grade": "A", "created": "2023-01-26T20:41:51.789277Z"}, {"professor": "Donal Heidenblad", "course": "INST123", "review": "Overall, very solid experience. I learned a lot about SQL and the structure of the course is designed for students to succeed. He's understanding and willing to help whenever the need arises. His lectures are the only reason I gave him 4 stars. They're not bad! If you don't read the book prior to attending the class you pretty much just sit there confused.", "rating": 4, "expected_grade": "A", "created": "2023-05-11T16:34:04.810589Z"}, {"professor": "Donal Heidenblad", "course": "INST123", "review": "Heidenblad is a SQL legend. He cares about his student's success a lot and that's very obvious. His lectures can be quite dry though. I'd recommend this course to anyone in the info sci program as this class greatly prepared me for 327.", "rating": 4, "expected_grade": "B+", "created": "2023-07-19T20:05:54.303017Z"}, {"professor": "Christopher Dempwolf", "course": "INST123", "review": "Keep in mind this review is not for professor, only for the class. I stopped going to lecture pretty early in the semester, so he's getting default 3 stars (I can't rate what I don't know). \r\n\r\nNow onto the class. This class...this class is one of the worst classes I have ever taken. I feel bad too because the content is REALLY REALLY USEFUL but I cannot express how much I despised, and even hated, the busy work I had to do. Bi weekly presentations that are graded differently based on which TA is grading your assignment. Irrelevant discussion posts on canvas. Mandatory discussions on Fridays that could be completed in 2-5 minutes, but you still had to go because attendance was required. A semester long group project that HEAVILY depends on who your group members are. Overall just an awful experience and my canvas calendar was constantly filled with meaningless assignments. It's not even an easy A because of how much effort is required to complete the work. You get the A if you do the work, but doing the work could not be more draining. So yeah, if you need to take it, I'd recommend against it.\r\n\r\nTL;DR: 5 stars for how useful the content is, -3 stars for how useless the class is", "rating": 2, "expected_grade": "A+", "created": "2023-12-19T18:58:08.806901Z"}, {"professor": "Christopher Dempwolf", "course": "INST123", "review": "This professor was all over the place. Organization was horrible, the TA coordination was a mess, the projects were missing entire portions that were meant to be graded. Grading was super late and disorganized as well (no way to see overall grade), and overall communication, especially at the start of the course, was abysmal. Would not recommend INST123 with Dempwolf if you actually want a smooth course experience, but it is a free A nevertheless.", "rating": 1, "expected_grade": "A+", "created": "2023-12-23T04:16:56.224183Z"}], "department": "INST", "course_number": "123", "name": "INST123", "title": "Databases for All", "credits": 3, "description": "<b>Restriction:</b> Must not have completed or be currently taking INST327 or BMGT402.\nAn introduction to relational databases for students with no previous programming experience. Provides a means for students of diverse backgrounds to successfully learn how to store, retrieve, and maintain data in relational databases. Topics include a brief comparison of database systems with an emphasis on relational databases, fundamental relational database concepts, and data types. Includes technical approaches to accessing information stored in relational databases.", "is_recent": true, "geneds": null}