{"average_gpa": 3.7183333333333333, "professors": ["Beth St Jean", "Beth St Jean"], "reviews": [{"professor": "Beth St Jean", "course": "INST232C", "review": "Dr. St Jean is very knowledgeable and easygoing! She does take attendance, but is quite lenient with absences. She will definitely answer any questions you have and is a great resource.", "rating": 5, "expected_grade": "A+", "created": "2023-05-24T02:25:01.727200Z"}, {"professor": "Beth St Jean", "course": "INST232C", "review": "Beth is THE BEST professor. So caring and genuinely loves all her students. Teaches using powerpoints and then posts them all on ELMS so all of the notes are always available. The group project is super easy and she leads us through the whole thing. Also very understanding with absences.", "rating": 5, "expected_grade": "A+", "created": "2023-10-26T23:28:58.969409Z"}, {"professor": "Beth St Jean", "course": "INST232C", "review": "AMAZING TEACHER!!! I wish she could teach all my classes at UMD. She wants you to call her by her first name and uses PowerPoint that are all posted at the start of the semester so you can find everything easily. There is one big group project with multiple due dates for different parts two individual essays and two quizzes that are open notes. If you put a little effort into everything it is impossible not to pass but try because it's all super easy to understand and Beth is the best Professor and makes it fun. She's chill about attendance but does take it. If you don't go or email her before she's super flexible and cares so much for your well-being. Get to know her also, she's super personable and so fun to talk to after class when I had some time to kill before my next class because she always ended 15-30 min earlier. The only thing I would say is my class was a 9:30 am so if she didn't use all the time, I would have preferred a later start time at 10 am.", "rating": 5, "expected_grade": "A+", "created": "2024-01-16T04:25:09.501301Z"}, {"professor": "Beth St Jean", "course": "INST232C", "review": "so so SO sweet and genuinely is very passionate about what she's teaching.", "rating": 5, "expected_grade": "", "created": "2024-01-19T00:53:00.413999Z"}], "department": "INST", "course_number": "232C", "name": "INST232C", "title": "Health Justice: Investigating the Roles of Information in Preventing & Addressing Health Disparities", "credits": 3, "description": "Does every individual have a fair shot at living a long and healthy life? What are the roles that information plays in creating and intensifying health disparities? How can we harness information to prevent and address health disparities? In this course, we explore health justice: the conviction and enactment of the idea that every person is morally entitled to a fair and sufficient capability to be healthy. We especially focus on the ways in which information-related factors, such as people's access to health information, their strategies for seeking (or avoiding) health information, and their health and digital health literacy, contribute to health (in)justice. Our goal in this class is to promote health justice for all by identify information-related solutions that will help to facilitate people's access to health information and improve their abilities to find, assess, and make use of information to optimize their own and others' health.", "is_recent": true, "geneds": null}