{"average_gpa": 3.7393939393939393, "professors": ["Sandra Banisky", "Deborah Nelson", "Christoph Mergerson", "Deborah Nelson", "Christoph Mergerson", "Deborah Nelson"], "reviews": [{"professor": "Deborah Nelson", "course": "JOUR281", "review": "JOUR281 is an interesting course. It deals a lot with exploring the constitution and amendments as they have applied previously and especially now in a digital age. There was some amount of outside the classroom work but it was ultimately interesting and never too hard and certainly worth it considering we only met for effectively one hour every week. ", "rating": 5, "expected_grade": "A", "created": "2022-02-13T22:08:10Z"}, {"professor": "Deborah Nelson", "course": "JOUR281", "review": "Terrible professor. I don't know what the person below me was thinking; JOUR281 was not interesting in the slightest. Nelson did absolutely zero teaching and had us learn through \"Microsoft Sways\" she had created, which are essentially interactive Microsoft presentations. Tests were all open note, but really annoying sometimes because you often had to search through court documents. Some of the court case precedents were interesting, but most of them were just things we learned in high school or expanding upon them with further case precedent. This class is limited to Carillon students, but for those of you facing the option to take it: avoid it.", "rating": 1, "expected_grade": "A", "created": "2022-05-07T21:17:31Z"}, {"professor": "Deborah Nelson", "course": "JOUR281", "review": "As someone who majors in Computer Science, JOUR281 did feel a bit like a nuissance since it was extra work to do, however I have a lot of good to say about this course. Even after being sick for about 2.5 weeks, Professor Nelson and her TA Abbi Ross were very caring and did their best to make sure I was catching up. The assignments are really not difficult at all, they just take some time to do. As long as you follow the instructions exactly as per what the rubric says, you should be fine. The tests and quizzes are relatively easy and had I not been sick, I probably could have even got an A+ in the course. You also only meet once a week in this course, most of the learning is outside of class in these \"Microsoft Sways\" which are some detailed slides. As long as you have somewhat of an understanding of what is going on, you should be fine. Since all quizzes and tests are open note, I never felt like I had to study for them, and if I am going to be honest, I am glad I did not spend time studying, since the sways you had access to helped tremendously in these tests and quizzes. I had almost an A in every test. You also have extra credit points where you can drop your lowest quiz scores, or add points onto a test. Overall this class was more interesting and easier than expected.", "rating": 4, "expected_grade": "A", "created": "2022-12-25T01:39:40.642364Z"}], "department": "JOUR", "course_number": "281", "name": "JOUR281", "title": "Media Law and Ethics in the Digital Age", "credits": 3, "description": "<b>Credit only granted for:</b> JOUR289E or JOUR281.\n<b>Formerly:</b> JOUR289E.\n<b>Additional information:</b> This course is intended for non-journalism majors.\nExplores the First Amendment, libel, privacy, FOIA and copyright as they have evolved in the digital news age of bloggers, tweeters and citizen journalists. The course will cover fundamental legal and ethical concepts as well as practical application.", "is_recent": true, "geneds": null}