{"average_gpa": 3.5857699805068224, "professors": ["Sarah Oates", "Robin Sundaramoorthy", "Denitsa Yotova", "Sarah Oates", "Robin Sundaramoorthy", "Sarah Oates", "Sarah Oates", "Denitsa Yotova", "Denitsa Yotova", "Robin Sundaramoorthy", "Denitsa Yotova", "Robin Sundaramoorthy", "Sarah Oates", "Dinfin Mulupi", "Dinfin Mulupi", "Wei-Ping Li", "Wei-Ping Li"], "reviews": [{"professor": "Sarah Oates", "course": "JOUR282", "review": "Great professor and very nice! Easy online class that was also very informative about current events worldwide through social media. There were a couple of readings and essays, but they weren't the worst. I highly recommend taking this class. ", "rating": 5, "expected_grade": "A+", "created": "2021-01-11T18:42:34Z"}, {"professor": "Denitsa Yotova", "course": "JOUR282", "review": "As with JOUR150, this summer class was completely online with no Zoom meetings. The quizzes were relatively easy as everything was open note, and the writing responses really made me think about what I've learned. The Sway presentations were well-put together and really helped me learn. I was also able to message the professor regarding some issues on a few occasions and she promptly relieved my concerns.", "rating": 5, "expected_grade": "A+", "created": "2021-08-27T23:34:28Z"}, {"professor": "Sarah Oates", "course": "JOUR282", "review": "I loved this professor and she was really accommodating! The weekly assignments are not hard and the class was very interesting.", "rating": 5, "expected_grade": "A-", "created": "2021-12-31T07:05:47Z"}, {"professor": "Sarah Oates", "course": "JOUR282", "review": "Although everything was asynchronous, there still was a good setting she placed when teaching this class. The class is not bad at all, and she (or the TAs) did not grade my papers strictly so that was a huge plus. Take if you can, it was interesting.", "rating": 5, "expected_grade": "A+", "created": "2022-05-16T17:41:08Z"}, {"professor": "Sarah Oates", "course": "JOUR282", "review": "Extremely knowledgeable prof and extremely straightforward course. Three writing assignments, weekly discussion posts, weekly quizzes (easy control-f quizzes), and weekly readings. Took less than an hour a week except for the weeks of the papers. The papers were straightforward and graded fairly. Dr. Oates is one of the first profs where I feel like they really want me to succeed. An excellent course, very interesting too!", "rating": 5, "expected_grade": "A+", "created": "2022-05-21T15:04:20Z"}, {"professor": "Denitsa Yotova", "course": "JOUR282", "review": "This winter course was completely online and asynchronous. The daily readings were easy to read through quickly, and the quizzes were simple since they were open note. If you're motivated, you could finish an entire week's module in a day. My only issue was that a large part of our grade was a final 5 person group paper. If you have a good group you'll be fine. However, all of my group mates were terribly hard to get a hold of. I had to message them many times and waited days for responses. Professor Yotova was quick to reply to my emails but was no help in getting my group to respond, nor was I able to change groups. 2/5 of my group members were flying/traveling across the globe during the final couple days of the class (and thus did no work during that time), and the other 2/5 group members contributed very little. I ended up writing almost the entire paper, and everyone in my group received the same grade. I got an A+ in the class, but the last week of my winter break was completely ruined since I had to do the project by myself.", "rating": 1, "expected_grade": "A+", "created": "2022-11-28T00:49:19.732140Z"}, {"professor": "Robin Sundaramoorthy", "course": "JOUR282", "review": "Prof Sundaramoorthy puts a lot of effort into the class and genuinely cares about her students. Pretty easy A as well.", "rating": 5, "expected_grade": "A", "created": "2022-12-26T03:23:38.835782Z"}, {"professor": "Sarah Oates", "course": "JOUR282", "review": "Not gonna lie, I was nervous about the coursework of this class considering that it is comprised of weekly quizzes, discussions, 2 midterms, and a research paper but it turned out to be manageable. She is very responsive to emails and is quick to fix minor grading errors such as when points should not been taken off. The class itself is completely asynchronous so you don't have to worry about scheduling which is a HUGE W. Overall, I highly recommend this class for gen ed as it is primarily about the effort without the time stress unlike many other courses.", "rating": 5, "expected_grade": "A", "created": "2023-04-06T20:07:04.508562Z"}, {"professor": "Sarah Oates", "course": "JOUR282", "review": "Class is relatively easy, just weekly discussion posts and quizzes (open-note). You also have one project/research paper and two written take-home tests. Easy to get an A in this course. Professor Oates is also very understanding and quick to respond to emails.", "rating": 5, "expected_grade": "A+", "created": "2023-11-20T18:17:24.664377Z"}, {"professor": "Dinfin Mulupi", "course": "JOUR282", "review": "great teacher! you will have to do quite a bit of writing in this class but the prof is super nice and helpful and will offer to read your midterm/paper/final essays and give you feedback before submitting. her class was genuinely interesting and i definitely recommend if you're looking for a random fun gen ed.", "rating": 5, "expected_grade": "A+", "created": "2023-12-03T00:40:20.423724Z"}, {"professor": "Sarah Oates", "course": "JOUR282", "review": "If you are a freshman or a transfer student who can take this class, PLEASE do.  I mean, where do I start? To put it plainly, SAO is the best professor I've had in a very long time.  She empathizes with her students so well and ensures we can contact her with any need.  The course material consists of weekly quizzes and discussion posts that are meant to be easy and require maybe 1-2 hours per week.  Three papers to write throughout the semester, which don't take long either.  Even though this class is async, I felt extremely connected with SAO, honestly more than my other professors.  I cannot stress how amazing she is and how fun this class was.  I am truly going to miss her :(", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T20:20:39.020905Z"}, {"professor": "Sarah Oates", "course": "JOUR282", "review": "I don't have my final grade as my final paper hasn't been graded, but I enjoyed this class! It was completely online, and you don't have to join a zoom which was great since I could do it on my own time. A module consisted of a discussion & quiz each week which is manageable. I like the class, would definitely recommend to others!", "rating": 5, "expected_grade": "B+", "created": "2023-12-14T21:05:22.765436Z"}, {"professor": "Sarah Oates", "course": "JOUR282", "review": "I don't think her ratings should be as high as they are. The quizzes were frankly annoying to deal with and I noticed a good number of errors. The essays and the discussions had unnecessarily high word counts that had me thinking of how to fill in the word count requirements rather than concisely making my points. Grading seemed fairly inconsistent.\r\n\r\nThere are so many readings, but you can control+F through them. Honestly, there's no way to truly read all of the stuff she requires because there's frankly just an insane amount.\r\n\r\nShe's very annoying about turning in stuff late, even if you ask for an extension in advance and you have a valid reason. She keeps responding by talking about equity, but it's a 200 level gen ed class. It's really not that deep.\r\n\r\nNot the worst class to take, but I would look at secondary options if you can.", "rating": 2, "expected_grade": "", "created": "2023-12-23T00:18:52.711376Z"}, {"professor": "Sarah Oates", "course": "JOUR282", "review": "Really sweet Professor, everything is asynchronous and done on your own time. Super easy weekly quizzes and discussion posts. The only thing to worry about are the two exam essays and the research project, but they are not graded as harshly. I wanted to clarify some things occasionally, and she always responded as quickly as possible and even met with me a few times on Zoom. This is one of the few completely asynchronous classes you'll have the option to take in UMD, and it lifts such a big weight off of your shoulders not having to show up to a useless lecture! Strongly recommend this class, super interesting topic that is applicable to contemporary times as well.", "rating": 5, "expected_grade": "A+", "created": "2023-12-31T06:30:15.706338Z"}, {"professor": "Sarah Oates", "course": "JOUR282", "review": "The course was well-managed and straightforward. It was exactly what I needed out of an asynch gened class. She is extremely kind and communicative and always responsive and accommodating. Could not ask for better!", "rating": 5, "expected_grade": "A+", "created": "2024-01-05T23:51:46.759258Z"}], "department": "JOUR", "course_number": "282", "name": "JOUR282", "title": "Beyond Facebook: How Social Media are Transforming Society, Culture, Business and Politics", "credits": 3, "description": "<b>Credit only granted for:</b> JOUR289F or JOUR282.\n<b>Formerly:</b> JOUR289F.\nExamining the rise of social media and their impact on culture, business, government, politics, journalism and society, this course provides students with a broad contextual understanding of the multidisciplinary impacts of social media such as Twitter, Facebook and similar Internet-based services.", "is_recent": true, "geneds": null}