{"average_gpa": 3.206829150579151, "professors": ["Susan Moeller", "Carole Lee", "Sarah Oates", "Hazel Feigenblatt Rojas", "Sholpan Kozhamkulova", "Sohana Nasrin", "Wei-Ping Li", "Hazel Feigenblatt", "Susan Moeller", "Bobbie Foster", "Ho Chun Wong", "Megan Fromm", "Wei-Ping Li", "Wenyou Ye", "Bobbie Foster", "Ho Chun Wong", "Md Haque", "Megan Fromm", "Wenyou Ye", "Susan Moeller", "Susan Moeller", "Ho Chun Wong", "Ho Chun Wong", "Md Mahfuzul Haque", "Susan Moeller", "Susan Moeller", "Susan Moeller", "Susan Moeller"], "reviews": [{"professor": "Susan Moeller", "course": "JOUR175", "review": "JOUR175 was fine, it was a lot of really petty assignments though. We had a weekly 300-500 word \"blog post\" due, which was basically summarizing a bunch of links that she gave us about media and big data and topics like that, and you also had to comment on others' \"blog posts\". No one ever finished the in-class assignments that we had, so our TA would always push back the due date. Lectures were horribly boring though, and barely had information pertaining to the midterm and final. The midterm and final were just a bunch of short answer questions based on vocabulary that we learned in class or from the discussions, but they're so easy to BS. \n\r\nThough this class required a fair amount of time, it was easy enough, and it covers a couple of geneds, but be prepared to do a lot of writing for it. ", "rating": 4, "expected_grade": "A", "created": "2015-05-11T22:51:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "This class is not too bad, but a decent amount of work week to week.\r\nMy TA graded way too harshly, and was not so good. The class only meets once a week in lecture and once in discussion, so that is nice.\r\nMost of the assignments (blog posts excluded) are interesting. Lecture is pretty boring most of the time and it is impossible to take notes. On the other hand, the exams are a joke. 3/4 essays which are graded leniently.\r\nBottom line: Not a bad class to take, but hope to get a good TA.", "rating": 3, "expected_grade": "A-", "created": "2015-01-21T12:58:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "Pretty easy class because we don't actually do much. Lectures were super boring most of the time. Most lectures are her talking with loads of youtube videos that don't upload properly or pictures. Weekly news quiz in lecture and a blog post due every week based on what was covered in lecture. Mostly busy work but an easy A", "rating": 3, "expected_grade": "", "created": "2013-12-05T23:11:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "First of all, this is a fantastic class to take. It fulfills several Gen-Ed requirements, and is an easy A, with minimal work every week. If your TA is good like mine was, the discussion each week will be engaging and enjoyable. The exams were also quite simple, just 3 essays each.\n\r\nThat being said, the lecture is unbearably boring. I pay attention literally none of the time, and would not attend at all if it were not for the weekly news quizzes. The lectures are uninteresting, barely relate to what we do in discussion, and Moeller is usually a boring lecturer. 95% of the class just plays with their laptops and ignores her.", "rating": 2, "expected_grade": "A", "created": "2013-04-27T02:14:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "Pretty easy class. Every week there was a blog post that only had to be about 300 words, and each week, there was a different topic covered. A few special projects were sprinkled in, but these were nothing more than field trips to the Holocaust museum or the Newseum or making a public service announcement.\n\r\nProf. Moeller's lectures were all very interesting. Every week she had a PowerPoint and would just talk, but they contained interesting videos from the Internet and I didn't take notes on a single lecture all year. Discussions were boring, but luckily, they're only once a week.\n\r\nBoth the final and midterm were in class: four possible prompts, of which you choose three and write. Both were out of 30 points, and I did not study for either one, and still wound up with A's. \n\r\nOverall, easy class. Got an A with minimal effort, and actually had fun with a few of the topics covered. I would definitely recommend. ", "rating": 4, "expected_grade": "A", "created": "2012-12-27T16:51:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "I thought Professor Moeller was pretty awesome. A couple of posters mentioned that \"you either love or hate\" her, but I don't really agree with that at all. There is nothing about her personality that you could hate. Sometimes lecture can get a little boring, but she supplements them with really fun Youtube videos and interesting pictures. Plus, everyone has their laptop open during lecture (and she sometimes encourages this) so if it gets boring, you can have that.\n\r\nThere is a blog post due every week and a few other projects that involve a bit of work, but the world is not difficult, just tedious, if anything. This class was pretty fun overall and it was interesting learning about the effects of the media in terms of advertisement, portrayal of women and minorities, and global exposure. \n\r\nThe class is structured with two classes a week, one 75 minute discussion and one 75 minute lecture. You can't really skip discussion because they take attendance and you will probably miss an in-class assignment. For lecture, there are news quizzes every week which affect your grade. There is an extra credit question on every news quiz, however, so you can afford to skip two or three pretty easily.\n\r\nMy favorite class about this BY FAR is the exams. There is a midterm and a final and you don't need to learn any terms for either of these. If you have been paying attention even a little bit to her lectures, throughout the semester, you don't need to spend any time studying at all. The midterm and final are comprised of essay questions that are very easy to answer/bull shit. \n\r\nOverall, I'd definitely recommend this class. While it's super easy to get a B in this class, some of the TAs make you work a little harder for an A, but to the best of my knowledge, not that hard.", "rating": 5, "expected_grade": "A", "created": "2012-12-12T14:21:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "This class was very easy. There is weekly readings and you have to blog about on a class website and random news quizes that are all very simple. There is a significant amount of reading for the blogs, but as long as you are not the first to post it is pretty easy to B.S. based upon others posts. Discussion in mandatory but you do simple group projects that are sometimes fun. The final exam took me about 20mins to finish and it was during regular lecture not on final exam day. I recommend this class highly for a solid B w/ little work and a definite A with normal effort in class. ", "rating": 4, "expected_grade": "B+", "created": "2012-11-28T16:46:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "As a previous poster mentioned, Moeller is the type that you will either love or hate. Personally, I loved her. She likes to keep things young and vibrant (even down to the way she dresses lol) so she shows a lot of Youtube videos and takes lots of class time up asking the class their opinions on current events. I honestly didn't learn anything in this course, but I did find her lectures to be very intriguing and I looked forward to the class.\r\nI must admit, outside of lecture the assignments were highly annoying. Every week you have to write a 300 word blog post on some 10+ pg reading about nothing. You have to write papers after visiting the holocaust and newseum, several group projects, and there is a short news quiz in every lecture and discussion. None of it is hard, but the assignments never relate to anything (like I said, I didn't learn anything) so completing them always feels like a waste of time.\r\nEveryone has said the most important thing is picking a good TA, but most of the time you won't know who to pick since they change often. To be safe I would say don't choose this as an easy A course, but if you want to balance out a difficult schedule with a good time, lazy elective, then this is right for you.", "rating": 4, "expected_grade": "B", "created": "2012-01-12T14:11:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "Very fun and interesting class! Moeller is quite the character. You either love or hate her personality. She's very active in her field and a good lecturer. She fills lecture with intersting and often hilarious videos to keep things interesting. She's a big fan of YouTube. Discussion is fun too, that depends on your TA though. There is definitely some work involved - very heavy on homework, a couple projects, papers, exams. The assignments are time consuming but also unique and fun. (e.g. there's one where you write a paper about going 24 hours without any technology). I definitely recommend taking this class!", "rating": 5, "expected_grade": "A", "created": "2011-11-07T08:45:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "I took this class as an elective and it was one of the reasons I decided to change my major to journalism.  The class itself is very interesting. Lectures with Moeller are typically interesting, she shows a lot of YouTube videos/ads/photographs to analyze.  It's not about memorizing everything it's about learning general ideas (properties of propaganda) and applying them to everyday media.  As everyone else has said, your TA is the most important part.  I have Elia Powers and he's great and is a pretty easy grader.  He never gives C's (he told us this) and usually grades between high B's to low A's.  \n\r\nEvery week in lecture is a news quiz to basically take attendance (just Google questions). Every week in discussion is a 2 question quiz on basic concepts from class (like what artist did we watch a YouTube video of in class) to again get attendance.  Every week there is a blog post due on a certain topic where you have readings to look at and you must respond to them in 300 words, it's a lot to do it every week but not that hard.\n\r\nThere's also a few projects.  You have to go to the Holocaust Museum and write a 5 page paper.  You also have to visit the Newseum in D.C. (actually an awesome museum) and write a blog post on it as well as a question on the final being about it.  You also have to make a PSA, but it's not that hard.\n\r\nThere's a midterm and a final with 3 essays.  The midterm gave a picture and you had to analyze it, we watched 2 news clips covering the same event and had to cover that, and then write an essay on how social media plays a role in natural disasters.  It's pretty easy to BS cause it's a lot of opinion.\n\r\nI know this is a lot but I like to find reviews that tell me what assignments there are and everything like that.  Overall, enjoyable class.", "rating": 4, "expected_grade": "B", "created": "2011-04-26T18:23:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "I for one thought Professor Moeller's lectures were almost useless. The only new things I learned were the terms I had to memorize for the midterm and final, and I forgot them as soon as the tests were over. She's very unresponsive to students and does not do a good job weighting grades. For example, a five page paper for which I was required to visit the Holocaust Museum in DC was worth as much as finding a video on Youtube which talked about cell phone usage. She didn't offer a good excuse.\n\r\nLike a previous poster said, what makes this an easy course depends largely on your TA. For the first half of the semester, my TA wasn't very specific about what he expected on the homework assignments. It reached a point where I pestered him for two weeks until he gave me an answer. Only then did I start breezing through the course, but by that point it was too late to raise my overall grade to an A. Bottom line: Make sure you know what your TA wants from you.", "rating": 1, "expected_grade": "B+", "created": "2010-07-07T22:16:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "I think that Prof. Moeller is great at lecture, there were some really interesting days, but pick your TA carefully! The grades vary between the TAs greatly - mine doesn't give out As at all - so if you're taking this as an \"easy A\" beware to pick a good TA! Overall not a class I would take again.", "rating": 3, "expected_grade": "B", "created": "2010-05-17T00:06:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "I am not responding to Professor Moeller as a lecturer. She is actual quite interesting in lecture and uses lots of good videos as part of her slides.\r\nHowever, the discussion aspect of the class is extremely confusing. It is impossible to figure out what you need to do for the assignments and there area a lot of group projects.\r\nI would not recommend that you take this class at all (I signed up for OurUMD just to make this comment), but if for some reason you still want to, make sure you check out the COURSEEVAL link on Testudo... although the average GPA for the class is high, it actually varies significantly between TA's. So if you're taking this class as an \"easy A\" it will  most likely make your life easier to pick and choose what section you are in carefully.\r\nAgain, I'm really not trying to bash on Professor Moeller as a lecturer. She hasn't been very responsive to student concerns, but she doesn't really know what goes on in the discussions.", "rating": 1, "expected_grade": "A", "created": "2010-04-21T15:22:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "She is a good teacher. Many videos are shown in class so its very rare that one gets bored. There are two tests and they are easy (basically argue your opinion very well and its at least a high B). The only catch is that there are about 12-13 pages during the semester, and they are moderate. The first few papers are graded very harshly but it eases out in the end", "rating": 4, "expected_grade": "B", "created": "2009-12-07T23:56:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "Professor Moeller is very knowledgeable, she is just terrible at transmitting that knowledge to students. Lectures were sometimes interesting, but unnecessary to attend to achieve a high grade. There is a 2 page paper due every week, but they're a piece of cake. Final was a breeze. Get Jessica Roberts as your TA and the course is a cakewalk, she rocks.", "rating": 3, "expected_grade": "A", "created": "2009-05-23T21:47:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "Professor Moeller's class was very easy.  Lectures were pretty much optional, although there was one day in discussion when they quizzed us to see if we were at the previous lecture.  There are weekly assignments that are short and easy.  There is no midterm and a final that from what I have heard is easy.  The class is very interesting and it does not take much effort or knowledge to get a good grade.", "rating": 5, "expected_grade": "A", "created": "2009-04-28T15:31:00Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "My least favorite teacher I have had yet. nothing about this class works. Do not take a class with her.", "rating": 1, "expected_grade": "A", "created": "2018-05-02T19:36:26Z"}, {"professor": "Hazel Feigenblatt Rojas", "course": "JOUR175", "review": "Her online class is way too much work. In addition, she takes herself too seriously. She gives around 6.5/10 average on the little reading assignments that other professors would proabably just grade for completion. Do not recomend.", "rating": 1, "expected_grade": "A-", "created": "2018-09-07T02:54:24Z"}, {"professor": "Hazel Feigenblatt Rojas", "course": "JOUR175", "review": "Grades way too harshly and takes the class way too seriously; I put more work into this than some of my upper div technical classes, and my grades are lower here.\r\n\r\nReading responses that probably should be for completion are nigh impossible to get full credit on. This is a recurring theme in writing assignments: despite meeting all the criteria stated on rubrics, points get deducted anyways. Ironically enough, you'll probably get around the same score if you stop trying.\r\n\r\nWould give 0 stars if I could", "rating": 1, "expected_grade": "A-", "created": "2018-09-13T04:42:43Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "Horrible teacher. Her assignments made no sense. On ELMS, she'll say one thing. Then, in class she'll describe the assignment a different way. Her TA's describe another way, and if you email Susan about the discrepancies, she tells you to drop the class. The entire class was just busy work and she refuses to negotiate on anything.", "rating": 1, "expected_grade": "A", "created": "2018-12-11T23:11:01Z"}, {"professor": "Bobbie Foster", "course": "JOUR175", "review": "VERY easy grade-wise.  A helpful teacher, and I have no complaints. Had a  great time in her class. ", "rating": 5, "expected_grade": "A+", "created": "2018-12-17T05:47:24Z"}, {"professor": "Hazel Feigenblatt Rojas", "course": "JOUR175", "review": "Out of all my classes, I really did not expect this one to be my hardest class. The workload is too much for a gen-ed Journalism class. Take another professor if you can. ", "rating": 1, "expected_grade": "A-", "created": "2019-11-06T22:33:52Z"}, {"professor": "Sohana Nasrin", "course": "JOUR175", "review": "Absolutely amazing professor. Very lenient and understanding of extracurricular situations that we students go through since we are adults as well. She's very knowledgeable about journalism and is very friendly. Class is reading and essay heavy with a few projects but it's nothing that overpowers a college student's time. Take Sohana for any class she offers!!!", "rating": 5, "expected_grade": "A", "created": "2020-05-20T16:47:54Z"}, {"professor": "Wei-Ping Li", "course": "JOUR175", "review": "really great professor with a lot of background and experience with journalism. she was caring and flexible with students. her class is super chill, with many small assignments that add up. she explores relevant topics such as social media. I highly recommend this for an easy gen-ed.", "rating": 5, "expected_grade": "A", "created": "2020-05-20T18:43:13Z"}, {"professor": "Wei-Ping Li", "course": "JOUR175", "review": "Knowledgeable teacher and she a passion for journalism. She doesn't grade harshly, and the content in the class is fairly easy. Midterms however have a lot of writing.", "rating": 5, "expected_grade": "A", "created": "2020-08-22T00:44:07Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "I do not know why people shit on this teacher so much. This is the best course to take(especially in the summer) because it is just all writing and she grades super leniently. As long as you follow directions in the prompts and put effort into the assignments, this will be the easiest two gened covered course there is in UMD.", "rating": 5, "expected_grade": "A+", "created": "2021-08-05T20:54:49Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "Don't take this course. This class is way too much work for a gen ed.", "rating": 1, "expected_grade": "W", "created": "2021-08-31T23:27:54Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "Class was online. For a gen-ed course, you, like many others have expressed, are given a relatively unnecessary amount of workload. You meet four times throughout the semester though I only attended once. They're generally not that informative and only exist to do peer-review on your projects that you're periodically assigned throughout the semester. Assignments are reading incredibly boring (depending on your feelings on the topic) journal articles and giving your thoughts on them. Her grading is super lenient and she does give feedback on assignments and projects, however, which is why I think she and the course deserve at least 2-3 stars. If you're into journalism, it'll be a great class for you. If you just need to fulfill a gen-ed requirement, I'd choose something else that'll work you less. ", "rating": 2, "expected_grade": "B", "created": "2021-12-03T20:30:39Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "This class is an actual joke. Easy A- or higher. \r\n\r\nBUT BE WARNED: this is a brainwashing class. CNN articles and insanely biased liberal video clips make up 75% of the course content. Take it for the grade, but not to open your mind to multiple angles of a topic because you will only learn about the left. ", "rating": 3, "expected_grade": "A", "created": "2021-12-10T18:32:59Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "Class is a ridiculous amount of work, be prepared to spend at least 3 hours doing the weekly homework. Also does only talks about liberal views and can be very overwhelmingly political at times. ", "rating": 2, "expected_grade": "A-", "created": "2021-12-14T23:23:59Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "The class is filled with busy work. The professor has a political agenda, it's obvious based on her assignments (I don't care if you discuss politics in class but leave your baseless claims out of graded assignments).", "rating": 1, "expected_grade": "", "created": "2022-02-06T22:47:46Z"}, {"professor": "Megan Fromm", "course": "JOUR175", "review": "Professor Fromm is literally the nicest and most understanding person ever. I took her JOUR175 class in the Fall of 2022 and I loved it. We had a discussion post due each week and a mix of different media literacy-related assignments. She gave us 2 \"no questions asked\" absences because she understood that life could be challenging sometimes. I definitely recommend this course to anyone who needs the gen-ed or just wants a fun elective.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T16:28:44.413140Z"}, {"professor": "Bobbie Foster", "course": "JOUR175", "review": "This professor offers extensions and encourages you to ask for them. She gives you one free absence no questions asked. The class was supposed to be twice a week but she made it a once-a-week lecture, and even cancelled the last class based on a class vote.", "rating": 5, "expected_grade": "A", "created": "2022-12-16T05:40:07.699490Z"}, {"professor": "Megan Fromm", "course": "JOUR175", "review": "Overall great class with a manageable workload and a nice the professor. The only issue is if you mess something up once your grade can drop by a couple percentage points.", "rating": 5, "expected_grade": "A", "created": "2022-12-21T20:44:05.628369Z"}, {"professor": "Megan Fromm", "course": "JOUR175", "review": "Very sweet professor! Lenient about work and very willing to adjust if things are going on in your life. Bigger grades will be project based but the projects are not difficult and be quite fun. I admittedly took the course for gen ed credit, but I have no complaints with the structure and Prof. Fromm is lovely.", "rating": 5, "expected_grade": "A+", "created": "2023-01-26T03:14:06.545178Z"}, {"professor": "Md Haque", "course": "JOUR175", "review": "Easiest A of any class at UMD. Classes are not mandatory and zero information is needed to complete any assignment as they are explained on elms with detail.  One 500 word paper a week, if you turn in anything you get 50/50 on it. A couple projects that are equally as easy and won't take you over 30 minutes.", "rating": 4, "expected_grade": "A+", "created": "2023-04-27T14:25:59.827703Z"}, {"professor": "Md Mahfuzul Haque", "course": "JOUR175", "review": "Literally the easiest class I've ever taken. I got a 100 for the year and he seemed to give everyone who did the assignments a 100. As long as you just do all the work you'll get an A. Don't even have to go to class because he doesn't take attendance", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T20:55:27.952584Z"}, {"professor": "Md Haque", "course": "JOUR175", "review": "Absolute god send. He was very accommodating and only wanted the best for me since I had a hectic semester. Doesn't deserve his current rating, he deserves higher. Take this class if you want a fairly easy A.", "rating": 5, "expected_grade": "A+", "created": "2023-05-17T02:23:10.715313Z"}, {"professor": "Wenyou Ye", "course": "JOUR175", "review": "Usually a pretty chill professor, you only have to attend class once a week instead of both days. However, there's a huge amount of outside-of-class work to make up for that, including an essay you have to do every single week with a minimum of 500 words, fully cited. These weekly assignments are usually graded pretty leniently, but the media creation projects are graded so insanely harshly that doesn't even make sense on the rubric. He's definitely hunting for points to take off on projects because everyone seems to agree that they didn't get the grade they deserved on it.", "rating": 3, "expected_grade": "A", "created": "2023-05-20T21:02:04.532405Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "Just took this course during the 2023 summer session - so it was accelerated as hell. This is definitely not a class that condenses super well - it is a lot of assignments and each of them is a lot of writing. The \"quizzes\" were the bulk of the class - with each one taking several hours to complete on average as they involved an average of 20-30 readings/videos and 6-10 written response questions (each usually with multiple parts).\r\n\r\nThere were 7 of these quizzes in this 3 week span. In addition, there are 3 projects, and an additional paper due as well. On the surface, this doesn't seem like many assignments, but the length of the quizzes was pretty killer. We also had a 90-120 minute Zoom session at the start of each week, and had to complete a Zoom Quiz immediately after each one.\r\n\r\nAll the reviews I'd read before registering for this course said it was a lot of writing, but never specified how much... it is a lot though: I submitted over 25,000 words of writing for this course in total, and that doesn't include my own planning and prep (which is also significant). For further reference, I submitted roughly 2,500 words per quiz, on average (zoom quizzes closer to 700 words per).\r\n\r\nThat being said, this class was super interesting and I think it was worth taking, though I wish the assignments could have been condensed some further.\r\n\r\nProfessor Moeller was also super accommodating. She made a point of expressing that she wants all of us to succeed, almost constantly, and was open to providing extensions (even more lenient due dates than I would request) as needed because she understands the challenge of taking this content-heavy course in such a short time frame.", "rating": 4, "expected_grade": "A", "created": "2023-06-25T12:27:51.471177Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "The class overall is easy, it is just a lot of useless work, I never went to class and got a 97 percent, the weekly homework takes about 2 hours to do and its just answering and citing links that you have to read. Point less class but it is easy if you don't care about doing 2 plus hours of homework each week.", "rating": 1, "expected_grade": "A+", "created": "2023-12-05T00:28:05.449937Z"}, {"professor": "Susan Moeller", "course": "JOUR175", "review": "this was a long course which required a lot of assignments but no exams and no memorization, but a lot of reading and lot of time required every week. Overall, the expectations were very clearly outlined, grading criteria was very clear and she was very organized which helped me get a good grade in this class. So if youre a person who cant memorize but is ready to work a lot then definately recommend. It is an easy A if you put in effort.", "rating": 4, "expected_grade": "A-", "created": "2023-12-23T03:50:16.342198Z"}], "department": "JOUR", "course_number": "175", "name": "JOUR175", "title": "Media Literacy", "credits": 3, "description": "<b>Additional information:</b> Not applicable toward journalism major.\nAn analysis of the information, values and underlying messages conveyed via television, newspapers, the internet, magazines, radio and film. Examines the accuracy of those messages and explores how media shape views of politics, culture and society.", "is_recent": true, "geneds": null}