{"average_gpa": 3.320963391136802, "professors": ["Ronald Yaros", "Saranaz Abdollahzadeh Barforoush", "Boya Xu", "Edward Alwood", "Denitsa Yotova", "Krishnan Vasudevan", "Christine Harvey", "Justin Hudson", "Nandikoor Bhat", "Sohana Nasrin", "Bobbie Foster", "Andrew Otis", "Carolina Siqueira Paranhos Velloso", "Hazel Feigenblatt", "Sara Browning", "Wei-Ping Li", "Md Haque", "Denitsa Yotova", "Edward Alwood", "Denitsa Yotova", "Edward Alwood", "Keegan Clements-housser", "Md Haque", "Sara Browning", "Denitsa Yotova", "Edward Alwood", "Keegan Clements-housser", "Sara Browning", "Wei-Ping Li", "Carolina Siqueira Paranhos Velloso", "Md Mahfuzul Haque", "Denitsa Yotova", "Edward Alwood", "Sara Browning", "Sara Browning", "Denitsa Yotova", "Edward Alwood", "Ho Chun Wong", "Sara Browning", "Denitsa Yotova", "Edward Alwood", "Mengyuan Chen"], "reviews": [{"professor": "Ronald Yaros", "course": "JOUR150", "review": "AWESOME CLASS. I know nothing about Journalism and am horrible with technology so it was a very challenging class in my opinion. This being said, Professor Yaros is always willing to help. He wants you to do well and he is very quick at responding to e-mails. He is an incredible professor. Highly recommended", "rating": 5, "expected_grade": "A-", "created": "2015-05-05T20:09:00Z"}, {"professor": "Ronald Yaros", "course": "JOUR150", "review": "Best class I've taken at Maryland. You get graded on blogging, using Twitter, and shooting video on an iPod which is provided for the course (or you can use your iPhone). No tests, just writing, so if you like to write this class is great. You learn a lot about modern journalism. Take this class and get an easy A.", "rating": 5, "expected_grade": "A", "created": "2013-04-24T19:40:00Z"}, {"professor": "Ronald Yaros", "course": "JOUR150", "review": "I loved class with Yaros, the whole class is general is very much based on technology so be prepared for that! I loved using twitter, blogspot, my phone and laptop specifically for the class. Final project seems like it will be a pain but he grades fairly as long as you do whatever it asks. He lets students borrow macbooks and itouchs to do assignments. Fun time!", "rating": 5, "expected_grade": "A-", "created": "2013-01-30T16:16:00Z"}, {"professor": "Ronald Yaros", "course": "JOUR150", "review": "Professor Yaros is amazing. He is very knowledgeable in this subject. He really has a passion for what he teaches. He seems to care much more about his students actually learning things opposed to \"grades.\" He grades leniently and fairly. I definitely recommend this class.", "rating": 5, "expected_grade": "A", "created": "2011-12-01T15:13:00Z"}, {"professor": "Denitsa Yotova", "course": "JOUR150", "review": "JOUR150 was an online class for me. Yotova graded assignments promptly and fairly, gave good and constructive feedback, and responded to student messages super quickly. Was a good gen-ed class. However, there is a pretty standardized and heavy workload!", "rating": 5, "expected_grade": "A", "created": "2019-12-20T21:48:47Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "If you have the chance to take this professor, do it. He is the most caring, sweet, and understanding man you will ever meet. The workload in this class is extremely minimal, with only 4 essays (that are only a page each), and 3 mid-term exams. The only thing is you have to do somewhat well on those because thats your only grade besides attendance. I wish I could take this class again, I learned so much from him.", "rating": 5, "expected_grade": "A", "created": "2020-05-08T01:57:51Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "he is a very knowledgable and caring professor. the essays are easy, but you will need to memorize a lot for the exams. overall a great choice for an easy gen-ed", "rating": 4, "expected_grade": "A-", "created": "2020-05-20T18:35:14Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "very sweet professor - lectures were recorded, but he showed them during a live zoom meeting to stay interactive with students; grades are basically determined off of a couple tests and 3 2-page essays, which honestly are pretty easy; if you put even a bit of effort in this class you will pass with a good grade since everyone else barely puts any effort in", "rating": 5, "expected_grade": "A", "created": "2020-12-05T01:33:52Z"}, {"professor": "Sohana Nasrin", "course": "JOUR150", "review": "Super super nice and understandable. She was consistently checking in on her students to make sure we were doing okay. The course load was light and the material is interesting. ", "rating": 5, "expected_grade": "", "created": "2020-12-09T03:42:36Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "Very sweet and fun! He tried his best to make lectures interesting. His papers were not difficult or time consuming. The exams were fair and easy. I would VERY MUCH recommend this for an interesting class and easy gen ed!", "rating": 5, "expected_grade": "A", "created": "2021-04-29T04:06:24Z"}, {"professor": "Denitsa Yotova", "course": "JOUR150", "review": "Completely online class with no zoom meetings or anything like that. Can't really attest to her teaching but the workload is slightly heavy and gets annoying at times. A discussion/ blog assignment or quiz is usually assigned per week. Group project due at the end of the semester. Its an easy A or B class and please dont pay for the book. I never read it once. Just use google.", "rating": 4, "expected_grade": "A", "created": "2021-05-19T22:26:02Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "He is the best teacher ever. Very nice guy, very easy class, and very interesting lectures. The essays are easy as shit and the exams are a breeze if you study a little bit the day before. Overall great class", "rating": 5, "expected_grade": "A+", "created": "2021-11-05T15:37:35Z"}, {"professor": "Wei-Ping Li", "course": "JOUR150", "review": "Amazing professor! She cares about her students very much and is extremely knowledgeable in the field of journalism. I would highly recommend taking this class with Wei-Ping. Even if you are not a journalism major, this is a great course to take because you will gain lots of interesting real-world knowledge.", "rating": 5, "expected_grade": "A", "created": "2021-12-14T21:52:07Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "This is the boy. Super funny and nice. A professor you definitely want to have. Not only is he great but 150 is a piece of cake.", "rating": 5, "expected_grade": "A+", "created": "2021-12-20T05:21:39Z"}, {"professor": "Wei-Ping Li", "course": "JOUR150", "review": "I cannot describe how amazing professor Li and the class is. She is very knowledgeable in her topic, plus there is no midterm/final and no tests at all. Her assignments for points that she does give are all straightforward and easy to get full credit on if you put in the work. She gives weekly open note/open-book reading quizzes based on the textbook readings, however, she gives you the prompts beforehand so you know exactly what kinds of questions to expect. She also has weekly 5 point reflections due every Wednesday. However, these aren't busywork, and they take a combined 15 minutes to complete, so you can be getting 10 easy points every week. She is also extremally nice, and understanding. I had to miss class three times this semester on excused absences and she took time out of her day (3 times) to meet with me on zoom to go over everything we did in class. If I was going to be late on some work, she would grant reasonable extensions upon request. I am not a journalism major, so I can personally tell you that this is perfect for anyone interested in some aspect of journalism, history, social media, or anyone who just wants to get a gen ed credit out of the way. Just make sure that you participate a little in class, and you will be fine. I highly recommend this class!", "rating": 5, "expected_grade": "A+", "created": "2021-12-23T21:56:37Z"}, {"professor": "Wei-Ping Li", "course": "JOUR150", "review": "Professor Li, was the best teacher. She is very understanding and cares for her students. You can tell she is very knowledgable about the topic. The class was not hard as long as you show up and read the textbook. Each week there would be a 5 question quiz and then she would lecture. I would highly recommend this class even if you are not a journalism major. ", "rating": 5, "expected_grade": "A", "created": "2022-01-18T18:14:05Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "I love him and this class but I wish we had more things to bring our grade up because I got a B on one test and now I might not be able to get an A unless I do really well on the final.", "rating": 4, "expected_grade": "A-", "created": "2022-05-03T14:43:21Z"}, {"professor": "Denitsa Yotova", "course": "JOUR150", "review": "so unhelpful in emails and assignments take hours to complete. also way too strict of a grader for no reason. i wrote 2 pages for an assignment and answered all of the questions and still got so many points taken off that drastically dropped my grade", "rating": 1, "expected_grade": "", "created": "2022-12-01T20:23:09.566568Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "Really sweet guy and an overall pretty interesting class. There are 3 exams that make up 89% of your grade and the rest is participation (coming to class). Exams are fair and you get a study guide for each exam and if you put the terms in a quizlet and get those down you should be able to get an A. It kind of sucked that such a large part of your grade are exams but it is nice not having to worry about this class (besides showing up) other then exam weeks.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T03:59:51.747251Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "Very nice and understanding professor, 3 exams total and those are the only grades so if you don't do that great you can't really bring it up", "rating": 5, "expected_grade": "B", "created": "2022-12-10T19:52:04.608573Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "Professor Alwood is fantastic! This semester, he did however only have the class be based on 89% exams, 10% participation, and 1% syllabus quiz. It was stressful only having these things to go off of, so unless he changes the structure, this is what you might expect! Not sure if it was just some experimental way to run the class or how he wants to continue it, but I just wanted to let that be known. He is very knowledgeable in this subject matter, and his lectures are usually engaging and relevant. Just be sure to take good notes and attend every session, as in my experience, lectures are not recorded. You will also need to get a textbook for this class, but the reading isn't too dense, so just a nice skim would do. Overall, I had a good experience in this class and would recommend Prof. Alwood! He very much cares about the class and what he does and it shows.", "rating": 4, "expected_grade": "A", "created": "2022-12-13T05:15:01.500555Z"}, {"professor": "Md Haque", "course": "JOUR150", "review": "This is an extremely easy A, if you need a GenEd. He is a very easy grader, but the class is extremely boring and so is he. He just lectures the whole time off of the slides. There is a group presentation, individual presentation, final project, media journals, and quizzes; that's it. Quizzes are also very easy and based off the lecture slides. TBH there is no reason to really go to class because the slides are posted online and he does not take attendance. Also, there are no assignments that you need the lecture slides for except the quizzes.", "rating": 2, "expected_grade": "A+", "created": "2022-12-16T01:46:22.686790Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "Prof. Alwood is extremely kind and teaches the course very well. His lectures are engaging and he provides great perspective from his time as a former reporter. The workload for this course is extremely minimal, there is a \"required\" textbook but everything you need to know for the tests will be covered in class. I never read the textbook and still had an easy time. He is strict in his rule against using phones in the classroom, but the lectures are interesting enough to give your full attention to. I would absolutely recommend him and this course to anyone looking for an easy gen ed!", "rating": 5, "expected_grade": "A+", "created": "2022-12-17T05:06:37.905747Z"}, {"professor": "Wei-Ping Li", "course": "JOUR150", "review": "SWEETEST PERSON EVER!! This class is so fun and is my favorite class this semester!! Dr.Li is so kind and sweet, and the class is so interesting and chill!", "rating": 5, "expected_grade": "A+", "created": "2023-02-27T16:22:37.770865Z"}, {"professor": "Denitsa Yotova", "course": "JOUR150", "review": "Incredibly unhelpful when reached out to, as she would often not respond. A very strict grader. The course material and assignments were generally interesting, but this class was ruined for me by the vague directions and lack of communication. I am glad that I took it online and was able to get my three credits, but the only thing I gained was more experience in web design, but I wish I just did that on my own time rather than waste my money on JOUR150. Maybe with a different instructor it would be different, but I do not recommend this combination.", "rating": 1, "expected_grade": "B+", "created": "2023-03-13T14:46:03.263394Z"}, {"professor": "Wei-Ping Li", "course": "JOUR150", "review": "This class is so chill. There are weekly quizzes but she gives you the prompt questions beforehand and you can find most of the answers online too. Besides the quizzes, there's no work except for a reflection at the end of each week. You just write down 3 things you learned and it's due Sunday so plenty of time. There are 4 responses across the semester which are like mini-essays and then there's a final project. You can choose to work in a group or on your own. Great class if you're loaded with others and need a class to do work during lol. Overall really easy and if you're into journalism this is great. Definitely recommend!!", "rating": 5, "expected_grade": "A+", "created": "2023-05-02T19:02:52.584650Z"}, {"professor": "Denitsa Yotova", "course": "JOUR150", "review": "she is such a hard grader and seems to have some passive agressiveness. I would not recommend at all. the final project is just overkill as well especially since its a group project. she takes off points for the most outrageous things.", "rating": 1, "expected_grade": "A", "created": "2023-11-09T23:01:04.273547Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "This class is very well taught and the Professor knows what he's talking about. He's picky about attendance, but only because handfuls of people never show up and expect to do well. If you attend regularly and pay attention in class, this can be a free A just by studying for the three tests (which make up your whole grade in the class aside from participation). Take this if you need an easy gen ed", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T20:31:13.763286Z"}, {"professor": "Edward Alwood", "course": "JOUR150", "review": "Prof. Alwood genuinely wants the best for all of his students, and clearly has the experience to be teaching this class. He definitely is a little old school (ex. no electronics), and his lectures were not always the most engaging. Additionally, there are only 3 tests that are worth 90% of your grade so you really have to make sure you are attending class and paying attention. But he is a super nice guy and the content isn't super hard to remember. I would recommend if you need a gen-ed", "rating": 4, "expected_grade": "A-", "created": "2023-12-15T20:36:06.541294Z"}, {"professor": "Sara Browning", "course": "JOUR150", "review": "Easyyyy class, no midterm or final exam (final paper instead). Homework is easy, the essays got tad annoying but they're only two pages, and she well prepares you for quizzes. Also responds to emails pretty quick.\r\nThe graded assignments consist of...\r\n1) reporting on a current event each class (literally about anything you find interesting, music, celebrity drama, inventions, global issues) but its brief I usually just prepare a few bullet points, and you won't have this assignment on a quiz day or day an essay is due. also this is a part of your discussion points.\r\n2) discussion questions on each chapter assigned from the textbook. these are only graded for completion because they're the same questions on the quizzes, and she posts the lecture slides so you can use them to help answer. I used to read some of the chapters because they were interesting, but it's definitely skimmable. \r\n3) three chapter quizzes, usually covering information from 4 chapters in the textbook. on review day we play a fun game where the class is divided into two teams and basically just answer review questions (the same questions on the test), no prize but good review.\r\n4) five media journals-- these are just two page essays about a specific media (ie: newspapers, music, social media). they're easy to knock out in a few hours if you don't mind writing, and they don't really require much, if any, research, since usually they are related to you in some way. on the day the essay is due, people volunteer to read their paper for discussion points (I never volunteered but still got an A for discussion points).\r\n5) the final paper-- 8-10 pages about a specific converged media. I felt like I was kind of rambling and the paper could have been shorter with the given topic, but you can start early if you want because she posts it and introduces it early-mid-semester.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T22:19:11.611458Z"}, {"professor": "Sara Browning", "course": "JOUR150", "review": "This is a really easy class. The class is pretty boring and the lectures are kind of pointless as you have to read the textbook to answer the homework questions but the quizzes are really easy and the final project is also very easy.", "rating": 5, "expected_grade": "A+", "created": "2024-03-12T00:29:53.216135Z"}, {"professor": "Ho Chun Wong", "course": "JOUR150", "review": "A kind professor, but this class really is a lot of work. Keep in mind do not use AI when taking any of his classes as he stresses that he is very perceptive in viewing suspicious words that sound AI generated. The tests are closed book, and he offers extensions if you have dire circumstances. But be warned, there is quite a lot of reading and answering the prompt correctly is absolutely required. Blog posts also are time consuming and I did not exactly enjoy building a website and creating new pages.", "rating": 3, "expected_grade": "B+", "created": "2024-03-21T21:26:02.915986Z"}], "department": "JOUR", "course_number": "150", "name": "JOUR150", "title": "Introduction to Mass Communication", "credits": 3, "description": "<b>Additional information:</b> Not applicable toward journalism major.\nSurvey of the functions and effects of the mass media in the United States. A consumer's introduction to newspapers, television, radio, film, sound recording, books, magazines, and new media technology.", "is_recent": true, "geneds": null}