{"average_gpa": 3.5572413793103452, "professors": ["Christopher Hanson", "Christopher Hanson", "Christopher Hanson", "Christopher Hanson", "Christopher Hanson", "Christopher Hanson", "Christopher Hanson"], "reviews": [{"professor": "Christopher Hanson", "course": "JOUR283", "review": "Great Professor with tons of experience surrounding the topics of journalism, war, and politics. The class was very laid back and was spent conducting discussions and going over very interesting topics. The powerpoints that Professor Hanson presented contained very insightful videos and explanations of historic events. The class consistently ended early and rarely required take home readings. There are only a few quizzes all semester that are open note and he will go over any questions you have surrounding the quiz. Professor Hanson has a genuine passion for the content he's teaching and makes the class easy so long as you participate. I highly encourage anyone with an interest in this topic to take this class.", "rating": 5, "expected_grade": "A", "created": "2022-05-20T17:15:40Z"}, {"professor": "Christopher Hanson", "course": "JOUR283", "review": "Professor Hanson is very knowledgable in his area of teaching and often gave personal stories from both his time as a reporter and his families' experiences while fighting in the wars covered. He's quite unorganized with the ELMS page and can take quite a long time to grade but the class is interesting. If you go to the classes and look at the powerpoints it's pretty easy to get a good grade. He values participation in classes and started taking attendance towards the end of the semester even though he said he wouldn't so I'd recommend actually going to his classes if you take it.", "rating": 4, "expected_grade": "A", "created": "2023-05-18T03:16:24.408916Z"}, {"professor": "Christopher Hanson", "course": "JOUR283", "review": "Very easy class and a cool professor. Guy knows a lot about everything it seems. All closed note quizes that are somewhat common sense if you look over powerpoints the night before. Assigned us readings but I never did a single one. Stopped going to class three weeks in and just looked at sylabus for quiz dates. Classes that I went to ended early. Overall, cool dude who even gave extra credit at the end.", "rating": 5, "expected_grade": "A", "created": "2023-12-18T05:39:42.135013Z"}, {"professor": "Christopher Hanson", "course": "JOUR283", "review": "Professor Hanson is a very knowledgeable professor with lots of experience with war journalism. The class was very interesting and focused on both history and journalism principles in the context of war. There were only a few readings for homework and the class wasn’t very time consuming. The only assignments were 4 quizzes, a midterm, and the final exam. The quizzes and tests weren't too difficult, as long as you spend some time to study for them. I would recommend taking this class if you need a humanities credit or are simply interested in the subject.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T16:19:18.761411Z"}, {"professor": "Christopher Hanson", "course": "JOUR283", "review": "This was a super interesting class if you are into different wars and the coverage of war in the media. Chris Hanson is a sweet professor who is super knowledgeable about the subject. Overall this class is composed of almost entirely multiple-choice exams with very little writing, however, these quizzes and exams make up the the entirety of your grade. He did provide extra credit assignments at the end of the semester for those who needed it and worked with students to try and help them achieve a good grade. His exams can be quite confusing at times and you have to attend class because he will test you on things he discusses in lecture. Overall an interesting class, but you will spend some time completing readings and will have to pay attention is lecture.", "rating": 4, "expected_grade": "A+", "created": "2023-12-19T19:29:22.414327Z"}], "department": "JOUR", "course_number": "283", "name": "JOUR283", "title": "Probing War: Investigative Narratives and American Conflicts", "credits": 3, "description": "<b>Credit only granted for:</b> JOUR283 or JOUR289J.\n<b>Formerly:</b> JOUR289J.\nStudents will explore the realities of war through the work of journalists who pushed beyond the daily headlines, some risking life and limb, to challenge official versions and document uncomfortable realities about American conflicts.", "is_recent": true, "geneds": null}