{"average_gpa": 2.7735973597359735, "professors": ["Adi Mahalel", "Chen Edrei", "Agnieszka Legutko", "Noah Fabricant", "Adi Mahalel", "Adi Mahalel"], "reviews": [{"professor": "Sheila Jelen", "course": "JWST272", "review": "Lots of reading, fair grader, make sure to participate because it can help you a lot.", "rating": 5, "expected_grade": "B+", "created": "2008-06-09T14:56:00Z"}, {"professor": "Adi Mahalel", "course": "JWST272", "review": "If you are looking for a teacher who treats their class as if it is life-saving material and you are a Ph.D. student, this is your guy.", "rating": 1, "expected_grade": "C-", "created": "2021-12-20T21:23:02Z"}, {"professor": "Adi Mahalel", "course": "JWST272", "review": "I don't know why his reviews are so bad. Class was interesting and not too hard, yes there were lots of long readings but as long as you skimmed the material and chimed into conversation at least once a class it was fine. There are 2 short reflection essays and 2 papers with no exams or homework outside of the reading. Overall an interesting course and a pretty understanding guy. Definitely give it shot if the course material interests you and don't let these reviews make you turn away.", "rating": 5, "expected_grade": "A", "created": "2023-01-29T04:20:32.478598Z"}], "department": "JWST", "course_number": "272", "name": "JWST272", "title": "Diversify and Multiply: Jewish Culture and the Production of an Identity", "credits": 3, "description": "<b>Cross-listed with:</b> CMLT242, ISRL249G.\n<b>Credit only granted for:</b> JWST272, CMLT242, or ISRL249G.\nProvides students with a unique exploration of cultural products produced by a diverse array of Jewish creators of literature, comedy and film. The texts, films, and performing arts touch on the central social, economic, and cultural issues of Jews during the ages, and up to the 21st century. This course will explore Jewish creativity throughout history, as well as the Jewish encounter with modernity as a whole. We will be diving into prominent creators such as Tiffany Haddish, Larry David, Sholem Aleichem, Adam Sandler, S. Y. Abramovitsch, Judd Apatow, Philip Roth, Amy Schumer, I. B. Singer, Ben Stiller, Franz Kafka, Dan Levy, and others. Examining their creations will open a window to the diverse methods of construction of modern Jewish identities.", "is_recent": true, "geneds": null}