{"average_gpa": 3.709090909090909, "professors": ["Kwesi Sam", "Noel Kuriakos", "Pamela Scott", "Anastasia Lavrenyuk", "Anastasia Lavrenyuk", "Pamela Scott", "Anastasia Lavrenyuk", "Pamela Scott"], "reviews": [{"professor": "Pamela Scott", "course": "LEAD217", "review": "LOVE PAM!!! Please take this class, she is not only super sweet and understanding about extending deadlines if needed, but she also makes the reading reflections each week easy. No exams which is so nice, and the final project was a breeze as well. Easy grader and you can tell she cares about her students.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T00:42:26.519462Z"}, {"professor": "Anastasia Lavrenyuk", "course": "LEAD217", "review": "Very fair and easygoing professor. Class requires a lot of open group discussions and participation. She does take attendance and creates a participation assignment at the end of the semester, so it's best to show up. I missed 2 classes but still got full credit, probably because I participated a lot in discussions, so I advise being engaged. There are weekly 400-word essays for the chapters that we go over, but it truly is not hard. You'll get an A as long as you reach the word limit and turn it in. We had discussion boards the first 3 or 4 weeks of class but then she stopped them, I'm not sure why. There are 2 major group projects (one presentation and one essay, the essay you can choose to do alone). Our final was a 3-4 page essay. There are no exams or quizzes. A very stress-relieving class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T00:26:09.139992Z"}, {"professor": "Pamela Scott", "course": "LEAD217", "review": "Pam is the best! Incredibly kind and understanding. Will extend deadlines if necessary. Not too much homework. Class with her is super fun and stress-free (and I still learned a lot from this course). Would recommend.", "rating": 5, "expected_grade": "A", "created": "2024-03-25T20:15:49.419757Z"}], "department": "LEAD", "course_number": "217", "name": "LEAD217", "title": "Introduction to Leadership", "credits": 3, "description": "Surveys the study and practice of leadership and provides students with a variety of experiences to wrestle with large leadership questions. What is leadership? Who can be a leader? How is leadership an important aspect of understanding self and others? Students will explore and respond to these questions through a variety of leadership theories and models, self-assessments, critical reflection, active-learning, group projects, and research. The course will introduce students to critical theory and critical perspectives of leadership to help students broaden their perspectives on leadership and develop more complex thought and practice of leadership.", "is_recent": true, "geneds": null}