{"average_gpa": 2.7792182792099096, "professors": ["Archana Khurana", "Hilaf Hasson", "Heyrim Cho", "Timothy Pilachowski", "Tobias von Petersdorff", "Sarah Yeakel", "Bradford Sanders", "Terence Long", "Scott Wolpert", "Daniel Kaufman", "Franck Olivier Ndjakou Njeunje", "Jeremiah Emidih", "Ben Bezejouh", "Lawrence Washington", "Samuel Bloom", "Pratima Hebbar", "Thibaut Castan", "Rufus Elemo", "Kendall Williams", "Mestiyage Gunatilleka", "Priyankur Chaudhuri", "Agnieszka Zelerowicz", "Jack Baker", "Ramon Braza", "Stefan Doboszczak", "Yordanka Kovacheva", "Adam Kanigowski", "Samuel Braunfeld", "Dani Kaufman", "Arghya Sadhukhan", "Melanka Wedige", "Eoin Mackall", "John Quah", "Shuhan Kou", "Haeyun Seo", "Raymond Schram", "Xiaoqi Huang", "Archana Khurana", "Archana Khurana", "James Conway", "Jason Schultz", "Mestiyage Gunatilleka", "Hannah Hoganson", "Mestiyage Gunatilleka", "Mickael Latocca", "Arghya Sadhukhan", "Brendan Gramp", "Kayla Davie", "Maeve Wildes", "James Conway", "Adam Kanigowski", "Archana Khurana", "Peter Dillery", "Jason Schultz", "Jenna Zomback", "Jenna Zomback", "Mestiyage Gunatilleka", "Archana Khurana", "Mestiyage Gunatilleka"], "reviews": [{"professor": "Heyrim Cho", "course": "MATH120", "review": "Honestly she was a good person, and knew the subject, but was not good at teaching it. She left the class confused at many occasions. She also relied on MyMathLab for homework which gave us so many issues. I think I only did well because we had a good TA who helped us out whenever we were confused during discussions. ", "rating": 2, "expected_grade": "A", "created": "2017-12-14T04:46:19Z"}, {"professor": "Tobias von Petersdorff", "course": "MATH120", "review": "Try to take somebody else. His lectures are messy and make no sense, and the tests include material that hasn't been covered before. Tests are also very long, as almost everybody would be working till the end. Don't take him.", "rating": 2, "expected_grade": "B", "created": "2018-01-26T15:35:11Z"}, {"professor": "Hilaf Hasson", "course": "MATH120", "review": "Good math teachers are hard to find, and Hilaf is definitely up there as one of the best math teachers I've had. He sometimes goes a little off topic during lecture, but he's genuinely a good guy who can be very helpful. He makes sure to always address students' questions during lecture and explains it until they fully understand. Lectures are sometimes boring, but that's coming from someone who has never enjoyed math.", "rating": 4, "expected_grade": "A", "created": "2018-05-22T21:18:02Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Tim is the ABSOLUTE worst teacher I have ever had the displeasure of having. He is  the most rude and bitter man I have ever encountered. DURING our “review” he wouldn’t even turn the light off when a student nicely asked him too because nobody could actually SEE HIS notes for the exam. I put “review” in quotations because his idea of a review is not at all helpful in preparing for the exam. He refuses to give you the answers to the worksheet he hands out. You’ll spend the whole class trying to figure out the answers and he will not answer any questions. \r\nHe teaches calc on a PowerPoint which has proven to be the LEAST EFFECTIVE way to do this. Don’t bother trying to write anything down because you won’t have time & if you do you won’t be able to pay attention to how you actually do it. Although he does a terrible job of explaining the information anyway. \r\nIf you have the great misfortune of having him as your teacher you will have to listen to him go over stupid class rules nearly every class. ONE time he even spent 20 minutes in the beginning of class going over “bike safety”. Nobody else in the class understood why he was doing this or what was going on. However I knew exactly what happened because the day before I saw him screaming at some kid riding his bike because he almost got hit by him. So basically he wasted all of our time because of his own personal issues. He is the worst. \r\nThe TA’S even admit he makes exams 10x harder then necessary. My TA told my class that for teachers like Tim who make the exams harder than the worksheets and homework he gives you, you should research online other schools and their coursework to try and learn the information. Because it’s my job to teach myself right?! \r\nIf you take this class this will 100% be the case. Guaranteed you’ll be teaching yourself all of the information. If you have absolutely no background in calc then you are extremely screwed for his class. \r\nThere are also no curves in his class even though so many people argue how unfair his tests are. ALSO, his advice to go look at passed exams will not help you in the slightest. He claims that they are similar to the exams, but they’re not at all. \r\nI learned more WHEN THE TA sub’d for him for a day and actually wrote and explained the information on the board, then during the whole semester with him teaching. \r\nAnother thing is that you’ll have lecture quizzes all the time in this class. He says they’re only once a week but a lot of times they’re twice a week. If you leave lecture even 10 min early there’s a good chance you’ll miss one because sometimes he’ll give them in the last 5 min of class!! \r\nThere is also SO MUCH HW.. at least 5 assignments with 10-15 problems each w likelihood of having a-e parts as well due every week. \r\nIt is clear that he doesn’t understand the concept of actually teaching. I highly recommend you look elsewhere for teachers because unless you are amazing at calc you will spend the the full semester trying to learn on your own.\r\n 1 star is an overstatement for this man, he deserves 0. \r\n", "rating": 1, "expected_grade": "B-", "created": "2019-04-10T03:53:23Z"}, {"professor": "Ramon Braza", "course": "MATH120", "review": "A horrible teacher. Teaches with PowerPoints and goes soooo fast", "rating": 1, "expected_grade": "B-", "created": "2019-10-12T21:48:45Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "Dr. Washington has been the best math professor I've had so far here! He does an awesome job of explaining the material during lecture. That being said, as long as you come to class and take notes (as well as study on your own time) then you should pass this course.", "rating": 5, "expected_grade": "", "created": "2019-11-21T02:23:49Z"}, {"professor": "Jack Baker", "course": "MATH120", "review": "Very nice guy! he is very sweet and caring. the guy tries to make the class interesting but we all know math in general isn't the most entertaining class. Jack doesnt explain to great but learning on your own isn't too bad!", "rating": 4, "expected_grade": "B-", "created": "2019-12-06T00:40:47Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "Best teacher I’ve EVER had for math. I don’t ever leave reviews but I actually adored and loved his teaching style and passion! Amazing person and teacher inside and out ", "rating": 5, "expected_grade": "A", "created": "2019-12-07T02:05:15Z"}, {"professor": "Agnieszka Zelerowicz", "course": "MATH120", "review": "Doesn't know how to teach, really bad at communicating, 14 pop quizzes throughout the semester.", "rating": 2, "expected_grade": "A", "created": "2019-12-10T09:59:10Z"}, {"professor": "Agnieszka Zelerowicz", "course": "MATH120", "review": "Does not teach what so ever. I dont think i learned anything in this class. Please take anyone other than her. She doesn't even know what she will be teaching when she comes to class. She just opens up the powerpoint. Doesn't slow done or take any questions in class. ", "rating": 1, "expected_grade": "F", "created": "2019-12-10T23:13:28Z"}, {"professor": "Kendall Williams", "course": "MATH120", "review": "As a person he is very friendly and makes an effort to make his lectures engaging. However, when he explains concepts he just writes the definitions word for word on the board, its quite excessive. Then he jumps straight into practice problems without really explaining them enough. For people who have a strong background in math you shouldn't have a problem, but if you're entering one of his courses where you have little foundation in before then I really wouldn't take his class because he can make things more confusing than they have to be. His tests are also confusing in the way he words some questions and he will add things on the test that he briefly mentions for a second in lectures.", "rating": 2, "expected_grade": "", "created": "2019-12-15T01:18:25Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "Amazing professor, the best math teacher I've ever had. He really cares about his students and teaches everything in a way that's easy to understand.", "rating": 5, "expected_grade": "A-", "created": "2019-12-17T19:31:41Z"}, {"professor": "Agnieszka Zelerowicz", "course": "MATH120", "review": "the worst professor I've ever had. Completely unprepared for class and I don't think she even understood the content she was teaching. You have to teach the content to yourself.  It required me to put in a star but I really give her zero stars. ", "rating": 1, "expected_grade": "D", "created": "2020-01-21T18:46:25Z"}, {"professor": "Ben Bezejouh", "course": "MATH120", "review": "He is very poor when it comes to explaining concepts and often times is unwilling to answer questions.  The few times he does answer, the response is brief and doesn't even resolve the problem.  I took math 120 with him and found that it was much more of a review class due to his poor teaching skills and since I had not taken math 120 previously, I found myself struggling to understand the material.  Do not take the class with him there are many other better professors.", "rating": 1, "expected_grade": "D+", "created": "2020-01-21T21:10:35Z"}, {"professor": "Yordanka Kovacheva", "course": "MATH120", "review": "She is thorough but scatterbrained and hard to follow. Very unorganized. Utilizes the most difficult way to solve problems and does not project. Switched out before the end of the d drop add period.", "rating": 2, "expected_grade": "", "created": "2020-01-29T18:06:12Z"}, {"professor": "Stefan Doboszczak", "course": "MATH120", "review": "Best MATH120 professor!! He explains things clearly and he's a very fair grader. I think doing well in his class is very easy if you study and go to the discussions. ", "rating": 5, "expected_grade": "", "created": "2020-04-25T00:27:04Z"}, {"professor": "Daniel Kaufman", "course": "MATH120", "review": "Taught well. Some exam problems were harder than others because we hadn't exactly covered that type of question but could normally at least get half credit on those\r\n", "rating": 5, "expected_grade": "B", "created": "2020-05-16T22:57:48Z"}, {"professor": "Yordanka Kovacheva", "course": "MATH120", "review": "Don't take if you can help it. Yordanka is difficult to understand, teaches very quickly, and isn't receptive to student concerns. She makes things more difficult than they have to be, and her exams and discussion worksheets are harder than the other professors. Avoid at all costs if you value your sanity. ", "rating": 1, "expected_grade": "P", "created": "2020-05-17T17:33:07Z"}, {"professor": "Stefan Doboszczak", "course": "MATH120", "review": "Lectures can be a bit boring but he does a good job in explaining concepts and answering questions. There are a lot of homework assignment due (at least 2/week) but he drops 8 of them. The discussion worksheets are group work and he also drops the lowest 4 worksheets.", "rating": 5, "expected_grade": "A", "created": "2020-06-08T19:32:28Z"}, {"professor": "Yordanka Kovacheva", "course": "MATH120", "review": "Difficult to understand, I wouldn't recommend if you have any type of learning disability or something that makes math or understanding people difficult. Her English is bad and she mutters a lot. I also don't recommend for students who are racial minorities. She is a great representation of students paying a lot for college but learning from other sources like Khan Academy or YouTube instead of the professor.", "rating": 1, "expected_grade": "F", "created": "2020-06-16T15:48:10Z"}, {"professor": "Stefan Doboszczak", "course": "MATH120", "review": "He was a great professor and was actually able to teach.", "rating": 5, "expected_grade": "B+", "created": "2020-10-26T02:31:20Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Prof Pilachowski himself seems like a nice person, but the way he teaches and converses with students just doesn’t work for me. Class is all online this semester and attendance isn’t required because he doesn’t do any in-class participation stuff (thank god), so the structure of things is that he has students watch lecture videos he posts on ELMS, then come to the live sessions with any questions. Personally I’m really not a math person, and his lecture videos are usually clear and organized, but the live sessions are just confusing because the way he explains things only complicated things more for a lot of students. In addition, he is TERRIBLE at responding to emails. It takes him weeks, and his office hours are by appointment this semester, so the only way to contact him is email, even just to set up an office hour appointment. He will drop a few low-scored homework and discussion worksheets at the end of the semester, which is a godsend because there are a lot of worksheets, and Prof Pilachowski never gives extensions on anything (deadlines are pre-set and definite). Overall, he knows his stuff, but tends to be very unhelpful with accommodating his student’s needs (where I’m coming from on this is I have accommodations, and it was incredibly and unreasonably difficult to meet with him to get that all sorted out).", "rating": 3, "expected_grade": "C", "created": "2020-11-18T19:17:51Z"}, {"professor": "John Quah", "course": "MATH120", "review": "Professor Quah was terrible. I've talked to many people in my class and basically everyone had no idea what was going on. Any break out room I joined NO ONE had any clue what was going on. On the first exam the average was a 75 and the second exam's average was a 65 and he didn't curve either which led me to drop the class. It was insanely difficult to pay attention in his class. If you see John Quah on your schedule I advise you to drop that class IMMEDIATELY! Literally, take any other professor. He seems like a nice guy but a really bad professor.", "rating": 1, "expected_grade": "C", "created": "2020-12-03T19:06:23Z"}, {"professor": "John Quah", "course": "MATH120", "review": "He's a really nice guy, but an extremely confusing and BORING professor. I'd taken calc in high school and expected this class to be a review, but I found myself more confused than ever. He goes over things too fast and doesn't explain clearly at all. He can also be passive aggressive.", "rating": 1, "expected_grade": "A-", "created": "2020-12-04T21:29:33Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "Absolute legend if math isn't for you. If you took BC calc in high school you'll be fine. If you didn't, he goes out of his way to answer any and every student question and goes over the same concept 100 times until there's no more questions on it. Very nice guy and exams have been slight.", "rating": 5, "expected_grade": "A", "created": "2020-12-08T15:38:00Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "Dr. Washington is a fantastic professor. He's patient, will go at your speed, and is very understanding. Truly a gem! 10/10 recommend. ", "rating": 5, "expected_grade": "A+", "created": "2020-12-09T02:51:23Z"}, {"professor": "John Quah", "course": "MATH120", "review": "He's a really really nice guy, but super confusing with his lectures. I had never taken calc before this class and he expected everyone in an elementary calc class to know what he was teaching before he taught it. His lectures often made you more confused and he did examples without even teaching the content. His exams are very different from the study guides and he doesn't curve anything. He put us in breakout rooms pretty often and no one ever knew what was going on. I ended up teaching myself the content through MyMathLab. Overall, would not recommend taking the class with this professor.", "rating": 1, "expected_grade": "B-", "created": "2020-12-10T16:24:05Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "Prof Washington is the most caring and kind professor definitely recommend. The only difficult part of the class was...calculus lol. (Im not a math person) If you follow along in lecture and take notes you should be ok. He doesn't trying to make exams difficult....usually straightforward.", "rating": 5, "expected_grade": "B", "created": "2020-12-10T18:32:57Z"}, {"professor": "Ben Bezejouh", "course": "MATH120", "review": "overall nice professor, but when it comes to giving feedback on quizzes, or tests, or asking to further explain what you got wrong he won't give help. exams throughout the semester are weighted as more to your grade than the final. more preparation before hand in class would be preferred to ace the exams", "rating": 3, "expected_grade": "", "created": "2020-12-18T23:05:39Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "BEST PROFESSOR EVER!!! As long as you go to lecture, understand his notes, and do the review questions before the exams, you should get an A every test and most even close to 100!!. He also counts an 80% on homework and worksheets as 100%. you have to go to the lectures because there are clicker questions that count towards your grade but his lecture is interesting. Overall, best professor I had this semester as a freshman!!", "rating": 5, "expected_grade": "A", "created": "2020-12-31T16:47:43Z"}, {"professor": "John Quah", "course": "MATH120", "review": "Do not take a class with this professor. I took AP calc AB in hige school and expected this class to be easy. This class was very confusing and difficult. His lectures are very boring and he does not teach content, he just does some problems or goes off on tangents that make no sense. I often never payed attention to lectures because what he was saying did not apply to the homework or exams. I did very well in MyMathLab, homework was very easy and did not prepare you for his exams. His exams are extremely difficult!! He gives problems containing calculus he never taught us. He has a theory that the best, smartest students should get 65% on his tests because “the best” basketball players shoot 2/3 of their baskets. Do not take this class. It will fuck you over. I would give him zero stars ", "rating": 1, "expected_grade": "C", "created": "2021-01-19T01:32:56Z"}, {"professor": "Samuel Braunfeld", "course": "MATH120", "review": "Amazing professor. Highly recommended if you need to take Math120. The most accommodating professor during covid and actually thought so well. Nice grader, drops two lowest homework!", "rating": 5, "expected_grade": "A+", "created": "2021-04-29T15:29:29Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "He is the best professor in the world!! if you review the review sheets before the exam, you should get an A on every exam! he explains everything extremely clearly and is just a super sweet guy", "rating": 5, "expected_grade": "A+", "created": "2021-05-03T20:37:53Z"}, {"professor": "Samuel Braunfeld", "course": "MATH120", "review": "I was really nervous to take math120 since I had never taken a calc before. Prof Braunfeld made it super easy to understand and truly changed my viewpoint on math. He is a great professor and his lectures perfectly explain how to do everything. The workload is not bad at all and he made the class all asych so it was super easy to stay on track. Take his if you have the option!! By far one of the best math teachers I have ever had. ", "rating": 5, "expected_grade": "A", "created": "2021-05-04T14:46:24Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "I do not usually consider myself a math person. I got 100% on the final exam. \r\nI really think it’s due to the way he taught the class. He made the textbook, which is super simple, easy to read, and has just enough information and examples to teach off of without being overwhelming. His lectures are concise yet comprehensive, and he is open to all questions. He does have some mandatory “clicker” questions to answer during most lecture sections, but they are usually very easy. Other than that, most of your grades come from worksheets and practice problems, which can be discussed with a TA and are usually fairly straightforward.  Exams are fair, and if you do the work and a little studying you’ll do well. (not one exam had a class mean of under 87%) Grading policy is very lenient, difficult to explain shortly but he basically drops a section of scores you did poorly on, whether it be a bombed exam or missing worksheets or something similar (or if you just want to skip all the clicker questions)\r\nHIGHLY recommend this professor.", "rating": 5, "expected_grade": "A+", "created": "2021-05-13T19:50:44Z"}, {"professor": "Eoin Mackall", "course": "MATH120", "review": "Super chill professor. He does a great job contextualizing what you learn in class. Sometimes he goes super in depth and it ends up sounding like mumbo jumbo. Midterms, homework, and the final were fair. He also responds to emails really fast, so don't be afraid to ask him for help/extensions. ", "rating": 5, "expected_grade": "A+", "created": "2021-06-02T01:20:10Z"}, {"professor": "Eoin Mackall", "course": "MATH120", "review": "Eoin was a good professor, not the best but far from the worst. he does have a habit of spending the majority of class explain the logic behind problems which I personally didn't enjoy but some did. I learned better at reading straight from the book, but he is very accommodating with his exams. ", "rating": 4, "expected_grade": "B", "created": "2021-06-17T16:53:25Z"}, {"professor": "Franck Olivier Ndjakou Njeunje", "course": "MATH120", "review": "He is the best teacher I have. The guy is hilarious and his grading is fair. I would honestly recommending dropping out of any other Math Class just to take MATH120 with him. ", "rating": 5, "expected_grade": "A", "created": "2021-10-01T00:20:32Z"}, {"professor": "Raymond Schram", "course": "MATH120", "review": "Raymond makes me cry but ig he's an alright dude u have to put in effort but the exams aren't bad I don't think calc is hard it's just a lot of busywork assignments I don't think I vibe w his teaching style ", "rating": 4, "expected_grade": "A+", "created": "2021-11-10T03:56:15Z"}, {"professor": "Raymond Schram", "course": "MATH120", "review": "Ray is interesting, to say the least.\r\n\r\nHe is very good at math but terrible at teaching it. He makes very simple concepts very complicated. Usually wastes class time doing 2 problems that could've taken 2 mins each. This makes certain concepts very overwhelming and confusing. He assigns way too much homework, usually all due in one day too.\r\n\r\nRay is nice and a character who will make you laugh. He gives practice exams that usually match exam problems.", "rating": 2, "expected_grade": "A", "created": "2021-11-24T03:22:54Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "If you are to take this course and get him as a teacher, don't waste your time going to the lectures. Watch them online as he tends to ramble in class and I got much more use out of watching the lecture videos online then being in class", "rating": 3, "expected_grade": "A", "created": "2021-11-29T23:38:53Z"}, {"professor": "Raymond Schram", "course": "MATH120", "review": "Professor takes 30 minutes to complete a 2 minute problem. Sometimes he doesn't even finish the problem, and assumes we know how to do it. He is very unorganized and hard to follow. Sometimes he stops to tell an incredibly awkward joke instead of completing the problem. This class was not meant to be hard but he made it that way. Most of what I learned came from the TA's in review sessions, or my textbook.", "rating": 1, "expected_grade": "A", "created": "2021-11-30T23:02:24Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "I am definitely not a math person and usually struggle within any math class I take, however, I barely struggled in this course.  He is an excellent teacher and explains everything very clearly.  He is super approachable and easygoing.  He makes the hour and fifteen-minute lectures actually entertaining and easy to listen to. Most of your grades come from the quizzes every week and 3 exams, which are only 3 questions and based on the homework and algebra review questions (which he gives you at the beginning of the course).  He also drops the lowest 2 quiz grades at the end of the semester.  I HIGHLY recommend that if you decide to take a math class you have him as a professor. ", "rating": 5, "expected_grade": "", "created": "2021-12-01T01:46:59Z"}, {"professor": "Raymond Schram", "course": "MATH120", "review": "Avoid at all costs. I swear he has never taught an in-person class before fall 2021. It felt really unorganized where he was weirdly a nervous wreck and would start something then jump to another problem because it go too complicated. I had to go up after class an correct an arithmetic mistake he just glossed over. The TA during discussion taught me more once a week than he ever did. The midterms were mostly easy but the homework will sometimes go over something you've never heard of before. He really needs to get his shit together.", "rating": 1, "expected_grade": "", "created": "2021-12-06T17:48:26Z"}, {"professor": "John Quah", "course": "MATH120", "review": "Horrible teacher. The exams are really not like his notes at all and his notes are just extremely confusing. He explains things in ways that are just way too complicated and so much longer than they need to be. He never directly answers a question and instead just makes me more confused. He doesn't really care if you understand the concepts and goes waaay to fast for me. A lot of my classmates feel the same way. People in my class tell me they took Calc 1 before but some had to even drop because this guy makes no sense. From just taking Pre Calc in high school to this was extremely difficult. Avoid at all costs ", "rating": 1, "expected_grade": "", "created": "2021-12-09T16:06:52Z"}, {"professor": "Ben Bezejouh", "course": "MATH120", "review": "Completely unprofessional, rude, confrontational, and refuses to help his students even when they ask for help. In this week before the final exam, the majority of the class is failing and he has ignored our requests for review content. The only good thing I can think of is that he doesn't write or grade the final exam. Do not take this class with this professor, because it is easily the worst mistake I have made in my college career thus far. I have nothing but bad things to say about the professor and the class.", "rating": 1, "expected_grade": "", "created": "2021-12-09T20:52:02Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "Professor Washington is the best professor at UMD. Periodt. He is the most caring and patient professor. He encourages students to ask questions and never makes anyone feel dumb for not knowing something. He will happily go over the problem until everyone gets it. He is approachable outside of class and responds to emails within a couple of hours. His exams are reasonable and he never tries to trick anyone. His lectures are clear and concise and don't try to overwhelm you. I would be a math major if he taught every math class. Bottom line is, if you have the opportunity to take him, do it. You won't regret it. ", "rating": 5, "expected_grade": "A", "created": "2021-12-15T21:15:30Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "Amazing professor! Lectures are very easy to understand and engaging despite it being 1 hour and 15 minutes of calculus. Professor Washington always makes sure students are really understanding the material and can apply it rather than just memorizing formulas. Homeworks will probably be the hardest assignment you will get but they help immensely on quizzes and exams so I'd definitely keep up with them if you can. Plus, they don't take that long overall. Also, if you review past exams before the final you should do well as the formatting is basically the same and he writes it! Overall, a great guy. Take Math120 with him.", "rating": 5, "expected_grade": "A+", "created": "2021-12-16T16:30:11Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "Great professor, explains things well.  Lectures are easy to understand.", "rating": 5, "expected_grade": "A", "created": "2021-12-20T20:17:14Z"}, {"professor": "Franck Olivier Ndjakou Njeunje", "course": "MATH120", "review": "He keeps on shutting down people who have questions to \"easy answers\" and this made me not want to ask questions in this class. Also we had to teach ourself the material from mymathlab. I asked 5 people with an A in this class how do they understand the material. They all similarly said the same thing saying , the \"view and example\" or the \"help me solve this\" feature, thought them the material more than this teacher did. So take that as u want. This guy is a good guy but an okay teacher at best. Just remember to do ur homework and understand it completely. I recommend staying 2 sections ahead. Go to office hours, go to tutoring, and make use of the orgo chemist tutor on YouTube. He saved me lol.", "rating": 2, "expected_grade": "B-", "created": "2021-12-21T14:53:42Z"}, {"professor": "Franck Olivier Ndjakou Njeunje", "course": "MATH120", "review": "I did not like to raise my hand to ask questions because this guy would also shoot down other people who would ask \"simple\" questions. In my opinion he just talks than teach, if that makes sense. Most of us did not learn directly in class. We had to use outside resources to help us. On this homework site called mymathlab there was a \"help me solve this feature\" and a \"how to example\" feature. These features practically saved everyone's grade. As they went in depth on how to solve things and how to apply it to other problems. If you want to do good in this class, I recommend staying 2 sections ahead. I also recommend going to office hours and tutoring and finding/making a study group. Make sure you completely understand the homework and use the solving features for in-depth explanations.  Most importantly utilize the ORGO chemistry tutor on YouTube. He saved my grade for sure.", "rating": 2, "expected_grade": "B+", "created": "2021-12-21T16:51:48Z"}, {"professor": "Raymond Schram", "course": "MATH120", "review": "Stay away from this professor. He shows up to class and dont know what's his doing. He gives up wrong answers, that the TA's have to fix them, even students have to correct him. It's honeslty not worth it. \r\n\r\nThis professor suck so bad, you would stop coming to his class because it's useless even going, you mean as while stay home and review on you're own. ", "rating": 1, "expected_grade": "", "created": "2021-12-22T14:54:53Z"}, {"professor": "Raymond Schram", "course": "MATH120", "review": "He was so bad, I want to give him a 0, but that's not possible, so I give him a 1. In all seriousness, Professor Schram cannot teach to save his life and I only really learned from the TA's in discussion.", "rating": 1, "expected_grade": "C-", "created": "2021-12-23T19:06:25Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "People hated this guy and the class, but it really wasn't too bad AS LONG AS you attended all in-person lectures. It sucked, and he goes through the lectures super quick, but if you are sure to take notes the entire time and actually pay attention then you'll be okay. Be sure to do the past practice exams and know all the questions well because the exams are very similar to those. This guy isn't the nicest and he overcomplicates some concepts, but he is pretty generous when it comes to grading. No minuses for any letter grades, but still pluses, and he will round your grade up if you are borderline. He also does not like bike riders.", "rating": 4, "expected_grade": "A+", "created": "2021-12-26T00:46:03Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Fair teacher. Made the reviews about the same or harder than the test so you'll be prepared as long as you do them. Straightforward assignments. I always studied the night before and it worked out alright so if you have to take this class don't freak out. Make sure you understand all the material and if not Archana is always willing to help and is very good at responding to emails", "rating": 4, "expected_grade": "A", "created": "2022-01-14T02:51:33Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "Literally one of the best math teachers I have ever had, if not, the best. Such a caring, thoughtful professor. Very approachable and friendly. Lectures can get boring sometimes but he throws in a few jokes every now and then to keep you interested. He is extremely knowledgeable and a great professor. He takes is time and does his best to make sure everyone understands the concepts. If you do well and work hard on the homeworks/practice exams, you should do great on the exams. He is not out to get you at all and genuinely wants his students to succeed and enjoy math. The final is cumulative, but he gives you a ton of resources to study for it. There are three midterms. Discussion has quizzes but you get a majority of the discussion to go over problems for the quiz and practice. Homeworks are online and help you prepare for the quiz, you also have multiple attempts to get the homework questions right. Responds quickly to emails and posts lectures online to look over if you missed something in class. You don't have to pay for textbooks but the online homework software is $30 or something along the line of that. At the end, he drops your lowest 50 points whether it be from quizzes/homeworks, midterm, or final. I love this man, he is such a nice fellow and made me like math again. Probably the best professor at UMD.", "rating": 5, "expected_grade": "A+", "created": "2022-01-17T19:24:29Z"}, {"professor": "John Quah", "course": "MATH120", "review": "Had this professor for Freshman Connection and I'll warn others to only choose him as a last resort. This class was not easy. Quah is a nice professor but his overall format to the class does not help students at all. He began the class by only assigning worksheets in class where you'd work in groups and only gave 5 minutes at the end of class to answer any questions. We had to ask him mid way through the semester to actually give us lessons on the material which he actually did and that helped. The homework's are very easy but don't rely on them to learn. The midterms are pretty tough but if you study the textbook heavily than you can manage to get an A as that's where most of his questions come from. Don't be shocked if the class avg. for the midterms are in the mid 60's that's just how it goes. Take advantage of the quizzes to boost your grades, at the end of the semester he ended up dropping the lowest midterm, 2 lowest quizzes and 4 lowest HW's. This saved my grade from a C+ to B+. Quah is nice guy and he does want his students to succeed. His class was tough and expect hours 2-3 hours of work a week at minimum. Just use the textbook and study for the midterms and you'll be fine.", "rating": 3, "expected_grade": "B+", "created": "2022-02-27T19:53:09Z"}, {"professor": "Xiaoqi Huang", "course": "MATH120", "review": "If you need to take MATH 120 and don't have much familiarity with calculus before taking this class I recommend just waiting for another professor to take this class. This guy struggles to enunciate when he speaks and his English already very poor so being able to understand and connect ideas from him was difficult to start. Then teaching calc off of PowerPoint slides with lots of words and not a lot of walk through examples of how to solve a problem made it impossible to understand connections between steps in problems and how those calculations were made. Reading a paragraph words doesn't show me how you solve a problem, going through an example does. By the end of class I stopped taking notes because I knew I would just have to teach myself later that night for the homework. Class is a lot harder when you are guessing and solving problems without teaching guidance.", "rating": 2, "expected_grade": "D", "created": "2022-04-17T21:49:04Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Mrs. Khurana was sometimes hard to understand. Also, she made a lot of mistakes while teaching which made it confusing and hard to understand sometimes.", "rating": 3, "expected_grade": "B+", "created": "2022-04-28T16:57:17Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Hard to understand but shes very sweet and takes her students feedback into consideration! Def take her.", "rating": 5, "expected_grade": "A-", "created": "2022-05-03T14:46:40Z"}, {"professor": "Agnieszka Zelerowicz", "course": "MATH120", "review": "She is not fit to be a college professor. Often times she would teach material that was flat out wrong and would end up being corrected by the TA in discussion at the end of the week. She also doesn't like when people have questions, she doesn't answer what you ask and gets frustrated when you don't understand. She also is impossible to reach outside of class. I've had multiple emails this semester go unanswered. I would avoid taking one of her classes at all costs.", "rating": 1, "expected_grade": "A", "created": "2022-05-10T02:46:16Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Best Math professor I have taken by far. She was considerate of us and dropped a bunch of assignments on the MathLab, extended due dates for the homework and the exams were similar to the practice she goes over in class. She also goes pretty fast in lectures but just let her know she is going too fast and she will take that into consideration. Please take her ", "rating": 5, "expected_grade": "A", "created": "2022-05-10T18:45:44Z"}, {"professor": "Agnieszka Zelerowicz", "course": "MATH120", "review": "Probably one of the worst professors I've ever had. She goes through material fast, and puts questions on the midterms that are much harder than the material we're taught. She's even put problems that we hadn't even been fully taught yet. She doesn't respond to emails at all whether it's through ELMS or Gmail. You learn much more in discussions with your TAs, but even then it's not enough. She doesn't use class statistics to influence how she can better the class. Class average was like 50% and it seemed like she didn't care. If you care about your grade, please don't take her. Literally choose anyone else who could potentially be better. We have multiple homework's due on the same days, and they take hours to complete, and she makes them due on mornings rather than 11:59p. She's extended due dates for HW, but she'll tell us she's doing that like 3 days before which isn't nearly enough time to plan how you'll complete them. I haven't learned a single thing from her and most of the class agrees with this opinion. ", "rating": 1, "expected_grade": "D+", "created": "2022-05-12T13:41:30Z"}, {"professor": "Agnieszka Zelerowicz", "course": "MATH120", "review": "Only giving her one star because I can't give 0. Genuinely the worst professor I have ever had. Take anyone but her. No matter how good you are at math you will NOT do well. She doesn't teach anything, never answers emails or questions, and always puts things on the exam that we've never learned in class. She doesn't care about her student's at all, she is inconsiderate, and uninterested in offering help or support if need be. She made this class infinitely harder then it had to be. ", "rating": 1, "expected_grade": "C", "created": "2022-05-13T00:54:17Z"}, {"professor": "Agnieszka Zelerowicz", "course": "MATH120", "review": "The worst professor I have ever had. Comes to class completely unprepared and doesn't know anything on the powerpoint she will be teaching off of. If you can take the class with anyone but her. Never prepares you for the exams and sometimes would have information on the exam that we learned after the exam. You have to teach yourself even if you go to class.", "rating": 1, "expected_grade": "B+", "created": "2022-05-13T01:20:13Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "She is a lovely woman! She has a very thick accent so it can be kind of hard to understand her but its easy enough. In class, she mostly just writes problems and you copy stuff down which makes it hard to learn, but if you go to her office hours, she's always happy to answer any questions and help you. You have groupworks or a quiz in almost every discussion section but she drops the lowest one at the end of the semester. HW assignments are virtual on MyMathLab but you have 3 attempts on every question and the ability to see an example worked through. She also drops your lowest 3 homeworks at the end of the semester too. She was very lenient with deadlines for the homework so if you have an issue, just email her. Exams were straight forward, just make sure you do the exam review guides that she posts before them. TA's give partial credit for so many questions on exams so as long as you try and at least write something, you'll get some points for a question. 10/10 recommend her.", "rating": 4, "expected_grade": "B-", "created": "2022-05-13T20:13:23Z"}, {"professor": "Xiaoqi Huang", "course": "MATH120", "review": "Not a great teacher. Doesn't teach the material, just reads straight off the slides given to him by the math department. If you have no prior calculus experience you will have to teach yourself all the new material. Very few people actually attend the lectures because they aren't very helpful. The TA's were honestly the most helpful during the discussion classes and taught better than the actual professor. The homework is long and sometimes very confusing and not related to class content at all. The only good thing was that he provided practice exams that were very similar to the actual exams.  ", "rating": 2, "expected_grade": "A+", "created": "2022-05-17T00:12:01Z"}, {"professor": "Agnieszka Zelerowicz", "course": "MATH120", "review": "She is a nice person but does not care much about the class. Every lecture seemed like her first time seeing the material for that day. She did not prepare you for exams. Only reason I did fine in the class was because I had a good TA and took extra time to study. Take this class with another professor if you can. ", "rating": 1, "expected_grade": "B", "created": "2022-05-17T13:43:33Z"}, {"professor": "Xiaoqi Huang", "course": "MATH120", "review": "Okay so this teacher is not the best teacher. I would say you will definitely have to teach yourself the material. He is very nice, and he did curve the class. He also extended our homework due dates. He is approachable and kind. He just can't teach. The TAs in my experience were very rude. They didn't help me at all when I couldn't understand anything during lecture. So I had to teach myself the material. Our average on our first exam is a 71, second exam 80, third exam 70. So these are pretty standard scores. I did below average on the first two exams, but on the third one I did above average. I just studied really hard and did above average again on the final. Our final average is a 148 out of 200 points. Which is a 74. Study the past exams as they were exactly like the final. Like very similar to the final. He also does have a accent but he can enunciate his words clearly. If you are having trouble, go to his office hours (his office hours are better than the TA's, he explains more in depth than he does in class) and go to the math department free tutoring.", "rating": 4, "expected_grade": "B", "created": "2022-05-18T13:34:49Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "I have only good things to day about this professor. She is one of the best mathematics professor I’ve ever had! I’m going to be upfront and say I suck at math, never been good at it, but professor Khurana made it very easy to understand. She is very caring and always happy to answer questions, her sample exams are usually harder than the actual exams so practice until you feel comfortable with it and you’ll do well on the actual exam!", "rating": 5, "expected_grade": "A-", "created": "2022-05-18T23:45:07Z"}, {"professor": "Xiaoqi Huang", "course": "MATH120", "review": "Very kind and considerate prof, dropped many of the lowest assignment grades. You’ll be fine as long as you review the practice exams thoroughly and really spend time on the hw. Definitely recommend!", "rating": 5, "expected_grade": "B+", "created": "2022-05-20T03:08:28Z"}, {"professor": "Agnieszka Zelerowicz", "course": "MATH120", "review": "DO NOT TAKE THIS PROFESSOR. I would rate 0 stars if I could. She comes to class unprepared and unaware of what she will be teaching that day. She skipped over the powerpoints extremely fast and failed to make sure we understood the content before moving on. When asked if she could post the powerpoint slides, she said \"I simply can't,\" which was a lie because other professors did it. This class was very fast-paced and I did not enjoy teaching myself calculus whatsoever. We didn't receive any study guides for our exams, and when we studied using past exams on the test-bank, they ended up not being like our exams at all. The homework was excessive, not that helpful to my understanding of the material, and took countless hours to complete. This professor did not care whatsoever that the averages for her exams were EXTREMELY low (57% for example) compared to other professors teaching the same class, and did next to nothing to help our grades or change her teaching style. \r\nI truly thank any understanding I gained from this course to my TA, Sam. He was an angel who understood that our professor was horrible and tried his best to reverse any damage she did. This was truly the worst class I have every taken, and will sadly have to take it again because I was not able to grasp the information with her as my professor.", "rating": 1, "expected_grade": "D", "created": "2022-05-24T15:16:15Z"}, {"professor": "Priyankur Chaudhuri", "course": "MATH120", "review": "He rocks.", "rating": 5, "expected_grade": "A", "created": "2022-08-05T18:55:18Z"}, {"professor": "Arghya Sadhukhan", "course": "MATH120", "review": "Took him over the summer and he was quite a good teacher, made his office hours available to many students and also was willing to reserve times throughout the day to accommodate other students schedules. The drawback was that he was late to grade during the semester, it took him almost until the final weeks of the semester to finally begin posting quiz grades and most students were left in the dark when it comes to knowing about their grade in the class. Overall, he was a great professor but due to promises that grades would be released and were never posted.", "rating": 2, "expected_grade": "A", "created": "2022-08-19T04:05:22.077185Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "MY FAVORITE PROFESSOR AT UMD. Literally the most amazing person I have ever met. He teaches course material at a good pace and as long as you keep up with the information, you will end with an A.", "rating": 5, "expected_grade": "A", "created": "2022-09-23T01:46:59.035908Z"}, {"professor": "Franck Olivier Ndjakou Njeunje", "course": "MATH120", "review": "I give this teacher a 1 star. I looked at testudo and noticed he's not teaching so the freshman/sophomores taking math120 got lucky..  The comments here are lying. We all had to self-teach. The things we learned in class weren't even on the exam. He would test us on random homework problems. And if you've used mymathlab, you know how difficult and how much harder it is to do the homework. And you know how the homework has different solving steps than the book.  Also our class was under prepared for the final exam because of the homework questions we've been quizzed on was different from all of questions on the practice final exams. So we literally had to self teach ourselves in like a week lol. But this isn't why I give him a 1 star. This guy is a pushover and likes to piggyback off of the \"popular kids\". You could tell how he wanted to peak and highschool but failed. He was extremely unapproachable with questions and puts you on the spot no matter who you are. Then at the end of the class he is like why does no one ask questions?? Like take a hint... And yes, I did get a B :).", "rating": 1, "expected_grade": "B", "created": "2022-10-06T02:57:44.906886Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Math120 was only manageable because i took ap calc in high school. he talks a ton and make you write a lot. I had to learn most of the new materials myself because his lectures are not relevant. if you didn’t take ap calc or have prior knowledge you’d probably fail his class as he cannot teach", "rating": 2, "expected_grade": "A-", "created": "2022-11-03T18:32:29.828939Z"}, {"professor": "James Conway", "course": "MATH120", "review": "He's a very approachable guy if you utilize his office hours and also a quick responder. That being said, his teaching style at least in my opinion was not very helpful. The class was basically consisted of him being on his ipad rewriting the textbook word for word. I mostly had to learn the material on my own. Apart for his teaching style, the class material is straightforward and he's very understanding of situations.", "rating": 3, "expected_grade": "A", "created": "2022-11-29T19:37:55.921560Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "Mr.Schultz is a wonderful teacher. He knows how to convey information and keep lectures interesting with personal stories. If you genuinely try and put in the work, you will do well in his class, I highly recommend him.", "rating": 5, "expected_grade": "A", "created": "2022-11-30T20:25:07.252842Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "Very nice and charismatic. Each discussion has a 10 point closed note quiz, but the worst 2 grades are dropped. He counts your worst exam as only half.", "rating": 5, "expected_grade": "A-", "created": "2022-11-30T23:03:28.589623Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "Schultz is an awesome professor and keeps the lectures super interesting with his funny stories and bright personality. His quizzes are straightforward forward and his study guides for each exam are very helpful for the actual exam. Highly recommend trying to get him.", "rating": 5, "expected_grade": "A", "created": "2022-12-01T21:56:36.919484Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "DO NOT TAKE HIS CLASS IF YOU HAVE NEVER TAKEN CALC BEFORE. He teaches as though his class is an AP Clac review. Do not bother going to lecture, just watch lecture videos. 3 Midterms and 1 final. 3+ math labs each week. Expect to spend a lot of time on hw. The only thing good about this class was the sweet TA, Margot and that he posts his covid lectures so you don't have to actually go to his class.", "rating": 2, "expected_grade": "B", "created": "2022-12-06T14:35:59.142436Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "Schultz is the best professor I've had so far at UMD. Great personality and definitely straightforward. Somehow he knows almost every single person's name in the lecture with ~150 kids in the class, which I find crazy but really goes to show how much he cares about his students. Assignments and quizzes are straight forward, and he always pushed back homework due dates. If you can have Schultz, take it with Schultz!", "rating": 5, "expected_grade": "", "created": "2022-12-06T18:57:31.798510Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "I took calc before, so either way this class was easy for me. The way it was structured was nice because there are no \"-\" grades, the discussions are helpful if you have a good TA (Margot <3), and the exams are straightforward if you study the tests from the test bank. The homework was a bit time consuming and I never paid attention in lectures/watched the videos since I already knew most of calculus. Attendance was also mandatory in lectures. Pilachowski himself wasted a lot of time talking about useless things like bicycles and the reviews for his exams in the lectures were not that helpful.", "rating": 3, "expected_grade": "A+", "created": "2022-12-06T21:34:27.983032Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Amazing math teacher! She makes the content easy to digest and makes reviewing for exams easy. She will often provide review exams for students to practice on before each exam. She is also very understanding and willing to extend homework assignment if students need it. She welcomes questions in class. She genuinely cares deeply about her students and makes learning math easy. I heard students saying she made things difficult or wouldn't prepare us enough but I don't believe those students used the resources she gave us to study at home. To get a high grade in any class practice at home is needed! She is an amazing professor and gives us lots of resources to study from. Would highly recommend!", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T04:58:50.873724Z"}, {"professor": "James Conway", "course": "MATH120", "review": "Great at answering questions and he's very approachable and responsive. I found that he sometimes went slow in class but it was worth it since it clarified the material well and he went through each problem step by step. Unlike some math teachers, he was not out to trick you. (Definitely recommend taking if you're Jewish and keep the holidays because you get off for the holidays and just have to watch a video).", "rating": 5, "expected_grade": "A", "created": "2022-12-08T15:55:46.200000Z"}, {"professor": "James Conway", "course": "MATH120", "review": "Very approachable, teaches things pretty slowly which is nice so if you get behind you can catch up easily. Exams and quizzes are much easier than the practice and homework problems. He made a tough class not too bad, would definitely reccomend.", "rating": 4, "expected_grade": "A+", "created": "2022-12-08T16:11:31.291176Z"}, {"professor": "James Conway", "course": "MATH120", "review": "First year I can actually understand math. His lectures can drag on, and he can sometimes overexploit the content, but the notes are thorough. I usually would not pay attention in class, but use notes and the textbook to understand. Super nice guy, approachable, and likes math puns. Reviews are tough, but exams are overall very decent.", "rating": 5, "expected_grade": "A-", "created": "2022-12-08T16:13:13.275915Z"}, {"professor": "James Conway", "course": "MATH120", "review": "I found the class super easy to follow. He really just reads out the textbook and does problems as we take notes but questions are always welcomed. I think Conway is a nice guy and very understanding when things go wrong. Tests are straight forward and discussions just consist of practice problems and short quizes.", "rating": 5, "expected_grade": "A+", "created": "2022-12-08T18:06:52.004690Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "For the love of god try to get any other teacher. Especially if you have not taken calc before. Homework takes a century and tests are NOT easy.", "rating": 2, "expected_grade": "B+", "created": "2022-12-09T04:15:24.855229Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Would like to preface this with the fact that he doesn't even know his TA's.... he only has two for my class.\r\n\r\nI have taken calc before, not AP or IB level, but I do have a good amount of calculus experience. If you have 0 calculus experience stop reading this and go change your teacher or drop the class. Nothing prepared me for this. I won't say the material is extremely hard, because that would be a lie. However, his teaching style is probably the worst I've ever seen in my entire life. He will skip examples during class to show funny pictures or a quote that is not relevant to lecture at all. He is extremely rude to students when they ask GOOD questions. Test day? Get ready for yelling and screaming up until the exact second your test starts. Homework takes FOREVER to do. \r\n\r\nSo much more I could say but really that should be enough to convince ANYONE to drop the class.", "rating": 1, "expected_grade": "B+", "created": "2022-12-11T18:29:51.354262Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "literally the best professor ever. responds to emails very quickly. gives out benefit of doubt on exams. gives out thorough study guides before each exam and goes over them in class. pushes back the homework grades quite often. holds many study sessions for the exams over zoom. 10 min quiz every friday in discussion but he tells you the exact questions that will be on it the lecture before. super understanding. grades the exams in a timely manner.", "rating": 5, "expected_grade": "A+", "created": "2022-12-11T20:11:30.542445Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "He's great at answering questions you may have, but in terms of lecture material, he's not so good. I had to learn almost everything from the textbook. On top of that, he writes a lot of things down, and does not go through a lot of examples of the problems that are related to the material covered in lecture. Also, with homework on MingPress, it can take a long time and sometimes there are glitches that mark your answer as wrong even though you got it correct.", "rating": 2, "expected_grade": "", "created": "2022-12-12T03:38:24.491507Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "She is the most caring teacher who will literally drop any bad grade if you ask her to and also offers extra credit options. It takes some time to get used to her accent but it is well worth it if that means having her as a teacher. She cares about her students so much and will cater to each and every one of their requests. She is also the fastest responder on email and will answer at any time (even in the middle of the night some times). Best math teacher!", "rating": 5, "expected_grade": "", "created": "2022-12-12T21:54:39.144582Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "so amazing. many resources and practice before exams. go through topics in thorough. responds to emails quick and is willing to help. 10 min quiz every friday during discussion. he tells you exactly whats on them the lecture before. lowest 2 quizzes get dropped. worst exam gets cut in half.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T01:09:24.580590Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "I love this guy. He goes through so many examples which are super helpful, while also keeping us engaged by telling personal stories which are great. He will tell you the problems on the quiz beforehand and most reviews are super similar to the exams. He is a professor who truly wants to see the students succeed.", "rating": 5, "expected_grade": "B", "created": "2022-12-13T03:28:37.563053Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "I am really bad at math, so I was nervous going into MATH120. However, Khurana is really good at explaining all of the concepts. Just make sure to show up to class in order to succeed. The review problems are always much harder than the actual tests, which I like a lot.", "rating": 5, "expected_grade": "A", "created": "2022-12-13T22:35:37.477405Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "With MATH120, Professor Khurana is the best you're going to get. She is a very patient and caring teacher despite having so many students and multiple sections under TAs. If you can take her, do it! She is always willing to help students and her teaching style is easy to follow.", "rating": 5, "expected_grade": "A-", "created": "2022-12-14T21:19:19.669824Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Lectures are a bit iffy but he will always be there to help in office hours. TA's were great", "rating": 5, "expected_grade": "A", "created": "2022-12-16T16:32:07.629182Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "Didn't go to class much, but on the days I did go, he was a super engaging lecturer. Provides plenty of resources to help with exams and was easy to contact outside of class. The textbook for this course was also really easy to follow and concise. Very very laid back professor, this class is an easy a if you don't half ass it. Read the textbook, do the homework/review packets, and you'll do fine.", "rating": 5, "expected_grade": "A+", "created": "2022-12-16T19:14:53.413017Z"}, {"professor": "James Conway", "course": "MATH120", "review": "I failed AP Calculus in high school. Professor Conway actually taught me how to understand calculus. It was very easy to follow the processes, which I didn't understand at all in high school. The notes may be straight from the textbook, but he simplifies them in lecture (ex. all the steps he writes out are easy to follow versions from the textbook). He is a super genuine, nice guy, and very understanding. Lectures are not recorded unless the lecture if on Zoom or he cannot hold the class in-person, but he does post his notes online, which I have found to be easy to follow despite the lack of lecture. Quizzes and exams are very similar to homework material and in-lecture practice problems. The practice problems given in discussion are much more difficult than the quizzes and tests, but are immensely helpful (they are also optional). He responds very quickly in emails, and is very approachable in-person.", "rating": 5, "expected_grade": "A", "created": "2022-12-17T16:19:52.569230Z"}, {"professor": "Amandeep Chanda", "course": "MATH120", "review": "Excellent will take the time to help until you understand the math problem. If you go to his office during hours, he will help you with anything. He will give you an extra point if needed ad rounds grades up if you are close to the higher one. Overall a great person. If you have him as your TA, you're lucky.", "rating": 5, "expected_grade": "B+", "created": "2022-12-17T22:36:59.419799Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "I have never taken cal before in my life and she made this course so clear! As long as you try and review her practice exams, you'll be golden. The TAs also review before the exams as well. Best math professor ever!", "rating": 5, "expected_grade": "A", "created": "2022-12-18T22:38:55.557840Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "He was a terrible professor but the only reason I'm giving him such a high ranking is because you did not have to attend any of the lectures and could use the textbook or his recorded lectures as resources instead. The grade was VERY, VERY, VERY generous. There was an entire 10 point problem on the exam that I could not answer and still got an A on the final. Would take again if I needed another math credit", "rating": 4, "expected_grade": "A", "created": "2022-12-19T20:02:26.204662Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Gets easily distracted in class, doesn’t teach in-depth, and expects you to know a lot coming into the class without teaching or reviewing it. Does not provide any curve. Worse Freshman teacher I had by far this semester.", "rating": 1, "expected_grade": "C+", "created": "2022-12-19T22:18:02.409390Z"}, {"professor": "James Conway", "course": "MATH120", "review": "very easy to follow. Extremely clear grading criteria and tells us what we have coming up for the week before each class so students are on top of things. about 7 quizzes total and three midterms and one cumulative final exam. quizzes and exams are pretty easy if you follow the lecture. no curveball questions. First time I've ever really enjoyed a math class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-21T01:47:33.262375Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Lectures were boring but TA's helped with it, made sure his students understood the material", "rating": 5, "expected_grade": "A", "created": "2022-12-22T19:03:02.179193Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Great professor, TA's were nice", "rating": 5, "expected_grade": "A", "created": "2023-01-03T14:33:14.829366Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "I loved Archana! She is such a sweet lady and really cares about her students doing well. She is a bit hard to understand at first because of her accent but you get used to it pretty quickly. I think she is the best math120 teacher that you can take at maryland. She really teaches well and goes slowly until everyone understands the topic. I STRONGLY encourage anyone to take her class. She is the best!", "rating": 5, "expected_grade": "B+", "created": "2023-01-05T20:39:29.041405Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Professor Khurana is a very sweet and lenient professor. I did not consider myself a math person but I found myself loving this class! Lots of potential for leniency (multiple tries on homework, very lenient about pushing back due dates, etc). Exam questions are easier than homework questions. Weekly quizzes in discussion sections (1 week individual, 1 week group) are easier than they sound (the TA's will explain the exact style of questions on the quiz) and very helpful in retaining class material.", "rating": 5, "expected_grade": "A+", "created": "2023-01-26T00:00:03.515939Z"}, {"professor": "James Conway", "course": "MATH120", "review": "Goat.", "rating": 5, "expected_grade": "A", "created": "2023-01-26T20:47:22.619404Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Pretty decent professor. TA's mostly helped me, but exams were very fair and I can tell this isnt his best subject to teach, but he tries his best", "rating": 5, "expected_grade": "A+", "created": "2023-01-31T00:49:28.956439Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Nice guy, but I learned more from the textbook than him.", "rating": 2, "expected_grade": "B+", "created": "2023-02-24T19:09:02.252819Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "All he does is scroll through his presentation slides he most probably made decades ago. He does not work out any problems with the class and goes through the material rather quickly. Never go to him for a question, not only will he not answer it, whatever response he does come up with will be incredibly snide. The TA's are the best part about taking this class; they are very helpful. He is just not a good teacher. I can't vouch for his character but I can't imagine good things. If you like teaching yourself math, not asking questions, and taking notes at the speed of light; I would still implore you to consider taking someone else!", "rating": 1, "expected_grade": "", "created": "2023-03-02T16:16:42.353755Z"}, {"professor": "Lawrence Washington", "course": "MATH120", "review": "He didn't teach my MATH120 class, but he did substitute for Danul, who was my lecturer for MATH120 in Fall 2022. Dr. Washington is GREAT. His notes are easy to follow, and he really takes the time to explain as he goes along. He is also super friendly and does an excellent job with keeping the class engaged. He is also great at answering questions, and if people are still confused at the end of lecture, he makes himself available and takes the time to explain concepts people struggle to grasp. Overall, he is a great lecturer and great guy.", "rating": 5, "expected_grade": "A", "created": "2023-03-08T03:00:14.316191Z"}, {"professor": "Meenakshi Krishnan", "course": "MATH120", "review": "She is a great TA for Calc 1. I had her as my Calc 1 TA in Fall 2022 and she is great at explaining what you're doing wrong and is also always willing to help in her discussions.", "rating": 5, "expected_grade": "A", "created": "2023-03-30T18:40:34.891819Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "The best math professor hands down. She is so nice and actually explains topics in class. Very approachable if you have any questions. Allowed to retake exams if you do corrections and weekly reflections. Homework can be submitted late without penalty as well. Overall, a great professor and highly recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-04-12T20:22:28.942520Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "Truly one of the best professors. She is so clear in her teaching and makes her exams extremely fair. She is so approachable and really cares about her student's success.", "rating": 5, "expected_grade": "A+", "created": "2023-04-20T15:10:11.777076Z"}, {"professor": "Yeor Hafouta", "course": "MATH120", "review": "Old fashioned. Will teach by using a chalk and a blackboard and will write small so unless you sit in the very front of the class you'll get very lost easily. Not to mention, he goes very fast. His workload is atrocious. His estimated time of work per week is 3 hours, but in reality, students spend around 2-3 hours a DAY totaling up to at least 12 hours a week just to finish assignments. He WILL make you pay 75$ for a Pearson code, and he doesn't drop the lowest quizzes and exams nor curves.", "rating": 1, "expected_grade": "C-", "created": "2023-04-21T21:00:23.207995Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "I originally did not like calculus at all when I took it in high school and was pretty scared to take it at college. However, She explains the concepts so clearly and definitely makes sure that her students succeed! Her exams are pretty easy compared to the study guides and homework so if you do the homework and the study guides you will do fine in this class.", "rating": 5, "expected_grade": "A+", "created": "2023-04-29T14:13:02.219800Z"}, {"professor": "Danul Gunatilleka", "course": "MATH120", "review": "Solid teacher for the most part. Always willing to explain what you're doing wrong. He can create a somewhat boring environment however.", "rating": 4, "expected_grade": "A", "created": "2023-04-30T23:59:25.916084Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "Unfortunately Dr.Hoganson will not be teaching for the foreseeable future. She is hands down one of the best professors at this University and this 22/23 school year is her first ever year here at UMD. So that says a lot about her as a teacher. Super reasonable, understanding and a bright spot in UMD math. She explains concepts incredibly clear and she actually wants her students to pass MATH120. She is not out to get you and there are not many professors who are like that with subjects like math. If she ever teaches and you see her as an option, please do not hesitate and take her!", "rating": 5, "expected_grade": "A", "created": "2023-05-02T16:34:59.991126Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "awesome prof and super fair class, TAKE HIM", "rating": 5, "expected_grade": "A", "created": "2023-05-02T19:38:58.685572Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "Hannah Hoganson is the best professor this school has. She goes over all concepts slowly and in lots of detail, and gives loads of examples for one concept, so you truly master everything before moving on. Her tests are fair and are always a little easier than the practice tests she provides, so if you can do the practice tests your set. The homework's aren't bad at all, and are always super relevant to class stuff - I use my class notes and am always able to answer every problem from them. She is also always wiling to meet and go over any topic at all, and holds her own test review sessions, which are always INCREDIBLY helpful! She's a super fun person too, and often makes her lectures fun and interesting, because she's a fun person. HIGHLY RECOMMEND HER!! Logistically, she allows retakes for her tests, which is a big deal, because she cares that you have the opportunity to learn from mistakes. Never a dull moment in Math120. This class rocks my world.", "rating": 5, "expected_grade": "A+", "created": "2023-05-03T21:25:47.653370Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "Easily the best Calculus professor you can take for 120. She explains topics thoroughly and really cares about her students which is rare for a professor. Not to mention she allows a retake for exams if you don't do well the first time. If you are required to take Math 120, do not hesitate and take it with Professor Hoganson, she is the best.", "rating": 5, "expected_grade": "A", "created": "2023-05-04T18:39:09.864980Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "amazing professor. lectures are recorded, she makes sure pacing is suited to students and posts practice exams and has a zoom review before exams. there are a few quizzes (group and individual) in discussion sections but the TAs prepare you well for them, and shes very caring and will adjust due dates and pacing based on the class", "rating": 5, "expected_grade": "A+", "created": "2023-05-04T20:52:32.407404Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "Definitely take her. She is by far my favorite professor I have ever met. She is very kind and will take the time to actually help you if you are confused. She also allows retakes on the midterms if you get a bad grade. I didn't have to retake any exams though because her exams are very straight forward and she tests you on the concepts rather than crazy examples. She isn't strict about homework deadlines either if you are stressed about getting them done. She really cares and I would recommend her to anyone.", "rating": 5, "expected_grade": "A+", "created": "2023-05-05T21:10:29.647261Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "No exaggeration one of the best professors at UMD. She managed to make complex topics approachable, even for someone like me who is not the best at math. She wants to see you succeed, and if you pay attention, she will make sure you do. She is also just a happy person to be around and makes her class one to look forward to. If you can, take a class with her!!", "rating": 5, "expected_grade": "A-", "created": "2023-05-07T20:33:50.227745Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "This is the best math professor at UMD she really takes the time to teach the subject. She doesn't do weekly discussion quizzes like most of the MATH 120 do. She also allows for exam retakes as long as you do the reflections and corrections, she just cares that you understand the material no matter when you understand it. At some point, she decided not to take points off for late homework so that was helpful as well. She also records the classes so if you can't come you can watch it on zoom. She is so great.", "rating": 5, "expected_grade": "A", "created": "2023-05-08T16:58:30.823256Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "DO NOT I repeat DO NOT sign up for his classes! He teaches from a power point with math!! Bad at explaining and calculus is already hard. I am good at math but this class was a struggle. He would mess up dates on discussion sheets so we would be doing math that we \"had not even learned yet\".", "rating": 2, "expected_grade": "B+", "created": "2023-05-10T19:20:24.308014Z"}, {"professor": "Meenakshi Krishnan", "course": "MATH120", "review": "Meenakshi was not the TA for my MATH120 discussion, but both the TA for my section (Jingcheng) and her section met in the same room at the same time for discussion, so both of them were leading discussion together. Both of them were super helpful at questions we still had from lecture, and they were also super helpful for when we were confused when we were completing the practice worksheet.", "rating": 5, "expected_grade": "A", "created": "2023-05-11T02:07:04.517914Z"}, {"professor": "Danul Gunatilleka", "course": "MATH120", "review": "I had Danul as a lecturer for MATH120 in the Fall 2022 semester, and I didn't really enjoy lecture, and I ESPECIALLY didn't enjoy doing the homework he assigns. His lectures are SOOOOO boring, and he writes a lot, which is understandable, but he doesn't really give much explanation for what he writes. On the plus side, however, he is EXCELLENT at answering questions and clearing up issues we had on the homework. Now, about the homework. It is online and on this site called MingPress. This site is incredibly annoying, as there are glitches that will mark your answer as wrong even though you got it correct. To clear this up, you have to show him the question in person and the work you did on a separate piece of paper, and then email him so that he knows to correct it in the system. Also, some of the homework assignments can be short, and sometimes they can be super long; the longest number of questions I had for one of the homeworks was 20 questions, which is so much considering I had to do a lot of learning from the textbook, and I had 4 other classes to worry about. He's not a bad lecturer, but just expect to put in a lot of time for this class if you have him as the lecturer.", "rating": 3, "expected_grade": "A", "created": "2023-05-11T02:25:48.783777Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "Professor Hoganson is an amazing professor. Not only is she a kind and caring person, but she is also a great teacher that clearly explains concepts and complicated topics very well. She is very approachable and accessible outside of class and she wants her students to do the best they can. She is one of the best math teachers I've ever had and this is coming from a person that isn't very good at math nor likes math. The exams are fair and she offers retakes after submitting corrections. The online homework was helpful and there was no late penalty if you ever fell behind. She isn't gonna be teaching for a while but if there is ever a chance to take her for a class, take Professor Hoganson. Overall, she's a great person and a great professor.", "rating": 5, "expected_grade": "B+", "created": "2023-05-11T05:33:09.030936Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "Hannah is the best math professor I've ever had. She teaches the material clearly and always answers questions thoroughly in lecture. She's also super funny and very easily approachable. You're allowed one retake for each exam, which really relieves some stress. She genuinely just wants her students to understand and enjoy math. Her office hours are also super helpful. I'm so sad she won't be here again next semester, but if you ever get the chance to take math with Hannah, do it!!", "rating": 5, "expected_grade": "A-", "created": "2023-05-15T18:45:20.007996Z"}, {"professor": "Yeor Hafouta", "course": "MATH120", "review": "At first, I can admit I did not like Professor Hafouta, but the more I attended lectures, I can say that he really isn't all that bad. I did not walk out of this class learning nothing. Although his two \"midterms\" were not the best and only 4 questions, I ultimately passed this class with a B+ (and I am by no means great at math). If you ever need assistance, he is attentive, and going to the discussions definitely helps. The main criticism that I have is the Pearson homework assignments that we had weekly. They definitely required a lot of time to complete. Other than that, if you have to take him, he's honestly not the worst professor.", "rating": 3, "expected_grade": "B+", "created": "2023-05-15T20:31:24.071371Z"}, {"professor": "Yeor Hafouta", "course": "MATH120", "review": "The other review could not have said it better. Not only is his weekly HW load incredibly inappropriate for a 120 calc class, it does not even help one prepare for the  course final. I had to rely on review material from the other 120 professor to prepare for the final, which is luckily shared by all 120 classes regardless of professor. Half of the HW problems would be excessive, obscure formulaic based problems with 20+ steps that were both useless for the class and took hours to do. He was not receptive to student feedback on his hw, which really ruined the process of learning in this class. Since he is not returning to UMD, ill be making a review on rate my professor as well.", "rating": 1, "expected_grade": "A", "created": "2023-05-16T01:25:21.340210Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "Hands down the best math professor/teacher ever. Hannah Hoganson did a great job explaining all of the material and was very understanding and personable. She does a great job preparing you for homework and tests. Definitely take her class most and people participate and ask questions because it's such a comfortable environment.", "rating": 5, "expected_grade": "A", "created": "2023-05-16T07:39:38.390207Z"}, {"professor": "Yeor Hafouta", "course": "MATH120", "review": "I rarely showed up to class bc I learned Calc from high school. Yeor is really bad at teaching. Knowledgeable about Calc yes, but cannot teach for the life of him. So many people in my class struggled bc of this. If you know Calc already, it doesn’t matter and you don’t really have to go to class at all. I retaught myself the math through the homeworks he assigned and if you do know Calc already, it does take a bit of time but not like full days to do it. If you don’t know Calc or at least some of it, I’d suggest not taking this class", "rating": 3, "expected_grade": "A+", "created": "2023-05-16T21:15:11.160051Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "I took this class spring 2023. I took math 113 in the fall and got a C in the class, so I was super worried about math 120 and had to take it for my major. This professor is actually a great teacher, and even if you don't agree, he is extremely organized. Probably the one the best advantages. He also doesn't give minus grades, so you only need a 90 for an A. It is however not curved. I recommend this professor. He will probably have all his lecture videos online in future semesters, but I personally learn better by going to class. As someone who was worried about math, effort and attending class/office hours got me through. He also prepares you extremely well for the finals. He gives word problems on mid terms that are extremely similar to the finals. The TAs were pretty good too.", "rating": 4, "expected_grade": "A", "created": "2023-05-17T20:49:00.079665Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "He made everything super straightforward. No surprises on exams. He also recorded every lecture. Very nice and explained things well.", "rating": 1, "expected_grade": "A+", "created": "2023-05-21T20:34:56.464696Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Teaches from power points, never really explains much. It was a plus that his lectures are online so I didn't have to attend class in-person. I attended a few in-person classes and he was going through the slides so fast that I couldn't keep up so I opted for his online lectures. A couple friends went to his office hours and said he was personable, so there's that I guess. His review sessions for all exams suck, don't even waste your time because he spends soooo much time lecturing about stuff most of us already know. Not the worst professor in the world but certainly not the best.", "rating": 2, "expected_grade": "B+", "created": "2023-05-24T00:47:02.174128Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "The best professor I have ever had. I’ve never met such an amazing teacher but also person. Hannah Hoganson had the best personality and made calc 120 so easy. There is no way not to understand what she is teaching because she is the best at teaching. Loved this class because of this professor. She is the best. Seriously never had a better professor or teacher in my life until her.", "rating": 5, "expected_grade": "A", "created": "2023-05-26T03:38:14.879570Z"}, {"professor": "Jingcheng Lu", "course": "MATH120", "review": "Jingcheng is a great TA who led my discussion section for MATH120 during the Fall 2022 semester! He was extremely helpful with answering questions we had, and although his tone can sometimes come off as if he is annoyed, he is actually a very nice guy and is more than willing to help if you are still confused about material from lecture as well as the practice worksheets you're supposed to do during discussion. He's a very solid TA who is super helpful.", "rating": 5, "expected_grade": "A", "created": "2023-05-31T01:38:11.993038Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "TAKE HER AT ALL COSTS! best math proof ever. the homework clutches majority of your grade and you get a lot of tries on it. She allows you to retake tests too", "rating": 5, "expected_grade": "B+", "created": "2023-06-11T18:01:08.747924Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Straightforward and easy to understand. I stopped going to the in person lectures after the first two classes because he uploads all the lectures online and commute times. As long as you watch the lectures and pay attention, you'll do fine. Would definitely recommend.", "rating": 5, "expected_grade": "A-", "created": "2023-06-17T05:23:51.049275Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Fine professor. You could honestly skip every class and learn from the textbook and it would make no difference. I never went and just copied his notes and was fine. MingPress is annoying especially if you don't know the format of the answer so good luck with that.", "rating": 3, "expected_grade": "A-", "created": "2023-06-21T06:08:42.838396Z"}, {"professor": "Kayla Davie", "course": "MATH120", "review": "Took this class online and it was chill. You had a quiz and an exam each week. The quizzes generally were pretty easy. One got dropped at the end. The exams were manageable as long as you watched the lectures. Participation was like 2% of your grade so you really didn’t need to show up to the zooms. You could just watch the recorded lectures. If you did test corrections, you could drop one exam, which allowed for people to not have to take the last exam. The teachers communication was great and strongly encouraged people to go to her office hours. There wasn’t a final which was great and all tests were weighed the same.", "rating": 5, "expected_grade": "A", "created": "2023-07-24T16:42:11.903870Z"}, {"professor": "Yeor Hafouta", "course": "MATH120", "review": "Yeor is very difficult to understand in class. However, he is very forgiving when it comes to homework assignments. During MATH120, he extended some hw deadlines for weeks. you could basically turn in homework whenever you wanted to. The homework itself seemed very difficult on the surface, but the program we used to submit homework gave numerous hints, so it was really easy to mimic the hints and figure it out. The only issue with the homework is that a lot of it wouldn't be things that were brought up in class in detail. Exams were mind-numbingly easy, and loads of \"half-credit.\" Because the exams were only about 3 questions, it was hard to get a whole question wrong. Overall, Yeor really tried in his lectures, doing really well connecting concepts to real-world examples. At the end of the class, Yeor allowed us to decide how we wanted our grade to be distributed, which when your grade will be heavily weighted on exams, is an extremely easy A.", "rating": 4, "expected_grade": "A", "created": "2023-08-16T17:59:52.877287Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "If you show up to class (or at least watch the lecture videos b/c he doesn't take attendance) then you'll be fine. Discussions are also important bc there was quizzes, but the TA explains everything right before them", "rating": 5, "expected_grade": "A-", "created": "2023-09-18T15:32:02.817968Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "There are so many tricks to Elementary Calculus that I learned from a Youtube video instead of his class, and those actually helped me the most. Skims over the harder parts of lessons, and this is not a personal statement most people I know do not understand the topics perfectly. Exams are usually not too bad. Just make sure you do every practice he gives you. To be honest, I'm a little shocked that his reviews are so positive on here. I would take this over MATH140 though. Be prepared to write responses to word problems using your answers and units, as in most math classes.", "rating": 2, "expected_grade": "A", "created": "2023-10-02T20:04:28.528250Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Only uses powerpoints. Sings songs to teach, but they're not very helpful. He complains about scooters too much too. Biggest point is that he teaches with the expectation that you already know it. It feels more like he is reviewing it rather than teaching new material.", "rating": 1, "expected_grade": "W", "created": "2023-10-26T04:00:31.359059Z"}, {"professor": "Owen Guch", "course": "MATH120", "review": "Angelic, kind, and wonderful. The true MVP when taking Pilachoski.", "rating": 5, "expected_grade": "", "created": "2023-11-15T20:59:20.974757Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "He is awful. He hasn't done any math this entire semester. Soley reads off of the slides. The homeworks are lengthy and much more difficult than the material review in class. If you have him I feel sorry for you.", "rating": 1, "expected_grade": "A", "created": "2023-11-29T05:02:39.949860Z"}, {"professor": "Peter Dillery", "course": "MATH120", "review": "Hes a pretty good teacher, I genuinely have a good understanding of the most of the concepts in the class, however he usually goes over the hardest topics towards the last 5 minutes of class and I found myself struggling on those the most.", "rating": 3, "expected_grade": "B", "created": "2023-11-29T16:33:14.176841Z"}, {"professor": "Peter Dillery", "course": "MATH120", "review": "I did not go to this class for most of the semester as attendance is not mandatory, and his lectures mainly reiterate textbook material. He explains concepts well enough and offers help when needed. There are small quizzes almost every week, and they are good prep for exams. The exams are pretty fair and consistent with the homework and example problems. The TA's are also helpful and nice. The textbook itself also explains challenging concepts well which makes self-studying easier.", "rating": 4, "expected_grade": "A", "created": "2023-11-29T22:53:48.321328Z"}, {"professor": "Peter Dillery", "course": "MATH120", "review": "Pretty good overall. His exams and quizzes are fair and mimic the homework/class examples. He is good about going over several example problems that are needed to complete the homework. Although he tends to run out of time during for the last example, he always continues it even after class is over so you can understand it.", "rating": 4, "expected_grade": "A", "created": "2023-11-30T04:57:40.169315Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "Professor Schultz was truly one of the best professors I have ever had. He made a not-so-interesting calculus class into a fun and engaging course. Attendance was not mandatory and was there was a 2 question quiz most Fridays, but gave us the questions to us the class before. I could not recommend a better professor for MATH120.", "rating": 5, "expected_grade": "B+", "created": "2023-12-01T17:32:59.614794Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "This guy blows so bad do not take his class please whatever you do", "rating": 1, "expected_grade": "B", "created": "2023-12-04T20:47:41.127443Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Archana Khurana is a very kind individual and is very accommodating for her students. She wants students in her class to succeed. It is that simple, she's the G.O.A.T", "rating": 5, "expected_grade": "A", "created": "2023-12-05T00:06:19.492753Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "She is a great teacher. I remember thinking in the first week she was hard to understand but have not thought about it since you get used to it. I never took calc before and aced the class. She does a good job teaching, and a better job preparing you for exams. For every exam, she gives you three practice exams that are exactly the same as the exam you will take. If you can, get in this class to fulfill your math req", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T21:35:35.614696Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "He just reads off a PowerPoint and doesn't really put any effort at all into teaching you. He's not a particularly likable guy either. You essentially have to already know calc before you take the class. The good thing about the class is that all his lectures are posted online so you don't have to attend in person. Most of your learning will come from piecing together the homeworks and from the discussions.", "rating": 2, "expected_grade": "A", "created": "2023-12-06T00:42:05.546623Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "If you can do anything to avoid him, please do. I took precalc and ap calc in high school, and this class was a struggle. He shows up late to class every single day and barely teaches. He moves so fast and doesn't explain anything. Don't ask questions, you will probably be pitied. You will learn so much more watching the online videos and going to TA office hours. The homework takes over an hour each night. Test days are filled with screaming! 1000% do not recommend, but good luck if you do!", "rating": 1, "expected_grade": "B", "created": "2023-12-06T18:14:52.276666Z"}, {"professor": "Peter Dillery", "course": "MATH120", "review": "The quizzes and exams are almost exactly the same as the homework and practice quizzes he posts before the exams. So as long as you know that, you will be totally fine. There are weekly quizzes, but it's honestly a good consistent review in the class that keeps the information fresh. He is overall a good teacher and responds very quickly to emails, but he does go over hard material really quickly sometimes and it can get very confusing. Overall would recommend.", "rating": 4, "expected_grade": "A-", "created": "2023-12-08T15:50:49.864770Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Please find literally any other professor for MATH120 or other courses he may teach. Pilachowski makes succeeding in the course a lot harder than needed be. He is the laziest professor I have ever had. His lectures consist of at least 20 minutes of rambling before getting to any actual math, and even then, he'll still interrupt his own teaching and give you some anecdotal story that has absolutely no reason to be brought up and just wastes time. When the lecture is 50 minutes long, you shouldn't be wasting at least 20 minutes talking about past students or your disdain for scooters on campus, please teach. That's another thing, his teaching or the lack thereof. Pilachowski relies heavily on slides posted in the canvas classroom to \"teach\". They are very brief, with a few examples he works through in class. Occasionally he'll spend a slightly longer amount of time doing one to stress something, but usually he'll just blast through them as fast as he can and explains nothing. He wouldn't have to rush if he just shut up at the beginning of classes...He has his lectures from Covid times posted in the Canvas classroom so there is basically no point going in person, and those you can skip through his ramblings in. Still, they're the same as his in-person lectures, so there is very little difference between the two. He doesn't do any grading, thats all up to your TA, mine was kinda the only reason I wasn't failing throughout the semester. I'll admit, my grade was not entirely due to Pilachowski's horrible teaching style, I underestimated the amount of effort  needed for exams in this course. His exams are basically the same as the practice exams provided in the test bank, just study for them more than I did. His review sessions are pointless, unless you have bad TAs who don't do something outside of class (i.e. they don't have review sessions of their own). Once again, he wastes time sitting there talking, saying the same things he says before every class for at least 10 minutes, and then tells you to do it all yourself basically. With the remaining 5 minutes of time, he'll then give you useless comments on each question, displayed in the tiniest font possible, making it impossible to read or understand what he's explaining if you don't have his review sheet directly in front of you.Teach yourself the material and get help outside of the classroom if you need it, cause Pilachowski sure won't make this class easy. P.S. there are no answer keys for the numerous practice finals anywhere, so good luck with studying for that.", "rating": 1, "expected_grade": "C", "created": "2023-12-09T04:54:06.088330Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "I was able to do well in this course since I took Calculus before, but definitely would have struggled a lot if I hadn't. Because of this, I didn't really attend lectures and felt like reviewing the textbook was more informational. Professor Khurana isn't the best teacher, I was only able to understand concepts more through the AMP sessions. Her lectures include problems that seem easy, but then you look at the review for the tests that include ones 10x harder and feel like you're screwed. Just make sure you study a lot for the exams since they're worth a pretty large portion of your grade, and you should do well. Overall I would say her grading policies are pretty accommodating and for your lowest-scoring exam; she drops the grading scale from 100 to 50, but her teaching style isn't so great.", "rating": 2, "expected_grade": "A", "created": "2023-12-09T19:26:40.863653Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "Professor Schultz is the goat. He teaches every topic very well. There is a quiz in discussion every week but he tells you the questions that will be on the quiz in the lecture before. Gives you an exam review sheet before each exam and a packet full of previous finals to review for the final exam.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T20:19:51.287866Z"}, {"professor": "Shuhan Kou", "course": "MATH120", "review": "best professor and TA out there.", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T03:25:23.974493Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "He records all of his lectures so you never have to come to class which is nice. The discussions and math labs are really the only way you'll learn the content. He goes over lectures extremely fast during class, and often showed up 10 minutes late for a 50 minute class. You're exams are going to cover more content, and be significantly harder than other math 120 sections. However, this helps with the final exam because you would have been learning the content a month before the final, where as other sections only have 2 weeks to learn the new content. He also has at least 4 extra credit points per test, and will curve everyone's grades in the end if one version of a test scores significantly higher than the other version. It's not the end of the world if you take his class, but I would recommend trying to take another professor over him.", "rating": 2, "expected_grade": "A", "created": "2023-12-19T16:42:17.745174Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "I don't usually write reviews but I had to write one for Ms. Khurana because she is one of the best professors I have had at this school so far. I initially took MATH120 with Mr. Timothy, however, I dropped it after the first exam in his class since his teaching methods were not my way of learning. Upon reviewing the ratings for MATH120 classes I saw that this professor had the most rating, so I took her, one of the best decisions ever. Her exams are literally the same as her practice exams. She just changes the numbers, but the concept is the same. After the first exam in her class, I honestly rarely showed up in her class for lectures and I did fairly well. For the third exam, I did not go to her lecture for any of the material on it but I got a 95% for that exam. I used mathlab to help me and I practiced the practice exams to know what to do. If you are thinking about taking her, DO IT! It will be worth it! After taking this class with Mr. Timothy, I thought it would have been very hard, but in reality, Ms. Khurana made learning in the class fairly easy.", "rating": 5, "expected_grade": "A-", "created": "2023-12-20T15:30:55.658069Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "TJP does not teach at all. During his lectures, he reads directly from the slideshows and he goes through them so fast. If you put the work in, you will do well. But, you definitely need a background in Calculus before taking this class.", "rating": 2, "expected_grade": "A", "created": "2023-12-21T19:36:05.346879Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "I have never taken calculus before this class. I stopped going to class after the second time because he really only teaches theorems and reads off slides. really all the learning comes from the homework but 3 sections of homework are generally assigned per week and each one took at least 2 hours (which he warns us about on syllabus day but is still shocking like why did math take up so much of my time). the TAs were great though.", "rating": 2, "expected_grade": "A", "created": "2023-12-24T07:52:51.297036Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Professor Archana is a very nice woman. However, I really do not believe she is the best at teaching. It seems like she teaches the material like we should already know it, which for some people, is not true. She can be kind of confusing when explaining information during lecture, and most of the time I did not know what was going on. I learned most of the content during discussion classes with the TA and through other people. However, Professor Archana is super accommodating and is very open to helping her students since she truly wants them to succeed. This being said, I don’t think she’s necessarily the best professor, but I think she is the best choice for MATH120. I would recommend asking for help from the TAs and attending the AMP sessions, since those helped me a lot throughout the semester.", "rating": 3, "expected_grade": "A-", "created": "2023-12-24T18:15:58.860072Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "Absolutely take this man if you can. He's so goated and really engages the lecture hall even when its full of 120 people. The class is fairly easy if you put in the effort it is exam heavy however (that's just how the math department works sadly). Makes the class as fun as calculus can be and is a great person overall to talk to and be around.", "rating": 5, "expected_grade": "A", "created": "2023-12-25T00:17:58.440315Z"}, {"professor": "Peter Dillery", "course": "MATH120", "review": "Nice chill professor. Everything covered on the quizzes and exams are on the homework assignments, goes over multiple examples in class to make sure you understand a concept, and even though the virtual textbook costs money, it is set in a very organized manner. He also regularly posts practice exams. Relatively easy to study on your own.", "rating": 4, "expected_grade": "A", "created": "2023-12-25T01:36:25.872623Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "Professor Schultz is the best professor I have had at UMD. He is incredibly friendly and gives countless opportunities to improve a grade. The class had weekly quizzes, and Schultz essentially gave the questions beforehand during lecture. Exams were not difficult, as they resembled the given study guides. Definitely take class with Professor Schultz if possible. He is very thorough in lecture and answers all questions politely.", "rating": 5, "expected_grade": "B-", "created": "2023-12-26T04:20:34.103007Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "Friday discussion quizzes that are graded for accuracy. At the end of the semester he'll either get rid of homework, all the quizzes, or half of any exam.", "rating": 5, "expected_grade": "A", "created": "2023-12-28T21:51:25.782663Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Great professor if you already have taken Calculus in the past as lecture is completely optional and all his videos are recorded. His style of teaching can be very confusing, not in-depth, and dry so not great if you actually need to learn. However, his TA's are extremely helpful and the worksheets are great tools to prepare for Exams along with mathtestbank. Exams harder than final but they prepare you well.", "rating": 4, "expected_grade": "A", "created": "2024-01-10T23:49:45.301737Z"}, {"professor": "Hannah Hoganson", "course": "MATH120", "review": "This is my first time writing a review for a professor ever. That's how good she was. I took her in Spring of 2023 and got an A+ in her class from having an F in math 115 the semester before with a previous professor (Ben Bezejou). She's really good at what she does and her dedication to making sure students understand the material did not go in vain. Hannah Hoganson for President tbh.", "rating": 5, "expected_grade": "A+", "created": "2024-01-12T17:49:59.187316Z"}, {"professor": "Jason Schultz", "course": "MATH120", "review": "Professor Schultz is a GOAT math teacher, if you have the opportunity to take his course then do it. He explains the topics very well and is a very understanding teacher. Professor Schultz is also one of the funniest professors I have had and his TA was also very good. Again he is the GOAT math teacher.", "rating": 5, "expected_grade": "A-", "created": "2024-01-19T15:54:02.843323Z"}, {"professor": "Archana Khurana", "course": "MATH120", "review": "Do not recommend. Overall class was organized and had good structure but she was not a good lecturer. She was confusing and hard to understand on occasion. TA sessions were useless because they both were equally as bad as explaining content. Only good thing was the AMP sessions. Her AMP Dana was fantastic and a great resource throughout the course.", "rating": 2, "expected_grade": "C-", "created": "2024-03-21T02:13:05.898533Z"}], "department": "MATH", "course_number": "120", "name": "MATH120", "title": "Elementary Calculus I", "credits": 3, "description": "<b>Prerequisite:</b> 1 course with a minimum grade of C- from (MATH112, MATH113, MATH115). Or must have math eligibility of MATH120 or higher; and math eligibility is based on the Math Placement Test.\n<b>Restriction:</b> Not open to students majoring in mathematics, engineering, the biological sciences, biochemistry, chemistry, or the physical sciences.\n<b>Credit only granted for:</b> MATH120, MATH130, MATH136, MATH140, or MATH220.\n<b>Formerly:</b> MATH220.\nBasic ideas of differential and integral calculus, with emphasis on elementary techniques of differentiation and applications.", "is_recent": true, "geneds": null}