{"average_gpa": 2.9860465116279067, "professors": ["Vadim Kaloshin", "Kelly Yancey", "Steven Chadwick", "Archana Khurana", "Nathan Manning", "Sabrina Rainwater", "Mahesh Nerurkar", "Dragomir Saric", "Xiumin Du", "Jacob Bedrossian", "Hannah Hoganson", "Shiferaw Berhanu", "Stefan Doboszczak", "Steven Chadwick", "Timothy Pilachowski", "Shiferaw Berhanu", "Clarke Safsten", "Shiferaw Berhanu"], "reviews": [{"professor": "Justin Wyss-Gallifent", "course": "MATH140H", "review": "Justin is my favorite teacher this semester by far.  He's funny and explains everything really well.  I never have fallen asleep in this class because he makes class interesting.  Before the tests, he gives out sample exams which are really good to study from.  He's really good at clarifying everything that anyone might have a problem with.  I never figured a calculus class would be my favorite class, but Justin is awesome and I was pleasantly surprised.", "rating": 5, "expected_grade": "A", "created": "2008-12-14T11:59:00Z"}, {"professor": "Justin Wyss-Gallifent", "course": "MATH140H", "review": "explains everything really well. tests are hard - but fair granted he teaches really well.", "rating": 5, "expected_grade": "", "created": "2008-12-05T22:08:00Z"}, {"professor": "Justin Wyss-Gallifent", "course": "MATH140H", "review": "Horrible teacher. \r\nOver-elaborates things that should come as common sense to people. Tests are a ridiculous waste of time.\r\nNice guy, but horrible as a teacher.\r\nAnd if you're going to be in his class, I suggest bringing yourself a scented candle or something. Massive BO.", "rating": 1, "expected_grade": "", "created": "2007-12-18T13:30:00Z"}, {"professor": "McBlaine Boyle", "course": "MATH140H", "review": "Dr. Boyle is an extremely intelligent and nice guy. However, like they say, \"those who can, CANT teach\". Most of his teaching was by spending the whole class writing proofs on the board, with no one in the class having any idea what was going on. He did not take much time to simply explain the basic underlying idea of most concepts. Tests were sometimes challenging but reasonable, and he drops your lowest exam, and some quizzes/hw. I do not recommend taking this class with Boyle unless you've had calculus before and did well. Even with that, you may still struggle.", "rating": 3, "expected_grade": "", "created": "2010-12-17T19:24:00Z"}, {"professor": "McBlaine Boyle", "course": "MATH140H", "review": "Mike Boyle knows a lot about calculus . Mike Boyle knows nothing about how to teach calculus. Many times I would find myself confused in his lectures when he went off into tangents of yet ANOTHER proof , and then while doing the impossible homework problems find that he never actually taught us how to do the problem , only the theory behind the math. Many a times it was hard for everyone to stay awake, as his lectures can get very very boring very very fast. I often never understood his answers when I asked him a question and found his tests to be extraordinarily unfair. Out of our entire class there were only two A's. Good news is however he curves the class at the end. On another good note , he is very willing to help you out and is easily contactable. And every now and then he will crack a corny joke to keep you awake. ", "rating": 3, "expected_grade": "", "created": "2010-12-01T12:50:00Z"}, {"professor": "Xiumin Du", "course": "MATH140H", "review": "I felt she did a solid job for my MATH140H class. She graded very fairly and was helpful whenever I needed something clarified, but I recommend you go in with at least a little bit of Calc experience under your belt.", "rating": 4, "expected_grade": "C+", "created": "2018-12-23T05:22:24Z"}, {"professor": "Jacob Bedrossian", "course": "MATH140H", "review": "Professor Bedrossian is an incredibly intelligent man, and a pretty good lecturer. His exams could be difficult sometimes, but were fair. His weekly homeworks had some real crazy stuff attached to them, but doable with fair bit of thinking. Very nice, sorta awkward.", "rating": 4, "expected_grade": "A", "created": "2021-01-28T00:24:40Z"}, {"professor": "Steven Chadwick", "course": "MATH140H", "review": "Also took 141H with Chadwick as well, and in my opinion he is the best calculus 1 and 2 professor here. Lectures are straightforward with both theory and examples of concepts. He occasionally gives hints to difficult questions on webassign and will basically give you the answers to worksheets in office hours. His exams are always straight forward and will always give out practice exams before each one. A very nice person as well and understanding of student's needs if they need a deadline extension. ", "rating": 5, "expected_grade": "A", "created": "2022-04-12T00:26:21Z"}, {"professor": "Nathan Manning", "course": "MATH140H", "review": "Super good professor in a small class setting. Very personable and easy to talk to before class and during discussion, and is able to flip the switch for lecture very quickly. His lectures are engaging and really well planned, only downside is exams are very challenging. If you are looking for an easier A, don't take him, but if you are looking to learn and be challenged, I would highly recommend him", "rating": 4, "expected_grade": "A-", "created": "2022-04-26T19:45:59Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH140H", "review": "Professor Berhanu made this course impossible to pass. Every Wednesday he would teach content and then immediately make you put away all of you notes and do a worksheet on content you had barely learned, unaided. He couldn't figure out how to put grades on canvas, so the Canvas grade only reflected your WebAssign scores, meaning you wouldn't know how much the \"worksheets\" (which were basically pop quizzes) and exams (that most people didn't pass but still weren't curved) affected your grade until midterm grades were released and you have 2 days to see if you need to withdraw from the course. I strongly recommend to not take the honors version of this course because if you have an unhelpful professor like I did then you have no TA to help where you are struggling. He seems like a nice man who really enjoys math but he was not a good teacher", "rating": 2, "expected_grade": "W", "created": "2022-12-05T18:26:00.279252Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH140H", "review": "Professor Berhanu (Shif) was awesome for Calc I. As far as basic course details go, he doesn't give too much work, the midterms were pretty easy, and there were very few times that we faced a problem that we were getting graded for and not have seen it/practiced for it before. Beyond that, He's very good at breaking down and explaining concepts and is clearly excited to be teaching. I don't think it would be that crazy to call his level of excitement \"cute\". He does have a non-american accent for speaking English, but once you hear him talk long enough you get used to it. If you can take him for MATH140H, or any math class that he teaches, I highly recommend choosing him.", "rating": 5, "expected_grade": "A", "created": "2022-12-05T19:53:52.807592Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH140H", "review": "Professor Berhanu would talk poorly about students to other students in the same class behind their backs. He did seem enthusiastic about math, but was not understanding in many cases when it came to his students. Graded harshly, only accepted the exact right format and wording for tests and classwork. He didn't know how to use Gradescope so our final grades remained a mystery. Had closed note classwork on the topic you just learned up to twice a week. He went in depth in writing out proofs, for which we never used in actual classwork or exams. I don't recommend taking this class. I came in several times to his office hours but continued to struggle through the semester.", "rating": 1, "expected_grade": "", "created": "2023-01-25T01:48:14.931448Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH140H", "review": "Be prepared to get everything perfect if you want a good grade in this class. Berhanu loves math but he’s not very understanding if you don’t pick up quickly. He hardly gives partial credit and won’t hesitate to take off full points if your answer doesn’t match his preferred method, even if it’s technically right. Only take this if you’re really good at math and can put a lot of time into studying his methods.", "rating": 2, "expected_grade": "C-", "created": "2023-11-04T03:49:49.597437Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH140H", "review": "Professor Berhanu is a very good teacher, he just teaches through proofs and some simple examples. I was prepared for this kind of teaching as I had a similar teacher in high school. However, many people struggle with this kind of teaching. His exams are very easy and just a test on how well you know the concepts. I would recommend him to anyone who is a quick and deliberate learner.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T21:00:36.407528Z"}, {"professor": "Alex Safsten", "course": "MATH140H", "review": "He's a really great professor and makes this hard class durable. His exams are never crazy hard, and while some of the classwork and homework may challenge us, he made it clear that the exams are not meant to stretch the material but test us on the concepts we should already know. He made the exams medium level so not crazy easy but never types of problems that we hadn't seen and worked with before. No curveballs on the exams. His lectures move fast, but because we only meet 3 times a week, we do have a lot of material to cover. I took advantage of office hours and he is very flexible with availability. Overall, he is a really understanding and caring professor. If you need extensions on the homework, he is flexible and understanding and will grant them will no points off. While calc 1 may not be the easiest class, this is most definitely the professor you want if you have to take this course.", "rating": 5, "expected_grade": "A", "created": "2023-12-16T20:33:05.628834Z"}, {"professor": "Alex Safsten", "course": "MATH140H", "review": "He's a really great professor and makes this hard class durable. His exams are never crazy hard, and while some of the  classwork and homework may challenge us, he made it clear that the exams are not meant to stretch the material but test us no the concepts we should already know. He made the exams medium level so not crazy easy but never types of problems that we hadn't seen and worked with before. No curveballs on the exams. His lectures move fast, but because we only meet 3 times a week, we do have a lot of material to cover. I took advantage of office hours and he is very flexible with availability. Overall, he is a really understanding and caring professor. If you need extensions on the homework, he is flexible and understanding and will grant them with no points off. While calc 1 may not be the easiest class, this is most definitely the professor you want if you have to take this course.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T00:08:25.293927Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH140H", "review": "After reading other reviews, I do agree that Professor Berhanu is a bit of a harsh grader with not much partial credit, but compared to every other Math140 teacher, his tests are the easiest. I looked at friends' tests and they were much trickier, if you understand the concepts then you will get a decent grade in Berhanu's class. If you participate in class Berhanu will boost your grade at the end of the semester, sit in the front and answer the many basic questions he asks during class. But make sure you are right because he is a bit passive aggressive if you get the answer wrong. \r\n\r\nThe Webassign homeworks were only worth 3% which was very nice because they are the same for every section, they take a long time to do and usually do not have content that will even be on the test. If you do the practice exams, and can follow most of the lecture, you will do fine.\r\n\r\nMath140H vs Math140 is a hard choice because H is only 3 times a week, but the quizzes we have are more difficult, but I think it is best to take H unless math is a major sore spot. With H you get more time with the professor (smaller class) and the professors are usually better. Although with normal 140 there are discussions where you work problems out and do easy quizzes, you also get a TA which can be helpful.", "rating": 4, "expected_grade": "B-", "created": "2023-12-23T18:21:39.196570Z"}, {"professor": "Clarke Safsten", "course": "MATH140H", "review": "I highly recommend taking Prof. Safsten for any math course. He was generous, kind, funny, and always smiled throughout the semester. He is very understanding when it comes to missing the online homework assignments; he will grant extensions simply asking him. Additionally, Prof. Safsten explained the fundamental contents of Calculus I thoroughly. He teaches the class following the assigned chapters in the textbook. You can find the schedule of chapters in the syllabus he provides.  \r\n\r\nSince this was an H-course, there were some topics that the course skipped over, however, these topics were not covered in the Final, so no need to fret. All four midterms consisted of topics covered in class using the required textbook. He was a gracious grader; you can expect little points to be taken off if there were any algebraic errors leading to your final answer. In addition, you can challenge any grade you believe is unfair or miscalculated. The quizzes that Prof. Safsten would hand out were completely fair. They usually consist of two questions that require no more than 10 minutes. The quizzes usually cover the topics covered for that week. He automatically drops the lowest grade on one of these quizzes for your calculated grade. \r\n\r\nOne thing that I was not a fan of throughout the course was the graded discussion sheets. Prof. Safsten does not grade these discussion sheets as he hands them off to a TA to be graded. I was not aware of who the TA was, but there were instances where the TA would remove up to 1 or 2 points out of a 10-point worksheet. You can probably ask him to regrade the worksheets. \r\n\r\nExcellent teacher. I highly recommend Prof. Safsten for students seeking out a generous teacher in the math department.", "rating": 5, "expected_grade": "A", "created": "2023-12-26T18:49:46.109307Z"}, {"professor": "Clarke Safsten", "course": "MATH140H", "review": "Safsten is a pretty good professor. He wants his students to succeed and will put time into talking out a problem with you during office hours. He may seem a little hard at first but is pretty nice when grading and almost never takes full points off unless the approach for the question was completely off.", "rating": 5, "expected_grade": "A", "created": "2024-01-26T02:28:30.263395Z"}], "department": "MATH", "course_number": "140H", "name": "MATH140H", "title": "Calculus I", "credits": 4, "description": "<b>Prerequisite:</b> Minimum grade of C- in MATH115. Or must have math eligibility of MATH140 or higher; and math eligibility is based on the Math Placement Test.\n<b>Credit only granted for:</b> MATH120, MATH130, MATH136, MATH140 or MATH220.\nIntroduction to calculus, including functions, limits, continuity, derivatives and applications of the derivative, sketching of graphs of functions, definite and indefinite integrals, and calculation of area. The course is especially recommended for science, engineering and mathematics majors.\n<i>For general honors students only. Offered fall only. All sections will require the use of a TI graphics calculator. Instructor will use a TI-83 TI-83+, TI 84, TI 84+, TI 86, or TI 89 calculator.</i>", "is_recent": true, "geneds": null}