{"average_gpa": 3.589970501474927, "professors": ["Robert Koulish", "Michael Spivey", "Martin Kobren", "Brian Gilmore", "Robert Koulish", "Brian Gilmore", "Christine White", "Robert Koulish", "Robert Koulish", "Christine White", "Robert Koulish", "Christine White"], "reviews": [{"professor": "Martin Kobren", "course": "MLAW304", "review": "Mr. Kobren is one of my favrite professors! His non-grading struture for this course really provokes free speech and learning without any concern about grades. Once he notices your growth in the class, he would give you an A. And I think this is what a true pre-law professor should do. ", "rating": 5, "expected_grade": "A", "created": "2020-12-16T20:20:51Z"}, {"professor": "Brian Gilmore", "course": "MLAW304", "review": "Really good guy, can teach really well, however it is a really dry class. Basically two times a week, with no discussion section. The TA leads the class half the time, which is both a good and bad thing. Content covered is not bad, its just really boring, however you can essentially ignore all of it, as there is no midterm or final, not even quizzes. Readings are basically optional, except for these checkpoints we would do, which is a one sentence description of what a text is about. There are a few assignments here or there which are not bad, the final is a 12-14 page pager and you have about 2 weeks to do it. A huge part of the grade comes from checkpoints and participating in class. Great class, would recommend.", "rating": 5, "expected_grade": "A", "created": "2021-12-04T12:49:45Z"}, {"professor": "Brian Gilmore", "course": "MLAW304", "review": "I loved having Professor Gilmore! His lectures were very interesting, and going to class was never boring (when he was teaching - some days were taught by the TA which were no fun). Lots of reading but not always necessary, and a good amount of writing assignments, but I still enjoyed the class. I recommend Prof. Gilmore for law classes!", "rating": 5, "expected_grade": "A+", "created": "2021-12-16T18:58:05Z"}, {"professor": "Robert Koulish", "course": "MLAW304", "review": "Very interesting guy. Kinda of just rambles on and is not organized at all. The readings and due dates are always changing. Its a required course and its not HORRIBLE. But its a 2.5 hour class and its pretty hard to stay engaged. The exams are worth like 5% so its not hard, theres a few assignments. He hates technology so you can only write in a notebook and then you turn it in and all your assignments are in that notebook. Again not horrible, kind of just seems like a waste of time sometimes and the 2.5 hour class is difficult", "rating": 3, "expected_grade": "A-", "created": "2023-03-28T17:17:01.069777Z"}, {"professor": "Christine White", "course": "MLAW304", "review": "I hate to have to give a low rating because she is super nice and I think pretty interesting. However the semester ends in a week and not one non-participation thing has been graded. Impossible to know where you stand if your on the right track or anything. Would avoid the headache if you can.", "rating": 2, "expected_grade": "B", "created": "2023-12-04T02:03:20.985955Z"}, {"professor": "Christine White", "course": "MLAW304", "review": "I want to be clear - Professor White is incredibly sweet, super nice, and very knowledgeable about law and society. However, the class seems to be very disorganized. By early December, only 3 out of 17 assignments had been graded, so you never knew how you were doing in the class. Discussion posts were disorganized when they were posted, and some were difficult for students to find on Canvas, making it challenging to complete them without missing any. Now, don't get me wrong; this class seems pretty simple and easy. However, as I am writing this in late December after finals are over, with 8 assignments worth 80% of my grade yet to be graded, I have no idea how I am truly doing. This is frustrating and disappointing and puts a damper on what was really an interesting class. While I recommend her as a professor, this class can truly be a headache, as another reviewer said, and something that should be known.", "rating": 2, "expected_grade": "", "created": "2023-12-21T01:12:31.094983Z"}], "department": "MLAW", "course_number": "304", "name": "MLAW304", "title": "Introduction to Law and Social Inquiry", "credits": 3, "description": "<b>Restriction:</b> Must be in the Law and Society (MLAW) minor.\nAn exploration of the relationship between law and society from an interdisciplinary perspective. Major themes cover the impact of law on society, society on law and social change.\n<i>An exploration of the relationship between law and society from an interdisciplinary perspective. Major themes cover the impact of law on society, society on law and social change.</i>", "is_recent": true, "geneds": null}