{"average_gpa": 3.1131348511383536, "professors": ["Peter Carruthers", "Peter Carruthers", "Aida Roige Mas", "Michael McCourt", "Aida Roige Mas", "Michael McCourt", "Peter Carruthers", "Peter Carruthers"], "reviews": [{"professor": "William Fenton", "course": "PHIL202", "review": "chill dude, very pleasant", "rating": 5, "expected_grade": "A-", "created": "2019-09-24T03:26:50Z"}, {"professor": "Peter Carruthers", "course": "PHIL202", "review": "PHIL202 is the same as 209, pretty sure. Like everyone was saying, it's a lot more of a psyc class than Phil, but there was still a lot of interesting course material that was really cool to learn.\r\nI had this class over zoom and it was done asynchronously. Each week, he posted a 10 minute video of him introducing the topic, and then two slide shows which taught the topics of the week. Fridays we had a discussion section with the TA.\r\nHere are my thoughts on that: I really wish he would have posted video lectures instead of slide shows. The 10 minute weekly video was always very nice. It was entertaining and intelligent, and I felt myself engaged. The slide shows, though they were very interesting, were not engaging. I found myself always just doing a whole week's worth of material Thursday night before taking the weekly quiz. I think I would have gained so much more from the class if it were done through video lectures, even asynchronously.\r\nStill, overall I found him to be a solid teacher.", "rating": 4, "expected_grade": "A", "created": "2020-12-18T17:23:09Z"}, {"professor": "Peter Carruthers", "course": "PHIL202", "review": "Prof. Carruthers was an enjoyable lecturer and made the class enjoyable, I also had a great TA so that helps. The course content is fascinating and the amount of work is very manageable and the expectations are very clear. Most of the course decisions are founded on some empirical finding, which is nice and kinda cool. The biggest downside was having to read the PowerPoint lectures, I wish they could have been presented verbally. Overall, this was one of the most interesting courses I've taken at UMD and Prof. Carruthers was a big part of that even with the limited interactions.", "rating": 5, "expected_grade": "A", "created": "2021-05-08T20:10:59Z"}, {"professor": "Shen Pan", "course": "PHIL202", "review": "Shen was a TA for my PHIL202 course online during Spring 2021. He expertly lead discussions in a way that encouraged people to question their understanding and to think critically about everything, but he was not demanding in any way, literally asked for the bare minimum. I will be going out of my way to take his courses in the future.", "rating": 5, "expected_grade": "A", "created": "2021-11-19T16:29:46Z"}, {"professor": "Peter Carruthers", "course": "PHIL202", "review": "Lectures are extremely interesting, and he grades fairly. You can get an A without going to lecture with a little leg work to understand his sometimes confusing slides. Quizzes weren't bad. Would take him again. ", "rating": 5, "expected_grade": "A", "created": "2021-12-16T23:32:38Z"}, {"professor": "Michael McCourt", "course": "PHIL202", "review": "In terms of logistics, he is great. The class is straightforward and easy (as long as you properly engage with the material). There's always readings accompanied by quizzes and discussions, with just three projects throughout the semester. His lectures are clear, and he really gets the topics across. His discussions spark conversation between students, and end up giving some valuable insights at the end of the day. I'd take him for most of my classes if I could, but unfortunately I took this course as a gen-ed.", "rating": 5, "expected_grade": "A", "created": "2024-01-14T00:06:47.643242Z"}, {"professor": "Peter Carruthers", "course": "PHIL202", "review": "The lectures are fine - kind of jumbled and he usually gets off topic pretty easily. The content is easy to understand and quite interesting. But his quizzes are awful. Limited time frame to take them, you get a very short amount of time, and you only get one submission. You have to take a quiz every week, read 2 scientific journals, make a discussion board post, and present at your discussion. Not to mention the 5 essay exams. Don't take this class for an easy gen ed, it's way too high maintenance.", "rating": 2, "expected_grade": "C", "created": "2024-02-01T20:39:07.816540Z"}], "department": "PHIL", "course_number": "202", "name": "PHIL202", "title": "Know Thyself: Wisdom Through Cognitive Science", "credits": 3, "description": "<b>Credit only granted for:</b> PHIL209N or PHIL202.\n<b>Formerly:</b> PHIL209N.\nHow do we improve our decision making? Cognitive science demonstrates that self-knowledge isn't as easy as we think, and that there are numerous biases and fallacies that impact our decision-making in ways that are hard for us to be aware of. In this course you will learn what some of these are and how they have been discovered, and you will explore potential strategies for avoiding these fallacies and for making wiser choices.", "is_recent": true, "geneds": null}