{"average_gpa": 3.890344827586207, "professors": ["Kendall Bustad", "Kendall Bustad", "Kendall Bustad"], "reviews": [{"professor": "Kendall Bustad", "course": "PHSC450", "review": "Phsc450 is honestly not a hard class! A lot of the grade weight is the weekly lecture and section assignments, and as long as you turn them in on time (and answer the questions) you get all the points. This is one of the first times this class is being taught, so I don't know if they will change it up, but the final is a group poster presentation and she cut out the final paper so we didn't have to do it. I was lucky and had a good group in the discussion which gave me a good experience with the class. There were lecture discussion assignments for a grade on Wednesdays, so like no one was in class on Mondays, but I still went and found it helpful. That being said, the content of the class is just public health stuff you have heard before for the first half of the semester, and then it switches to an intervention focus in the second half. The first midterm was really easy, info straight from the notes and multiple choice. The second midterm was harder, free response, and i don't think there was enough time but it seemed to be graded pretty easy. You are given time in the discussions to do the weekly section assignments, and they were almost all working together with your group, but it was nice they were due right before your next discussion in case you needed more time. I found this class pretty easy and did not spend much time weekly on it. If you turn in all the things for this class and give at least some effort, you should get an A! Dr. Bustad is also a great professor, people might say she has some uptight expectations, but they are pretty realistic and she is willing to work with issues if you bring them to her in a reasonable time!", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T22:45:18.733329Z"}], "department": "PHSC", "course_number": "450", "name": "PHSC450", "title": "Interdisciplinary Applications of Public Health", "credits": 3, "description": "Focus on the disciplines and disciplinary perspectives within the field of public health. Deeply explore and engage in these various disciplines through an interactive and collaborative learning experience with a focus on health promotion, health protection, and health services. Develop the knowledge and skills needed as future team members working with colleagues from diverse fields in public health. Work collaboratively to explore and address historical and contemporary public health problems and apply problem solving methodologies to analyze various public health issues from local, national, and global perspectives using an Interprofessional Education (IPE) lens.", "is_recent": true, "geneds": null}