{"average_gpa": 2.561770428015564, "professors": ["Ki-Yong Kim", "Christopher Lobb", "Bei Lok Hu", "Peter Shawhan", "Arthur La Porta", "Rajarshi Roy", "Kara Hoffman", "Christopher Palmer", "Christopher Palmer", "Eun-Suk Seo", "Christopher Palmer", "Eun-Suk Seo", "Christopher Palmer"], "reviews": [{"professor": "Ki-Yong Kim", "course": "PHYS171", "review": "He is one of the worst teachers I have ever had. When he is teaching he makes too many mistakes in his equations and does not give good explanations. The book is twice the teacher he is. You must have the book required because that is where you actually will learn. Do not get this professor.", "rating": 1, "expected_grade": "", "created": "2012-05-16T19:26:00Z"}, {"professor": "Rajarshi Roy", "course": "PHYS171", "review": "His reviews can get a bit dry sometimes because he reads straight from the book and covers the easy material slowly but the difficult material quickly, but he's a very approachable and nice guy, and he always treats his students with respect.", "rating": 4, "expected_grade": "A", "created": "2019-05-31T00:50:50Z"}, {"professor": "Rajarshi Roy", "course": "PHYS171", "review": "Great & friendly, def recc talking in class bc he's nice and does fun demos", "rating": 5, "expected_grade": "A", "created": "2019-11-16T04:31:10Z"}, {"professor": "Christopher Palmer", "course": "PHYS171", "review": "Did a decent job of explaining material, was relatively understanding with students. Was kind of annoying about attendance and the grading on homework was unnecessarily weighted towards minor details like whether you remembered to write 'conservation of energy' and stuff like that IMO. But I can see the logic behind it.", "rating": 3, "expected_grade": "A", "created": "2021-12-27T04:20:06Z"}, {"professor": "Kara Hoffman", "course": "PHYS171", "review": "Dr. Hoffman is one of those professors who is a wonderful person and a great scientist but not a stellar teacher. My main quibble is that she teaches off of slides but reads them word for word,  without adding much during lecture. She often struggles to convey what she wants to say as well. If I hadn’t taken AP Physics in high school, I doubt I would’ve done nearly as well in her class. That said, she truly cares about her students and I personally thought that her exams were quite good for a physics course.", "rating": 3, "expected_grade": "A", "created": "2022-05-06T00:20:21Z"}, {"professor": "Kara Hoffman", "course": "PHYS171", "review": "Extremely inconsiderate and completely devoid of any empathy. Lectures were boring and monotonous, and there’s lots of homework (it’s all hard.) would not recommend even though I currently have an A in the class.", "rating": 1, "expected_grade": "A", "created": "2022-05-06T09:26:02Z"}, {"professor": "Kara Hoffman", "course": "PHYS171", "review": "Her TA is the only reason I’m surviving this class. She missed our last final review session and was unable to coordinate a sub. Very nonchalant about the worries or successes of her students ", "rating": 2, "expected_grade": "A+", "created": "2022-05-16T13:07:48Z"}, {"professor": "Christopher Palmer", "course": "PHYS171", "review": "Didn't really do a good job of explaining material. Just did his lectures through power points. Is very annoying about attendance 10-15% of your grade. Won't really tell you what to expect on exams and his written homework consists of 15+ questions. He is a nice guy tho and he just started teaching so maybe he'll get better over time. Overall I would go with another professor.", "rating": 2, "expected_grade": "B-", "created": "2022-12-01T08:04:17.278825Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS171", "review": "Dr. Seo is really nice and her class is not hard to pass at all. There are 3 exams total, and your lowest grade is dropped completely. There are also weekly quizzes, but they are completely optional and worth extra credit. However, when it comes to teaching, Dr. Seo's teaching can get very confusing as she overcomplicates topics and when she writes on the board, it is an incomprehensible mess. Her accent is not hard to understand at all, and she is loud enough in my opinion. On exams, there are some major points of disconnect between what her/the TA write and the assumptions we believe we can make based on how the exams written. The homework assignments are also decently hard. Overall, if you have a good group to study with, attend discussions, and ask questions, your grade will be fine. But having a good study group is CRUCIAL. I also think she is harsh and blunt with how she talks to people at times, like if you ask a question she thinks you should already know or if you give a completely wrong answer, she will let it be known and make you feel dumb for it--which I really did not like. But she really does try to be nice throughout the course. If you have a better option I would say take it but if not, you are in decent hands with Dr. Seo and will learn what you need to.", "rating": 3, "expected_grade": "A-", "created": "2023-05-02T23:21:23.024039Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS171", "review": "I didn't like her lectures, because she lectures from slides and is very rushed and all over the place on her chalkboard. The chalkboard was on the side of the projector and she would start writing tiny when she was running out of space, instead of just erasing unnecessary stuff, or just getting ride of the board altogether. \r\n\r\nOn the other hand the first two exams are beyond easy, and 1 out of three exams gets dropped. So even though class average on the 3rd exam was a 57, the other two had averages in the 80s and since I took 2 years of physics in high school, the topics were familiar and easy to navigate. \r\n\r\nHer attitude after the 3rd exam was also a little off: She suggested that we just had been slacking off which was why the average was low. No we weren't, it's just a much harder topic and her lectures were never good but when its an unfamiliar topic and awful (even worse than before because it's more nuanced) lectures about it, that is going to reflect in the grades. \r\n\r\nThere were a few instances where she got irritated at people asking questions which confused her and she started yelling about how they don't know what they're talking about. \r\n\r\nThe TA was wonderful and her discussion and office hours is helpful. \r\n\r\nI also recommend taking PHYS172 with it (1 credit pass fail course which is just an extra 171 lecture), the professor Shawhan is a great additional once/week lecture and was in my opinion much more helpful than Dr. Seo. \r\n\r\nShe's such a sweet, funny lady so it pains me to say this, but I hope she can improve her lectures in the future.", "rating": 2, "expected_grade": "A", "created": "2023-05-05T00:58:54.472703Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS171", "review": "Dr Seo is living proof that being a good person and a good researcher does not under any circumstances make you a good professor. Seo’s lectures were borderline incomprehensible and her TA was almost hilariously harsh on grading. The only silver lining is once you get through that, the class is very very easy. However, this was going to be a 3 star review until the final. We don’t get practice tests, so we were counting on it being somewhat like the midterms. It was not. The final was full of questions that were either borderline impossible or we just did not learn. Dr Seo is a very sweet person and clearly loves her students, but her class simply does not reflect it.", "rating": 2, "expected_grade": "B", "created": "2023-05-21T17:56:02.208417Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS171", "review": "Lectures were incomprehensible. Its only phys171 but the drawings she wrote on the board looked like they were from a 400 level class. I only got an A because I was able to get through the first two midterms with prior knowledge. On the bright side she is very nice and has an easy grading policy with your lowest midterm being completely dropped.", "rating": 2, "expected_grade": "A-", "created": "2023-06-25T20:41:51.147756Z"}, {"professor": "Christopher Palmer", "course": "PHYS171", "review": "Not really the best professor but a nice guy. As the other reviews have mentioned, he kinda just reads off the slides and even the slides are not that helpful. He kinda expects us to know everything from the book or to just have a great background on it already but that's kinda not how it should be because not everybody has the same background.", "rating": 1, "expected_grade": "B-", "created": "2023-10-03T21:17:07.496304Z"}, {"professor": "Christopher Palmer", "course": "PHYS171", "review": "He mainly uses PowerPoints to teach the class, which can sometimes get boring and irrelevant. He is very high on 'peer learning' which often means he organizes you into learning pods, but it doesn't really help you gain any extra knowledge. He is also very keen on daily class attendance (and is graded) which can be annoying because his classes don't seem to add much value. The textbook that he recommends and uses for this course isn't the best at explaining concepts and can leave you confused. I ended up having to rely on alternate textbooks. He assigns a ton of homework - both online (on Pearson IIRC) and questions from the textbook. Only a few of those are graded but you are expected to do all of those because you don't know which ones are graded. It just seems so much commitment and homework for an introductory physics class.\r\n\r\nHis exams aren't tough, and he drops your lowest exam which really helped me save my grade. He is helpful if you go to his office hours.", "rating": 2, "expected_grade": "A", "created": "2023-10-10T03:49:11.834462Z"}, {"professor": "Christopher Palmer", "course": "PHYS171", "review": "He never teaches in class, all he does is \"examples\" in his head on the board. He doesn't teach any of the material needed for the exam in class, that is all done on your own. I would be okay if attendance was optional, but he feels that it is imperative that you come to class to waste your time with him.", "rating": 1, "expected_grade": "A-", "created": "2023-11-15T14:42:55.970956Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS171", "review": "lectures generally not helpful at all. Any prior knowledge can grant a easy pass. if you had ap physics it will be a easy A+, otherwise it is very hard to say. Dr Seo is a fine professor, answers questions and does office hours as fine professors do. on the other hand, there are two things considered significantly downside: 1, class participation through a scan bar code and vote on google form, kind of need to exist there in class (slight portion on grades, does not matter that much); 2, the TA grades the written homework (expertta hw but also need to submit written process) harshly to the content of not exactly making sense (worse than high school rubric), tried very hard on deducting points.", "rating": 2, "expected_grade": "A", "created": "2023-11-15T17:49:00.543039Z"}, {"professor": "Christopher Palmer", "course": "PHYS171", "review": "Idk what these reviews are on about...Palmer's pretty fantastic. \r\n - Yes, attendance is a part of your grade. But all you have to do is put literally any answer into the Learning Catalytics session each class, and boom, you've just got a free 12% of your grade. \r\n- Homework's twice a week: one part online, with super easy conceptual problems. The written section is usually ~15 problems, again not too bad\r\n- As a lecturer, he's perfectly good. He's no Fawzi/Nelson (for the cs majors), but he decently explains how to go about solving all the problems we cover in class, and is incredibly open to any kind of question in class/in office hours.\r\n- The big thing tho: he gives you his past exams. Not only that, he ALWAYS reuses AT LEAST 1 question (or a very similar problem) from his past exams on his current exams. This even happened on the final. If that doesn't help guarantee at least a B+ on every exam for everyone, idk what will. \r\n - One thing I will note: you might wanna buy a Giancoli textbook, because the Mazur one he uses is (imo) pretty terrible at explaining everything past 2d kinematics.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T16:34:12.186331Z"}, {"professor": "Christopher Palmer", "course": "PHYS171", "review": "He is a nice person in general, but not a a great teacher. He reads off slides in his lectures and it is often hard to follow. A large percentage (12%) of the grade depends on class engagement, so it becomes pretty important to attend lectures. He also assigns a lot of written HW - anywhere between 12-20 questions every week, but we barely receive any feedback on HW. If your background in the concepts taught is not very strong, his lectures get even harder to follow. What I do like about the structuring of this course is how each unit introduces a fundamental larger concept in physics and how he sort of connects everything with each other. Overall, he is an understanding and helpful person, but his teaching could be much better.", "rating": 3, "expected_grade": "A", "created": "2023-12-21T00:35:41.037454Z"}], "department": "PHYS", "course_number": "171", "name": "PHYS171", "title": "Introductory Physics: Mechanics and Relativity", "credits": 3, "description": "<b>Prerequisite:</b> (MATH140; and a high school physics course); or permission of CMNS-Physics department. And must have completed or be concurrently enrolled in MATH141.\n<b>Credit only granted for:</b> PHYS141, PHYS161, or PHYS171.\nFirst semester of a three semester sequence for physics majors and those desiring a rigorous preparation in the physical sciences: kinematics, Newton's laws, energy and work, linear and angular momenta, temperature and pressure, ideal gas law, and special relativity.", "is_recent": true, "geneds": null}