{"average_gpa": 2.9159975293390983, "professors": ["Alan Peel", "Matthew Bobrowsky", "Matthew Severson", "Matt Severson", "Matt Severson", "Matt Severson", "Matt Severson"], "reviews": [{"professor": "Matthew Severson", "course": "PHYS102", "review": "I like the grading - it's very reasonable. Clickers (participation) but he drops a bunch of them, 2 exams, 6ish homework assignments, one final project. \r\n\r\nI wish the class notes were not handwritten (he wrote them with a tablet or something), even though I understand why they were - he was rewriting this class while teaching it. His handwriting isn't even bad, it just makes finding stuff in the notes really time-consuming since you can't Ctrl-F terms. Had great examples of concepts to show in class, with lots of videos and stuff. \r\n\r\nHe is good at responding to emails and generally pretty friendly.", "rating": 4, "expected_grade": "", "created": "2019-12-01T21:11:45Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "The class wasn't really hard but you can tell he's the type of guy that knows so much about his subject area that he doesn't realize what is common knowledge or easy to understand and what isn't. He also wasn't always that nice when people asked questions but I think that might be because he's a little awkward. He tries to be chill and relatable which is at least kinda nice and he would bring out his guitar and give demonstrations when we were talking about music theory which was cool. I wouldn't purposely take another class of his but he's not bad just kinda average. (I also don't really like physics and had never taken phsyics before)", "rating": 3, "expected_grade": "A", "created": "2020-11-10T20:57:50Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "Matt was super chill and the class was interesting. The material was straightforward and the final ppt was fun to do. ", "rating": 5, "expected_grade": "", "created": "2021-01-19T16:22:52Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "not a great teacher. he knows what he's talking about but he complicates the topics. he's also pretty rude to students if they ask a question which is super weird of him. the only saving grace in this course was one of the TA's who would go over the homeworks and host review sessions. without her, I would be failing this class. don't take this class if you're looking for an easy natural science lab. ", "rating": 2, "expected_grade": "B-", "created": "2021-12-11T20:07:04Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "Not a great class. Mostly learning about sounds waves, frequency, and production but also a lot of memorization involved (especially about the different parts and characteristics of many instruments towards the end of the semester). There were 6 homework assignments, a lot of them I needed help with so definitely use the TA office hours for help. 3 exams, not cumulative, but a good bit of studying and memorization is involved. 1 final group project on an instrument of your choice. Honestly didn't feel like I learned a lot and there are definitely better options if you need to take a gen ed science.", "rating": 2, "expected_grade": "B", "created": "2021-12-16T14:33:45Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "Very easy class. I was able to get an A- by sleeping through most of the lectures. Just make sure you get all the participation points. There's also no final exam. ", "rating": 4, "expected_grade": "A-", "created": "2021-12-27T01:52:57Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "I liked him as a person. He was a decent lecturer and seemed to care about the content. The material itself was fairly easy, with just a couple of homeworks and three exams that were all equally weighted (with no cumulative final).", "rating": 4, "expected_grade": "A", "created": "2022-02-18T20:49:08Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "HE SUCKS. Never take this class with this professor ever. His TAs grade papers wrong and are inconsistent with point distribution. Matt gives no help when you go to him to complain about grading. He gives you sass and attitude. He markets himself as a nice professor till you go to him and he’s a total asshole.", "rating": 1, "expected_grade": "B-", "created": "2022-10-25T14:56:23.025059Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "The class was basically a music theory course and focused way more on music than it should've. He was a little snippy at office hours and the TA's didn't show up to their office hours or help in any case, so you kind of had to teach yourself for the class", "rating": 3, "expected_grade": "A", "created": "2022-12-12T03:37:22.601640Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "This class is HORRIBLE. I am a HESP major and it is required but it is mostly about instruments and music. Severson has graded almost nothing  and we took the final two weeks ago. I have no clue what my grade is and I went to office hours to ask about my grade and he had no excuse just said he’s behind on grading. Ridiculous class to do badly in.", "rating": 2, "expected_grade": "B", "created": "2022-12-22T01:08:59.350197Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "In terms of the professor: He's a pretty decent lecturer. He would sometimes take some time to draw out diagrams on the chalkboards during lectures to explain certain concepts. It helps show dynamically how things change. The grading for assignments was very slow; at least a third of the assignments weren't graded until after the final. Since the course is also about music, he would bring his own instruments to the class sometimes to explain some of the concepts as well, which was helpful since I had zero knowledge about anything musical.\r\n\r\nIn terms of the course: The course was originally labelled as The Physics of Sound and Music, but it's currently labelled as The Physics of Music. So, the course is about both sound itself and music/instruments; but, the course is more heavily focused on the instrumental aspect. There were several TurningPoint participation grades that happened randomly throughout the lectures; so, we never really knew when they would happen. But, they were graded on completion rather than correctness. There were 3 exams total, including the final. The exams were pseudo-cumulative, in that you weren't tested directly on past material, but some of the later concepts were built off of previous concepts. There were 6 homework assignments that were online on ELMS. They were usually a mix of multiple choice, fill-in-the-blanks, and short answers. Some of the stuff on the homework were either never explained in lecture or weren't explained at all, which made it hard to get a good grade on some of the homework. There is a final group project that is given in the middle of the semester and due by the last day of classes. My semester's consisted of doing a presentation on a instrument of your group's choice (e.g., history, physics, etc.). However, it was a recorded presentation instead of having to present it in front of the lecture hall. After the project, there's also a participation point where you watch other groups' recorded presentations and comment something like a discussion post. There is math involved throughout the course given that it's a Physics class. It's mostly simple math except for a few concepts here and there. Lecture \"notes\" are provided/uploaded onto ELMS, which are the lecture slides that he uses in class; they're provided right before class starts.", "rating": 4, "expected_grade": "A", "created": "2023-01-24T22:13:37.028027Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "Professor Severson is an okay professor. His lectures can definitely get boring at times, but all the information you need are on the slides for the exam. He has random clicker questions sprinkled throughout his lectures that count as participation/attendance, but usually the dates are posted on Canvas beforehand in the assignment. He's a bit slow with grading as well. Overall, you'll probably be doing a good amount of self-study outside of class to solidify your understanding of the concepts for the exam. There are homework assignments but usually you can see the answers after your first attempt (unlimited attempts and unlimited time), although for the last couple of homeworks that wasn't the case. Not a terrible class, but one I'm definitely glad to be done with.", "rating": 4, "expected_grade": "A+", "created": "2023-12-06T22:45:14.754384Z"}, {"professor": "Matthew Severson", "course": "PHYS102", "review": "I would just avoid this class in general, we were extremely behind schedule as he spent 3 lectures on the same slideshow. However, he is pretty laid back and gives plenty of time on the homework assignments due and multiple attempts. However, this laid back personality is not beneficial for exams because you aren't given a lot of practice material, and the exams are made a day before they are given(at least that what was said and felt like).", "rating": 2, "expected_grade": "B", "created": "2023-12-13T22:11:49.056680Z"}, {"professor": "Matt Severson", "course": "PHYS102", "review": "Took this class as my GenEd science with lab and it is a decent choice for the GenEd credit but sometimes is a lot of work. The professor would always push back exams and assignments at the last minute because he was behind in lectures. His lecture slides are outdated (from the Fall of 2021) and he rambles on about irrelevant information that had no relevance to the exams. He was also very unapproachable from my experience, from office hours when his door is almost shut with the lights off to emails that are not professional and are very little help. He also did not follow the rule of grading final exams within 48 hours and that was probably because we still had 2 homework assignments ungraded. Overall, the workload was not much. You had unlimited homework attempts, 3 exams, a project, and attendance questions. But the class is boring and the professor is not the greatest.", "rating": 3, "expected_grade": "A", "created": "2023-12-27T19:36:55.513843Z"}], "department": "PHYS", "course_number": "102", "name": "PHYS102", "title": "Physics of Music", "credits": 3, "description": "<b>Prerequisite:</b> Must have math eligibility of MATH107 or higher.\n<b>Credit only granted for:</b> PHYS102 and PHYS499C.\n<b>Additional information:</b> CORE Distributive Studies Physical Sciences Laboratory Course only when taken concurrently with PHYS103.\nA study of the physical basis of sound, acoustical properties of sound, the human ear and voice, reproduction of sound, electronic music, acoustical properties of auditoriums, and other selected topics.", "is_recent": true, "geneds": null}