{"average_gpa": 3.487570621468927, "professors": ["Michelle Girvan", "Rabindra Mohapatra", "Erin Sohr", "Rabindra Mohapatra", "James Drake", "James Drake"], "reviews": [{"professor": "Frederick Wellstood", "course": "PHYS260H", "review": "Exams are fair, I didn't think his lectures were worth my time, but he gave out attendance quizzes so I went anyway. No idea how much the quizzes are worth. I took the Honors version and the only difference was a dedicated discussion and an extra three or four homework problems total, which was nothing. This is definitely an easy H-version compared to others I've taken. ", "rating": 4, "expected_grade": "", "created": "2014-12-01T18:12:00Z"}, {"professor": "Rabindra Mohapatra", "course": "PHYS260H", "review": "This dude was hilarious, especially when he did the demos for any topics we covered. He's one of the greatest professors of all time, and 260 was one of the best classes I've taken at UMD. I absolutely would not take the class again since I learned the content so well, but I would take another of his classes again in a heartbeat. The only thing I disliked was mastering physics, but I guess they don't really have any other way of assigning homework for these huge lecture classes.", "rating": 5, "expected_grade": "A+", "created": "2019-11-06T21:17:09Z"}, {"professor": "Rabindra Mohapatra", "course": "PHYS260H", "review": "He is a sweet guy, but in the online format he did not use the technology well and taught purely off slides. His lectures covered derivations and concepts and we did not do that many practice problems in class. The exams were fair except for the final, but there was a huge curve at the end of the class.", "rating": 4, "expected_grade": "A+", "created": "2021-01-27T22:51:29Z"}], "department": "PHYS", "course_number": "260H", "name": "PHYS260H", "title": "General Physics: Vibration, Waves, Heat, Electricity and Magnetism", "credits": 3, "description": "<b>Prerequisite:</b> PHYS161 and MATH141.\n<b>Corequisite:</b> PHYS261.\n<b>Credit only granted for:</b> PHYS142, PHYS260, or PHYS272.\nSecond semester of a three-semester calculus-based general physics course. Vibrations, waves, fluids; heat, kinetic theory, and thermodynamics; electrostatics, circuits, and magnetism. PHYS260 and PHYS261 must be taken in the same semester.\n<i>If purchasing used books additional software may be required.</i>", "is_recent": true, "geneds": null}