{"average_gpa": null, "professors": ["Michael Fuhrer", "Douglas Hamilton", "Paulo Bedaque", "James Drake", "Gregory Sullivan", "Luis Orozco", "James Williams", "Richard Greene", "Jordan Goodman", "Kaustubh Agashe", "Eun-Suk Seo", "Srivatsa Tata", "Rajarshi Roy", "Jordan Goodman", "Michelle Girvan", "Rajarshi Roy", "Rajarshi Roy", "Michelle Girvan", "Richard Greene", "Michelle Girvan", "Richard Greene"], "reviews": [{"professor": "Douglas Hamilton", "course": "PHYS272H", "review": "This review is for Douglas C. Hamilton. (the physics professor!)\n\r\nProfessor Hamilton was an excellent teacher; he clearly explained concepts and was very open to students. He encouraged class discussions & participation, and was very approachable during office hours or after class.\n\r\nThe only reservation I have is that I took the \"H\" version of the phys272 class. Big mistake. There is additional homework every week (which was no big deal) but additionally, there was a 10 page paper on a physics topic of choice. It was dreadful... There are much easier H-versions, but Professor Hamilton was very good nonetheless.", "rating": 5, "expected_grade": "A", "created": "2011-02-18T00:50:00Z"}, {"professor": "Rajarshi Roy", "course": "PHYS272H", "review": "I agree with everything the previous review said, so instead of reiterating that, I'll just talk about my experience in the Honors version of 272 for anyone who's curious.\r\n\r\nThe only thing that makes this different from the regular 272 class is that we have to research a specific topic related to E&M and eventually write a paper and do a presentation of what we found at the end of the semester. That's it! Every week the Honors group would meet together with Raj and our TA and we would simply share a small summary/report of our new findings that week. The schedule is very flexible and he canceled the meetings the week before a midterm so that we could study. It was a very fun experience where I learned a lot about what I like, and Raj was visibly very supportive of everyone, which was motivating. \r\n\r\nWhether you take Honors or not, Raj would be your best choice for any physics class. He is the kindest and most understanding professor I have ever had as of yet.", "rating": 5, "expected_grade": "B+", "created": "2022-12-20T21:50:45.424648Z"}], "department": "PHYS", "course_number": "272H", "name": "PHYS272H", "title": "Introductory Physics: Fields", "credits": 3, "description": "<b>Prerequisite:</b> PHYS161 or PHYS171; and MATH141; and must have completed or be concurrently enrolled in MATH241.\n<b>Credit only granted for:</b> PHYS142, PHYS260, or PHYS272.\n<b>Additional information:</b> CORE Distributive Studies Physical Sciences Laboratory Course only when taken concurrently with PHYS275.\nSecond semester of a calculus based general physics course. Universal gravitation, electric and magnetic fields and potentials, simple circuits, Maxwell's equations in integral form. Continues the application of mathematics to conceptual models, now with more abstract components.\n<i>For general honors students only. Cross-listed with PHYS272. Credit   granted for PHYS272 or PHYS272H.</i>", "is_recent": true, "geneds": null}