{"average_gpa": 3.4821335646140503, "professors": ["Eric Luedtke", "Nina Harris", "Tiffany Ford", "Alana Hackshaw", "Ricco Hall", "Chloe Schwenke", "Erica Smith", "Ricco Hall", "Alana Hackshaw", "Ebonie Cooper-Jean", "Ebonie Johnson Cooper", "Patrina Clark", "Toby Egan", "Brandi Slaughter", "Chloe Schwenke", "Patrina Clark", "Alana Hackshaw", "Patrina Clark", "Toby Egan", "Ebonie Cooper-Jean", "Ebonie Cooper-Jean", "Ebonie Cooper-Jean", "M Apolonia Calderon Cervantes", "Patrina Clark", "Ebonie Johnson Cooper", "Alana Hackshaw", "Toby Egan", "Alana Hackshaw", "Patrina Clark"], "reviews": [{"professor": "Eric Luedtke", "course": "PLCY302", "review": "Best professor", "rating": 5, "expected_grade": "A+", "created": "2020-05-07T21:39:18Z"}, {"professor": "Toby Egan", "course": "PLCY302", "review": "I loved this subject and the professors were great. Dr. Egan teamed with Dr. Clark and the TA (Zane) was awesome. Diversity and public policy are super important. This was a good way to learn much more from teachers who care about the topic and about students. ", "rating": 5, "expected_grade": "A", "created": "2022-05-15T00:16:38Z"}, {"professor": "Chloe Schwenke", "course": "PLCY302", "review": "Prof. Schwenke PLCY 302 course was a truly a joy to take. It was very interesting learning about the intersectionality of various policy topics. She is a very organized and understanding professor. I also enjoyed her course lectures as well.", "rating": 5, "expected_grade": "A", "created": "2022-11-16T21:49:53.380581Z"}, {"professor": "Brandi Slaughter", "course": "PLCY302", "review": "Professor Slaughter is a nice woman, but her lectures are terribly boring and I have no point in attending class. She says she \"hates reading off of slides\" but does that the whole class. You have 4 learning artifacts and a final paper which are easy, but for a 2.5-hour class, she makes it dreadful. She definitely sees that everyone is bored and forces people to participate.", "rating": 3, "expected_grade": "A+", "created": "2022-11-28T01:09:14.337538Z"}, {"professor": "Chloe Schwenke", "course": "PLCY302", "review": "She is a really sweet, and very experienced professor. She is also very lenient with her grading and her classes. Attendance is not mandatory, but very strongly required. My only problem with this class is that she never posted rubrics, so if you did not go to class the day before a paper was due, you had no idea of the formatting and things she would look for on it. It was not that bad because she is an easy grader, but at the same time, it sucks because you got lots of points off because of something you had no idea you had to do. Other than wishing she gave more specific instructions, she is a great professor and a very nice person. The class is very easy, other than a discussion post a week, and three papers throughout the semester, there isnt much you have to do for it. But the lectures were very interesting and engaging, as she talked a lot about her own experiences.", "rating": 4, "expected_grade": "A", "created": "2022-12-09T02:03:56.094616Z"}, {"professor": "Brandi Slaughter", "course": "PLCY302", "review": "While the assignments were relatively straightforward, with 4 learning artifacts and a final paper that are evenly spaced out throughout the semester (all of which are relatively easy to get high marks as long as you demonstrate effort), the class was very boring as she read mostly off slides and many of the same people kept talking. The only interesting part of this class was the speakers we had halfway through the semester, as it applied some of the material through readings into the impacts on the real world", "rating": 3, "expected_grade": "A+", "created": "2023-01-16T21:46:54.258043Z"}, {"professor": "Ebonie Cooper-Jean", "course": "PLCY302", "review": "I showed up to everything, participated every class, and did super well on everything until the final. She bombed me because I didn't spend long enough on it.", "rating": 1, "expected_grade": "C+", "created": "2023-02-01T00:10:34.448594Z"}, {"professor": "Toby Egan", "course": "PLCY302", "review": "Professor Egan is very nice, knowledgable, and excited to discuss pluralism. He has no actual structure/game plan regarding course material, so the class is very easy. There is a final project and each assessment is in the form of a paper. Nothing too hard about the class, you just have to show up. I would take this class if you need an easy A for gen-ed, but overall not an interesting class at all.", "rating": 3, "expected_grade": "A", "created": "2023-04-07T23:23:44.528343Z"}, {"professor": "Alana Hackshaw", "course": "PLCY302", "review": "Super straight forward course. Lots of assigned readings, but you can easily get away with not doing them. Classes are majority lectures but sometimes group discussions for the last half. Major assignments are papers and graded very fairly if you follow the rubric. Dr. Hackshaw is great! Would recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-04-19T19:46:35.313147Z"}, {"professor": "Toby Egan", "course": "PLCY302", "review": "Great experience in Dr. Egan's class. He is flexible and has assignments that bring in students' opinions and interests. There is a good amount of in-class discussion (we even went outside when it was nice) that you won't enjoy unless you keep up with the readings. Some of my classmates who don't like public speaking did not like the testimony assignment (basically a presentation of pluralism related policy that you choose). But I enjoyed hearing about my classmates interests. Highly Recommended!", "rating": 5, "expected_grade": "A-", "created": "2023-05-13T22:41:18.284500Z"}, {"professor": "Alana Hackshaw", "course": "PLCY302", "review": "Dr. Hackshaw is an incredible professor! There were a lot of readings, but like the previous person said, you could quickly skim through them. Thursdays involved group discussions and presentations on class readings. There were a few papers, discussion posts, and a final policy brief. She is a lenient grader, but the TAs may grade differently. Best professor to take 302 with!!!!!", "rating": 5, "expected_grade": "A+", "created": "2023-05-22T19:10:36.943489Z"}, {"professor": "Ebonie Cooper-Jean", "course": "PLCY302", "review": "Although this class was about pluralism, she only talked about racism. At the beginning of the semester, she belittled students who didn’t have the same opinions as her. By the end, only 2-3 people were speaking, and they so happened to promote Cooper-Jean’s beliefs. She doesn’t respond to her emails—she relies on the TA. She expects you to read and watch hours' worth of content to prepare for class. I give her 2 stars because her lessons were engaging once you get past her “woe is me.”", "rating": 2, "expected_grade": "A+", "created": "2023-12-22T14:23:12.892226Z"}], "department": "PLCY", "course_number": "302", "name": "PLCY302", "title": "Examining Pluralism in Public Policy", "credits": 3, "description": "<b>Credit only granted for:</b> PLCY302 or PUAF302.\n<b>Formerly:</b> PUAF302.\nUnderstanding pluralism and how groups and individuals coexist in society is an essential part of the public policy process. This course will examine the ways in which the diverse experiences of race, gender, ethnicity, class, orientation, identity, and religion impact the understanding of and equitable delivery of public policy. The examination of how identity development shapes our understanding of society and influences the decision-making process is central to students' shaping policy that is truly for the people. This course will equip students with the skills needed to analyze pluralism and draw conclusions about the application of various theories to public policy issues.", "is_recent": true, "geneds": null}