{"average_gpa": 3.4077975376196985, "professors": ["Susannah Washburn", "Ricco Hall", "Nancy Lineman", "Alana Hackshaw", "Tiffany Ford", "Margaret Brindle", "Anne Kaiser", "Toby Egan", "Nancy Lineman", "Anne Kaiser", "Mathew Feehan", "Eric Luedtke", "Margaret Brindle", "Nancy Lineman", "Anne Kaiser", "Brandi Slaughter", "Margaret Brindle", "Anne Kaiser", "Nancy Lineman", "Nancy Lineman", "Margaret Brindle", "Nancy Lineman", "Gregory Ramsay", "Brandi Slaughter", "Cullen Merritt", "Nancy Lineman", "Gregory Ramsay", "Margaret Brindle", "Nancy Lineman"], "reviews": [{"professor": "Eric Luedtke", "course": "PLCY201", "review": "Amazing professor", "rating": 5, "expected_grade": "A+", "created": "2018-06-10T01:09:59Z"}, {"professor": "Eric Luedtke", "course": "PLCY201", "review": "Great guy. Class is very discussion based. Grades based on attendance, 5 quizzes (1 question, short answer response to question), 2 written papers (both very manageable), midterm, and final. Exams are written responses and fair.", "rating": 5, "expected_grade": "A", "created": "2019-12-18T07:39:25Z"}, {"professor": "Susannah Washburn", "course": "PLCY201", "review": "Washburn is the absolute best, which you probably know if you're in PL. Classwork is fair and doable, the TAs are helpful, and usually it's interesting. She's also always happy to talk to students and personable is an understatement.", "rating": 5, "expected_grade": "A+", "created": "2020-12-08T15:33:43Z"}, {"professor": "Tiffany Ford", "course": "PLCY201", "review": "great professor and person. class was very easy and work was minimal. readings were also very interesting ", "rating": 5, "expected_grade": "A+", "created": "2020-12-27T18:53:59Z"}, {"professor": "Toby Egan", "course": "PLCY201", "review": "The class is very interactive! Dr. Egan is very responsive to students and the class guests were great. It's a fair amount of work, but he does a great job supporting with information and is always accessible. Recommended!", "rating": 5, "expected_grade": "A-", "created": "2021-11-25T11:39:10Z"}, {"professor": "Toby Egan", "course": "PLCY201", "review": "This class is really fun and really easy. There is a lot of interactive aspects with personality tests to understand yourself better and there is a lot of communication with your peers through group work and discussions. You really do not need to read the readings to do well in the class, but they do take attendance every day. This class is definitely not about policy and more about leadership, however Toby still brought in guest speakers who work with policy speak for the class. There is one big group project on a social issue of your groups choice that is really fun and interesting. Toby is really easy to reach out too and is super chill about everything. He actually cares about his students and likes to meet with students to check in often. I think the organization of the class is a little off as the last 8 weeks of the semester was purely presentations which got very old. Overall I would recommend this professor and definitely the course as well. ", "rating": 4, "expected_grade": "A", "created": "2021-12-06T20:16:53Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Great class, not so much work. Professor Brindle is very accomplished in her field, and I found her very easy to talk to during office hours. We never had a quiz or a test, just a few papers throughout the class. Very manageable. Since there's not so much graded work you want to contribute in class. Definitely would recommend for an easy but interesting GenEd", "rating": 5, "expected_grade": "A", "created": "2021-12-07T16:49:09Z"}, {"professor": "Anne Kaiser", "course": "PLCY201", "review": "I liked Prof. Kaiser. She seems like a good human being. However, she is way to harsh of a grader for someone who refuses to give a rubric. If she had, I would take her grades in stride. \r\nThe classes were interesting and she led discussions well. It's just that the TA's and her grade so harshly on the most minor mistakes. It's super frustrating. \r\nShe's a very accomplished woman and I have much respect for her--it's the grading that gets on my nerves.", "rating": 4, "expected_grade": "", "created": "2021-12-07T18:19:06Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Brindle is a good professor, however, her lectures can get quite boring if you do not participate. you don't have to attend every single lecture, as long as you look over the book and go over the slideshows that she posts. You should attend somewhat though, there is a 15 percent contribution category, I don't think they actually evaluate that though, I would still show up most of the time, but if you don't really feel like going you won't miss too much. Other than that the class is pretty simple, there is a slight curve at the end, if you do badly on any assignment, just ask her if you can make revisions to it, she is very accomodating. I got a 79 on the culture audit the first time, then I asked if I could redo it, emailed her why I should deserve a regrade, and emailed her my revised copy, and got an 89 on it. I would recommend taking this class. ", "rating": 4, "expected_grade": "A+", "created": "2021-12-20T18:06:49Z"}, {"professor": "Toby Egan", "course": "PLCY201", "review": "This was a great class!\r\nIt was particularly fun to work closer with classmates on projects, learn about ourselves and the class guests were good. Dr. Egan is highly recommended!", "rating": 5, "expected_grade": "A-", "created": "2021-12-20T23:31:16Z"}, {"professor": "Toby Egan", "course": "PLCY201", "review": "One of the best classes at UMD so far. Dr. Egan cares about his students and really mixed leadership, our personal development and policy in an interactive and interesting way. I’m definitely signing up for another of Dr. Egan’s classes.", "rating": 5, "expected_grade": "A-", "created": "2021-12-30T15:37:35Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "The class had a light workload, which was nice. Dr. Brindle is very knowledgeable on leadership, so she can answer potential questions you may have. The readings were pretty easy as well. If you want a decent Gen Ed, take Dr. Brindle's PLCY201.", "rating": 4, "expected_grade": "A+", "created": "2021-12-31T05:58:37Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Dr. Brindle's PLCY 201 is a pretty interesting gen ed and relatively easy as long as you pay attention during class. The lectures can get kind of boring after a while but if you participate they are certainly manageable. She is an expert in leadership and is helpful with assignment instructions. Overall a good gen ed if you are interested in leadership.", "rating": 4, "expected_grade": "A-", "created": "2022-01-19T20:22:08Z"}, {"professor": "Toby Egan", "course": "PLCY201", "review": "This class was not terribly hard, but it was kind of boring. Dr. Egan is very nice, but his grading seemed a bit arbitrary. The class was pretty heavy on group work which was pretty annoying. I wouldn't take this class unless you are a policy major.", "rating": 2, "expected_grade": "", "created": "2022-03-23T00:44:51Z"}, {"professor": "Toby Egan", "course": "PLCY201", "review": "This was a very good class. In particular, I liked that we had autonomy to choose a topic that we wanted to explore more deeply. Dr. Egan was super helpful , chill, and gave good feedback. He’s fair and supportive of diversity. Recommended!", "rating": 5, "expected_grade": "B+", "created": "2022-03-31T07:59:13Z"}, {"professor": "Anne Kaiser", "course": "PLCY201", "review": "This professor is the harshest grader I have had. Nothing is good enough, even if you follow the prompts she will find ways to make you unsuccessful. I highly recommend  not taking her course.", "rating": 2, "expected_grade": "", "created": "2022-05-20T16:19:04Z"}, {"professor": "Mathew Feehan", "course": "PLCY201", "review": "Best Professor at UMD by far. I had him last year for PLCY201. Extremely fun but makes sure you succeed in his class. His lectures are engaging and he encourages everyone to break out from their shell and participate in his class. Wish he taught more classes at UMD because I would definitely take them.", "rating": 5, "expected_grade": "A", "created": "2022-10-10T21:00:46.151575Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "She is very degrading at times and not the nicest. The whole class is based on participation. There were 2 major writing assignments, a group paper and the final, which was easy. The other writing assignments were all 1 page. The GA posted weekly discussion boards. This helped students who did not want to participate verbally earn a good participation grade by the end of the semester. If you don't read over the slides or the readings, it's hard to participate. PLCY201 isn't hard, but she is difficult, so if you do what she asks and deals with her moodiness, you will be fine.", "rating": 3, "expected_grade": "B+", "created": "2022-12-07T19:21:36.921023Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "I absolutely love this woman, and if she taught more undergrad classes I would definitely take them!  The subject for PLCY201 itself isn't the most interesting, but it is an extremely easy class that you really don't have to put much work into it.  Hearing about all of the things Dr. Brindle has done in her life is by far the most entertaining part of class, and she is super easy to talk to if you need clarification on an assignment or topic.  I highly recommend this class to anyone who is looking for an easy gen ed or elective!", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T03:57:06.723599Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "I love Meg, but don't take this class to actually learn about leadership. DO take this class for a chill gened without too much work. You basically have to just show up to class and pay (some) attention. You won't miss out on much if you don't do the readings. The workload really isn't that bad, though not many things are actually graded. The best part, of course, is how much Meg likes to talk about her life. Believe it or not, this made the class so much more interesting than it could have been. She has had an *interesting* life, and I almost feel like I shouldn't spoil anything so you can take the class and learn about it for yourself. We even had a bingo game going where we would mark off squares based on which stories she mentioned :D", "rating": 4, "expected_grade": "A", "created": "2022-12-13T16:53:00.517505Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "I honestly took this class because it looked like an easy GenEd, but the class ended up being super interesting and became my favorite class. There's an easy workload, as long as you pay attention and get your work in on time, this class is an easy A. Lectures are boring at times but like other reviews say, she talks a lot about herself and her leadership and it's interesting sometimes! Dr. Brindle is super sweet, knows how to teach the class and has leadership experience and I'd definitely recommend taking PLCY201 with her, whether you want to knock a GenEd out of the way or are genuinely interested in leadership.", "rating": 5, "expected_grade": "A", "created": "2022-12-19T16:07:16.428087Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Not an easy Gen ed. Assignments aren't clear and the participation is very confusing. The TA writes down the names of people who answer questions in class so be aware of that because it can cost you points. You can learn some cool stuff about leadership, but if you want an easy gen ed find something else. This is not a walk in the park at all. The professor has occasional meltdowns so be ready too.", "rating": 1, "expected_grade": "B+", "created": "2023-01-11T00:39:26.426481Z"}, {"professor": "Nancy Lineman", "course": "PLCY201", "review": "Kind and Knowledgable professor but grades very harshly on minor things like typos and formatting errors. Class is only out of 100, Expect a discussion post every week that is worth 5 points, and a few papers that are worth 20-30 points each, and one final project where you have to get in contact with a government official.", "rating": 4, "expected_grade": "B-", "created": "2023-01-11T19:27:20.218706Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "This was my favorite class last semester!  Dr. Brindle is very nice and is extremely over-qualified to be teaching this course.  The workload is super light, just a few papers, and you could do just fine if you didn't do the readings.  I usually skimmed what I was supposed to read that week at the beginning of class and that system never let me down.  There is a participation component to the grade, but she allowed those who didn't really want to speak during class to write a small discussion post on their thoughts of that weeks' content (people usually wrote a little over 100 words) and that was good enough to give me full points.  I highly recommend her as a professor, and taking this class!", "rating": 5, "expected_grade": "A+", "created": "2023-01-24T23:35:04.054818Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Imagine the most boring class known to mankind. This class does not teach me anything and brindle needs to learn to engage her students rather than passive aggressively singling them out because they don't pay attention. If you're not a Public Policy major do not take this class with her, there are other I-series classes that are so much more interesting than this (and can count for more than one gen ed). The other one star review also applies to this review", "rating": 1, "expected_grade": "B+", "created": "2023-04-13T19:59:03.805496Z"}, {"professor": "Brandi Slaughter", "course": "PLCY201", "review": "Easy Gen-Ed but honestly a joke. No one learns, her presentations are awfully dull. Every other week you write a 3-4 paged single-spaced paper with limited guidelines and basically no requirement for sources. You have to fight hard to make up BS for the essays because the prompts mean nothing.\r\n\r\nSweet professor but not worth your time, better off going to sleep.", "rating": 3, "expected_grade": "A+", "created": "2023-04-27T22:31:50.855258Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Brindle has a lot of interesting experiences she shared in the class. It may be abit annoying for those who do not like to write (almost all writing and presentation assignments), but otherwise a nice chill gen-ed to take.", "rating": 5, "expected_grade": "A", "created": "2023-05-03T21:54:20.903724Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "This class is unbelievably boring and Professor Brindle is no better. This is one of the worst classes I have taken so far in college. I feel like I have learned absolutely nothing, and Professor Brindle made it almost unbearable. She is extremely passive aggressive and disorganized. She expects you to take notes in class but her lecture slides are completely disorganized, don't actually say anything important, and she moves too quickly to take notes anyway. What I find most ironic is that she is teaching a class about how to be a good leader, and yet she embodies none of the leadership traits she teaches us about. She is extremely braggy and definitely has favorite students and students she dislikes, and she makes it clear who falls in which category. She and her GA also refuse to submit grades on ELMS for some reason, so no one has any real idea of what their grade is in the class. SOMETIMES we get emails with feedbacks and scores on papers, but not always. While she may technically be qualified, this is not the type of person you want to learn about leadership from. I am excited for this class to be over. I feel like I am walking out having learned nothing, been extremely bored and drained mentally, and feel even less confident in my leadership abilities than when I walked in on the first day. She is only getting two stars instead of one because I feel like there is a little bit of room to be worse somehow, though I would not recommend taking this class with her.", "rating": 2, "expected_grade": "A", "created": "2023-05-13T02:56:12.137977Z"}, {"professor": "Anne Kaiser", "course": "PLCY201", "review": "Pretty chill class, most people stare at their laptops doing other work for the 2.5 hour sessions and little is required of you in class time. HOWEVER, the grades on the assignments are not clear. Just like other reviews in here, you will lose points on points for things that make no sense even when you can find no reason you deserve point deduction. Did you included everything on the rubric thoroughly and clearly into your essay? Jokes on you, B- for made up reasons.", "rating": 3, "expected_grade": "B", "created": "2023-05-15T23:15:48.313475Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Took this class with her. She is so boring and talks so quietly its hard to hear. I had an A in the course the whole semester and then she graded our final paper so harshly that it brought me to a B+. Also, her TA does literally everything for her.", "rating": 5, "expected_grade": "B+", "created": "2023-10-25T19:28:03.802394Z"}, {"professor": "Nancy Lineman", "course": "PLCY201", "review": "rather intimidating but gets nicer as the semester goes on. final project is a little heavy in terms of workload but still doable.", "rating": 3, "expected_grade": "", "created": "2023-11-08T21:07:05.053065Z"}, {"professor": "Nancy Lineman", "course": "PLCY201", "review": "Pros:\r\nResponds to emails, especially if they're about clarification an assignment, very quickly. Ask questions about assignment formats even if you think they're stupid, formatting is a lot of the grade!\r\nAdds sample formats for basically every assignment which makes figuring out what to write fairly easy\r\nReally interesting guest speakers! They're most of the class, honestly, which is good since it was one of the highlights of the class\r\nGood at leading discussions and leading people through thinking things through\r\nNo exams!\r\n\r\nCons:\r\nKind of intense about her class. Expects you to put a lot of effort in and isn't always fair about it. She gave us a lot of \"shame lectures\" where she would spend class time lecturing us about how we needed to do better and work harder, which got irritating fast since she was spending time doing that instead of teaching\r\nBad grammar is penalized very heavily. Get someone to read through your essays and throw them through grammarly, you lose a lot of points for grammar\r\nThe course is only out of 100 points (we had a leadership essay, 6 discussion questions worth 5 pts each, and the final is an essay worth 30 points and a presentation worth 20), and the smallest assignment is worth 5 percent of your grade, so stuff goes bad fast\r\nLots of writing, pretty much every assignment is a good chunk of writing, don't take the class if you aren't good with that\r\nKind of mean sometimes? Nothing too intense but sometimes I got a little freaked out\r\n\r\ntl;dr: interesting guest speakers and she knows a lot about public policy, but she's also really intense about certain things relating to her class (especially grammar and formatting) Expect a lot of writing", "rating": 3, "expected_grade": "A", "created": "2023-11-24T18:43:25.778292Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Professor Brindle is a very well respected instructor, and will make sure you know it by the end of the semester. Engaging with interesting stories but at times it seemed like the TA was doing more work than her. Still, she was a very nice woman who is very understanding and a majority of the work for this class was simply participating. Easy A.", "rating": 4, "expected_grade": "A", "created": "2023-12-01T17:33:56.906857Z"}, {"professor": "Clay Ramsay", "course": "PLCY201", "review": "Super nice guy. Let me rewrite some of my papers. As a STEM student, I'm awful at writing press releases and be decisive about policy. But he is super accommodating and answers emails really fast. Will give you feedback on your papers too if you write them early. So nice and easy to talk to, and he makes this class fun. Great I-series, I recommend!!", "rating": 5, "expected_grade": "A", "created": "2023-12-04T00:40:37.957147Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Easy Gen ed 100% should take", "rating": 5, "expected_grade": "A-", "created": "2023-12-05T21:57:28.784718Z"}, {"professor": "Gregory Ramsay", "course": "PLCY201", "review": "This man is the nicest professor and human being on campus! I'm not a policy major but I took this for a gen ed and ended up loving it, mainly because of how kind Professor Ramsay is. The class is very easy and interesting, each week is a \"simulation\" about a real, relevant public issue and you meet in groups to discuss your solution. Three press releases and a final paper but they are not bad at all. Take this clas!", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T01:28:51.841687Z"}, {"professor": "Clay Ramsay", "course": "PLCY201", "review": "I really enjoyed PLCY201 with Dr. Ramsay. He's really nice and even made us chuckle a few times in class. For PLCY201, he made simulations where students \"pick a side\" of an issue and then come together to make a consensus decision. I took this course as a gen-ed credit and while I am not a gov & politics person, I did take away some valuable skills from this class and have even wanted to become more involved in some issues talked about in this class. You do have to do some writing assignments and I did initially struggle with them because I had never written something like them before (4-5 papers total), but Dr. Ramsay provides some really helpful feedback! He also provides some examples of what your writing should look like for a guide, and the TA's were helpful with writing guidance as well. You are graded on attendance (30% of your grade) so if you like to skip, this class isn't for you.", "rating": 5, "expected_grade": "A", "created": "2023-12-17T21:17:35.713690Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Professor Brindle is a very nice lady and the class demands a very low workload so, if you are looking for an easy Gen Ed, this is the class!\r\n\r\nHowever, don’t expect learning anything from this class other than public speaking when presenting. \r\nThe lectures are relatively boring and the only thing I can remember is Professor Brindle talking about her sons. \r\nThe expectations outside of class are very confusing and there are no assignments ever posted. Your guide is the syllabus that lists the chapters you are supposed to be reading each week. I did the math: The page numbers can eclipse 60 pages before the next class period. It’s simply not worth the time reading all of that since most of leadership is common sense. I just skimmed the case studies at the end which were half of the in-class discussion. \r\nOn top of no assignments being posted, half the grades you receive in the class aren’t reported in canvas and you just hope that your “participation” grade is good without any information unless you directly ask the GA. \r\nOn the topic of the GA: she did almost all the work and determined how we were graded. Professor Brindle doesn’t grade much. My main gripe with the grading structure was professor Brindle made it seem as if the discussion posts were extra points of participation for reserved individuals in the class. However, when midterm grades were due, my grade was lower than expected because the discussion posts were mandatory by the GA and she would drop your participation grade. Just make sure to do the discussion posts, read the case studies before class, and you should be golden for an A in participation (I started to figure this pattern out midway through the semester)", "rating": 3, "expected_grade": "A", "created": "2023-12-22T00:07:55.657560Z"}, {"professor": "Nancy Lineman", "course": "PLCY201", "review": "Interesting class with a lot of very cool guest speakers, but a very heavy workload. Expect to be doing a lot of writing, as well as listening to podcasts and audiobooks (it's possible to find transcripts/texts, but definitely not a great class if you're hard of hearing and/or don't have 30+ hours to dedicate to listening to audiobooks). \r\nThe guest speakers were definitely the highlights of the class. Expect there to be more of a focus on people's independent experiences solving policy issues in the real world rather than any sort of \"textbook\" learning about the legal aspects of policy/its history/etc.\r\nShe's a little bit intense, but incredibly well-connected. Also very good at chasing down people if they don't answer your emails for the final project. She's also very willing to write letters of recommendation if you ask her, which is great if you're looking for internships.\r\n\r\nCons:\r\nSpelling/grammar. Oh boy it is Rough. She penalizes incredibly heavily (0.5-1% per issue, depending on the project), and on the discussion posts, you'll get a 0/5 if you have any errors at all. Getting people to proofread your work is an absolute must for this class (and absolutely don't rely on grammarly/other AI, it'll let you down). \r\nThe class is only 100 points, so mistakes add up real quick. If writing isn't your strong suit or you don't want to dedicate a significant amount of time to checking your work, I wouldn't recommend this class. \r\nLots of \"shame\" lectures about grades or people messing up assignments, I wasn't a fan.\r\n\r\nBasically, if you're prepared to put in the work, it's a great class. If you want something with an easy A, this is not the class for you.", "rating": 4, "expected_grade": "A+", "created": "2024-01-01T14:32:40.749681Z"}, {"professor": "Clay Ramsay", "course": "PLCY201", "review": "Professor Ramsay held a very interactive PLCY201 class compared to what I heard about other professors. Each week you complete a \"simulation\" where you explore a relevant policy issue and get together with classmates to talk and come up with possible policy solutions. Attendance is mandatory and a significant part of your grade. The rest of your grade is made up of 3 short writing assignments and 1 long one toward the end of the semester. He can be a bit of a tougher grader but he is willing to look over your essays before you submit them for recommendations to help you get a better grade. He is super nice and willing to answer any questions you have about the content. If you attend class and participate in the simulations it should be pretty easy to get an A.", "rating": 5, "expected_grade": "A", "created": "2024-01-04T21:08:39.761693Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Easy Gen-ed course to take, but if you do not intend to major in public policy or are 100 percent interested in public policy then I would probably not take this course. Also the TA does most of the work. The culture audit that we did in class was a fun project. Easy gen-ed to take but also this course can be very dry/boring sometimes.", "rating": 3, "expected_grade": "A-", "created": "2024-01-19T15:58:23.665273Z"}], "department": "PLCY", "course_number": "201", "name": "PLCY201", "title": "Public Leaders and Active Citizens", "credits": 3, "description": "<b>Credit only granted for:</b> PLCY201 or PUAF201.\n<b>Formerly:</b> PUAF201.\nAims to inspire, teach and engage students in the theory and practice of public leadership from the local to the national to the global level. Students will learn and apply diverse approaches to leadership in a multicultural society while developing an understanding of key frameworks and practices necessary to foster collective action across private, public, and nonprofit sectors. This course will allow students to become informed citizens able to reason critically and persuasively about public matters Students will also explore and assess their own personal values, beliefs, and purpose as they develop their leadership potential.", "is_recent": true, "geneds": null}