{"average_gpa": 3.5056603773584905, "professors": ["Joannie Tremblay-Boire", "Katlin Gray", "Katlin Gray", "Joannie Tremblay-Boire", "Katlin Gray", "Kisha Monroe", "Katlin Gray", "Katlin Gray", "James Stillwell", "Joannie Tremblay-Boire", "Katlin Gray", "James Stillwell", "Katlin Gray", "Kisha McNeill"], "reviews": [{"professor": "Katlin Gray", "course": "PLCY380", "review": "I've never had a class more meaningless while simultaneously having the most excessive workload I've ever seen. Not only can this class often feel like a complete waste of time but the amount of time wasted doing busy work is absurd. I truly have never regretted taking a class more. STAY AWAY.", "rating": 1, "expected_grade": "A-", "created": "2023-03-15T19:02:56.368070Z"}, {"professor": "James Stillwell", "course": "PLCY380", "review": "Super sweet professor! Is very outgoing and bubbly but fair warning does love to involve everyone. Very focused on a collaborative environment and truly does not want to lecture the whole time.\r\n\r\nPLCY380- essentially all completion, 3 major one-month deadlines for a semester-long project, weekly readings, summary slides, in-class participation is necessary to be successful", "rating": 5, "expected_grade": "A", "created": "2023-11-12T21:52:02.282610Z"}, {"professor": "Katlin Gray", "course": "PLCY380", "review": "The class is a lot of unnecessary work. A lot of the outside of class assignments can be reviewed in class. There is no need to read three different full length articles and watch 10 videos to do a simple discussion in class. I don't feel like I am being taught, I just feel like I need to keep up but I am not learning. Prof Gray expects us to absorb all the content but doesn't actually contribute anything meaningful in class. She mostly asks students their opinions and agrees or disagrees. The TAs do more work going around. And her assignments are very rigid. I understand having a system but so far nothing has been graded so I don't know what to expect for future assignments. Overall, I just don't learn in class which is where I should be learning. It's a waste of my time but is unfortunately required attendance.", "rating": 1, "expected_grade": "", "created": "2024-02-20T01:26:13.340628Z"}], "department": "PLCY", "course_number": "380", "name": "PLCY380", "title": "Innovation and Social Change: Do Good Now", "credits": 3, "description": "<b>Credit only granted for:</b> ARHU380, BSOS388B, PLCY388D, or PLCY380.\n<b>Formerly:</b> PLCY388D.\nIntroduces students to the concept of social innovation while exploring the many mechanisms for achieving social impact. It is team-based, highly interactive and dynamic, and provides an opportunity for students to generate solutions to a wide range of problems facing many communities today. Deepens the students understanding of entrepreneurship and innovation practices by guiding them through the creation and implementation process as applied to a project idea of their choice.", "is_recent": true, "geneds": null}