{"average_gpa": 3.134251968503937, "professors": ["Gary Coleman", "Jose Costa", "Jianhua Zhu", "Vijay Tiwari", "Vijay Tiwari", "Vijay Tiwari", "Vijay Tiwari"], "reviews": [{"professor": "Gary Coleman", "course": "PLSC203", "review": "Terrible teacher. I took this as a gen ed, yet the class was unbearably difficult. The average of the first exam was a low D... and still there was no curve. The second exam was just as difficult. He literally expects you to have photographic memory remembering the smallest detail from the notes and then writing an essay on it. For example, a caption for a picture. I had a high B considering I got the highest grade on the second exam in the class and then average on the first. I was so sure on getting an A but he did not even bother to curve. He really doesn't care about his student's grades. You grade is based of 2 exams and 2 assignments. There were even plant science majors taking this class as an elective that did poorly. His lectures are extremely dry and he basically just reads of slides. I highly do not recommend this guy.", "rating": 1, "expected_grade": "B+", "created": "2019-01-04T16:39:15Z"}, {"professor": "Vijay Tiwari", "course": "PLSC203", "review": "I took this class as an elective and because the subject interested me. Dr. Tiwari is a very knowledgable professor however he mainly is a researcher. Due to this, the class structure was a little hard to understand at first but he was very easy to talk to with any questions. Dr. Tiwari was very open to feedback and overall his class was a good experience. There are not a ton of assignments except for about three exams (take home and open note) along with a few discussions. Most of the class was based on participation and discussions and made it fun to talk with peers about the different topics. I would recommend if looking for a science elective or if you are a horticulture/plant science major interested in this!", "rating": 5, "expected_grade": "A", "created": "2022-12-13T22:21:56.677651Z"}], "department": "PLSC", "course_number": "203", "name": "PLSC203", "title": "Plants, Genes and Biotechnology", "credits": 3, "description": "<b>Prerequisite:</b> BSCI103 or BSCI105; or (BSCI170 and BSCI171).\nAn overview of the history, genetics, and reproductive mechanisms for agronomic and horticultural plants that examines mechanisms of genetic improvement ranging from traditional plant breeding to tissue culture and genetic engineering. Social and political issues such as germplasm preservation and international intellectual property rights will also be discussed.", "is_recent": true, "geneds": null}