{"average_gpa": 3.600534045393858, "professors": ["Dylan Selterman", "Carly Hunt", "Beth Sperber Richie", "Carole Sebenick", "Heather Ganginis DelPino", "Dylan Selterman", "Carole Sebenick", "Rachel Vandaalen", "Carole Sebenick", "Heather Ganginis DelPino", "Abigail Nicolas", "Carole Sebenick", "Beth Sperber Richie", "Carole Sebenick", "Carole Sebenick", "Heather Ganginis DelPino", "Abigail Nicolas", "Carole Sebenick", "Abigail Nicolas", "Carole Sebenick", "Heather Ganginis DelPino"], "reviews": [{"professor": "Dylan Selterman", "course": "PSYC234", "review": "This professor is great at conveying course content to students and utilizing course materials (textbooks, articles, videos, and podcasts) to improve student learning. However, he will also deflect from student concerns and throw his TA under the bus if a student is concerned about the way an assignment is graded. Guidelines for the assignments were difficult to understand and the professor has managed to deflect from fully answering students' concerns regarding this. This professor is also hypocritical in his teaching values and claims to want students to advocate for their education and that grades shouldn't matter but took an opportunity to gaslight us when concerns were brought up about the weekly reflections and the way they're graded.", "rating": 2, "expected_grade": "", "created": "2021-12-01T17:04:48Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "She is literally the nicest human being in the entire world. She cares so much about mental health and her students individually (which is what a teacher should do). This course is also really easy and super interesting! We have reflection papers and 3 quizzes that were online and had a final project rather than a final test. I literally can't recommend this class enough! Please take it!", "rating": 5, "expected_grade": "A", "created": "2021-12-16T23:55:29Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC234", "review": "The course has light workload and is easy in general. On the downside, the course is so easy you hardly learn anything aside from how to set your mentality. Del Pino does her best to be understanding and encourages the students to express their thoughts on a topic, no matter how small. Majority of her topics include current news, such as the impact of COVID and racism. If you are interested in discussing world issues or a personal matter emotionally, or just an easy course to fill a requirement, this is for you. At the very least, make sure to properly complete your assignments, especially your final project as exam, as those two have the ability to completely flip your grade. If concerned, you can reach out to the professor or TA for review or help, make sure to if you question anything, since it is difficult to change the grade if not impossible once it's set out, with an exception of late assignments. On the other hand, Del Pino does offer multiple extra credit opportunities that will remain open for the majority of the semester.", "rating": 3, "expected_grade": "", "created": "2022-01-11T23:04:42Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC234", "review": "Easy class. You really only need to come to one of the two classes every week. The class times are just a group therapy session which is nice. She records every class, but if you participate in class she will like you. Follow the rubric for the assignments and you will get a 100. The final is a group presentation and a research paper.", "rating": 5, "expected_grade": "A+", "created": "2022-01-14T20:54:12Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Professor Sebenick was a great professor. Her lectures were very engaging and overall the topic of the class is very interesting. She showed multiple times that she really cares for her students and their well-being. I highly recommend taking this course!", "rating": 5, "expected_grade": "A", "created": "2022-01-18T18:16:43Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "One of the best and most understanding teachers! She was clearly very interested in the class and has a wonderful teaching style! ", "rating": 5, "expected_grade": "A+", "created": "2022-01-19T16:39:12Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Love love love this woman. Cares about her students, genuinely kind, willing to talk about stuff, super open-minded, makes content interesting. I recommend this class to everybody I know", "rating": 5, "expected_grade": "A+", "created": "2022-05-12T00:43:05Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC234", "review": "Starting off, the teacher is super kind. She is extremely understanding of differing viewpoints and even regarding missing assignments. The class aspect has weekly assignments where one has to reflect on the week's reading, always got a 100%. Class attendance is recorded but I am unsure if it affects one's grade. The only negative is that the classes are a bit boring but I enjoy the class discussions. I definitely recommend taking this class because it is an easy A and she truly cares about her students.", "rating": 4, "expected_grade": "A+", "created": "2022-12-08T20:06:52.929760Z"}, {"professor": "Heather Ganginis DelPino", "course": "PSYC234", "review": "Easy class, super kind professor who actually cares about students. Class is a \"book club\"-y experience, where you read a couple chapters and discuss them in class. No imposed deadlines except for exams. Could be a pro or a con depending on your style. Weekly 1-2 page assignments reflecting on reading. Some bigger assignments (e.g. group presentation), but nothing crazy.  Final exam not in person, can turn in online.", "rating": 5, "expected_grade": "A+", "created": "2022-12-08T23:17:41.690139Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Super accommodating, and the nicest woman you'll ever meet. She comes in every day with a smile and ready to teach. The lectures can get a little boring at times, since it's just slideshows, but she posts them anyways in case you miss something. No final, just a group project. As long as you do all the work, you will get an A.", "rating": 5, "expected_grade": "A+", "created": "2022-12-10T22:52:39.306479Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "This professor wants to make the class unstressful and there's barely any homework. Her quizzes are kind of tough, but she offers so much extra credit that I ended up with over 100 before the last quiz. Definitely recommend.", "rating": 5, "expected_grade": "A", "created": "2022-12-16T05:42:16.654702Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "So sweet and genuinely wants to see all of her students succeed. The course material was easy & interesting to learn. You have a couple of quizzes, a happiness workbook to fill out throughout the semester, discussions, and one group project. Not a huge time commitment at all and there's no final.", "rating": 5, "expected_grade": "A", "created": "2022-12-19T22:02:51.702911Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Ended the course with above 100% because of the sheer amount of extra credit she gives. She's extremely nice and understanding and always smiling! The quizzes were all online and we could do them in our own time (the last one was even open-note). The group project was the bulk of the work here, but even as someone who doesn't like to work with groups, I can tell you that it was not bad at all. She gives plenty of class time for us to work on it, so our group managed to get the majority of the planning done during class, and we only had to meet once in our own time. It was basically just a PowerPoint presentation, where the group members split the work on, and it was presented via recording a Zoom call which we were all on, and the video was later played in class. Overall, it's a really chill class. Take this if you want an easy gen. ed. or GPA booster!", "rating": 5, "expected_grade": "A+", "created": "2022-12-20T21:58:14.536182Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "easy and enjoyable class but the group project is questionable and seemed disconnected and unorganized from the normal content of the class/quizzes", "rating": 4, "expected_grade": "A+", "created": "2023-01-05T17:16:26.851977Z"}, {"professor": "Abigail Nicolas", "course": "PSYC234", "review": "Don't get me wrong for the 1 star. The class itself is relatively easy if you stay on track. The issue is that Dr. Abi does less than the bare minimum in terms technological layout for the class. She overcomplicates whenever possible, and is unsupportive when needed to provide some support. for example, despite every professor or teacher I have ever had putting assignments on the calendar so students are reminded about a due date, or at least putting a due date on the assignment in the elms \"assignments\" page, she decided that she was above this and refused to set these up leading multiple students to lose over 10% of their grade because of human mistakes. Her justification was because the due dates were in the atrocity of a layout that she called a syllabus. For a counselor and teacher who tells people to be lenient towards themselves, she is not lenient towards her students. \r\n\r\nThe class - that is the pre-made curriculum she regurgitates - itself is good, and I have learned some useful things but for me who relies on technology and having things organized normally, she comes nowhere near the bar that is set in terms of how almost every other professor in the university arranges their course. \r\n\r\nShe isn't a monster, or a bad professor, her teaching style just suffers from the following:\r\n- the inability to build an organized syllabus, assignment prompt, elms page, lecture format/slide layout...\r\n- snappy responses to genuine and understandable questions people have during lecture such as \"this could be easily addressed by maybe looking at the syllabus but since you already asked...\"\r\n- lack of due-date reminders except for in-class 0.5 second remarks that aren't even on the slides\r\n- a terrible grading scheme with VERY LITTLE  room for error, though the grades aren't harsh. \r\n- the inability for her to keep students engaged during a zoom-based class despite it being the norm for years for most people. \r\n\r\npros:\r\n- easy A if you put the effort in. the bulk of assignments are relatively easy\r\n- good if you want to skip therapy and learn positive psychology directly from the source for whatever reason. it genuinely helped me because I hate going to therapy\r\n- TA Michael is really great and provides great feedback and is open to answering literally any question you have.", "rating": 1, "expected_grade": "A", "created": "2023-03-08T22:37:59.368675Z"}, {"professor": "Abigail Nicolas", "course": "PSYC234", "review": "Super easy course and she is an amazing professor. Wish I could've taken it in person.", "rating": 5, "expected_grade": "A+", "created": "2023-05-09T22:59:08.340469Z"}, {"professor": "Abigail Nicolas", "course": "PSYC234", "review": "I had prof. Nicolas for PSYC221 and loved her so much I decided to take PSYC234 with her! Both classes contained some type of writings each week (whether it was essays, short paragraph reactions to the chapter, or daily journals), which can be scary to some people but she makes the assignments very easy to understand and offers lots of help! There are also usually some type of discussion sections that you will have to attend every other week but she incorporates your discussions into the class time so you won't have to attend the class more than two days a week (and they are very easy discussions to get credit for). Also, she is very clear and thorough with directions you just have to actually pay attention and listen (which I found that a lot of my classmates did not do lol)! Overall, I really loved her and hope I get another opportunity to work with her again!", "rating": 5, "expected_grade": "A-", "created": "2023-05-10T19:24:16.402881Z"}, {"professor": "Abigail Nicolas", "course": "PSYC234", "review": "Nice person, but incomprehensible syllabus. The class itself is a cakewalk as long as you can decipher the ridiculously overcomplicated class layout. As long as you do the assignments, you'll get full marks... assuming you're actually able to remember when stuff is due. Any points you lose will be for stupid stuff like that.", "rating": 3, "expected_grade": "A", "created": "2023-05-13T14:55:34.129141Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Easy, interesting course. She is very kind and accommodating to anything you may have going on. All the assignments are fairly straightforward, the last assignment is a group presentation which can feel unorganized depending on your group-mates but during the summer (like-me) it should be simple.", "rating": 5, "expected_grade": "A", "created": "2023-08-13T13:37:51.619908Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "I took this as a summer course. Dr. Sebenick is super kind and understanding and you can definitely tell she cares a lot about her students. The course content was super interesting and applicable to daily life. The structure consisted of a weekly discussion board, the happiness strategies workbook with activities each week, a reflection paper and the final group project which we worked on throughout the summer session. The final project wasn't bad and was actually quite interesting to work on. Overall I'd recommend anyone to take this course with Dr. Sebenick!", "rating": 5, "expected_grade": "A+", "created": "2023-08-23T11:46:43.172497Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Good course, good professor. No complaints. Quizzes and exams were light and because they are open note not at all stressful. There are weekly quizzes but again they are not hard. The course content is interesting. Although this isn't even remotely related to my major, and I was just taking this as a gen ed, I'm very glad I chose this course because I was genuinely interested in the content. The main part of the course is the writing assignments, which comes out to a total of about ~7 pages of essays over the course of the semester (not bad at all).", "rating": 5, "expected_grade": "A-", "created": "2023-12-10T17:28:03.084029Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Very kind and obviously cares about her students. The class itself is pretty easy and the content is interesting even if you're not a psychology major. There is an overarching project throughout the school year where you have to research happiness for a specific population. Make sure to not choose an obscure or overly specific population because you will have a VERY hard time trying to find people to interview/research articles relating to the population. She gives a decent amount of class time to do the project though, so it's not terribly difficult. Overall, very chill class and professor.", "rating": 5, "expected_grade": "A+", "created": "2023-12-13T19:59:43.567026Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "Very little effort required. Weekly quizzes and exam are super easy. I never had to study. The projects aren't too bad either. She really cares about the subject and her students. I'd recommend her to everyone. Best gen ed.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T19:09:25.305062Z"}, {"professor": "Carole Sebenick", "course": "PSYC234", "review": "She truly cares about her students and is very understanding! The content is super interesting. \r\n\r\nWeekly quizzes on one or two chapters in the textbook (I just skimmed through the chapter). Each chapter was about 15 to 40ish pages. If you attend the lectures you'll get the same information from the textbook as a helpful review. She embeds a fair amount of extra credit opportunities, so you almost have a guaranteed A if you do all the work! \r\n\r\nThe only thing I didn't like was the happiness project, ONLY because my group didn't do their fair part. Otherwise, chill class.", "rating": 5, "expected_grade": "A+", "created": "2024-01-13T19:03:35.331806Z"}], "department": "PSYC", "course_number": "234", "name": "PSYC234", "title": "Living the Good Life: The Psychology of Happiness", "credits": 3, "description": "<b>Credit only granted for:</b> PSYC234 or PSYC289D.\n<b>Formerly:</b> PSYC289D.\nWhat are the secrets to living a happy life? Can happiness be found within the context of war, a depressed economy, violence and other major stressors? Are some people born happier than others? This course will teach you the scientific process that psychologists use to study happiness (and related emotional variables) and give you the opportunity to practice applying that process in a number of ways. You will learn how we (a) gather and critically evaluate research findings in the existing literature, (b) integrate those findings into coherent and testable theories, (c) design and conduct valid scientific research that tests those theories and extends our knowledge, and (d) effectively communicate our theories and findings to a wide range of audiences. The result of the process is a more accurate and objective understanding of happiness, and that is what prepares you to apply your scientific understanding to explain and influence a wide range of outcomes.", "is_recent": true, "geneds": null}