{"average_gpa": 3.299514563106796, "professors": ["Carmen Benito-Vessels", "Hernan De Pinillos", "Hernan Sanchez", "Ginette Eldredge", "Carmen Benito-Vessels", "Ginette Eldredge", "Ginette Eldredge", "Mehl Penrose"], "reviews": [{"professor": "Carmen Benito-Vessels", "course": "SPAN331", "review": "(Disclaimer: had her during fall 2020 virtual semester)\r\n\r\nThe class is easy to do well in as long as you do the readings and participate in each class (say your reflection on the reading). She graded the presentation and the exams fairly. If the exams are open note when you have her, like they were this semester, then I recommend making a huge Google Doc of all your notes by topic and even writing out some sentences/paragraphs before the test. Make sure you write a lot and include a lot of facts.\r\n\r\nThe only downside is that some of the readings are long. However, as long as you have a general understanding of each reading as well as important things like themes, structure, and cultural/historical significance, yo will do fine.", "rating": 5, "expected_grade": "A+", "created": "2020-12-17T19:58:47Z"}, {"professor": "Ginette Eldredge", "course": "SPAN331", "review": "this class is about her passion, medieval spanish literature. TONS of assignments, but you can tell she cares and wants you to succeed. that said, it is a TON of work and she is not afraid to give you extra on top of it. participation grades are rough but fair. grading seemed fair too, maybe a little tougher than normal profs.\r\n\r\nthe class consisted of:\r\n- at LEAST 2 homeworks per week\r\nthis was definitely the busy work of the class, so. many. assignments. and. so. many. readings. it dragged.\r\n- some in-class assignments that are graded for participation\r\nsame difficulty as a homework, which wasnt bad. you normally had some access to it before class, so you could do it for homework before hand if you had time.\r\n- a research-based oral presentation (7-10 mins in length)\r\nhonestly was pretty chill. the grading seemed pretty light, the topics felt pretty open ended. i was so scared of this but it was honestly the easiest thing.\r\n- a midterm (1/2 takehome, 1/2 in class)\r\nthe takehome half was a traditional essay with a prompt - had a week to do it. she gave a study guide for the midterm. it was 20% where you match a word with the definition, 10 of the words, 13-15 definitions. the study guide had the words but NOT the definitions, so hopefully your definitions wording matched up with hers. the rest was essay responses. the study guide had 5 prompts. the actual midterm had 3, and you had to answer 2. you needed to remember specific quotes and texts to support your answers.\r\n- final exam\r\nit was 20% where you match a word with the definition, 20 of the words, 23-25 definitions. the study guide had the words but NOT the definitions, so hopefully your definitions wording matched up with hers. the rest was essay responses. the study guide had 8 prompts. the actual midterm had 5, and you had to answer 4. you needed to remember specific quotes and texts to support your answers.\r\n- participation grade\r\nstandard one in the spanish department\r\n\r\noverall honestly the work isnt hard, its just SO MUCH. don't do it if youre lazy.", "rating": 4, "expected_grade": "C", "created": "2023-12-20T00:41:09.079191Z"}], "department": "SPAN", "course_number": "331", "name": "SPAN331", "title": "Spanish Culture, Civilization and Literature I: Medieval Times", "credits": 3, "description": "<b>Prerequisite:</b> SPAN303; and (SPAN311 or SPAN316).\nThe exploration of cultures of the Iberian Peninsula from its origins until the 15th century as well as the study of historical and political events that gave rise to the Spanish state. Taught in Spanish.", "is_recent": true, "geneds": null}