{"average_gpa": 3.2573493975903625, "professors": ["Juan Carlos Quintero-Herencia", "Chila Hidalgo", "Ryan Long", "Matthew Lewis", "Sebastian Bartis", "Saul Sosnowski", "Jason Bartles", "Luis Charry", "Melissa Gonzalez-Contreras", "Lisa Carney", "Saul Sosnowski", "Juan Carlos Quintero-Herencia", "Laura Demaria", "Juan Carlos Quintero-Herencia", "Sofia Maurette", "Ligia Gonzalez", "Sofia Maurette", "Juan Carlos Quintero-Herencia", "Saul Sosnowski", "Ryan Long", "Juan Carlos Quintero-Herencia", "Saul Sosnowski", "Juan Carlos Quintero-Herencia", "Laura Demaria"], "reviews": [{"professor": "Ana Rodriguez", "course": "SPAN363", "review": "She's a very nice person and really passionate about her research areas, but totally out of touch with reality. \r\nThe amount of work she expects for a 300-level class is absolutely ridiculous. \r\nShe rarely gives back grades, and when she does it's 2 months after you've turned in the paper. (Literally.)\n\r\nThere's a reason all the other 400-level classes for next semester are full or nearly full and hers is half-empty. ", "rating": 2, "expected_grade": "", "created": "2008-12-10T17:21:00Z"}, {"professor": "Juan Carlos Quintero-Herencia", "course": "SPAN363", "review": "JCQH is an easy grader, but he doesn't go far in depth enough into materials nor did he really 'push' any of his students. ", "rating": 4, "expected_grade": "A", "created": "2018-01-02T01:41:21Z"}, {"professor": "Saul Sosnowski", "course": "SPAN363", "review": "I love this class (I don't even really like Spanish lit, but Saul makes it so tolerable). Saul is a wonderful and engaging lecturer who adds a lot more context to the readings. He's very intelligent and knows everything there is to know about every story we read and all the historical context behind it. He interacts really well with students, making the class fun. \r\nI wish grades were uploaded to the grade book - while I think I'll do well in the class, I would like to have a little more certainty. \r\nA paper rubric for the final paper and the group project would be appreciated, despite the clarity of instructions during class. \r\nThere are 4 grades, I think? 1 midterm, 1 final, 1 final paper (5-10 pages), and 1 group project. ", "rating": 5, "expected_grade": "", "created": "2019-12-01T21:26:28Z"}, {"professor": "Juan Carlos Quintero-Herencia", "course": "SPAN363", "review": "Prof. Quintero-Herencia is incredibly enthusiastic about the content of this course, and makes some pretty profound connections to very broad themes. Unfortunately this will often lead to him going off on huge tangents that can seem rather irrelevant to the course content. He is indeed a very lenient grader, and I definitely got a much higher grade in the class than what I deserved for the work that I put in. The class is not organized all too well, however. It takes him a long time to get grades up on ELMS, and a whole 50% of the final course grade comes from assignments that you turn in after the last day of class, leading to a lot of uncertainty in your grade until it's all said and done.", "rating": 4, "expected_grade": "P", "created": "2021-06-26T14:50:55Z"}, {"professor": "Ryan Long", "course": "SPAN363", "review": "Long is so caring, knowledgeable, and lenient with grading. All the good qualities make him one of the best professors in the Spanish department. ", "rating": 5, "expected_grade": "A", "created": "2022-05-18T05:08:19Z"}, {"professor": "Saul Sosnowski", "course": "SPAN363", "review": "Ok, as much as he's humorous and easy-going, he needs to be using canvas. I get that he's old school and just lectures without slides, but it's just a lot of information, and if you miss something he said, good luck on your exams lol. There's a presentation, a midterm, a paper, and the final exam. Those are the only grades. I'm probably not gonna get a good grade for this class but it's whatever.", "rating": 2, "expected_grade": "C", "created": "2023-12-05T19:58:47.931290Z"}], "department": "SPAN", "course_number": "363", "name": "SPAN363", "title": "Latin American Literatures and Cultures III: From Modernism  to Neo-Liberalism", "credits": 3, "description": "<b>Prerequisite:</b> SPAN303; and (SPAN311 or SPAN316).\nAn overview of cultural and literary production of Latin America from the late 19th through the early 21st centuries, exploring the production of literary texts in their socio-historical, political, and cultural contexts and development. Taught in Spanish.", "is_recent": true, "geneds": null}