{"average_gpa": 3.7112697220135242, "professors": ["Campbell Scribner", "Dale Placek", "Joel Miller", "Erin Janulis", "Kayla Bill", "Pamela Callahan", "Lisa Eaker", "Neil Dhingra", "Genevieve D'Cruz", "Doug McNamara", "Marissa Sariol-Clough", "Kavitha Kasargod-Staub", "Lisa Eaker", "Genevieve D'Cruz", "Kavitha Kasargod-Staub", "Marissa Sariol-Clough", "Nandi Carson", "Campbell Scribner", "Kavitha Kasargod-Staub", "Lisa Eaker", "Lisa Lopez-escobar", "Nandi Carson", "Kavitha Kasargod-Staub", "Lisa Eaker", "Lisa Lopez-escobar", "Nandi Carson", "Stephanie Chou", "Lisa Eaker", "Kavitha Kasargod-Staub", "Lisa Lopez-escobar", "Staci Kottkamp", "Stephanie Chou", "Chelsea Stolt", "Lisa Eaker", "Lisa Lopez-escobar", "Stephanie Chou", "Campbell Scribner", "Lisa Eaker"], "reviews": [{"professor": "Joel Miller", "course": "TLPL250", "review": "Very easy class. Didn't do most of the readings and could still figure out what was going on in the class. A little boring but he really cares about the subject.", "rating": 5, "expected_grade": "A", "created": "2018-12-04T14:46:01Z"}, {"professor": "Joel Miller", "course": "TLPL250", "review": "Great dude. Interesting class if you try to get into it. Really cares about the students and subject. Readings aren't too bad and you can still follow along with the class if you don't read. Assigns some essays but are managable.", "rating": 5, "expected_grade": "A", "created": "2019-11-21T19:16:10Z"}, {"professor": "Pamela Callahan", "course": "TLPL250", "review": "She cares far too much about the course. She will personally email or message you if you do not participate in class. Daily complex readings in preparation for class and three writing assignments on top of a final paper. Take another professor. ", "rating": 2, "expected_grade": "A", "created": "2020-04-14T21:00:20Z"}, {"professor": "Erin Janulis", "course": "TLPL250", "review": "The good: she's highly available to help you with your work, and the class itself isn't too hard\r\nThe bad: she's kinda annoying and class is torture (long, boring readings and futile discussions) \r\n\r\nShe's also big on participation so make sure to talk in class!", "rating": 3, "expected_grade": "A+", "created": "2020-05-04T02:55:22Z"}, {"professor": "Marissa Sariol-Clough", "course": "TLPL250", "review": "young and new at teaching, requires ALOT of reading and outside work for class. She is not a good professor and she is very strict ", "rating": 1, "expected_grade": "B", "created": "2020-12-06T22:08:48Z"}, {"professor": "Lisa Eaker", "course": "TLPL250", "review": "I think ill get an A in this class but she is honselty one of the best professors ever! She's very understanding and gives virtually no homework. Additionally there seem to only be 2 quizzes and a final paper which you gather information for all semester. Class is mostly discussion based but there are no participation points or anything like that. This class seems to be an easy A, and Dr Lisa makes it easy!", "rating": 5, "expected_grade": "", "created": "2021-10-29T20:59:20Z"}, {"professor": "Genevieve D'Cruz", "course": "TLPL250", "review": "I love this class! Professor D'Cruz is chill and down to earth. She is so understanding and I learned a lot from this course. ", "rating": 5, "expected_grade": "", "created": "2021-12-09T15:09:35Z"}, {"professor": "Lisa Eaker", "course": "TLPL250", "review": "I'm an education major... and I thought this class was pretty boring.  There was a lot of information thrown to you at once each lecture and there was breakout rooms which I didn't enjoy.  Your grade for the class is based off of three 10Q quizzes and one group presentation.  They were open note so just make sure you take good notes and you should do well.  She loves when people participate but I wasn't really about that, she never made people speak though or call people out by name which was nice.", "rating": 3, "expected_grade": "A", "created": "2022-04-14T19:49:19Z"}, {"professor": "Marissa Sariol-Clough", "course": "TLPL250", "review": "One of the worst teachers I’ve had at UMD. Did not explain expectations of assignments thoroughly and would grade based on favoritism. When asking for help she would be very condescending and make students feel bad. Do not take this class with her. ", "rating": 1, "expected_grade": "", "created": "2022-07-11T16:33:00Z"}, {"professor": "Campbell Scribner", "course": "TLPL250", "review": "Professor Scribner is genuinely such an interesting guy. This class may seem like a lot of work, but it is super manageable. There are readings due before class everyday, but you spend pretty much the entire class discussing, asking questions, and analyzing them. Aside from that there is no final exam, just a conversation with him or a Philosophy of Education Paper. Then along the way there is 4 analysis papers that are pretty spread out and you can write them on whatever you choose from the readings! Great class, Highly recommend Professor Scribner!", "rating": 5, "expected_grade": "A", "created": "2022-11-09T19:59:34.871068Z"}, {"professor": "Campbell Scribner", "course": "TLPL250", "review": "Understanding teacher and his classes are very interesting if you read the readings because you get to get philosophical. Easy A class, 4 essays lowest one dropped, final is either a longer essay or just a conversation with him for 30mins. Great class", "rating": 5, "expected_grade": "A-", "created": "2022-12-05T07:24:19.965932Z"}, {"professor": "Nandi Carson", "course": "TLPL250", "review": "Great teacher! Very enthusiastic about the class and discussing the topics covered. Overall the topics for this class were well rounded in the theme of education, and very informative. Not too much work either, just biweekly discussion posts (graded on completion), three analysis essays (lowest of which is dropped), and a final essay. This class is not difficult, but if you want to ensure you get an A+, make sure you ask her to review/proofread your essay and make changes accordingly.", "rating": 5, "expected_grade": "A+", "created": "2023-01-17T01:50:46.030734Z"}, {"professor": "Nandi Carson", "course": "TLPL250", "review": "Great teacher. One of the three essays is dropped, and thus she lets you not do the third essay if you think you did well in the other two. I never lost any points in this class. I highly recommend if you like a nice writing intensive class based upon fun lectures.", "rating": 5, "expected_grade": "A+", "created": "2023-01-17T01:51:55.520489Z"}, {"professor": "Kavitha Kasargod-Staub", "course": "TLPL250", "review": "Kavitha is a great professor who is not just an excellent teacher but a nice person. She knows everyones name and makes sure that the class is a safe enviornment. She grades fairly but will also take the time to annotate where you went wrong and provides feedback. But in general, she gives out a lot of high grades with the average being really high. Her class is really well organized and understandable as well. The course itself is also really interesting and provides an interesting take from someone who is out of the major.", "rating": 5, "expected_grade": "A", "created": "2023-05-10T21:19:27.656116Z"}, {"professor": "Lisa Lopez-escobar", "course": "TLPL250", "review": "Lilo is super nice and definitely cares about her students well-being. I would say that she gave a little too much homework (ex. listening to an hour-long podcast) for what the class is, but overall she did not make the class very difficult. There were no tests, just projects, and we were given lots of time to work on them. I would recommend this class for a gen-ed", "rating": 4, "expected_grade": "A", "created": "2023-05-21T01:53:56.503727Z"}, {"professor": "Marissa Sariol-Clough", "course": "TLPL250", "review": "Includes lots of resources on ELMS. Bad reviews are probably from students who did not attend class. Really helpful with one on one meetings", "rating": 5, "expected_grade": "A", "created": "2023-08-11T15:20:15.214908Z"}, {"professor": "Stephanie Chou", "course": "TLPL250", "review": "excellent professor. she is super kind and understanding and is genuinely a nice person to talk to! It's a lot of reading, but everything is discussed in class as a group so if you attend class regularly (attendance is graded with a few excused absences) you will understand what's going on. there are short essays and a final essay, but the short essays are based on what's discussed in class and there is an option to have a 40 minute conversation with her for the final. If she still offers that option, TAKE IT!! She is a fair grader for essays and if you attend class you will do well. The final conversation was extremely laid-back, and was a much better option than writing an entire essay! If you're someone who can commit to going to class and isn't stressed by talking to professors, it's a really good class to take for education and non-education majors.", "rating": 5, "expected_grade": "A", "created": "2023-11-06T18:32:24.299171Z"}], "department": "TLPL", "course_number": "250", "name": "TLPL250", "title": "Historical and Philosophical Perspectives on Education", "credits": 3, "description": "<b>Credit only granted for:</b> EDPS210 or TLPL250.\n<b>Formerly:</b> EDPS210.\nAn examination of illustrative historical and philosophical examples of the interplay of ideas and events in the shaping of educational aims and practices from ancient cultures to modern technological societies.", "is_recent": true, "geneds": null}