{"average_gpa": 3.620238095238095, "professors": ["Peggy Wilson", "Peggy Wilson", "Peggy Wilson", "Peggy Wilson"], "reviews": [{"professor": "Peggy Wilson", "course": "TLPL451", "review": "Peggy is a rockstar. Literally zero negative things have ever been said about her by anybody ever. You'll love her. She's def the kind of professor you'll tell future students about.", "rating": 5, "expected_grade": "A+", "created": "2021-12-16T01:17:11Z"}, {"professor": "Peggy Wilson", "course": "TLPL451", "review": "I LOVE Peggy. She's a super chill teacher that is very relatable and does everything to make sure that class is enjoyable. She is very honest and you can tell that she loves her job. She writes amazing recommendation letters and does a good job at helping to place you for your teaching internship. She makes the class about learning about the career, not about grades. \r\nOverall, very easy class as she is lenient with due dates. 100% reccomend", "rating": 5, "expected_grade": "A+", "created": "2022-08-04T19:26:46Z"}, {"professor": "Peggy Wilson", "course": "TLPL451", "review": "Peggy is great. She is super kind and helpful, especially with finding and getting settled in our placements. She's also very accommodating and easy to talk to. She is very experienced in teaching and always has a lot to discuss about the field and the subject of English and I always find our discussions interesting. I would definitely recommend taking a class with her; she is awesome!", "rating": 5, "expected_grade": "A", "created": "2023-11-09T22:39:30.608515Z"}, {"professor": "Peggy Wilson", "course": "TLPL451", "review": "peggy slays best woman ever", "rating": 5, "expected_grade": "A+", "created": "2023-11-15T15:00:51.587036Z"}, {"professor": "Peggy Wilson", "course": "TLPL451", "review": "Peggy is the best. She is so kind and passionate about both teaching and English and it really rubs off. She is really good about answering emails and being available to talk after class. She has so much experience and knowledge about what works in the classroom. She's also very funny and sweet. I can see why so many people keep in touch with her; she's truly a great mentor to have.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T17:37:35.369872Z"}], "department": "TLPL", "course_number": "451", "name": "TLPL451", "title": "Teaching and Learning in Secondary Education: English", "credits": 3, "description": "<b>Credit only granted for:</b> EDCI416 or TLPL451.\n<b>Formerly:</b> EDCI416.\nAn introduction for prospective middle and secondary English teachers into the basic issues, concepts, orientations, and processes that shape the teaching of English for diverse students in schools. Candidates explore their own perspectives in relation to local and national trends and develop basic teaching understanding and skills through on-campus seminars, teaching laboratory experiences, and guided field experiences. Students should reserve one full day or two half days per week for field experience.", "is_recent": true, "geneds": null}