{"average_gpa": 3.5758017492711365, "professors": ["Jason Saltmarsh", "Julie Miller", "Lisa Eaker", "Joel Miller", "Charlotte Healy", "Patrick Burke", "Nate Burke", "Claudia Galindo", "Mary Johnson", "Doug McNamara", "Neil Dhingra", "Antoinette Waller", "Charlotte Healy", "Doug McNamara", "Neil Dhingra", "Antoinette Waller", "Antoinette Waller", "Doug McNamara", "Monica Cardenas Guzman", "Colin Mccarthy", "Lisa Eaker", "Colin Mccarthy", "Colin Mccarthy", "Lisa Eaker"], "reviews": [{"professor": "Charlotte Healy", "course": "TLPL360", "review": "A wonderful person and professor! Her class was mostly based on discussions, and they were all engaging and easy to follow. She is very personable, and willing to admit when she doesn't know something off the top of her head. I've learned A LOT in this class without feeling completely overworked. I definitely recommend! ", "rating": 5, "expected_grade": "A", "created": "2019-04-17T17:57:06Z"}, {"professor": "Jason Saltmarsh", "course": "TLPL360", "review": "Very nice, very lenient, grades nicely\r\n\r\nClasses are engaging since he was formerly a grade school teacher, so you do fun exercises. Coursework is very reasonable, and he is very nice.", "rating": 5, "expected_grade": "A", "created": "2020-04-29T22:42:14Z"}, {"professor": "Charlotte Healy", "course": "TLPL360", "review": "Class-wise, you have weekly readings. Some readings might be a little long, but most are pretty interesting even if you are not any type of education major. The only major grades are 4 major essays + class reflection and participation. The essays increase in length over the semester, but its nothing difficult even if you do not like writing. You also have to lead a discussion with a partner (you sign up for a certain topic to talk abt) but its super chill and easy. Super insightful class and the professor is super nice and helpful. She makes class engaging and I would def recommend.", "rating": 5, "expected_grade": "A-", "created": "2021-12-02T19:13:42Z"}, {"professor": "Lisa Eaker", "course": "TLPL360", "review": "Professor Eaker is so sweet and engaging with her students. This course was extremely easy and she set you up for success. I am a History and Secondary Education double major, so this class was very interesting to me. This class was set up with 2 quizzes, which are online and open note; a group presentation; a final interview and analysis; and participation. Dr. Eaker is a fair grader and wants the best for everyone. She is clearly very passionate about the topics given and wants to make sure her students know the complexity and severity of issues. Several class periods were asynchronous, and the ones that were in person were very fun and allowed us to show our interests outside of content as well. \r\n\r\nOverall this course is very easy and fun if you are looking to go into the education field or looking more into the history of education as a whole.", "rating": 5, "expected_grade": "A", "created": "2022-05-24T15:06:31Z"}, {"professor": "Antoinette Waller", "course": "TLPL360", "review": "Nice and straightforward lecture style. She does occasionally try to integrate activities, however, most classes are taught by pairs or small groups of students and then she will add a little bit before or after.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T18:41:49.653493Z"}, {"professor": "Lisa Eaker", "course": "TLPL360", "review": "Professor Eaker is such a kind, knowledgable, and understanding person. She is very friendly and approachable and always tries every class to engage her students in warm ways. The class is not too difficult and is very interesting (coming from an education major). I don't know how interesting this class would be to someone who is not passionate about education and teaching, however if you are an education major this class with Prof Eaker is highly recommended by me because it is both a GPA booster and personally enjoyable.", "rating": 5, "expected_grade": "A+", "created": "2023-04-11T02:32:45.443397Z"}, {"professor": "Colin Mccarthy", "course": "TLPL360", "review": "The GOAT", "rating": 5, "expected_grade": "A+", "created": "2024-03-27T03:00:21.392743Z"}], "department": "TLPL", "course_number": "360", "name": "TLPL360", "title": "Foundations of Education", "credits": 3, "description": "<b>Credit only granted for:</b> EDPS301 or TLPL360.\n<b>Formerly:</b> EDPS301.\nSocial context of education and conflicts over philosophies, values, an goals that are reflected in educational institutions in our pluralistic society. Helps teachers become reflective, critical thinkers about the social and philosophical issues they face and the choices they make.", "is_recent": true, "geneds": null}