{"average_gpa": 3.5327433628318583, "professors": ["Adreanna Nattiel", "Rahma Haji", "Damien Hagen", "Clara Montague", "Sina Lee", "Adreanna Nattiel", "Jaime Madden", "Neel Ahuja", "Caitlin Leach", "Adreanna Nattiel", "Damien Hagen", "Rahma Haji", "Taylor York", "Neel Ahuja", "Sydney Lewis"], "reviews": [{"professor": "Damien Hagen", "course": "WGSS200", "review": "Incredible professor. Super knowledgeable about all the course content. He really cares about his students' success and comprehension. The course is not very demanding - weekly discussion boards, readings for each class, a midterm, and a final project. This is the MOST amazing class I have ever taken. Highly recommend the course and the content!!", "rating": 5, "expected_grade": "A+", "created": "2021-12-07T17:29:30Z"}, {"professor": "Damien Hagen", "course": "WGSS200", "review": "i am in a reading-intensive major and have never had this much reading to do before. i expected this to be a lighter class because of past reviews...this class does not have a light workload. discussion boards, 3-8 readings a week of varying lengths, weekly quizzes, and later in the semester outside assignments/projects/papers. i also took this as an elective so it is out of my usual realm of study.\r\n\r\nhowever, i will say the professor is nice (this class was asynchronous), and the assignments were not too difficult to do; my issue was with the time commitment that comes along with the class. if you are not worried about that and are passionate about the course material, you will be fine", "rating": 3, "expected_grade": "A", "created": "2023-10-30T19:52:31.321644Z"}, {"professor": "Damien Hagen", "course": "WGSS200", "review": "This class was a lot of work for an asynchronous class, but it wasn’t hard work. Stay on top of things, and take good notes to refer to later and it is an easy A. Final project and midterm will be easy if u keep up on readings. Nothing too hard, but I really was not interested in the content. Take it as an easy asynchronous gened but not for fun. Damien was communicative and nice, but since it was asynchronous, o never interacted with the prof face to face", "rating": 4, "expected_grade": "A+", "created": "2023-12-20T02:22:47.591061Z"}], "department": "WGSS", "course_number": "200", "name": "WGSS200", "title": "Introduction to WGSS: Gender, Power, and Society", "credits": 3, "description": "<b>Credit only granted for:</b> WMST200 or WGSS200.\n<b>Formerly:</b> WMST200.\nExamines constructions of race, class, sexuality, ability, and gender relations from a social science multi-disciplinary perspective. The course interrogates the ways that systems of hierarchy and privilege are created, enforced, and intersect through the language of race, class, sexuality, and national belonging. The course will provide students with the skills to examine how systems of power manifest in areas such as poverty, division of labor, health disparities, policing, violence. In addition to examining the impact of systems of power, students will reflect on their own location within the exercise of racialized, and gendered power relations.  This course encourages students to understand and critique these systems both personally and politically.", "is_recent": true, "geneds": null}