[
    {
        "course_name": "African-American Literature and Culture",
        "course_number": "AASP298L",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "An exploration of the stories black authors tell about themselves, their communities, and the nation as informed by time and place, gender, sexuality, and class. African American perspective themes such as art, childhood, sexuality, marriage, alienation and mortality, as well as representations of slavery, Reconstruction, racial violence and the Nadir, legalized racism and segregation, black patriotism and black ex-patriots, the optimism of integration, and the prospects of a post-racial America.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0201",
                "professor": "Timmy Bridgeman",
                "total_seats": "9",
                "open_seats": "7",
                "waitlist": "0",
                "times": "MWF 12:00pm-12:50pm"
            }
        ]
    },
    {
        "course_name": "Asian Americans in Film",
        "course_number": "AAST355",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Explores how Asian Americans have historically been represented in the U.S. by Hollywood, and in turn, how independent and Hollywood Asian American filmmakers have represented themselves. It covers the history of racial, gendered, and sexualized representations of Asian Americans in Hollywood, as well as Asian American filmic responses within and outside Hollywood. It also introduces how four basic tools of film analysis mise-en-scene, cinematography, editing and sound work together to create meaning in moving images. It examines how these elements are put together in three different types of films by Asian American filmmakers: narrative, documentary, and experimental. How films function in society to circulate ideas that reproduce and challenge stereotypes about Asian Americans.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Jennifer Cho",
                "total_seats": "30",
                "open_seats": "0",
                "waitlist": "13",
                "times": "TuTh 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "South Asian American Literature and Culture",
        "course_number": "AAST440",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Examines writing by South Asian American authors and authors writing about South Asian American issues. It explores major South Asian diaspora themes, considering how migration, war, the events of 9/11, global capitalism, and the changing socio-political and racial scene have affected South Asians in the United States. We will use a transnational approach to consider how writers and filmmakers explore gender, class, religious, caste, and other differences amongst South Asian Americans. We will also examine the place of South Asian Americans in relation to other Asian American populations. We will consider how South Asian American texts disrupt traditional literary classifications based on national identities by reflecting the complex global conditions, imperialistic and capitalistic expansion, and interconnectedness of peoples, nations, and cultures that have transformed American literature and conceptions of American identity.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Binod Paudyal",
                "total_seats": "20",
                "open_seats": "0",
                "waitlist": "7",
                "times": "TuTh 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Introduction American Studies",
        "course_number": "AMST101",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Introduces students to the interdisciplinary field of American Studies by examining concepts such as culture, identity, cultural practices, and globalization, as well as theories underlying these concepts. Engages key themes, especially constructions of difference and identity, cultures of everyday life, and America and the world.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Christina Hanhardt",
                "total_seats": "4",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 10:00am-10:50am"
            },
            {
                "section_id": "0102",
                "professor": "Christina Hanhardt",
                "total_seats": "4",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 11:00am-11:50am"
            },
            {
                "section_id": "0103",
                "professor": "Christina Hanhardt",
                "total_seats": "4",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 11:00am-11:50am"
            },
            {
                "section_id": "0104",
                "professor": "Christina Hanhardt",
                "total_seats": "4",
                "open_seats": "0",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 12:00pm-12:50pm"
            }
        ]
    },
    {
        "course_name": "U.S. Latinx Literature and Culture",
        "course_number": "AMST298Q",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Examines the poetry, prose, and theater of Latinx communities in the United States from their origins in the Spanish colonization of North America to their ongoing development in the 21st century. Considers how authors use literary form to gain insight into human experience, including mortality, religious belief, gender and sexuality, war and peace, family, language use, scientific inquiry, cultural tradition, ecology, and labor. Also studies how Latinx literary traditions have shaped and been shaped by broader currents in American literature, as well as what connections exist between Latinx literature and social and artistic developments in other parts of the world, particularly Latin America and the Caribbean. Authors may include Alvar Nunez Cabeza de Vaca, Eulalia Perez, Juan Nepomuceno Seguin, Maria Amparo Ruiz de Burton, Jose Marti, Arthur A. Schomburg, Jesus Colon, Julia de Burgos, Cesar Chavez, Ariel Dorfman, Gloria Anzaldua, Junot Diaz, and Cristina Garcia.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "James Rankin",
                "total_seats": "30",
                "open_seats": "26",
                "waitlist": "0",
                "times": "MW 5:00pm-6:15pm"
            }
        ]
    },
    {
        "course_name": "(Dis)ability in American Film",
        "course_number": "AMST320",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Explores the connection between film and disability through an analysis of independent and mainstream American films in various film genres. Specifically, we will consider how these film representations reflect and/or challenge the shifting social perspectives of disability over the 20th and 21st centuries. Beginning with the presentation of disability as theatrical spectacle in the traveling sideshow and early cinema, we will work our way through film history to develop an understanding of our society's complicated relationship with disability.",
        "geneds": [
            "DSHU",
            "DSSP",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Susan Pramschufer",
                "total_seats": "20",
                "open_seats": "0",
                "waitlist": "9",
                "times": "TuTh 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "Asian Americans in Film",
        "course_number": "AMST328W",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Explores how Asian Americans have historically been represented in the U.S. by Hollywood, and in turn, how independent and Hollywood Asian American filmmakers have represented themselves. It covers the history of racial, gendered, and sexualized representations of Asian Americans in Hollywood, as well as Asian American filmic responses within and outside Hollywood. It also introduces how four basic tools of film analysis mise-en-scene, cinematography, editing and sound work together to create meaning in moving images. It examines how these elements are put together in three different types of films by Asian American filmmakers: narrative, documentary, and experimental. How films function in society to circulate ideas that reproduce and challenge stereotypes about Asian Americans.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Jennifer Cho",
                "total_seats": "30",
                "open_seats": "0",
                "waitlist": "13",
                "times": "TuTh 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Food Cultures in the Global Middle East",
        "course_number": "ARAB250",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Food is the stuff of everyday routine and rich symbolic meaning, from holiday meals to daily staples. Studying food offers new perspectives on modernization, colonialism, and nationalism, and illuminates popular experiences of major historical events. This course introduces students to the history and cultures of the modern Middle East and North Africa using secondary literature and primary source materials addressing the sources and methods used in humanistic food studies scholarship. Students will gain a nuanced understanding of the diversity and complexities of the region as well as a lens for analyzing its cultures and societies from an everyday human perspective.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Anny Gaul",
                "total_seats": "15",
                "open_seats": "0",
                "waitlist": "7",
                "times": "MW 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "Introduction to Humanities, Health, and Medicine",
        "course_number": "ARHU230",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "restriction": "Permission of ARHU-English Department",
        "description": "An overview of the historical, cultural, ethical, and spiritual dimensions of medicine, human health, disease, and death from the points of view of various humanistic disciplines.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Michelle Moncrieffe",
                "total_seats": "20",
                "open_seats": "15",
                "waitlist": "0",
                "times": "TuTh 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "Scriptwriting for Theater, Film, and Television",
        "course_number": "ARHU275",
        "credits": "3",
        "grading_method": "Reg, P-F,",
        "description": "Introduction to the theory and practice of scriptwriting with an opportunity to read, view, evaluate, write, and revise texts meant to be performed. Students will practice writing for the stage, film, and television and also examine selected scripts, performances, and film and television clips as models for their own creative work. Students will complete frequent writing exercises, participate in workshops, and learn to apply scholarship to the analysis and critique of scripts.",
        "geneds": [
            "DSHU",
            "DSSP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Jay Wilcox",
                "total_seats": "4",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MWF 9:00am-9:50am"
            },
            {
                "section_id": "0102",
                "professor": "Jay Wilcox",
                "total_seats": "5",
                "open_seats": "5",
                "waitlist": "0",
                "times": "MWF 9:00am-9:50am"
            },
            {
                "section_id": "0201",
                "professor": "Liam Daley",
                "total_seats": "6",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MWF 10:00am-10:50am"
            }
        ]
    },
    {
        "course_name": "Contemporary Chinese Art and Film",
        "course_number": "ARTH392",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Contemporary Chinese art and film are arguably the most vibrant of all national arts at the turn of the millennium and have become the face - both figuratively and literally - of contemporary China, a complex society with historic overlays of Confucianism, Taoism, Buddhism, Communism, Post-socialism, and state capitalism. Students will consider a wide range of art forms (painting, photography, video, installation, web-based media, and film) in four broad themes (uses of the past; critiques of power; representations of race, gender, and sexuality; socially engaged art) and explore the complex intertwining of the political, historical, and aesthetic aspects in Chinese contemporary art and film, as well as the multiple contexts in which these artworks are created and circulated.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Jason Kuo",
                "total_seats": "25",
                "open_seats": "0",
                "waitlist": "1",
                "times": "M 1:00pm-3:30pm"
            }
        ]
    },
    {
        "course_name": "The Problem of Prejudice: Overcoming Impediments to Global Peace and Justice",
        "course_number": "BSOS240",
        "credits": "3",
        "grading_method": "Reg, P-F,",
        "description": "What is prejudice? How are our prejudices formed? What similarities and differences are there between various forms of prejudice across race, gender, nationality, politics, religion, among others? What is the relationship between prejudice and conflict? What is the role of prejudice in thinking about issues of peace and justice? How can we better understand the role that prejudice and discrimination have in a globalizing world? What can we learn from a scientific basis of knowledge about the causes of prejudice? This course will survey interdisciplinary scholarly research and popular cultural conversations about the root causes of prejudice and discrimination. You are expected to examine empirical evidence toward formulating your own views about the impact that all forms of prejudice impose on the human condition and the role it has played in your own life. Based on research evidence, the course encourages the search for solutions to the blight of prejudice.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Hoda Mahmoudi",
                "total_seats": "20",
                "open_seats": "19",
                "waitlist": "0",
                "times": "Tu 2:00pm-4:30pm"
            }
        ]
    },
    {
        "course_name": "Linguistic Landscape of China",
        "course_number": "CHIN307",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "",
        "description": "Comprehensive introduction to Chinese and other major languages in the Sino-Tibetan, Altaic, Austroasiatic, and Austronesian families, all of which are spoken in China. Taught in English.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Minglang Zhou",
                "total_seats": "25",
                "open_seats": "16",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am"
            }
        ]
    },
    {
        "course_name": "Film Form and Culture",
        "course_number": "CINE245",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Introduction to film as art form and how films create meaning. Basic film terminology; fundamental principles of film form, film narrative, and film history. Examination of film technique and style over past one hundred years. Social and economic functions of film within broader institutional, economic, and cultural contexts.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Oliver Gaycken",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 11:00am-11:50am"
            },
            {
                "section_id": "0102",
                "professor": "Oliver Gaycken",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 10:00am-10:50am"
            },
            {
                "section_id": "0103",
                "professor": "Oliver Gaycken",
                "total_seats": "6",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 12:00pm-12:50pm"
            },
            {
                "section_id": "0104",
                "professor": "Oliver Gaycken",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 1:00pm-1:50pm"
            }
        ]
    },
    {
        "course_name": "Film Art in a Global Society",
        "course_number": "CINE280",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Comparative study of a variety of film traditions from around the world, including cinema from Hollywood, Europe, Asia and developing countries, with a stress on different cultural contexts for film-making and viewing.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Ariana Nash",
                "total_seats": "9",
                "open_seats": "0",
                "waitlist": "0",
                "times": "MWF 1:00pm-1:50pm"
            },
            {
                "section_id": "0201",
                "professor": "Mehdy Sedaghat Payam",
                "total_seats": "30",
                "open_seats": "0",
                "waitlist": "5",
                "times": "TuTh 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "Iranian Cinema",
        "course_number": "CINE283",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Introduction to Iranian cinema, society, and culture. Taught in English.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Marjan Moosavi",
                "total_seats": "30",
                "open_seats": "29",
                "waitlist": "0",
                "times": "MW 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "Contemporary Chinese Art and Film",
        "course_number": "CINE337",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Contemporary Chinese art and film are arguably the most vibrant of all national arts at the turn of the millennium and have become the face - both figuratively and literally - of contemporary China, a complex society with historic overlays of Confucianism, Taoism, Buddhism, Communism, Post-socialism, and state capitalism. Students will consider a wide range of art forms (painting, photography, video, installation, web-based media, and film) in four broad themes (uses of the past; critiques of power; representations of race, gender, and sexuality; socially engaged art) and explore the complex intertwining of the political, historical, and aesthetic aspects in Chinese contemporary art and film, as well as the multiple contexts in which these artworks are created and circulated.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Jason Kuo",
                "total_seats": "25",
                "open_seats": "0",
                "waitlist": "1",
                "times": "M 1:00pm-3:30pm"
            }
        ]
    },
    {
        "course_name": "Ancient Myths and Modern Lives",
        "course_number": "CLAS170",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "What are myths and why do we tell them? What powers do myths have? We will tackle these questions by looking at the enduring and fascinating myths from ancient Greece and Rome. In addition to studying how they shaped ancient societies, we will also look at their modern influence and reflect upon the power that myths still hold in our contemporary world. Taught in English.",
        "geneds": [
            "DSHU",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "0",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 10:00am-10:50am"
            },
            {
                "section_id": "0102",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | Th 9:30am-10:20am"
            },
            {
                "section_id": "0103",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | Th 11:00am-11:50am"
            },
            {
                "section_id": "0104",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | Th 12:30pm-1:20pm"
            },
            {
                "section_id": "0105",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | Th 12:30pm-1:20pm"
            },
            {
                "section_id": "0106",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 11:00am-11:50am"
            },
            {
                "section_id": "0107",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 1:00pm-1:50pm"
            },
            {
                "section_id": "0108",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | Th 11:00am-11:50am"
            },
            {
                "section_id": "0109",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "5",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | Th 9:30am-10:20am"
            },
            {
                "section_id": "FC01",
                "professor": "Kathleen Garland",
                "total_seats": "22",
                "open_seats": "17",
                "waitlist": "0",
                "times": "TuTh 4:30pm-5:45pm"
            },
            {
                "section_id": "FC02",
                "professor": "Kathleen Garland",
                "total_seats": "22",
                "open_seats": "15",
                "waitlist": "0",
                "times": "TuTh 6:00pm-7:15pm"
            },
            {
                "section_id": "FC03",
                "professor": "Mary Contreras",
                "total_seats": "22",
                "open_seats": "16",
                "waitlist": "0",
                "times": "MW 4:30pm-5:45pm"
            }
        ]
    },
    {
        "course_name": "Discovering the World of Ancient Rome",
        "course_number": "CLAS190",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "An exploration of the cultural traits and developments of ancient Roman civilization from its roots in Etruscan culture, through the rise of the Roman Republic, to the expansion of Roman cultural influence in the ancient world and the emergence of the Roman Empire. Drawing upon the evidence of the archaeological remains as well as ancient historical and literary documents, students gain a basic familiarity with the principal monuments and artifacts of ancient Roman civilization, the various institutions and values that characterized the Romans, and the significant historical events that transformed the culture over the course of antiquity.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Jorge Bravo",
                "total_seats": "35",
                "open_seats": "12",
                "waitlist": "0",
                "times": "MW 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Diversify and Multiply: Jewish Culture and the Production of an Identity",
        "course_number": "CMLT242",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Provides students with a unique exploration of cultural products produced by a diverse array of Jewish creators of literature, comedy and film. The texts, films, and performing arts touch on the central social, economic, and cultural issues of Jews during the ages, and up to the 21st century. This course will explore Jewish creativity throughout history, as well as the Jewish encounter with modernity as a whole. We will be diving into prominent creators such as Tiffany Haddish, Larry David, Sholem Aleichem, Adam Sandler, S. Y. Abramovitsch, Judd Apatow, Philip Roth, Amy Schumer, I. B. Singer, Ben Stiller, Franz Kafka, Dan Levy, and others. Examining their creations will open a window to the diverse methods of construction of modern Jewish identities.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Adi Mahalel",
                "total_seats": "30",
                "open_seats": "26",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "World Literature by Women",
        "course_number": "CMLT275",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Comparative study of selected works by women writers of several countries, exploring points of intersection and divergence in women's literary representations.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0201",
                "professor": "Daniel Sidman",
                "total_seats": "9",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MW 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Film Art in a Global Society",
        "course_number": "CMLT280",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Comparative study of a variety of film traditions from around the world, including cinema from Hollywood, Europe, Asia and developing countries, with a stress on different cultural contexts for film-making and viewing.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Ariana Nash",
                "total_seats": "9",
                "open_seats": "0",
                "waitlist": "0",
                "times": "MWF 1:00pm-1:50pm"
            },
            {
                "section_id": "0201",
                "professor": "Mehdy Sedaghat Payam",
                "total_seats": "9",
                "open_seats": "0",
                "waitlist": "5",
                "times": "TuTh 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "The Great Derangement: Climate, Art, and Literature",
        "course_number": "CMLT399E",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "An investigation of the relationship between climate and art & literature. Introduction to ecological thinking followed by study of artistic and literary works thematically grouped by the four elements: Earth, Water, Air, and Fire. Readings from the German literary tradition (Goethe, Tieck, Stifter, Kafka, Frisch, Wolf) and contemporary research in the environmental humanities, with additional readings and viewings from elsewhere on the planet. Taught in English.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Josh Alvizu",
                "total_seats": "25",
                "open_seats": "23",
                "waitlist": "0",
                "times": "MWF 1:00pm-1:50pm"
            }
        ]
    },
    {
        "course_name": "Technology and Consequences: Engineering, Ethics, and Humanity",
        "course_number": "ENEE200",
        "credits": "3",
        "grading_method": "Reg,",
        "description": "What makes a technology socially responsible? At UMD, the Fearless Ideas campaign asks us to aim our enthusiasm for technology at big real problems. At the same time, we are coming to appreciate the increasingly complex nature of technological systems as they become integrated into all forms of infrastructure, we realize they may be unpredictable, interdependent on social and biological systems, and have unintended consequences. In this midst of this complexity, people make decisions with far reaching impacts. How then do we follow our passion for technology and innovation but also stay skeptical in a way that allows us to consider the potential and shortcomings of technology? Designed for both engineering and non-engineering students wishing to explore and assess the impact of engineering technology on society and the role of society in generating that technology.",
        "geneds": [
            "DSHU",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Wesley Lawson",
                "total_seats": "14",
                "open_seats": "12",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am | F 9:00am-10:15am"
            },
            {
                "section_id": "0102",
                "professor": "Wesley Lawson",
                "total_seats": "14",
                "open_seats": "10",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am | F 10:30am-11:45am"
            },
            {
                "section_id": "0103",
                "professor": "Wesley Lawson",
                "total_seats": "14",
                "open_seats": "8",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am | F 12:00pm-1:15pm"
            },
            {
                "section_id": "0104",
                "professor": "Wesley Lawson",
                "total_seats": "14",
                "open_seats": "9",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am | F 1:30pm-2:45pm"
            },
            {
                "section_id": "0105",
                "professor": "Wesley Lawson",
                "total_seats": "14",
                "open_seats": "7",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am | F 3:00pm-4:15pm"
            },
            {
                "section_id": "0201",
                "professor": "Nicole Mogul",
                "total_seats": "15",
                "open_seats": "14",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm | F 9:00am-10:15am"
            },
            {
                "section_id": "0202",
                "professor": "Nicole Mogul",
                "total_seats": "15",
                "open_seats": "13",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm | F 10:30am-11:45am"
            },
            {
                "section_id": "0203",
                "professor": "Nicole Mogul",
                "total_seats": "15",
                "open_seats": "11",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm | F 12:00pm-1:15pm"
            },
            {
                "section_id": "0204",
                "professor": "Nicole Mogul",
                "total_seats": "15",
                "open_seats": "15",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm | F 1:30pm-2:45pm"
            },
            {
                "section_id": "0205",
                "professor": "Nicole Mogul",
                "total_seats": "15",
                "open_seats": "12",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm | F 3:00pm-4:15pm"
            }
        ]
    },
    {
        "course_name": "Technology and Consequences: Engineering, Ethics and Humanity",
        "course_number": "ENES200",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "What makes a technology socially responsible? At UMD, the Fearless Ideas campaign asks us to aim our enthusiasm for technology at big real problems. At the same time, we are coming to appreciate the increasingly complex nature of technological systems as they become integrated into all forms of infrastructure, we realize they may be unpredictable, interdependent on social and biological systems, and have unintended consequences. In this midst of this complexity, people make decisions with far reaching impacts. How then do we follow our passion for technology and innovation but also stay skeptical in a way that allows us to consider the potential and shortcomings of technology? Designed for both engineering and non-engineering students wishing to explore and assess the impact of engineering technology on society and the role of society in generating that technology.",
        "geneds": [
            "DSHU",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Timothy Reedy",
                "total_seats": "16",
                "open_seats": "10",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am | F 9:00am-10:15am"
            },
            {
                "section_id": "0102",
                "professor": "Timothy Reedy",
                "total_seats": "16",
                "open_seats": "10",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am | F 10:30am-11:45am"
            },
            {
                "section_id": "0103",
                "professor": "Timothy Reedy",
                "total_seats": "16",
                "open_seats": "9",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am | F 12:00pm-1:15pm"
            },
            {
                "section_id": "0104",
                "professor": "Timothy Reedy",
                "total_seats": "15",
                "open_seats": "11",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am | F 1:30pm-2:45pm"
            },
            {
                "section_id": "0105",
                "professor": "Timothy Reedy",
                "total_seats": "15",
                "open_seats": "12",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am | F 3:00pm-4:15pm"
            },
            {
                "section_id": "0201",
                "professor": "Dennis Frezzo",
                "total_seats": "16",
                "open_seats": "12",
                "waitlist": "0",
                "times": "TuTh 2:00pm-3:15pm | F 9:00am-10:15am"
            },
            {
                "section_id": "0202",
                "professor": "Dennis Frezzo",
                "total_seats": "16",
                "open_seats": "12",
                "waitlist": "0",
                "times": "TuTh 2:00pm-3:15pm | F 10:30am-11:45am"
            },
            {
                "section_id": "0203",
                "professor": "Dennis Frezzo",
                "total_seats": "16",
                "open_seats": "12",
                "waitlist": "0",
                "times": "TuTh 2:00pm-3:15pm | F 12:00pm-1:15pm"
            },
            {
                "section_id": "0204",
                "professor": "Dennis Frezzo",
                "total_seats": "15",
                "open_seats": "12",
                "waitlist": "0",
                "times": "TuTh 2:00pm-3:15pm | F 1:30pm-2:45pm"
            },
            {
                "section_id": "0205",
                "professor": "Dennis Frezzo",
                "total_seats": "15",
                "open_seats": "14",
                "waitlist": "0",
                "times": "TuTh 2:00pm-3:15pm | F 3:00pm-4:15pm"
            },
            {
                "section_id": "0301",
                "professor": "Christine Alexander",
                "total_seats": "15",
                "open_seats": "14",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm | F 9:00am-10:15am"
            },
            {
                "section_id": "0302",
                "professor": "Christine Alexander",
                "total_seats": "15",
                "open_seats": "11",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm | F 10:30am-11:45am"
            },
            {
                "section_id": "0303",
                "professor": "Christine Alexander",
                "total_seats": "15",
                "open_seats": "11",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm | F 12:00pm-1:15pm"
            },
            {
                "section_id": "0304",
                "professor": "Christine Alexander",
                "total_seats": "15",
                "open_seats": "12",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm | F 1:30pm-2:45pm"
            },
            {
                "section_id": "0305",
                "professor": "Christine Alexander",
                "total_seats": "15",
                "open_seats": "12",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm | F 3:00pm-4:15pm"
            }
        ]
    },
    {
        "course_name": "African-American Literature and Culture",
        "course_number": "ENGL234",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "An exploration of the stories black authors tell about themselves, their communities, and the nation as informed by time and place, gender, sexuality, and class. African American perspective themes such as art, childhood, sexuality, marriage, alienation and mortality, as well as representations of slavery, Reconstruction, racial violence and the Nadir, legalized racism and segregation, black patriotism and black ex-patriots, the optimism of integration, and the prospects of a post-racial America.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0201",
                "professor": "Timmy Bridgeman",
                "total_seats": "9",
                "open_seats": "7",
                "waitlist": "0",
                "times": "MWF 12:00pm-12:50pm"
            }
        ]
    },
    {
        "course_name": "U.S. Latinx Literature and Culture",
        "course_number": "ENGL235",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Examines the poetry, prose, and theater of Latinx communities in the United States from their origins in the Spanish colonization of North America to their ongoing development in the 21st century. Considers how authors use literary form to gain insight into human experience, including mortality, religious belief, gender and sexuality, war and peace, family, language use, scientific inquiry, cultural tradition, ecology, and labor. Also studies how Latinx literary traditions have shaped and been shaped by broader currents in American literature, as well as what connections exist between Latinx literature and social and artistic developments in other parts of the world, particularly Latin America and the Caribbean. Authors may include Alvar Nunez Cabeza de Vaca, Eulalia Perez, Juan Nepomuceno Seguin, Maria Amparo Ruiz de Burton, Jose Marti, Arthur A. Schomburg, Jesus Colon, Julia de Burgos, Cesar Chavez, Ariel Dorfman, Gloria Anzaldua, Junot Diaz, and Cristina Garcia.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "James Rankin",
                "total_seats": "30",
                "open_seats": "26",
                "waitlist": "0",
                "times": "MW 5:00pm-6:15pm"
            }
        ]
    },
    {
        "course_name": "Film Form and Culture",
        "course_number": "ENGL245",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Introduction to film as art form and how films create meaning. Basic film terminology; fundamental principles of film form, film narrative, and film history. Examination of film technique and style over past one hundred years. Social and economic functions of film within broader institutional, economic, and cultural contexts.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Oliver Gaycken",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 11:00am-11:50am"
            },
            {
                "section_id": "0102",
                "professor": "Oliver Gaycken",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 10:00am-10:50am"
            },
            {
                "section_id": "0103",
                "professor": "Oliver Gaycken",
                "total_seats": "6",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 12:00pm-12:50pm"
            },
            {
                "section_id": "0104",
                "professor": "Oliver Gaycken",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 1:00pm-1:50pm"
            }
        ]
    },
    {
        "course_name": "Reading Women Writing",
        "course_number": "ENGL250",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Explores literary and cultural expressions by women and their receptions within a range of historical periods and genres. Topics such as what does a woman need in order to write, what role does gender play in the production, consumption, and interpretation of texts, and to what extent do women comprise a distinct literary subculture. Interpretation of texts will be guided by feminist and gender theory, ways of reading that have emerged as important to literary studies over the last four decades.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Tyra Griffin",
                "total_seats": "9",
                "open_seats": "5",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am"
            }
        ]
    },
    {
        "course_name": "Introduction to Humanities, Health, and Medicine",
        "course_number": "ENGL254",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "restriction": "Permission of ARHU-English Department",
        "description": "An overview of the historical, cultural, ethical, and spiritual dimensions of medicine, human health, disease, and death from the points of view of various humanistic disciplines.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Michelle Moncrieffe",
                "total_seats": "20",
                "open_seats": "15",
                "waitlist": "0",
                "times": "TuTh 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "LGBTQ+ Literatures and Media",
        "course_number": "ENGL265",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "restriction": "Must not have completed LGBT265",
        "description": "A study of literary and cultural expressions of queer and trans identities, positionalities, and analytics through an exploration of literature, art, and media. We will examine historical and political power relations by considering the intersections of sexuality and gender with race, class, nation, and disability. Topics include the social construction and regulation of sexuality and gender, performance and performativity, intersectionality, and the relationship between aesthetic forms and queer/ trans subjectivity. Our interpretations will be informed by queer and trans theories.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Leela Chantrelle",
                "total_seats": "30",
                "open_seats": "19",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:45pm"
            },
            {
                "section_id": "0201",
                "professor": "James Goodwin",
                "total_seats": "30",
                "open_seats": "23",
                "waitlist": "0",
                "times": "TuTh 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Scriptwriting for Theater, Film, and Television",
        "course_number": "ENGL275",
        "credits": "3",
        "grading_method": "Reg, P-F,",
        "description": "Introduction to the theory and practice of scriptwriting with an opportunity to read, view, evaluate, write, and revise texts meant to be performed. Students will practice writing for the stage, film, and television and also examine selected scripts, performances, and film and television clips as models for their own creative work. Students will complete frequent writing exercises, participate in workshops, and learn to apply scholarship to the analysis and critique of scripts.",
        "geneds": [
            "DSHU",
            "DSSP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Jay Wilcox",
                "total_seats": "4",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MWF 9:00am-9:50am"
            },
            {
                "section_id": "0102",
                "professor": "Jay Wilcox",
                "total_seats": "5",
                "open_seats": "5",
                "waitlist": "0",
                "times": "MWF 9:00am-9:50am"
            },
            {
                "section_id": "0201",
                "professor": "Liam Daley",
                "total_seats": "6",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MWF 10:00am-10:50am"
            }
        ]
    },
    {
        "course_name": "Writing, Revising, Persuading",
        "course_number": "ENGL291",
        "credits": "3",
        "grading_method": "Reg,",
        "prereq": "",
        "description": "Intermediate-level, writing-intensive course for students who have successfully satisfied the Fundamental Studies Academic Writing requirement but wish to hone skills in analyzing and producing rhetorically attuned, well-styled prose. Deeper study of rhetorical theory and its application to a wide variety of arguments and situations. Additional writing practice, techniques of revision, study of effect of stylistic choices. Topics may include argumentation theory, visual rhetoric, stylistic theory, and writing theory.",
        "geneds": [
            "DSHU",
            "DSSP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Erin Green",
                "total_seats": "20",
                "open_seats": "18",
                "waitlist": "0",
                "times": "MWF 12:00pm-12:50pm"
            }
        ]
    },
    {
        "course_name": "Writing in the Wireless World",
        "course_number": "ENGL293",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "A hands-on exploration of writing at the intersection of technology and rhetoric. Students will learn to read, analyze, and compose the kinds of multimodal documents--documents combining text, image, and sound--that constitute communication in our digital world.",
        "geneds": [
            "DSHU",
            "DSSP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Porter Olsen",
                "total_seats": "22",
                "open_seats": "19",
                "waitlist": "0",
                "times": "MWF 2:00pm-2:50pm"
            }
        ]
    },
    {
        "course_name": "Persuasion and Cleverness in Social Media",
        "course_number": "ENGL294",
        "credits": "3",
        "grading_method": "Reg, P-F,",
        "prereq": "",
        "description": "Exploration of various persuasive media encountered in daily life through the lens of rhetorical and critical theories. Principles of rhetoric and analysis of how persuasion functions across media. Invention of effective multimedia works appropriate to purpose, audience, and context. Concepts from cultural studies used to develop critical awareness about power and ideology and how they influence the way people produce and understand messages. By integration of technology, rhetoric, and cultural studies, students become more critically-rhetorically informed thinkers, authors, and audiences of arguments and culture in the digital age. Writing intensive course. No prior multimedia experience is expected.",
        "geneds": [
            "DSHU",
            "DSSP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Morgan Robinson",
                "total_seats": "20",
                "open_seats": "20",
                "waitlist": "0",
                "times": "MWF 2:00pm-2:50pm"
            }
        ]
    },
    {
        "course_name": "Introduction to Cultural and Textual Analysis",
        "course_number": "FREN250",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "FREN204",
        "restriction": "Must not be a native/fluent speaker of French",
        "description": "Introduction to cultural and textual analysis of selected readings from various genres in French literature. Taught in French.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Instructor: TBA",
                "total_seats": "18",
                "open_seats": "18",
                "waitlist": "0",
                "times": "MW 2:00pm-3:15pm"
            },
            {
                "section_id": "0201",
                "professor": "Cecile Accilien",
                "total_seats": "18",
                "open_seats": "10",
                "waitlist": "0",
                "times": "TuTh 11:00am-12:15pm"
            },
            {
                "section_id": "0101",
                "professor": "Instructor: TBA",
                "total_seats": "18",
                "open_seats": "18",
                "waitlist": "0",
                "times": "MW 2:00pm-3:15pm"
            },
            {
                "section_id": "0201",
                "professor": "Cecile Accilien",
                "total_seats": "18",
                "open_seats": "10",
                "waitlist": "0",
                "times": "TuTh 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "Introduction to Cultural and Textual Analysis",
        "course_number": "FREN250H",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "FREN204",
        "restriction": "Must not be a native/fluent speaker of French",
        "description": "Introduction to cultural and textual analysis of selected readings from various genres in French literature. Taught in French.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Instructor: TBA",
                "total_seats": "18",
                "open_seats": "18",
                "waitlist": "0",
                "times": "MW 2:00pm-3:15pm"
            },
            {
                "section_id": "0201",
                "professor": "Cecile Accilien",
                "total_seats": "18",
                "open_seats": "10",
                "waitlist": "0",
                "times": "TuTh 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "Highlights of German Literature and Culture",
        "course_number": "GERS322",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "GERS302",
        "description": "Selected literary masterworks, social and cultural issues, and historical events in German-speaking countries from the Enlightenment, Romanticism, Junges Deutschland, Realism, Naturalism and its counter currents, Expressionism to the present. Taught in German.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Josh Alvizu",
                "total_seats": "18",
                "open_seats": "14",
                "waitlist": "0",
                "times": "MWF 10:00am-10:50am"
            },
            {
                "section_id": "0101",
                "professor": "Josh Alvizu",
                "total_seats": "18",
                "open_seats": "14",
                "waitlist": "0",
                "times": "MWF 10:00am-10:50am"
            }
        ]
    },
    {
        "course_name": "Highlights of German Literature and Culture",
        "course_number": "GERS322H",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "GERS302",
        "description": "Selected literary masterworks, social and cultural issues, and historical events in German-speaking countries from the Enlightenment, Romanticism, Junges Deutschland, Realism, Naturalism and its counter currents, Expressionism to the present. Taught in German.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Josh Alvizu",
                "total_seats": "18",
                "open_seats": "14",
                "waitlist": "0",
                "times": "MWF 10:00am-10:50am"
            }
        ]
    },
    {
        "course_name": "The Great Derangement: Climate, Art, and Literature",
        "course_number": "GERS367",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "An investigation of the relationship between climate and art & literature. Introduction to ecological thinking followed by study of artistic and literary works thematically grouped by the four elements: Earth, Water, Air, and Fire. Readings from the German literary tradition (Goethe, Tieck, Stifter, Kafka, Frisch, Wolf) and contemporary research in the environmental humanities, with additional readings and viewings from elsewhere on the planet. Taught in English.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Josh Alvizu",
                "total_seats": "25",
                "open_seats": "23",
                "waitlist": "0",
                "times": "MWF 1:00pm-1:50pm"
            }
        ]
    },
    {
        "course_name": "Honors Humanities: Introduction to the Arts and Humanities",
        "course_number": "HHUM105",
        "credits": "3",
        "grading_method": "Reg,",
        "restriction": "Must be an entering freshmen in the Honors Humanities Program",
        "description": "Introduction to the university, the different fields of the arts and humanities, and the history of how the university and the humanities have evolved across the world from ancient times to the present. Primary emphasis on reading and discussion of literary artifacts to assess the meaning and social status of the arts and humanities in the past and their personal and social value for the future.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Randy Ontiveros",
                "total_seats": "15",
                "open_seats": "15",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 9:00am-9:50am"
            },
            {
                "section_id": "0102",
                "professor": "Randy Ontiveros",
                "total_seats": "15",
                "open_seats": "15",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 10:00am-10:50am"
            },
            {
                "section_id": "0103",
                "professor": "Randy Ontiveros",
                "total_seats": "15",
                "open_seats": "15",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 11:00am-11:50am"
            },
            {
                "section_id": "0104",
                "professor": "Randy Ontiveros",
                "total_seats": "15",
                "open_seats": "15",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 12:00pm-12:50pm"
            }
        ]
    },
    {
        "course_name": "The Everyday and the American Environment",
        "course_number": "HISP200",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "An introduction to the theories of the everyday within the context of the American built environment. Focuses primarily on the American experience of underrepresented, minority, and/or immigrant communities; both historical and contemporary. Attempts to challenge what is meant by American in describing the American everyday built environment.",
        "geneds": [
            "DSHU",
            "DVUP",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Instructor: TBA",
                "total_seats": "5",
                "open_seats": "1",
                "waitlist": "0",
                "times": "Th 3:30pm-4:45pm | F 1:00pm-2:15pm"
            },
            {
                "section_id": "0102",
                "professor": "Instructor: TBA",
                "total_seats": "7",
                "open_seats": "1",
                "waitlist": "0",
                "times": "Th 3:30pm-4:45pm | F 1:00pm-2:15pm"
            },
            {
                "section_id": "0103",
                "professor": "Instructor: TBA",
                "total_seats": "7",
                "open_seats": "3",
                "waitlist": "0",
                "times": "Th 3:30pm-4:45pm | F 2:00pm-3:15pm"
            },
            {
                "section_id": "0104",
                "professor": "Instructor: TBA",
                "total_seats": "7",
                "open_seats": "3",
                "waitlist": "0",
                "times": "Th 3:30pm-4:45pm | F 2:00pm-3:15pm"
            },
            {
                "section_id": "0105",
                "professor": "Instructor: TBA",
                "total_seats": "5",
                "open_seats": "3",
                "waitlist": "0",
                "times": "Th 3:30pm-4:45pm | F 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Islamic Civilization",
        "course_number": "HIST120",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Introduction to society and culture in the Middle East since the advent of Islam: as a personal and communal faith; as artistic and literary highlights of intellectual and cultural life; and as the interplay between politics and religion under the major Islamic regimes.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Rachel Schine",
                "total_seats": "23",
                "open_seats": "23",
                "waitlist": "0",
                "times": "MW 10:00am-10:50am | F 9:00am-9:50am"
            },
            {
                "section_id": "0102",
                "professor": "Rachel Schine",
                "total_seats": "23",
                "open_seats": "20",
                "waitlist": "0",
                "times": "MW 10:00am-10:50am | F 10:00am-10:50am"
            },
            {
                "section_id": "0103",
                "professor": "Rachel Schine",
                "total_seats": "23",
                "open_seats": "18",
                "waitlist": "0",
                "times": "MW 10:00am-10:50am | F 12:00pm-12:50pm"
            }
        ]
    },
    {
        "course_name": "Spies, Assassins, Martyrs, and Witches: Famous Trials in American History",
        "course_number": "HIST134",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Examination of some of the most famous trials in American history and their enduring hold on the imagination.",
        "geneds": [
            "DSHU",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Michael Ross",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:20am | W 9:00am-9:50am"
            },
            {
                "section_id": "0102",
                "professor": "Michael Ross",
                "total_seats": "6",
                "open_seats": "1",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:20am | W 10:00am-10:50am"
            },
            {
                "section_id": "0103",
                "professor": "Michael Ross",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:20am | W 11:00am-11:50am"
            },
            {
                "section_id": "0104",
                "professor": "Michael Ross",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:20am | W 12:00pm-12:50pm"
            },
            {
                "section_id": "0105",
                "professor": "Michael Ross",
                "total_seats": "6",
                "open_seats": "0",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:20am | W 1:00pm-1:50pm"
            },
            {
                "section_id": "0106",
                "professor": "Michael Ross",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:20am | W 2:00pm-2:50pm"
            },
            {
                "section_id": "0201",
                "professor": "Michael Ross",
                "total_seats": "27",
                "open_seats": "27",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:20am | W 11:00am-11:50am"
            }
        ]
    },
    {
        "course_name": "Interpreting American History: Beginnings to 1877",
        "course_number": "HIST200",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "The United States from colonial times to the end of the Civil War. Establishment and development of American institutions.",
        "geneds": [
            "DSHU",
            "DSHS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Howard Smead",
                "total_seats": "20",
                "open_seats": "16",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | W 10:00am-10:50am"
            },
            {
                "section_id": "0102",
                "professor": "Howard Smead",
                "total_seats": "20",
                "open_seats": "14",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | W 12:00pm-12:50pm"
            },
            {
                "section_id": "0103",
                "professor": "Howard Smead",
                "total_seats": "20",
                "open_seats": "20",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | W 9:00am-9:50am"
            },
            {
                "section_id": "0104",
                "professor": "Howard Smead",
                "total_seats": "20",
                "open_seats": "20",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 9:00am-9:50am"
            },
            {
                "section_id": "0105",
                "professor": "Howard Smead",
                "total_seats": "20",
                "open_seats": "19",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 12:00pm-12:50pm"
            },
            {
                "section_id": "0106",
                "professor": "Howard Smead",
                "total_seats": "20",
                "open_seats": "20",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 11:00am-11:50am"
            },
            {
                "section_id": "FC01",
                "professor": "Howard Smead",
                "total_seats": "20",
                "open_seats": "13",
                "waitlist": "0",
                "times": "MW 4:30pm-5:45pm"
            }
        ]
    },
    {
        "course_name": "Interpreting American History: From 1865 to the Present",
        "course_number": "HIST201",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "The United States from the end of the Civil War to the present. Economic, social, intellectual, and political developments. Rise of industry and emergence of the United States as a world power.",
        "geneds": [
            "DVUP",
            "DSHU",
            "DSHS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Howard Smead",
                "total_seats": "23",
                "open_seats": "21",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | M 9:00am-9:50am"
            },
            {
                "section_id": "0102",
                "professor": "Howard Smead",
                "total_seats": "23",
                "open_seats": "22",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | M 10:00am-10:50am"
            },
            {
                "section_id": "0103",
                "professor": "Howard Smead",
                "total_seats": "23",
                "open_seats": "18",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | M 1:00pm-1:50pm"
            },
            {
                "section_id": "0104",
                "professor": "Howard Smead",
                "total_seats": "23",
                "open_seats": "22",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | W 9:00am-9:50am"
            },
            {
                "section_id": "0105",
                "professor": "Howard Smead",
                "total_seats": "23",
                "open_seats": "18",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | W 10:00am-10:50am"
            },
            {
                "section_id": "0106",
                "professor": "Howard Smead",
                "total_seats": "23",
                "open_seats": "14",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | W 1:00pm-1:50pm"
            },
            {
                "section_id": "0107",
                "professor": "Howard Smead",
                "total_seats": "23",
                "open_seats": "23",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 9:00am-9:50am"
            },
            {
                "section_id": "0108",
                "professor": "Howard Smead",
                "total_seats": "23",
                "open_seats": "22",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 10:00am-10:50am"
            },
            {
                "section_id": "0109",
                "professor": "Howard Smead",
                "total_seats": "23",
                "open_seats": "17",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 12:00pm-12:50pm"
            },
            {
                "section_id": "0201",
                "professor": "Robert Chiles",
                "total_seats": "20",
                "open_seats": "19",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:20pm | Tu 9:30am-10:20am"
            },
            {
                "section_id": "0202",
                "professor": "Robert Chiles",
                "total_seats": "20",
                "open_seats": "9",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:20pm | Tu 11:00am-11:50am"
            },
            {
                "section_id": "0203",
                "professor": "Robert Chiles",
                "total_seats": "20",
                "open_seats": "14",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:20pm | Tu 2:00pm-2:50pm"
            },
            {
                "section_id": "0204",
                "professor": "Robert Chiles",
                "total_seats": "20",
                "open_seats": "17",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:20pm | Th 9:30am-10:20am"
            },
            {
                "section_id": "0205",
                "professor": "Robert Chiles",
                "total_seats": "20",
                "open_seats": "9",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:20pm | Th 11:00am-11:50am"
            },
            {
                "section_id": "0206",
                "professor": "Robert Chiles",
                "total_seats": "20",
                "open_seats": "12",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:20pm | Th 2:00pm-2:50pm"
            },
            {
                "section_id": "FC02",
                "professor": "Robert Chiles",
                "total_seats": "25",
                "open_seats": "17",
                "waitlist": "0",
                "times": "TuTh 4:30pm-5:45pm"
            }
        ]
    },
    {
        "course_name": "Religions of the Ancient Near East",
        "course_number": "HIST219I",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Introduction to ancient Near Eastern religious systems and mythology, from the third millennium BCE through the fourth century BCE. Particular emphasis on Mesopotamia and ancient Israel.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Matthew Suriano",
                "total_seats": "25",
                "open_seats": "13",
                "waitlist": "0",
                "times": "MW 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "Discovering the World of Ancient Rome",
        "course_number": "HIST219T",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "An exploration of the cultural traits and developments of ancient Roman civilization from its roots in Etruscan culture, through the rise of the Roman Republic, to the expansion of Roman cultural influence in the ancient world and the emergence of the Roman Empire. Drawing upon the evidence of the archaeological remains as well as ancient historical and literary documents, students gain a basic familiarity with the principal monuments and artifacts of ancient Roman civilization, the various institutions and values that characterized the Romans, and the significant historical events that transformed the culture over the course of antiquity.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Jorge Bravo",
                "total_seats": "35",
                "open_seats": "12",
                "waitlist": "0",
                "times": "MW 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Digital Media Theory and Culture",
        "course_number": "IMDM150",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "restriction": "Must be in the Immersive Media Design program; or permission of IMDM - Immersive Media Design program",
        "description": "An introduction to the fundamental structures and themes of digital culture in contemporary society. This course will provide you with a theoretical grounding in which to understand the current landscape of digital media culture, design and art. As an introductory course for the Immersive Media Design major, the focus will be on contextualizing immersive digital media such as virtual reality, augmented reality, immersive projection, and electronic art installation through reading, writing and discussion. Students will have opportunities to experience a range of these technologies first hand.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Instructor: TBA",
                "total_seats": "30",
                "open_seats": "30",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "The Dark Side of the Italian Renaissance",
        "course_number": "ITAL441",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Examines the dark aspects of the Italian Renaissance, focusing on artistic and literary patronage as a strategy of self-promotion and as a means to achieve and preserve power. From the Northern court of Milan to the Southern Kingdom of Naples, we journey through the Italian peninsula, a land that gave birth to illustrious artists and poets in one of the most troubled periods of Italian history, marked by political conflict, bloody rivalries, family betrayals, and wars. What hides beneath the image of some of these benevolent and enlightened patrons of learning, often praised as \"ideal rulers\" by artists and writers of the Renaissance, are ambitious and crafty politicians, who sought their own interests and goals in their ruthless pursuit of power",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Joseph Falvo",
                "total_seats": "25",
                "open_seats": "24",
                "waitlist": "0",
                "times": "MWF 1:00pm-1:50pm"
            }
        ]
    },
    {
        "course_name": "Beyond Facebook: How Social Media are Transforming Society, Culture, Business and Politics",
        "course_number": "JOUR282",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "How has social media changed the world, and how has the world changed social media? This course explores how social media has influenced relationships, culture, industry, politics, and the information environment, as well as how significant global events and technological advancements have contributed to the evolution of social media. This course gives students a broad contextual understanding of social media that they may apply in their daily lives as well as future academic inquiry.",
        "geneds": [
            "DSHU",
            "SCIS"
        ]
    },
    {
        "course_name": "Probing War: Investigative Narratives and American Conflicts",
        "course_number": "JOUR283",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "What role should the American news media play when the United States is at war? Students will explore the realities of war through the work of journalists who pushed beyond the daily headlines, some risking life and limb, to challenge official versions and document uncomfortable realities about American conflicts.",
        "geneds": [
            "DSHU",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Christopher Hanson",
                "total_seats": "9",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "Literature in Journalism",
        "course_number": "JOUR456",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "From Truman Capote's In Cold Blood to Mark Bowden's Black Hawk Down, students will examine how literary works can help writers approach a subject in a different way than more traditional forms of journalism, including the advantages and limitations of the style.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Christopher Hanson",
                "total_seats": "18",
                "open_seats": "15",
                "waitlist": "0",
                "times": "Tu 4:15pm-7:00pm"
            }
        ]
    },
    {
        "course_name": "Is Judaism a Religion?",
        "course_number": "JWST171",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Jewish identity can be framed in terms of ethnicity, culture, and religious practice, but also in terms of more contemporary social constructions including social action, political engagement, and intellectual pursuit. In the context of such diverse social and individual frames, what does it mean to identify Judaism as a religion? Attention to Jewish society in historical and global perspective will provide a backdrop for a particular focus on contemporary Jews in the United States and Israel.",
        "geneds": [
            "DSHU",
            "DVUP",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Maxine Grossman",
                "total_seats": "12",
                "open_seats": "5",
                "waitlist": "0",
                "times": "MW 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Religions of the Ancient Near East",
        "course_number": "JWST225",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Introduction to ancient Near Eastern religious systems and mythology, from the third millennium BCE through the fourth century BCE. Particular emphasis on Mesopotamia and ancient Israel.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Matthew Suriano",
                "total_seats": "25",
                "open_seats": "13",
                "waitlist": "0",
                "times": "MW 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "Introduction to the Hebrew Bible/Old Testament",
        "course_number": "JWST262",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Origins of the Hebrew Bible (Old Testament), with attention to literary formations, archaeology, and social-political settings. Explorations of major questions, including who wrote the Bible, and when; relationships of the biblical tradition to the mythology and religious structures of ancient Israel's near eastern neighbors; and dynamics of politics, religious leadership, and law.",
        "geneds": [
            "DSHU"
        ]
    },
    {
        "course_name": "Diversify and Multiply: Jewish Culture and the Production of an Identity",
        "course_number": "JWST272",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Provides students with a unique exploration of cultural products produced by a diverse array of Jewish creators of literature, comedy and film. The texts, films, and performing arts touch on the central social, economic, and cultural issues of Jews during the ages, and up to the 21st century. This course will explore Jewish creativity throughout history, as well as the Jewish encounter with modernity as a whole. We will be diving into prominent creators such as Tiffany Haddish, Larry David, Sholem Aleichem, Adam Sandler, S. Y. Abramovitsch, Judd Apatow, Philip Roth, Amy Schumer, I. B. Singer, Ben Stiller, Franz Kafka, Dan Levy, and others. Examining their creations will open a window to the diverse methods of construction of modern Jewish identities.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Adi Mahalel",
                "total_seats": "30",
                "open_seats": "26",
                "waitlist": "0",
                "times": "TuTh 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "Jerusalem in Antiquity: The History of Sacred Space in a Holy City",
        "course_number": "JWST274",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Examines the complex history of Jerusalem's status as a holy city, with a focus on constructions of sacred space in Judaism, Christianity, and Islam.",
        "geneds": [
            "DSHU",
            "DVUP",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Matthew Suriano",
                "total_seats": "6",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | W 1:00pm-1:50pm"
            },
            {
                "section_id": "0102",
                "professor": "Matthew Suriano",
                "total_seats": "6",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 11:00am-11:50am"
            },
            {
                "section_id": "0103",
                "professor": "Matthew Suriano",
                "total_seats": "6",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 12:00pm-12:50pm"
            },
            {
                "section_id": "0104",
                "professor": "Matthew Suriano",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | W 2:00pm-2:50pm"
            }
        ]
    },
    {
        "course_name": "History of Physical Culture, Sport, & Science in America",
        "course_number": "KNES285",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "restriction": "Restricted to majors or non-majors with less than or equal to 60 credits",
        "description": "Examines the history of physical culture in America, focusing on the period from the end of the Civil War to the Cold War. Physical culture refers to a broad range of movement practices including sport, play, rehabilitative exercise, health and fitness training, and recreation and leisure. More specifically, we challenge the idea that historical physical culture practices--and the scientific processes from which they were derived--were 'neutral' or 'objective'; rather, we explore the cultural, social, political, and economic contexts shaping physical culture knowledge, study, structures, and policies across American history. The goal is for you to learn and apply techniques of historical analysis to develop a critical understanding of how knowledge about, and practices of, physical culture supported a particular social order via the construction of difference, norms, and/or hierarchies, and ultimately contributed to some of the inequalities that endure today.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Shannon Jette",
                "total_seats": "14",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 10:00am-10:50am | W 1:00pm-1:50pm"
            },
            {
                "section_id": "0102",
                "professor": "Shannon Jette",
                "total_seats": "14",
                "open_seats": "10",
                "waitlist": "0",
                "times": "MW 10:00am-10:50am | W 2:00pm-2:50pm"
            },
            {
                "section_id": "0103",
                "professor": "Shannon Jette",
                "total_seats": "14",
                "open_seats": "14",
                "waitlist": "0",
                "times": "MW 10:00am-10:50am | W 3:00pm-3:50pm"
            },
            {
                "section_id": "0104",
                "professor": "Shannon Jette",
                "total_seats": "14",
                "open_seats": "14",
                "waitlist": "0",
                "times": "MW 10:00am-10:50am | F 10:00am-10:50am"
            },
            {
                "section_id": "0105",
                "professor": "Shannon Jette",
                "total_seats": "14",
                "open_seats": "14",
                "waitlist": "0",
                "times": "MW 10:00am-10:50am | F 11:00am-11:50am"
            },
            {
                "section_id": "0106",
                "professor": "Shannon Jette",
                "total_seats": "14",
                "open_seats": "11",
                "waitlist": "0",
                "times": "MW 10:00am-10:50am | F 12:00pm-12:50pm"
            }
        ]
    },
    {
        "course_name": "Issues in Latin American and Caribbean Studies I",
        "course_number": "LACS234",
        "credits": "3",
        "grading_method": "Reg,",
        "description": "Interdisciplinary study of major issues in Latin America and the Caribbean, including Latin America's cultural mosaic, migration and urbanization. Democratization and the role of religions. Taught in English.",
        "geneds": [
            "DVUP",
            "DSHU",
            "DSHS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Francisco Barrenechea",
                "total_seats": "30",
                "open_seats": "19",
                "waitlist": "0",
                "times": "MW 3:30pm-4:45pm"
            },
            {
                "section_id": "0102",
                "professor": "Juan Diaz",
                "total_seats": "25",
                "open_seats": "21",
                "waitlist": "0",
                "times": "TuTh 2:00pm-3:15pm"
            },
            {
                "section_id": "0101",
                "professor": "Francisco Barrenechea",
                "total_seats": "5",
                "open_seats": "5",
                "waitlist": "0",
                "times": "MW 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "Issues in Latin American and Caribbean Studies I",
        "course_number": "LACS234H",
        "credits": "3",
        "grading_method": "Reg,",
        "description": "Interdisciplinary study of major issues in Latin America and the Caribbean, including Latin America's cultural mosaic, migration and urbanization. Democratization and the role of religions. Taught in English.",
        "geneds": [
            "DVUP",
            "DSHU",
            "DSHS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Francisco Barrenechea",
                "total_seats": "5",
                "open_seats": "5",
                "waitlist": "0",
                "times": "MW 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "LGBTQ+ Literatures and Media",
        "course_number": "LGBT265",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "restriction": "Must not have completed LGBT265",
        "description": "A study of literary and cultural expressions of queer and trans identities, positionalities, and analytics through an exploration of literature, art, and media. We will examine historical and political power relations by considering the intersections of sexuality and gender with race, class, nation, and disability. Topics include the social construction and regulation of sexuality and gender, performance and performativity, intersectionality, and the relationship between aesthetic forms and queer/ trans subjectivity. Our interpretations will be informed by queer and trans theories.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Leela Chantrelle",
                "total_seats": "30",
                "open_seats": "19",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:45pm"
            },
            {
                "section_id": "0201",
                "professor": "James Goodwin",
                "total_seats": "30",
                "open_seats": "23",
                "waitlist": "0",
                "times": "TuTh 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Language and Mind",
        "course_number": "LING240",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "LING200",
        "description": "The study of language as a cognitive phenomenon. Ways of representing people's knowledge of their native language, ways in which that knowledge is attained naturally by children, and how it is used in speaking and listening. Additional topics may include: animal communication, language and the brain, language and thought.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Margaret Antonisse",
                "total_seats": "45",
                "open_seats": "25",
                "waitlist": "0",
                "times": "MWF 11:00am-11:50am"
            }
        ]
    },
    {
        "course_name": "The Impact of Music on Life",
        "course_number": "MUSC210",
        "credits": "3",
        "grading_method": "Reg,",
        "description": "Music as a part of culture. Materials drawn from traditions throughout the globe to illustrate issues of historical and contemporary significance, including the impact of race, class and gender on the study of music.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Nicole Powlison",
                "total_seats": "4",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 10:00am-10:50am"
            },
            {
                "section_id": "0102",
                "professor": "Nicole Powlison",
                "total_seats": "4",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 11:00am-11:50am"
            },
            {
                "section_id": "0103",
                "professor": "Nicole Powlison",
                "total_seats": "4",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 12:00pm-12:50pm"
            },
            {
                "section_id": "0104",
                "professor": "Nicole Powlison",
                "total_seats": "4",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 1:00pm-1:50pm"
            },
            {
                "section_id": "0105",
                "professor": "Nicole Powlison",
                "total_seats": "4",
                "open_seats": "0",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 2:00pm-2:50pm"
            },
            {
                "section_id": "0106",
                "professor": "Nicole Powlison",
                "total_seats": "4",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 3:00pm-3:50pm"
            },
            {
                "section_id": "0107",
                "professor": "Nicole Powlison",
                "total_seats": "4",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 12:00pm-12:50pm"
            },
            {
                "section_id": "0108",
                "professor": "Nicole Powlison",
                "total_seats": "4",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 1:00pm-1:50pm"
            },
            {
                "section_id": "0109",
                "professor": "Nicole Powlison",
                "total_seats": "4",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 2:00pm-2:50pm"
            },
            {
                "section_id": "0110",
                "professor": "Nicole Powlison",
                "total_seats": "4",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 12:00pm-12:50pm"
            },
            {
                "section_id": "0111",
                "professor": "Nicole Powlison",
                "total_seats": "4",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 1:00pm-1:50pm"
            },
            {
                "section_id": "0112",
                "professor": "Nicole Powlison",
                "total_seats": "4",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 1:00pm-1:50pm | F 2:00pm-2:50pm"
            }
        ]
    },
    {
        "course_name": "World Popular Musics and Identity",
        "course_number": "MUSC215",
        "credits": "3",
        "grading_method": "Reg, Aud,",
        "description": "Focus on popular musics in different cultures with an emphasis on cross-cultural comparisons and analysis of how musics and identity intersect.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Laura Schnitker",
                "total_seats": "5",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 12:00pm-12:50pm"
            },
            {
                "section_id": "0102",
                "professor": "Laura Schnitker",
                "total_seats": "5",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 1:00pm-1:50pm"
            },
            {
                "section_id": "0103",
                "professor": "Laura Schnitker",
                "total_seats": "5",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 2:00pm-2:50pm"
            },
            {
                "section_id": "0104",
                "professor": "Laura Schnitker",
                "total_seats": "5",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 1:00pm-1:50pm"
            },
            {
                "section_id": "0105",
                "professor": "Laura Schnitker",
                "total_seats": "5",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 2:00pm-2:50pm"
            },
            {
                "section_id": "0106",
                "professor": "Laura Schnitker",
                "total_seats": "5",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 3:00pm-3:50pm"
            },
            {
                "section_id": "0107",
                "professor": "Laura Schnitker",
                "total_seats": "5",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 11:00am-11:50am"
            },
            {
                "section_id": "0108",
                "professor": "Laura Schnitker",
                "total_seats": "5",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 12:00pm-12:50pm"
            },
            {
                "section_id": "0109",
                "professor": "Laura Schnitker",
                "total_seats": "5",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 1:00pm-1:50pm"
            }
        ]
    },
    {
        "course_name": "Music as Global Culture",
        "course_number": "MUSC260",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "MUSC151",
        "restriction": "Must be in a major within the ARHU-School of Music department",
        "description": "Explores how and why people create, transform, and move music around the globe. Taking a comparative approach to Western art musics and other musics of the world, course will examine a variety of musical practices in their social, political, and economic contexts. Experiential knowledge will be developed through hands-on ethnographic research.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Instructor: TBA",
                "total_seats": "16",
                "open_seats": "6",
                "waitlist": "0",
                "times": "MW 2:00pm-2:50pm | F 12:00pm-12:50pm"
            },
            {
                "section_id": "0102",
                "professor": "Instructor: TBA",
                "total_seats": "16",
                "open_seats": "13",
                "waitlist": "0",
                "times": "MW 2:00pm-2:50pm | F 1:00pm-1:50pm"
            },
            {
                "section_id": "0103",
                "professor": "Instructor: TBA",
                "total_seats": "16",
                "open_seats": "13",
                "waitlist": "0",
                "times": "MW 2:00pm-2:50pm | F 2:00pm-2:50pm"
            },
            {
                "section_id": "0104",
                "professor": "Instructor: TBA",
                "total_seats": "16",
                "open_seats": "16",
                "waitlist": "0",
                "times": "MW 2:00pm-2:50pm | F 3:00pm-3:50pm"
            }
        ]
    },
    {
        "course_name": "Leadership and Management",
        "course_number": "NAVY200",
        "credits": "3",
        "grading_method": "Reg,",
        "restriction": "Permission of UGST-Navy ROTC",
        "description": "Introductory course designed to familiarize students with the theories, processes, and behaviors that enable effective leadership and managerial competence. Students will engage in analytical discussions, review leadership development and education, and Navy/Marine Corps-based case study discussions in order to develop their understanding of personal strengths, values and growth opportunities in the context of team, group and organizational leadership.",
        "geneds": [
            "DSHU",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Christopher Boehm",
                "total_seats": "40",
                "open_seats": "40",
                "waitlist": "0",
                "times": "TuTh 8:00am-9:15am"
            }
        ]
    },
    {
        "course_name": "Art Activism in Iran",
        "course_number": "PERS280",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Explores Iranian artists' intent and hope for change and their critical and playful strategies of making a difference through their visual or performing arts created since 1980. While exploring key concepts, contexts, and debates by examining a variety of artworks, we explore diverse and unique transgressive stories, strategies, and styles that these works present to address themes of social justice through the art. We examine how multimedia art forms (dance, theatre, cinema, painting, digital art, and music) empower Iranian artists to practice their identity and exercise their agency as these aspects intersect with race, ethnicity, class, sexuality, ability, and education in a shifting and multilayered context.",
        "geneds": [
            "DSHU"
        ]
    },
    {
        "course_name": "Iranian Cinema",
        "course_number": "PERS283",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Introduction to Iranian cinema, society, and culture. Taught in English.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Marjan Moosavi",
                "total_seats": "30",
                "open_seats": "29",
                "waitlist": "0",
                "times": "MW 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "Know Thyself: Wisdom Through Cognitive Science",
        "course_number": "PHIL202",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "How do we improve our decision making? Cognitive science demonstrates that self-knowledge isn't as easy as we think, and that there are numerous biases and fallacies that impact our decision-making in ways that are hard for us to be aware of. In this course you will learn what some of these are and how they have been discovered, and you will explore potential strategies for avoiding these fallacies and for making wiser choices.",
        "geneds": [
            "DSHU",
            "DSHS",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Peter Carruthers",
                "total_seats": "20",
                "open_seats": "12",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 10:00am-10:50am"
            },
            {
                "section_id": "0102",
                "professor": "Peter Carruthers",
                "total_seats": "20",
                "open_seats": "14",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 11:00am-11:50am"
            },
            {
                "section_id": "0103",
                "professor": "Peter Carruthers",
                "total_seats": "20",
                "open_seats": "14",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 1:00pm-1:50pm"
            },
            {
                "section_id": "0104",
                "professor": "Peter Carruthers",
                "total_seats": "20",
                "open_seats": "18",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 10:00am-10:50am"
            },
            {
                "section_id": "0105",
                "professor": "Peter Carruthers",
                "total_seats": "20",
                "open_seats": "16",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 11:00am-11:50am"
            },
            {
                "section_id": "0106",
                "professor": "Peter Carruthers",
                "total_seats": "20",
                "open_seats": "17",
                "waitlist": "0",
                "times": "MW 12:00pm-12:50pm | F 1:00pm-1:50pm"
            }
        ]
    },
    {
        "course_name": "The Rights and Wrongs of Killing People",
        "course_number": "PHIL203",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Virtually everyone thinks it's permissible to kill people only in special circumstances. But why is killing usually wrong? Is it ever acceptable to kill an innocent human being intentionally? This course raises these and related questions and examines cases such as terrorism, suicide, abortion, euthanasia, the death penalty, war. Except for a brief discussion of animals, all the controversies considered deal with killing and causing death to human beings.",
        "geneds": [
            "DSHU",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Daniel Blair",
                "total_seats": "20",
                "open_seats": "17",
                "waitlist": "0",
                "times": "MW 2:00pm-2:50pm | F 10:00am-10:50am"
            },
            {
                "section_id": "0102",
                "professor": "Daniel Blair",
                "total_seats": "20",
                "open_seats": "14",
                "waitlist": "0",
                "times": "MW 2:00pm-2:50pm | F 11:00am-11:50am"
            },
            {
                "section_id": "0103",
                "professor": "Daniel Blair",
                "total_seats": "20",
                "open_seats": "15",
                "waitlist": "0",
                "times": "MW 2:00pm-2:50pm | F 1:00pm-1:50pm"
            },
            {
                "section_id": "0104",
                "professor": "Daniel Blair",
                "total_seats": "20",
                "open_seats": "20",
                "waitlist": "0",
                "times": "MW 2:00pm-2:50pm | F 10:00am-10:50am"
            },
            {
                "section_id": "0105",
                "professor": "Daniel Blair",
                "total_seats": "20",
                "open_seats": "19",
                "waitlist": "0",
                "times": "MW 2:00pm-2:50pm | F 11:00am-11:50am"
            },
            {
                "section_id": "0106",
                "professor": "Daniel Blair",
                "total_seats": "20",
                "open_seats": "19",
                "waitlist": "0",
                "times": "MW 2:00pm-2:50pm | F 1:00pm-1:50pm"
            }
        ]
    },
    {
        "course_name": "Ancient Greek and Roman Philosophy",
        "course_number": "PHIL310",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "",
        "description": "A study of the origins and development of philosophy in ancient Greece and Rome, focusing on Socrates, Plato, Aristotle, the Epicureans, and Stoics.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Rachel Singpurwalla",
                "total_seats": "20",
                "open_seats": "2",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:20pm | F 10:00am-10:50am"
            },
            {
                "section_id": "0102",
                "professor": "Rachel Singpurwalla",
                "total_seats": "20",
                "open_seats": "0",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:20pm | F 11:00am-11:50am"
            },
            {
                "section_id": "0103",
                "professor": "Rachel Singpurwalla",
                "total_seats": "20",
                "open_seats": "2",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:20pm | F 1:00pm-1:50pm"
            }
        ]
    },
    {
        "course_name": "Issues in Latin American and Caribbean Studies I",
        "course_number": "PORT234",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Interdisciplinary study of major issues in Latin America and the Caribbean, including Latin America's cultural mosaic, migration and urbanization. Democratization and the role of religions. Taught in English.",
        "geneds": [
            "DVUP",
            "DSHU",
            "DSHS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Francisco Barrenechea",
                "total_seats": "30",
                "open_seats": "19",
                "waitlist": "0",
                "times": "MW 3:30pm-4:45pm"
            },
            {
                "section_id": "0102",
                "professor": "Juan Diaz",
                "total_seats": "25",
                "open_seats": "21",
                "waitlist": "0",
                "times": "TuTh 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Islamic Civilization",
        "course_number": "RELS120",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Introduction to society and culture in the Middle East since the advent of Islam: as a personal and communal faith; as artistic and literary highlights of intellectual and cultural life; and as the interplay between politics and religion under the major Islamic regimes.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Rachel Schine",
                "total_seats": "23",
                "open_seats": "23",
                "waitlist": "0",
                "times": "MW 10:00am-10:50am | F 9:00am-9:50am"
            },
            {
                "section_id": "0102",
                "professor": "Rachel Schine",
                "total_seats": "23",
                "open_seats": "20",
                "waitlist": "0",
                "times": "MW 10:00am-10:50am | F 10:00am-10:50am"
            },
            {
                "section_id": "0103",
                "professor": "Rachel Schine",
                "total_seats": "23",
                "open_seats": "18",
                "waitlist": "0",
                "times": "MW 10:00am-10:50am | F 12:00pm-12:50pm"
            }
        ]
    },
    {
        "course_name": "Ancient Myths and Modern Lives",
        "course_number": "RELS170",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "What are myths and why do we tell them? What powers do myths have? We will tackle these questions by looking at the enduring and fascinating myths from ancient Greece and Rome. In addition to studying how they shaped ancient societies, we will also look at their modern influence and reflect upon the power that myths still hold in our contemporary world. Taught in English.",
        "geneds": [
            "DSHU",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "0",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 10:00am-10:50am"
            },
            {
                "section_id": "0102",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | Th 9:30am-10:20am"
            },
            {
                "section_id": "0103",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | Th 11:00am-11:50am"
            },
            {
                "section_id": "0104",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | Th 12:30pm-1:20pm"
            },
            {
                "section_id": "0105",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | Th 12:30pm-1:20pm"
            },
            {
                "section_id": "0106",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 11:00am-11:50am"
            },
            {
                "section_id": "0107",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 1:00pm-1:50pm"
            },
            {
                "section_id": "0108",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | Th 11:00am-11:50am"
            },
            {
                "section_id": "0109",
                "professor": "Jorge Bravo",
                "total_seats": "6",
                "open_seats": "5",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | Th 9:30am-10:20am"
            }
        ]
    },
    {
        "course_name": "Is Judaism a Religion?",
        "course_number": "RELS171",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Jewish identity can be framed in terms of ethnicity, culture, and religious practice, but also in terms of more contemporary social constructions including social action, political engagement, and intellectual pursuit. In the context of such diverse social and individual frames, what does it mean to identify Judaism as a religion? Attention to Jewish society in historical and global perspective will provide a backdrop for a particular focus on contemporary Jews in the United States and Israel.",
        "geneds": [
            "DSHU",
            "DVUP",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Maxine Grossman",
                "total_seats": "12",
                "open_seats": "5",
                "waitlist": "0",
                "times": "MW 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Religions of the Ancient Near East",
        "course_number": "RELS225",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Introduction to ancient Near Eastern religious systems and mythology, from the third millennium BCE through the fourth century BCE. Particular emphasis on Mesopotamia and ancient Israel.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Matthew Suriano",
                "total_seats": "25",
                "open_seats": "13",
                "waitlist": "0",
                "times": "MW 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "Jerusalem in Antiquity: The History of Sacred Space in a Holy City",
        "course_number": "RELS274",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Examines the complex history of Jerusalem's status as a holy city, with a focus on constructions of sacred space in Judaism, Christianity, and Islam.",
        "geneds": [
            "DSHU",
            "DVUP",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Matthew Suriano",
                "total_seats": "6",
                "open_seats": "3",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | W 1:00pm-1:50pm"
            },
            {
                "section_id": "0102",
                "professor": "Matthew Suriano",
                "total_seats": "6",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 11:00am-11:50am"
            },
            {
                "section_id": "0103",
                "professor": "Matthew Suriano",
                "total_seats": "6",
                "open_seats": "1",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | F 12:00pm-12:50pm"
            },
            {
                "section_id": "0104",
                "professor": "Matthew Suriano",
                "total_seats": "6",
                "open_seats": "2",
                "waitlist": "0",
                "times": "MW 11:00am-11:50am | W 2:00pm-2:50pm"
            }
        ]
    },
    {
        "course_name": "Mythology of the Oppressed",
        "course_number": "SLLC280",
        "credits": "3",
        "grading_method": "Reg,",
        "description": "Does information drive human history? Mythological recurrences say much about cultures that had to adapt their world views while attempting to preserve them. This course examines the cognitive or social bases of mythology, to be pursued from insights in cultural and literary studies, linguistics, the cognitive sciences, paleo-anthropology, archeology, etc. The course is designed to help students think about complex problems from a humanistic perspective, making liberal use of the sciences.",
        "geneds": [
            "DSHU",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Juan Uriagereka",
                "total_seats": "35",
                "open_seats": "35",
                "waitlist": "0",
                "times": "TuTh 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "Living the Good Life: Chinese Philosophy in the Modern World",
        "course_number": "SLLC286",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Confucius, Mencius, Zhuangzi and other Chinese thinkers who lived more than 2,000 years ago would argue that the contemporary Western emphasis on self-discovery (Find yourself) and self-acceptance has led you astray. See what they have to say and discuss what relevance it has for the modern world as we study how early Chinese thinkers wrestled with questions of existence, morality, and governance. No previous knowledge of Chinese philosophy and history will be assumed and no prerequisites are required. We will discuss ideas that are both historical and relevant to students' lives. What is \"the Way\"? How do we cultivate spontaneity? Is there a stable self? How can we be more alive? These are questions important for ancient kings but also for UMD students choosing a major, or wondering how ARHU can benefit them.",
        "geneds": [
            "DSHU",
            "SCIS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Andrew Schonebaum",
                "total_seats": "60",
                "open_seats": "17",
                "waitlist": "0",
                "times": "TuTh 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Reading and Writing in Spanish",
        "course_number": "SPAN207",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "SPAN204",
        "description": "Selected readings with emphasis on reading comprehension and the development of reading strategies. Work in composition writing and a review of selected grammatical topics. Complements material of SPAN204.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Instructor: TBA",
                "total_seats": "18",
                "open_seats": "18",
                "waitlist": "0",
                "times": "MWF 10:00am-10:50am"
            },
            {
                "section_id": "0201",
                "professor": "Instructor: TBA",
                "total_seats": "18",
                "open_seats": "15",
                "waitlist": "0",
                "times": "MWF 11:00am-11:50am"
            },
            {
                "section_id": "0301",
                "professor": "Instructor: TBA",
                "total_seats": "18",
                "open_seats": "15",
                "waitlist": "0",
                "times": "MWF 12:00pm-12:50pm"
            },
            {
                "section_id": "0401",
                "professor": "Instructor: TBA",
                "total_seats": "18",
                "open_seats": "16",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am"
            },
            {
                "section_id": "0501",
                "professor": "Instructor: TBA",
                "total_seats": "18",
                "open_seats": "15",
                "waitlist": "0",
                "times": "TuTh 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "Issues in Latin American and Caribbean Studies I",
        "course_number": "SPAN234",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Interdisciplinary study of major issues in Latin America and the Caribbean, including Latin America's cultural mosaic, migration and urbanization. Democratization and the role of religions. Taught in English.",
        "geneds": [
            "DVUP",
            "DSHU",
            "DSHS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Francisco Barrenechea",
                "total_seats": "30",
                "open_seats": "19",
                "waitlist": "0",
                "times": "MW 3:30pm-4:45pm"
            },
            {
                "section_id": "0101",
                "professor": "Francisco Barrenechea",
                "total_seats": "5",
                "open_seats": "5",
                "waitlist": "0",
                "times": "MW 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "Issues in Latin American and Caribbean Studies I",
        "course_number": "SPAN234H",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Interdisciplinary study of major issues in Latin America and the Caribbean, including Latin America's cultural mosaic, migration and urbanization. Democratization and the role of religions. Taught in English.",
        "geneds": [
            "DVUP",
            "DSHU",
            "DSHS"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Francisco Barrenechea",
                "total_seats": "5",
                "open_seats": "5",
                "waitlist": "0",
                "times": "MW 3:30pm-4:45pm"
            }
        ]
    },
    {
        "course_name": "Approaches to Cultural Materials in the Hispanic World",
        "course_number": "SPAN303",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "SPAN301",
        "description": "Development of proficiency in critical thought through the reading, viewing, and analytical discussion of major genres and styles of cultural materials selected from Spanish-speaking world. Taught in Spanish.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Instructor: TBA",
                "total_seats": "20",
                "open_seats": "15",
                "waitlist": "0",
                "times": "MWF 10:00am-10:50am"
            },
            {
                "section_id": "0201",
                "professor": "Instructor: TBA",
                "total_seats": "20",
                "open_seats": "18",
                "waitlist": "0",
                "times": "MWF 1:00pm-1:50pm"
            },
            {
                "section_id": "0301",
                "professor": "Ryan Long",
                "total_seats": "20",
                "open_seats": "10",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am"
            },
            {
                "section_id": "0401",
                "professor": "Instructor: TBA",
                "total_seats": "20",
                "open_seats": "15",
                "waitlist": "0",
                "times": "TuTh 11:00am-12:15pm"
            },
            {
                "section_id": "0501",
                "professor": "Instructor: TBA",
                "total_seats": "20",
                "open_seats": "16",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:45pm"
            },
            {
                "section_id": "0601",
                "professor": "Instructor: TBA",
                "total_seats": "20",
                "open_seats": "16",
                "waitlist": "0",
                "times": "TuTh 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Spanish Culture, Civilization and Literature I: Medieval Times",
        "course_number": "SPAN331",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "SPAN303",
        "description": "The exploration of cultures of the Iberian Peninsula from its origins until the 15th century as well as the study of historical and political events that gave rise to the Spanish state. Taught in Spanish.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Instructor: TBA",
                "total_seats": "25",
                "open_seats": "21",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:45pm"
            }
        ]
    },
    {
        "course_name": "Spanish Culture, Civilization and Literature III: Modern Times",
        "course_number": "SPAN333",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "SPAN303",
        "description": "An overview of cultural and literary production of Spain from the late 17th century through the present day, exploring the production of literary texts in their socio-historical, political, religious and cultural contexts and development. Taught in Spanish.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Mehl Penrose",
                "total_seats": "25",
                "open_seats": "13",
                "waitlist": "0",
                "times": "MW 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "Latin American Literatures and Cultures I: From Pre-Columbian to Colonial Times",
        "course_number": "SPAN361",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "SPAN303",
        "description": "Overview of cultural history of Latin America from pre-Columbian civilizations to the Colonial period, exploring the foundations of the Spanish American cultural and literary tradition to approximately 1770. Taught in Spanish.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Instructor: TBA",
                "total_seats": "25",
                "open_seats": "22",
                "waitlist": "0",
                "times": "MWF 10:00am-10:50am"
            },
            {
                "section_id": "0201",
                "professor": "Ryan Long",
                "total_seats": "25",
                "open_seats": "0",
                "waitlist": "3",
                "times": "TuTh 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "Latin American Literatures and Cultures III: From Modernism  to Neo-Liberalism",
        "course_number": "SPAN363",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "prereq": "SPAN303",
        "description": "An overview of cultural and literary production of Latin America from the late 19th through the early 21st centuries, exploring the production of literary texts in their socio-historical, political, and cultural contexts and development. Taught in Spanish.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Juan Carlos Quintero-Herencia",
                "total_seats": "25",
                "open_seats": "9",
                "waitlist": "0",
                "times": "MW 1:00pm-2:15pm"
            },
            {
                "section_id": "0201",
                "professor": "Laura Demaria",
                "total_seats": "25",
                "open_seats": "22",
                "waitlist": "0",
                "times": "TuTh 2:00pm-3:15pm"
            }
        ]
    },
    {
        "course_name": "Historical and Philosophical Perspectives on Education",
        "course_number": "TLPL250",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "An examination of illustrative historical and philosophical examples of the interplay of ideas and events in the shaping of educational aims and practices from ancient cultures to modern technological societies.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Campbell Scribner",
                "total_seats": "30",
                "open_seats": "21",
                "waitlist": "0",
                "times": "TuTh 12:30pm-1:45pm"
            },
            {
                "section_id": "0201",
                "professor": "Stephanie Chou",
                "total_seats": "30",
                "open_seats": "27",
                "waitlist": "0",
                "times": "MW 10:00am-11:15am"
            },
            {
                "section_id": "0301",
                "professor": "Lisa Eaker",
                "total_seats": "30",
                "open_seats": "15",
                "waitlist": "0",
                "times": "Tu 11:00am-12:15pm | Th 11:00am-12:15pm"
            },
            {
                "section_id": "0401",
                "professor": "Instructor: TBA",
                "total_seats": "30",
                "open_seats": "26",
                "waitlist": "0",
                "times": "MW 1:00pm-2:15pm"
            }
        ]
    },
    {
        "course_name": "Literature for Adolescents",
        "course_number": "TLPL457",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "restriction": "Minimum cumulative GPA of 2",
        "description": "Reading and analysis of fiction and nonfiction; methods for critically assessing quality and appeal; current theory and methods of instruction; research on response to literature; curriculum design and selection of books.",
        "geneds": [
            "DSHU"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Instructor: TBA",
                "total_seats": "30",
                "open_seats": "24",
                "waitlist": "0",
                "times": "MW 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "Introduction to WGSS: Art and Culture",
        "course_number": "WGSS250",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Provides students with a critical introduction to the ways that art and art activism have served as a conduit to understanding and challenging systems of inequity and practices of normativity. Interrogating the categories of gender, sexuality, race, class, ability, the course will provide students with an examination of how artists have responded to pressing social justice issues of their eras. While the course centers visual art, students will also engage genres such as music, plays, literature, digital and performance art as arenas of social change.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0301",
                "professor": "Michelle Rowley",
                "total_seats": "30",
                "open_seats": "29",
                "waitlist": "0",
                "times": "MW 3:00pm-4:15pm"
            },
            {
                "section_id": "0401",
                "professor": "Jaime Madden",
                "total_seats": "30",
                "open_seats": "23",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am"
            },
            {
                "section_id": "0501",
                "professor": "Jaime Madden",
                "total_seats": "30",
                "open_seats": "5",
                "waitlist": "0",
                "times": "TuTh 11:00am-12:15pm"
            }
        ]
    },
    {
        "course_name": "Reading Women Writing",
        "course_number": "WGSS255",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Explores literary and cultural expressions by women and their receptions within a range of historical periods and genres. Topics such as what does a woman need in order to write, what role does gender play in the production, consumption, and interpretation of texts, and to what extent do women comprise a distinct literary subculture. Interpretation of texts will be guided by feminist and gender theory, ways of reading that have emerged as important to literary studies over the last four decades.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0101",
                "professor": "Tyra Griffin",
                "total_seats": "9",
                "open_seats": "5",
                "waitlist": "0",
                "times": "TuTh 9:30am-10:45am"
            }
        ]
    },
    {
        "course_name": "World Literature by Women",
        "course_number": "WGSS275",
        "credits": "3",
        "grading_method": "Reg, P-F, Aud,",
        "description": "Comparative study of selected works by women writers of several countries, exploring points of intersection and divergence in women's literary representations.",
        "geneds": [
            "DSHU",
            "DVUP"
        ],
        "sections": [
            {
                "section_id": "0201",
                "professor": "Daniel Sidman",
                "total_seats": "9",
                "open_seats": "4",
                "waitlist": "0",
                "times": "MW 2:00pm-3:15pm"
            }
        ]
    }
]