[{"course_name": "Growing Up Asian American: The Asian Immigrant Family and the Second Generation", "course_number": "AAST394", "credits": "3", "grading_method": "Reg,", "description": "An interdisciplinary course examines the experiences of children of Asian immigrants in the U.S., focusing on intergenerational dynamics in the Asian immigrant family, their intersections with race, gender, class, sexuality, and religion, and how these shape second-generation Asian American life. Topics include identity and personhood, the model minority myth and education, work and leisure, language and communication, filiality and disownment, mental health and suicide.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Joan Hong", "total_seats": "30", "open_seats": "0", "waitlist": "11", "times": "TuTh 12:30pm-1:45pm"}]}, {"course_name": "Growing Up Asian American: The Asian Immigrant Family and the Second Generation", "course_number": "AMST324", "credits": "3", "grading_method": "Reg,", "description": "An interdisciplinary course examines the experiences of children of Asian immigrants in the U.S., focusing on intergenerational dynamics in the Asian immigrant family, their intersections with race, gender, class, sexuality, and religion, and how these shape second-generation Asian American life. Topics include identity and personhood, the model minority myth and education, work and leisure, language and communication, filiality and disownment, mental health and suicide.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Joan Hong", "total_seats": "30", "open_seats": "0", "waitlist": "11", "times": "TuTh 12:30pm-1:45pm"}]}, {"course_name": "Innovations in Countering Violent Extremism", "course_number": "BSST335", "credits": "3", "grading_method": "Reg, P-F, Aud,", "description": "Introduces students to novel innovations in the development of Countering Violent Extremism (CVE) programs. CVE is a realm of policy, programs, and interventions designed to prevent individuals from engaging in violence associated with radical political, social, cultural, and/or religious ideologies. Unlike counterterrorism strategies that often focus on targeting and disrupting terrorist plots, CVE focuses on radicalization prevention through engagement and intervention with communities. CVE also focuses on deradicalization and rehabilitation of former extremists. Throughout the course, students will work in groups to develop their own innovative CVE programs, rather than merely learn about CVE through lectures.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Amy Pate", "total_seats": "40", "open_seats": "21", "waitlist": "0", "times": "TuTh 3:30pm-4:45pm"}]}, {"course_name": "Intermediate Written Chinese I", "course_number": "CHIN202", "credits": "3", "grading_method": "Reg,", "prereq": "CHIN103", "coreq": "CHIN201", "description": "Reading and writing skills with emphasis on grammar and Chinese characters.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Jungjung Lee-Heitz", "total_seats": "15", "open_seats": "14", "waitlist": "0", "times": "TuTh 12:30pm-1:45pm"}]}, {"course_name": "Essentials of Intercultural Communication", "course_number": "COMM382", "credits": "3", "grading_method": "Reg, P-F, Aud,", "description": "Introduction of major theories and concepts of intercultural communication; examination of processes that make up cultural differences; and use of intercultural communication competence skills.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Instructor: TBA", "total_seats": "20", "open_seats": "19", "waitlist": "0", "times": "TuTh 12:30pm-1:45pm"}, {"section_id": "0201", "professor": "Instructor: TBA", "total_seats": "20", "open_seats": "0", "waitlist": "1", "times": "TuTh 3:30pm-4:45pm"}, {"section_id": "ESG1", "professor": "Maggie Williams", "total_seats": "30", "open_seats": "28", "waitlist": "0", "times": "MW 9:30am-10:45am"}]}, {"course_name": "College Park Scholars: Public Leadership First-Year Colloquium I", "course_number": "CPPL100", "credits": "1", "grading_method": "Reg,", "restriction": "Students must be enrolled in the College Park Scholars Public Leadership (CPPL) program", "description": "Introductory colloquium: Examination of issues related to public leadership.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Kelly Brower", "total_seats": "45", "open_seats": "45", "waitlist": "0", "times": "W 3:00pm-4:15pm"}, {"section_id": "0201", "professor": "Kelly Brower", "total_seats": "45", "open_seats": "45", "waitlist": "0", "times": "W 4:30pm-5:45pm"}]}, {"course_name": "The Future of Communicating Science", "course_number": "CPSS220", "credits": "3", "grading_method": "Reg, P-F,", "restriction": "Must be in the College Park Scholars Science, Technology or Society program or have permission of the program", "description": "How can scientists communicate their work effectively? The field of science communication ventures that the answer is not simply a matter of improving capacity (e.g., because people lack scientific information, scientists lack communication skills, or both). Rather, it calls for sustained collaboration and empathy between laypersons and experts. In this hands-on, experiential course, we use a model of cultural competency to put forth solutions to bridge the expert-lay divide. We investigate typical venues in which science is communicated (museums, YouTube videos, federal agency websites, and much much more) and study best practices for communication. Then we explore emerging venues that support sustained contact between so-called \"lay citizens\" and scientific or technical experts (dance/improv techniques, ethnographic methods and citizen science). Students learn to use cross-cultural perspectives as a basis to pilot and test ways of strengthening relationships and improving communication.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Instructor: TBA", "total_seats": "20", "open_seats": "18", "waitlist": "0", "times": "TuTh 11:00am-12:15pm"}]}, {"course_name": "Virtus Living and Learning Community Seminar III", "course_number": "ENES213", "credits": "1", "grading_method": "Reg,", "prereq": "ENES113", "restriction": "Must be a participant in the second year of the Virtus program", "description": "The seminar focuses on personal, academic and professional success by cultivating leadership skills, developing academic and technical ability and encouraging self awareness, identifying and employing strategies for academic and professional success, further enhancing career development through networking and mentoring and developing awareness of diversity issues.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Tyler Huddleston", "total_seats": "30", "open_seats": "29", "waitlist": "0", "times": "Th 4:00pm-5:30pm"}]}, {"course_name": "FLEXUS Living and Learning Community Seminar III", "course_number": "ENES215", "credits": "1", "grading_method": "Reg,", "prereq": "ENES115, ENES116", "restriction": "Must be a second year FLEXUS participant", "description": "The seminar focuses on personal, academic and professional success by cultivating leadership skills, developing self-confidence and self-efficacy in academic and technical ability and encouraging self awareness, identifying and employing strategies for academic and professional success, further enhancing career development through networking, mentoring and role modeling, and developing awareness of diversity issues, specifically gender diversity.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Samantha Sabihi", "total_seats": "30", "open_seats": "29", "waitlist": "0", "times": "Th 4:00pm-5:30pm"}]}, {"course_name": "Leading Global Teams and Engaging Across Cultures in Business, Engineering, and Technology", "course_number": "ENES472", "credits": "3", "grading_method": "Reg, P-F, Aud,", "restriction": "Sophomore standing or higher; must be a minor in Global Engineering Leadership (#EN09), Global Poverty (#AG06), Global Terrorism Studies (#BS07), or International Development and Conflict Management (#BS02)", "description": "Develop global leadership capacities and an understanding of the cultural aspects pertaining to industry and international business. In a globalized world, the ability to work, lead and communicate in culturally diverse settings has become a core component to leadership. Through real-world examples, research, and simulations, students will increase their self-awareness and understanding of culture and how culture influences attitudes, behaviors, and practices at the individual, organizational, or societal levels. Students will develop the skills necessary to navigate, negotiate, and lead cross-cultural engagements and teams. The course content is relevant and applicable to anyone interested in developing cross-cultural leadership competencies and cultivating a global mindset.", "geneds": ["DVCC"]}, {"course_name": "Families and Global Health", "course_number": "FMSC110", "credits": "3", "grading_method": "Reg,", "description": "Students will explore, define, and study global health, social determinants of health, health inequalities, gender inequality, family violence, and maternal and child health using a global perspective.", "geneds": ["DVCC", "DSHS"], "sections": [{"section_id": "0101", "professor": "Sun Cho", "total_seats": "20", "open_seats": "7", "waitlist": "0", "times": "TuTh 9:30am-10:45am"}, {"section_id": "0201", "professor": "Sun Cho", "total_seats": "20", "open_seats": "0", "waitlist": "4", "times": "TuTh 9:30am-10:45am"}, {"section_id": "0101", "professor": "Elisabeth Maring", "total_seats": "96", "open_seats": "96", "waitlist": "0", "times": "TuTh 12:30pm-1:45pm"}]}, {"course_name": "Capstone in International Development", "course_number": "GVPT356", "credits": "3", "grading_method": "Reg, P-F, Aud,", "prereq": "GVPT354", "restriction": "Enrollment is restricted to students in the Minor in International Development and Conflict Management; and sophomore standing or higher; and permission of BSOS-Government & Politics department", "description": "Serves as one of the two capstone courses for the Minor in International Development and Conflict Management. Focuses on advanced theory and the practice and profession of international development and is designed to provide students an introduction to, and a chance to engage with, a core set of practical skills relevant to the field.", "geneds": ["DSSP", "DVCC"], "sections": [{"section_id": "0101", "professor": "Stacy Kosko", "total_seats": "31", "open_seats": "12", "waitlist": "0", "times": "M 2:00pm-4:45pm"}]}, {"course_name": "Leadership and Ethnicity", "course_number": "HESI423", "credits": "3", "grading_method": "Reg, P-F, Aud,", "description": "Examines the concept of leadership from the standpoint of race, ethnicity, and culture. Specifically, we will explore the concept and differing meanings of leader and leadership within racial/ethnic communities in the United States. Issues of leaders and leadership will be examined as influenced by political, cultural, and historic events. The course will place particular emphasis on colleges and universities as a microcosm of the larger society and as a cultural site for exploring and assessing issues of race, ethnicity, diversity and leadership.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Brandon Dula", "total_seats": "25", "open_seats": "19", "waitlist": "0", "times": "TuTh 2:00pm-3:15pm"}]}, {"course_name": "Leadership and the Jewish Community", "course_number": "HESI424", "credits": "3", "grading_method": "Reg, P-F, Aud,", "description": "Offers students the opportunity to critically examine leadership and leadership identity development in relation to Jewish culture and identity. Explores how Jewish culture and ethnicity influence leadership styles and the role that leadership has played within Jewish history. Students will explore general leadership theories as well as personal leadership identity development in both an overall sense and as a member of the Jewish community. Examines leaders within the Jewish movement and how their leadership has influenced Jewish communities and explores issues facing the Jewish community both on college campuses and in the world and prepare student leaders to act as advocates for the Jewish community.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Ari Israel", "total_seats": "35", "open_seats": "23", "waitlist": "0", "times": "M 2:00pm-4:45pm"}]}, {"course_name": "Global Health Messages: Understanding Exposure & Impact", "course_number": "HLTH234", "credits": "3", "grading_method": "Reg, P-F, Aud,", "restriction": "Must not be in the Community Health program", "description": "Using a global perspective, this course teaches students to be critical consumers of current and historical health communication interventions. It also provides students with the skills to develop media interventions that target specific and general populations. Students will discover the array of diverse media messages that influence the health and well-being of individuals and communities.", "geneds": ["SCIS", "DVCC", "DSHS"]}, {"course_name": "Global Health Messages: Understanding Exposure & Impact", "course_number": "HLTH234H", "credits": "3", "grading_method": "Reg, P-F, Aud,", "restriction": "Must not be in the Community Health program", "description": "Using a global perspective, this course teaches students to be critical consumers of current and historical health communication interventions. It also provides students with the skills to develop media interventions that target specific and general populations. Students will discover the array of diverse media messages that influence the health and well-being of individuals and communities.", "geneds": ["SCIS", "DVCC", "DSHS"]}, {"course_name": "Growing Up Asian American: The Asian Immigrant Family and the Second Generation", "course_number": "IMMR394", "credits": "3", "grading_method": "Reg,", "description": "An interdisciplinary course examines the experiences of children of Asian immigrants in the U.S., focusing on intergenerational dynamics in the Asian immigrant family, their intersections with race, gender, class, sexuality, and religion, and how these shape second-generation Asian American life. Topics include identity and personhood, the model minority myth and education, work and leisure, language and communication, filiality and disownment, mental health and suicide.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Joan Hong", "total_seats": "30", "open_seats": "0", "waitlist": "11", "times": "TuTh 12:30pm-1:45pm"}]}, {"course_name": "Technology, Culture, and Society", "course_number": "INST466", "credits": "3", "grading_method": "Reg, Aud,", "prereq": "SOCY105, INST301", "restriction": "Must be in the Information Science program or Technology and Information Design program", "description": "Individual, cultural, and societal outcomes associated with development of information & communication technologies (ICTs), including pro- and anti-social factors. Unpacking how gender, race, ethnicity, sexual orientation, disabilities, and political affiliations affect consumption and production of online experiences. Unpacking how structures of dominance, power and privilege manifest at individual, institutional and cultural levels.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Instructor: TBA", "total_seats": "44", "open_seats": "0", "waitlist": "10", "times": "TuTh 11:00am-12:15pm"}, {"section_id": "0102", "professor": "Instructor: TBA", "total_seats": "60", "open_seats": "4", "waitlist": "0", "times": "MW 2:00pm-3:15pm"}, {"section_id": "0103", "professor": "Instructor: TBA", "total_seats": "42", "open_seats": "4", "waitlist": "0", "times": "TuTh 9:30am-10:45am"}]}, {"course_name": "Lesbian, Gay, Bisexual, and Transgender People and Communication", "course_number": "LGBT350", "credits": "3", "grading_method": "Reg, P-F, Aud,", "prereq": "LGBT200", "restriction": "Must have permission of LGBT Studies Program", "description": "Study of differences, stereotypes, and values distinguishing LGBT people and of effective means of communicating such differences to non-LGBT people. Emphasis on contemporary LGBT life and on the development of didactic skills. Preparation and presentation of forums on LGBT people; facilitation of workshops in various outreach locations (residence halls, Greek system, classes).", "geneds": ["DSSP", "DVCC"]}, {"course_name": "Lesbian, Gay, Bisexual, and Transgender Community Organization Internship", "course_number": "LGBT386", "credits": "3", "grading_method": "Reg, P-F, Aud,", "prereq": "", "restriction": "Permission of LGBT Studies Program", "description": "Supervised internship experience with a community organization that expressly serves lesbian, gay, bisexual, and transgender people. Students will be expected to relate course material to experience in an analysis of an organization's activities.", "geneds": ["DSSP", "DVCC"]}, {"course_name": "Peer Education: Preventing Power-Based Violence", "course_number": "PEER312", "credits": "3", "grading_method": "Reg,", "prereq": "", "restriction": "Permission of instructor; and minimum cumulative GPA of 2", "description": "Designed to train students to become Peer Educators who are responsible for presenting to members of the campus community about the complex dynamics surrounding issues of power-based personal violence. This includes: sexual assault, relationship violence, stalking, bystander intervention, consent, and rape culture. Students fully learn the on and off-campus resources for victim/survivors. Programming is done in classroom settings, residence halls, Greek life spaces, and at tables during special events.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Lucy Hebner", "total_seats": "15", "open_seats": "15", "waitlist": "0", "times": "MW 4:00pm-5:15pm"}]}, {"course_name": "Examining Pluralism in Public Policy", "course_number": "PLCY302", "credits": "3", "grading_method": "Reg, P-F, Aud,", "description": "Understanding pluralism and how groups and individuals coexist in society is an essential part of the public policy process. This course will examine the ways in which the diverse experiences of race, gender, ethnicity, class, orientation, identity, and religion impact the understanding of and equitable delivery of public policy. The examination of how identity development shapes our understanding of society and influences the decision-making process is central to students' shaping policy that is truly for the people. This course will equip students with the skills needed to analyze pluralism and draw conclusions about the application of various theories to public policy issues.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Alana Hackshaw", "total_seats": "40", "open_seats": "16", "waitlist": "0", "times": "TuTh 11:00am-12:15pm"}, {"section_id": "0301", "professor": "Alana Hackshaw", "total_seats": "40", "open_seats": "26", "waitlist": "0", "times": "TuTh 2:00pm-3:15pm"}, {"section_id": "0401", "professor": "Patrina Clark", "total_seats": "40", "open_seats": "36", "waitlist": "0", "times": "Th 4:30pm-7:00pm"}]}, {"course_name": "Student-Centered Curriculum and Instruction", "course_number": "TLPL401", "credits": "3", "grading_method": "Reg,", "prereq": "TLPL102, TLPL488M", "description": "A focus on using student-centered teaching and learning approaches in high school STEM classrooms. Students will develop and implement a multi-day series of lessons, building upon the foundations of inquiry-based practices developed in prior courses. Students will also consider the implications of cultural awareness on teaching practices broadly, as well as in the specific contexts of their fieldwork.", "geneds": ["DSSP", "DVCC"], "sections": [{"section_id": "0101", "professor": "Sarah Henson-Darko", "total_seats": "24", "open_seats": "17", "waitlist": "0", "times": "TuTh 2:00pm-3:20pm"}, {"section_id": "0201", "professor": "Dana Grosser-Clarkson", "total_seats": "24", "open_seats": "20", "waitlist": "0", "times": "TuTh 2:00pm-3:20pm"}]}, {"course_name": "Cross-Cultural Communication and Multilingual Learners", "course_number": "TLPL443", "credits": "3", "grading_method": "Reg, P-F, Aud,", "description": "Participants will research and critically reflect upon aspects of culture as a basis to understand students and to develop principles to guide culturally inclusive teaching decisions. Participants will better understand the role of culture and language in schooling in order to create classrooms where culturally and linguistically diverse students (also known as English Language Learners, English Learners) can succeed.", "geneds": ["DVCC"], "sections": [{"section_id": "0101", "professor": "Instructor: TBA", "total_seats": "25", "open_seats": "23", "waitlist": "0", "times": "W 1:15pm-4:00pm"}]}]