{"courses": ["PSYC100", "PSYC221", "PSYC100", "PSYC221", "PSYC234", "PSYC489M", "PSYC100", "PSYC221", "PSYC100", "PSYC234", "PSYC353", "PSYC437", "PSYC100", "PSYC221", "PSYC234"], "average_rating": 4.4857, "type": "professor", "reviews": [{"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Such a fun lecturer!! All of her lectures are super entertaining and engaging. Since she is young, she is able to relate with the students more easily and uses examples which are likely to pertain to us. There are three big exams and the lowest grade is dropped; there are 12 weekly quizzes and 2 are dropped. I wasn't a big fan of the discussions because of the TAs, but I wouldn't blame her for that. There is a lot of extra credit, and overall an enjoyable class.", "rating": 5, "expected_grade": "A+", "created": "2022-10-28T20:38:40.117616Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "She is the best! The lectures are so interesting and engaging, and she is an excellent teacher. She responds to emails super fast and is really flexible when it comes to late assignments. Her grading scheme is amazing- one exam is dropped! Dr. Abi is amazing!", "rating": 5, "expected_grade": "A", "created": "2022-11-30T16:37:58.756033Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "She grades very easily, but some of her lectures seem off topic. The exams are all online and open note which is amazing. It is important to attend the lectures because she includes stuff from class on her exams, and she offers the answers to extra credit assignments.", "rating": 4, "expected_grade": "A+", "created": "2022-12-05T21:37:18.626095Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Great professor. Passionate about topics and is a very good lecturer. Exams are open note and online, but pay attention because a lot of stuff from class shows up. Super flexible and helpful, responds to emails before you even close your computer. Highly recommend!", "rating": 5, "expected_grade": "", "created": "2022-12-06T16:09:33.615463Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "The lectures are usually just PowerPoints and note taking. She is very funny and relatable since she's younger. I would definitely recommend her!!", "rating": 5, "expected_grade": "A", "created": "2022-12-06T22:48:33.735331Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Dr. Abi is does a fantastic job relating content from the class to real life examples and scenarios, which makes the lectures so engaging and the content easy to remember. There are weekly virtual quizzes based off of the reading material, and three virtual exams. All of the writing assignments, quizzes, and exams are thoroughly explained and match all of the course content. Great class and amazing professor overall :) !", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T21:59:35.855867Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "Great engaging professor. She lectures like she's a stand up comedian. Midterms and final exams are online and open note. Lecture slides posted to ELMS which is helpful. Many opportunities for extra credit. Would take another class with her; she's passionate about PSYC for sure!", "rating": 5, "expected_grade": "A", "created": "2022-12-09T20:05:29.311134Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "She was wonderful. Offers a lot of opportunities for extra credit which is great. Her lectures were always fun and you could tell she tries really hard to make them engaging. Would definitely recommend to anyone", "rating": 5, "expected_grade": "A+", "created": "2022-12-12T03:47:10.984943Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "She's so sweet and amazing. Love her! Take her! Her ta's are okay though..", "rating": 5, "expected_grade": "A", "created": "2022-12-12T19:21:52.619945Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "I really enjoyed having this professor! She keeps lecture interesting and fun, while also covering the material in an efficient way. We get to learn a lot of course material through her personal stories, and class activities. This is an easy A class IF YOU DO ALL OF THE EXTRA CREDIT. My raw grade in the class was an 88% and with the extra credit it went up to an A+. I recommend taking the weekly quizzes seriously (reading+vocab). The writing assignments are not hard but the ta's do grade a bit strictly. All in all I highly recommend taking her class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T17:41:26.447030Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "She was a really good psyc100 professor. Class was not too hard and she is very engaging in lectures. Very passionate about the subject and she was approachable about any questions about the course or psychology in general.", "rating": 5, "expected_grade": "A+", "created": "2022-12-26T16:45:59.432266Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "Professor Nicholas is a legend! She has such an incredible personality and makes lecture interesting and exciting. She is very excited to teach and loves her students. The class is not too bad. There is a quiz every week based on the readings which aren't too hard and there are 3 exams which are open note and online which are pretty easy. I recommend taking this class with Nicolas because she really is an amazing person and wants all of her students to do well.", "rating": 5, "expected_grade": "A", "created": "2023-01-05T20:49:40.009668Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "i had her fall 2022 for psyc221 & professor abi is great. she's very passionate and enthusiastic which keeps class very engaging. she is very sweet and cares about her students. the class wasn't bad at all either. we had weekly online quizzes, 3 online open note exams, and 3 written assignments. the only complaint i have is that the grading was a bit slow and class would run longer than usual. no real problems though with the class or her, she's great i loved her and chose to take another class with her this semester.", "rating": 5, "expected_grade": "A", "created": "2023-01-26T20:47:24.205015Z"}, {"professor": "Abigail Nicolas", "course": "PSYC234", "review": "Don't get me wrong for the 1 star. The class itself is relatively easy if you stay on track. The issue is that Dr. Abi does less than the bare minimum in terms technological layout for the class. She overcomplicates whenever possible, and is unsupportive when needed to provide some support. for example, despite every professor or teacher I have ever had putting assignments on the calendar so students are reminded about a due date, or at least putting a due date on the assignment in the elms \"assignments\" page, she decided that she was above this and refused to set these up leading multiple students to lose over 10% of their grade because of human mistakes. Her justification was because the due dates were in the atrocity of a layout that she called a syllabus. For a counselor and teacher who tells people to be lenient towards themselves, she is not lenient towards her students. \r\n\r\nThe class - that is the pre-made curriculum she regurgitates - itself is good, and I have learned some useful things but for me who relies on technology and having things organized normally, she comes nowhere near the bar that is set in terms of how almost every other professor in the university arranges their course. \r\n\r\nShe isn't a monster, or a bad professor, her teaching style just suffers from the following:\r\n- the inability to build an organized syllabus, assignment prompt, elms page, lecture format/slide layout...\r\n- snappy responses to genuine and understandable questions people have during lecture such as \"this could be easily addressed by maybe looking at the syllabus but since you already asked...\"\r\n- lack of due-date reminders except for in-class 0.5 second remarks that aren't even on the slides\r\n- a terrible grading scheme with VERY LITTLE  room for error, though the grades aren't harsh. \r\n- the inability for her to keep students engaged during a zoom-based class despite it being the norm for years for most people. \r\n\r\npros:\r\n- easy A if you put the effort in. the bulk of assignments are relatively easy\r\n- good if you want to skip therapy and learn positive psychology directly from the source for whatever reason. it genuinely helped me because I hate going to therapy\r\n- TA Michael is really great and provides great feedback and is open to answering literally any question you have.", "rating": 1, "expected_grade": "A", "created": "2023-03-08T22:37:59.368675Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "this class was such a mess. my psyc section was completely on zoom, so dr. abi would constantly get distracted and wouldn't stay on track. perhaps her in person classes are better, but don't take her online", "rating": 2, "expected_grade": "A+", "created": "2023-05-09T15:21:22.914414Z"}, {"professor": "Abigail Nicolas", "course": "PSYC234", "review": "Super easy course and she is an amazing professor. Wish I could've taken it in person.", "rating": 5, "expected_grade": "A+", "created": "2023-05-09T22:59:08.340469Z"}, {"professor": "Abigail Nicolas", "course": "PSYC234", "review": "I had prof. Nicolas for PSYC221 and loved her so much I decided to take PSYC234 with her! Both classes contained some type of writings each week (whether it was essays, short paragraph reactions to the chapter, or daily journals), which can be scary to some people but she makes the assignments very easy to understand and offers lots of help! There are also usually some type of discussion sections that you will have to attend every other week but she incorporates your discussions into the class time so you won't have to attend the class more than two days a week (and they are very easy discussions to get credit for). Also, she is very clear and thorough with directions you just have to actually pay attention and listen (which I found that a lot of my classmates did not do lol)! Overall, I really loved her and hope I get another opportunity to work with her again!", "rating": 5, "expected_grade": "A-", "created": "2023-05-10T19:24:16.402881Z"}, {"professor": "Abigail Nicolas", "course": "PSYC234", "review": "Nice person, but incomprehensible syllabus. The class itself is a cakewalk as long as you can decipher the ridiculously overcomplicated class layout. As long as you do the assignments, you'll get full marks... assuming you're actually able to remember when stuff is due. Any points you lose will be for stupid stuff like that.", "rating": 3, "expected_grade": "A", "created": "2023-05-13T14:55:34.129141Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "I took this class completely online and had a great experience. She was a kind teacher who was interesting to listen to. The format of the class was easy to follow and the weekly assignments were super easy. The exams were a bit difficult, but not impossible and very fair. The class was not time consuming at all, but I was still able to learn a bit. Definitely recommend, especially for online.", "rating": 5, "expected_grade": "A+", "created": "2023-05-26T02:16:09.860509Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "Tons of extra credit, easiest A of my life highly reccomend!", "rating": 5, "expected_grade": "A+", "created": "2023-05-27T01:35:38.331467Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Great instructor! Loved her course and the content. Not many assignments.", "rating": 5, "expected_grade": "A+", "created": "2023-06-22T17:27:49.172099Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "I've had Dr. Abi before for PSYC 100 and I can say that she is a truly engaging professor. Her course material is very manageable and she's understanding if you have a hard time meeting a deadline or have personal issues. Class attendance is not necessary to your success, but I definitely recommend it: during lecture there are clicker questions to participate in that go towards boosting your grade (definitely worth the 50 minute lecture). Overall, she does a great job and I can tell that she loves what she does. 100% recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-11-15T22:53:44.825304Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "She is very engaging during lectures! Both the textbook and her lectures do an nice job of explaining material. Her TA's are helpful in office hours if you ever need to go to them. While the structure of her class might feel odd at first with various zoom calls and writing assignments, you get used to it pretty quickly. Her quizzes, writing assignments, and exams are very fair in respect to the material covered. Moreover, her policies for dropping the lowest scores for quizzes and exams, as well as providing numerous extra credit opportunities, make her class quite forgiving. Attendance is important as there is material covered outside of the textbook, but she posts lecture recordings on canvas and gives some leeway for unexcused absences.", "rating": 5, "expected_grade": "A", "created": "2023-11-29T23:02:05.535436Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "Dr. Abi is such a good professor. She is very clear in her lectures and uses real world examples to further understanding of topics. She engages the class really well and is very relatable/ talking to you as though you are her friend during her lecture. Her exams are all online but you need to make sure you actually do the readings. If you do the readings/submit things on time/ and just show up for participation credit,You’ll get an A.", "rating": 5, "expected_grade": "A-", "created": "2023-11-30T21:06:45.639839Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "Definitely would recommend for PSYC100. She makes the lectures interesting and enjoyable and has a good sense of humor. Exams are all online and open note, and there are only three of them that make up 10% of your grade each, all multiple choice. Be sure to read the textbook section for each week and take decent notes from both the textbook and lecture, as you won't have time to find all of the information on the exams if you don't know anything. The other 70% of your grade essentially comes from showing up to discussion, doing the worksheets (basically online mini-quizzes with no time limit), syllabus quizzes and exam reflections. She gives easy extra credit opportunities as well. As long as you do the assignments and go to discussion, you're pretty much guaranteed a good grade.", "rating": 5, "expected_grade": "A+", "created": "2023-11-30T21:44:38.847045Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Dr. Abi is amazing! She is super engaging in lecture and makes learning about the topics fun. The grading structure is odd, but it doesn't really affect anything in the long-run. There's a weekly quiz, three writing assignments (can't be longer than 500 words), three exams (highest two grades are kept), and \"discussion\" grades every other Friday where you meet on zoom with a grad TA. I'm not even a PSYC major (took this class for the gen-ed) so I didn't even purchase the book and I got an A in the class. Certainly recommend this class for everyone!", "rating": 5, "expected_grade": "A", "created": "2023-12-06T16:59:48.393273Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "Hi so I was told that this class was super easy and took little effort because all the tests were online. They ARE online, but a lot of other stuff goes into your grade and I wasn't expecting that so I fell behind early in the semester. It's not a super strenuous class, but don't expect it to be *easy*. Dr. Nicolas was pretty nice, but it was a huge lecture hall so I never really got to know her at all.", "rating": 3, "expected_grade": "C", "created": "2023-12-12T18:35:05.314557Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "PSYC221 with Dr Abi was a very enjoyable class.  For the most part lectures were in person Monday/Wednesday and online discussion every other Friday.  Lectures were interesting and Dr Abi used a lot of examples and real world connections to make the content applicable.  She does track participation with clickers but drops a few at the end of the semester.  Also you can log into the clicker without being in class in case you can't make it.  Discussion is not really skippable if you want the points but it is not that much work, also there are only 5 for the semester.  \r\nThere are 3 exams (one is the final) and one gets dropped.  They are online and are taken outside of class.  Other reviewers said the syllabus is overcomplicated - but she goes over it and it's really not that hard to understand.  There are 4 writing assignments (spaced out in the semester) which are probably the hardest part of the class but they are still not that bad.  There are weekly reading quizzes but they are also out of class and not that big of a deal.  There is also a ton of extra credit to help your grade.  \r\nOverall, Dr Abi was very kind and made PSYC221 an enjoyable course!", "rating": 5, "expected_grade": "A+", "created": "2023-12-14T19:38:05.280704Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "Definitely recommend. Her lectures are interesting, her grading is fair, and her exams are all open-note, online, and based on the info received.", "rating": 5, "expected_grade": "A+", "created": "2023-12-22T02:01:48.111057Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Dr. Nicolas made class enjoyable with her relatable remarks and recent examples. However, I felt she went into way too much detail about concepts or ideas that were minor, or not even pertinent, to the topic being taught. Dr. Nicolas also grades writing assignments harshly, but she gives extra credit opportunities for most, if not all of the exams. Exams and quizzes are open note, so it is easy to do well if writing isn't quite your thing.", "rating": 3, "expected_grade": "A", "created": "2023-12-26T04:23:40.048119Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "Dr. Abi is the BEST! the class was really straight forwards and all the exams were online open note and open textbook so that was a breeze. Her lectures are actually engaging and relatable with special topics like cults or violent video games. I would recommend starting the writing assignments early because they do sneak up on you. She offers many easy opportunities for extra credit too. The only thing is you actually have to attend a certain amount of lectures because you get graded on participation using clickers. She is very nice and helpful in office hours too!", "rating": 5, "expected_grade": "A+", "created": "2024-01-05T16:58:25.458795Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "Dr. Abi is an amazing professor!! I took her online/in person section and it was very manageable and she is very organized with PSYC100. Quizzes and exams are from the textbook, and the discussions every other week are easy and informative. Participation is required if you want to get those clicker points, and Dr. Abi offers many extra credit opportunities. She is genuinely passionate about psych and her lectures were never boring. As long as you take good notes for the quizzes and exams, go to discussions and lectures, you’ll get an A!", "rating": 5, "expected_grade": "A+", "created": "2024-01-18T20:15:11.455017Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "Dr. Nicolas seems nice, and isn't a dry lecturer, but this class is still very boring. Very easy A, but there are mandatory discussions + posts + worksheets + stuff that can bring down your grade if you aren't careful to be very on top of things. Her exams are online, which is convenient. I have no strong opinions about her just was bored out of my mind every class and got an A without trying, so if you're just trying to pass this class as a requirement for your major I see no reason not to have her as your prof.", "rating": 3, "expected_grade": "A+", "created": "2024-01-24T22:16:26.989099Z"}, {"professor": "Abigail Nicolas", "course": "PSYC221", "review": "She is such a nice professor and cares about all her students. She is an enthusiastic, funny lecturer. She has open note quizzes every week and your lowest exam grade gets dropped. She also offers extra credit opportunities.", "rating": 5, "expected_grade": "A-", "created": "2024-01-29T06:28:52.484374Z"}, {"professor": "Abigail Nicolas", "course": "PSYC100", "review": "The professor is great. She's super nice and a funny lecturer. However I feel like the workload was a bit much. Every week there were chapter notes to do. While this wasn't required, I found that you needed to complete it in order to do well and pass the exams. The exams are online but they can be very nit-picky and ask questions about some random video watched in lecture. Overall, the class is easy but you definitely need to put good work in.", "rating": 3, "expected_grade": "A+", "created": "2024-02-04T16:37:58.047274Z"}], "name": "Abigail Nicolas", "slug": "nicolas_abigail"}