{"courses": ["CMSC433", "CMSC436", "CMSC798", "CMSC436", "CMSC436", "CMSC436"], "average_rating": 2.6429, "type": "professor", "reviews": [{"professor": "Adam Porter", "course": "CMSC433", "review": "Awesome professor. Knows the material extremely well and very effective at teaching concepts.\n\r\nHe becomes disappointed when less than half the class shows up after the first midterm. Make sure you ask questions in class for him to remain engaged in explaining the examples.\n\r\nProjects are difficult and time consuming. The section with Yeh had OPEN note/book/internet/anything midterms, which were held on google docs. Their class average was an 89, which is understandable since everyone gets 100% on his two midterms (worth 30% total).\n\r\nTake it with Yeh if you want to loaf around and still be able to pass. Take it with Porter if you want to learn concurrency and mapreduce.", "rating": 5, "expected_grade": "A", "created": "2012-05-03T18:34:00Z"}, {"professor": "Adam Porter", "course": "CMSC433", "review": "Porter is a pretty cool guy.  The projects are kind of difficult, if only because his project descriptions are vague.  Make good use of the forum because he answers questions there frequently.  Exam(s) aren't too bad if you study.", "rating": 4, "expected_grade": "", "created": "2009-11-12T01:03:00Z"}, {"professor": "Adam Porter", "course": "CMSC433", "review": "Reasonable teacher:\r\nThe projects can be quite hard (though not impossible) and all the submit server tests are secret.\r\nExams are fair and graded fairly.\r\nLectures are boring -- Porter seemed to have lost interest in the material after the midterm because students had stopped coming to class.\r\nJust try a little harder and you'll get an A/B", "rating": 3, "expected_grade": "A", "created": "2008-12-29T19:20:00Z"}, {"professor": "Adam Porter", "course": "CMSC436", "review": "Easy class. Open note exams. One big group project.", "rating": 5, "expected_grade": "A-", "created": "2018-04-17T03:30:09Z"}, {"professor": "Adam Porter", "course": "CMSC436", "review": "Easy class but awful professor. He is frequently absent to nonexistent on the student forum Piazza, and many questions are left unanswered or answered only affer they aren’t relevant anymore (i.e. exam/project questions after the deadline). A couple examples:\r\n\r\n1. For our midterm we were learning stuff up to the week before the exam. Porter confirmed that the exam material may include what was taught in lecture that week, but neglected to upload the slides for that material. Many students asked on the forum for the slides, frequently (13 hours before the exam, 9 hours, then 5 and then 2 hours before the exam, all on the same thread). One hour before the exam the professor finally responds saying “Sorry for the missing slides” but still neglects to upload them\r\n\r\n2. On the Tuesday a week before Thanksgiving break Porter assigned us another lab, to be due the following Monday (2 days before break). Again, students posted on the forum asking for an extension on the lab due date as many people were traveling for break and as the lab was also longer and more difficult than any other. Once again, no response from the professor, even after over 30 people “good questioned” it on Piazza. The day after, he assigned another lab due the Monday after break.\r\n\r\n3. The semester project was not brought up again until midterm season, and he waited an extra week to release the project idea bds, and then ANOTHER week to release the project signups (this wasn’t intentional, he released them late), which left us about a month to start and finish a priject from scratch in addition to the weekly labs and our other classes.\r\n\r\n\r\nOverall, this class was a huge disappointment and made me reconsider never doing Android dev ever again. Other reviews say Porter grows bitter as more and more students stop going to class, but he also grows really unresponsive and irresponsible. He doesn’t do a good job teaching; he just reads off the slides, which by themselves are just screenshots of sample code. Most of our labs we finished with a mix of stack overflow and just copying the sample code.", "rating": 1, "expected_grade": "A", "created": "2018-11-21T01:56:02Z"}, {"professor": "Adam Porter", "course": "CMSC436", "review": "Totally ineffective as a lecturer. He reads from the slides that are literally just text and bullet points. Lecturers are not engaging, and because the emulator on android studio is laggy and takes forever, he cannot demonstrate how apps work but instead shows you the code in fragments on his slide which are of no help.\r\n\r\nHis labs are relatively easy because they are \"fill in the blank\" style. These weekly labs were slightly annoying because they did not offer anything substantial to teach you. You could easily look up how to do something on stack overflow and it was normally a one liner. But I guess it is harder to make normal cs projects that involve making an application on android from scratch so personally I do not know what other alternative there could be.\r\n\r\nNow about the big group project: I feel this was managed horribly. The teams were not assigned until after the first midterm in mid October along with the potential project ideas to pick from if you didn't have an original one of your own. This left students 6 weeks to build an android application from scratch, while balancing weekly labs and other coursework. 6 weeks was not an adequate time frame to do a group project. You are normally a team of 6 people but thats still hard to manage during the roughest part of the semester.\r\n\r\nWhen it came to the midterm, students felt they got steam rolled. It was all short answer with a few true/false mixed in. the average was around a 64%. Fortunately the labs and the group project will weigh more than exams in the long run. Several students who took the midterm felt railroaded but that is partially due to Porters ineffective teaching.\r\n\r\nI learned the most about android dev doing my own outside research on youtube and stack overflow and most importantly during the group project. That is where the real learning starts. I understand this class will be switching over to iOS development for handhelds but whether or not that is a permanent thing or if it will alternate from fall to spring semester from android to iOS i am not sure. If Porter is teaching 436 again don't worry. The class is not too hard and its pretty manageable to get a high passing grade. Just don't expect much from Porter. Or his incompetent TA's that never show up to office hours. In fact, it felt like both instructor and TAs just didn't give a damn this semester...", "rating": 1, "expected_grade": "B", "created": "2018-12-11T02:04:39Z"}, {"professor": "Adam Porter", "course": "CMSC436", "review": "Porter responds to few, if any questions asked on Piazza, and will often read off the slides instead of actually lecturing.  \r\n\r\nTAs are nonexistent on the online forum as well; many will often cancel office hours last minute, screwing over people who have questions on course content.\r\n\r\nPorter will often release the slides a few days late after lecture as well; while you can read previous semester's slides to study, this is still annoying nonetheless.\r\n\r\nI was and am extremely disappointed in this class' organization and content.  Based on the past reviews of this class and Porter, I was expecting a learning experience, not a power-point reading club.\r\n ", "rating": 1, "expected_grade": "", "created": "2018-12-11T21:02:42Z"}, {"professor": "Adam Porter", "course": "CMSC436", "review": "436 was a fun class for me due to the subject matter but it was poorly run. The class was not difficult but TA's/professors were not very responsive in Piazza and Porter gave off a vibe that he did not really care about the class that much. My biggest gripe is with the midterm and final, where no practice material or quizzes were given beforehand, and we were not given the midterm back. The class was not hard but throughout the semester it was unclear what my grade in the class was as the weekly labs were only worth 25% of my grade, and the average for the first midterm was 65%, which indicates the class should be curved (Although Porter never talked about us or assured that a curve would happen). I went into the final not knowing what 50% of my grade in the class was going to be due to the final project being graded, and a week after the final I am still unsure what my final grade is. This uncertainty and poor administration made an otherwise fun course a source of minor anxiety for me.", "rating": 2, "expected_grade": "B", "created": "2019-12-18T16:10:39Z"}, {"professor": "Adam Porter", "course": "CMSC436", "review": "Awful bro. The labs are assigned over weekends, so there's no office hours til the day they're due. Porter hasn't answered a single thing on Piazza & the TAs watch the Piazza and just don't reply. I'm terrified for the midterm and final cause this class is a mess. Horribly run and not worth the stress.", "rating": 2, "expected_grade": "", "created": "2022-02-21T20:42:14Z"}, {"professor": "Adam Porter", "course": "CMSC436", "review": "Please don't. The worst, I repeat, the worst CS class I've taken at UMD.\r\n\r\nUsually, 2 weekly labs worth 1% take a good amount of time\r\n\r\nIt took us 3 to 4 weeks to convince him to release the labs 1 day earlier so we could use more OH or not have the weekend fully consumed by them.\r\n\r\nRidiculously unresponsive professor\r\n\r\nAdam Porter simply does not care about students and it's questionable how a professor can get away with this\r\n\r\nI have to make follow-ups on follow-up posts in Piazza and still no response\r\n\r\nWe still don't have any grades besides the midterm (it's almost April)\r\n\r\nThe Course is outdated. Porter has tried to make it seem it's not, but he does not cover the most recent architectural models in Android properly very well at all, such as view models, etc.\r\n\r\nThey probably won't let us look at our exam results as well\r\n\r\nNo study guide whatsoever. The exam was ridiculously long. He put questions from every single lecture slides\r\n\r\nGarbage slides by the way\r\n\r\n436 is a bag of everything you hate about a 400 at UMD. Absolute waste of time, money, and effort. Honestly, just do Google Labs.", "rating": 1, "expected_grade": "B+", "created": "2022-03-29T16:39:15Z"}, {"professor": "Adam Porter", "course": "CMSC436", "review": "Not a hard class to take, but lectures are mostly a waste of time except for the 30 mins a week he spends on answering lab questions and giving tips. The labs are manageable and most of the code is in the example repo/slides. Otherwise, he doesn't provide much guidance and you tend to teach yourself for most of the class.\r\nOne downside, is he doesn't use ELMS at all, so you have to be checking Piazza or the class website for updates, which just add an extra layer to keeping up to date with tasks.", "rating": 3, "expected_grade": "", "created": "2022-04-07T15:44:23Z"}, {"professor": "Adam Porter", "course": "CMSC436", "review": "I feel that I have learned nothing from the class.\r\n\r\nHis lab assignments which accounted for 30% of our grade, were mostly fill-in-the-blank style lab assignments.  Most of it was easy and copy and paste from class examples.  \r\nFor the big group semester project, most of what we learned wasn't useful as the lectures doesn't go in-depth for anything we cover. Google was the professor of this class.\r\n\r\nMid-term was a mess.  He wrote on the piazza that mid-term would be multiple choice, fill in the blanks, and free-response.  He didn't lie except there was 1 multiple choice, 1 fill in the blanks, and 30+ free responses.   Many free responses questions asked stupid things like the name of the class example you saw certain concepts covered.   Why ask the name of the example?? how does that test our knowledge of the concept? I don't know.\r\n\r\nBasically, the whole course is useless besides the fact that you get to get in a group to make an android app learning mostly how to do it by yourself and your peers.", "rating": 2, "expected_grade": "B+", "created": "2022-12-07T03:05:34.513261Z"}, {"professor": "Adam Porter", "course": "CMSC436", "review": "Overall the class was fairly easy and the TAs were quite responsive and helpful. If you're looking for an easier 400 level this is the one to take. Labs usually don't take much longer than an hour to complete and are assigned once a week. Final project is posted from the beginning of the semester so there is plenty of time to work on it and get it done as long as you don't procrastinate. Only major problem with the class is similar to those mentioned below regarding exams. The problem mentioned below with the way the exam was described to be structured vs what it actually was is still present. Additionally, there are still questions on the exam that are unnecessarily specific about in class examples. However, if you keep in mind that exams are essentially open book thanks to a double sided notes sheet, then the exams are not too bad. Minus the few exam issues it was a good class.", "rating": 4, "expected_grade": "A-", "created": "2023-12-13T05:18:01.948735Z"}, {"professor": "Adam Porter", "course": "CMSC436", "review": "This class is mid. Android programming as a field is interesting and highly relevant to jobs. However, the class itself is boring, outdated, and focuses on things you don't need to actually make Android apps. The professor just reads from slides every lecture, and the material focuses on hyper-specific details of how Android works when most of us have never programmed on Android before. \r\nThe HW assignments were easy, completion-based assignments. The exams were ridiculous- both the midterm and the final exam were 35 questions of pure memorization. However, we got a cheat sheet, which made things easier if you were able to fit all the slides' content onto one piece of paper. The exam was basically a word hunt for each question on the cheat sheet. \r\nThe final project was making a full android app. It was tough since we learned few practical implementation tips. However, the professor graded extremely leniently-- the lowest grade was an 85/100.\r\nIt was comparatively easier to get an A in this class compared to other 400 levels, but that isn't saying much. Take this class if you need an area 3 class for CS, want to learn a little bit about Android programming, or want an easier than average 400 level CS class; otherwise, skip.", "rating": 3, "expected_grade": "A", "created": "2023-12-28T04:15:49.164427Z"}], "name": "Adam Porter", "slug": "porter_adam"}