{"courses": ["CCJS300", "CCJS352", "CCJS418P", "CCJS200", "CCJS300", "CCJS418P", "CCJS300", "CCJS418P", "CCJS300", "CCJS418P", "CCJS200", "CCJS300", "CCJS200", "CCJS300", "CCJS300", "CCJS418P", "CCJS300", "CCJS418P", "CCJS300", "CCJS418P"], "average_rating": 4.4737, "type": "professor", "reviews": [{"professor": "Alan Lehman", "course": "CCJS352", "review": "Even though he is a good, cool, and funny guy do not take him in 352. I have Lehman for CCJS 300 as well and he is not much better. If you're taking 300 go with Brooks. The only reason I took it with Lehman is because I did not want Friday classes. But now for 352; DO NOT take this class with Lehman. The average grade for the first test was a C given that there are only 3 test, including the final, this made obtaining a good grade very difficult. 352 is an elective course and he treats it like a course in chemistry and biology. His test are 100 questions multiple choice and are written in the most complicated way possible.\n\r\nI got screwed over by taking 352 with Lehman to which I was recommended by a friend. I hope this review saved you from making a huge mistake. ", "rating": 1, "expected_grade": "C", "created": "2014-11-04T03:42:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "I completely agree with everyone else lol\r\nProfessor Lehman studies medicinal marijuana so he talks about it a lot and you will learn a lot about it in this course. The class material is pretty dry so he makes it a little more interesting.\r\nFor the SPSS assignments he outlines EXACTLY how to do them with detailed instructions on the assignment and sometimes he'll give you the answers in class. \r\nFor the exams it's very important to READ EVERYTHING in the assigned chapters, you should also go to class because we watch film clips and he'll talk about his research & some questions appear on exams.", "rating": 5, "expected_grade": "B", "created": "2013-05-06T10:10:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Honestly, everything the others have said about him is true. He can be a bit on the boring side some days, but considering the material he's teaching he does a good job of it not being boring EVERY day.\n\r\nFor the SPSS assignments, he writes on the packet he hands you EXACTLY where to click in the program, what kinds of graphs he wants, and how to interpret the data to get your answers. If you come to class, he even gives you the answers to some of the fill in the blank parts. \n\r\nThe exams are a bit tricky, as they're a random mash up of his lectures and stuff in the book. If you go to class and take notes on your laptop and then skim the chapters though before the exam you'll be fine.\n\r\nHe does talk about his work to decriminalize weed a LOT, but it's mostly done when it relates to the material. He also throws extra credit questions on the exam that you will only know the answers to if you go to class. (like about where he started his research or a state he is working with currently to find information)\n\r\nOverall, I'd take him over Dr. Brookes. She's a nice lady, but his tests are much easier and she never showed movies in class.", "rating": 5, "expected_grade": "A-", "created": "2012-11-28T21:37:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Class should be re-named \"POT101\" because he does his research on Medicinal Marijuana. \n\r\nJoking aside, he is a pretty cool guy/good professor. Very approachable. Dry material, but not too difficult. Every semester he sets aside a week to watch a movie. Grades are on 3 tests and SPSS computer assignments. I would highly suggest taking this course with him, ", "rating": 4, "expected_grade": "A-", "created": "2012-05-19T13:13:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Lehman is my new favorite professor.  He's a little quirky and obsessed with research about medical cannabis, but those are some of the reasons that we love him.\n\r\nHe tells it like it is, and makes research methods actually seem interesting.\n\r\nYour grade is made up of four homework assignments with SPSS (easy as pie!) and  exams.  Exams are easy -- just go to class, take notes, and read the book once.\n\r\nHe usually teaches for an hour instead of the hour 15 each class, so you always get out early.\n\r\nAfter dreading having to take Research Methods, Lehman made this the one class I looked forward to.", "rating": 5, "expected_grade": "A", "created": "2011-12-01T16:53:00Z"}, {"professor": "Alan Lehman", "course": "CCJS200", "review": "Take any class you can with Lehman! I took this class with him during a six week session, and I was able to do really well. His tests and homeworks are fairly easy but at the same time you learn alot. I'm taking ccjs300 with him in the fall as a result of my experience.\n\r\nbuy the book, go to class, do the hw and you will get an A pretty much guaranteed.", "rating": 5, "expected_grade": "A+", "created": "2011-07-07T12:39:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Lehman is great! His exams and computer assignments are pretty easy. There is an attendance policy, so you have to go to class. Buy the textbook, but don't buy the computer assignment book. Overall he a great teacher, and I'd highly recommend taking him. ", "rating": 5, "expected_grade": "A", "created": "2011-05-18T17:01:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Professor Lehman is great. He talks about a lot of interesting subjects in class and tries to help out students as much as he can.  Very helpful during office hours and tells you what you need to fix on assignments. His exams are straightforward, and not difficult. A+ Professor in my book", "rating": 5, "expected_grade": "A", "created": "2010-11-10T22:11:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Dr Lehman is straightforward. His exams are the best, they are not tricky at all. You literally just have to learn his lecture notes and read the chapter once. The material is easy and he is a pretty cool professor. Lectures arent boring, and the homework (worth 25% of final grade) is super EASY. You could literally do it an hour before class.\n\r\nWould def recommend him if you want to get a good grade without trying too hard ;-)", "rating": 5, "expected_grade": "", "created": "2010-08-31T10:40:00Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Okay professor. The 100 question quizzes were a bit much. He always told us about stuff like a day before it was due which was annoying but I did take this online bc COVID. He’s not terrible but I probably wouldn’t take again. ", "rating": 3, "expected_grade": "A", "created": "2020-11-20T21:33:02Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Lehman is a super sweet guy. The content itself isn't too interesting but you can tell he loves teaching it. The exams are very lengthy and HEAVILY memorized based which is the only fault. There is so much content from the lectures to memorize but as long as you get it all down you will get an A. Overall hes a great guy and was not a terrible class by any means. ", "rating": 4, "expected_grade": "A-", "created": "2021-11-08T20:58:55Z"}, {"professor": "Alan Lehman", "course": "CCJS200", "review": "I took CCJS200 with Lehman over the summer - and it was the best decision. He did give many assignments, but they were all fairly simple and to the point. He also gave 3 exams throughout - but they were all open note and he gave you the entire weekend to complete them. The questions on the exam were identical to those he gave on the daily worksheets/assignments. Overall it was a low stress class and he is a very nice guy. ", "rating": 5, "expected_grade": "A+", "created": "2021-11-15T00:10:04Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "He's a great professor and knows his stuff. Two pieces of advice for you guys: be sure to take good notes because he writes notes on a piece of paper and for the SPSS assignments, pay attention to the instructions because I did lose some points for that.", "rating": 5, "expected_grade": "B-", "created": "2021-12-19T00:17:44Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "Pros:\r\n- Research methods can be a little dry, especially if you’re not interested in research. Professor Lehman incorporates examples from his own research on marijuana into the class, which makes it much more interesting.\r\n- He wants students to succeed, and you can email him at almost any time before SPSS assignments are due with questions. He will get back to you. \r\n- Class almost always ends early. When he finishes his material for the day he doesn’t feel the need to keep students ‘just because’. \r\n\r\nPro or Con depending on your preferences:\r\n- Everything in this class is hand written by the professor on the board or a piece of paper that is projected onto the board. You have to write really good notes.\r\n\r\nCons:\r\n- The exams are 100 question multi-choice, and they are heavily memorization based. You’ll be tested on stories he tells in class, so study those too!", "rating": 4, "expected_grade": "A-", "created": "2022-05-20T20:59:12Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "I love this professor so much. The topic is super boring but since you have to take the class, this teacher is the way to go. He throws in 5 assignments that he basically tells you exactly how to do which makes ur grade boost a lot if you get 5/5 on all of them (which is so easy). He is super accommodating, has very helpful office hours, and walks you through almost everything. The tests are multiple choice with 100 questions which sounds like a lot but actually helps you with scoring as you can get like 15 wrong and still get an 85. You MUST read the textbook and you will get a good grade. Requires a lot of studying but as long as you read the book and go over the notes he gives you, you will get an A", "rating": 5, "expected_grade": "A+", "created": "2022-11-30T18:21:36.110683Z"}, {"professor": "Alan Lehman", "course": "CCJS418P", "review": "Awesome class, really well organized. Printed outlines for every class made studying for me so much easier. Exams are straightforward, no trick questions. He is very passionate about this subject and wants his students to succeed. Highly recommend!", "rating": 5, "expected_grade": "A-", "created": "2023-04-24T14:13:50.517180Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "he's a great professor and the class is relatively easy. it calls for a lot of stuff from ccjs200, so if you were good on that, you should be good with this class too. however, the only difficult thing about his class was the exam. it's 100 MC questions and it was based on a lotttt of memorization. either from the notes, the articles he provides, and textbook. some things he doesn't talk about in class and we'll still be expected to know it for the exam, which kinda sucks. he also didn't have extensive review sessions so we didn't know what to study in depth about.", "rating": 4, "expected_grade": "A-", "created": "2023-11-07T14:45:10.600309Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "I was very scared going into this class that it would be like 200 but it is not. This class is on the boring side because it is research methods, but there is not a ton of work. You have very straightforward SPSS assignments (4) that literally are just copy and pasting. There is one essay based on a movie you watch in class too. Exams are extremely easy if you read the textbook and class notes. The exams are word for word from class notes and the textbook. If you do not read the textbook you will do bad on the exams. I personally read the textbook chapters twice before exams and class notes a few times and I am able to do the 100 question multiple choice exam in 20 minutes because it is so straightforward.", "rating": 5, "expected_grade": "A+", "created": "2023-12-01T20:39:39.631207Z"}, {"professor": "Alan Lehman", "course": "CCJS300", "review": "good professor. this class is not like ccjs200, its a lot more boring, factual stuff about the ins and out of research. spss assignments are straight forward as well as multiple choice exams. i would recommend showing up to classes because he gives out a lot of test answers. if its not something he gave the answer to in class, its something from the textbook. (also a lot of good quizlets online to study from before tests).", "rating": 5, "expected_grade": "A", "created": "2023-12-22T22:48:30.836243Z"}], "name": "Alan Lehman", "slug": "lehman"}