{"courses": ["CMSC216", "CMSC411", "CMSC798", "CMSC498K", "CMSC642", "CMSC714", "CMSC416", "CMSC714", "CMSC416"], "average_rating": 3.25, "type": "professor", "reviews": [{"professor": "Alan Sussman", "course": "CMSC216", "review": "I'm giving Sussman 5 stars because honestly, he's one of the better professors in comparison to the other CS professors in this department.\n\r\nIt is hard to pay attention in lecture because he doesn't make things very interesting (although, an intro computer science course will never be that interesting).\n\r\nHowever, he for sure knows what he's talking about, and he definitely explains things thoroughly.  Just try to get enough sleep and stay focused during lecture so you can learn because he does say good things.\n\r\nHe really does care about his students.  He is very nice during office hours and will respond to your concerns.", "rating": 5, "expected_grade": "B", "created": "2016-04-26T16:00:00Z"}, {"professor": "Alan Sussman", "course": "CMSC216", "review": "216 is nobody's favorite class, from what I hear. I was dreading taking it, especially with an unfamiliar professor. But Sussman proved to be a very competent, engaging, thorough, and considerate instructor. Sure, it helped that I was already well-versed in the language the course is taught in (C) so that I didn't have to worry about syntax. Still, I believe Sussman covered things pretty well.\n\r\nHe is not very energetic, which would be nice for a 75-minute class, but I've had much worse. What matters is that he is a nice, sincere, accommodating guy who tries his best to deliver a good lecture and leave nothing obscure. I doubt you can do better than Sussman for 216...unless Fawzi is teaching it!\n\r\nThe first 2 exams, in my opinion, are perfectly fair. You can reasonably expect a A- or B+. The final was kinda hard and intentionally so; it was curved accordingly.\n\r\nI got an A+ in 216 (slightly higher than my grades for both 131 and 132)! ", "rating": 4, "expected_grade": "B", "created": "2012-08-30T23:31:00Z"}, {"professor": "Alan Sussman", "course": "CMSC216", "review": "Dull voice, and comes off as a bit... insecure, but not quite snarky. He cares about his students, but wants them to take responsibility for their learning.\n\r\nBy no means a creative lecturer. Don't expect him to do much more than read off the slides - going to class is not really necessary, just make sure you read and understand.\n\r\nI have few complaints about this course, and think that 90% of it is extremely clear and relevant to CS. It's worth noting that there were a few things that were not explicitly covered in class/slides that we were expected to know from the textbook (which is actually a very solid resource if you ever crack it open). For example, we needed to use exit() in a project before we went into process control and would have naturally encountered such system calls. Also, Assembly is tedious, but not devastatingly so.\n\r\nOverall, this is a very interesting course; as for the professor, it's probably not a huge factor in your experience. Do the projects early and be sure to understand what's going on.", "rating": 4, "expected_grade": "A", "created": "2012-05-24T23:32:00Z"}, {"professor": "Alan Sussman", "course": "CMSC216", "review": "Sussman really isn't as bad as some of these reviews pose him as. It's a very difficult course designed as a \"weed-out\" and you really need to work hard and study continuously to do well. Sussman, however, gave very fair quizes, especially compared to the previous semester, with Keleher, and the quiz material was almost always predictable. He's a pretty decent lecturer, even if he does read off of the slides a lot. When you go to him for office hours, he really shows that he cares about you and will even stay longer than his hours if he's not done figuring out your issue. Overall, I felt he was a great teacher with fair assignments, especially for a non \"lecture\" professor.", "rating": 4, "expected_grade": "A+", "created": "2012-05-21T13:02:00Z"}, {"professor": "Alan Sussman", "course": "CMSC216", "review": "This is my first B of college, and it was a travesty the manner in which I lost my 4.0 gpa.\n\r\nTo quote a previous review:\r\n\"He is one of the most terrible, boring, and unresponsive professors you'll ever deal with. He DOESN'T care about you, nor he cares about your concerns. He is there to do his research, to get paid or whatever other reasons he might have. He is not there to teach you.\"\n\r\nSussman's projects were awfully and strictly graded, with averages in the 60%'s, and his tests were even worse, and had such difficult questions that everyone knew they failed (average on the tests were around 60%).\n\r\nMany people dropped this class with a W, others dropped Computer Science as a major, others got horrible grades and planned to retake the class. Whatever it is, this class was the doom of many people, and I took it the first semester it was offered, which means it was even more horribly taught than 212 since it was a new class.\n\r\nF*** you Sussman, and the computer science department, for making such a bullsh*t class with nothing to gain.\n\r\nI have no real-world knowledge of C or Assembly language programming from this class. Just my first B of college. That's all.", "rating": 1, "expected_grade": "B", "created": "2010-12-23T22:09:00Z"}, {"professor": "Alan Sussman", "course": null, "review": "Prof Sussman takes couple of lectures getting used to. Yes, he reads a lot from slides. But this class (I took it as CMSC213/313 but it is now renamed CMSC216) is a fairly hard class. You have to put in significant effort to do well. Sussman's projects and tests are not easy. His grading is mostly fair. But he is very smart and knowledgeable, which means he will pose those tricky ones you don't expect. I did like his class quite a bit. You just have to be prepared to learn a lot of stuff, at a fairly fast pace, and get used to his method of teaching. I would recommend him for this class.", "rating": 4, "expected_grade": "A", "created": "2010-06-08T02:01:00Z"}, {"professor": "Alan Sussman", "course": null, "review": "He is one of the most terrible, boring, and unresponsive professors you'll ever deal with. He DOESN'T care about you, nor he cares about your concerns. He is there to do his research, to get paid or whatever other reasons he might have. He is not there to teach you.", "rating": 1, "expected_grade": "A", "created": "2009-01-15T23:03:00Z"}, {"professor": "Alan Sussman", "course": null, "review": "Dr. Sussman is a very nice person. He is very helpful outside of the classroom. His lectures are extremely boring though. He literary reads the power point presentations. This semester he did not run 212 (Herman did), so he did not write the exams. Overall Sussman is a good person, but for what I experienced you get the same by staying home and reading his power point presentations. Grading was fair though. And by the way, 212 is not actually as hard as people say it is, the only thing is Herman asks the most stupid and usless questions in the exams (usually worth 25% of the exam) in which he literary asks you to know the specific name of that one little think her barely mentioned that one day... everything else is easy and fair.", "rating": 3, "expected_grade": "A", "created": "2008-12-26T23:24:00Z"}], "name": "Alan Sussman", "slug": "sussman"}