{"courses": ["ENGL393", "ENGL393Q", "ENGL394", "ENGL391", "ENGL101S", "ENGL297", "ENGL393", "ENGL393Q", "ENGL393", "ENGL393Q", "ENGL393", "ENGL393Q", "ENGL398A", "ENGL393", "ENGL393Q", "ENGL393Q", "ENGL393Q"], "average_rating": 4.2857, "type": "professor", "reviews": [{"professor": "Alexandra Calloway", "course": "ENGL393", "review": "Alexandra is a nice professor and if you put the necessary work into this class, you'll be fine.  As another reviewer pointed out, she allows you to rewrite pretty much any assignment in the course for a higher grade, which is great when you get a lower grade than you expected. She will also give you a lot of advice on how to improve your work if you ask her, making the rewrite policy very nice. She does only teach the class one night a week, so the 3 hour block can be kind of a drag, but she tends to do a decent job of making the class go by somewhat quickly, especially in the second half of the semester where most weeks there will either be some sort of class activity or a peer review. My one complaint is that, at the very beginning of the course, I was confused about when certain assignments were due, since the syllabus would show upcoming due dates for assignments we had not discussed, but she corrected this and it got better as the semester went on. You're probably required to take technical writing, but if you take it with Alexandra, it won't be that bad.", "rating": 4, "expected_grade": "A", "created": "2012-12-26T23:40:00Z"}, {"professor": "Alexandra Calloway", "course": "ENGL393", "review": "Alexandra is a good professor. She gives you a lot of freedom in writing your papers about topics that you care about, which makes the course much more interesting and bearable. \r\nHer lectures are kind of boring and not that helpful, but what can you expect from an English class? She often lets the class out early which is awesome. \r\nShe is very nice and responsive to student concerns.\r\nShe can be somewhat disorganized and there are too many documents and procedures for submission of assignments which is kind of annoying.\r\nBut overall I enjoyed this course very much. Just make sure to pick a final project that is easy so you don't get bogged down trying to finish it at the end of the semester.", "rating": 4, "expected_grade": "A", "created": "2012-05-15T00:58:00Z"}, {"professor": "Alexandra Calloway", "course": "ENGL393", "review": "Work hard in her class and you should be rewarded. For your group project, make sure you ask her for advise before turning in your final copy. Make sure you attend class because it counts toward your final grade. She allows every graded paper to be revised and resubmitted, take advantage of that and you should be fine. ", "rating": 4, "expected_grade": "A", "created": "2011-12-27T12:59:00Z"}, {"professor": "Alexandra Calloway", "course": "ENGL393", "review": "Professor Calloway cares about her students. She is very nice and understanding. She gives good comments and feedback in almost all her assignments but doesn't take many points off. If you do the assignments and show up to class, you will get an A even if you submit assignments late. Definitely an easy A course that I actually learned stuff in. She makes us read certain short articles and do simple assignments that teach you important aspects of technical writing and skills that you will definitely put to use in the workplace. She also gives a lot of extra credit opportunities. I was probably putting, at most, an hour of work per week in this course.", "rating": 5, "expected_grade": "A", "created": "2020-05-15T03:58:41Z"}, {"professor": "Alexandra Calloway", "course": "ENGL101S", "review": "First off, she is a super nice lady and really cares about her students. The reason I could not give her a 5 is because she was extremely disorganized. She'd have an essay and rough draft for another essay due at the same time. Sometimes she wouldn't comment on our rough drafts till after we submitted the final exam", "rating": 4, "expected_grade": "A-", "created": "2020-12-23T23:27:23Z"}, {"professor": "Alexandra Calloway", "course": "ENGL297", "review": "She is a very nice person and cares about her students. Her class was an hour and 15 minutes and for the most part, she just chatted about random stuff which was annoying. I'd rather be talking about the class but who am I to complain. The class is an easy A and she is willing to work with students. You don't need the team writing book and I found a pdf for the technical writing textbook. You only need to read the textbook when she assigns something related to it. It's common sense stuff though. Overall, if you need an easy DSSP I would talk this class.", "rating": 4, "expected_grade": "A+", "created": "2021-01-22T22:28:43Z"}, {"professor": "Alexandra Calloway", "course": "ENGL393Q", "review": "She's a nice professor and understanding. So flexible with the deadlines as long as you keep progress in the class. You might feel overwhelmed at the beginning of the class but things will go smoothly once you realize how simple they are.", "rating": 5, "expected_grade": "A", "created": "2023-05-08T03:37:57.472934Z"}], "name": "Alexandra Calloway", "slug": "calloway"}