{"courses": ["CPMS101", "CPMS230", "CPMS240", "CPSP259J", "JOUR130", "CPMS100", "CPMS225", "JOUR660", "JOUR360", "CPMS230", "JOUR360", "JOUR660", "CPMS100", "CPMS225", "CPMS230", "JOUR360", "JOUR660", "CPMS101", "CPMS230", "CPMS240", "CPSP259J", "JOUR360", "JOUR660", "CPMS100", "CPMS225", "CPMS230", "JOUR360", "JOUR660", "CPMS101", "CPMS230", "CPMS240", "CPSP259J", "JOUR360", "JOUR660", "CPMS100", "CPMS225", "CPMS230", "JOUR360", "JOUR660"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Alison Burns", "course": "JOUR130", "review": "Best teacher, class was relaxed and did not have a lot of work.", "rating": 5, "expected_grade": "A+", "created": "2017-11-20T00:56:19Z"}, {"professor": "Alison Burns", "course": "JOUR360", "review": "She's super awesome. She goes by Allison and not Mary and she still freelances for Cox Media Bureau. She brings in tons of stories from outside. She really cares about all of her students and is really good at helping you become a better writer. There is a ton of participation and sharing to the rest of class. We watch a lot of videos and almost all our writing assignments will have rewrites. She rules and is a great teacher.", "rating": 5, "expected_grade": "", "created": "2013-11-19T11:19:00Z"}, {"professor": "Alison Burns", "course": "CPMS101", "review": "She is the kindest person you will ever meet. She genuinely cares about her students and their experience in her class. I only took her for the 1-credit Media Scholars colloquium so I can't say much about her teaching skills. With that being said, if you're looking for a good grade, all of the assignments in that class were very easy and basically completion grades.", "rating": 5, "expected_grade": "A+", "created": "2020-12-26T22:51:50Z"}, {"professor": "Alison Burns", "course": "CPMS100", "review": "Alison is one of the sweetest people I've ever met! I had her for all of Media Scholars and loved the experience. She's very open and relatable with her students, and does a great job of making them passionate about media through plenty of diverse guest speakers and discussion activity. When I was having a hard time with the death of a loved one, she went out of her way to make sure that not only I could come to the Scholars field trip in the midst of the tragedy, but she also invited my parents to help them have a nice distraction.\r\n\r\nAwesome human being, very open, caring, and altruistic. I can't stop singing her praises, she's the best.", "rating": 5, "expected_grade": "", "created": "2021-11-19T19:40:19Z"}, {"professor": "Alison Burns", "course": "CPMS225", "review": "There are not enough words to describe how great of a professor and person Alison is! You truly will not find a professor on campus who is as caring, thoughtful, and genuinely kind as her. She goes out of her way to develop individual bonds and connections with each of her students and always checks in and keeps up with what her students are doing outside of class. Very supportive and goes above and beyond for her students, and we love her for it!! I've had her as a professor since my first semester of college, and am going to miss seeing her every week, next semester when I won't have a class with her anymore.", "rating": 5, "expected_grade": "A+", "created": "2022-12-03T01:45:15.040423Z"}, {"professor": "Alison Burns", "course": "CPMS225", "review": "So incredibly sweet and caring, she really is so kind and wants to get to know each of her students well!", "rating": 5, "expected_grade": "A+", "created": "2022-12-12T03:35:14.458489Z"}, {"professor": "Alison Burns", "course": "CPMS100", "review": "Sweetest professor you'll ever meet. Literally went to a play with her. Always concerned with you as a person, not just a student. Easy grader and one of the nicest professors I've ever met.", "rating": 5, "expected_grade": "A+", "created": "2022-12-16T05:49:49.392920Z"}, {"professor": "Alison Burns", "course": "CPMS100", "review": "As a class, it is one of the most chill classes with not much work. In order to make the most out of the class, it is crucial that you are active during discussions. As a professor, Prof Burns absolutely loves connecting with her students and has the biggest smile. If you are struggling with anything, be sure to reach out to her as she genuinely cares.", "rating": 5, "expected_grade": "A+", "created": "2022-12-28T04:19:36.901119Z"}, {"professor": "Alison Burns", "course": "JOUR360", "review": "This class is pretty relaxed. If you put in moderate effort this class shouldn’t cause you any trouble. Burns is nice and gives plenty of time to make up work if you need it.", "rating": 5, "expected_grade": "A-", "created": "2023-05-13T20:59:00.306493Z"}, {"professor": "Alison Burns", "course": "CPMS100", "review": "If you decide to join Scholars I would definitely join Media Scholars just because of how chill and kind of an environment it is, I have heard from all my other scholars friends and upperclassmen that Media is by far the most relaxed, and I have a feeling much of that comes down to the professor. Alison is such a caring person and is very receptive to any life events or stress you may have, if you're being bogged down by other classes, have outside life events interfering, etc. she will almost always give you an extension or even excuse the assignment entirely. Most assignment deadlines are more like suggestions than hard rules, and the assignments themselves are usually just attending some group activity (they really want you to bond lol) or reflective discussion post. Super great as a professor and person", "rating": 5, "expected_grade": "A+", "created": "2023-12-14T14:30:23.895964Z"}, {"professor": "Alison Burns", "course": "CPMS225", "review": "Literally sweetest and most caring professor at umd and makes her classes as easy as possible!", "rating": 5, "expected_grade": "A+", "created": "2024-01-03T16:45:24.536300Z"}], "name": "Alison Burns", "slug": "burns"}