{"courses": ["CHEM131", "CHEM272", "CHEM131S", "BCHM463", "CPSP218L", "CHEM271", "CHEM131", "CHEM272", "CHEM131", "CHEM135", "CHEM272", "CHEM131", "CHEM135", "CHEM272", "CHEM271", "CHEM272", "CHEM271", "CHEM272", "CHEM135", "CHEM272", "CHEM131", "CHEM131", "CHEM272", "CHEM131", "CHEM272"], "average_rating": 4.0882, "type": "professor", "reviews": [{"professor": "Amanda Schech", "course": "CHEM272", "review": "garbage. pretends to care, but does not help, even when students actually reach out. does not show up to own office hours. ", "rating": 1, "expected_grade": "", "created": "2017-11-20T22:22:14Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "I really loved Dr. Schech, especially after all of the other bad chem professors out there. She is so sweet and helpful and I thought her lectures were easy to follow. Tests can be difficult and her labs are time consuming and hard (but not as bad as other chem labs I have taken). ", "rating": 5, "expected_grade": "A", "created": "2018-11-20T06:11:28Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "She's so funny and seems very sweet! However, lectures do move very fast, and sometimes she messes up on her own work in lectures and the TA has to correct her, which is bad when students are trying to learn the material. Tests are very hard. ", "rating": 3, "expected_grade": "A", "created": "2019-10-23T19:37:56Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "A very nice person! However, her lectures and practice tests are absolutely nothing like what you might see on exams. The exams are silly compared to your homework assignments.", "rating": 2, "expected_grade": "A-", "created": "2019-10-31T20:58:37Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "Do not take this professor if you are bad at chemistry. I have to retake this class because she didnt prepare you for the test besides the bare minimum. The TA is the only reason i didnt completely fail", "rating": 1, "expected_grade": "D+", "created": "2019-12-13T19:45:41Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "Fast paced lecturer. She sometimes gets confused as she is doing problems but this didn't happen often. She does lots of practice problems during lecture, but she does do them extremely fast. Exams were very difficult compared to the practice exams it was honestly a joke. She did make the final pretty fair and she curves well. 84% was curved up to an A-.", "rating": 3, "expected_grade": "A-", "created": "2020-03-24T23:37:19Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "131 didn't have that much work. The homework assignments were like once a week and took a hour tops. Clickers were mandatory and annoying but expected for a Chem Class so I can't complain. As for teaching, I actually thought she was a really good teacher. Never went to her personal office hours so can't really vouch for her as a person but she always seemed nice in class. Her exams are something else though, they often mix different concepts into one question and it can get really tough. She tries to make questions seem relevant to real life, but this in turn makes questions confusing and wording a bit weird. However, she gives the previous semesters exam which does prepare you pretty well, but you really have to know the material inside and out to pass her exams, can't just skim them (there's no multiple choice and bulk of her points are on long questions with multiple parts).", "rating": 4, "expected_grade": "A", "created": "2020-05-08T20:51:32Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "Solid professor. I was very unexcited to take chem and it was definitely challenging but if you prepare for her exams well (I did the practice tests, went through mastering, GSS, and did textbook questions) then you should be okay. She's a very nice person and is very accommodating. ", "rating": 5, "expected_grade": "A-", "created": "2020-05-12T18:38:00Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "Horrible professor. The lectures were fairly easy and the homework assignments were difficult but doable. The exams were 10x harder than what she prepared us for. The constant average was in the D range. I got a C in her class. When I applied the same strategies of work to orgo, I got an A. She is a trash professor, do not take her. She may appear nice but she isn't. ", "rating": 1, "expected_grade": "C", "created": "2020-06-15T14:11:47Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "Her lectures are informative and thorough. They cover a lot of material and she is good at explaining concepts. However, the lab experiments/reports require an ungodly amount of time to complete. Be prepared to pull all-nighters completing them throughout the semester. Also, the exams are very difficult. She plays with words and makes the questions very tricky, which is annoying, especially since the exams are timed and you barely have enough to rush through it. ", "rating": 3, "expected_grade": "", "created": "2020-10-27T07:17:49Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "Extremely condescending. Not helpful whatsoever during office hours, and her exams are much harder than anything covered in lecture ", "rating": 1, "expected_grade": "C", "created": "2021-04-16T04:17:22Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "A very nice professor and you can tell she loves what she does. However, the material we cover in lecture and on top hat does not reflect the exams. The exams are very hard. They have so many steps and people always run out of time. ", "rating": 2, "expected_grade": "C", "created": "2021-05-03T12:41:09Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "She's an amazing professor who is very passionate about the subject. I had Dodson for lecture and Dr. Schech for lab and Dr. Schech was the main reason why lecture was doable. Her lectures are straight forward and clear with a lot of examples. She also offers a lot of resources to ensure that we understand the lab. Her exams are decent if you study well. I had her during an online setting", "rating": 5, "expected_grade": "", "created": "2021-05-04T21:49:58Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "I had her in both CHEM131 and 272 and she's definitely one of my favorite chem professors. She's really engaging and approachable. Her exams were fair in my opinion and, for 131, they reflected the lecture and practice exams well (but not the homework, which just seemed to not really connect with the class at all). She does tend to talk quickly during in person lectures so I'd recommend recording them if you're someone that can't take notes quickly. For 272, she translated the course really well online and offered a lot of videos to help us understand the content. Her grading policies are also pretty on par with the rest of the chem professors.", "rating": 5, "expected_grade": "", "created": "2021-05-06T01:39:35Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "I had Dr. Schech for both CHEM131 (in person, Fall 2019) and CHEM272 (online, Spring 2021). For her ability to teach CHEM131, I was not that impressed. She would get confused in the middle of lecture sometimes and her TA would have to help her get back on track. Her exams were difficult but luckily it was an easy course. I was not looking forward to having to take her again for CHEM272, but I was pleasantly surprised with how this course turned out. Her lectures were very thorough and helped me get through both this course and the corresponding lecture component, CHEM271. Though the lab reports took a lot of time to complete, I am now an excel god. Her exams were still difficult, but I survived. So overall I’d say 3 stars for CHEM131 and 5 stars for CHEM272, which brings us to an average of 4 stars altogether. (Make sure you use proper error reporting when doing calculations like that...)\r\n\r\nP.S. Time passes really slowly during her lectures! ", "rating": 4, "expected_grade": "", "created": "2021-05-18T07:44:34Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "Great professor who truly cares about her students. Very approachable and will answer questions by email to help you out. But these lab reports take an ungodly amount of time to complete and I pulled all-nighters just about every week working on them. Praying for anyone who has to take CHEM272 because it truly was the most tedious class I've had to take at UMD", "rating": 5, "expected_grade": "A", "created": "2021-05-18T19:15:08Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "Dr. Schech's lectures are very helpful in providing the necessary background information and calculations needed for the lab. Her answers to email questions are pretty clear. Her answer on Piazza can be a little unclear and frustrating since she tells you to refer back to lectures a lot. The lab reports are the worst part of the class since they take hours (I took at least 4-5 hours on them) to complete since you have to analyze data and be very careful with significant figures. Overall, the materials were not hard but can be confusing sometimes. I suggest having a friend you know so you can ask quick questions about the lab and utilize office hours/Piazza/TA's and Dr. Schech's email. ", "rating": 4, "expected_grade": "", "created": "2021-05-19T21:21:49Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "One of the best lab professors I have had in my time at UMD. Her lectures are super straightforward and she is great at simplifying all the topics and making them understandable. Her exams were very fair and she actually gave reasonable practice exams in comparison to other professors (ex. I had Dodson for lecture, whose practice did not at all reflect exam content). The only thing that sucks is lab reports take an insane amount of time to complete (I got an A on every one but I spent probably 10-15 hours on each report), and you NEED TO ATTEND OFFICE HOURS. I cannot stress that enough- if you want an A, go to office hours!! Additionally, to prepare for exams make sure you redo all of the pre lab walkthroughs and other pre-lab materials, since she creates questions that are often very similar to those. Overall, I enjoyed this class and learned a lot, and felt I was fairly assessed for my knowledge. ", "rating": 5, "expected_grade": "A", "created": "2021-05-23T16:12:35Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "My friends said she's lit. ", "rating": 5, "expected_grade": "", "created": "2021-10-23T01:50:09Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "phenomenal lecturer; extremely organized; and probably the most fair tests I've ever seen in my entire life. Nothing is out of the ordinary or too hard and she gives you more than enough time for the exams. I've only had two midterms so far but for both of them I had 25 minutes remaining out of the 50 allotted to me. Anyone who says her exams are too hard are either dumbasses or they didn't understand the material. So long as you understand what's happening you'll get an A", "rating": 5, "expected_grade": "A", "created": "2021-10-29T19:26:39Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "Cannot say enough good things about Dr. Schech. She's a great lecturer, extremely organized, grades fairly, and is super nice! I took her for both gen chem labs and feel like I understood her material better than the actual lecture material. ", "rating": 5, "expected_grade": "", "created": "2021-11-17T17:43:23Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "Literally the best ever. She is super helpful and answers questions pretty fast. She really knows what she is talking about and makes the class 10x easier. The class isn't bad if you ask questions and watch the videos she posts. Also the mid term was super fair- everything we had learned.", "rating": 5, "expected_grade": "A-", "created": "2021-12-08T23:12:57Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "I enjoyed having Schech for chem. She's a great and engaging lecturer and she's very accessible outside of class. If you go to office hours she'll clear things up for you and she remembers names. Goes pretty fast like all the other chem classes but I would disagree with the other reviews saying that her tests were super hard. As long as you studied well (she gave us old exams and GSS sessions) then you should be fine. You need to fully understand the material to get a good grade on the tests. Cons are that we needed to pay to get our homework and grades were pretty test dependent. Had clicker questions but those were graded by completion. Curves are totally based on how well the class does overall on the tests. My class is currently graded by the regular grading scale (93 and up is an A) because we've been having good test averages (~70%) but we haven't gotten our last test back yet so it could be curved. I would recommend her for gen chem, coming from someone who did not take AP chem in high school.", "rating": 4, "expected_grade": "", "created": "2021-12-09T21:11:45Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "If you are a transfer student and asked to retake the lab course of Gen Chemistry II, I would recommend you retake CHEM271 as well. The CHEM272's lecture really only covers the procedure of the lab as well as related calculations for the lab report. But on the exam, there will be unfamiliar questions that she never really went over nor was it on the lab report. The prelab walkthroughs and the exam reviews are helpful but it does not cover the whole content of the exam.", "rating": 3, "expected_grade": "", "created": "2021-12-16T02:14:12Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "Dr. Schech is an amazing professor 10/10 recommend. She is very passionate about chemistry and teaching and it shows in her class. During lecture, she explains concepts clearly, although quickly, but makes sure everyone’s on the same page. Homework and reading are given weekly and they are manageable. There are three exams that are given during lecture. They were a time crunch but very similar to past exams she provides. The final was harder.and we weren’t provided a practice exam. Discussion was not very helpful - GSS was more useful. Nonetheless she is super caring, energetic, and a great communicator. Overall, Dr. Schech is a great choice for CHEM131, especially if you do not have a strong background in chemistry.", "rating": 5, "expected_grade": "", "created": "2021-12-22T13:25:39Z"}, {"professor": "Amanda Schech", "course": "CHEM131S", "review": "She was a wonderful teacher, I'm just bad at chemistry. All of her lectures were clear, she showed practice problems and worked through them with us. She answers even the dumbest questions with respect and clarity. She was always a little behind, so we literally learned a new topic the day before reading day, 3 days before the final, but you win some you lose some.  I hated discussion and went twice and it honestly made me more confused, so I say avoid it if you go to the first two and don't think it's worth it, but do definitely go to GSS, I found it very useful for this class. Her exams weren't easy, but they weren't the hardest exams on the planet. You HAVE to study every single thing you learned during that unit, and study it hard!!! Also, she does clicker questions, so if you enjoy skipping classes and watching them later, she's not for you", "rating": 5, "expected_grade": "C+", "created": "2022-01-11T02:25:58Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "Dr. Schech was honestly amazing. She was friendly and helpful and was very clearly passionate and knowledgeable about her subject. She was really kind and understanding and her lectures were always fun and well-prepared for. Her class was a bit of work but honestly less than the other professors at the time. Her exams were reasonable too.", "rating": 5, "expected_grade": "A", "created": "2022-01-18T21:06:40Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "Had her for lab. She is a very clear lecturer and makes her expectations pretty clear most of the time. It's a very tough class though in the sense that you really have to put a lot of work into it. Enjoy!", "rating": 4, "expected_grade": "A", "created": "2022-05-15T17:00:40Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "I'm sorry but this class was super disorganized and she made the exams harder than they needed to be/harder than the example problems she gave us in class. no wonder why the averages are usually low c's and high d's. we couldn't cover everything in class so we had to watch many pre-recorded videos on our own. she also taught us stuff the week of the final that was going to be ON THE FINAL which was okay, but the thing is, that stuff was 1/3 of the exam and she couldn't even go over all of the practice problems in class. she would put problems on the exam that are 10x harder and more complicated than what she taught us. don't get me wrong, she is super nice but she's just not a good teacher. you have to study really hard for the exams in order to do well. hw is on tophat which u have to pay for, and the questions r sm easier than the problems on the exam. ", "rating": 2, "expected_grade": "", "created": "2022-05-16T15:08:09Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "THIS CLASS REQUIRE SO MUCH WORK. but it is not impossible at all. UTILIZE TA office hours!!!!!!!!!!!!!!! also the exams are not worth much so its pretty fair that the weekly reports are so time consuming for a two credit class. you got this. expecting A-....?", "rating": 4, "expected_grade": "", "created": "2022-05-18T00:28:51Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "She's a nice teacher and her work isn't too much or hard either, but she just takes too long to teach and spends a lot of time answering unnecessary questions. I had no trouble understanding the material however in this class as she made the material very digestible and easy to understand.", "rating": 4, "expected_grade": "A", "created": "2022-11-26T05:48:11.932493Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Schech (pronounced like Shrek without the R, she says) is really good at explaining everything in an understandable way and not moving too fast even in an accelerated chemistry course. The homework was never too much, the tests were straightforward and clear representations of everything we had learned in class, and she always communicated about what was going on with the content in class and what would be on the tests.", "rating": 5, "expected_grade": "A", "created": "2022-12-05T19:44:22.435645Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "Schech is a nice person but the exams were hard and the lab reports took forever. Her lectures are very easy to understand but it only goes over the basics and the exams problems are much harder. Also, if you are a transfer student take chem271 as well. The classes go hand in hand and I would’ve done much better on exams if I had taken chem271. GO TO TA OFFICE HOURS. The office hours are very helpful and you will get better grades on the reports if you go.", "rating": 4, "expected_grade": "B+", "created": "2022-12-06T17:48:21.110899Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Schech is really nice and passionate about chem. Lectures are relevant and helpful although can be boring at times due to pace of material (sometimes way too fast, other times way too slow). Discussions were often very helpful and would def recommend going to those. Homework helped with concepts and never was too much. Exams were very fair and she gives plenty of resources to students (past exams, problems, notecard on exams, etc). Would def recommend.", "rating": 4, "expected_grade": "A", "created": "2022-12-13T21:35:10.285102Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Professor Schech is a great professor. She is able to break everything down and explain it in simple terms. She seems to really care that her students do well. She is very helpful in office hours and reachable via email. However, this class is hard so you do need to go to class, take notes, go to discussion, do your homework and discussion worksheets, and study. If you put in the effort to just show up to class and discussion and take notes you can easily get an A without having to do too much out of class studying because of how good professor Schech is at explaining things. She also allows you to use a notecard on exams which no other CHEM135 professors do. She also records her lectures which is nice. I definitely could have gotten an A but I decided to skip about 8 lectures and then not watch the lectures I missed until the day before the exam at 2X speed which definitely hindered my learning. If you go to lecture and discussion and do your homework you will do well in this class.", "rating": 5, "expected_grade": "B+", "created": "2022-12-24T07:25:38.245837Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Good lecturer but her exams are extremely hard. Practice exams were nothing like the actual exams.", "rating": 2, "expected_grade": "C-", "created": "2023-01-17T05:33:15.992506Z"}, {"professor": "Amanda Schech", "course": "CHEM131", "review": "Got a B+ in the class, which is okay. I think the practice exams were easier than the exams she gives out, but it is manageable. She is a really great lecturer and explains the concept really well. Even though I had forgot most of stuff I learned in high school chem class, she definitely explained it well enough to understand for students who don't have prior knowledge of the course.", "rating": 4, "expected_grade": "B+", "created": "2023-03-04T05:17:09.984892Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "I had Dr. Schech last semester and she was amazing!! Her lectures are very clear and if you watch them, you will do well on your post labs. I watched her lectures, reviewed her modules, and looked over her practice exams do review for the midterm and final. If you really put in the effort, you can definitely do well. I also attended a few office hours a week to go over the post labs which helped me a lot.", "rating": 5, "expected_grade": "A+", "created": "2023-04-05T17:51:37.175498Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "She is such an incredible professor. She's super engaging and you can tell she cares about her students. Her exams are fair, her content is easy to follow, and the overall applications of the chem content are so interesting. She really values us learning the content in a cool, interactive way. I enjoyed this lab more than any other lab I took in my two years at UMD so far. If you're nervous for CHEM272, don't be. She creates the class in a way to ensure that your grade is entirely based on the work you put in, which I am so appreciative of.", "rating": 5, "expected_grade": "A-", "created": "2023-04-09T05:03:32.701645Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "I had Schech for CHEM135 Fall 2022, she is a very passionate teacher who you can tell cares about teaching chemistry from her lectures. During class she takes the time to explain things thoroughly, but also records all of her lectures and makes them available on her class page. She has pretty fair exams and allowed us to have a note card, the only negative I can think of is the final felt disproportionately hard. However I think the homeworks and lecture videos generally are enough to understand the topics. Overall probably one of the best professors I have had.", "rating": 5, "expected_grade": "B+", "created": "2023-04-20T23:31:45.425771Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "I had Schech for CHEM131 (Gen Chem I) and again for CHEM272 (Gen Chem II LAB) and she CARRIES the UMD chem department. She's kind, understanding, and super approachable. I love her so much I wish she taught all chem classes.", "rating": 5, "expected_grade": "A-", "created": "2023-05-05T01:48:00.343160Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Good professor, goes a little fast sometimes but clearly knows what she's talking about and is passionate about what she teaches. Her exams were fair and she allowed a notecard for both the midterms and final, so that definitely helped a lot. If you are like me and really struggle with chem then this class will definitely be a challenge. There are homework assignments, they are a little annoying but definitely help you learn the material and also raise your grade. TBH I didn't do most of the hws and really regretted that, so learn from my mistakes and don't be like me. Overall though, solid professor and the class is definitely manageable even if you struggle in chem as long as you put in the effort and don't fall behind.", "rating": 4, "expected_grade": "C-", "created": "2023-05-05T18:16:44.515434Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "I am not very good at chemistry. I will likely be getting a C in lecture. However, I found lab much easier and will likely have an A or A- after the final. I only went to the first lecture for lab and never went again. She uploads the notes to ELMS and records the lecture, and I found that those were the only resources I needed to do well in the lab. I had an excellent TA and found good TAs to attend for office hours that made the post-labs easy. The midterm was also very fair compared to the midterms I took for gen chem 1 lab, orgo 1 lab, and orgo 2 lab. If you just pay attention to what you're doing in lab and actually have a basic understanding of the purpose of each lab, you'll do fine. A lot of people do poorly because they go into lab clueless and wait for another group member to tell them what to do. Just read the prelab, talk to your TA if you have questions, and you'll be fine. The post labs for this class took significantly less time for me than the post labs for orgo 1 and orgo 2 labs too.", "rating": 5, "expected_grade": "A", "created": "2023-05-10T00:31:11.605764Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "This lab might be more work than usual, but she is the most fair chemistry lab professor out of ANYONE. she provides resources for the midterm and the final as well as resources for all the lab reports. She also is readily available during her office hours... I would highly recommend going for help on reports.", "rating": 5, "expected_grade": "", "created": "2023-05-16T01:06:16.070654Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "Of the 4 chemistry labs I've taken so far, Dr. Schech's was the best out of all of them by a mile. She makes sure the modules are understandable to the students, it is just recommended that you do them with time because they are a bit time-consuming. She was very approachable regarding office hours and seemed like she wanted all the students to succeed. Her exams were also very understandable, studying actually gave you a chance to get a good grade, which was definitely not the case for the other chem labs when exams were still a thing. If you are worried about this lab, don't be, it'll be fine as long as you put enough time into the class and study, as well as using office hours when you can.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T01:26:36.190473Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "HANDS DOWN THE BEST CHEM LAB PROCTOR AT UMD. Dr. Schech did not make this class more difficult than it needed to be. Lab reports were fair and doable, the midterm and final was fair (with averages being a C+, like when have you ever seen that for a chem lab midterm or final), and a curve that pretty much guarantees you get credit so long as you turn in your reports. In addition, she is extremely accessible, actively answering questions on the Piazza board, and responding to emails. I wish she taught lecture, I love her teaching style. Hopefully they don't ever take her away from CHEM272, she really shines here.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T18:53:33.953879Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "She is a good professor who really attempts to make you understand exactly what is going on instead of just attempting to make you memorize. Her and Dr. Griffith split class time throughout the semester. Lectures are recorded but I would recommend going to class as the learning experience is much better. Exams can be tough but if you practice the discussion worksheets and the lecture group worksheets you will be better off as they often sneak replicas of these questions into the exams. Also, if your grade is slipping I wouldn't be quick to withdraw as the curve at the end of the semester is substantial.", "rating": 5, "expected_grade": "B-", "created": "2023-05-18T15:01:50.266298Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Insanely good! She is so nice and welcoming, writes fair tests, and teaches AMAZINGLY. This course is obviously hard, and most students are doing it for the requirement, and she acknowledges it. I would have gotten a C with any other teacher. The slides are really detailed, she knows when to work through problems with us versus just showing us the information on pre-made slides. She answers all questions students ask, even if it is cutting into time she needs to teach more information. She provides practice exams and exam tips, and sends out an email about two days before the exams saying the broad topic each question will be with how many points. All questions on exams are clearly related to what we learned in class, so just make sure you are listening and study before exams (I personally do all of the textbook problems she recommends from the syllabus for the topics that will be on the exam). She grades SUPER quickly, like in three days for regular exams, and literally just one day for the final. The curving is fair. Also, what is really good about this class and how it is taught is that the topic we learn are not just chemistry topics on their own, but how they apply to things us engineers may actually use, like combustion engines, batteries, biodegradable stitches, solar panels, and for wastewater treatment.", "rating": 5, "expected_grade": "A", "created": "2023-05-21T20:34:07.319856Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "Amazing lab coordinator. Exams are extremely fair. She holds review sessions before exams and lots of information covered in those are directly applicable to the exams. Lab reports are long but doable. Very approachable and energetic. She's also a great lecturer and I have learned a lot after having Dr. Schech for both CHEM131 & CHEM272. Obviously passionate and cares about her students. Highly recommend.", "rating": 5, "expected_grade": "A", "created": "2023-05-22T01:29:49.601307Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Professor Schech is brilliant and absolutely a sweetheart. She tries to make everything relevant to us, and is very receptive to questions and really wants her students to understand the material. She's great with emailing in a timely manner and the tests are very fair. Her PowerPoints can be a little dull, but that's also because I had to take the class and have no interest in the content of chemistry. I would highly recommend if you are nervous about the class.", "rating": 5, "expected_grade": "A", "created": "2023-05-29T20:48:15.509211Z"}, {"professor": "Amanda Schech", "course": "CHEM271", "review": "Unfortunately, the first time I took CHEM271 I barely passed. This time around I had Dr. Schech, and it didn't take long for me to realize that she is absolutely the best chemistry lecturer I've ever had. Her lectures are incredibly organized and she records them so you can watch them over or catch up if you miss class. She is super thorough in her explanations and often engages with the students so it's hard to doze off. Honestly, I often get bored in chem lectures but the way she presented the information was genuinely interesting at every moment. On top of the discussion worksheets and homework, she also posts recordings of her going over extra practice problems that are incredibly helpful. The exams were fair so as long as you do the practice problems/homework and understand the nuances of the concepts (which are explained in lecture) you should do well. She also responds to emails quickly!", "rating": 5, "expected_grade": "A+", "created": "2023-08-19T06:01:41.233539Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "I think the best part about Dr. Schech is she actually sounds like she wants to teach and isn't monotone during her lectures. She does a pretty good job breaking down the information in the lectures and how to do all the calculations. I don't know if she does it for every semester, but she recorded lectures as well which is a huge benefit for people who can't process/understand everything during the initial lecture. Lab reports take a while and have a ton of calculations, but she grades fairly and the exams are also pretty fair if you just understand the study guides and optional pre-lab walk throughs for each lab report. She also showed her face a couple times during our actual lab portions to check up on if the labs are going well which is pretty rare from a lab coordinator TBH. Also, she understands that not every lab is gonna go perfect so she cares more about the process/calculations behind our answers and not always necessarily if our data is correct. Overall, the class is a lot of work but as long as you just go to or watch the lectures as well as do the optional pre-lab walkthroughs you should be able to understand everything as well as do good on the exams.", "rating": 5, "expected_grade": "A-", "created": "2023-08-21T20:55:56.081891Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Online homework is nothing like the exams, some of the slide presentations are rushed (too much information at once)", "rating": 1, "expected_grade": "W", "created": "2023-08-28T18:00:09.150363Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "Dr. Schech is THE gem of the chemistry department. She cares so so much about her students and tries to relate to us as much as possible. She is incredibly understanding, and while she does have to follow some strict guidelines because of our lovely chemistry department (i.e. maximum 3 lab absences), this course would be unbearable without her. The labs are very easy especially if you've survived Organic Chemistry labs. It's relieving. Lab reports take some time. Start early, go to office hours and ask questions on Piazza, you'll be fine. Midterm was very similar to the one she posted on ELMS. No curveballs. Shoutout to my awesome lab TA, Noor. She was very helpful through it all, too :D.", "rating": 5, "expected_grade": "A", "created": "2023-11-28T15:31:54.355769Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "I absolutely hate chemistry and am only taking it to fulfil a requirement, but Dr. Schech is super nice and very good at explaining topics in chemistry that I had a hard time trying to understand prior. She posts all her lectures online which are very helpful when trying to review, and even cuts them down to make them shorter! She also posts past exams for midterms and the final which are very helpful! Right now, we are a bit behind and are rushing through the last few modules, the exams are difficult but if the class average goes too low she will curve, and the homework isn't really representative of everything we do in class or the exams, but the rest of the class is great! I'd defintely recommend taking Dr. Schech for CHEM135!", "rating": 5, "expected_grade": "B-", "created": "2023-12-01T18:09:32.313706Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "This might have been one of the more frustrating labs I have been in, nearly impossible to get 30/30 on lab reports when when take off petty .25 for missing work or sigfigs. If I did not need this class for my major so I would not recommend it if you don't need it. The teacher seems very sweet but that does not reflect your grade what so ever. This lab is the only lab in the chem department that still have a midterm and final. Makes u think why Orgo 1 and 2 got rid of them, maybe because they are irrelevant.", "rating": 1, "expected_grade": "A-", "created": "2023-12-11T18:47:38.315831Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "I feel biased because I took AP Chem and would have done well in the class either way, but I genuinely do think Dr. Schech is a great lecturer who gives a lot of resources to succeed. She's very passionate and knowledgeable about the topic and tries to make lectures as interesting as possible. Definitely not someone who drones on, so I would say its easier to follow what she's saying. Her format for drawing complicated diagrams and doing calculations on the screen while she lectures is really helpful. She posts lecture slides and recordings after every class which is a LIFESAVER. She's also very responsive to questions that you ask her in/after class or at office hours and will continue to work with you after class/in office hours until your confusions about the content are thoroughly answered. She also posts old exams which are probably the most helpful resource to study with. She's reasonable and cuts content from lectures/exams if its clear that we're not going to get through all of it, and says she will curve exams if needed. I think if you are nervous about this class or it's your first time learning chemistry Dr. Schech is definitely a solid choice for CHEM135. Only complaint is that the pacing of the content was rushed towards the end of the semester.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T03:30:53.148012Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "CHEM135 historically has been extremely poorly taught -- primarily on purpose, it's a weedout. Professor Schech makes the topics", "rating": 5, "expected_grade": "B", "created": "2023-12-21T09:52:21.082705Z"}, {"professor": "Amanda Schech", "course": null, "review": "(Sorry mods for that last one)\r\n\r\nCHEM135 historically has the reputation of being THE weedout class. In my semester (Fall 2023), Professor Schech was working on a new way of teaching it. She's someone who's genuinely passionate about chemistry, something that's hard to blend into engineering lectures of this nature. The passion showed no matter where you were in the room. She's also just generally approachable, and while the class sizes make it hard to have a conversation, my interactions with her were pleasant.\r\n\r\n...That being said, there are some things to note. Some of the engineering-specific portions of each unit weren't taught with too much clarity, we ran behind schedule, tough for the engineering portions which notably don't go off the textbook. It's something that'll hopefully be fixed up with the next semester. On the whole, despite those critiques, I enjoyed her class a lot and would strongly recommend taking her (if you need the credit, of course.)", "rating": 5, "expected_grade": "B", "created": "2023-12-21T09:59:30.251890Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "This is one of the hardest labs you will have to take, but it is mainly hard in terms of how time-consuming labs can be. She basically gives you pretty much all the resources you need to work through lab in her very efficient 50 minute lecture, and outside of that if you are having questions (pretty much anything!) or your data did not turn out as expected to complete the lab, go to office hours. The midterm and finals are designed to test your knowledge on the subject. So, if you understand why  and how certain labs were done, you should be able to figure everything out. Extremely organized everything-lectures, Canvas modules... this is  a class where you can genuinely earn the grade you aim for with effort, and Dr Schech is a great, kind and extremely reasonable professor.", "rating": 5, "expected_grade": "A", "created": "2023-12-23T06:59:36.657839Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Great professor, she's very enthusiastic about teaching chemistry and tries to make it easily understood. There isn't too much homework compared to mignerey and griffith. The tests weren't that bad and the averages were around 70s to close to 80. She posts all her lectures online, but there are clickers so you should go to class. Overall amazing professor, would gladly take again.", "rating": 5, "expected_grade": "A-", "created": "2024-01-03T21:28:15.201993Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Dr. Schech is the best CHEM135 teacher hands down. She teaches with enthusiasm and enjoys teaching. She cracks jokes and tries to make everything relatable. Her lectures are easy to follow and she posts recordings of all of them online. She'll answer all questions even if it takes up half the lecture, and she's super helpful in office hours. Her exams were straight forward and she posts practice tests before each exam. She will curve the class if the average is bad, but it was much higher than the other chem classes so I'm not sure if it was. Overall she was a great teacher and a very nice person.", "rating": 5, "expected_grade": "B+", "created": "2024-01-18T20:04:33.674610Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Sometimes I feel like she never really gets to the main point with her lectures and presents an overwhelming amount of information on the slides at once and rushes through them making it hard to follow along. I used the homeworks and the previous exams to prepare for the midterms. Overall she's a great person, she really cares about her students and posts extra practice when people ask. She also answers questions towards the end of lecture and records her lectures. She curves the final grade pretty reasonably.", "rating": 4, "expected_grade": "B", "created": "2024-01-19T18:18:27.635534Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Schech is pretty good at what she does. She is very approachable during office hours and answers questions during class. Her exams are harder than the content taught in class and practice exams, so make sure you study the material deeply. The TAs for discussion vary a lot however, so you may find discussion to be unnecessary especially since there are no quizzes for the class.", "rating": 5, "expected_grade": "A-", "created": "2024-01-26T02:32:12.577472Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Took 135A last semester. I fully expected to make at BEST a C ~ >= 75. It was a hard class, it didn't help that we had multiple Chem. Eng. in the class so the curve disappeared. I will say that Schech did do a good job at teaching and lecture. The Exams were not a direct reflection of that. You will have to read your book and review it. A lot of times she will tell you in class don't worry about this **special rule or situation and that would be what would be on the exam. She wouldn't even subtly remind you to remember it so anytime there are crazy exceptions then take it as gospel that you will see it on an exam somewhere. The review she posted does help for the most part; if I had to tell someone the % of it that shows up via exams it would be 40/60. (40%) of the exam review will showcase similar type of problems covered on the exams. I went to AMP hours multiple times to get questions answered and they had a harder curriculum than 135A and they were sometimes lost at why this would be taught so so early. TAs for discussion was really just practice problems so if you are actually following along with the book this was very helpful. \r\n\r\nI barely passed with a C-. every test was hard. Didnt make higher than 68 on pretty much every exam.", "rating": 3, "expected_grade": "C-", "created": "2024-01-31T17:51:12.983257Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Dr. Schech was an amazing professor. She understood all of what she was teaching and that was very obvious. If there was a question that she did not have the answer to, she would do research on it and get you the answer as soon as she could. In addition, she is very understanding to students with accommodations and is willing to work with them to figure out what is best. Chem135 overall is a challenging course, however I do not think I would have done nearly as well with a different professor. You cover a lot of content in a very little amount of time, so attending office hours is extremely helpful. In addition, by going to office hours she gets to know you as a person which is a quality not many professors have. Dr. Schech literally set up a friendship making event for her classes so she could get to know her students better. Overall I felt like her exams were reflective of what we covered in class and were similar in rigor to the practice exams she presented us with. I highly recommend Dr. Schech's class.", "rating": 5, "expected_grade": "A", "created": "2024-02-13T21:34:50.725524Z"}, {"professor": "Amanda Schech", "course": "CHEM135", "review": "Dr. Schech is an enthusiastic professor and it was enjoyable to learn from her. The course redesign incorporated engineering applications very well and Schech's teaching style made most concepts easy to understand.", "rating": 5, "expected_grade": "A-", "created": "2024-02-14T16:25:54.417615Z"}, {"professor": "Amanda Schech", "course": "CHEM272", "review": "Very inconsiderate. Tried to ignore excuse notes for sickness and takes off points for conceptually meaningless busy work.", "rating": 1, "expected_grade": "A+", "created": "2024-02-15T19:17:51.902756Z"}], "name": "Amanda Schech", "slug": "schech"}