{"courses": ["BSCI353", "BSCI454", "PSYC309I", "PSYC409", "PSYC489R", "NEUR305", "PSYC489P", "PSYC207", "PSYC300", "PSYC417", "PSYC302", "NEUR479", "NEUR305", "NEUR305", "PSYC300", "PSYC302", "PSYC409", "NEUR305", "PSYC207", "PSYC431", "PSYC302", "NEUR305", "PSYC300", "PSYC302", "PSYC409", "NEUR305", "PSYC207", "PSYC431", "NEUR305", "PSYC300", "PSYC302", "PSYC409"], "average_rating": 3.5152, "type": "professor", "reviews": [{"professor": "Amanda Chicoli", "course": "NEUR305", "review": "Dr. Chicoli is not like any other professor at UMD. She was constantly making sure that we were doing okay when crazy things were happening over the semester in the outside world. She was extremely understanding and caring and flexible when it came to our circumstances and even those that were not in our control. She also disseminated information that was relevant to psych/neuro that we may be interested in. She was also really organized with all of the material when teaching an online class. The way the course topics were broken up into (memory, emotion, motor, etc) also followed the order of the chapters in the book. Also, many of the graphics and information that were presented in the lecture were also taken straight from the book. For these reasons, I would recommend using the book as a supplemental resource to look at things that you did not understand from the lecture. We had three exams that were pretty easy and were not a big chunk of your grade. We had about four reflection assignments in which we had to either watch or read about something and write a short (about a page) answering some questions on the rubric that was mainly opinion based. I really enjoyed these because the topics were on things like ethics and racial issues in the field of neuroscience. Every Friday we had synchronous classes in which we usually spent the time going over a research article either in groups or as a whole class. There were low-stake assignments accompanied by these that we completed during the class. The most important thing to take note of is the semester project. There is no final exam in the class it is just your final project. This can definitely take a big punch to your grade as it did mine. Make sure to put effort into it early on in the semester so that when it comes time to your final, it will be one less thing to worry about. Dr. Chicoli has set it up in a great way in which she breaks down the project into different parts that have different deadlines. This way, you are working on it slowly throughout the semester and when it comes down to the final you don't have to stress. I had an A+ the entire semester but was so crammed during finals week that when I was working on the final project during the allotted two-hour window, I did not finish one part of the project in time. I scored a 100% on every other part of the project but because that one part was worth a good amount of points, it bumped my final grade down from an A+ to an A. So I would definitely recommend not taking three finals back to back in one day and manage your time. Overall, I would absolutely recommend this class with Dr.Chicoli no matter the circumstance. The class may sound intimidating but the way that she has structured it and the way she is as a person is definitely catered towards student success. ", "rating": 5, "expected_grade": "A", "created": "2021-01-08T02:11:05Z"}, {"professor": "Amanda Chicoli", "course": "NEUR305", "review": "Dr. Chicoli is a great professor! I took her NEUR305 in Spring 2021 and was initially pretty nervous about the material and workload. Dr. Chicoli made the class engaging and manageable. She was very helpful in class and provided resources for us about academics, opportunities on campus, and support options. The semester project looked daunting but it really helped me with my understanding of the material. I met with her once to discuss getting involved in the neuroscience community on campus and she was so kind and helpful! 10/10 would recommend taking a class with Dr. Chicoli.", "rating": 5, "expected_grade": "A+", "created": "2021-09-23T13:38:26Z"}, {"professor": "Amanda Chicoli", "course": "PSYC302", "review": "DO NOT TAKE PSYC302 WITH DR. CHICOLI IF YOU ARE NOT A NEUROSCIENCE MINOR. This class was listed as one to take under theme 1 for psych with no prerequisite of taking any neuroscience class. Because of this, majority of the class had no background in 90% of the concepts she was trying to teach us. It is so hard to follow as the students in the class who are not neuroscience majors have no neuro foundations WHICH YOU NEED FOR THIS CLASS. The exams are extremely difficult and she grades fairly hard on our weekly assignments. After this semester Dr. Chicoli is considering adding neuro as a prerequisite due to the heavy confusion among majority of the students, but if it isn't added take this as your warning. Take any other theme 1 course. ", "rating": 1, "expected_grade": "C+", "created": "2021-11-08T21:03:36Z"}, {"professor": "Amanda Chicoli", "course": "PSYC302", "review": "terrible terrible terrible.  Lectures make no sense along with exams that are ridiculously hard, the average for both our first two exams was around a 64%. Does not listen to student concerns about class or exam, hardest psyc class I have taken at UMD and most unfair. If you do not have a background in neuroscience you will most likely fail. ", "rating": 1, "expected_grade": "", "created": "2021-11-18T19:13:04Z"}, {"professor": "Amanda Chicoli", "course": "PSYC302", "review": "You DO NOT need a neuroscience course to pass this class! I am expecting an A and have only taken PSYC100 previously. The course is a bit lecture heavy (with clicker questions), but half the exam is based directly off the weekly assessments which we can work on in groups or check in with her during office hours. Plus, Dr. Chicoli gives really thorough feedback on these assignments and goes over them in class. She was super responsive to student concerns and has given extra credit on all exams. Exams are one aspect of the grade, but there are also the weekly homework assignments, a mid semester project and a final project. The course material itself can be a confusing, but gets easier toward the end of the semester after hearing some of the same terms multiple times. Given how much some students have complained, she has still been really positive and engaging in class which I also appreciate!", "rating": 5, "expected_grade": "A", "created": "2021-12-08T01:47:21Z"}, {"professor": "Amanda Chicoli", "course": "PSYC302", "review": "Last review is EXTREMELY INACCURATE. You most definitely need a neuroscience background to even get a B+ in this class. Dr. Chicoli is overall nice but is not very responsive about student concerns. The reason why students have complained is because we are assessed on material that we either never learned, or is impossible to understand from not knowing the basics of neuro. Dr. Chicoli even said herself that it would be helpful to have a background in neuro after seeing the exam grades.  ", "rating": 1, "expected_grade": "C+", "created": "2021-12-14T03:32:48Z"}, {"professor": "Amanda Chicoli", "course": "PSYC489R", "review": "Dr. Chicoli is a wondering professor and human being. I've never left a review before but seeing the current posts describing Dr. Chicoli, I decided I had to come on and say something because some of these low-scoring posts are completely out in left field. She is one of the MOST responsive professors I've ever had, constantly asking for student feedback & actually implementing changes based on what we say. She explicitly spent 15 minutes in the beginning of class after exams reading & responding to reviews; she even changed the format of the exams each time to accommodate our request. Of all the profs I've had at UMD, Chicoli is one of the most understanding and caring ones. If you ask nicely in advance, you can even get an extension on assignments. I think she's flexible like this because yes, there are many low-stakes assignments that you have to keep up with weekly. But again, she understands this herself and is more than willing to work with you. She even said she'd meet with us 1-on-1 to talk over any material or assignment -- this is soo unbelievable nice considering how big the class is. If you have a chance to take Chicoli as a professor, you definitely should. Such a sweet person & great professor. ", "rating": 5, "expected_grade": "A+", "created": "2022-01-24T21:58:48Z"}, {"professor": "Amanda Chicoli", "course": "PSYC489R", "review": "This class is not too difficult, but Dr. Chicoli sometimes has an attitude with students that is hard to look past. She's accommodating sometimes, but she has a passive-aggressive nature about her that I just didn't like.", "rating": 2, "expected_grade": "", "created": "2022-05-02T15:31:55Z"}, {"professor": "Amanda Chicoli", "course": "PSYC489R", "review": "*This is 100% going to come off as a \"teacher's-pet-esque review\", but trust me in saying that I am the last person to ever interact with or speak to a professor unless a major concern comes about*\r\n\r\nI've now had Dr. Chicoli for two classes - PSYC489R and NEUR305. I genuinely have not met a more bubbly, enthusiastic professor than her. She cares about her content, and cares about the wellbeing of her students. I've dealt with some stuff over the time I've spent with her in these two courses, and she could not have been more accommodating. Time missed out of class? No worry - get back when you need to, here is the recording of the lecture. Just get me the proper documentation, and your assignment that you miss that morning is extended for a day. This is hard to come by, especially being a STEM major. I also have an extracurricular that takes up A LOT of my time; simply by letting her know that there may be conflicts in the future went a LONG way with her. Like other reviews have stated, and as I did earlier, she really really cares about her students.\r\n\r\nThe content is sometimes tricky, as with every upper-level PSYC or NEUR class you'll have at UMD. She makes the lectures more than manageable, presents the information (for the most part) in a concise manner, and her exams are NOT \"brain-killers\". She emphasizes what we need to know, how to make the connections to other material, and her activities associated with each week help tie the content in to real-world application. \r\n\r\nI could not recommend her for these two courses more. She has been by far one of my favorite professors here. ", "rating": 5, "expected_grade": "A", "created": "2022-05-09T05:28:58Z"}, {"professor": "Amanda Chicoli", "course": "PSYC207", "review": "This is a pretty tough review to write cause I have such mixed feelings. I like Dr. Chicoli she's really nice and considerate but I think this course's content was a hassle, not just because she didn't have a TA and had to do everything on her own but because ik the concepts can be kinda hard to provide examples for. She did her best to relate it back to real-world topics but I think she got distracted with how much she was personally interested in the topics and how much she knew about them and then couldn't figure out how to explain them in simpler terms. Exam questions were a little confusing but she grades fair and you can definitely talk to her to consider a regrade. Not much reading, group project at the end is make or break depending on your group members. Weekly summaries and couple opportunities for extra credit. Overall the class has potential I'm just sad I had to take it as a first-timer.", "rating": 3, "expected_grade": "A", "created": "2022-05-12T00:55:28Z"}, {"professor": "Amanda Chicoli", "course": "NEUR305", "review": "GENUINELY AMAZING. BEST PROFESSOR EVER. SHE ACTUALLY WANTS HER STUDENTS TO SUCCEED.... AND IN STEM!!!!! there are a lot of assignments so get ready to work, but it really helps your grade so be appreciative. USE THE WRITING CENTER. Her exams are pretty fair and her lectures are SOOOOOO interesting. BEST TEACHER AT UMD. you actually learn. ", "rating": 5, "expected_grade": "", "created": "2022-05-18T00:31:30Z"}, {"professor": "Amanda Chicoli", "course": null, "review": "BEST TEACHER EVERRRRRRR. CARES ABOUT HER STUDENTS. there's a lot of work, so be prepared but it will help your grade. use the writing centre. she actually helps you learn. fair exams. SUCH interesting lectures. BEST UMD PROFESSOR!!!!!!!!!!!!!!!!!!!!!!!!!!!! I have never had such an approachable and genuine STEM teacher. ", "rating": 5, "expected_grade": "", "created": "2022-05-18T00:33:00Z"}, {"professor": "Amanda Chicoli", "course": "NEUR305", "review": "Took neur305 with her last semester and it was one of my favorite classes!!! Dr. Chicoli's professionalism is greatly complemented by her positive, affable, and engaging personality, meaning (personal opinion) I was able to reach out for help when needed and engage in discussions with her. She truly wants her students to succeed, which is a big reason why she often holds discussion sections for some of her courses. Some students think that \"active learning sessions\" are a bit of a time-waster but it was very beneficial to my understanding of the concepts by being able to work through the concepts in a different manner aside from the lecture slides. She allotted us one hour each week to work with peers and teaching staff to answer and understand the assigned questions. If you're looking for \"an easy class\", Dr. Chicoli is not a very easy grader. In light of this, she comments on your submissions and provides actual constructive comments that point out areas that you (student) may need to focus/brush up on, allowing you to really build a knowledgable foundation of the course that can be used in future courses instead of just learning the material for the grade. If you genuinely want to learn and retain the information, I would highly suggest taking a course with Dr. Chicoli. If you find yourself to be struggling in the course, Dr. Chicoli is always willing to work with you and provide you the resources to succeed. If you're looking for an easy A, you might want to consider other options.   ", "rating": 5, "expected_grade": "B+", "created": "2022-08-09T01:29:28Z"}, {"professor": "Amanda Chicoli", "course": "NEUR305", "review": "Great professor overall. She records her lectures to make reviewing the material easy and had us read some pretty interesting articles. The midterm and final projects were a bit time consuming but since they are due before the next exam, you are really familiar with the material by the time you take the test. We also had a lot of freedom when it came to choosing our topics for the projects so that was nice! She provided a couple extensions for me when I was sick and basically said to turn it the work whenever which was cool.", "rating": 5, "expected_grade": "A", "created": "2022-11-10T00:15:47.814910Z"}, {"professor": "Amanda Chicoli", "course": null, "review": "really passive aggressive at times.... often makes it difficult for you to reach out to her or sometimes even ask a question. I mean we're all trying to learn here.. Wish she'd make herself more approachable and show students some courtesy.", "rating": 3, "expected_grade": "", "created": "2022-11-30T14:44:14.546485Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "Dr. Chicoli has VERY HIGH expectations of her students. The class content is excessive, even for a 4-credit course, and will easily require 5-6+ hours outside of class per week. Dr. Chicoli does little to help students through this process and often makes things more difficult with publishing graded assignments day-of to complete. Dr. Chicoli is also extremely inflexible and condescending for extensions or absences. Anytime I needed an extension, I felt belittled and upset after talking with her. I would not recommend taking this professor.", "rating": 2, "expected_grade": "A-", "created": "2022-12-04T14:52:26.623968Z"}, {"professor": "Amanda Chicoli", "course": "NEUR305", "review": "I barely studied for her class because of how cohesive her lectures were. Paying attention in lecture was more than enough. Without a doubt, she is a great professor. She is a fair grader. All of her assignments are straight forward and she's more than willing to help.", "rating": 5, "expected_grade": "A+", "created": "2022-12-21T00:30:24.747371Z"}, {"professor": "Amanda Chicoli", "course": "NEUR305", "review": "Generally a straightforward class but sometimes instructions are unclear. She generally works with students but can sometimes be rude, especially over email. The main issue with this class though is the TA had no neuroscience background and graded incredibly harshly. Overall an okay class but just be prepared to know everything even if she specifically says she will not test you on it because she will.", "rating": 3, "expected_grade": "A-", "created": "2022-12-23T20:53:03.865401Z"}, {"professor": "Amanda Chicoli", "course": "PSYC302", "review": "Very content heavy class that has a lot of new vocabulary and easily mixed-up material. She did provide many open office hours (even reserving a room in the same building right after class) and in class review time, which was very helpful for studying for exams. Exams have multiple choice (which was on the difficult side due to wide range of topics discussed and knowledge of both content and application) and short answers that were mostly taken directly from weekly assignments. \r\nLectures themselves are content heavy, but learning outcomes are clearly stated for every lecture so creating a study guide is not too difficult. Dr. Chicoli was always willing to answer questions, both in class and office hours. In class, I do understand how people thought she could come off as “passive aggressive,” as she would sometimes expect students to have perfect understanding of smaller topics, topics from a few lectures before, or topics they had  just learned. However I took the “passive aggressive” ness more as frustration with not communicating. In short, I would take this class if you knew you could dedicate a good amount of time to either studying (especially before exams) or going to office hours.", "rating": 4, "expected_grade": "A", "created": "2022-12-26T14:51:42.793840Z"}, {"professor": "Amanda Chicoli", "course": "NEUR305", "review": "Really, really good prof. She's hard but fair. She provides you with SO many resources that you should use to do well in the class. the course itself is very interesting and if you ever have any questions she's always available to answer them. Of all the professors I've had at UMD, she is the only one I can confidently say will email you back within the day or at least 24 hours, no matter what for. below are some bullet points\r\n\r\n- take notes in class and read over the textbook briefly for a better understanding of the topics. sometimes for the exams you need a little bit more of an understanding than what is on the lecture slides\r\n- go to class and ask questions. interact with her more than once or twice and she'll learn your name hands down. ive gotten to know her a lot and it truly feels like a person-to-person teaching experience. \r\n- if you are struggling on a topic... just ask her to explain it again in office hours or after class, she won't bite, and she's not mean. she will gladly explain it to you because she really does love the material. \r\n\r\nTips I wish I knew starting out that I use now:\r\n- for content, maybe break it into categories such as... Anatomy, function of each area discussed, pathways/circuits, and pathology. these are the main groups of information she gives you. the act of active-categorization is also proven to be one of the top learning methods (just google scholar active-categorization if you want a reference)\r\n- use anki or other active recall methods like quizlet. im telling you do NOT JUST READ OVER NOTES for these exams. I did for the first one and didn't get a good grade, but did on subsequent ones by using anki. a side note if you want a leg up on some exams is to make sure you use the practice quizzes that she provides you, just do it you'll see why. \r\n- you dont need to study every single day, but several times a week is probably a good idea as you have exams basically every 3 weeks. \r\n- ASK QUESTIONS ON THE MIDSEMESTER PROJECTS AND SCHEDULE APPTS TO GO OVER WHAT YOU HAVE. I misread the rubric on the first project and got a C, it was bad. but for the second I made an appointment with a TA to review it a day before the deadline and it turned out much better. \r\n- take time to actually understand every single graph or picture she gives you, especially the ones that involve an experiment. they will be on the exam in one way or another trust me. \r\n\r\nBasically she's a really good professor, just make sure to connect the dots on your own, and do work outside of the class. it's a 3 credit class so expect to put in around 3-5 hours of work outside class a week minimum including assignments and studying.", "rating": 5, "expected_grade": "A-", "created": "2023-04-20T12:20:48.558666Z"}, {"professor": "Amanda Chicoli", "course": "PSYC207", "review": "Dr. Chicoli is such a bubbly and fun person. She so clearly cares about the content she teaches and wants to help her students learn. In particular, the content of this class is quite interesting and she knows it well, often getting excited about lots of little things we cover each session. She also uses online game simulation learning a lot, and while this is usually fun, sometimes the worksheets are a little confusing. Additionally, her class is not the most organized thing. On the bright side, though, you get opportunities for extra credit, not that much homework at all, and class is generally pretty relaxed and lectures are recorded to help with studying later down the line. Overall, I'd definitely recommend Dr. Chicoli for this class; it can be a bit confusing the way she's organized it but it's manageable.", "rating": 4, "expected_grade": "A+", "created": "2023-05-16T00:47:06.053927Z"}, {"professor": "Amanda Chicoli", "course": "NEUR305", "review": "Ngl was prob my least favorite class in conjunction to taking genetics and orgo. While I understand that's subjective, I think that it took quite a bit to understand what was happening in class. I think the content was pretty hefty and with good studying you should be fine. I am not great at multiple choice and her exams are mc heavy so it hurt my grade a lot. Be prepared for lengthy projects that are due around the time of an exam. Also exams are exactly every 3 weeks. It was difficult to only find out your previous exam grade just about a week from the next exam. I wish the grading could've been expedited. If you like neuroscience you'll probably enjoy this class. If not, you'll want to drop the major which is what I'm doing lol. Best of luck for those of you who take this class. You won't fail but it's not an easy A.", "rating": 3, "expected_grade": "B", "created": "2023-05-23T18:45:59.883106Z"}, {"professor": "Amanda Chicoli", "course": "PSYC302", "review": "Dr. Chicoli is super knowledgeable and willing to stay after class to answer any questions. had her for psyc300 and struggled there but took advantage of asking more questions/sitting in the front row this time and enjoyed this class a lot. the content is already naturally interesting and her teaching made it better. taking neuro prior to this class did help me, so I would recommend doing that. nothing else to say, loved her", "rating": 5, "expected_grade": "A", "created": "2023-08-31T13:06:09.903515Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "One of the most considerate and accommodating professors I have ever had. Dr. Chicoli always went out of her way to make sure students felt comfortable and never said no when I needed an accommodation. I will say, however, her one flaw was that she took an incredibly long time to grade assignments (some times assignments that we needed feedback for before beginning the next one). There definitely is a lot of work in this class, but Dr. Chicoli makes it very manageable by breaking things down into smaller steps, and allowing rough drafts for ever assignment that are graded on completion.", "rating": 5, "expected_grade": "A", "created": "2023-11-05T22:01:40.753152Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "Dr. Chicoli is an interesting professor in my opinion. Surprisingly I have now reached the end of the semester and had a grade that I am satisfied with and think reflects the amount of effort that I put into this class, but my god I put too much effort into this class. If you aren't fond of scientific writing or someone who is more of a typical narrative writer then this class will be your hell. Never in my life have I been so tired all the time of doing the same repetitive boring crap every week and honestly feeling no satisfaction at all from doing work. It's busy work that requires too much effort and I think if they wanted students to care more about the content of this class they would stop drowning them in 20 hours of work a week for this class. I put effort in to get my grade by the end of the semester and didn't care about how any of my research studies or experiments went, I just wanted the grade so I could stop suffering and move on with my day. Lectures are ok, but she goes a little too quick for my liking and makes collecting notes hard because her lectures repeat a lot of the same content and the overlap gets super confusing. One week I'm doing and observational survey and then the next week I am flipping that empirical paper into an experimental design. The class is messy and super overwhelming if you have to take this class I recommend taking a light semester around this class or you will suffer. I literally had to type an essay over Thanksgiving Break, that's how much work this class is. Otherwise, Chicoli not a terrible professor, I just think the course needs to be organized a lot better and directions need to be super clear, I know were are adults but we can read minds so send an announcement out every once and a while to clear up what the plan for that week is because this class has way too much content for such a small period.", "rating": 3, "expected_grade": "A-", "created": "2023-11-20T18:35:21.753524Z"}, {"professor": "Amanda Chicoli", "course": "PSYC302", "review": "Dr. Chicoli is one of the worst professors that I have ever had teaching one of the hardest courses I have ever taken. I have never gotten a grade lower than an A- at this school, but this class make me worried that I am going to get a C. Her lectures are extremely hard to take notes on, because they are all picture based and the terms are barely verbally explained. The assignments are also incredible vague, and she is very specific about grading. If you are confused about something, she will ask other students to teach you instead of explaining it better, which is tough when no other students understand, so they are teaching you the wrong thing. Her exams are much harder than any of the practice problems that we were given, and touch on concepts that were not deemed important based on the amount of time she spent on them in class. If you need to take a Theme I course, take any class but this one. Or maybe this class but with a different professor. Either way, take with caution.", "rating": 2, "expected_grade": "B-", "created": "2023-12-05T17:42:20.497631Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "Dr. Chicoli was very passionate about what she taught but it translated to her students weirdly. She was VERY VERY accomadating but the class itself was extremely boring (which there isnt much to do about when its a psyc requirement). Because she was so accomadating and this class was a requirement I gave her four stars, but I did not love her as a teacher. She was very all over the place and did not focus on one thing at a time.", "rating": 4, "expected_grade": "A-", "created": "2023-12-06T21:01:23.871816Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "The workload for this class is manageable but very difficult to improve on if connecting to other assignments. Feedback for draft assignments are never released until after the final draft was already do. I still do not have most of my grades back on assignments from over a month and a half ago and it is currently finals week. I have no idea where I am at in the class since I do not have most of my grades back. Lecture slides are extremely hard to follow. Slides on average have 60 slides posted filled with repetitive examples or duplicate slides my notes consist of 3-4 pages of relevant information even though the slides are much longer. Overall, the class is interesting but very hard to follow Dr. Chicoli's teaching methods and slides while also trying to understand where you are in the class.", "rating": 1, "expected_grade": "B+", "created": "2023-12-12T22:37:04.260454Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "This professor definitely cares a lot about psychology and research, so it's nice to have someone passionate about the subject, but otherwise I didn't like this class at all. It was so much work, and I recognize it's a 4-credit class but I still did probably twice as much for this class as any other class. There were reports due weekly that took a lot of time, and were graded harshly, but also not graded for so long. Sometimes we would do drafts and not get feedback on those drafts until a couple hours before the final draft was due which isn't that helpful. Additionally she's kind of condescending and just seems like excited to answer questions but then disappointed that we didn't already know the answer, if that makes sense. Also I turned in a report 5 minutes late and a month later when it was finally graded I got 10% taken off of it which like it's technically fair because it's in the syllabus but come on.", "rating": 3, "expected_grade": "B+", "created": "2023-12-16T23:37:22.564417Z"}, {"professor": "Amanda Chicoli", "course": "NEUR305", "review": "I heard a lot of horror stories about this class before and even after joining it. So, I thought to give me review of opinions, and I hope to give you some perspective through the process. First off, Dr. Chicoli is really nice as a person always willing to help, but you have to be the one to reach out to her, especially if you are falling behind. She is pretty good at learning names, even amongst about 100 students, and she tries to be as personable as possible in a larger setting. She is good at taking questions, and wants to strengthen our understanding of neuroscience. I will not lie, her exams are hard to ace with full points (I believe there was one MCQ as a part of a test where no one was able to score full points), but she gives you an extra credit opportunity of 5 points, which can boost your grade up to the next letter grade). The exams are mostly MCQ with some FRQ, and the FRQ is easy to score on. This semester, some of her announcements for new assignments were hard to reach, but she was able to listen to our feedback and changed a project to be announced earlier. Expect to work several hours outside the class, as it is assignment heavy as well. You can definitely learn lots about neural circuits, and can definitely ace the class if you have an interest toward the subject. To conclude, reach out if you ever feel overwhelmed- you should be able to get help!!!", "rating": 5, "expected_grade": "A", "created": "2023-12-23T06:44:13.220299Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "genuinely kind of insufferable? didn’t seem like a particularly bad person but came across as kind of condescending on occasion when i’d go to her for accommodation things. an okay lecturer - i’ll be honest i didn’t make more lectures than i did because the class already had a frankly egregious course load and i got into the habit of just skimming the recordings she would post. pretty awful course structure but definitely not undoable. just make sure you’re allocating the necessary amount of time for this class", "rating": 3, "expected_grade": "A-", "created": "2023-12-30T17:25:54.767830Z"}, {"professor": "Amanda Chicoli", "course": "PSYC300", "review": "The structure of PSYC300 this semester felt very disorganized between lecture and lab. Lectures would try to match lab content but often did not follow a logical flow (sometimes we'd jump back to old content for an entire lecture out of nowhere, then jump back to the actual lab content the next lecture which became very confusing). My TA while sweet seemed to be just as unsure what we should be doing in our assignments as we were. I was lucky to have a section later on in the week but other students I met with earlier sections would mention that at points labs would do activities on topics that would not be introduced in lecture until later in the week. I received contradictory information from my professor and my TA on multiple occasions and had to put extra effort into communicating with both to make sure I wasn't being told the wrong thing. Although my personal experience with this class was frustrating-- Professor Chicoli is a good lecturer, and I will say that she was very accommodating to the unfortunate loss we had this semester and some of the changes she made to the schedule to accommodate may have been a cause for some of this disorganized feeling. \r\n\r\nBesides the lack of organization which may have just been semester-specific; Grading in this class would take excessively long, which is an inconvenience for some assignments but genuinely a problem for research papers, where the course is designed to have students make a rough draft and update it through the feedback they receive. \r\n\r\nUnfortunately, this class felt much harder than it had to be considering the actual content of the course was not that advanced.", "rating": 2, "expected_grade": "A-", "created": "2024-01-11T03:52:13.057951Z"}, {"professor": "Amanda Chicoli", "course": "PSYC207", "review": "She was probably the worst professor I have ever had in all four years at Maryland. She was not accommodating at all, never explained complex terms or theories in class before using them in lectures and expecting us to know how to apply them in exams, and made the exams much too hard - half the exam was open ended, five + part questions regarding things she hardly mentioned during lecture. Her lecture style was so confusing and all over the place. She also never seemed to be organized or ready for the topic of the day. Honestly horrible experience I wish I could go back and never have taken this course. I would not recommend this class or professor to anyone.", "rating": 1, "expected_grade": "", "created": "2024-02-15T16:06:33.703315Z"}], "name": "Amanda Chicoli", "slug": "chicoli"}