{"courses": ["FMSC332", "FMSC660", "SPHL399", "FMSC270", "FMSC270", "FMSC332", "FMSC601", "GERM103", "FMSC332", "FMSC332", "FMSC789", "FMSC332", "FMSC332", "FMSC270", "FMSC601", "FMSC660", "FMSC270", "FMSC332"], "average_rating": 4.5, "type": "professor", "reviews": [{"professor": "Amy Lewin", "course": "FMSC332", "review": "save yourself the work and headache. If you are here for an upper level elective, The amount of work for this class is a shit ton. take online courses during winter and summer.  never again. ", "rating": 2, "expected_grade": "A-", "created": "2018-10-25T15:24:27Z"}, {"professor": "Amy Lewin", "course": "FMSC332", "review": "Great professor, I learned a lot from this class", "rating": 5, "expected_grade": "A", "created": "2019-04-17T17:28:52Z"}, {"professor": "Amy Lewin", "course": "FMSC332", "review": "Fantastic! Communicates material clearly and tries to make it engaging and applicable. Cares so much about her students. Really fair assessments, very flexible. ", "rating": 5, "expected_grade": "", "created": "2020-12-20T20:09:56Z"}, {"professor": "Amy Lewin", "course": "FMSC332", "review": "Prof Lewin is the best. I  just took FMSC 332 online in a 3 week semester. I  cannot recommend this class enough. It was a very intense 3 weeks but the topics were super interesting and the class was asynchronous. There were 5 discussion boards, 5 quizzes from the textbook, 2 papers, and a family project. It def kept me busy but I  am so glad I signed up for this class.", "rating": 5, "expected_grade": "A", "created": "2022-06-20T18:55:55Z"}, {"professor": "Amy Lewin", "course": "FMSC332", "review": "It's clear that Professor Lewin genuinely cares about the class and the students that take it. She is passionate about the course content and is very very accommodating to everyone. The class overall was quite light so long as you make the effort to attend lecture.", "rating": 5, "expected_grade": "A", "created": "2023-07-07T15:29:49.517515Z"}, {"professor": "Amy Lewin", "course": "FMSC270", "review": "Dr. Lewin is passionate about her classes and she is extremely knowledgeable. In this class, we had no textbook but many articles to read. There were no exams. Throughout the semester, we had weekly activities and a research paper. The final project is a debate with classmates. The information she shares is thought provoking and she tries her best to keep everyone engaged. She likes discussions and tries to know everyone's name. I would not take this class if you have a hard time being in lecture, it's a small class and she knows when people are missing. Overall, she is caring and accommodating, especially if you talk to her.", "rating": 5, "expected_grade": "A-", "created": "2023-12-19T16:53:10.196526Z"}], "name": "Amy Lewin", "slug": "lewin_amy"}