{"courses": ["PSYC404", "NEUR200", "NEUR479", "PSYC202", "PSYC300", "PSYC304", "NEUR200", "PSYC202", "PSYC404", "NEUR200", "PSYC202", "PSYC300", "PSYC404", "NEUR200", "PSYC202", "PSYC404", "PSYC404", "PSYC404", "PSYC404", "NEUR200", "PSYC202", "PSYC300", "PSYC404", "NEUR200", "PSYC404", "NEUR200", "PSYC300", "PSYC404"], "average_rating": 4.2308, "type": "professor", "reviews": [{"professor": "Ana Navarro Cebrian", "course": "PSYC404", "review": "Dr. Cebrian is very nice and the class is pretty straightforward. She teaches off her PowerPoints, which she uploads beforehand, making it useful if you miss class. We watch videos sometimes.\r\n\r\nShe's very receptive of questions and is very personable. She will often share stories of her experiences with patients and make the lecture more of a conversation.\r\n\r\nThe exams are multiple choice. By nature of this class being pharmacology, most of the information is memory-based (drugs, drug names, side effects, etc.), so be prepared to memorize a decent amount. \r\n\r\nMy only real complaint for this class is that grading is very slow. The exams are scantron but for some reason it took 2-3 weeks for us to receive our grades, which was annoying. There is a long-term project as well, which still hasn't been graded even though it has been a month (was due early November, is now early December). A little nerve-wracking in that sense, but overall it's an interesting and straightforward class.", "rating": 5, "expected_grade": "", "created": "2021-12-15T04:17:49Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "her tests were very straightforward, multiple choice, always exactly what she taught us from the slides. She was extremely nice and accomodating, offered extra credit, showed us interesting videos during class time that tied into what we were learning. This class was definitely one of the least stressful classes I took fall semester, Dr. Cebrian had a lot of passion for the neuroscience subject which was really inspiring. I highly recommend you take Dr. Cebrian if you can, the only downside (which is also an upside depending on how you look at it) is that the only grades in this class are three multiple choice exams that are around 30 points each, a research project and presentation that is only 20 points and a final that is 30-40 points. This means that even getting 3 questions wrong on one of the midterms will bring you grade towards a 90% and getting 6 wrong towards an 80%, this means that it is really really important to do well on the exams because your grade is entirely comprised of midterms ,a final and the project. It was nice not having to worry about quizzes and homework so I could focus that energy on other difficult classes. Dr. Cebrian helped with this issue by providing some extra credit and also giving a lot of weight to the project relative to the exams. This was nice because the projects are designed to be fun and you get to work with a group instead of by yourself,  mostly everyone did very well on them. ", "rating": 5, "expected_grade": "A-", "created": "2022-01-24T20:46:19Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "100% lecture. Professor Navarro is a good lecturer, but her classes are long and lecture heavy. If you miss class, the power points don’t give you enough information to be successful on the exams. There are a lot of times she just verbally says “this isn’t on the PowerPoint but it will be on the exam.” There’s really no correlation between the recommended book and her PowerPoints. There’s no information from her on what information is on what chapter or what chapter the module relates to. Grades take forever, took almost two months to get grades back on the group project (a large chunk of the grade). There’s not much homework so not much chance at engaging with the material other than reading the lecture notes. She’s very difficult to get ahold of, and can be quite rude when it comes to ADS accommodations. She will not make an effort to meet with you outside of her office hours, doesn’t give out an email to reach her, and when you approach her after class to speak she just tells you to go to her office hours. Difficult class if you have health issues that cause you to miss a good amount of classes.", "rating": 1, "expected_grade": "B", "created": "2022-12-22T14:27:35.527019Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "One of the nicest professors I have met. Her tests are very predictable and fairly graded. The TAs do most of the grading. Class is nicely structured and doable work is assigned.", "rating": 5, "expected_grade": "A+", "created": "2022-12-28T04:05:35.993670Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "She's awful can't understand her, her exams are not off her slides and she does not provide any other resources besides her slides. She has no other form of resources to succeed, and her questions are based on questions her students hypothetically ask during class. Very unfair do not take.", "rating": 1, "expected_grade": "C", "created": "2023-02-16T20:40:56.683548Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "If you go to class, just take notes on what she says that is not in the slides. With these notes, combined with just looking at the slides on one's own time, this is an easy A of a class. Also she says stuff about how neuroscience students typically do better in this class; but I was a psyc student, and had no difficulty at all.", "rating": 5, "expected_grade": "A+", "created": "2023-04-22T22:50:17.236673Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "Expectations are clear, and the bulk of the grade is a project which is graded leniently.", "rating": 5, "expected_grade": "B-", "created": "2023-04-24T18:17:23.504391Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "Very good professor. She is obviously very passionate about the course and the material. You have to attend lecture!! When studying you have to review the slides and the notes taken in lecture.", "rating": 5, "expected_grade": "A", "created": "2023-04-27T02:46:56.471827Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "She is a very passionate professor, which is helpful! But I feel like halfway through the semester her attitude shifted. It can be frustrating to sit in a lecture for an hour and half and cover 6 slides. The material is fairly interesting but the exams can be challenging.", "rating": 2, "expected_grade": "", "created": "2023-05-17T04:14:47.633521Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "Dr. Cebrian is great, I love her. Everything she tests on, is included in her slides. STUDY HER SLIDES, it's your key to success in the course. The content is really interesting, especially if you enjoy neuroscience or abnormal psychology, which I love. The group project assignment is fair, but you need to follow the rubric extensively. Yes, you need to actually do some application on the exams, it's not just purely memorization, but if you understand the content and can apply it, you will not only do well in the course, but will enjoy it as well.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T20:14:45.806506Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "this prof is very nice and very understanding to students. she will listen to you and resonate a lot with her students. you don't have to worry about anything because you are in good hands. the only thing that was hard was her exams. they can be a little hard and detailed. like what other people wrote, make sure to attend her lecture because there are so many things missing on the slides that would be on the exam.", "rating": 5, "expected_grade": "A-", "created": "2023-05-18T20:36:59.166418Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "This class was honestly very enjoyable and very fair. There were no surprises for any of the exams, there was a big project which helped everyone's grades because it was graded leniently, and extra credit was available. As long as you study the slides and pay attention at least a little in class, you should be fine.", "rating": 5, "expected_grade": "A", "created": "2023-05-21T00:20:46.442377Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "Really fun class, very engaging prof, genuinely cared and easy subject. Made me fall in love with neuroscience. Take her!!", "rating": 5, "expected_grade": "", "created": "2023-10-24T23:03:19.739383Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "This review is such bs (below in quotes), let me revise for them since they obviously had a bone to pick...\r\n\r\nWhat they said--> \"100% lecture. Professor Navarro is a good lecturer, but her classes are long and lecture heavy. If you miss class, the power points don’t give you enough information to be successful on the exams.\"\r\n\r\nRevised Note: You can easily survive with a good grade on the exams by memorizing the information on the power points. Rarely was there information that was actually outside of the powerpoints, and usually she sent out a mass email to everyone emphasizing the fact that she wants us to know it and it was not on the powerpoint. Also she doesn't make us memorize strange extraneous information or complex diagrams and it clearly flows and relates to eachother. Also the final exam was not cumulative which cut down my stress and amount of studying I had to put into it.\r\n\r\n What they said--> \"There’s really no correlation between the recommended book and her PowerPoints. There’s no information from her on what information is on what chapter or what chapter the module relates to.\"\r\n\r\nRevised note: This is because as she mentioned multiple times, she does not use a book. Although she has a document with links to supporting readings you could look at if you were interested, but it was not needed to understand the material. In my opintion the slides were more than enough of a resource to study with\r\n\r\nWhat they said--> \"Grades take forever, took almost two months to get grades back on the group project (a large chunk of the grade). \"\r\n\r\nRevised note: The group project (pretty much an individual project if u r worried about that), was the TA's project and therefore graded by the TA, at the TA's own leisure. It was not the prof fault that it was not graded fast, and the project was graded so leniently that I did it and turned it in the day it was due and got an A. Don't be worried about this. And we got our exam scores back immediately since it was multiple choice on elms, so that kinda evens it out.\r\n\r\nWhat they said--> \"She’s very difficult to get ahold of, and can be quite rude when it comes to ADS accommodations. She will not make an effort to meet with you outside of her office hours, doesn’t give out an email to reach her, and when you approach her after class to speak she just tells you to go to her office hours. \"\r\n\r\nRevised note: She has office hours and can meet outside of them, not hard to get a hold of. She is also a very kind and understanding person and from my experience I had no problem with ADS accommodations. Perhaps this person had a bad early on interaction with her in this regard and that is why they are so violently against her. She will meet with you outside of OH. Her email is literally in her syllabus, which this person must not have read. Also I have asked her questions after class and she does her best to answer, but if its a long question it may not be possible to answer it in that environment. You can just email her to ask or go to OH like you would with any other class, she is not going to mock or judge you, she is too kind for that.\r\n\r\nWhat they said--> \"Difficult class if you have health issues that cause you to miss a good amount of classes.\"\r\n\r\n\r\nRevised note: I got sick. A lot. and I still did very well in the class by just memorizing the slideshow presentations before the exam. It was not difficult, don't worry about it.\r\n\r\n\r\nI write this because I don't want anyone to get scared of this class, I would have her again in a heartbeat and that class was one of my favorite classes because of her. TAKE HER", "rating": 5, "expected_grade": "B", "created": "2023-10-24T23:37:25.325646Z"}, {"professor": "Ana Navarro Cebrian", "course": "PSYC404", "review": "Quite literally THE best class I have taken in my time at UMD. I have nothing but positive things to say about Dr. Navarro. She is so clearly passionate about what she teaches. She made me fall in love with neuro in NEUR200 and pharmacology with this class. She is very kind, helpful, and super laid back. The course is extremely easy as long as attend lecture. The exams are based almost entirely on the PowerPoints and there is a group project towards the end of the semester. It is really hard not to do well in this class as long as you go to lecture, take notes, and study the PowerPoints. The discussions and content in this course are extremely engaging and her personal anecdotes are fascinating. I heavily recommend this course if you like neuro (although the course is not super neuro heavy) and want to learn more about drugs.", "rating": 5, "expected_grade": "A", "created": "2023-11-02T14:24:33.732022Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "Dr. Navarro is an incredible professor. You can tell she is truly passionate about neuroscience and always makes lecture engaging.   She is the reason I fell in love with neuroscience. The reason I got a B and not an A in this class is because I was not putting in the time to study. Her exams are based mostly on her Powerpoints. All you have to do is memorize them. She is very kind and laid back. It is really hard not to do well in this course if you go to lecture and review your notes. I 100% recommend this course if you   think neuroscience may interest you.", "rating": 5, "expected_grade": "B", "created": "2023-11-02T14:29:25.139036Z"}, {"professor": "Ana Navarro Cebrian", "course": "PSYC404", "review": "One of the best classes I have ever taken at UMD. Dr. Navarro is one of the nicest professors here and clearly is so passionate about what she teaches. The exams are straight forward and directly from her PowerPoints, and additionally she bolds the stuff she wants you to know. There is no homework, just a group project that is super easy to get done in one day and sometimes practice clinical discussion posts due before exams. The exams are multiple choice on your computer in class and you get your grade back as soon as you submit. They usually took me 20 minutes tops to complete. I highly recommend this course because it is incredibly interesting and Dr. Navarro gives you all the tools you need to get an A so you can focus on how interesting the content is rather than stressing about the exams.", "rating": 5, "expected_grade": "A+", "created": "2023-11-06T17:45:53.987476Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "she is very interested and knowledgeable about neuroscience and explains most concepts well. however, she would play videos and skip through or pause them. we couldn't get any context this way and they often left me confused. if you don't do well on the exams or group project, there is barely anything left to bring up your grade. the group project was graded way too harshly for the amount of guidance that was given. I'm a psych student so I got lost in much of the more scientific information which is what she loves to talk about.", "rating": 5, "expected_grade": "A-", "created": "2023-11-30T20:27:47.737634Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "She is a very sweet person and I want the best for her, but she is somewhat scattered and when she lectures it is very hard to follow her train of thought. If you do not have much interest in neuro you won't like this class because it is very difficult. Her exams are worded very difficult and this makes it hard to do well. You will need to study a lot if you want to do well. The final is online, but you do have to log onto zoom.", "rating": 3, "expected_grade": "B-", "created": "2023-12-12T19:33:08.220281Z"}, {"professor": "Ana Navarro Cebrian", "course": "PSYC300", "review": "Compared to NEUR200, PSYC300 was pretty much disastrous. Exam questions were super confusing and often unclear. The final exam is fairly cumulative despite her saying no exams would be cumulative. The good thing is that she's very responsive to feedback. The third exam was a complete disaster and points were awarded right after the exam, not to mention extra credit on top of that. She's a good lecturer, but sometimes can be unclear. Some of her slides have errors and she doesn't post lectures (she did but for some reason they all disappeared...?), and she adds more details in lectures. The exams were just poorly written.", "rating": 3, "expected_grade": "A", "created": "2023-12-17T03:05:33.567930Z"}, {"professor": "Ana Navarro Cebrian", "course": "PSYC300", "review": "Compared to NEUR200, PSYC300 was pretty much disastrous. Exam questions were super confusing and often unclear. The final exam is fairly cumulative despite her saying no exams would be cumulative. The good thing is that she's very responsive to feedback. The third exam was a complete disaster and points were awarded right after the exam, not to mention extra credit on top of that. She's a good lecturer, but sometimes can be unclear. Some of her slides have errors and she doesn't post lectures (she did but for some reason they all disappeared...?), and she adds more details in lectures. The exams were just poorly written.", "rating": 3, "expected_grade": "A", "created": "2023-12-17T03:08:09.082933Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "She is an amazing professor with so much passion for the subject. She is the perfect professor to be teaching Intro to Neuro. I highly recommend participating in class, you will get all of your questions answered and she is always willing to help you succeed.", "rating": 5, "expected_grade": "B+", "created": "2023-12-17T21:53:57.338108Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "Dr. Navarro is an amazing professor. She cares about every one of her students and continuously tries to get to know each student. She is very lenient and accommodating to students' needs. I was scared to take this neuroscience course but she made each lecture very interesting. She answers questions to the best ability and posts lecture slides before class. She also posts study guides before each exam. She made me so excited and interested in neuroscience as a psychology major that I am now interested in picking up a minor in neuroscience. She is truly the best cannot wait to take more of her classes!", "rating": 5, "expected_grade": "A", "created": "2023-12-18T17:51:18.259832Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "Dr. Navarro is really sweet, but her lectures are often confusing and unintuitively structured. She's clearly very passionate about the subject, but sometimes has a hard time properly conveying the information. The actual content of the class is very cool if you understand, but I would recommend going through your notes after class to actually understand what she said. Her exams are also pretty detail-oriented which can make them frustrating because she picks out details to test on that were on the slides but were not emphasized in class.", "rating": 3, "expected_grade": "A-", "created": "2023-12-18T21:18:12.920950Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "Dr. Navarro was an amazing professor! I highly recommend taking her class. Like everyone said, she is incredibly passionate about neur200 and has made the lectures very interesting. I thoroughly enjoyed learning from her. \r\nExams: \r\n- there were 3 midterm exams 1 final. All exams were non-cumulative (including final). The final for me was online\r\n- I believe the exams were fair, class average score for exams were roughly between 75-80% on midterms and around a 90 on the final\r\n- There all multiple choice making it fairly easy \r\nLecture:\r\n- highly recommend showing up to her lectures, it will be very difficult to be able to know whats on the exam if you skip. She says a lot of important information that is not written on the actual slides themselves. \r\n- Her lectures are a bit lengthy, but, Dr. Navarro has made lectures engaging. She engages well with the class and is very encouraging when it comes to questions. She's also likes to make jokes from time to time\r\n- She does tend to be a bit slower with her slides at times, (we sometimes would barely get through a presentation because she would just talk)\r\nHow to study for her exams:\r\n- note cards helped me the best when it came to studying for these exams as well as reviewing the notes I had written for the class.\r\n- To be honest, I didn't put too much time and effort into studying for this class as I should've, but her exams were personally not that difficult for as long as you showed up to class and understood what she was saying\r\n\r\nOverall, highly highly recommend her. I really enjoyed neuroscience because of her.", "rating": 5, "expected_grade": "B", "created": "2023-12-24T21:12:34.890774Z"}, {"professor": "Ana Navarro Cebrian", "course": "NEUR200", "review": "Dr. Navarro is a very nice professor, and she is definitely passionate about neuroscience. She makes sure to connect the material with daily life, and is willing to go on tangents when something interests her. She also calls on people to share their ideas pretty frequently (but only if you raise your hand, don't worry). I also find her lecturing to be generally pleasant, and her accent is soothing lol.\r\nHer exams are all multiple choice, and based on the slides and her lectures, so as long as you memorize + understand the lectures you'll do well on the exams, no textbook necessary. I was not a fan of the project, and it is a decent amount of your grade, but it's not that hard so don't worry about it.", "rating": 4, "expected_grade": "A", "created": "2024-01-24T22:26:49.304309Z"}], "name": "Ana Navarro Cebrian", "slug": "cebrian"}