{"courses": ["ARTH496", "ARTT489A", "ARTH389M", "ARTH489M", "ARTH488G", "ARTH489K", "ARTH330", "ARTH389A", "ARTH488O", "ARTH389F", "ARTH389C", "ARTH389N", "HHUM205", "ARHU158M", "ARTH389T", "ARTH488K", "WINT488K", "ARTH389X", "ARTH389D", "ARTH489O", "HONR299A", "ARTH313", "ARTH324", "ARTH389K", "ARTH335", "HHUM205", "ARTH313", "ARTH324", "ARTH335", "HHUM205", "ARTH324", "HNUH268V", "ARTH335", "HHUM205"], "average_rating": 2.8333, "type": "professor", "reviews": [{"professor": "Aneta Georgievska-Shine", "course": null, "review": "Her lectures are super unorganized, for more than half of the lecture time she just read thru webpages. If you really enjoy study by reading webpages then this course is right for you. I would not take any of her classes again. ", "rating": 1, "expected_grade": "", "created": "2022-05-12T17:44:26Z"}, {"professor": "Aneta Georgievska-Shine", "course": "ARTH313", "review": "Very nice and funny person - horribly structured class. Somewhat organized content wise but not in terms of assignments. There are no assignments until the last week of classes, and additionally there is no grade put in until final grades are due. Midterm review had 180+ slides. No one knows where they stand grade wise. I really enjoyed the prof herself - but not her teaching methods.", "rating": 2, "expected_grade": "B", "created": "2023-05-11T15:30:30.333341Z"}, {"professor": "Aneta Georgievska-Shine", "course": "ARTH324", "review": "Professor Georgievska is an amazing lecturer and an overall brilliant person. Classes are very laid back—she just lectures about a portion of the image set in the syllabus every day and the class becomes more conversational. The slides help you focus on all the important information and it's really easy to process everything. There are very few assignments—you are graded on participation, one essay project, the midterm, and the final. With the first two you can easily boost your grade and the exams are very fair and allow you to put down whatever you remember (no specific gotcha questions). The professor also takes the time to plan guided trips to the National Gallery of Art and brings in guest speakers equally learned to her. 100 percent recommend taking her.", "rating": 5, "expected_grade": "A+", "created": "2023-10-25T19:46:24.763388Z"}, {"professor": "Aneta Georgievska-Shine", "course": "HHUM205", "review": "Dr. Shine is accommodating and kind. I genuinely believe she doesn't mean to be difficult or backhanded in any way. However, she has made some concerning comments, especially in relation to mental health issues and classist/racist government practices. In addition, her teaching style is a bit frustrating. While she is very knowledgeable about what she teaches and the course content is interesting, she takes very few grades and is a harsh grader. She gives super long study guides for exams and then puts material on the test that wasn't on there (so... what's the point?). Throughout the entire semester, we took four grades. We had to revise our papers many times over until they were exactly to her liking, down to the word choice (swapping one adjective for another synonym). The assignments didn't have rubrics, only guidelines. Once she even put our papers up on the board in front of the entire class and told us all the things we had down wrong. Ultimately I did learn a lot and the content was interesting, but I felt more frustrated more frequently than I feel I should have.", "rating": 2, "expected_grade": "A", "created": "2023-12-21T21:55:57.095948Z"}, {"professor": "Aneta Georgievska-Shine", "course": "ARTH335", "review": "Dr. Georgievska is an incredible professor with such a wealth of personal knowledge. Her expertise in Northern Renaissance, so this class is perfect to take with her. She connects so many movements and pieces across the course and really helps you develop a proper understanding of the subject matter. The only thing a little confusing is the lack of assignments, however, she grades all of them fairly. Most of your grade will come from the midterm and final, however, you just need to memorize the image set and you should have no problem acing them. All you need to do is show up to each lecture, study a bit during exam weeks, and write a very brief research paper. I would recommend this course to anyone interested in art history.", "rating": 5, "expected_grade": "A", "created": "2024-01-24T19:12:12.932573Z"}, {"professor": "Aneta Georgievska-Shine", "course": "ARTH324", "review": "She’s so disorganized in her lectures - it’s hard to understand what you need to know. Don’t take this class.", "rating": 2, "expected_grade": "", "created": "2024-02-15T21:10:53.712298Z"}], "name": "Aneta Georgievska-Shine", "slug": "georgievska-shine"}