{"courses": ["PSYC301", "PSYC789", "PSYC889", "PSYC304", "NACS898", "PSYC304", "PSYC798N", "PSYC899", "PSYC304", "PSYC304", "PSYC304"], "average_rating": 4.3333, "type": "professor", "reviews": [{"professor": "Anna Li", "course": "PSYC301", "review": "Dr. Li's a pretty fair and knowledgeable professor--lecture was mostly powerpoint slides and notes, and a couple of clicker questions every class. I found the content to be interesting, so I enjoyed the class. Exams are difficult, especially the second and third ones, but if you study hard you should be fine.", "rating": 4, "expected_grade": "A", "created": "2019-12-27T16:10:47Z"}, {"professor": "Anna Li", "course": "PSYC301", "review": "Dr. Li is a great teacher! the lectures are interesting and she explains the content well. She uses a mix of media forms (videos, diagrams, brain models, etc.) and she seems like she genuinely wants her students to succeed. \r\n\r\nThat being said, this class is difficult. Would not recommend if you don't have at least a moderate grasp of biological concepts. Strong bio background helps a lot. \r\n\r\nSome of the concepts are pretty abstract and challenging, and on top of that, the course material is very dense (but interesting and has a lot of practical use). Our class would fill out study guides for the exams and they would be 20+ pages long despite being only 80-90% filled out. \r\n\r\nAs far as homework, there really isn't anything except for the readings and weekly pre-class reading quizzes. (5 points each, you get 3 attempts to take them, no time limit, and she drops a few of them). I HIGHLY RECOMMEND TAKING NOTES ON THE READINGS. The course text is immensely helpful and you HAVE to use it. most the time, I only read the book enough to get a 5/5 on the quizzes which I now regret doing because maybe I could've ended with an A in the class. \r\n\r\nI also don't recommend skipping lecture. You're allowed to skip 5 without it impacting your grade, but every class there are clicker questions (based on participation) and *sometimes* in class essays (also graded on participation). But aside from not wanting to lose points, I recommend going because the slides alone won't tell you enough information to do well on exams. She does post lectures on panopto but the audio isn't great and sometimes you can't hear what she's saying (ran into this problem while studying for exams).\r\n\r\nAll in all, Dr. Li is a great professor. If you're interested in PSYC301 I'd take her. DO NOT take this course if you're expecting an easy A, but if you're willing to put in the work you will do well.", "rating": 5, "expected_grade": "B+", "created": "2020-01-01T16:39:10Z"}, {"professor": "Anna Li", "course": "PSYC304", "review": "My first lecture for this class, I was intimidated because Professor Li described the class to be difficult. However as time went on I found the class to be very fair and enjoyable! There is a lot of content to learn especially if you havent taken NEUR200 beforehand, but this was my introduction to neuroscience and I found the workload to still be manageable despite that. Exams are all multiple choice which makes it easier to handle, and Professor Li did study guides and an example Kahoot with practice questions for each exam. The one thing I would warn is that Professor Li does tend to post some videos for concepts OUTSIDE of lecture that will come up on the exam. The amount of content in these videos is pretty small (usually just an anatomical view with some brain structures to remember) but will surprise you on the exam if you don't watch the videos she posts. Overall, PSYC304 is a class that will keep you busy but interested!", "rating": 4, "expected_grade": "A+", "created": "2024-01-11T03:31:17.250328Z"}], "name": "Anna Li", "slug": "li_anna"}