{"courses": ["ENGL391", "ENGL297", "ENGL394", "ENGL394", "ENGL394", "ENGL394", "ENGL394", "ENGL394"], "average_rating": 3.5556, "type": "professor", "reviews": [{"professor": "Anna Szczepaniec-Bialas", "course": "ENGL391", "review": "Terrible teacher. She's practically incoherent during lecture. She has no grade breakdown and can't even explain where points came off if you ask. I haven't learned anything in over 9 weeks over taking this course. She obviously favors the few students who talk to her after class the most and take multiple courses with her (she also teaches business writing and does work in the professional writing department with interested students).", "rating": 1, "expected_grade": "B-", "created": "2018-11-05T21:32:24Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL391", "review": "Terrible experience. Class time is wasted going over random things and just going on tangents. She has no grade breakdown so it feels as though she just bases grades on who her favorites are. I am average at English and was struggling to get a B just because she seemed to not like me as much as others. She is rude to her students and told another student that compared to my writing she was doing well....do not recommend taking her", "rating": 1, "expected_grade": "B-", "created": "2018-11-16T15:38:42Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "SHE IS SUCH A NICE WOMAN. She is so sweet to all her students I do not know what these people are talking about. Although I have not finished her class, I know she truly cares about her students, and makes this class a lot of fun. ", "rating": 5, "expected_grade": "A", "created": "2021-02-05T02:35:08Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "She is sooo nice. Wasn't at all like the older reviews describe her as. I had a great experience with her. Assignments are relatively easy and she gives clear and concise feedback. She also tries to make class engaging, which I appreciate.", "rating": 5, "expected_grade": "A", "created": "2021-05-28T21:19:05Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "She is a very nice professor and gives good feedback on the assignments. The class is not too difficult and a lot of it is group work.", "rating": 5, "expected_grade": "A+", "created": "2022-05-04T22:50:32Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "This professor is great. She enjoys teaching the class and is more than happy to help if you make mistakes. There is a lot of group work so your group can make or break the class.", "rating": 5, "expected_grade": "A", "created": "2022-12-24T01:13:58.067887Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "Pros: Absolute sweetheart of a professor. Responds quickly to messages and deeply cares about all her students.\r\n\r\nCons: One of the most boring classes I have ever taken. Class is in person rather than online. During class it is just reading the class page word for word and boring discussions. A crap ton of group work and busy work. Assigned a random group for the final paper - if your group sucks, good luck. \r\n\r\nThe class is not as free of an A as the distribution may suggest. You have to stay on top of the many boring assignments and the professor grades pretty strictly - she does allow resubmissions which is nice but time consuming.", "rating": 3, "expected_grade": "A", "created": "2022-12-28T17:32:31.400794Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "one of the most boring classes. everything feels like busy work and I don't feel like I learned anything whatsoever. too much unnecessary group work as well. you should look for a prof that allows this class to be online instead of in person.", "rating": 2, "expected_grade": "A", "created": "2023-08-31T13:10:45.874242Z"}, {"professor": "Anna Szczepaniec-Bialas", "course": "ENGL394", "review": "She is the best teacher ever! Grades leniently and makes the classroom fun to work in. This is coming from someone who doesn't like writing that much.", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T20:47:07.837289Z"}], "name": "Anna Szczepaniec-Bialas", "slug": "szczepaniec-bialas"}