{"courses": ["PHYS624", "PHYS411", "PHYS274", "PHYS851", "PHYS274", "PHYS851", "PHYS274", "PHYS851"], "average_rating": 3.4, "type": "professor", "reviews": [{"professor": "Anson Hook", "course": "PHYS274", "review": "sucks at teaching multivariable calculus, pretty much teaches straight out of the textbook and just is terrible at explaining anything and skips steps in his lectures when showing his work.", "rating": 1, "expected_grade": "A-", "created": "2022-12-12T00:45:55.984525Z"}, {"professor": "Anson Hook", "course": "PHYS274", "review": "Primarily proof based lectures with a few examples sprinkled in. Homework for the linear algebra portion is largely proof based. The multivar portion is mainly calculation based. The midterm was fairly difficult with the final being very difficult compared to the rest of the class. If you enjoy proofs of what you are doing in class to understand, great professor, if not you will probably struggle to understand. There is a significant curve at the end of the course roughly 15-20%.", "rating": 4, "expected_grade": "C", "created": "2022-12-24T17:45:02.748451Z"}, {"professor": "Anson Hook", "course": "PHYS274", "review": "Prof. Hook almost never checked any of his example problems or fully solved through proofs before trying to show them to the class, resulting in confusion and wasted class time. He also spent a large portion of the lecture time on proofs. I'm not saying this as a positive or negative, though sometimes I did wish he spent more time explaining concepts. I took calc three at UMD and absolutely loved it, but the way Hook teaches multivariable calculus just makes me so confused. I know I'm going to have to relearn everything I already had solidly in my brain because of him. Additionally, the final came out of nowhere - it was harder than any homework or practice problem we had and was absolutely nothing like the practice final. The final dropped my grade by 10 points and I did above average (though the class was curved after the final). If you're a physics major who needs to take the class and it's your only option, you'll survive, but you won't enjoy it.", "rating": 2, "expected_grade": "A", "created": "2023-01-02T21:33:22.241738Z"}, {"professor": "Anson Hook", "course": "PHYS274", "review": "If you are able to think critically and put the effort into understanding what is taught he is a great professor. Homeworks are fairly easy as of now, and the exams are very fair. The trick is to put the effort in like expected and you will succeed. Anson deserves much higher than a 2.33 rating. You could easily see his progression as a professor as well.", "rating": 5, "expected_grade": "A", "created": "2023-10-20T19:58:25.849369Z"}, {"professor": "Anson Hook", "course": "PHYS274", "review": "Teaches linear algebra well, some homework questions are difficult if only using material he discusses in class. His review sessions for exams are extremely relevant to the content on both the midterm and the final exam. The midterm was fair, while the final was quite difficult. While he does sometimes make mistakes while working through problems, he is very approachable and helpful in solving a problem. When he gets to show how the math we learn can be applied to physics questions, he is an incredible instructor.", "rating": 5, "expected_grade": "A", "created": "2023-12-28T10:37:11.400159Z"}], "name": "Anson Hook", "slug": "hook"}