{"courses": ["CMSC330", "CMSC216", "CMSC132", "CMSC433", "CMSC388C", "CMSC389N", "CMSC389E", "CMSC388A", "CMSC388B", "CMSC388T", "CMSC389T", "CMSC330", "CMSC433", "CMSC330", "CMSC132", "CMSC330"], "average_rating": 3.7419, "type": "professor", "reviews": [{"professor": "Anwar Mamat", "course": "CMSC330", "review": "I had cmsc330 with Anwar and between him and Hicks/Foster, he's probably the worst professor to take for this class. Anwar is a cool dude, but his lectures were terrible and he moves at a pace that was too fast for most students to catch everything. His explanations are less than clear, and I soon ended up watching Hick's online lectures to try and get the rest of the material.\r\n\r\nThere were two midterms, fairly tricky but not too bad. Both of them were pretty long, and took the full 75 mins right up to the line - they really pack the exams. Definitely study the exams from previous semesters and drill ocaml/prolog programming if you want to do well on these.\r\n\r\nOtherwise, it's actually an awesome class and the material is really interesting despite the workload. I felt pretty solid in my standing as a software eng. after this class, because a lot of concepts across different languages kinda clicked for me. Get Cameron Moy as your TA if you can :) Good luck!", "rating": 3, "expected_grade": "C", "created": "2017-12-14T18:55:21Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "Mamat is a very accommodating professor, but his lectures are completely worthless. On more than one occasion, he would explain the material in the first 45 minutes while barely moving through the slides, and then rapidly go through them, only doing quizzes AND SOMETIMES SKIPPING IMPORTANT THINGS ALTOGETHER! \r\nFortunately, if Foster/another professor posts their lectures online, the class will be a breeze. Also, the project descriptions are very easy to understand, and the public tests are usually pretty robust, which is great especially if you're used to Nelson's \"figure it out if you can\" approach.\r\nI like the guy, but I didn't attend lecture after the first month and still got an A on the final just by reading slides and doing projects. That pretty much sums up how important his lectures are right there. ", "rating": 3, "expected_grade": "B+", "created": "2017-12-16T17:28:09Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "The lectures were way too fast and not engaging. By the end of the semester, I was skipping class and watching Foster’s lectures online. The tests and projects were fair, although we were left to just figure out basic SQL on the last one, which was annoying. The class itself is an interesting one, and old tests are provided for study. It’s certainly not the end of the world or anything if you have Mamat, you’ll still learn things, just probably not as much as if you had Foster.", "rating": 3, "expected_grade": "A", "created": "2017-12-16T17:42:01Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "what the heck is wrong with this dude. He goes over his lectures really fast. Cannot take notes and cannot understand anything. ", "rating": 2, "expected_grade": "", "created": "2018-04-17T03:42:55Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "Goes over slides pretty quickly, but he is pretty engaging in my opinion. Just sit in the front. ", "rating": 4, "expected_grade": "", "created": "2018-04-21T05:01:05Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "He is extremely engaging and I honestly understood the material so well after. He goes fast but the slides are online so you can just note what he says. I'm a visual learner and he's the best at explaining through code examples that he writes on the spot. I would say he is definitely a better professor to have for 330. ", "rating": 4, "expected_grade": "B", "created": "2018-05-13T20:39:19Z"}, {"professor": "Anwar Mamat", "course": "CMSC433", "review": "I like anwar and he keeps class fun but the material is just kinda boring so it is hard to pay attention sometimes. The class feels like just memorizing a bunch of java libraries used for multi threading. Easy Class though and projects are not too bad.", "rating": 4, "expected_grade": "A", "created": "2018-05-14T17:07:57Z"}, {"professor": "Anwar Mamat", "course": "CMSC132", "review": "He is a horrible lecturer. Do not take him unless you are willing to basically learn all the material on your own outside of class. To make matters worse, he has tons of clicker questions to penalize you for not going to his pointless lectures. And he doesn't allow laptops in class for students who actually want to learn while he's \"teaching.\" The one good thing about his classes is that the grading structure is fair, and the class is organized, but he just has no idea how to communicate the material. He doesn't seem to understand that coding in front of the class in a ridiculously small font while providing little explanation as to what he's doing is not the best way to teach computer science. Going from him one semester to an actually competent lecturer like Eastman the next was a night and day difference.", "rating": 1, "expected_grade": "B+", "created": "2018-06-27T03:30:49Z"}, {"professor": "Anwar Mamat", "course": "CMSC132", "review": "Anwar is a good choice. You will have to learn some things on your own as he doesn't go through everything fully. The amount of notes he provides for students is AWESOME. His tangents are funny but were less appreciated when we had to speed through topics at the end of the semester.", "rating": 4, "expected_grade": "A+", "created": "2018-12-13T20:51:49Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "Anwar is a pretty good lecturer and incredibly funny. His exams are fair, the average my semester was an 80% on the nose. The only valid gripe people have with him is the pacing of his lectures. He does tend to fly through some of the material on the slides, but if you try to pay attention, you'll be fine. Even moreso, all of his lectures are online, and his lectures are recorded and put online in case you missed them, so you should be fine. The projects will be more challenging than the ones you have had so far in 132 and 216 because you will be forced to navigate through different languages and different concepts, but for the most part, you will survive. \r\n\r\nPeople have gripes with him for having clicker questions that force you to come to lecture, but that really isn't criticism, because you should come to lecture anyway and he's giving you easy points that'll bump your grade at the end of the semester. \r\n\r\nAll around a nice professor and person, and I definitely recommend you take 330 with Anwar. I've never had Eastman, but I hear he's ok too. ", "rating": 5, "expected_grade": "A", "created": "2018-12-19T17:01:06Z"}, {"professor": "Anwar Mamat", "course": "CMSC433", "review": "Funny stories, nice guy.  Class grades are pretty fair.\r\nProjects are kinda butt, and clicker questions suck, lectures are mediocre.  I also hate slide trivia exams (which is what he gives)", "rating": 3, "expected_grade": "B+", "created": "2018-12-20T06:38:33Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "Anwar is not a terrible instructor, but not great either. He mostly reads off the slides and often rushes through topics. He tells a lot of stories and goes on a lot of tangents, which would be fine if it didn't mean rushing through challenging topics. I often felt like I didn't learn much by going to lecture and wished I didn't need to go, but there are clicker questions in order to enforce attendance. The material itself is very cool and the TAs for 330 are phenomenal. Also, Hicks is supposedly incredible, so if he's an option, take him. Otherwise, you'll be OK with Anwar, you just might need to put in a little extra time and effort.", "rating": 2, "expected_grade": "A", "created": "2018-12-24T03:27:26Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "Decent lecturer, although he goes a bit fast at times. He is a nice guy and has some funny stories. ", "rating": 5, "expected_grade": "A", "created": "2019-04-06T16:06:10Z"}, {"professor": "Anwar Mamat", "course": "CMSC132", "review": "Anwar is a great lecturer for 132. He also explains concepts very well. His lectures slides are great too. He doesn't put anything on the exams that he doesn't cover in lecture. Exams are also pretty easy. I usually finish with 20 minutes left and use the rest of the time to check my answers. I also dislike the MC section, which make up a fair portion of the exams, because they're just memorization and can be kind of tricky. Projects are hard to implement, but the project tests aren't hard to pass. I think I got a 100 on most of my projects. When I took it, projects were 40% of the grade, which should make the class an easy A. ", "rating": 5, "expected_grade": "A", "created": "2019-08-20T18:25:22Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "Solid guy but not a good lecturer. Reads off slides. Lectures are so useless but attendance is mandatory via clickers. Slides are good.", "rating": 2, "expected_grade": "C+", "created": "2019-12-18T07:36:00Z"}, {"professor": "Anwar Mamat", "course": "CMSC433", "review": "I had Anwar for 433 and 330. He knows how to run a course well, curves fairly, and is generally pretty responsive to student concerns. I think he is a good standard that other UMD CS professors should hold themselves to. His slides are pretty good and his tests are fair.", "rating": 5, "expected_grade": "B", "created": "2019-12-18T16:14:02Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "Anwar flies through the material very quickly, but that's just because there's a lot of stuff to cover. This semester he managed the online transition due to the pandemic quite well, and he toned down the amount of work we had to do. The slides really are the primary resource in the class, so study those, look at them when doing projects, and you'll do great!", "rating": 5, "expected_grade": "A+", "created": "2020-05-21T23:31:17Z"}, {"professor": "Anwar Mamat", "course": "CMSC132", "review": "Took this course in the summer and Anwar was a great professor for it. Made class very fun, and made it easy to understand. Plan on taking his 330 class", "rating": 5, "expected_grade": "A", "created": "2020-11-18T15:56:18Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "Not a good lecturer, because he goes super fast over complicated material, and could be a bit more civil, but that's really the only main complaint.  Clicker questions are not the worst and his slides are very comprehensive, the projects are fairly reasonable to do (better than 216's for sure) and the exams were fair too. Nothing completely out of the blue. Some TAs were really really helpful too and were responsive on Piazza. Overall, since 330 is usually co-taught, you should be fine taking either Anwar or the other professor. ", "rating": 4, "expected_grade": "A-", "created": "2020-12-15T19:13:24Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "He is boring but the content is fine. He doesn't really care much about his students but the TAs are awesome. Start projects the day they are posted and you will be in good shape. ", "rating": 3, "expected_grade": "", "created": "2020-12-20T06:21:21Z"}, {"professor": "Anwar Mamat", "course": "CMSC433", "review": "Good professor that knows the material well. Mostly reads off slides but gives alot of examples which helped alot. TAs are very good and office hours provided alot of help on projects. Projects are standard and should be started when they are assigned. ", "rating": 4, "expected_grade": "B", "created": "2021-01-12T04:27:19Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "Anwar manages to keep the lecture engaging and entertaining the whole class, he's a great professor and I have no dought I would have received a higher grade had I taken this class in-person. Genuine guy who really cares about his students and offers them a lot of resources and opportunities to ask for help in office hours. ", "rating": 5, "expected_grade": "A-", "created": "2021-05-11T13:54:12Z"}, {"professor": "Anwar Mamat", "course": "CMSC433", "review": "Anwar is fine. He explains the material decent enough in lecture, but he moves so fast! It's really hard to keep up with him during lectures. Also, the exams for CMSC433 are kind of really hard. I aced every single project but I couldn't for the life of me manage better than a 71 on the midterm. I don't expect to do much better on the final. All in all, Anwar is just okay. Not the worst CMSC professor I've ever had but certainly far from the best.", "rating": 3, "expected_grade": "B+", "created": "2021-05-12T17:02:20Z"}, {"professor": "Anwar Mamat", "course": "CMSC433", "review": "Pretty good 400 class overall. I don't think Anwar is a good lecturer, but he's pretty accommodating by making clicker questions fairly easy and worth 5% of the final grade to redistribute from exams. Some projects were tough (akka), especially due a high amount of the grade being secret tests, but others were fine. Make sure you put time into them, since they're worth a lot, and if you do you should be able to get a good grade. \r\nI thought the midterm and the final were fine, since I found them to be somewhat modeled after old exams. Also, TAs were great; they were really responsive on Piazza (much more than other 400s) and helpful for office hours. Great slides, and the material itself is also quite useful. Thus, if Anwar is teaching this class, I'd recommend taking it with him. ", "rating": 4, "expected_grade": "A", "created": "2021-05-18T19:38:00Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "Had him for CMSC132 and had to take him again because he's great. Would take another class with him if I could.", "rating": 5, "expected_grade": "B", "created": "2021-05-27T20:11:08Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "He's great! Goes very fast but at least for 330, everything you need to know is on the slides anyway.", "rating": 5, "expected_grade": "", "created": "2021-07-22T20:41:39Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "This professor was very good. He made sure that everything you needed to know was in the lecture slides. Make sure to follow what he is teaching and do the practice that he puts up and you will be fine. The assignments are tough if you do not both to learn/practice the material that he is teaching. As a teacher he seems to genuily enjoy teaching the students and it was a breath of fresh air compared to other professors here.", "rating": 5, "expected_grade": "A-", "created": "2021-09-30T14:10:34Z"}, {"professor": "Anwar Mamat", "course": "CMSC433", "review": "Not great lecturing style IMO. Lots of \"you know?\" \"this stuff\" \"this thing\" \"this stuff is tricky\" \"just read the JavaDoc\". Little motivational content to introduce concepts, which I've always found very useful in CMSC. Absolutely flies through examples without prefacing them well. Much prefer Dr. Hicks or even Prof. Herman hyper-explicit lecturing style and projects.\r\n\r\nProjects are open-ended and almost guaranteed to be 75% or more secret tests. TAs are exceptional but projects will still take 15-30 hours for average student, which was hell for someone balancing career responsibilities and other CMSC4xx classes as well. Midterms were fair and lecture slides were good.\r\n\r\nMain complaints are lecturing style and project difficulty/disconnect from lecture material/lack of direction given in description.\r\n\r\nDo not let this review discourage you from taking 433 with Anwar if you enjoy his style or are simply... well... smarter than me. Anwar is cool but the class just did not resonate with me. I've heard he's pretty good for 330 though.", "rating": 2, "expected_grade": "C", "created": "2021-10-10T16:58:48Z"}, {"professor": "Anwar Mamat", "course": "CMSC433", "review": "Second class with Anwar and he's a great professor. His exams are pretty easy for the most part since he emphasizes more on projects (which I 100% agree with). The projects in the class range from extremely easy (Hadoop and MPI) to challenging (Akka), but they're all good skills to know. I didn't attend lecture live as he uploaded the recording, and he does fly through the material, but the slides and GitHub repository provide enough examples to help you understand the material.", "rating": 5, "expected_grade": "A+", "created": "2021-12-23T13:47:27Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "I guess Anwar's gone now, but in case he comes back...\r\n\r\nI would say he's a good lecturer. My main complaint would be that he never really slows down. We would go through a huge amount of slides everyday and sometimes it seemed like he was racing. 330 has a lot of content, so that's probably why. I don't personally take notes, but I don't think anyone could with how fast he goes. He still did a good job at explaining concepts and the slides were well made, so you could basically just study off of those. He was clearly frustrated this semester by the turnout in lecture. Clicker quizzes used to be 4% of the grade, basically making lecture attendance mandatory. They changed the policy in the first week of the semester I believe, since people could be in and out with COVID. He would make lots of comments to himself during lecture about how it's so hard to teach this semester with not that many people in lecture and with everyone wearing masks. I also guess that computers used to not be allowed in 330 lecture, but now they are? He would complain about people having computers out too sometimes, and how he couldn't do anything.\r\n\r\nThe projects in this class weren't very difficult, except for the NFA to DFA project and maybe the first OCaml project. If you start early, you should be fine. There were two online midterms which were pretty fair. We had four 20 minute online quizzes in the semester that I found to be very difficult. 20 minutes was not enough time and they seemed a bit unnecessary (the last quiz was on a topic on the last midterm, which was a week before). The final was also in-person for some reason. People would complain on Piazza and the TAs said that the decision was made by the instructors. People tried to ask Mamat/Eastman to change it to in-person and they said they would think about, but they did nothing. Not a good look on their part, considering the online midterms were open book and this wasn't. Plus, many people expressed COVID concerns due to a in-person final, which was also ignored.\r\n\r\nAll in all, if Anwar comes back, I would recommend him. I was planning on taking 433 with him, but they changed teachers. He seems to have been a bit disillusioned by teaching this semester by all his comments on lecture, but I do hope he comes back.", "rating": 4, "expected_grade": "A", "created": "2022-01-11T17:55:01Z"}, {"professor": "Anwar Mamat", "course": "CMSC330", "review": "Anwar is not a good lecturer, the lectures are incredibly disengaging, and trying to take notes is hard as he flies through his slides. He yaps away while doing a poor job explaining new concepts, and if it were not for his in-lecture \"clicker\" quizzes, I would self-study because at least his online lecture slides at least contain everything he says, not to mention that he records. Cliff's notes are arguably more detailed and understandable though.\r\n\r\nI do give him credit for his extremely fair exams and grading, he seems to be generous with partial credit.", "rating": 2, "expected_grade": "B", "created": "2024-03-12T23:37:24.160945Z"}], "name": "Anwar Mamat", "slug": "mamat"}