{"courses": ["FIRE198", "FIRE298", "FIRE120", "FIRE398", "FIRE398", "FIRE120", "FIRE298", "FIRE398", "GERM103", "FIRE198", "FIRE398", "FIRE199", "FIRE199", "FIRE120", "FIRE298", "FIRE398", "BMGT190H", "ENES190H", "BMGT190H", "ENES190H", "FIRE198", "FIRE398", "BMGT190H", "ENES190H", "FIRE120", "FIRE298", "FIRE398"], "average_rating": 4.6667, "type": "professor", "reviews": [{"professor": "Benjamin Huffman", "course": "FIRE120", "review": "Huffman is very nice. I know he's new to teaching at Maryland. FIRE120 is an easy course. So the class wasn't difficult at all. The classes were very much interactive and work with students a lot (especially since this semester was over zoom). He does try to make sure everyone talks in class and we get to work with as many different people as we can. The due dates of bigger projects were reasonable (1-2 weeks) and the smaller assignments were very easy. Overall, nice professor and I'm expected to take his stream (GDD) next semester.", "rating": 5, "expected_grade": "A+", "created": "2020-12-08T02:53:04Z"}, {"professor": "Benjamin Huffman", "course": "FIRE198", "review": "Global Development and Design is an interesting stream as it discusses the SDGs and how we can solve issues under that. I know a lot of kids in this stream had no other choice cause their original choice had no more spots. But I chose this stream cause I thought it'd be interesting and sort of covers social issues. (most people in this stream are govt/politic majors)\r\n(Background: had him for FIRE120 and I was in the marketing + outreach module and govt accountability seminar group)\r\n\r\n-First half of semester, super easy, few assignments and they were very easy\r\n-One downside: After spring break, it was a HUGE mess. So you get assigned to 1 module and 1 seminar group (it's weird to explain what these are but once you're in them for 2 weeks you'll get it). Once we were put into our 2 groups they dumped a huge load of work and gave us short deadlines. It was especially confusing when no one knew the difference at the time. It just disorganized and very overwhelming. \r\n-I will say the second half of the semester is very collaboratively and HAVE to work with your groups to get assignments done. I kinda enjoyed it though. I really enjoyed the module and seminar topics. \r\n-Also I guess ur mentor for your groups could affect how you enjoy this course. My PRM Maddy was so great and supportive and very much organized so that definitely was a plus.\r\n\r\nI would recommend this stream for sure. Especially if want to learn about human interaction, global development, marketing, and stuff along those lines, this is definitely the stream for you. \r\nAlso would say that even if this is your last choice there's so many elements in this stream that sort of has other elements that other streams have. Like I know one group has to code and my group had to make graphics. So it has a wide range of appeals. \r\n", "rating": 4, "expected_grade": "A+", "created": "2021-04-29T21:06:20Z"}, {"professor": "Benjamin Huffman", "course": "FIRE120", "review": "An absolute golden retriever of a man. I loved him and loved this class. Huffman is so caring and always made class fun, even if the content wasn't really fun. Take him!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-12T21:35:35.017833Z"}], "name": "Benjamin Huffman", "slug": "huffman_benjamin"}