{"courses": ["HHUM106", "HIST135", "HIST408Q", "HIST140", "HIST476", "JWST600", "HIST283", "HIST283H", "HIST299C", "HIST408C", "JWST409C", "HIST282", "HIST601", "FIRE156", "HIST286", "HIST419T", "HIST287", "JWST409L", "HIST608T", "JWST289T", "JWST432", "RELS289T", "ISRL299C", "JWST235", "JWST235H", "JWST299C", "JWST234", "JWST275", "JWST459D", "JWST233", "JWST289E", "RELS219D", "RELS419D", "JWST619", "JWST699", "HLTH672", "HLTH710", "HIST135C", "HIST187", "JWST187", "HIST428D", "JWST429F", "HIST187", "HIST373", "JWST187", "JWST333", "HIST135", "HIST418C", "JWST419B", "JWST469C", "HIST135", "HIST601", "JWST289E", "HEBR498B", "JWST469C", "HIST135", "HIST286", "JWST275", "JWST289E"], "average_rating": 4.0, "type": "professor", "reviews": [{"professor": "Bernard Cooperman", "course": "HIST135", "review": "Cooperman is a pretty dynamic teacher. Old Jewish man who doesn't give two shits. He's funny, though a little bad with technology. He tries to engage the class when people seem bored.\n\r\nThe class itself is interesting, though if you pay attention and review the material, it's easy. He does take home exams, which are a god send in my opinion. ", "rating": 4, "expected_grade": "A-", "created": "2016-03-27T19:31:00Z"}, {"professor": "Bernard Cooperman", "course": "HIST135", "review": "Professor Cooperman is a funny guy that brings a lot of energy even to very early lectures. The lectures are a bit confusing in terms of their importance, but you definitely need to do the readings and get the gist of what is being talked about. Discussion is vital as there are weekly quizzes and a more focused explanation about things. \n\r\nThis course is tremendously back loaded in terms of workload, so be prepared for that. The tests are not hard at all as you always are given exactly what you need to do well. \n\n", "rating": 4, "expected_grade": "A", "created": "2016-01-04T15:23:00Z"}, {"professor": "Bernard Cooperman", "course": "HIST135", "review": "I'm no history major, so I'm not sure about how he is compared to other history professors, but if, like I did this past semester, you need to finish an I-series requirement and can't find one you're interested in, Cooperman and his history course that's all about riots is an okay choice. \n\r\nThere are two lectures a week and one discussion section per week. During lectures he talks about certain riots and how they relate to the class as a whole, the readings, and how they might help your essays you'll write later on. He uses powerpoint, but he goes through them quickly so be careful not to get a hand cramp from writing too much too quickly. In retrospect, what he has to say was probably more important that what was on the slides. His TA accompanies him in class while he lectures. The TA, however, mostly sits there, listening, though he does occasionally chime in with questions and thoughts for the class, and helps Cooperman with names of events and people when he can't quite come up with them himself. \n\r\nTo encourage you to come to class, he awards participation points through slips of paper that you sign and return to the TA if you earn one in class. To earn one, you need to do one of two things. 1: Answer a question(intelligently, that is), whether you're lucky enough to get him to acknowledge your raised hand or unlucky enough to have him put you on the spot when you can't quite process what he said fast enough, or 2: Come to class with a riot ready to present for the class briefly but completely. Either be prepared to answer subsequent questions about it from the TA(he was a PhD history student, so he keeps up with these things; he knows just about ABSOLUTELY EVERYTHING; it's kind of scary to a non-history buff like me), or provide a complete enough speech about it that he doesn't feel the need to ask questions. If you struggle to quickly digest what Cooperman said in lecture, way number 2 is how you're going to have to get them. You need 5 paper slips to get full lecture participation credit, and I had to get all 5 from riot presentations. Just come in with a riot ready every single class, and if the TA wants riots, you'll be ready. If not, save it for next time. Have a backup riot just in case someone uses yours and happens to go before you (though you could be awesome like I was and do enough work on it to expand on what was said before and get a slip that way :D ). Do what you gotta do to get those paper slips. \n\r\nIn lecture, Cooperman may put you on the spot with a question, but in discussion, the TA will NEVER call on you without your wanting to. It sounds like a relief, but  you still need to answer questions and participate in intelligent discussion about the readings and debates you were assigned in order to get discussion participation points (they are different from lecture participation points). The first half of them comprised of debates about a riot; you participate in one and observe the others. The second half involved breaking off into groups and reading together, preparing to answer questions he asks afterward. One of the last discussions involves an 8-minute presentation among your five-person group over a riot. Cooperman made a surprise appearance, so be ready for that and make it good, though my section was apparently the only one he appeared in.\n\r\nThere are a few papers in this course. One is about the portrayal of riots in certain movies you have to watch (there's a list, so pick your favorites or the shortest ones). Another is about a riot that you did your group presentation with. The last one is an evaluation of an argument for an author on a book I can't remember off the top of my head. Blah blah blah, don't leave them to the last minute, remember your bibliography, don't exceed the maximum page count. You'd be surprised how much you have to cut out to meet the page constraints; the TA won't read past the 5th page in a 5-page paper, for instance.\n\r\nThere is a midterm and a final. The midterm consists of an essay on a book and some \"IDs.\" IDs are basically the \"who, what, where, when, and why\" on riots, people, another other things emphasized in the course. Essay was graded surprisingly easily in my opinion. The outline is the most important part, in case you run low on time. The final consists of IDs only, and there is a list of IDs given that might possibly be on the exam. They emphasize that the paper on the author is \"part of the final exam\", but it's really just the IDs. They give you lots of time and you should be prepared with them.\n\r\nAnd that's Cooperman's HIST 135. He's funny; he tries to engage the class whenever he gets the sense that people are getting bored. Lots of readings to go over, so keep up with those. The syllabus is online, but it CHANGES OVER TIME, so keep an eye on it regularly. Again, if you need an I-series/diversity/history/social sciences course for your gen-ed requirements and couldn't find anything interesting, this is at least a decent choice. It knocks out a lots of requirements at once and you probably won't be bored. (Wow, that was long. Sorry about that... just trying to help future students, that's all.)", "rating": 4, "expected_grade": "", "created": "2014-07-14T02:30:00Z"}, {"professor": "Bernard Cooperman", "course": null, "review": "Dr. Cooperman is a great professor, and very enthusiastic about his material, in addition to possessing a good sense of humor.  That being said, he is, by far, the most disorganized professor I have ever had at this university.  Some days after lecture, I would have pages of notes, and some days, I would barely have 10 lines, after all of his tangents are accounted for.  He is not a harsh grader, but it takes forever for him to get anything back, especially as the semester draws to a close.\n\r\nI enjoyed Dr. Cooperman's class, and the material presented, but if you aren't interested in the subject matter and can't handle disorganized teachers, I would hesitate before signing up for his class.", "rating": 4, "expected_grade": "A", "created": "2013-05-19T19:42:00Z"}, {"professor": "Bernard Cooperman", "course": null, "review": "Dr. Cooperman was incredibly enthusiastic about his lectures, making every single one enjoyable. His tests were fair, especially since he gave us a term sheet and three essay questions where we would only have to write one on the test day. However, the whole grading scheme was incredibly confusing. It's because of this that I have to dock off a star. His TA literally graded everything, and although Cooperman was very nice, his TA was a bit more strict when it came to grading. I never heard of anyone ever getting above a 95% on essays, and it seems like 85% was the norm. I would make sure to read the books he assign, though get them from the library since you'll need each one for maybe two classes max. However, there was a very nice curve at the end that surprised me (I thought I was getting a B, ended up getting an A-). ", "rating": 4, "expected_grade": "", "created": "2013-04-21T16:24:00Z"}, {"professor": "Bernard Cooperman", "course": "HIST419R", "review": "Yea Mr. Cooperman was awesome, I didn't have any interest in the course but had to take it to meet a requirement and it became one of the best courses I've had. Truefully, the syllabus wasn't followed to the T, but it was his first time teaching the class so it wasn't a big deal.  Grades weren't returned as promptly as some people would like,it didn't bother me at all.  Your grade is determined on your performance on the final paper, no final though!!  The guy is hilarious, insanely knowledgable, and willing to help at any time, I would strongly suggest taking him.", "rating": 5, "expected_grade": "", "created": "2011-03-15T23:53:00Z"}, {"professor": "Bernard Cooperman", "course": "HIST419R", "review": "Another 419R student checking in.. the syllabus was not followed at all, and grading is very slow. That being said, his lectures hit it out of the ballpark every time.. and so it's worth it.", "rating": 5, "expected_grade": "", "created": "2010-12-21T15:06:00Z"}, {"professor": "Bernard Cooperman", "course": null, "review": "I thought he was extremely unclear in what he was asking from the class. He assumed that everyone taking the class already had a lot of jewish studies knowledge, even though it was a CORE class. I felt distracted for being female. \n\r\nHe was also disorganized. I did not respect him, he never turned grades back.", "rating": 2, "expected_grade": "C", "created": "2010-12-17T16:44:00Z"}, {"professor": "Bernard Cooperman", "course": "HIST419R", "review": "Cooperman is funny and can be a great teacher.\n\r\nHaving said that, we are now 1 week away from finals and have only received grades for 15% of our grade thus far. Cooperman promises that grades will be in and then 3 weeks later they still are not. If you care about knowing where you stand in a class, do not take Cooperman.", "rating": 3, "expected_grade": "B", "created": "2010-12-06T04:58:00Z"}, {"professor": "Bernard Cooperman", "course": null, "review": "I am a huge fan of Dr. Cooperman but he is a little flaky we didn't get our grades back until mid winter break. The TA's I had for 234 and 235 were both great. From what I hear he is the best professor for this course.", "rating": 5, "expected_grade": "A-", "created": "2008-06-09T14:54:00Z"}, {"professor": "Bernard Cooperman", "course": null, "review": "He's great! He lectures on broad, general topics, and you have to do the readings to know whats flying in class, but if you keep up with it, you'll love it!", "rating": 5, "expected_grade": "A", "created": "2007-11-04T22:40:00Z"}, {"professor": "Bernard Cooperman", "course": "HIST135", "review": "jewish man thats funny but also has no filter. class was fun but he said racial slurs and heiled hitler. great class though.", "rating": 3, "expected_grade": "A", "created": "2021-12-07T03:58:56Z"}, {"professor": "Bernard Cooperman", "course": "JWST187", "review": "Dr. Cooperman is a funny guy. He likes to spark debate in class and tells interesting stories, he's also generally high energy.\r\n\r\nI'm subtracting one point because as we got later into the semester, lectures got slower as there was less debate and more quantity of content that was being covered. \r\n\r\nOverall a fun course and fun professor.", "rating": 4, "expected_grade": "A+", "created": "2021-12-19T09:20:56Z"}, {"professor": "Bernard Cooperman", "course": "JWST187", "review": "Dr. Cooperman is a funny guy. He likes to spark debate in class and tells interesting stories, he's also generally high energy.\r\n\r\nI'm subtracting one point because as we got later into the semester, lectures got slower as there was less debate and more quantity of content that was being covered. \r\n\r\nOverall a fun course and fun professor.", "rating": 4, "expected_grade": "A+", "created": "2021-12-19T09:20:56Z"}, {"professor": "Bernard Cooperman", "course": "HIST187", "review": "Professor Cooperman is an incredibly knowledgeable, wise, charismatic, and quippy lecturer who guarantees few dull moments. He likes to ask open-ended questions and then shoot witticisms no matter how you answer. His rambunctious lecture style was fun, although his tendency for tangents often resulted in the class falling behind on material.", "rating": 4, "expected_grade": "A+", "created": "2022-10-10T16:40:33.545361Z"}, {"professor": "Bernard Cooperman", "course": "HIST187", "review": "Decent class. Professor Cooperman is certainly knowledgeable and educated on the topic of the course and his lectures are pretty thoroughly fleshed-out. Honestly, whether you will like his lectures or not depends completely on what you're looking for in a college course. He likes to make lots of witty remarks, goes on tangents, and often calls out random students in the lecture to answer questions. This can be fun at times, but the tangents did put us behind on course content and he also doesn't hesitate to tease students if they don't have an amazing answer to his questions. Overall, if you're truly interested in the topic at hand and willing to have verbal jousts with the professor, you'll enjoy the lectures. Personally, I just skipped the lectures after the first month or so. The class has a decent workload, though it's all participation work. You'll have to subscribe to an online newspaper and also purchase a book for reading questions. Besides homework, there are grades for discussion/lecture participation, two papers, and two exams. Overall, the course is solid and educational, but definitely not easy. Take it if you want a challenging course to learn about, but don't take it if you just need a gen-ed credit.", "rating": 3, "expected_grade": "A-", "created": "2022-12-07T15:50:07.759504Z"}, {"professor": "Bernard Cooperman", "course": "HIST187", "review": "The class itself is very interesting. I only took this class originally since it satisfied 3 gen eds, but Cooperman made the class extremely enjoyable. His lectures were fun to go to and I would recommend this class to anyone interested in the topic. He does go on tangents and we didn't finish everything we were supposed to cover this semester. There is a book you have to purchase and a newspaper you have to subscribe to but you can get around this by pirating the book and getting a paywall blocker extension. You have weekly assignments, there are 2 exams, and 2 papers. Just put a little effort in and you'll be fine. Overall fun class, would take it again.", "rating": 4, "expected_grade": "B", "created": "2022-12-15T06:42:43.452974Z"}, {"professor": "Bernard Cooperman", "course": "HIST135", "review": "This class is pretty interesting and the professor is really interesting but can scare some off, he will cold call on you sometimes but really just wants you to make an argument with him. You have to participate and get slips every time you do and discussions are mandatory. There are two papers, a midterm, and a final, and weekly article discussion boards. There were supposed to be more assignments but he ended up not doing them, there are also extra credit opportunities throughout. The papers and exams are weighted heavily so you want to do your best on those. The class is again interesting but he does get carried away and it is hard to take notes sometimes that will help in exams.", "rating": 4, "expected_grade": "A-", "created": "2023-05-11T18:54:56.211108Z"}, {"professor": "Bernard Cooperman", "course": "HIST418C", "review": "Hilarious professor. Class was a bit unstructured, but that made it better. Just had to write a couple of papers. Super funny, super knowledgable, and very nice guy even when he's poking fun at you. Highly recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-09-04T15:28:21.461729Z"}, {"professor": "Bernard Cooperman", "course": "HIST135", "review": "He is very passionate and engaging. He is knowledgeable and helpful. He puts students on the spot, but it helps them learn. Great guy and teacher. The only issue is that he grades very very very slowly.", "rating": 4, "expected_grade": "B+", "created": "2023-11-30T15:28:20.986311Z"}, {"professor": "Bernard Cooperman", "course": "HIST135", "review": "Dr.Cooperman is amazing, this was a super fun class, and he is super funny and engaging. Because of my heavy course load, going to his class felt like a nice uplifting break at the end of the day. \r\n\r\nThe class itself: Personally I would say this class is not skippable. there is participation credit and he gives very specific examples of things that will be on the exam. He does post slides before the midterm and final, but he uses his slides more for pictures and guides in class, so I wouldn't say they are helpful. When I was in class, I just had a word doc open and jotted down everything he said for the 50 minutes. You do not need to always read the textbook (except for conversation in section), but you need to utilize it when studying for the Midterm and Final. The textbook is super straightforward and easy to read.\r\n\r\nThere are two papers, with one book per paper. I didn't read both fully; I just skimmed. Because the TA grades everything, would be your best bet to meet with them instead of Cooperman for these essays.\r\n\r\nExam: study guide is exactly what is on the exam, no tricks. only difference is that you will not be given ALL of the questions on the study guide. (ID section and Essay) \r\n\r\nOverall I got an A- because I had a 88-90 average on every assignment. Grading is a bit tough, but if you put effort in you will be fine. My two essay grades were 88 and 90-something because I did them the night before, If you start early and get feedback you will do well.", "rating": 4, "expected_grade": "A-", "created": "2024-01-09T03:36:57.120614Z"}], "name": "Bernard Cooperman", "slug": "cooperman"}