{"courses": ["ENGL313", "ENGL394", "AASP478C", "ENGL301", "ENGL378B", "AASP478N", "ENGL471", "ENGL497", "ENGL433", "ENGL297", "ENGL301", "CMLT277", "ENGL301", "ENGL394", "ENGL394", "ENGL393", "ENGL101", "ENGL394", "ENGL497", "ENGL142", "ENGL494", "ENGL497", "ENGL381", "ENGL394", "ENGL494", "HONR368A"], "average_rating": 3.5, "type": "professor", "reviews": [{"professor": "Blake Wilder", "course": "ENGL394", "review": "Not a great teacher in terms of prompt and or constructive feedback.  Expectations are certainly reasonable and he isn't an unpleasant person.  Not much else to say it's a professional writing course.  Wouldn't take a class because he was teaching it, wouldn't avoid one I wanted to take because he was either.", "rating": 3, "expected_grade": "", "created": "2018-05-11T06:39:33Z"}, {"professor": "Blake Wilder", "course": "ENGL301", "review": "Pros: Knows his stuff, approachable, isn't berating, has reasonable standards. Great course materials. Runs pretty productive and respectful classroom discourse.\r\n\r\nCons: Like another reviewer said, takes forever to get feedback and grades to students. Granted, he has some extenuating circumstances rn but final grades have been due for a while and no major grades have been released, even for things from September. This didn't ruin my ENGL301 experience, but for people with grade anxiety, strict parents, or financial aid this may be a huge issue.", "rating": 3, "expected_grade": "A", "created": "2019-12-20T21:46:52Z"}, {"professor": "Blake Wilder", "course": "ENGL394", "review": "Blake is a pretty cool guy. The class itself is pretty boring and there can be a decent amount of assignments that seem redundant but he tries to make the class engaging. Reasonable grading expectations and gives flexibility for absences.", "rating": 4, "expected_grade": "A", "created": "2023-05-10T15:25:56.211525Z"}, {"professor": "Blake Wilder", "course": "ENGL394", "review": "Takes a while to get feedback, but overall he is a good professor. I suggest you take him for business writing if he is available. Make sure you attend class because he does take attendance.", "rating": 4, "expected_grade": "A", "created": "2023-05-10T15:29:59.945798Z"}, {"professor": "Blake Wilder", "course": "ENGL394", "review": "Very laid back and approachable. The course is easy and if you come to class and do your assignments you will get a good grade. He is also very lenient on absences but does take attendance.", "rating": 5, "expected_grade": "A", "created": "2023-11-14T14:51:20.363029Z"}, {"professor": "Blake Wilder", "course": "ENGL497", "review": "Decent enough professor, but you can tell he's all over the place. He also said, verbatim, that \"he forgot about this class all the time\". He's incredibly nitpicky, and will take it out on the attendance/participation grade based on your \"preparedness\". Also took extremely long to get feedback and grades out so take with that what you will. Only take this class if you like professors with a superiority complex.", "rating": 2, "expected_grade": "A", "created": "2023-12-09T04:12:46.222427Z"}], "name": "Blake Wilder", "slug": "wilder_blake"}