{"courses": ["CHEM135", "CHEM231", "HONR288B", "BCHM463", "CHEM241", "CHEM131", "CHEM134", "BCHM461", "CHEM131S", "CHEM232", "CPSP218L", "EXST155", "CHEM242", "CHEM271", "BCHM463", "BCHM462", "BCHM463", "BCHM462", "CHEM271", "CHEM241", "CHEM242", "BCHM461", "CHEM231", "BCHM463", "CHEM241", "BCHM462", "BCHM463", "BCHM462"], "average_rating": 3.9294, "type": "professor", "reviews": [{"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Honestly Dixon is a great teacher. She is really passionate and really tries to make lectures exciting and also make sure you learn the material. That being said, this class is extremely, extremely hard. You can not get by just going to lectures and doing the homeworks. Lol, that is what I did and I am most likely going to get a D. But everyone I know who goes the extra mile, goes to office hours and GSS, studies at least a little every day, and does all the practice worksheets does fine. Just be prepared to work extremely, extremely hard if you want to do well, or even ok. But this is orgo so you know that lol", "rating": 3, "expected_grade": "D", "created": "2016-05-12T22:29:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "Dixon is one of the best teachers I have ever had. Her class is based mostly on 3 exams and a final, with clicker questions and homework as a small part of the grade.\n\r\nPros:\r\n-She is very passionate!\r\n-She is funny, and nice!\r\n-Her teaching is very very very clear. She will make you know your stuff.\r\n-She really cares about students and is very helpful.\r\n- You will be well prepared for orgo.\n\r\nCons: \r\n-This class is hard, but it's chemistry so it will always be hard.\r\n-She is tough.", "rating": 5, "expected_grade": "A", "created": "2015-02-27T12:47:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "LOVE Dixon. She's sassy and very honest. She told me straight-up when I went to her office hours (which are 9-5 btw) that as long as I went to lecture I probably didn't ever need to open up the textbook. That being said, the class isn't easy. No chem class will be. But if you have Dixon, you will enjoy lecture and have an insane support system. She's very passionate about helping her students learn, so don't be afraid to visit her!", "rating": 5, "expected_grade": "B", "created": "2015-01-30T13:27:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "BONNIE IS BAE <3 <3 <3\n\r\nI was super scared to take her...and I was so nervous coming into the first day of class. But, I am so glad that I took her! She is such a fun and crazy (in the best way possible) teacher, and she made chemistry so interesting. \n\r\nDon't be fooled though. This class isn't a walk in the park. She does go through the material at a fast pace, but just ask questions in class if you are confused and she will stop and answer them! I took AP Chem in high school, and I guess that helped, but Dr. Dixon was such a good and clear teacher that I think I would have been fine if I hadn't taken AP Chem before coming in. \n\r\nALWAYS TAKE THE EXTRA CREDIT OPPORTUNITIES!!! She gives a good amount of extra credit (about 30-40 points), but you do have to work for it. She also doesn't do a plus minus system, which is really awesome. If you are borderline and you do all the online assignments, there's a chance you will be bumped up to the next letter grade! so take advantage of that!\n\r\nCLICKER QUESTIONS! She has 40 clicker questions. I don't know if she always does this, but for us, I feel like there were more clicker questions in the beginning of the year than at the end. So in the beginning half of the year, I would recommend just always being ready for her to spring a clicker question or two on you. She doesn't give you a lot of time to answer it. If you don't know what you're doing, you're kinda screwed. I was lucky enough to surround myself with a group of friends and we worked through each one together (which she is fine with). She also does like 5-7 clicker questions before each exam to give you some practice. Those helped a lot and gave me some idea of what topics would be on the exam/what kind of questions to expect. Some clicker questions are meant to trick you. But she goes over them if most of the class doesn't get it right. And hey! Better to get tricked on a 1 point clicker question than to get tricked on a 8 point question on the test!\n\r\nBefore each exam and the final, she tells you exactly what she is going to test you on. \n\r\nPersonally, I never had a problem with timing on an exam. But that might be because I just write really fast.i dunno. But I always finished with about 20 minutes to spare, which gave me time to check through my work at least 3 times (and usually I made a lot of little stupid mistakes so those 20 minutes gave me time to redo some problems) \n\r\nMake SURE you study for the extra credit pre-test because it is an awesome grade booster. \n\r\nThis may not be the case every year, but for me, I thought the first two exams were significantly easier than the third one. BUT! The third exam is still do-able. I studied probably around 3-4 hours for each exam. I just looked through my notes, clicker questions, and old exams (she has a bunch in her office). \n\r\nHer homework is not that bad. I got an A on every single one, but that required a couple hours of work. The homework questions aren't impossible, but I think everyone just wanted to make sure they got that 10/10. \n\r\nShe has AMAZING office hours. There are always a bunch of students in her office, either asking her questions, or sitting around working on homework or studying for an exam. \n\r\nI didn't really go to GSS The girls who taught GSS for us were super nice and helpful. I didn't go often because I like to study at my own pace. But if you are a person who likes to have someone teaching you stuff and working through problems with you, then definitely go! \n\r\nOVERALL...TAKE THE CLASS! You will have to put a decent amount of work into it, but hey...challenge yourself. It's worth it. ", "rating": 5, "expected_grade": "A", "created": "2015-01-08T16:59:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dr. Dixon is the best organic chemistry professor on this campus. You will have to work hard for a good grade, but it is definitely doable. I got an uncurved A. I did all of her weekly quizzes and handouts that were given out in class. I used a white board to go over and over the practice problems given in class. I started out by using the textbook, but she even said that the textbook would not be very helpful. Organic Chemistry as a Second Language was very helpful in the beginning, but by the second exam I was not using it anymore. Exams are always on Mondays, so reserve literally the entire weekend beforehand for studying. She is also very dedicated to her students. She holds office hours as often as she can, this semester she held them basically from 9-4 on Tuesdays and Thursdays, and for a few hours MWF. If you want to learn organic chemistry, take her.", "rating": 4, "expected_grade": "A", "created": "2015-01-05T15:20:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "Dr. Dixon is a great teacher. Her class is extremely difficult and her tests are really hard. I took her for gen chem with the mindset that I wouldn't get the best grade but would have a good base for all the other chemistry classes I have to take. GO TO EVERY LECTURE! First of all if you dont, your going to be totally lost. Also she does clicker points. Her homeworks are a giant pain in the ass. They are way to hard. Ask people who have taken her to help you so that you dont end up working on it for 3 hours and only getting a 3/10. I had a mixed expereince with her office hours. Sometimes she was extremely helpful and friendly but other times she was kinda *****y and just told me to go figure it out. Goodluck!", "rating": 4, "expected_grade": "B", "created": "2014-12-18T12:50:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Bonnie Dixon is the best orgo professor you can find here at UMD! No question about it. She makes learning orgo very intuitive and straightfoward.\r\nYes, she will will push you. A lot. Her exams can be a nightmare. But she provides with every tool necessary to do well on them. Her weekly quizzes and homeworks are your best bet as to knowing what will be tested on. Going to her office hours is A MUST. There's tons of students in there that can help you, and Dixon is always willing to help you over confusions. \r\nThe grade you put into Dixon's orgo is reflected in your grade. I highly recommend her for anyone who plans on taking Orgo II. ", "rating": 5, "expected_grade": "A", "created": "2014-12-17T17:44:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "Dr. Dixon is legitimately one of the best professors I have ever had. She's a fantastic and fun person (she plays music at the start of class), she knows exactly what she's talking about all the time, she's really helpful and caring, honesty perfect. Probably one of the things I'm the most grateful for is that she tailors her course material directly to what she tests you on. If you do the work, and you study what she says, you won't see anything on the exam that you weren't expecting. She lets you know exactly what she wants, exactly the format to put it in, and exactly what you need to do. The way she grades is also great, a lot of teachers will take off  for small arithmetic mistakes and annoying things like that. Dr. Dixon will grade you for getting each step of the problem right, so if you set it up you get some points, if you move on to the next step you get some points, and the final answer is only worth some of the credit, it's great and it makes the class feel really fair. She had fantastic TAs and she communicated with them really well, they were all willing to adjust their schedules and help us out as best they could and even do some extra GSS's. I have no idea how Dr. Dixon manages her time with the amount of stuff she does for us. One time this semester her TA had a medical emergency so she ran almost all the discussion sessions herself, I can imagine any other teacher just canceling them and apologizing but not Dr. D.\n\r\nAfter all those compliments, legitimately the ONLY downside to this course is that it is extremely difficult. The tests are hard, the homework is hard, even lecture is pretty rigorous (I missed a single lecture and I felt way behind). I devoted the majority of my time and emotional effort this semester to this class in order to keep up. Also, time is a huge issue on exams, she makes them so you can just barely finish in the time given.\n\r\nThe thing about Dixon is that she makes you really want to do well in her class. This is the first serious chemistry class I've ever taken and it's made me love chemistry. It's so interesting and the way Dr. Dixon talks about it makes me like it even more. I know I already said this but I just want to emphasize that she is such a fun person, Chemistry is probably one of the only classes I have this year that I actually really enjoy going to.\n\r\nI think I'm going to get an A or a B. After every test Dr. Dixon will check in with how many points you should have to be on track for an A, B, C, etc. Also, word of advice, use the chat page on elms before an exam. People are usually in there working on the practice test and sharing answers and methods, it helped me so much.\n\r\nUnless you're honestly just looking to breeze through a gen chem class (is that even possible?) take Dr. Dixon. You will not regret it.", "rating": 5, "expected_grade": "", "created": "2014-12-16T23:43:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "First off; holy god, this class will teach you how to work for what you want. Dr. Dixon is the hardest, but hands-down, the best chemistry professor on campus. If you take Dixon, you will know your shit, but she will force you to LEARN that shit in order to even do DECENTLY in her class. I have never worked as hard in a class as I did in this one, and at the end of the semester, Dixon recognized that and bumped me up from a B+ to an A (she doesn’t do minuses). But let me tell you, I worked for it. I went to GSS consistently, did the weekly quizzes, used Klein’s Orgo as a Second Language book, was in her office hours regularly, went to all the discussions, and studied with friends for homework and before exams. Her class taught me to work my ass off for what I want, and that’s going to be a lesson that I use many more times in life. Orgo with Dixon is A LOT OF WORK though. I took it at the same time as genetics and with 17 credits and barely made it out alive (genetics took most of the hits in terms of grades though, all my other classes turned out fine.) It was definitely my hardest class but the most rewarding. It takes up a lot of time so be careful what classes you take along with it. Dixon is honestly such a nice, funny, and amazing person and professor, but she’s strict and will tell you how it is bluntly, so don’t expect any sympathy. But she really does care about her students- she’s not out to get you- she throws curveballs on tests but her logic is that she warns us about those curveballs ahead of time (truth.) She will present the information in class to you on a surface level basis and will expect you to enhance your understanding through the homework and weekly quizzes. I prefer having people explain things to me, so I took the initiative to enhance my own understanding by doing the crap ton of stuff I did outside of class listed above. If you’re looking for the easy A for orgo, don’t take Dixon. If you want to learn your shit (I recommend her especially for chemistry and biochemistry majors, although I was biology) take Dixon- even if you get like a B- you’ll be shitting on everyone else in Orgo II because you’ll know everything. I made it through with an A, and you can too!!!! (Insert “no ragrats” meme here) (She also really likes memes. If you ever go to her office hours mine is the Hey Arnold one.) I remember hating chemistry in high school and now I’m considering switching my major to biochem because I enjoyed learning orgo so much. The choice is honestly yours when it comes to taking her. I recommend. Also as the review below says, if you're going to professional school after college- take Dixon!!", "rating": 5, "expected_grade": "A", "created": "2014-06-30T23:35:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "Dixon is an excellent professor due to her constant attention to students outside of class. You will never again have a professor that has his or her office hours open every day for up to 5 hours!! Do not be intimidated by her. A friend had to eventually drop the class but she was very supportive of them because she knew that they cared about the course.\n\r\nPersonally, I learned more in this course than any other this semester. Her exams are very difficult but if you review the material a little each day and then kill it at Club Mckeldin the weekend before, you will be fine. Your effort will be reflected in your grade. Lots of partial credit on exams so do not leave blank answers! \n\r\nOverall, if you are interested in Medical School or graduate school TAKE HER CLASS. If you are looking for a job after undergraduate years, avoid or take for fun. I walked out happy I took her and I had little background in orgo I before.", "rating": 5, "expected_grade": "A", "created": "2014-01-05T23:56:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dixon is truly an amazing teacher! She's on the same page as the students in terms of work. She seems very hard at first with all of the orgo but in the end, you realize you learned a lot more chemistry than kids in other professor's classes. \n\r\nShe grades very fairly and as long as you attend every lecture, you'll likely get an A or B. ", "rating": 5, "expected_grade": "A", "created": "2014-01-03T15:45:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "I have had Dr. Dixon for Gen Chem 1, Orgo 1, and now Orgo 2. I would highly highly recommend her. She is tough. But you learn your stuff really well. And if you go to her office hours, she is more than willing to help you. And even if you don't want to talk to her, there is always like 10 other kids in there who also want to help you out and will think through things with you. Orgo 2 is also better than orgo 1- and she goes a little slower in that class it seems. She is one of the only professors at this school who remembers what it was like to be a student, so she really cares about her kids. If you can- take her. If you can't- just go to her office hours- she is a wonderful woman on top of everything else. really someone to be admired", "rating": 5, "expected_grade": "B", "created": "2013-11-14T20:21:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "I took AP Chem in high school and got a 4 on the AP exam (still bitter that doesn't count for credit) so this class was not as hard for me as it is for others.\n\r\nYeah, as everyone says, its A LOT of work. But I would highly recommend taking her if you have to take future chem classes, especially orgo. She puts a lot of organic chemistry into 135, so when you do take orgo you'll have a base knowledge and be ahead of people who didn't have her. Unfortunately for me, CHEM135 is the only chemistry class I'm required to take so it would've been better and easier for me to take someone else.\n\r\nI must say, she's an amazing teacher and actually teaches, but her tests are super hard.", "rating": 4, "expected_grade": "A", "created": "2013-10-02T15:43:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "I took CHEM135 and CHEM231 with Dixon. She is a very tough professor, but she wants you to understand the material. If you have a strong chemistry background in high school, I encourage you to take CHEM 135 with her, because you will gain a new understanding of gen chem. However, I regret taking her for CHEM231. Since I had almost no background of organic chem, she was just insanely tough for organic chem.", "rating": 3, "expected_grade": "", "created": "2013-07-15T14:49:00Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "If you have all the time in the world or are already a biochem expert, then this is the prof for you. If you're a regular full time student with a social life, AVOID THIS PROFESSOR AT ALL COSTS!\n\r\nBiochem is already hard to begin with... Dixon takes it to a new level.\n\r\nLetures: she's not good at introducting new material, she talks as if you already know the material and just further elaborates. I had to learn EVERYTHING from the textbook.\n\r\nExams: all free response questions and way too long. 50 mins is just not enough time to finish a Dixon exam and the averages are never higher than around 60%\n\r\nHomework: obligatory, difficult, and not even worth enough points. 5pts per assignment, which takes about 2 - 3 hours to complete each... and they are usually only 5 questions.\n\r\nPersonality: rigid and a bit unfair. she miscounted my total points on one of the exams. I asked if I can just get back the points I earned and should have gotten, and she flat out said no, simply because I didn't let her know about it earlier. I did email her (but she hardly responds to emails) earlier to let her know about the error, asking if I could hold onto my exam to study from it for the final and just show her my exam later (rather than leaving it in her office to correct).\n\r\nThe ONLY redeeming quality is that she is nice in her office hours. Literally answers any question you have and explains stuff for you. But going to office hours shouldn't be obligatory for earning a good grade...\n\r\nBOTTOM LINE: Dont.... just don't. ", "rating": 1, "expected_grade": "B", "created": "2013-05-14T12:37:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "ATTENTION: IF YOU ARE ANYTHING BUT A CHEM MAJOR OR ARE NOT INTERESTED IN CHEM, DO NOT TAKE DIXON! \r\nHonestly, she is the biggest mistake a freshman can make when taking chem135 and here is why. Sure she is cares about her students and what not, but her tests are NOT fair. She teaches one thing, and the test is 10x as hard as what she teachers. And the amount of Organic Chem she puts in to GEN CHEM is overwhelming. \r\nIf you are a chem major, take her, it is great preperation for orgo. BUT, if you are anything but chem major, AVOID HER AT ALL COSTS. You will have to put in hours for a class that is not even a priority. Take another proffessor, get a good grade, and never look back on chem. I promise you, AVOIDING DIXON WILL THE BEST THING YOU HAVE EVER DONE. ", "rating": 2, "expected_grade": "C", "created": "2013-05-02T11:53:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "I have read a lot about Dixon and how hard she was... All of it was true. Her class is easily the hardest CHEM135 class at UMD. That being said.. she is also the best professor.  If you do your work and you pay attention and poor effort into the class and into understanding everything, then you'll be fine.  She was very approachable and kind when it came to office hours and helping students.  I felt that I definitely earned my A from all the hard work I put into her class.  (I also love chemistry, am a Chem Eng major, and got a 4 on the AP chem exam the year before taking her class). Her first two exams are hard (I got a 69% on both); the third is impossible (I got a 49%)... Then I studied for literally 20 hrs for her final, got an 85% on the final, and walked out with an A in the class.  \r\nBottom Line.... If you are willing to work very hard and you love chemistry ... TAKE DIXON you might not get the highest grade, but you will walk out of there having learned a ton!", "rating": 5, "expected_grade": "A", "created": "2013-04-29T12:38:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "I hate to say this, but she is a great teacher. I hated that class so much. This is a fair warning for everyone: DO NOT TAKE DIXON UNLESS YOU A WILLING TO PUT IN MAXIMUM EFFORT. You will not do well if you do not study and practice for hours every week. I recommend getting the mastering chemistry, if not for the possible booster at the end, for the extra practice. Her class is tougher than steel ox balls. She is a very nice teacher and will give all of her time to helping you understand the concepts. She focuses on Organic Chem. Don't take this class unless you have to take Orgo (i.e. chemical/bio engineers or people on the premed path). I did barely get a C in this class. My average test grade was like a 44%. I laid in bed at night contemplating my schedule for the next semester, wondering if I will have to take this class again. Here is the twist, I tutored my friends in chemistry who had different teachers. You will get a better understanding of chemistry if you take Dixon than with any other teacher. Good luck and you have been warned. Mwuahahahahahah!", "rating": 3, "expected_grade": "C", "created": "2013-03-19T18:51:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Whilst Dixon is definitely a good teacher and will help you learn chemistry well, the class is definitely hard, and I don't think that it is worth taking Dixon. I would recommend taking an easier teacher for the better GPA. I had a pretty good Chemistry background (4 on the AP) test, and I received a B+ as my final grade. The  averages on her tests are consistently in the low 60's, and although she curves the whole class (about a 78 is an A), It is still hard to walk out with that A. The only advantage of taking Dixon is that if you are a Chemical or Bioengineer, she will prepare you very well for orgo, but never the less, your grade will suffer. ", "rating": 2, "expected_grade": "", "created": "2013-01-03T21:52:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Here's the thing about Dr. Dixon. She's awesome, funny, cool, and easy to talk to, no doubt about that. \n\r\nHer lectures are easy to understand and she's easily the best chemistry lecturer out of all of the CHEM135 teachers. She's also really helpful during her office hours if you can make the time to go to them.\n\r\nHowever, where my complaints lie about her are in the unnecessary difficulty of her material. While she goes over the same topics as other CHEM135 teachers, she incorporates organic chemistry as a huge component in her material. For someone who likes and understands orgo, this isn't a problem, but I was very confused whenever she'd use orgo as an example for a problem that could have been taught without it.\n\r\nThe exams in the class are very fair, albeit difficult, not only because of the difficult material, but also because you almost always run out of time before finishing them. She covers all the material on her exams in class, and they're reinforced in the somewhat-helpful discussion sections. \n\r\nThere isn't much homework to do for her class, just 3 assignments due before each of the three tests, but this is just as bad as it is good. The homework assignments themselves are very difficult, and are weighted pretty heavily in your final grade. But if you work together with some friends, they should be manageable.\n\r\nOverall, if you're going into a chemistry-related major like chemical engineering or bioengineering and you'll need to take orgo in the future, take Dr. Dixon. She'll whip you into shape for that. Otherwise, you'll just burden yourself with very difficult material for no reason.", "rating": 4, "expected_grade": "B", "created": "2012-12-16T22:12:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "She is very dedicated to her students. She makes time and holds a lot of office hour time for students. She may be rude sometimes but I have never seen her angry. She makes class decently fun. The topic is hard and you have to make the dedication to practice and do extra work. Definitely try to see her in office hours and you'll do great", "rating": 4, "expected_grade": "B", "created": "2012-11-30T20:02:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "Dr. Dixon has been one of the most difficult professors I've had at UMD... however, she will most definitely prepare me well for the MCAT.  I will say that I worked incredibly hard and found the final exam to be way out of my scope, but theoretically if I did more problems/was more familiar with the material, I could have been well within the A range.  Her curve is generous but don't take that as a reason to slack off.  If you stick to the motto of spending time in this class every day, going to her office hours, REALLY understanding her homework problems, finding OUTside resources to do problems, there is no reason you shouldn't do well. However, any less and you'll be gambling your chance to get an A. \n\r\nGenerally, her rule is if you get more than 50% of the total points in the semester, you will get a C.  Some, however, find that hard to do so by not putting in the time.  Others will earn that A and prove that it's far from impossible.", "rating": 4, "expected_grade": "B", "created": "2012-07-10T17:15:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Take Dixon! It's about all I can say.  There's a reason why everybody always attends her lectures and tries especially hard in her class, but she's very encouraging and dedicates a lot of time to her students.\n\r\nFor me, she made orgo bearable. I laughed at all my friends who had other orgo teachers.", "rating": 5, "expected_grade": "B", "created": "2012-05-17T15:28:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Two Words: F***ing Awesome\r\nDr. Dixon can be hated on by all these goons on this website because none of them want to put in any work. If you have to take Orgo, you're most likely in a major where your career path demands you KNOW your stuff. Dr. Dixon gets that done. If you want to go pre-health shes the best prep tool youve got for chemistry. And if you dont want the challenge, then drop premed please, I don't want you operating on me or my child if you didnt want to be challenged with organic chem.\r\n I got A+s in gen chem and orgo with her, but I worked for them. I also went to her when I needed to because she loves her students, and wants us to succeed. Im even taking orgo II with her this summer because I love her teaching style so much. As for her testing style, yeah, they suck. Getting the average is something to be proud of (so just hope you know more than those sitting next to you). Its awesome when you are talking to kids with different orgo teachers and they have no clue what youre talking about because thats how much material Dixon manages to teach you. \r\nApart from the learning she is really an awesome person just to go talk to about life. She's funny, personable, and will go out on a limb for you if you truly need someone. Love the woman. Take her", "rating": 5, "expected_grade": "A", "created": "2012-05-17T11:26:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Is she hard? Yes. Is it worth it? Absolutely, especially if you plan on taking orgo ii and/or the MCATs. She is an incredible teacher who does push you. She herself is not intense: she'll often go on tangents about her past or her family. And she frequently plays music before starting class. There are also many extra credit opportunities. You'll find this echoed in other review below, but I cannot emphasize enough how important it is to do those problem sets and visit her in her office hours. She strongly encourages students to do both and for good reason. If you're serious about your studies, don't be discouraged by friends who say that she's too hard and it's not worth it. An A is within your grasp (thanks to her generous curve...and hard work!). If I could take her for orgo ii, I would.", "rating": 4, "expected_grade": "A", "created": "2012-05-15T14:56:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "This class is literally a joke. When you read bad freshman reviews on here, don't pay them any attention. The main problem is that these freshman come in expecting to do no work. My chem professor in high school was so bad that I basically came in with zero chem experience, and I still came this close to getting an A+. Dixon is nice and shes pretty good at teaching.\n\r\nDos:\r\nTHE MASTERING CHEMISTRY\r\nALL THE EXTRA CREDIT PROBLEMS\r\nUSE HER STUDY GUIDES\r\nUSE THE GSS STUDY GUIDES\r\nGO TO OFFICE HOURS\n\r\nDon't:\r\nPiss her off\r\nWhine\r\nGet below a 50% on the exams(auto fail if you do this)", "rating": 5, "expected_grade": "A", "created": "2012-02-20T23:59:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon is one of those feisty professors that people love and hate. She expects a lot from her students but also makes class fun. She was definitely a babe back in the day btw. If you have bad study habits you will die in this class. But if you study, you will do well and will be rewarded. As others have said, if you like chemistry you will love it with Dr. Dixon. But you will most certainly hate the class if you can't relate to chemistry. She gives quizzes every two weeks, the occasional clicker questions, three \"midterm\" exams, and one final exam. If you do the optional mastering chemistry you can earn extra credit. She also gives an extra credit question every week that you work on out of class and e-mail her the answer before midnight. Although the exams are tough (because it is hard to predict the questions asked) Dr. Dixon has a large curve for the overall class. So overall, if you put work in, you will surely get an A or B. If you challenge her teaching methods in class, prepare to be humiliated. If you joke with her or dress up, she will always play along and so will the 300 other people in the lecture hall. She is a nice person that truly wants her students to learn and will help the most she can. Just take her for the experience. ", "rating": 4, "expected_grade": "A", "created": "2011-12-26T22:50:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "What can be said about Dr. Dixon that has not been said? Excellent lecturer and cares tremendously about your grade if you care about it. The class is not easy by any measure but it is very doable if you put in the time that Dr. Dixon expects. Other CHEM135 classes will be easier but they will not prepare you nearly as well for Orgo. Dixon is in her office hours more than any other chem teacher and is helpful if you go to her although she may seem intimidating at first.", "rating": 5, "expected_grade": "A", "created": "2011-12-22T14:46:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon is a very good lecturer for chemistry. You will definitely learn a lot from her class. At the same time, though, you have to work hard. I recommend taking her if you have some prior experience with chemistry because she does assume you have some knowledge of chemistry going in. Exams can be stressful because of the limited amount of time to do them, but they are certainly doable if you study hard.\r\nTips to do well in her class:\r\n-Memorize ALL of the ions early on. She does not directly test you on how well you know your ions, but she refers to them a lot on clicker questions and exams. \r\n-Know your organic nomenclature early. Yes, she is organically inclined and will constantly test you on organic nomenclature throughout the course. I found that I only used the book to review organic nomenclature; she pretty much gives you notes on other material you need to know.\r\n-Study Hard! Practice exams are available in some fraternity, but they are a pain to access. The practice exams are a great study tool, but bear in mind her curriculum changes from semester to semester. Also go to the guided study sessions near exam time; they help A LOT.\r\n-Go to her office hours! While she is quirky in lecture, she is far more relaxed in her office, so go there if you need to ask a question or get clarification.\n", "rating": 5, "expected_grade": "A+", "created": "2011-12-05T04:27:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon assumes you have a decent knowledge of chemistry from High School, if you don't, then I suggest you take another professor. I'm not sure of the difficulty of the other professors teaching this course but it always seemed as though Dixons class was the hardest. Her tests aren't that awful, if you study your notes then you should be fine, she only tests concepts that she goes over in lecture which is nice. She is a good teacher but a hard grader and expects you to learn way more (including organic chemistry) than you would in any other general chemistry course. Basically, if you want to LEARN chemistry, take Dixon. If you want a good grade without too much effort, take another professor!", "rating": 3, "expected_grade": "B", "created": "2011-10-17T23:55:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon is definitely one of the better chem135 professors. She actually teaches really well but holds us to a high standard. Therefore, this class is not an easy A. You have to work hard. Her exams can be difficult but if you take good notes and go to her office hours you should do well. She has the most office hours of all professors. During lecture she can come off as a quirky and sometimes strict professor, but she is actually really nice and so DO NOT be intimidated to go to her office hours. She is there helping students almost everyday of the week. Also, she has tons of extra credit points which are easy if you spend a little bit of time on those. Do them all and it will help you in the long run. She curves the entire course. I think 75% and higher is an A. But she is really fast during lectures and sometimes the taught material might just go right over your head but she answers questions in class during lectures. Ask questions if you don't grasp the materials. But one major drawback is that she expects us to have a decent grasp of basic chem coming into this class. Sometimes I felt like she was referring to AP Chem because the things she said I should have known from high school chem, I didn't know and sadly I never took AP Chem but still I ended up doing well in the class. So, she tends gloss over stuff sometimes. But be warned that Dr. Dixon teaches organic chem in a gen chem class. Organic chem can be overwhelming but if you study its not bad. The engineering school apparently wants student to have seen some basic orgo chem stuff, thats why she taught it. If you are a CHEMICAL OR BIO ENGINEERING student, I would recommend taking her because she gives an overview of some organic chem concept which  should help us with organic chem courses that we have to take after chem135. If you aren't that interested in Chem, don't take her. If you love Chem, take her. She'll make you love Chemistry more. She is awesome.", "rating": 5, "expected_grade": "A+", "created": "2011-10-06T03:27:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "If you have a solid background in chemistry, then definitely take Dixon (because you will probably love her).\n\r\nIf you DO NOT have a solid high school background in chemistry, then DO NOT take Dixon. Although there are no prerequisites for the course, she assumes that everyone understands chemistry coming in, and builds off this general knowledge that everybody [should] have... which meant I had to outline each of the textbook chapters, just to have some sort of context for understanding the notes we took in class.\n\r\nShe does curve significantly (if you get at least a 50% in the course, you should finish with at least a C). If you receive a grade on the final higher than the grade you had in the class before the final, then she will bump your grade up  (i.e. if you started with a C, an A or B on the final will but you up to a B for the semester.) If you have an A before the final then she will just figure the final into your grade, as it would be for any other class. My issue with this policy is that she refused to tell students the total points they needed on the final to get a specific letter grade (even after it was over), and she wouldn't  tell students the total points they needed to get a specific grade in the class (even after all assignments had been handed in and graded). Is that even legal?\n\r\nI put significantly more effort into this course than my other classes, and still only received a B. If you take her, definitely go over your tests to check for grading mistakes.", "rating": 2, "expected_grade": "B", "created": "2011-07-17T17:56:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dr. Dixon is one of the better teachers I have had at Maryland, however she will make you work your ass off so if you better be willing to put in a lot of time to understand the material.  Also, go to her office hours if you dont understand something.  She literally is in there everyday helping students so get stuff clarified the first time you dont understand it, otherwise it will compound and the following exams all build on the previous ones.  And definately form a study group, it was one of the best ways to further understanding.", "rating": 4, "expected_grade": "B", "created": "2011-07-12T09:24:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "I just finished Orgo II this summer and everything you have heard about this woman is true.  She can easily be the best and worst teacher you have ever had.  One thing is for certain, she is by far the busiest professor I have ever seen at UMD.  She constantly has students in her office, meetings to go to, calls to answer, letters of recommendation to write, etc.  That being said she is very willing to help you IF you have legitimate questions about the material you have already prepared.  Nothing angers this woman more than to go to her office and say \"I don't understand this, how do I do this, how can I pass\".  \n\r\nGrading: Her tests are absurdly difficult and require complete understanding and memorization of every reaction and mechanism.  Even knowing that you aren't guaranteed to do well on her tests.  The average for my class on each of the 3 exams and the final was between 50-60% for each one.  That being said there is obviously a curve which only really depends on your classmates.  She has no set numbers and you are truly at the mercy of how well your classmates are doing in the class.  One really good thing about Dixon is that she factors how well you do on the final into your grade and you may be able to move up an entire letter grade depending on how well you do on the final (which is also ridiculously hard).\n\r\nOverall I would definitely recommend Dixon for Orgo II.  You will learn more from this woman than nearly any other professor at UMD.  However, if you are not willing to put in at least 15-20 hours or work a week outside of class DO NOT TAKE THIS CLASS.  You will fail.  No questions about it, unless you are some kind of chemistry genius.  If you want to skate by with a C with minimal amount of work take a different professor.  Earning a C in Dixon's class is a victory in itself.  But she will prepare you the best for the MCATS, DATS, and PCATS if that is what you are looking for.\n", "rating": 4, "expected_grade": "A", "created": "2011-07-10T22:18:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon is THE BEST chemistry teacher there is at UMD. Her class is going to be TONS of work and you'll have to put in a lot of time, so don't go in expecting it to be a walk in the park. \n\r\nThat being said, this woman is one of the nicest professors I've ever had. At her office hours, she'll give you a bit of tough love and push you to make you figure things out on your own, but you'll always leave feeling a thousand times better and completely understanding the material. Her tests and quizzes are pretty difficult, but there is a curve because of it.\n\r\nI would definitely recommend Dixon to anyone who has to take chem131, chem135, or the orgos. You'll learn so much! Also, if your TA is Lenea Stocker, GO TO HER! She'll help you out a great deal as well. ", "rating": 5, "expected_grade": "", "created": "2011-07-05T22:16:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "The class is HARD, but if you do everything she tells you, keep randomly practicing mechanisms and go to her review and her office hours, and A is definately achievable. Its something that just requires a lot of time and if thats something you don't have, don't take the class. However if you're not a book learner and you need someone to teach you, she is the teacher for you", "rating": 5, "expected_grade": "A", "created": "2011-05-28T16:37:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Bottom line: Don't take Dixon for organic chem. She is a nice woman and very helpful, but her exams are downright impossible. I studied for weeks in advance for every exam and still would do horribly on them. Yeah, she knows her stuff, but it's not worth the semester of suffering. ", "rating": 3, "expected_grade": "C", "created": "2011-05-20T21:05:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "She is really a fantastic teacher. She makes sure that you know organic chemistry, and there is no way pass her class without learning it. At one point she mentioned that her grade distribution was very bimodal. A lot of students were passing but a lot of students were also failing. The reviews here seem to reflect that a bit. If you need to take this class just to get through it don't take Dixon, otherwise take her she is great.", "rating": 5, "expected_grade": "A", "created": "2011-05-20T18:49:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon is really nice and approachable. However, she makes the class unnecessarily difficult. Organic chemistry is her baby so she incorporates a lot of that into Gen Chem, that she also unfortunately tests on. She likes to write exam questions about exceptions to general chemistry rules, so watch out for that.\r\nDixon also offers a lot of extra credit. Homework is not mandatory for her class, and I never did any. However, if you complete most of the online homework assignments, you get bonus points at the end. She also assigns extra credit assignments randomly throughout the semester, worth anything from like 2-10 points. She gave the option of a 10 extra credit point assignment just to tell her whether Duracel or Energizer made better batteries. No sources, no explanation, nothing else required. Just which one is better.\r\nDixon doesn't use the book to teach. She's a great lecturer. She also periodically sends out homework questions for practice that she writes herself. If you take her, you don't need the book unless you think you'll really do the extra reading or practice problems (besides the problems that she sends out, or is on Mastering Chemistry your usual online homework)\r\nIn addition to all the extra credit, she also has a big curve at the end (about 20%). Having taken AP Chemistry and Chem131, I had no trouble in this class, but my general impression is that most people struggled a lot with Dr. Dixon. Her exam averages are usually low (50-60). However, if you want to learn a lot of chemistry, take her.", "rating": 5, "expected_grade": "A", "created": "2011-05-19T16:39:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "All of the five star ratings are there for a reason. She really is the best. Her class is much harder, and you will learn a lot more than other orgo classes.\r\nShe's a great teacher though. She seems really intimidating, but just go to her office hours. If you don't have any questions, just sit there and work. She'll chat with you and make you problems from the top of her head that are pretty much exam problems. When it gets close to exams, other students will be in there and you can learn from them too.\r\nShe'll answer any question if you have a specific question, and she's in her office all the time. Go there and learn from her and you'll start actually enjoying orgo, if that's even possible.", "rating": 5, "expected_grade": "C", "created": "2011-05-11T17:31:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "I took this class spring '10 and I absolutely loved Dixon. She is the best teacher for organic chemistry ever.  She teaches the material in a way you will always remember it, and her office doors are always open to those who need help.  Actually, her office is always crowded.  She truly prepares her students or organic chem 2.  She is, by far, my favorite professor at Maryland.", "rating": 5, "expected_grade": "A", "created": "2011-05-08T22:25:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "I am dedicating my OUR UMD account to Dr. Dixon. She is possibly the worst teacher i have ever had. She expects you to know organic chemistry till your brain is dead...and does not do anything from the book. Shes just terrible.", "rating": 1, "expected_grade": "F", "created": "2011-05-04T21:00:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "DO NOT TAKE DIXON\r\nunless you are amazing at organic chemistry (Yes I am aware this was supposed to be a general chemistry class) and even then you'll want to die like the puppies she eats\n\r\nShe has a vendetta against engineering students. She refers to them as \"you people\" and has said \"You guys are the stupidest engineering class I've ever seen.\" In our half a semester, we have covered more than those who have taken general chemistry I and orgo I. I asked a friend in Orgo II for help and his response was \"I've never seen a problem like this before in my life.\" \n\r\nIt is unfortunate that ourumd requires a rating of at least one star as she hasn't even earned that.\n\r\nShe constantly complains that the Chemistry Department is not allowing her to teach Orgo next semester and seems to be taking it out on us.\r\nIn her office hours, there were ten students from CHEM135 and two from CHEM231. She spent her entire time with us sitting directly next to the students in Orgo, leaving the CHEM135 students to fend for themselves, like her children in the back of the lecture hall. \n\r\nIf anyone reads this, please help me. I'm DIENE... chem joke, if you don't get it, don't take her. If you do get it, don't take her. You will probably consider to be one of the worst decisions in your life thus far... If you survive. ", "rating": 1, "expected_grade": "A", "created": "2011-04-07T00:13:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Take her!!  If you really want to learn, that is.  Dr. Dixon is a fantastic teacher!  I really wish she taught Orgo II as well.  She is extremely dedicated to helping her students and really makes herself available to students. Granted, her exams are hard, but they aren't impossible.  If you go to her office hours, study hard and really try to learn the material (rather than rote memorization), you'll be able to get an A. Also, she grades ridiculously fast; our grades were always up within 8 hours of taking it.\n\r\nSome people say you have to practice Orgo everyday to get an A, but that's not true.  When you do study for Orgo, put all your effort into it and you'll be fine.  There are tons of extra credit.  On the last quiz and on our final, there were more points than what she made the final grade out of; our last quiz had 85 points, but she counted it as out of 75. Plus, the curve is always enormous.  If you try to always get at least a raw C, you'll probably end up with an A.", "rating": 5, "expected_grade": "A", "created": "2011-02-01T22:45:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Some days I loved Ms Dixon, but most days I hated her.  She made exams very stressful by yelling random things in the middle of the test like \"I have written the names of the people who I have no quiz 6 grade for.\"  She taught too quickly.  She gave clicker questions but never gave enough time to answer.  I would have had trouble if I had not taken AP chemistry.  ", "rating": 2, "expected_grade": "A", "created": "2011-01-16T21:32:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dr. Dixon is a great professor who stimulates the class. Like everyone else here, I agree that she makes you legit learn organic chem. I also agree that this is one of the hardest classes that I ever took. It is not so much the material as it is the amount. There is so much stuff Dr. Dixon wants you to learn that only the most dedicated of students can master everything in time for the exam. An A is very difficult because it necessitate constant studying to keep up with the material. Sadly, I just didn't have that kind of time. Had I been a better and more focused student, it would have been no problem. So be warn, you'll learn a lot. But prepare to work like you've never worked before.   ", "rating": 4, "expected_grade": "B", "created": "2010-12-22T22:56:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "I had a low B but I got an A on the final and she gave me an A for the course.  Her tests can be tricky, but she has a fair curve to compensate for them.  She is able to control the class quite well too.  She also grades extremely fast.  Overall she puts in so much extra work to help you, which is uncommon for an intro class.", "rating": 5, "expected_grade": "A", "created": "2010-12-17T17:31:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon knows her material very well. I think she could a couple more examples when teaching, but I understnad that she is stressed for time. She wants her students to understand, but they need to come to her for help.\r\nI would strongly recommed her if you have taken AP Chem in High School. She sometimes teaches and than mentions that what she is currently teaching is something that should just be review from high school and that she's not going to go into it. \r\nAP Chem was not offered at my High School, and a lot of the material was new to me, so I was lost through out a lot of the lessons.\r\nThe tests and quizzes are pretty straight forward, though hard. She curves a lot at the end, and extra credit is available in the form of questions she gives during class to be completed and emailed to her at night. \n", "rating": 3, "expected_grade": "B", "created": "2010-12-16T02:29:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "she is probably one of the hardest teachers out there. but she balances it out because she is an excellent teacher. i will admit after one of her lectures it feels like your brain is about to explode. the tests and quizzes are very hard and she usually puts in at least one problem never covered to make you really think. all of that said we were doubling the amount of material learned in any other orgo class and she really tries extremely hard to help everyone as much as possible. office hours, workshops, and she tries to get a good TA (which she did for our semester). she is a great teacher and explains the material very well. take her if you can and get ready to work.", "rating": 5, "expected_grade": "A", "created": "2010-12-12T01:50:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Bonnie Dixon is a fantastic teacher, and if you put half the effort into her class that she does, you will learn a lot and be very prepared for orgo 2. \n\r\nLecture notes are useful and well organized, and this crazy lady held an extra hour of discussion every week to review the material for those who wanted it. Office hours are extremely helpful, and she really, really cares about her students succeeding. There isn't much that is easy in this course, but Dixon offers everything you need to do very well.\n\r\nShe's also probably the nicest and most approachable professor here. I still go to her office just to say hi. Take her course if you are serious about learning.", "rating": 5, "expected_grade": "A", "created": "2010-11-19T22:34:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "the hard facts are...\r\nnice lady, funny quirky\r\nvery hard exams and decently hard quizzes\r\nneed to go to all lectures\r\ndiscussion is useless form the most part", "rating": 4, "expected_grade": "B-", "created": "2010-10-31T20:45:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "While Dixon is definitely, shall we say, quirky, she really is a good professor. She moves quickly, but she knows exactly how to efficiently use the blackboard- which makes it really easy to take notes.\r\nHer exams and quizzes are not easy, by any means, but they are definitely fair. She also curves a tremendous amount- if you get 50% uncurved, you can expect to walk away from the class with a C.", "rating": 5, "expected_grade": "", "created": "2010-08-31T20:38:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "one of the best professors in the school. if your going to take orgo, make sure you take it with Dixon because you'll actually learn the material. if you really want an A, be prepared to work your ass off for it. exams tended to test understanding of the material.", "rating": 5, "expected_grade": "A", "created": "2010-07-20T22:47:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "She makes lecture at least a little fun, and is always very sparky and preppy. As students, you can mess with her and she'll go with it. She teaches very fast, which was probaly my biggest complaint, and not really by the book at all, although before tests it may help to find the corresponding chapters in the book to review.\n\r\nHowever, what she teaches is what you need to know. Go to lecture and take good notes. Don't go to discussion; I found it a complete waste of time after going the first time and didn't go again except to pick up tests and quizes.\n\r\nShe gives mad extra credit and weekly quizes (non graded) that are good study material for the actual in-class quizzes, which aren't bad and shouldn't affect your total grade too much. The tests are the main part of the grade.\n\r\nAlso, she had a HUGE curve. I think a 73 % was considered and A, and she had a policy that said as long as you earned half the points in the class, you would pass, so basically a 50% was a C.", "rating": 4, "expected_grade": "A+", "created": "2010-07-10T14:43:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "DIXON IS AMAZING TAKE HER! I was in her summer semester because I dropped it in the spring with another professor. \r\nThis class is ALL about practice and she's the only organic I teacher I know about that writes weekly quizes and problems for her students to review and practice with. \n\r\nPeople warned me not to take her, telling me how hard her class was, but if you do all of the problems she gives you, you will learn ochem and get an A. This term she had a bunch of extra credit as well which helped.", "rating": 5, "expected_grade": "A", "created": "2010-07-08T20:18:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "If I could give Dr. Dixon 100 stars, I would do it. A few things that made her great were\r\n1. The book SUCKED, and she taught in her own way following the chapters and did a grand job\r\n2. She actually cared about our understanding of the material. She gave homework assignments and workshops that helped explain steriochemistry. Honestly that was probably the only way I was going to learn it.\r\n3. She had 4 times established for office ours AND said that if she was in her office we could ask her questions. Not only was I able to get help outside of class, but we also chatted about life as well.\r\n4. She is the best professor that G-d has ever created and I will miss her dearly next semester.", "rating": 5, "expected_grade": "A", "created": "2010-06-12T12:57:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Originally took CHEM231 with Dr. Lee Friedman and got a C- (I probably deserved an F though). Took CHEM231 again in the summer, but this time with Dr. Dixon. Bottomline: She is AMAZING. Dr. Dixon LOVES chemistry and knows how to teach it so others can enjoy it (yes, even if you hate chemistry). I think she has a masters in education, and it definitely shows in her teaching! She's very helpful and does plenty of practice problems. HIGHLY recommend her!", "rating": 5, "expected_grade": "B+", "created": "2010-06-03T21:09:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "When I signed up to take this class, a lot of my older friends advised me against it, telling me to take the easier professors to save my GPA. Suffice it to say that I was pretty scared for my grade going into the class.\n\r\nThat being said, Dr. Dixon has been one of my favorite professors so far in college. Never have I met someone who does more to help her students succeed. I'm fairly certain she literally lives in her office waiting for students to come by and get help on the email problems or on old test questions that they don't understand, and what she said at the beginning of the semester is true: organic chemistry is like a part-time job.\n\r\nShe doesn't really go by the textbook at all - it was useful to go over nomenclature and basic information for the first quiz, but after that, I barely used it at all. If you go to her weekly reviews, go to her office hours, and do the weekly \"quizzes\" that she emails out, you will be as prepared as you possibly can be for her exams. She focuses on helping you actually UNDERSTAND the way reactions work, not just memorize them. So yes, her exams are tough and yes, the averages are dismally low (usually around 50 percent), but hey, that means that if you can manage to get half the questions right on a test, you got a B! I had a solid B average all semester (I scored right around the average on both quizzes and one exam, and did significantly better than the average on one exam), and as she promised, I got an A on the final and an A in the class. But it's not a 90% A - it's an A, as in one standard deviation above the average.\n\r\nPeople will tell you that she is difficult and that her class is work, and both are true, but if you want a solid foundation in organic chemistry, and a professor who is so willing to help you with anything and everything you want to ask her about, then Dr. Dixon is definitely the right choice. I haven't once regretted my decision.", "rating": 5, "expected_grade": "A", "created": "2010-05-22T02:46:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Love Dixon! She's a good teacher, she'll always answer your questions. Go to lecture, they're worth going to. She'll make lecture fun too. She ocasionally do clicker questions, so watch out for that. ", "rating": 5, "expected_grade": "A", "created": "2010-05-20T17:02:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Orgo is a difficult class no matter who you take it with. Might as well take it with someone who teaches it well and makes the course...dare I say it...fun. She clearly has a lot of enthusiasm for the subject and for teaching, and this made her lectures very engaging. Not a lecture will go by where she doesn't crack a hilarious joke or make you smile! She does move quickly in lecture, so try to study the material before you come to class so you can keep up. Must attend class. You need those clicker points.\n\r\nYou do have to work hard for a good grade. There are numerous \"tricks\" in OChem and lots of rules you need to string together--significantly moreso than in Gen Chem--and Dr. Dixon will make sure you learn these. DO NOT BUY THE TEXTBOOK. I learned more from Orgo CliffsNotes for free online. I did much better in class once I tucked away the book and relied on her practice Qs and office hours (my exam grades went from E on the first quiz to an A on the final--very real difference). The trick to this class is practice, practice, practice--you CANNOT learn everything you need from the textbook, and Dixon sends out plenty of practice problems that cover all the info you need to know. They cover a lot of material, so if you're confused about something (and you will be) go to her office hours. She'll help you out. Workshops (3, during discussion), homework assignments (3), and weekly reviews are also essential prep for exams.\n\r\nRemember, there is a curve. It's a hard class, but you're graded on how you do relative to everyone else. And I guarantee you, everyone else is crapping their pants during exams too. Just do around average or better on exams (not too hard since class averages around usually Ds or Es), and you'll get at least a B.", "rating": 5, "expected_grade": "A", "created": "2010-05-15T19:39:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Second time taking Orgo 1.First time I took it with Ammon cuz I didn't know any better...I was an ignorant little freshman...sigh...silly freshman...smh.\n\r\nAnyways, Dixon's great. She does practically live in her office to help you, and she has other work for points besides exams, like homeworks, workshops, clickers(although i didn't like this cuz I usually didnt feel like going to class, and i'd miss clicker points), quizzes and extra credit to help keep your grade afloat. \n\r\nOkay, look. This is a research university. Most professors here only really care about their research and the whole teaching thing is kinda just part of the deal between them and the school. They probably don't even wanna teach, but they have to. They could care less about their students. I always wondered why the hell someone with a Ph.D is all of a sudden qualified to teach. Ya I get it they're really smart, but shit that doesn't mean they know how to teach that information to students effectively!\n\r\nDixon is here to teach. She uses great learning techniques and breaks things down to really help you understand the material, instead of just flying through a damn powerpoint.\n\r\nTake her, and if you work hard it will pay off. Some classes you work hard and still fail, this class is different.\n\n\r\nMY BEST ADVICE for ORGANIC I regardless of the teacher is:\n\r\n1. Go to google.com\r\n2. Type in \"Carey\" + \"Organic\"\r\n3. Click the first link.\n\r\nIts a great website that summarizes organic chemistry in a simple an easy-to-understand way :)", "rating": 5, "expected_grade": "A", "created": "2010-05-15T17:21:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Here's the deal:\n\r\nThere are two types of students in this world: those who go to class and those who don't. Some students who don't go to class manage to still pull off good grades. But in this class, if you don't go to lecture you WILL regret it. Forget buying the textbook. I don't think I opened it once this semester...she e-mails loads of crap to you that basically acts as a substitute. \n\r\nAnyway...TAKE ADVANTAGE of the extra credit opps. Seriously, that's what I regret the most about this class. I blew off most of that stuff (and didn't go to lectures so I missed clicker points) assuming that I would do well on the quizzes and exams..Boy, was I wrong! \n\r\n*shrugs* she teaches pretty well, and has weekly review sessions and pre-exam review sessions.....I dunno I guess take her, but just know that whatever teacher you take for organic chem its not gonna be easy AT ALL, and you need to mentally prepare for hard work BEFORE you dig yourself into a whole by the end of the semester.\n\r\nGood luck\n\n", "rating": 3, "expected_grade": "B?", "created": "2010-05-15T17:18:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "Dr. Dixon is a great teacher. She's definitely challenging, but she knows how to prepare students for Organic, which is really important. Be prepared to work and study. You may get low percentages, but don't forget she does curve a little. Go to every lecture to get clicker points. If you need help, go to her office hours because she really wants to help you. TA was also great", "rating": 5, "expected_grade": "A", "created": "2010-04-06T17:46:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Let me preface by saying that my preferred learning style is visual, not auditory.  I need to be able to read something several times over so I can process that.  However, Dixon is really geared towards auditory learners.  You HAVE to listen during lecture to get the class.  She has also worked very hard to develop a curriculum that she feels is best, which means she doesn't really stick to the order of conventional textbooks.  She's really a great teacher, I won't deny that, but if you are someone who likes to take the time to sit down and process things on your own, you're going to be out of luck here because she doesn't provide many resources for learning the concepts outside of the class.  She certainly provides a lot of practice work to hone your skills, but if you didn't pick up the methodology or conceptual bit in class, you're out of luck.\n\r\nThe textbook we're asked to buy makes a great doorstop.  She told my class that she basically doesn't use it, except for a list of practice problems from the book she gives out.  However, those problems aren't generally in the style she uses in her own problems and on tests, so they aren't much good.  Ask yourself if you want to pay $100+ for some okay practice problems.  You're better off buying Organic Chemistry as a Second Language, which is how I learned most of the concepts.  I would recommend getting a jump on everyone else and just make a habit of going to her office hours from the beginning.  No seriously, just write it into your schedule like it's another discussion section for the class.  You really need to have her there, answering questions about little technicalities, before they come back to haunt you on a test.  She loves throwing in problems with them.\n\r\nOverall: 5 stars for auditory learners, 2 stars for visual/textbook-based learners.  This is the class to take if you want to go to medical school.  If you're majoring in something else that just has this class a requirement and you won't be using ochem much/taking the mcats, take another easier professor.", "rating": 4, "expected_grade": "", "created": "2010-01-18T14:07:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "I think Dr. Dixon is an excellent teacher. First off, organic chemistry is going to be hard no matter who you take it with. The reason I learned so well from Dr. Dixon is because her format of teaching was a very logical approach rather than fooling around with molecule model sets and picturing stuff in thin air. I appreciated her step by step, fool proof methods of tackling these problems. On a side note, if you are more of a visual learner then maybe a teacher who uses molecule model sets would be best for you. If you like the step by step, logical approach then she's your best bet. I will admit, she is very tough but if you want to take the MCAT or if you know you will be moving on to ORGO 2 then I think you will be most prepared if you take Dixon. If you're pre-med then I definitely recommend her. If you're just looking for the easiest way out of this course then I would question your motivation toward being pre-med to begin with. Dr. Dixon is such a good teacher that not only did I get an B in her class, but I never once opened my text book. She gives TONS, and I mean, TONS of study guides, outside help, answer keys to practice quizzes. I never once needed the text book. I would have had an A if I hadn't bombed the final. With that being said I feel that the final was very fairly written, I was just retarded from lack of sleep. And I'm not one of those freakishly wierd genius kids either. As a matter of fact, I failed G chem! \r\nMy advice if you take her:\r\n1. GO TO LECTURE. If you miss lecture, consider yourself done. You cannot expect anything better than a C if you don't go to lecture. Her exams are ripped straight out of lecture.\r\n2. Do all of her practice quizzes and study guides that she emails to you. They help so much, especially if you try to work through them yourself before you peek at the answer key.\r\n3. GO to office hours! The woman practically lives in her office to help you, you should take advantage! If you have any doubt or question on one of those practice quizzes then go straight to her. You can guarantee it will be on the exam.\n\n", "rating": 4, "expected_grade": "", "created": "2010-01-04T16:33:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "Take another professor.  Very nice lady.  But if you care about getting an A or B, not the person you want to take.  Class is challenging.. but too challenging unless you want to be a chemist.  Take it if you are passionate about chemistry.  If not take another professor.  I also had her Organic Chemistry 1, it was awful as she moved way too fast so I did not absorb much.  Phil DeShong is a much better professor and actually teaches much more concisely and gives examples, which she does not do enough of. ", "rating": 1, "expected_grade": "C", "created": "2009-12-30T23:17:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "I will attempt to be as objective as possible. Dr. Dixon knows her stuff and forces you to do so as well. By the end of the course, you will feel like you can teach general chemistry. Her real trick is to intimidate you and force you to understand chemistry. She gives very difficult exams which require you to apply what you know. To do this you must review her lectures daily and really devote time to the class. Thus by giving such hard tests she is pushing her students to study a lot in order to understand the material. I spent a lot of time for this class and ended up with a B+. If you are up for the challenge then take her. Yes she is very tough but it all works out in the end. If you put in the effort you will get the grade. That being said, I do believe that she can stand to move a little slower and not try and scare her students so much. I along with many other freshman, felt that she demanded too much of her students who were not used to thinking the way she wanted us to. Additionally, her pace/exams can discourage many people. Overall, it's tough to rate this professor because I'm glad that I understand chemistry at the level that I do, but I know I would've received an A with another professor. Therefore, I am still trying to figure out how I truly felt about the course. I don't know if I want to challenge myself again and take her for organic.      ", "rating": 5, "expected_grade": "B+", "created": "2009-12-27T01:27:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "Effective teacher.. but too much information and extra info that it was hard to keep up.  For sure I would take someone else.  Her exams discourage you because the questions are so warped and time consuming!", "rating": 2, "expected_grade": "B", "created": "2009-12-23T04:48:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "Damn, listened to you guys down below saying how great she was, wtf?!\r\nShe goes so damn fast in the damn class like a damn car. \"Grades will not reflect what you learn\"....that's all everyone cares about, the grades!!!!!!!!!!! my gpa got killed, and I'm not even from america damn this country, how unlucky this semester i have dixon and gold at the same time", "rating": 1, "expected_grade": "", "created": "2009-12-22T17:44:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dixon is amazing. First of all, you cannot complain about it being hard because many people want to be doctors and you have to knows your stuff if you want to be a doctor and she knows everything! go to office hours...get to know her. she will remember your name and it pays off. Go to every lecture and take great notes and study study study. you will get a good grade if you do those things. no way around it. I run circles around my other organic friends who have different teachers because I know so much more than them from dixon. take her and go to office hours, discussion, review sessions and you will be fine. dont slack off for a second. it will all pay off. there is no way around it. ", "rating": 5, "expected_grade": "A", "created": "2009-12-20T02:04:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "First of all, she is HARD. There's no way to get around it except studying quite hard and long before each exam. Go to her office hours frequently and DO NOT wait if you have questions. Material builds on itself quickly.   \n\r\nThe good:\n\r\n1. Covers more information than all other Orgo teachers, which greatly prepares you for future chemistry classes. \n\r\n2. She makes herself very available to students in her ample office hours. Sometimes I think she spends the night there...\n\r\n3. She makes class fun and engaging, so you hardly ever lose concentration. She cares about her students and really pushes them to do well.\n\r\nThe Bad:\n\r\n1. She's terribly disorganized. Her notes are all over the five boards and don't seem to follow any logical pattern.       \n\r\n2. Her lecturing pace is incredibly fast. She often forgets that Orgo I was design as an intorductory course for students who have never been exposed to the material before. This leaves the class lost and confused. \n\r\n3. She presents numerous concepts without giving many examples. This also leaves students lost and confused. \n\r\n4. She is always busy, so even if you make it to office hours you're likely to not get much of her time (DO go, though! Others WILL help you). \n\r\n5. Most people will do poorly on the exams with the exception of the few who'd get legitimate A's. It's quite demoralizing, but don't despair - SHE GIVES GODLY CURVES.  \n\r\nOverall, she's a rather effective teacher but I'd recommend someone else if possible.    ", "rating": 3, "expected_grade": "A", "created": "2009-12-19T18:01:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "She is the best CHEM131 teacher. She truly cares a lot about her students and wants everyone to do well. She is engaging and teaches the material in a good way (unlike some other teachers, she does not use just the examples from the book-she makes up her own so you can understand the subject better).\n\r\nThere are three exams and a final in this class. You do have to put effort in this class if you want a good grade. If you do your homework assignments, do the readings, and take notes in class, you will do fine. Just study effectively. Dr. Dixon is also there to help you during her office hours. Also, go to the discussions because the TA really helps clear some concepts up.\n\r\nThere are also many, many opportunities for extra credit, so you can easily raise your grade if you do not do that well on the exams. She also takes the extra credit problems created by students and makes it into a packet for students to complete if they need extra help. Also, the curve isn this class is insanely high (this semester, a 70-75% was an A)", "rating": 5, "expected_grade": "A", "created": "2009-12-19T15:56:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "She is very knowledgeable and is a really good teacher! But her tests are impossible to finish in the time period given and are difficult. The averages on the tests were usually in the 50-60% but since the class was heavily curved overall, it helped out a lot! If you had 75% of the total points by the end of the semester, you got an A in the class!", "rating": 3, "expected_grade": "A", "created": "2009-12-19T01:48:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "This class was extremely difficult. Dr. Dixon is an awesome professor. She's very engaging and entertaining and she knows her stuff. On the other hand her exams were very difficult. If it had not been for the curve I would have failed this class. If you have to take Dr. Dixon I recommend attending her office hours as many times as you possibly can. She loves to help her students and offer extra problems. Good luck...", "rating": 3, "expected_grade": "D", "created": "2009-12-18T02:19:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "This class is entirely what you make of it. I personally thought it was the hardest class I ever took in my entire life and failed every midterm with about a 45% and got a 60% on the final. However you WILL learn more than you would with any other Chemistry professor at this university. Bonnie Dixon is quite possibly one of the best professors, period! Though the exams ARE hard she does provide lots and lots of review. In my class we had two guided study sessions (reviews) a week and then holds a review before each exam. She holds office hours througout the week and if you catch her in her office outside of office hours she will be more than happy to talk to you then. She also gives extra credit throughout the semester which are very helpful. She also does clicker questions worth 40 points so go to class. As for the curve, she said that this semester around 50% is a C and then about 65% is a B and 80% is an A. To top that off if you're failing and get a C on the final it is an automatic C in the class. I would highly recommend her because as long as you study and put alittle effort into it, you will at least get a C.", "rating": 5, "expected_grade": "", "created": "2009-12-16T13:27:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "Disregard everyone/anyone who says that Dr. Dixon does not care about her students. \n\r\nPros:\r\n1) she's not here for research, she's here to teach, and she does a good damn job of it.\r\n2) Her curve is immaculate.\r\n3) She holds numerous review sessions; a weekly one, one before each exam, and multiple office hours.\r\n4) She is personable. She called those students who actually came to class and went to her for help by their name.\n\r\nCons:\r\nshe is a VERY popular lady and sometimes its hard to get one-on-one time, but only because she is willing to help everyone.\n\n\r\nIf you expected for some strange reason that Orgo II would not be hard or a lot of work, then you are in for a surprise, b/c it is, but this is true for every teacher. Dixon wants everyone to pass and makes it easy to do so if you care the slightest bit.\n\r\nI, personally, have a difficult time studying on my own time and learning from the book, but with Dixon, you learn anything you need from lecture and review sessions, and then just practice practice practice for the exams. \n\r\nIf you want to learn organic chemistry and retain some of the information for the MCAT, take Dixon.\r\nIf you are afraid of orgo, want easier test, etc, take Khachik. \r\nBut remember, the easier the test, the less the curve, and their will always be geniuses in the class, so go for the better teacher if that's how you learn best. \n\r\nGrading:\r\nclickers (minimal)\r\nextra credit (minimal)\r\n3 exams and a final\n\r\nfinal grade: 50% to pass, 80% is an automatic A but the curve usually is even more, like a 70-75% = A. \n\r\n**in my class, she promised anyone who got a A on the final an A in the class, period. \n\r\nbest of luck!\n", "rating": 5, "expected_grade": "A", "created": "2009-12-15T01:34:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "Dr. Dixon is amazing!  She is an awesome professor and will do her best to help you succeed!", "rating": 5, "expected_grade": "A", "created": "2009-12-14T13:49:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "Best teacher ever! She is amazingly enthusiastic and has a passion that is truly inspiring! More over she managed to make entirely obscure and difficult concepts understandable. Her tests can be rather difficult, but if you go to lecture and pay attention you should do fine. More over, she is very nice, so if you really don't understand something, she is more than willing to explain during office hours. She is the best!", "rating": 5, "expected_grade": "A", "created": "2009-08-25T17:33:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dixon is a great professor. Her class is rarely ever boring and she has great presence. That being said, her tests are unnecessarily tricky and difficult. You learn alot in her class but knowing the material does not guarantee you a good grade. The top 20% of her class automatically gets an A so if you think you're up for it then I would recommend dixon", "rating": 4, "expected_grade": "A", "created": "2009-08-24T11:35:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dr. Dixon has a great presence and a passion for Orgo, but she's unnecessarily difficult when it comes to tests.  It's hard to do well in this class unless you study all the time, go to her office hours, attend the review sessions, etc.  There are always a lot of people at office hours, so you're lucky if you get your questions answered.  Honestly, if you don't have a passion for Chemistry and you're not a Chem major, do not take Dixon because it won't be worth it.", "rating": 3, "expected_grade": "", "created": "2009-07-23T01:38:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dixon is by far the best teacher I have ever had. She makes concepts in Orgo much simpler, and easy to learn. \n\r\nAs stated before, as long as you put in the effort to do well, such as going to office hours and/or review sessions, you should be able to pull off at least a B in this class. \n\r\nI would HIGHLY recommend Dr. Dixon for anyone who wants to actually learn Orgo while getting a decent grade in it.\n\n", "rating": 5, "expected_grade": "A", "created": "2009-07-09T21:16:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "What I am about to say is very repetitive of other ppl's comments about her. She is a FANTASTIC teacher, you will learn so much and understand it all if u take her. \r\nthat was the good news. The bad news... her exams are impossible... the averages are lower than everyone's spirit after they take an exam. if you decide to take her as a professor, just take a look at everyone's faces during exams and see for yourself... anyways. she is a fantastic teacher... difficult grader/exam writer HIGHLY recommended for pre-meds who have to suffer through the MCAT... at least you'll get the orgo questions right. just prepare to take a hit on your grades and transcript.", "rating": 3, "expected_grade": "B", "created": "2009-07-07T18:36:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Awesome professor.  She actually teaches you and makes you learn the material.  Downside is that her exams are veryy hard.  You definitely will need to start studying a few days in advance - all nighters normally dont work so well.  However, the curve is very large and there are lots of extra credit opportunities along with clicker questions.  I would definitely recommend her for orgo1 - best prof out there.", "rating": 4, "expected_grade": "C", "created": "2009-06-17T14:18:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "Dr. Dixon is a great teacher if you PUT THE EFFORT INTO HER CLASS.  I read my lecture notes before class and made sure I understood them before I aksed her questions, and I got well above the average for each exam.  People give her a hard time for being such a difficult professor, but honestly in comparison to other chemistry professors, I actually learned a LOT in her class.  You honestly have to put in a lot of effort to do well, but you should expect to do that since it is Organic Chemistry.  The people who don't do well are the ones that wait until 2 days before the exam to study and ask her a plethora of questions.  She also makes 50% the cutoff for a C, and 1 standard deviation above the avg the cutoff for B, 2 std dev for an A.  Entirely doable course, but again, effort and time are the keys to success.", "rating": 5, "expected_grade": "A", "created": "2009-06-11T11:06:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dixon is, by far, the best organic chemistry professor. I can attest to this because I went to Khachik, Ammon, and Friedman's lectures, and none of them compared to Dixon. The other professors lack the passion and upbeat personality that Dixon embodies, and Dixon is overall, a lot more clear. She does cover more material than the other professors, but it will help you out in lab and for the MCATs. She holds office hours everyday, as well as a review session once a week. Definitely attend the review sessions because they are very helpful. Also, do not fall behind. Organic chemistry is a difficult subject, and since Dixon moves pretty quickly, it will be very easy to fall behind. Rewrite your notes, do practice problems (especially the weekly \"quizzes\" on blackboard), and go to her office hours! I don't think her curve is very generous because I had a 68% in the class and ended up with a C. However, I do know that Friedman gives monster curves- my friend who had a 65% got an A in his class.   ", "rating": 4, "expected_grade": "", "created": "2009-06-05T02:24:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Throughout my college experience, Dr. Dixon has been my least favorite professor.  She makes it very difficult to get a good grade in her class unless you regularly attend her office hours. Also, if you ever confront her about a test question, she will respond very rudely and make personal attacks on you in a very unprofessional manner.\n\r\nI would definately NOT reccomend her to anybody for any class.", "rating": 1, "expected_grade": "B", "created": "2009-05-26T13:00:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dixon is probably the hardest teacher in this course, simply because she certainly covers the most material. The class moves very quickly, but I certainly have a very good grasp of organic chemistry. Her goal is to pass you if she believes you can handle orgo 2.\n\r\nTests are all relatively hard, but they're doable if you put in the time to study and understand the concepts. She's a very energetic teacher and explains the concepts well. You'll just have to go back and study on your own, to make sure you understand it.", "rating": 4, "expected_grade": "B", "created": "2009-05-23T17:01:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "This professor makes hard exams and is very difficult.  Unless you have the time to attend all of the extra review sessions and spend huge amounts of time a week you will end up will not do well.  ", "rating": 3, "expected_grade": "C", "created": "2009-05-21T22:16:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dixon is one of those professors that you will learn a lot from, but your grade will not necessarily reflect how much you learn.  Exams were pretty difficult and clicker questions were a significant enough portion of you grade that your grade would suffer if you did not do well on the clickers.  The only good thing is that the curve for her class was better than most others with an A-75% and B-50%.  If you're looking to learn a lot about organic chemistry take Dixon.  If you're just looking to get through organic chemistry with your grade intact, take another professor.", "rating": 3, "expected_grade": "C", "created": "2009-04-20T02:10:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "You will learn a lot about General Chemistry with Dixon, but you probably won't get the grade you want. In the beginning of the semester she boasts a huge curve but by the end that curve is much smaller than she originally said so be careful.", "rating": 3, "expected_grade": "C", "created": "2009-04-14T03:43:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "Hands down--THE best Chem professor on campus.  She always starts off class with an oldies song from her Itunes!  But in all seriousness, you have to go to lecture and ask questions.  She will tell you what's on the exam and will do one of those last-minute day before reviews IN CLASS where she will tell you what to expect.  Also, although her exams are not as straightforward as other professors, you are here to learn and think....so go ahead and take her, get your money's worth, you will have a good time working with her.  She's funny and energetic and can definitely keep you awake.  The curve is very very very generous.  I believe a 72% or higher is an A!!  Good luck!", "rating": 5, "expected_grade": "A", "created": "2008-12-16T14:45:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "She was an awesome professor. Explained concepts well and very open to students. However, her exams were quite difficult, but still manageable if you put enough time to study for it. ", "rating": 5, "expected_grade": "B", "created": "2008-11-05T11:47:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Hard course made easy.\n\r\nVery energetic teacher.\n\r\nFair exams.", "rating": 5, "expected_grade": "A", "created": "2008-05-01T17:27:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "She does an adequate job of presenting the material but sometimes seems to focus more energy on less important and easier topics while not going into much depth on more challenging ones. Also, the way her review sessions are set up so that they are on the same time tue. and thurs. means that I am unable to attend any of them because I have the same class on both days at that time.", "rating": 3, "expected_grade": "B", "created": "2008-04-22T20:50:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "Dixon's great.  She gives a great lecture, and is always receptive to questions and helpful during her ample office hours.", "rating": 5, "expected_grade": "A", "created": "2008-04-03T03:42:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Entertaining, but all over the place in terms of her teaching. Even her boardwork is scattered all over the room. \r\nIt really doesn't seem like she cares whether students do well in her class. ", "rating": 3, "expected_grade": "B", "created": "2007-12-12T03:32:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "OMGzz she is so hawt and so awasome!!! seiously.  I luv her a lot and she is like the best thing to ever happen to me! she openeed my eyes to orgasmic chemistry, and i have never looked back! thank you bonnie!\n\r\nbut seriously, shes a pretty good teacher who explains things well.  Her tests are kind of hard, but the class is fairly manageable with the right studying.", "rating": 5, "expected_grade": "A", "created": "2007-10-30T00:23:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "I am in love with Bonnie L. Dixon.  She is the best teacher ever, if you don't take her you will regret it.", "rating": 5, "expected_grade": "", "created": "2007-10-28T19:55:00Z"}, {"professor": "Bonnie Dixon", "course": null, "review": "Great teacher, makes herself very available for help. Really cares about her students. Makes CHEM as interesting as it can be.", "rating": 5, "expected_grade": "A", "created": "2007-10-24T15:10:00Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dr. Dixon is a good lecturer and has a lot of experience explaining orgo concepts to inexperienced students. Her tests are relatively fair; the averages are low because it's just a lot of material to understand. There are extra points built into her tests and extra credit available so good grades are not out of reach when the curve is applied at the end of the semester.", "rating": 5, "expected_grade": "", "created": "2018-04-25T16:26:27Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Honestly, Dr. Dixon was the best teacher I've had so far at UMD. She's really nice once you get to know her and can be of a lot of help to you if you (1) go to her office hours and (2) ask specific questions pertaining to what you're confused with. \r\n\r\nThat being said, this class isn't a walk in the park. You HAVE to put in the work if you want to pass this class. Do her practice problems because those will help for exams. Also, always go to lecture! If you absolutely can't make it, ask a friend for their notes because a good amount of content is covered in class and you can't afford to miss it. \r\n\r\nFinally, when it comes to grading, she's really strict but she does give partial credit to decent amount of answers on the homeworks and the exams. She also curves the class but she doesn't tell you by how much. I ended the semester with a 67 but that was a B-. Overall, it was an awesome class to be in.", "rating": 5, "expected_grade": "", "created": "2018-05-18T20:31:31Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "I’m not really sure why Dixon has such high reviews when she’s well known as one of the HARDEST professors that teach orgo. her lectures were so confusing to follow, and quite frankly she was really rude to students in class. would definitely not recommend to anyone regardless of how good you are at chemistry ", "rating": 1, "expected_grade": "", "created": "2019-12-18T00:10:16Z"}, {"professor": "Bonnie Dixon", "course": "CHEM271", "review": "I will be 100% honest, I had dixon for orgo 1 and LOVED her. I understood the concepts really well because she knew what she was doing. She has a good system for chem 231 and I will not take that away from her, HOWEVER she has been awful for Chem 2. Her first exam was way to difficult for no reason. Her lectures in person have been very confusing and she makes it hard for us to connect different equations to the problems we need to know. I will say that since quarantine she has had better lectures prepared, but that still doesn't mean she is an overall good chem 2 professor. I have personally sent her multiple emails throughout the semester asking for help and she has not responded. She finally got back to me after bombarding her with multiple emails regarding something very important and she got mad at me because she felt I did not even need to send her an email in the first place. She is super unreliable online and her \"office hours\" that she says you have to go to are not effective in an online setting. She has made this class terrible for me. I have liked chemistry until I took her Chem 271 class. Don't talk her for chem 2, ONLY CHEM 231!!! She has a good system for that class but for chem 2 she does not.", "rating": 2, "expected_grade": "", "created": "2020-04-29T18:27:47Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "I had her for orgo 1 and absolutely loved her, so when I saw she was going to teach CHEM271 I was very quick to add her as my professor. When I started chem 2 i realized that this was not Dixons strength. Her lectures were confusing and unorganized. I would go to her office hours and study for hours and still that wasnt enough to be prepared for the first exam. The first exam was so difficult that we had to receive extra time on it. Multiple TA's also complained about how absurdly hard the exam was. I gave her a 3/5 because she was a 5 for orgo and a 1-2 for Chem271. I ould say take her for orgo. She has been teaching it for years and really has nailed how to properly conduct the class, but if she is ever a professor for Chem271 again stay far away.", "rating": 3, "expected_grade": "", "created": "2020-07-23T18:27:49Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "She is the worst possible person to take for this class. At least with orgo the textbook went along with the material so you dont really need a teacher to even learn orgo but with bchm her curriculum does not go with the book at all.\r\n\r\nshe just rapid fires super important information at you and skips around acting like you've already learned it. The only way to do this class is to either have laser focus on her lectures and scribble notes real fast (which most people are not capable of at her speed of teaching) or record lectures (what i did). even when i did record lectures, i spent 2-3x the time of the lecture just to decipher her shitty lecture.\r\n\r\nThe homeworks are difficult but if you work with friends you should be able to get 90+% on all of them. Exams are really hard - by far the the hardest lecture exams ive ever taken. Her exams literally require you to have a high iq or graduate level understanding of the material. \r\n\r\nIn my honest opinion the material wasn't actually that terrible or even that much. Orgo1 was a similar amount of material. it was just spending so much time trying to decipher what she said. Her powerpoints are utter shit. they explain jack shit and if you don't have lecture recordings you definitely wont be able to remember what many of them mean. Without perfect notes, lecture recordings, reliable textbook, reliable powerpoints how can you be sure you're learning the info? OFFICE HOURS\r\n\r\nShe is generally nicer and more helpful in office hours but you gotta go there early in the morning. it gets crowded fast and then she gives half ass answers to your questions. If you're gonna take this class with her record lectures and find a study group because its impossible to get all of the information alone", "rating": 2, "expected_grade": "B", "created": "2020-08-27T05:54:16Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "Honestly she was a terrible teacher. She spoke way too fast and skipped around in lecture. On top of that the bchm book was useless and her powerpoints were terrible. \r\n\r\nPremed Junkies will say she's so amazing and awesome and say how much they learned in this class. In reality, there is a similar amount of material in this class as there is in orgo. The way she teaches just makes you do extra work to understand genuinely simple concepts. Im serious, Biochem is not that difficult. She made it difficult. If the only way to understand the material in this class is to take incredible notes from her ridiculously fast lectures then you're setting up yourself up for failure. The only other resources you have is her office hours which are always packed.\r\n\r\nShe pits her students against each other, there is a quota for A's and B's which just creates a toxic environment for no reason. \r\n\r\nGuys biochem did not have to be hard. Looking back the material wasn't bad at all. It was deciphering her terrible lectures, going to office hours and countless group study sessions just to understand SIMPLE THINGS that allowed me to do okay in this class.\r\n\r\nThis is a different ballgame than orgo. Just read the book in orgo and you're set. ", "rating": 2, "expected_grade": "B", "created": "2020-10-13T06:39:40Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "I was scared at first because I heard she was a hard professor but now she's literally one of my favorite professors at UMD. Her lectures go fast but she's good about answering questions and her office hours are genuinely so helpful. She's lowkey very funny so don't be afraid to get to know her. Her tests are hard but fair. She will give you challenging questions but all the material on it is what you learned in class so there's no surprises and she's good about partial credit. Honestly she's really great ", "rating": 5, "expected_grade": "A", "created": "2020-10-18T15:13:23Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "She assigns very very hard exams and homework. She talks super fast during class and its hard to understand. You really have to keep up and give your all to succeed. ", "rating": 2, "expected_grade": "W", "created": "2020-11-18T16:56:50Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dr. DIxon is amazing at teaching CHEM231. Especially if you are taking this course in Spring 2021, highly recommend taking her. She teaches very well in the online environment and provides many options for students to be in contact with her as well as the TAs. Office hours are offered every single day, both private and open office hours. She does SO much more than she needs to for her students, and really just wants to see us succeed. Also, she was the only orgo 1 professor for Fall 2020 so she's the only teacher with an fully online curriculum that she knows works :)", "rating": 5, "expected_grade": "A+", "created": "2020-12-12T22:52:08Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "I loved taking CHEM231 with Dixon. She explains complex concepts very well and answers questions clearly. While her exams and homework assignments are quite difficult, the information is all in the lectures and she is always available to answer questions (office hours everyday and she responds to emails). Overall, Dr. Dixon goes above and beyond for her students and is an amazing teacher for Organic Chem.", "rating": 5, "expected_grade": "A", "created": "2021-01-25T18:02:48Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dr. Dixon is a very good online chem teacher. She is available for office hours every day if you need help and builds in a curve to all the exams. There are weekly homework which are pretty hard and time-consuming, but it makes the exam questions very easy. She records all her lectures and hours of supplemental videos which are very helpful. There are so many practice worksheets she provides that you could not do them all, and between her and the TAs there are probably 20 office hours a week! There is also a sizable curve at the end.", "rating": 5, "expected_grade": "A+", "created": "2021-01-27T22:56:17Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "This course was hard but not because the material is super hard to grasp. It’s because the lectures go by incredibly fast and the way things are explain is very roundabout. It doesn’t help that her TA tried to match her style of teaching and gave very non descript explanations that often didn’t answer the question. SIE averages tend to be high because students work super hard. This class requires you to work extra extra hard because she has a lot of gaps in her explanations and you end up spending hours just figuring out what she’s talking about when the whole time, it could have just been explained better. This class was hard not because of good teaching. It was hard because we were all trying to fill in the gaps. ", "rating": 2, "expected_grade": "B", "created": "2021-02-11T17:22:24Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Absolutely the best orgo I professor. Dr Dixon goes above and beyond to help her students understand orgo, including one on one office hours and problem of the day zoom sessions that cover harder topics on the exams. I definitely recommend Dr Dixon to anyone taking orgo. ", "rating": 5, "expected_grade": "A", "created": "2021-04-16T04:22:19Z"}, {"professor": "Bonnie Dixon", "course": "CHEM135", "review": "Dr. Dixon: Ahhh... where do I start. I feel very mixed about Dr. Dixon. She definitely feels like a fun person. At times, I felt like she was out to get us, but other times she was patient and listened to our concerns. She has a messy gradebook (a pet peeve of mine), but come a month from the end of term, she helps explain standings so you can get a grip of where you're out. She covers material pretty quickly and REALLY EMPHASIZES orgo, which is a pain for engineers lol. Some good points are that she makes asynchronous videos and gives out extra credit (DO THEM!!!). She does go over material in depth so you have an understanding, I just think she doesn't go too in detail on how to actually apply that knowledge in questions, but after doing non-graded problem sets and homework, it works out.\r\n\r\nCHEM135: The class goes fast. High school knowledge won't carry you too far. With Bonnie, you're going to have to put in the effort, but its worth it. Compared to Stocker, I feel she cares more and teaches WAY better. I always ran into a timing issue on my tests, walked away feeling like I failed, but always got above average! Dedicate TIME and energy to this class, and do all non-graded problem sets too! I went in just needing a C- or better and now I'm currently at an A before the final! Just know what the class is about, go in with a good productive attitude, and you'll be set!", "rating": 3, "expected_grade": "B", "created": "2021-04-29T03:56:29Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Full transparency, this class was very difficult. Like you might think you're smart and you can coast but you really can't. To do well in this class you have to put in the work for it. Do the homework and study hard for the tests. Do all the extra credit even if you're dying.\r\nSometimes Dixon seems like she's being overly tough and vague or confusing, and at the beginning of the semester I hated that but then I realized that it helped me understand all the stuff on a more fundamental level such that I can apply it better. I think it definitely has me way better prepped for orgo 2 than most of the other teachers.\r\nThe other thing for this class is that you sometimes just have to be able to move forward. The first test I got a 50% straight up, and I felt so bad about it and people were talking about dropping the class which just got me feeling so down and pressured, but you actually just have to push through, and reset. You have to go to office hours and put in a lot of work into the homeworks until you get how to do it like instinct. It's tough but really doable. There was nothing that felt better than getting the good grade in orgo after putting in the hard work. So yeah, I would definitely recommend Dixon even though a lot of people don't like her and think it's too tough. She really preps you for orgo 2 and even though the tests are very difficult the whole course is curved, so as long as you do well enough you can get a good grade in the class.", "rating": 4, "expected_grade": "A+", "created": "2021-06-01T16:45:13Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Took her class last year online. She's an excellent lecturer and cares about her students. When I took the class she was available for office hours just about every day of the week, and had extra long ones before homework quizzes and exams. Homework assignments do take long, but they are great for reviewing the content. I've heard from other professors that she teaches some unnecessary topics, like going too far into complex splitting and teaching bulky bases, but I feel that her depth in the content will help anyone who takes CHEM241 and BCHM.", "rating": 5, "expected_grade": "A", "created": "2021-08-30T11:44:27Z"}, {"professor": "Bonnie Dixon", "course": "CHEM131", "review": "I had Dixon for both CHEM131, CHEM241 and CHEM242...let's just say I should have learned my lesson the first semester and never taken her again. Both semesters I had her were completely virtual which I know caused a lot more issues but most issues I had with Dixon were about her personally. I was diagnosed with COVID during my first semester with her and although I was very sick and reached out to her four times requesting a private meeting with her, she never responded or gave me any accommodations even though my absence was University approved. Dixon is notorious for never responding to students which I find unacceptable. In my experience, Dixon did not care about her students at all. As a teacher, Dixon goes extremely fast and never records her lectures so you can't go back to see what you missed. She has makes A LOT of mistakes.  All of her homeworks and exams had mistakes on them. On one of my exams, this past semester over 50% of the questions on the exam had big mistakes and she refused to give us extra time to decipher her hieroglyphs of an exam. Dixon also posted almost all homework assignments late but never gave us extra time to complete them. Even Dixon's TAs this past semester admitted how unfair and confusing Dixon and her homeworks and exams were. The TAs even admitted that some of the questions Dixon was giving us were material too advanced to be covered in orgo 1 and 2.\r\n\r\nI am a junior here at Maryland and I can confidently say that I have never had such a terrible experience with a professor. Throughout my two semesters with her I watched her get reported multiple times my students for her unfair teaching styles. Avoid taking her if you can.", "rating": 1, "expected_grade": "", "created": "2021-09-02T00:34:16Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "DISCLAIMER: I am reflecting on Dr.\r\nDixon’s class as a junior who had her class 2 years ago.\r\n\r\nDixon’s class is quite difficult, but unless you are planning on just taking one semester of organic chemistry, she prepares you for future chemistry classes that involve a deep understanding of organic mechanisms. In other words, the knowledge which she drills into you will only serve to help you in the future.\r\n\r\nHer grading is fair, and this is coming from someone who essentially failed the first pre-test from her course. She is receptive to student needs and has really helpful office hours. \r\n\r\nReflecting back on this class as a third year biochemistry student, all the hard work and effort which I put in to raise my grade from a low D to a low A by the end of the semester really gave me an appreciation for her class and organic chemistry in general. \r\n\r\nIn the end I would say that I definitely do not regret taking her class, and would recommend her class to those taking more than one year of organic chemistry.\r\n\r\n", "rating": 5, "expected_grade": "A-", "created": "2021-09-17T18:57:35Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Dr. DIxon is not only the best orgo professor, she is probably one of my favorite professors overall.\r\nThere is no one who wants to help you succeed more. Yes, the material is hard but she offers so much help by posting extra videos, practice problems with answers, and has a million office hours in which she will answer any question you have a million times until you understand it.\r\nYou have to put in a lot effort if you want a good grade, but she curves tremendously. If you want to actually understand orgo, take Dixon. \r\nNot everyone likes her or her style and that's fine, but I highly recommend.", "rating": 5, "expected_grade": "", "created": "2021-10-14T15:09:29Z"}, {"professor": "Bonnie Dixon", "course": "CHEM134", "review": "Only for CHEM134:\r\nShe is kind of a hard-ass. Might be the new-englander poking through but her teaching style is no-nonsense. She knows her stuff and will dump the information down your throat. Very nice lady and will talk about her own life to an extent, but will not accept paper-thin excuses. \r\nShe gave us very little review material for the midterm, and the homeworks are often only doable if you go to office hours and basically ask how to do the problems. \r\nCHEM134 is hard, and do not expect to be able to waltz through it with your shaky memories form AP chem. Since it's a one-credit course there is very little time to go over all the information necessary so there is minimal time for questions and clarification. I don't even know who the TA was because they were not involved at all. ", "rating": 3, "expected_grade": "", "created": "2021-11-18T13:40:33Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "She is definitely a hard ass. She’s not very kind or understanding with helping students succeed. She’s more of “you either understand it or you don’t.” She never responds to emails. However, she does hold a lot of office hours and reviews to help students. But I think she’s just too smart for her own good. She goes wayyyy too far it’s too hard to comprehend anything. Very intimidating. ", "rating": 2, "expected_grade": "C", "created": "2021-12-08T23:00:23Z"}, {"professor": "Bonnie Dixon", "course": null, "review": "Bonnie. AVOID AT ALL COSTS. She has a Ph.D. in nmr and that is all you will be doing the whole semester. All the other professors were understanding that this was a hard concept and gave basic questions for homework and tests. Bonnie, however, decided that we could learn, what she spent years learning, in only a month before having to apply it to all the tests and quizzes. You must put a lot of effort in to get a good grade. I took this online in spring 2022 and the curve was really good (up 2 letter grades) but honestly, the whole class would have failed if she didn't have a curve because the average for every single exam was less than 50%. ", "rating": 1, "expected_grade": "C+", "created": "2021-12-09T21:20:46Z"}, {"professor": "Bonnie Dixon", "course": "CHEM134", "review": "Dixon is a bad professor for CHEM 134. She made it abundantly clear from the first class that she would be apathetic, bordering on cruel, for the entire semester. She delivers all her lectures in a way that makes it difficult to comprehend and follow along. Everything is prefaced with \"don't come complaining to me\". It did not seem to me that she tried at all to help students succeed. Very difficult, intimidating, and apathetic.", "rating": 1, "expected_grade": "", "created": "2021-12-16T17:32:10Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "Dr. Dixon is one of my favorite professors at the University of Maryland and I am so lucky to have taken CHEM231 and BCHM463 with her! A lot of people say she is really difficult but that statement is very misleading. The CONTENT is difficult, which is expected as college level chemistry courses cover complex topics. However, she provides you will ALL the resources necessary to succeed. If you stay on top of understanding content after each lecture, do all the practice problems and old exams she posts, and attend office hours a few times a week, you will thrive in the course!!! Also, her office hours are amazing! I have made so many close friends through spending time there working on problem sets and have also had lots of wonderful conversations with her :) She’s always got your back and taking any of courses will be the highlight of your academic career at UMD! ", "rating": 5, "expected_grade": "A", "created": "2021-12-20T19:55:07Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Truthfully, organic chemistry is going to be a difficult class no matter which professor you take. Dr. Dixon has easy to follow lectures with written notes, and she will always have practice questions for you to do, both graded and non-graded. She will also post videos from previous semesters when learning was still virtual, which can be really, really helpful. She tends to make the homework and tests out of the hardest types of problems within a topic, so you will most likely have to go to office hours. She can be intimidating and harsh during office hours, so if you're someone who thinks you'll be too afraid to go to her office hours, I would pick a different professor. While I didn't think the first three exams were hard, I always thought the homeworks and the final exam were extremely hard. Do the homework -- you'll be fine. I'm glad I took her class, and while she does make this class more difficult than it likely has to be, she will give you a lot of study material and office hours so that you can succeed. \r\n\r\nYou don't need the textbook -- please save yourself 200 dollars and don't buy it. ", "rating": 4, "expected_grade": "A", "created": "2021-12-22T00:43:04Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "She talks very fast, but she talks slower and is very helpful at CAN and her office hours. HW is hard, but you have a whole week and can work with classmates. Tests are difficult but fair and she tells you exactly what will be on there/point breakdown. Her curve is very generous, I had ~66% and ended with a B, and I had friends with ~50% and ended with a C. ", "rating": 4, "expected_grade": "B", "created": "2021-12-22T21:16:48Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "If you're reading this and you will be stopping chemistry courses after organic chemistry 1, I suggest you take a look at Dr. Stocker's reviews- I find her more easygoing on students who are maybe not as interested. If you will continue to organic chemistry 2, biochemistry, and onward, or you like chemistry, I strongly, STRONGLY recommend you take Dr. Dixon.\r\n\r\nDr. Dixon's lectures are in-depth, quick, but to-the-point. She knows her stuff and will answer your questions completely. She will let you know if you're asking something that you'll learn in the future (like o-chem 2), so that you don't have to worry about it. On ELMS, Dr. Dixon posts class outlines before, and often the lecture notes after each lecture. She will seem intimidating when she lectures, however she is an extremely kind and understanding person. You can see this if you go to her office hours (on zoom or in her office) or if you ask her questions after lecture. I will agree with some reviews below that Dr. Dixon has some sort of obsession with NMR spectroscopy, but I found it more rewarding when I could use NMR spectroscopy analysis as a part of synthesizing a molecule.\r\n\r\nExams: They are difficult but extremely fair. Dr. Dixon provides the point breakdown by topic for each exam, including the final, and makes everything CRYTSTAL CLEAR. If you don't understand anything, simply ask her and she will make it even more crystal clear. Exams are often based on the weekly homework assignments, and Dr. Dixon generously drops several of the difficult topics from the final exam. The averages are usually 60-65%.\r\nIn addition to the generous curve she draws for each exam, for the second and third midterms, Dr. Dixon offered extra credit homework worth 12 points each (12% of each exam), which were directly added to your exam grade. And as if this wasn't enough, each exam had around 10 extra points built in, above the maximum possible score (100 for midterm, 150 for final).\r\n\r\nGood luck :)", "rating": 5, "expected_grade": "A+", "created": "2021-12-24T17:01:55Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "This teacher is a little crazy, but she is fantastic. She brings a bit of a hectic style to her teaching but absolutely makes sure she says everything you're expected to know and delivers it in a structured, easy to understand way. There were a few moments where she wouldn't teach a specific thing for a homework assignment, but she would always mention it a day or the day it was due. I also noticed she wouldn't always write down everything on her notes, and sometimes she would just verbally say some super important things. But she definitely repeats these over and over, it's just important to pay attention to all that she says and not just what she writes down on her board. This can make looking back at her notes difficult, but I'm sure going to office hours or anything shed be happy to help. I never had to go to any extra review sessions, office hours, read any books, or anything outside of the weekly discussion and lectures to earn an A in her class.", "rating": 5, "expected_grade": "A+", "created": "2021-12-28T07:56:56Z"}, {"professor": "Bonnie Dixon", "course": "CHEM134", "review": "She should not teach 134. Part of the problem was the garbage curriculum but the professor would have made this a tolerable class. Instead, she gave almost zero effort, instead seemingly only caring about her orgo students. Yes it is a one credit class, but the content and time for this one do not reflect that. Just hope you got a 5 on your AP/IB I guess. \r\n\r\nDixon provided little to no study material for the vast content of the class. For both exams, we basically just had our homeworks to look over, and an ancient and outdated exam sans answers anyway. The HW in themselves were a nightmare. For whatever reason she decided to only allow a window of 4 hours a week to submit. to her credit, the office hours were spread out through very helpful times, and were efficient for getting your question answered. \r\n\r\nI wholeheartedly agree with the other reviewers here so far: her lectures were dense and gave no time for clarification or followup, and barely time to write things down. She would never repeat herself if you miss something. At least record it, lady! Dixon expects knowledge from your AP so be ready to review shit she wont even teach. I have no idea who the TA even was, save for the final where they proctored it. \r\nSpeaking of final... The first exam set an expectation of difficult material and a reasonable amount of time. The second one dashed all of that, instead opting for fair question content but nowhere near enough time to complete it. Most students scored below a fifty on that one, reflecting poor teaching or poor test writing or both. Luckily there is a class curve. Unluckily, it is not announced, and nothing is curved until after all grades are in and you've left campus. \r\n\r\nIn summary, Dixon is a hard-ass and made a simple bridge course a pain, but she really knows her stuff, and expects you to as well. ", "rating": 2, "expected_grade": "B", "created": "2022-01-03T04:03:09Z"}, {"professor": "Bonnie Dixon", "course": "CHEM134", "review": "Dr. Dixon is SUPER structured in that she will post skeleton notes the night before the lecture and the homeworks are based on the problems she gives in class. The tests are structured similarly to the homeworks. Do yourself a favor: GO TO OFFICE HOURS. I had her for CHEM134 and I made the mistake of thinking, \"Oh a one-credit class, I probably won't have to put in effort outside of it\". No. no. no. I took a phat L the first couple of homeworks because of it. If you want the A, you have to work. The work is what sets an A apart from a B. This is the schedule I followed to fix my grade and get to an A from a C:\r\n\r\nThe night before lecture: Copy down the skeleton notes\r\nDay of Lecture: Literally write everything she says down. ALL OF IT. Every last breath that comes out of her mouth.\r\nAfter Lecture: Review notes/organize them and compare to the ones she has posted ** Sometimes she includes things not in the posted notes in class, so go  - it's not a waste of time if you want an A.\r\nStart on the homework day of and go to an office hour to ask her any questions. \r\n\r\nShe has SO MANY OFFICE HOURS. She's super supportive, so if you're diligent with your work, then you will be fine.\r\nAlso, she's a little intimidating, but she's literally the best. ", "rating": 5, "expected_grade": "A", "created": "2022-01-05T01:59:46Z"}, {"professor": "Bonnie Dixon", "course": "CHEM134", "review": "Bad professor, at least for CHEM134. She didn't provide any study material for the exams, then got unhappy with us for wanting some. In one review session on a Sunday night, she told us she was watching the football game at the same time as the zoom. She gives one example of a problem and that's it. For example, when we did the small orgo unit, she gave us a single example of an electrophilic addition then sent us to do the hw/exam. If she makes a single mistake (which has happened), there are no other examples to check and the class is oftentimes too introductory for students to find the answers online. She doesn't use a textbook either. She will refuse to answer questions from people claiming there's not enough time in the lecture period (true, the classes are too short for the material), but will go on tangents about her personal life. She once compared the students in our class to nagging toddlers that she would lock in a bathroom. She has refused to repeat herself in class and also refuses to record lectures, even for an 8 am class. \r\n\r\nI've heard mixed reviews about Dixon teaching other classes. She might do great at those. But I am sure she should not teach chem134. Easily the most painful class of the semester. I would have accepted a 70 over a B+ if it meant taking another teacher. ", "rating": 1, "expected_grade": "B+", "created": "2022-01-31T19:30:56Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Best prof. ever ", "rating": 5, "expected_grade": "A", "created": "2022-02-01T19:15:34Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Ochem is never going to be easy, but I feel like Dr. Dixon made it harder than it needed to be.\r\n\r\nHave you ever been working alongside someone who is really good at their job, and they say something like, \"I ~would~ show you the basics first, but they never serve me, so I'm just going to teach you the insanely complex tricks and tips that make this impossible to understand at a cursory glance, but don't worry, after decoding and encrypting my words and my ways, you can teach yourself the basics, then run through what I taught you again.\"\r\n\r\nFor example, for many years, I've taken lots of joy in working as a barista. I would teach a new barista, \"pull the shots, steam the milk, a little aeration for a latte and a lot of aeration for a cappuccino. As you get better, I'll make it more technical.\"\r\n If Dr. Dixon was a barista teaching a new barista, she would say, \"First, you want to heat up the bulkheads on the machine and test them with your thermometer so that they are at least a temp of 130*F, then you tare out the scale, and you take stock of the humidity and make sure that the bean dispensing machine is calibrated to a degree of your liking, then you measure out 18 grams, can be a little over but never under, and then you tare your scale (MAKE SURE ITS THE AUTO-SCALE) and use pre-rinsed shot-glasses, make sure the shot pulls at 36-39.5 grams at a rate of 21-26 seconds. And for decaf its... and when you steam the milk, fill the pitcher to... that's 6 ounces for a small, 8 for a reg.... 16 for an extra large... and cappucinos... make sure the fully rotating head is positioned at an angle of 45 degrees and your pitcher... TADA! A SIMPLE latte. That was basically review, right?\" \r\n\r\nWas that hard to read? Was that a bad experience? \r\n\r\nWant to sign up for 6 months of it? ", "rating": 1, "expected_grade": "", "created": "2022-02-04T00:07:04Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "Hands down one of the most condescending professors I have ever experienced in my college career. I see a lot of reoccurring themes which is that she lectures at a rapid fire pace and it’s up to you to decipher what is important and what is not. I’ve been to her office hours up follow up on a question and she flat out said “we can entertain this all day long and talk in circles, but go ahead”. If you don’t have the patients to help students when they have questions, why are you here? She’s just miserable. Biggest mistake was taking this class with her. She picks favorites as well. But for those taking her, just make sure to read the textbook so you know the true underlying concepts, maybe review orgo notes, and still show your face in office hours. She will be a bitch, but don’t let that stop you. ", "rating": 2, "expected_grade": "B+", "created": "2022-03-07T13:47:17Z"}, {"professor": "Bonnie Dixon", "course": "CHEM134", "review": "I'm giving her a 1 star rating mainly due to her attitude and general unhelpfulness, but I think my bad experience in her class was also due to the greatly overloaded curriculum and the 8 am lecture. This class should NOT be considered a 1 credit class, and I would strongly advise anyone against taking it.", "rating": 1, "expected_grade": "B", "created": "2022-04-02T18:12:24Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "Love her ", "rating": 5, "expected_grade": "A+", "created": "2022-05-15T00:06:19Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Gets a bad rep for no reason. Extremely accomodating and friendly woman. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-16T16:30:58Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "As a professor, I think she was good and provided enough materials to study but her attitude was awful. I wish I could give 0 zero stars. She's just so condescending and disrespectful, if you don't have an A in her class she just won't like you. She HAS her favorites! Half the time I talked to her she didn't even look me in the eye.  Her office hours were never helpful because she always just said to look back at the slides, but her slides are so hard to follow and most of them are just diagrams. She doesn't record the classes so it's hard to understand her slides when reviewing. Don't take this class with her, the first day she explicitly said \"most of you will get a C\". terrible experience, 0/5", "rating": 1, "expected_grade": "", "created": "2022-05-19T01:00:59Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "Had her for 231, then for 241. Pretty much the same review I would for 231. Outstanding professor. If you are taking 241, you likely need it for your degree or future courses, so Dixon is the right choice.", "rating": 5, "expected_grade": "A", "created": "2022-05-19T18:22:32Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "I had Dr. Dixon for both orgo 1 and orgo 2. Overall, she will give you a lot of material to succeed in her class. There are a ton of practice problems, office hours, and supplementary videos. She also does extra credit quizzes (that are often unreasonably hard, but doable if you find a good group to work in). I always thought that the exams were easy, but the homeworks were insanely hard. A lot of her homework assignments are based on weird tricks and rules to whatever functional group you're working on, not necessarily how they actually work. It seems like there is never a middle ground between easy and hard problems. She has frequent office hours that are semi-helpful, mainly because you'll be able to find students who are also working on the homeworks. \r\n\r\nYou should definitely be aware that Dr. Dixon has a huge attitude problem. I think a lot of other reviews give a good idea about what kind of person she is, but to sum it up, she will be condescending and short-tempered. Go to your TA for help before you go to her. She also does not cover all of the material on a homework until the day it is due. It's really frustrating. \r\n\r\nPersonally, I think that all of the materials that she gives like extra credit quizzes and videos make up for her attitude, but if you are worried that you may need a lot of help in chemistry, you should try to find a different professor. ", "rating": 4, "expected_grade": "A+", "created": "2022-05-24T14:02:59Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "She was a good professor but her homeworks were extremely hard for no reason. She also gave extra credits that were nearly impossible to do unless you got lucky with your guessing. I felt that they just took time away from studying right before exams. However, she does give you lots of good resources and practice sessions that were helpful. I'd strongly recommend finding a good study group to do well in the class. ", "rating": 4, "expected_grade": "A", "created": "2022-06-27T21:44:46Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "Some of you may not like Dr. Dixon. However, this will depend on your own attitude as a student. Organic Chemistry 1 and 2 will be a challenge no matter what teacher you have. In my opinion, I was able to excel in this class due to her teaching style and her character. Dr. Dixon cares about her students. She demands that you work hard through weekly homework assignments, but these homework assignments force you to study for her exams. She directly writes the exams based off of the hw. Additionally, Dr. Dixon hosts two chemistry at night zooms that go over lecture material from that week. Put your best effort into the homework, go to the C.A.N. zooms, and go to office hours when you’re struggling. If you’re willing to work hard, in my opinion, you will have the best chance of achieving a higher grade in her class than in other orgo teachers’ classes. There are no shortcuts through orgo. With Dr. Dixon, you earn the grade you work for. This is an advantage to taking her compared to some other orgo professors. ", "rating": 5, "expected_grade": "A", "created": "2022-07-08T20:25:00Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "This is one of the worst classes I have taken. She doesn't explain everything in class, so you're forced to go to every single office hour and her Biochem At Night sessions to learn material that should've been taught in class - which isn't feasible for many students who have jobs, extracurriculars, etc, and need sleep. She expects everything to be application based, but never explains any examples in class, she'll mention a concept and not explain it, then expect you to understand it in depth for the test. Her exams would take three hours to do effectively, but we only get 50 minutes in class which is not nearly enough time considering we haven't been taught half the material on the exams. She clearly has favorites in her office hours, and will often tell students to just refer back to lecture, GSS, or her BAN videos instead of actually answering their questions. She likes to think she is accessible because of how often her office hours are, but when you ask questions, she will often tell you to figure it out on your own or she will give completely contradictory answers to the same question to different students. It's just not clear at all what we are supposed to be learning.", "rating": 1, "expected_grade": "", "created": "2022-10-13T23:50:34.191486Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "Quite literally the worst experience in my academic career was having her as a professor. Her lectures are indeed fast paced but if you have follow up questions she refuses to answer as she calls it “re-lecturing”. Seen students leave her office in tears many times just from trying to learn and ask insightful questions. I’ve never met a more arrogant, patronizing professor. Truly lucky she’s tenured because she makes learning a difficult subject unbearable. The one star comes from the fact that cant vote any lower. Must attend Bchem at night and office hours ALWAYS if you want to pass.", "rating": 1, "expected_grade": "B", "created": "2022-11-15T05:27:48.709895Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "An awful teacher and an insanely condescending person. I don’t  get how she thinks it’s okay to teach the way she does and I don’t get all the desperate pre-meds who eat her horrendous teaching up.", "rating": 5, "expected_grade": "B", "created": "2022-12-10T00:13:27.136485Z"}, {"professor": "Bonnie Dixon", "course": "BCHM462", "review": "I will say that Dr. Dixon knows her stuff as an academic. It is clear that she knows the material well enough to be teaching it, but the way she chooses to communicate that understanding is not fit for students, even in an upper-level class. Aside from that, she is very condescending, and when the class doesn't do well on one of her exams, she blames the students for not trying hard enough and saying that the effort was \"disrespectful to her profession and the material\". Don't take her class if you want to do well or understand the material.", "rating": 1, "expected_grade": "W", "created": "2022-12-17T23:49:49.606498Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "I can write a book about how much I love her. Don't get me wrong, her class is HARD. Definitely the hardest class I've ever took. But I know I'm more than set for the MCAT because of her. I never had to go to forgo 2 lecture because of how much she prepared me in orgo 1. She is willing to help you all day every day. The amount of effort she puts into teaching us is honestly incredible. With that being said, if you don't need a great orgo background and you're not willing to put in a lot of effort into the class, take anyone but Dr. Dixon.", "rating": 5, "expected_grade": "A", "created": "2022-12-21T00:36:58.544572Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "For everyone who is saying she is impossible; she is not, but its all relative to the work you are willing to put in! I failed our first exam legit a 50% and was below the average. I went to office hours to talk to her about it and she was very kind but did not offer much help because there is not much more she can do for you. Basically what I am saying is if you want a certain grade in her class it is all about the work YOU put in and how diligent YOU are. After the first exam I started studying for the exams 2 weeks out. DO EVERY PRACTICE PROBLEM. If you want to succeed on her exams redo every hw (version A and version B), the extra hws she posts and review ALL the slides. I would recopy my notes after every class and write questions for her for office hours. Plenty of people on here say she isn't friendly during office hours, but that is not the case. What she is looking for is someone who has tried on their own and then found questions. If you go to her and say I dont get this, she probably won't help much because she really does not have the time to reteach you the whole thing. But if you go to her and say I went through the notes and this is where I am getting stuck, she is much more receptive! I ended up getting As on the 2nd and 3rd midterms and an A in the class even with my below average exam 1 score. With her you need to show her that you care and are taking the time to learn because in her class there are no short cuts! If you do these things I guarantee you will enjoy her much more and although the class is tedious and hard, it will be possible to succeed.", "rating": 5, "expected_grade": "A", "created": "2023-01-16T16:20:40.005251Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "Dr. Dixon is the best. BCHM463 is an insanely hard class, like it's a combo of BCHM 1 and 2 in the same class, so there is a ton of material and you move very fast. But I think that Dr. Dixon really explains everything really well. She is in her office all the time, and is always helpful so long as you are not asking her to potty train you (it's been done). I think people end up not liking Dr. Dixon or the class because they're used to previous bio and chem classes where you can just wait till the night before and study and do great on a test. With this material, you can't just do that. You actually have to sit with the material, and internalize it outside of class. It becomes incredibly neat when the information clicks and suddenly all that information from Orgo and Gen Chem and Cell Bio now actually makes sense and work together.\r\nI also know this will sound super nerdy, but if you're taking this class then it's probably because you will need it at some point in the future, so knowing the material beyond just the one semester is super important. I had Dixon for Orgo 1 as well, and I can say with certainty that her class and teaching style have helped me retain the knowledge past the end of the semester. Dixon's Orgo 1 allowed me to take Orgo 2 like it was nothing, and BCHM463 has me remembering all of that stuff inside and out.\r\nIf you're in doubt, take Dixon for this class.", "rating": 5, "expected_grade": "A", "created": "2023-01-26T21:34:47.502596Z"}, {"professor": "Bonnie Dixon", "course": "CHEM271", "review": "Proff Dixon was a quality professor, really seemed to enjoy engaging with students, posted a bunch of helpful materiel including  completed class outlines, zoom meetings every tuesday, and extra help for homeworks. Homeworks are difficult but there’s literal step by step examples hidden in her course materials. Tests are an easier version of homework material, make sure you understand each homework question she hints and watch CAN videos. Tests are rushed and expected to not be fully completed as she includes more points than you can earn. Overall, go to lecture, reach out if you’re really lost (don’t wait till last minute), and this is a type of course in which if you don’t apply yourself, it’s your fault you earned that grade.", "rating": 4, "expected_grade": "B+", "created": "2023-05-06T18:42:21.449285Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "I am not good at chemistry and performed quite bad on the first exam and average on the second exam. I am barely keeping up a C and this is the first C I will ever receive. Despite this, I think Dr. Dixon is an excellent professor. She prepares you very well for exams and literally gives you a list of what will be on the tests/final. She also assigns homework, which is a bit of a pain. However, they really help you prepare for the final. Her office is open almost every morning/afternoon for questions and discussion. She is a really approachable and intelligent professor. She is also a really great person. She teaches very difficult classes, which makes many students resent her. I recognize my grade is due to my own inability to understand chemistry rather than her inability to teach. She also prepares you very well the for MCAT and BCHM if you are interested in taking those in the future.", "rating": 5, "expected_grade": "C", "created": "2023-05-10T00:28:09.895191Z"}, {"professor": "Bonnie Dixon", "course": "CHEM271", "review": "I actually really enjoyed having Dr. Dixon! This is the first time she's taught the course completely in-person for a whole semester, and she came fully prepared. She taught everything perfectly and provided students so many extra credit opportunities and office hours to ensure we passed.  I'm taking down one star mainly because she does CANs, which are required to go to/watch to succeed in class, as exams are primarily based on those and our homework. However, I firmly believe that you have to work for your grade, so office hours and outside work are a must!\r\n\r\nIf she does teach this course again and anyone is interested in knowing how she curved typically:\r\nAfter the first and second exams, the average was 66.67% and 65%. A 50-51 was a C-D cutoff, a 65-68 was a B-C cutoff, and an 81-85 was the cutoff for an A.\r\nShe doesn't release the final cutoff scores, however, if you have a B overall with the curve and got an A on the final, she'll round it up to an A-. \r\nThe final is super easy, she provides you with every single question you'll need to know for the exam. An A is super possible on it!", "rating": 4, "expected_grade": "A-", "created": "2023-05-16T01:51:41.118664Z"}, {"professor": "Bonnie Dixon", "course": "BCHM462", "review": "Dr. Dixon is a great lecturer and I felt like she kept me engaged in the content the entire course. I know biochemistry is not an easy subject but I thought the way Dr. Dixon presented it made it much more manageable. I will say her HWs and exams tend to be more challenging than you may expect, but her ideology is to get you to think like a scientist and be able to apply the concepts you learn in unfamiliar situations. Dr. Dixon may not be the best option for an easy A, but if you really want to understand what you're learning, I highly recommend her.", "rating": 5, "expected_grade": "A+", "created": "2023-05-20T03:58:31.015516Z"}, {"professor": "Bonnie Dixon", "course": "CHEM271", "review": "Dr. Dixon is one of the best professors at UMD if you get the chance to take her. Her HW assignments are extremely difficult but they prepare you for the exams. She has C.A.N. on Tuesdays over zoom where there are extra practice problems and concepts discussed, and her class notes are all organized on her iPad. Hint: Do well on all of the HW assignments and get above average on exams and you will be fine. If you have time to attend office hours and ask questions, and are not afraid to be humbled this is your class! If you don't have the time to invest in the content do not take this class with her because she will make you work for the grade you want. This class was immensely challenging as is any chem class at UMD, but taking it with Dixon prepares you so well for the MCAT and for future biochemistry classes. Work hard and try your best and you'll get the grade you deserve.", "rating": 5, "expected_grade": "A+", "created": "2023-05-23T21:46:07.994232Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "By far one of the most caring professors at the UMD. This is a class where you get out what you put in. If you show up to office hours and BAN and even just ask questions, she will respect you and try her best to help you.", "rating": 5, "expected_grade": "B", "created": "2023-05-29T06:35:33.020562Z"}, {"professor": "Bonnie Dixon", "course": "BCHM461", "review": "If you don't already hate chemistry get ready to. Dixon expects student lives to revolve around chemistry. Forget about your other commitments and other classes and expect to fail if you don't go to OH. Dixon will use your questions and real life problems as an excuse to make fun of you while being utterly unhelpful. No late work accepted and insane homework problems not based on the course material. Dixon is the absolute WOAT, wait to take Capp.", "rating": 1, "expected_grade": "B", "created": "2023-06-26T20:01:44.891842Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Absolutely love Dr. Dixon. I am retaking orgo 1 with her after failing it with Dr. Stocker. I seriously don't know why no one ever told me about her, and why she doesn't teach every semester. I am doing so much better in this class now with Dr. Dixon. She is caring, explains concepts in depth, AND provides extra credit for exams. Dr. Dixon really wants you to pass her class. She is amazing. I would recommend everyone take her for any chem class you need!!!", "rating": 5, "expected_grade": "C+", "created": "2023-11-02T02:15:58.170353Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "She seems like a good lecturer (very helpful if people have questions and tries to engage the class) the few times I actually go to class. Other than that, her notes are organized and she has a lot of resources/videos to help people online. I never personally have tried to go to office hours, but I'm told it's pretty difficult to talk to her due to the amount of people there. Weekly homeworks aren't too bad if you understand what's going on in class and if you don't, you can figure out how to do them based on the notes she posts. In terms of the exams, there's an almost excessive amount of extra credit both before the exam and built into the actual exam and exams are pretty directly based on the HW, so if you understand how to do the reactions and what's actually going on chemically in the reactions, it isn't super difficult to get good grades. That being said, our class averages for exams are not great (usually in the 60s), as expected from any UMD chem class, which means there's a curve at the end as well. Honestly, I didn't really learn very much synthesis in Orgo I because my professor spent like 2 days on them so it was a little difficult for me to catch up at the beginning of Orgo II and Dixon does expect you to come in knowing quite a bit of synthesis, but with a little hard work, this class is not too bad. There's a lot of practice opportunities and Dixon herself seems sweet and wants to help students as much as possible. Definitely recommend her for Orgo!", "rating": 5, "expected_grade": "A", "created": "2023-12-06T21:56:42.291989Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "I originally wasn't supposed to take Dixon, I had signed up for Davis, but he ended up not teaching any Chem241 sections this fall and I instead got Dixon. I honestly LOVE her, I know some reviews may be mixed (I also haven't had her for biochem, so I can't speak on her teaching for that specific course). No doubt this class is going to be hard, especially if you don't have a solid Orgo I background, but as long as you put in the time and effort, you can definitely pull off getting a good grade in this class - coming from someone who got a B in Orgo I and is on track to getting an A in Orgo II. \r\nWe have a problem set (pretty hard, questions are typically harder than what you see on the exam and they're graded for accuracy), and I HIGHLY recommend going to office hours or asking your discussion TA for feedback before submitting. I wasn't able to make office hours for one or two homework assignments, and my grade for those problem sets definitely reflected that. \r\nDr. Dixon's office hours are typically very busy, but even if you don't get a chance to talk to her while attending, it's always a good place to collaborate with classmates and try and hear the advice she's giving to other students because most of the time I've found people have the same questions I do! \r\nI also highly recommend going to EVERY CAN session she holds, for my class, she held CAN every Monday night from 9-10 pm and went over relevant problems and answered any needed questions. Before exams, she would typically go over an old exam and allow 10-15 minutes at the end to answer any questions. Even if you don't have any particular questions about the topics she's going over, it's always good to attend and see her solve a few problems especially since she goes pretty fast during lectures (and class lectures aren't recorded). \r\nThe 3 exams we had this semester were very fair, the averages typically fell around the high 50s-low 60s and went up a bit throughout the semester given that some people dropped the class. Dixon typically gives a 10-12 pt extra credit assignment due the Sunday before the exam, these problem sets are also pretty hard, but if you work with other students, you can get all if not a decent amount of the offered extra credit! Dixon's exams are pretty long, but even if you don't finish an exam she typically writes her exam to be out of 120 points (even though the max is 100) to allow you to go through and solve the problems you're more confident on. \r\nI've seen other reviewers complain about Dixon moving too fast or talking a lot about herself, which is true in part, but she always posts her whiteboard after class (so if you missed copying down something you can refer to it after class) and I find her little \"side stories\" always help give me a break from the overloading content because being so real Orgo II is ALOT and it's nice to take a break from hard material sometimes and talk about something a bit more light-hearted (I also had 75min lectures at 8 am which was pretty rough).\r\nYou can't go wrong with taking Dixon for Chem241, and I highly recommend especially if you want a good background going into Biochem!", "rating": 5, "expected_grade": "A-", "created": "2023-12-09T21:49:33.230318Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "Its a hard class and Dixon can be a bit disorganized which can be rough given the pace this class goes at in order to fit in all the content. Despite that, Dixon does do a really good job at teaching content and providing plenty of opportunities to get help and to learn the content, with exams often being similar to HW or practice problems.", "rating": 5, "expected_grade": "B", "created": "2023-12-12T05:18:48.738770Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "No shade to the other reviews but those are people who probably kissed dixon's ass and sat in her office hours whenever she had them available. She only has homeworks and tests, nothing else. Yea, she gives extra credit, but they're hard af and extremely time consuming. The homeworks are designed to be harder than the tests or at least, same level. You cannot get a good grade completing the homeworks on your own time, she makes it so you have to go to her office hours. Her office hours are almost every day from 2-5 hours, but remember that she is probably teaching 2 other classes than yours so those students are also attending. You're competing anywhere from 5-20 students for her attention to help you. \r\nAlso, I wasn't a fan of the way she lectured. Felt kinda all over the place and she goes FAST. and i mean FAST. No textbook either. My advice if you take her? Record her lectures, make a study group FAST for those homeworks and tests, and either make a time to go to office hours or be friends with people who do go. Dixon expects you to put in basically all your time for her class. Do not take her if you have a heavy work load semester.", "rating": 2, "expected_grade": "B-", "created": "2023-12-16T01:32:17.917221Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "TAKE DR. DIXON SHE IS AN AMAZING PROFESSOR. I was originally registered for davis, but for some reason he suddenly chose to not teach for the fall, so I switched to Dr. Dixon and it was the best decision I made. She teaches concepts very thoroughly and provides plenty of practice through her lecture sides and CAN sessions. She provides 3 exams that are difficult but are very fair. You also get extra credit assignments before each exam to earn up to 12 points on that exam. The final was very fair and was not that hard. Dr. Dixon prepared you very well to succeed in the class and as long as you put an effort to study, you will more than likely succeed. Take Dr. Dixon she is the absolute best in the CHEM department", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T15:36:04.811266Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "DR DIXON IS AN ICON! She makes so much time for students and gives you a ton of practice problems, extra credit, and a huge curve on tests. She's the reason i had a fantastic experience in Orgo II and I can't wait to take her for biochem. I genuinely looked forwards to class because she's engaging and hilarious and will always tell you the best stories in class. If you're interested in orgo from a biological point of view, i would highly recommend Dr. Dixon for an amazing class and a passionate professor.", "rating": 5, "expected_grade": "A", "created": "2023-12-18T21:22:34.517452Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "The best chem professor at UMD easily! I was originally signed up for davis because I heard he was also good, but for some reason he decided to not teach fall over the summer, so I made the switch to Dr. Dixon. I am so glad I made this switch over stocker because I had stocker for orgo 1 and found her to be a bad teacher. Dr. Dixon provides you with all the resources you need to succeed in the class and perform well in the exams. The exams are difficult, but she gives you extra credit before every exam to earn up to 12 points. She provides plenty of practice and host chem review sessions every monday to go over topics. The final was very fair and was designed to help students succeed and boost their grade. Take Dr. Dixon you will 100% not regret your decision.", "rating": 5, "expected_grade": "A+", "created": "2023-12-20T01:31:26.156440Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "I think Dr. Dixon is a great professor. Her lectures are very clear and easy to understand. She does go in depth in every topic, however, but it ensures that you know it thoroughly. You can't get off on the notes she posts though, as her handwriting is quite messy; but if you go to most lectures you are golden. She also makes asynchronous videos, which are amazing and again easy to understand, and she does try her best!! Also her cutoffs are beautiful, and along with extra credit, you shouldn't worry too much about your overall grade. Her exams are usually a lot harder than other professors teaching the same subject (at least my semester), but again the extra credit gives you around a 10-12 point boost on each exam (the extra cred assignments are very hard and kinda messy, but if you have friends to work with, you should be fine). My only issue with her is her being kinda intimidating and not super open to questions. She will argue back with you in class if you are too inquisitive, but having her at 8 am may have exposed me to a different side of her. Still love her, and would take her again for BCHEM.", "rating": 4, "expected_grade": "A+", "created": "2023-12-22T19:53:08.046170Z"}, {"professor": "Bonnie Dixon", "course": "CHEM241", "review": "Dixon is a good prof. Her cutoffs are great, and extra credit also boosts your grade a lot. Her exams are very tough, but she usually outlines major questions that will be directly on the exam the lecture before, so you know what to focus on while studying. Her homework is hell, but again good practice, and if you devote time to it and check with others, you should also be fine. Often her exam questions are pulled straight from the homework or her CAN (chemistry at night videos she does every week to go over practice problems). Her first exam stumped me, but the rest were easy As even without extra cred as you can figure out how her questions will be framed (she quite literally says them in class!! just don't skip lecture or have friends who go to lectures lol). If you do the homework diligently and don't copy off of others, and also redo her CAN worksheets, you can get away with good scores without doing a gazillion problem sets. She REALLY wants you to succeed in class, and pass it! She won't try to hurt you, curve down, or anything like that. I would take her again for BCHEM.", "rating": 4, "expected_grade": "A+", "created": "2023-12-22T20:11:16.298799Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "The GOAT. \r\nIf you put effort in the class and work with a study group for the HWs and extra credits you will get a good grade.", "rating": 5, "expected_grade": "A+", "created": "2024-01-23T20:04:05.146980Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "Take Dixon!!! Organic chemistry is going to take time and effort no matter who you have but with Dixon it really isn't that hard because she gives you so many resources and is so willing to help you. She has office hours all the time, makes videos after class, does zooms once a week in the evening (and they're recorded) and is just generally so committed to helping you learn the material. She wants you to succeed! She is also so patient with questions even if they are questions you should definitely already know the answer to (although sometimes will refer you to a video she's made but tbh you should watch the videos anyways). I also think she's funny. Overall I HIGHLY recommend taking Dixon.\r\nAnd if you do take her class, make sure to start homework early because it can be difficult, and always go in to office hours and watch videos if you need help! The resources are there, so use them! You can do this.", "rating": 5, "expected_grade": "A+", "created": "2024-01-24T22:07:00.066474Z"}, {"professor": "Bonnie Dixon", "course": "CHEM231", "review": "I already left a positive review of her bc overall I like her BUT I forgot something very important!! \r\nThe main issue I had with Dixon was that every one of her homework assignments (and tbh the exams too) had an error on it! If you think an assigned problem is impossible that's because it might be! So you kind of have to go in to office hours sometimes so she can tell you what it's supposed to say and that is frustrating. Just keep this in mind so you don't think you're going crazy when something makes no sense even though you think you understand.", "rating": 5, "expected_grade": "A+", "created": "2024-01-24T22:42:34.579840Z"}, {"professor": "Bonnie Dixon", "course": "BCHM463", "review": "I loved her so much!!! Yes it is a very hard class. But to be honest, there's no avoiding that, no matter who teaches it. But she teaches in a way that is very understandable and she is honestly one of the best chemistry teachers. I would say that it is a must to go to her office hours, especially for the homeworks. Most of the people who consistently went to her office hours generally did much better.", "rating": 5, "expected_grade": "A-", "created": "2024-01-25T19:03:18.622299Z"}], "name": "Bonnie Dixon", "slug": "dixon_bonnie"}