{"courses": ["BUMO777", "BUSI660", "BMGT828L", "BUMO778B", "BUMO778A", "BUMO732", "BMGT878L", "BMGT461M", "BMGT878X", "BMGT828T", "INST728D", "ENES778A", "BMGT878G", "BMGT461", "BMGT461N", "BUSM798C", "BUSO712", "BMGT878Y", "BMGT878P", "BMGT461M", "BMGT878P", "BMGT878Y", "BUSI793", "BUSM798C", "BUSO712", "BMGT878P", "BUSI793", "BMGT461M", "BMGT878Y", "BMGT878A", "BMGT461M", "BMGT878P", "BUSI793"], "average_rating": 2.0, "type": "professor", "reviews": [{"professor": "Brent Goldfarb", "course": null, "review": "Avoid like the plague. He is condescending, irritating, and tells you how to think without teaching you how to think. Grades are assigned randomly, and there is no telling what receives an A, and what receives a B. Although he teaches graduate school courses, he does not act like it. I am not paying exorbitant tuition to be taught by someone like him.\n\r\nEveryone I know has a problem with his teaching and his courses. I'm not sure how he's survived this long in the business school.\n\r\nIn conclusion: you don't need to take any course that badly, that you can't take it with another professor.", "rating": 1, "expected_grade": "", "created": "2013-02-15T22:28:00Z"}, {"professor": "Brent Goldfarb", "course": "BMGT461", "review": "Interesting class overall, although I don't think it helps you become an entrepreneur. Course is graded on weekly assignments, including case studies and videos, which are discussed in class. During the semester a business is to be created and run throughout with randomly assigned team members. There are two ways to get an A in the course, by making a significant amount of profit or having more points by winning competitions based on the business through the semester. Several groups in all sections have to turn away from their first idea and pivot to another to survive. On the plus side, the lowest grade in the syllabus is a C with 0's for everything.", "rating": 4, "expected_grade": "B", "created": "2018-10-31T22:35:36Z"}, {"professor": "Brent Goldfarb", "course": "BMGT461N", "review": "Course work is very tedious, especially trying to run a business on top of other classes. Takes a couple hours extra a week on top of weekly assignments. People with a large social media following are likely to do well in the course. Be prepared to give about 5 pitches throughout the semester, which are between 3 to 5 minutes. HE IS NOT AN ENTREPRENEUR so it's hard to learn from him. Class is also very long and boring.", "rating": 1, "expected_grade": "C", "created": "2018-11-09T18:58:11Z"}, {"professor": "Brent Goldfarb", "course": "BMGT461M", "review": "He's pretty nice and helpful if you have any questions. However, the class is structured terribly. If you have a bad group member or two your grade will suffer, because the class is graded on a curve of how much money your business makes. There are also in class assignments graded on a curve, so you need to be better than the other groups. If the grading was normal and the business wasn't graded on profit, his lectures would be 5 stars because the case studies and class content are very engaging.", "rating": 2, "expected_grade": "B", "created": "2024-03-28T17:19:19.315664Z"}], "name": "Brent Goldfarb", "slug": "goldfarb"}