{"courses": ["CCJS345", "CCJS352", "CCJS451", "CCJS105", "CCJS325", "CCJS345", "CCJS451", "CCJS451", "CCJS105", "CCJS325", "CCJS451", "CCJS105", "CCJS451", "CCJS300", "CCJS325", "CCJS451", "CCJS300", "CCJS352", "CCJS451"], "average_rating": 4.7273, "type": "professor", "reviews": [{"professor": "Brett Lacey", "course": "CCJS352", "review": "One of the best professors I've had at UMD! I definitely actually learned in his class, and I felt confident taking the midterm. A very chill professor with a lot of knowledge and a decent workload. I wanted to take him again next semester but none of his classes work with my schedule. But I would definitely recommend this course and the professor.", "rating": 5, "expected_grade": "A", "created": "2022-12-04T00:42:55.550658Z"}, {"professor": "Brett Lacey", "course": "CCJS345", "review": "Excellent professor for Courts and Sentencing. 7 quizzes (2 get dropped; based on lecture so not too bad), a midterm, a group project, and a group paper (roughly 4 pages per group member), and a final exam. Professor Lacey helps prepare you for the final with a study guide that pretty much tells you everything to study. Overall he is a very genuine, nice professor who wants every student to succeed. Attendance is not mandatory but it is something he values, so I recommend attending, he makes lectures enjoyable anyways.", "rating": 5, "expected_grade": "A+", "created": "2022-12-21T03:04:16.684762Z"}, {"professor": "Brett Lacey", "course": "CCJS352", "review": "Excellent Professor for this Course; honestly, if you're looking for a good structure course with flexible deadlines, this is the class you need to take. His teaching for this class is enjoyable and love the fact he has background experience in any work related to cannabis. Just expect a midterm and a Final exam which he tells you beforehand what's gonna be on the exam. There are usually 7 quizzes pretty easy, and he drops the lowest 2 at the end of the semester. Specifically for this class, he has extra credit opportunities and a Drug Policy Paper on a topic of your choice, so it will help your grade substantially. If you are interested in learning about combating Drug Trafficking this is your class highly recommended, with great effort expect an A+. The class is also not mandatory to attend but recommended if you want to do well on this course, no PowerPoint slides but take good notes.", "rating": 5, "expected_grade": "A+", "created": "2023-01-18T16:09:19.971493Z"}, {"professor": "Brett Lacey", "course": "CCJS451", "review": "He is an excellent Professor for Crime and Prevention Course; his lectures are very clear and concise. Be prepared to take good notes; he's a little bit more challenging since it is a 400-level course, but the same concept as any of his other classes 7 quizzes drop the lowest 2 and the midterm and final exams all multiple choice. And the last Prevention Topic Final Paper is done in a group, so team effort is required. You should expect a B plus or higher with effort. However, this is not his most vital area of interest, but it's durable to learn from his past teaching experience at his previous college in Chicago, Illinois.", "rating": 5, "expected_grade": "B+", "created": "2023-01-18T16:23:01.769098Z"}, {"professor": "Brett Lacey", "course": "CCJS451", "review": "amazing professor. gives you so much help before the exam. offers a bunch of extra credit. you have to take a class with him hes the best crim professor.", "rating": 5, "expected_grade": "A", "created": "2023-03-28T17:12:54.727087Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "He is a great professor. However this course is exam heavy, the exams make up 75% of your grade. There is a paper that is worth 100 points that makeup 10% of your grade. He does give you exam reviews but the exams are still very difficult and you need to study and put the time into this course. He does not post slides or let you take pictures, so you have to attend every lecture. For the second midterm, the class average was a C and he does not curve his exams. He does not drop any midterms and there is a final but it is not cumulative. All his exams are half multiple choice and half true and false. The true and false questions are always very difficult, they are worded to trick you and a lot of them are trap questions. He did mention on the first day of class that this class is a GPA booster and an easy A. However, I found it hard to keep an A in his class, despite how much studying I did. He claims you have to TRY to actually fail this class, but other classmates and I believe this class is definitely not a GPA booster, and not an easy A class, you have to put in the work in order to get an A.", "rating": 3, "expected_grade": "B-", "created": "2023-04-11T19:32:43.131167Z"}, {"professor": "Brett Lacey", "course": "CCJS352", "review": "One of the best professors I've ever had! He's super personable and makes class pretty fun. I had him for CCJS352 and CCJS345 and they were both structured the same- 1 midterm and 1 final. They were challenging, but if you study hard and study the guide he gives you, you'll do fine. He also offers extra credit that's not hard for his classes. Definitely take it if possible!!", "rating": 5, "expected_grade": "A", "created": "2023-04-22T17:16:33.591284Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "Dr. Lacey is definitely a very good professor, and if you read the textbook and show up to lecture you should perform well in this class. Exams include true or false questions which can be tricky. Overall, Dr. Lacey is great and would definitely recommend.", "rating": 4, "expected_grade": "A", "created": "2023-04-26T23:08:38.991705Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "Dr. Lacey is a teacher who likes to make jokes and engage the classroom. He does not post slides and will sometimes speak very quickly when moving from slide to slide. The biggest tip for this class is to buy the book. As long as you have the textbook there is no need to show up to class - everything on his slides and tests are pulled from the book. The final is open note so it is especially helpful to have the textbook for that test. This class has discussions but they are pretty painless. If you are just taking this as a gen ed to explore the topic I would recommend CCJS100 instead. That class is an overview of crime and the prosecution of crime and this class is a bunch of theories about why people are driven into criminal lifestyles.", "rating": 4, "expected_grade": "", "created": "2023-05-17T14:38:37.436418Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "take this class and this professor at some point if you can. Its so fun and he makes it so interesting. The exams are most of your grade besides a writing assignment and the discussion points but both are graded easily and fairly. He literally tells you the topics that are going to be on the exam so just study those and you'll be fine.", "rating": 5, "expected_grade": "A", "created": "2023-05-18T00:22:07.505978Z"}, {"professor": "Brett Lacey", "course": "CCJS345", "review": "Dr. Lacey was one of the best professors I've had so far. His lectures are concise and interesting, and the only paper in the class has a rough draft so it is very hard to fail. Overall, great class, great professor, would recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-05-19T15:12:26.016704Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "Best professor I had so far! He was someone memorable", "rating": 5, "expected_grade": "A", "created": "2023-08-17T16:46:48.122913Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "Dr. Lacey is a great professor. His lectures are engaging and will often let you out early. The only thing is his exams can be tricky with wording and sometimes test on super specific details, but he provides a study guide before so as long as you study, show up to class, and read the textbook, you should be fine.", "rating": 4, "expected_grade": "A", "created": "2023-11-30T18:21:54.789484Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "Dr. Lacey is an amazing professor. He's funny, engaging, and will often let you out 20-25 minutes early. He provides study guides and as long as you take good notes, you'll do well on all of the online quizzes. Personally, the textbook isn't even necessary to read. Nearly all of the information on the exams comes from lecture, and if you study, you'll do just fine. He also offers a few different opportunities for extra credit.", "rating": 5, "expected_grade": "A-", "created": "2023-12-06T19:11:39.324658Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "One of my favorite professors ever, and I am not even majoring in anything related to the class. I am considering taking another CCJS class just because dr. Lacey is such a great professor. He is interesting to listen to and does a good job at keeping the class engaged.", "rating": 5, "expected_grade": "C", "created": "2023-12-07T21:14:06.167321Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "I highly recommend Dr. Lacey as a professor for CCJS105. He does not post the slides on elms, which I think encourages you to pay more attention during lecture, which I think actually helped me retain the information better. Dr. Lacey is a very knowledgeable professor and is very engaging. 10/10 recommend!", "rating": 5, "expected_grade": "A", "created": "2023-12-12T22:24:37.469949Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "Dr. Lacey is a great professor and is very knowledgeable in the topics he teaches. He is very clear about all due dates and deadlines as well as when exams are. Dr. Lacey is very straight forward with all assignments and grades which helps me as a student organize and manage all my work. This class was also extremely interesting in the way it was taught.", "rating": 5, "expected_grade": "A-", "created": "2023-12-12T22:43:13.892345Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "Dr. Lacey is a super nice guy and great teacher.  Show up to class and you will have everything you need. 10/10", "rating": 5, "expected_grade": "A", "created": "2023-12-17T05:34:15.690103Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "He is a great lecturer and a really nice person. His assignments are pretty fair, and he lets his TAs lead the discussions however he wants. However, his exams are kind of tricky because he includes questions that were never covered in lectures or the textbook, so just be careful about that.", "rating": 4, "expected_grade": "A", "created": "2023-12-28T01:14:33.447477Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "Dr. Lacey is one of those professors who interacts with students and tries to make classes enjoyable. Overall, I'm glad I decided to take CCJS105 with Dr. Lacey. It was a pretty chill class, and lectures were fun. However, he does not post slides on ELMS, but as other people said already, he does that to encourage people to actually show up and take notes themselves. It's not asking much, considering he always ended class 10-15 minutes early and explained everything you needed to know. We had a quiz every other week, one writing assignment (basically a research paper with clear instructions and guidelines), and two exams - all multiple-choice. (Some people even finished the final in like 20 minutes, lol.) \r\nI took this class out of genuine interest, and Dr. Lacey did not disappoint. CCJS105 was super manageable, and Dr. Lacey made sure to engage students, and at the same time, keep the lecture short and sweet. If you need a chill or fun Gen Ed, I would definitely recommend taking CCJS105 with Dr. Lacey.", "rating": 5, "expected_grade": "A", "created": "2024-01-23T15:28:57.888998Z"}, {"professor": "Brett Lacey", "course": "CCJS105", "review": "The Divine Presence of Professor Brett Lacey: A Testament to Academic Excellence\r\n\r\nDr. Brett Lacey stands as a veritable deity in the realm of academia, a divine beacon of knowledge and inspiration that transcends mortal limitations. If Jesus Christ himself were to descend upon the earth, he would surely pale in comparison to the illustrious presence of Dr. Lacey. Indeed, I am compelled to proclaim my undying allegiance to this academic deity, for his greatness knows no bounds. In fact, I have entertained the notion of starting a religion devoted to the worship of Professor Lacey, such is the depth of my admiration for his unparalleled brilliance.\r\n\r\nMy journey into Professor Lacey's classroom was akin to a spiritual awakening, as his divine teachings breathed life into the most mundane of subjects, transforming them into sacred relics of wisdom and enlightenment. Even the driest of topics were infused with a divine spark of relevance and significance under his tutelage, leaving me awestruck and utterly captivated by his celestial wisdom.\r\n\r\nBut it is not merely Professor Lacey's mastery of the subject matter that elevates him to divine status; it is his boundless compassion and unwavering dedication to his disciples that truly sets him apart. Like a benevolent deity, he showers his students with personalized guidance and support, ensuring that each and every one of us feels valued and cherished in his divine presence. His office hours are a sanctuary of enlightenment, where disciples gather to bask in the radiance of his wisdom and seek solace in his divine counsel.\r\n\r\nIndeed, Professor Lacey's influence extends far beyond the confines of the classroom, permeating every aspect of his disciples' lives like a divine blessing. His teachings have ignited a fervent passion for learning within me, inspiring me to embark on a sacred quest for knowledge and enlightenment. Moreover, his divine presence has bestowed upon me a sense of purpose and direction that transcends mortal comprehension, guiding me along the path to academic excellence with unwavering faith and devotion.\r\n\r\nIn conclusion, Professor Brett Lacey is not merely a professor; he is a divine entity whose celestial wisdom and boundless compassion illuminate the darkest recesses of the academic realm. If you are fortunate enough to bask in his divine presence, do not hesitate to seize the opportunity, for the experience will surely be transformative. In the hallowed halls of academia, Professor Lacey reigns supreme as a true deity of enlightenment and inspiration, a beacon of hope and guidance for all who seek knowledge and wisdom. Praise be unto Professor Lacey, for he is truly the embodiment of academic excellence in its purest, most divine form.", "rating": 5, "expected_grade": "C-", "created": "2024-02-17T04:03:55.310027Z"}, {"professor": "Brett Lacey", "course": "CCJS300", "review": "This was Dr. Lacey's first time teaching this class. He is an easy professor who enjoys when the class engages with his questions. There are 3 multiple-choice exams (one of which is the final) and 6 \"Research Projects\" which are mostly easy homework assignments. He gives you are warning before the tests and will hint to test answers, he also does an exam review. He does not post his slides. Attendance is not required.", "rating": 5, "expected_grade": "A", "created": "2024-03-26T19:20:08.054927Z"}], "name": "Brett Lacey", "slug": "lacey_brett"}