{"courses": ["ENGL245", "ENGL101", "ENGL222", "CMLT277", "ENGL255", "FILM245", "CMLT275", "WMST275", "ENGL393", "ENGL293", "ENGL101", "ENGL101S", "ENGL290", "ENGL101", "ENGL101", "ENGL245", "ENGL101"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Brian Davis", "course": "ENGL101", "review": "Awesome guy, great professor. Brian is the man", "rating": 5, "expected_grade": "A+", "created": "2018-05-01T18:10:52Z"}, {"professor": "Brian Davis", "course": "ENGL101", "review": "You wanna take Mr. Davis for Engl101. He's really laid back, and grades really lightly. Just follow the directions for papers and you'll be guaranteed an A. He also assigns less work than other Engl101 teachers. Makes a lot of jokes in class, and is really great in general. ", "rating": 5, "expected_grade": "A", "created": "2018-05-03T22:47:23Z"}, {"professor": "Brian Davis", "course": "ENGL393", "review": "Davis is a nice and effective professor, and has done a pretty good job of running things online. Readings get to be a little much sometimes (this was more applicable in the first half of the semester), but other than that the workload is very manageable. There are several papers/projects throughout the semester; some individual, some group work. All of it can be done in a reasonable amount of time, and Davis is willing to listen if there are any issues with meeting deadlines. Grading is also pretty generous; grades tend to go from the high B to mid A range, tending towards the latter. ", "rating": 5, "expected_grade": "A", "created": "2021-05-20T17:38:12Z"}, {"professor": "Brian Davis", "course": "ENGL245", "review": "Thoroughly impressed. Dude has a lot of passion for teaching and is really helpful. I kind of slacked off in the class a bit which I do regret because Davis definitely didn't deserve that, yet he still was incredibly lenient for late work and absences. Really kind professor, you're in good hands. ", "rating": 5, "expected_grade": "A", "created": "2021-12-12T23:45:56Z"}, {"professor": "Brian Davis", "course": "ENGL101", "review": "Best professor ever. He is the most laid back, reasonable, and respectable professional I have ever had.", "rating": 5, "expected_grade": "A", "created": "2021-12-20T05:05:45Z"}, {"professor": "Brian Davis", "course": "ENGL101", "review": "If you ever get the chance, definitely take a class with Dr. Davis. Absolutely incredible professor. Gives intense feedback but is a really fair grader if you put in effort. He's really accommodating and has really insightful commentary.", "rating": 5, "expected_grade": "A", "created": "2022-12-11T02:21:59.356524Z"}, {"professor": "Brian Davis", "course": "ENGL101", "review": "Dr. Davis is hands down the best professor I've had at Maryland. He genuinely cares a lot about teaching, and I've learned really valuable and applicable writing concepts from him. He's really laid back and is extremely generous about attendance and extensions but please please take somebody else if you're planning on not giving him the same effort he gives you - he deserves way better. I hate writing in general and his class was late (6:30-7:45) that I thought it would be hard to make it all the time, but I actually looked forward to the class every day.", "rating": 5, "expected_grade": "A+", "created": "2023-05-10T22:49:19.839500Z"}, {"professor": "Brian Davis", "course": "ENGL245", "review": "Brian Davis is to die for. He's witty, entertaining, and engaged. He truly cares for the class and his students. All assignments are online, open-note. His feedback is student-specific and helpful nonetheless. When he speaks, he ends the sentence with a tone that sounds like he's asking a question which I've enjoyed. I don't know if he does it on purpose. Best film class for students who know little to students who know a lot!", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T20:37:40.451915Z"}, {"professor": "Brian Davis", "course": "ENGL101", "review": "Professor Brian is one of the best teachers I've had in a while. He is very relaxed and understanding if you have any issues meeting a deadline. He also provides helpful feedback and wants everyone to succeed in his class. I would definitely take a class with him again.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T21:48:46.867919Z"}, {"professor": "Brian Davis", "course": "ENGL101", "review": "Prof. Davis is absolutely amazing! He is so passionate about what he teaches and is so caring. He provided great feedback, and the whole class was very low-stress. He's such a funny and nice guy, very chill, and often pushed back deadlines when we needed/wanted him to. Highly recommend him.", "rating": 5, "expected_grade": "A", "created": "2024-02-14T16:31:38.680356Z"}], "name": "Brian Davis", "slug": "davis_brian"}