{"courses": ["BSCI201", "BSCI202", "BSCI430", "BSCI201", "BSCI202", "BSCI201", "BSCI202", "BSCI201", "BSCI202", "BSCI430", "BSCI201", "BSCI202", "BSCI201", "BSCI202", "BSCI430", "BSCI201", "BSCI202", "BSCI201", "BSCI202", "BSCI430", "BSCI201", "BSCI202"], "average_rating": 2.8571, "type": "professor", "reviews": [{"professor": "Caitlin Fox", "course": "BSCI201", "review": "Unorganized, and does not specifically outline what needs to be learnt for lab practicals.", "rating": 1, "expected_grade": "", "created": "2021-10-31T01:29:01Z"}, {"professor": "Caitlin Fox", "course": "BSCI202", "review": "First of all... if you are going to make your students purchase YOUR OWN lab manual every semester, at MINIMUM make sure that it encompasses all the material. Studying for the practicals is more of a scavenger hunt than actually learning the material. I spent more time gathering the appropriate diagrams and lecture slides that actually memorizing them. Horrendous professor. Have fun taking her for two semesters. ", "rating": 1, "expected_grade": "", "created": "2022-04-28T23:00:21Z"}, {"professor": "Caitlin Fox", "course": "BSCI430", "review": "Dr. Fox was a great professor! Her lectures were easy to follow and she had a lot of smaller assignments for the class so your grade isn't based just on exams. The exams are very reasonable though, and as along as you study you will be fine. I learned a lot in this class and I recommend it if you are looking for an upper level bio that won't take up too much of your time. Dr. Fox is a very approachable person as well!", "rating": 5, "expected_grade": "A+", "created": "2022-05-16T19:50:41Z"}, {"professor": "Caitlin Fox", "course": "BSCI202", "review": "I only ever met Dr. Fox once, but she coordinated the BSCI 201 and 202 labs, and this review is for both. Like most lab coordinators, she's not good at her job, and gets away with it because she almost never has to interact with students directly. The activities in lab are incredibly time consuming but aren't actually helpful, especially the design an experiment activities with the lab computer software that never works right. The textbook is expensive and unhelpful, usually providing more info that you need so you don't know what to study. The lab practicals are done in an incredibly stupid format, where you move around the room in timed stations and do a question at each station. Studying for those practicals is worse, because Dr. Fox doesn't give you a good sense of what you need to study other than \"everything\", which sometimes includes 200 bones or 400+ muscles/muscle attachment points. You wind up studying a bunch of memorization stuff, most of which you don't need, then end up with a bunch of questions on something you barely studied because you thought it wasn't important. Unfortunately, there's no avoiding her if you need to take anatomy, so you just have to deal with the terrible lab.", "rating": 1, "expected_grade": "A", "created": "2023-01-25T05:16:47.479378Z"}, {"professor": "Caitlin Fox", "course": "BSCI201", "review": "These reviews are not it. I have had Dr. Fox as a lab coordinator for multiple classes. If you pay attention, read the material, and study the powerpoints you will succeed. She runs the lab so well and teaches her TAs what needs to be emphasized in class (I have been her TA for multiple semesters.)", "rating": 5, "expected_grade": "A", "created": "2023-02-24T15:19:32.425949Z"}, {"professor": "Caitlin Fox", "course": "BSCI430", "review": "great lecturer! very available and interesting course material", "rating": 5, "expected_grade": "A-", "created": "2023-05-14T01:24:07.778047Z"}, {"professor": "Caitlin Fox", "course": "BSCI201", "review": "I never met Professor Fox but she was the lab coordinator. The TA's that run the lab sessions are fine the problem is the layout of the labs. You are there for an average time of 40 minutes and just get spit information from slides and basically are told \"ok go learn all of it in your free time now\". The other very annoying thing was for the practicals the information was not clear at all. You need to severely overstudy to do well in the 201 lab which makes you not feel relieved at all when you finish. For instance, they make you memorize maybe 90 bone markings for there only to be 4 on the exam you have to locate. Overall, just study study study and you can get through this lab. If you are a good memorizer this class is for you!", "rating": 2, "expected_grade": "A", "created": "2023-12-05T22:14:36.468218Z"}], "name": "Caitlin Fox", "slug": "fox_caitlin"}