{"courses": ["COMM107", "COMM798A", "COMM107C", "COMM107", "COMM107C", "COMM107", "COMM107C", "COMM798A", "COMM107", "COMM107C", "COMM107C", "COMM107", "COMM107", "COMM107C", "COMM107C"], "average_rating": 3.8182, "type": "professor", "reviews": [{"professor": "Cassondra Pope", "course": "COMM107", "review": "Ms. Pope's class was one of those classes were she wasn't about to let you slack off and do nothing, however, everything you would ever do in the class would be for the genuine purpose of you becoming a better speaker in class. She was an awesome teacher and she made class really fun and engaging through a bunch of in class activities and she was also super helpful in clarifying topics or guidelines for assignments. She's a fair grader too and leaves a ton of feedback on every assignment you do. 10/10 recommend taking her course. Only thing I didn't like was the textbook but that's just cuz textbooks are absolute ass with any class.", "rating": 5, "expected_grade": "A+", "created": "2021-05-13T16:43:28Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "I feel like she wasn't always super considerate of the circumstances her students were facing. I distinctly remember an email where she told me \"The pandemic is not an excuse for you to not attend class.\" This was when I decided to take class online for 2 days right before spring break (where UMD practically forced students to go home) in order to avoid possibly infecting my family, some of whom are high risk. ", "rating": 2, "expected_grade": "B+", "created": "2021-05-14T20:59:42Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "This class is pretty straightforward. I hate public speaking, but Cassondra provides good feedback after every speech and keeps the environment decently light. You do need a decent amount of time to prep, but if you put in the work you should be good. She doesn't take nonsense from anyone, but overall I had a good time and felt like I actually learned from this class. ", "rating": 4, "expected_grade": "A", "created": "2021-12-21T19:34:35Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "I loved this class with professor pope. My comm class felt like a group of friends by the end of it and professor pope was a huge reason why. She encourages you to get to know everyone and her class assignments are super fun.", "rating": 4, "expected_grade": "A", "created": "2022-12-17T04:40:38.965110Z"}, {"professor": "Cassondra Pope", "course": "COMM107C", "review": "She gives good feedback on public speaking and the class is overall fun, if a little cheesy. It felt like a middle school class sometimes. She wasn't always considerate of student's feelings and circumstances, though: she would sometimes laugh at our chosen speech topics or complain if a student missed class for illness, and we were encouraged to give speeches even when we were sick.", "rating": 3, "expected_grade": "A+", "created": "2022-12-24T03:31:40.068232Z"}, {"professor": "Cassondra Pope", "course": "COMM107C", "review": "She doesn't have in-person tests. Good professor if you put in the work to prepare speeches and go to class. Does get a little mad over trivial matters, but just be a background character for everything except speeches and games and you should avoid her wrath.", "rating": 5, "expected_grade": "A", "created": "2023-01-23T05:16:49.572179Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "Professor Pope is great and I loved how our class bonded. She can get a little frustrated sometimes, but I like this class and she is a great teacher.", "rating": 4, "expected_grade": "B+", "created": "2023-12-03T22:12:44.511463Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "All the quizzes are online which is great and they're pretty straightforward. It's easy to get an A in her class if you just follow the directions in her rubrics for the presentations. My class got close because she always had us do activities do get comfortable with each other. Not a difficult class to take.", "rating": 5, "expected_grade": "A", "created": "2023-12-04T15:47:48.968030Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "Overall I found this class to be helpful and fun. Professor Pope was very a great professor who helped push everyone to step outside their comfort zone and try new things. She wasn't very supportive when choosing topics to speak about but she did give good feedback on outlines and the speeches that I gave.", "rating": 4, "expected_grade": "A", "created": "2023-12-11T21:53:09.841329Z"}, {"professor": "Cassondra Pope", "course": "COMM107C", "review": "don't take her if you can. class isn't terrible but she makes it too time-consuming for a gen-ed class. harsh grader as well", "rating": 1, "expected_grade": "A", "created": "2023-12-17T20:11:17.693298Z"}, {"professor": "Cassondra Pope", "course": "COMM107", "review": "Professor Pope is a must-take. She explains what is expected clearly and is a lovely grader as long as you do your best! All she wants to see is improvement. If you've struggled in public speaking before, she makes a friendly environment where you can grow your skills.", "rating": 5, "expected_grade": "A+", "created": "2023-12-22T18:03:35.281394Z"}], "name": "Cassondra Pope", "slug": "pope_cassondra"}