{"courses": ["FIRE120", "FIRE272", "FIRE172", "FIRE198", "FIRE298", "FIRE398", "FIRE398", "BIOE461", "FIRE120", "FIRE298", "FIRE398", "GERM103", "BIOE461", "FIRE198", "FIRE398", "FIRE199", "FIRE199", "FIRE120", "FIRE298", "FIRE398", "BIOE461", "FIRE198", "FIRE398", "FIRE120", "FIRE298", "FIRE398"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Catherine Spirito", "course": "FIRE120", "review": "Really nice and a good instructor! ", "rating": 5, "expected_grade": "A+", "created": "2020-12-11T23:51:52Z"}, {"professor": "Catherine Spirito", "course": "FIRE198", "review": "Great professor and really understanding and caring for her students. The MD stream can be challenging but she makes sure to give students enough resources to really understand the research we are pursuing. ", "rating": 5, "expected_grade": "A", "created": "2021-05-22T18:17:55Z"}, {"professor": "Catherine Spirito", "course": "BIOE461", "review": "Best professor EVER. Hands down. Took a 400-level BIOE foundational elective and turned it into an engaging, learn-something-new-everyday kind of class. It started to feel less like a class and more like a workshop, constantly keeping you awake but in a good way -- Dr. Spirito truly cares about her students and puts in more than enough effort to help us keep up with the course content.\r\n\r\nThe overall structure of the class is fairly simple -- you should not have any issues with homework or quizzes, and it primarily revolves around this massive project that we all present at the end of the semester. You'll have mini-assignments regarding this project from the beginning of the semester all the way up to your presentation, so there's no way you can really \"fall behind\". However, I'd say that the kicker is really getting together with your teammates and making the project as *cohesive* as possible. This is something that gets emphasized during the middle of the semester, where everyone's got 2-3 midterms a week, so I'd highly recommend communicating with your teammates as early as you can. \r\n\r\nThe only downside I have to say is that there's a *lot* of groupwork during class. Like. A lot. A lot of collaborative thinking and stuff like that. I don't mind working with others, but when you're facing the brunt of the semester, sometimes all you want to do is just clock in and clock out of a lecture due to a lack of energy. However, do not let that deter you from this class, as the groupwork is super easy and simple, and both the class and Dr. Spirito are overall fun!", "rating": 5, "expected_grade": "A+", "created": "2023-01-07T05:59:18.738409Z"}], "name": "Catherine Spirito", "slug": "spirito"}