{"courses": ["ENGL101", "AASP298L", "ENGL234", "AASP298L", "ENGL234", "ENGL101", "ENGL245", "CINE245", "CMLT235"], "average_rating": 3.25, "type": "professor", "reviews": [{"professor": "Chauncey Dennie", "course": null, "review": "I took this class because of scheduling conflicts and not having many options left. But Professor Dennie was very chill, at times it seemed he really didn’t care too much about assignment specifics or even if a student shows up late to class—minor things like that. Which was great! he really was so kind and accommodating and the class did have very complex readings not going to lie, and were rather boring in my opinion. But the class discussion he leads makes it worth it in my opinion—and very entertaining. You read from several different novels, so it’s pretty reading heavy. I don’t think it was too assignment heavy, and attendance wasn’t absolutely required, although I wouldn’t recommend skipping out too much because you do have to present a chapter in a book where you teach the class through ppt. And there’s a few papers and a course playlist. But really, it’s not bad at all. I actually liked it even though it wasn’t the most interesting literature for me personally.", "rating": 4, "expected_grade": "", "created": "2023-09-04T07:59:28.284697Z"}, {"professor": "Chauncey Dennie", "course": "AASP298L", "review": "Chill professor, Slightly boring literature, Great Discussions, Reasonable Assignments. He didn’t really care about attendance or being nitpicky with assignment criteria which I found awesome! Our class discussions were very entertaining and you sign up for a presentation slot to present a specific part in the book the class reads. But you also have to participate in class debate with other groups who ask you questions about the novel. And a course playlist and a few papers at most. But this class was fair! It wasn’t the most interesting class out there for me personally because of the literature. And also, this was a last-minute decision class. But this professor was really nice so I’m all for it.", "rating": 4, "expected_grade": "A", "created": "2023-09-04T08:04:23.730884Z"}, {"professor": "Chauncey Dennie", "course": null, "review": "Chill guy", "rating": 4, "expected_grade": "", "created": "2023-09-04T08:05:29.969475Z"}, {"professor": "Chauncey Dennie", "course": "CMLT235", "review": "This professor needs a reality check. He grades the essays far too harshly for what this class is. It is a GenEd, and he grades like it is an upper level english course. Both of my papers were well written, and would have gotten a 95 in ENGL101, but he gave me a 70 on one and a 80 on the other. This guy needs to get a grip. Take an easier gened", "rating": 1, "expected_grade": "B-", "created": "2023-12-12T01:11:33.222726Z"}], "name": "Chauncey Dennie", "slug": "dennie"}