{"courses": ["JOUR300", "JOUR600", "JOUR698C", "JOUR456", "JOUR289J", "JOUR283", "JOUR283", "JOUR456", "JOUR283", "JOUR456", "JOUR283", "JOUR456", "JOUR283", "JOUR456", "JOUR283", "JOUR456", "JOUR283", "JOUR456"], "average_rating": 4.125, "type": "professor", "reviews": [{"professor": "Christopher Hanson", "course": "JOUR300", "review": "Easiest class ever. All we do is watch youtube videos of stuff like Tiger Woods cursing at himself and ask \"Is it ethical to show that on TV?\" \"Is it fair to him or his family?\" \"Does the audience need to know?\"\r\nHe is actually an ethical genius, he used to write for CJR. So, he knows what he is talking about even if he presents in an odd way. Like, sometimes he will pretend to be an old lady and have you interview him. It's hilarious but he usually does have a point if you pay attention.", "rating": 3, "expected_grade": "B", "created": "2010-05-13T11:16:00Z"}, {"professor": "Christopher Hanson", "course": "JOUR456", "review": "Pretty long and boring class. You have weekly readings which are interesting then you have a roughly 2-hour discussion about them. You have to lead one eventually (he picks which day). The grades come from participation, leading a discussion, and a short essay plus the final. The short essay is a few pages and the final is 2,000-2,500 words and is based on a book you choose from a list. I am a science major and I took this bc I thought it was gonna be easy which it was in a way, but pretty boring to me. I ended up skipping a few classes. I don't love writing but it wasn't too bad. Probably would liked it more if you are an actual journalism major.", "rating": 3, "expected_grade": "A+", "created": "2021-12-03T03:17:49Z"}, {"professor": "Christopher Hanson", "course": "JOUR283", "review": "Great Professor with tons of experience surrounding the topics of journalism, war, and politics. The class was very laid back and was spent conducting discussions and going over very interesting topics. The powerpoints that Professor Hanson presented contained very insightful videos and explanations of historic events. The class consistently ended early and rarely required take home readings. There are only a few quizzes all semester that are open note and he will go over any questions you have surrounding the quiz. Professor Hanson has a genuine passion for the content he's teaching and makes the class easy so long as you participate. I highly encourage anyone with an interest in this topic to take this class.", "rating": 5, "expected_grade": "A", "created": "2022-05-20T17:15:40Z"}, {"professor": "Christopher Hanson", "course": "JOUR283", "review": "Professor Hanson is very knowledgable in his area of teaching and often gave personal stories from both his time as a reporter and his families' experiences while fighting in the wars covered. He's quite unorganized with the ELMS page and can take quite a long time to grade but the class is interesting. If you go to the classes and look at the powerpoints it's pretty easy to get a good grade. He values participation in classes and started taking attendance towards the end of the semester even though he said he wouldn't so I'd recommend actually going to his classes if you take it.", "rating": 4, "expected_grade": "A", "created": "2023-05-18T03:16:24.408916Z"}, {"professor": "Christopher Hanson", "course": "JOUR456", "review": "Great class if you contribute to discussions and the rest of your class is also willing to. Hanson is a decent guy and interesting to listen to. He answers a lot of his own questions, but try to contribute as he really appreciates it. Also, do the readings -- they are genuinely good and varied reads. He doesn't ask for much except for participation & the class never goes for the full time on Testudo, so don't worry about that. Midterm is a paper, final is a paper -- both require minimal time/energy. He is a pretty cool dude, with extensive experience in reporting, not sure if it's totally relevant to how the news goes these days though.", "rating": 4, "expected_grade": "A-", "created": "2023-12-13T06:29:45.369366Z"}, {"professor": "Christopher Hanson", "course": "JOUR283", "review": "Very easy class and a cool professor. Guy knows a lot about everything it seems. All closed note quizes that are somewhat common sense if you look over powerpoints the night before. Assigned us readings but I never did a single one. Stopped going to class three weeks in and just looked at sylabus for quiz dates. Classes that I went to ended early. Overall, cool dude who even gave extra credit at the end.", "rating": 5, "expected_grade": "A", "created": "2023-12-18T05:39:42.135013Z"}, {"professor": "Christopher Hanson", "course": "JOUR283", "review": "Professor Hanson is a very knowledgeable professor with lots of experience with war journalism. The class was very interesting and focused on both history and journalism principles in the context of war. There were only a few readings for homework and the class wasn’t very time consuming. The only assignments were 4 quizzes, a midterm, and the final exam. The quizzes and tests weren't too difficult, as long as you spend some time to study for them. I would recommend taking this class if you need a humanities credit or are simply interested in the subject.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T16:19:18.761411Z"}, {"professor": "Christopher Hanson", "course": "JOUR283", "review": "This was a super interesting class if you are into different wars and the coverage of war in the media. Chris Hanson is a sweet professor who is super knowledgeable about the subject. Overall this class is composed of almost entirely multiple-choice exams with very little writing, however, these quizzes and exams make up the the entirety of your grade. He did provide extra credit assignments at the end of the semester for those who needed it and worked with students to try and help them achieve a good grade. His exams can be quite confusing at times and you have to attend class because he will test you on things he discusses in lecture. Overall an interesting class, but you will spend some time completing readings and will have to pay attention is lecture.", "rating": 4, "expected_grade": "A+", "created": "2023-12-19T19:29:22.414327Z"}], "name": "Christopher Hanson", "slug": "hanson_christopher"}