{"courses": ["CMSC216", "CMSC330", "CMSC216", "CMSC320", "CMSC330", "DATA320", "CMSC216"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Christopher Kauffman", "course": "CMSC330", "review": "first review!!\r\n\r\nprof k is awesome, he explains concepts super well, has awesome content (slides, code), and is truly passionate about what he teaches. i never thought i'd be so interested in programming languages, but here we are.", "rating": 5, "expected_grade": "", "created": "2023-10-19T21:59:35.242644Z"}, {"professor": "Christopher Kauffman", "course": "CMSC330", "review": "he can quickly adapt to teaching any course even if he's initially unfamiliar with them. very understanding when a huge curveball exists and is unafraid to admit mistakes. if you are ever curious and want to go more in-depth in the content, he links resources to do so.", "rating": 5, "expected_grade": "", "created": "2023-11-03T15:25:32.698786Z"}, {"professor": "Christopher Kauffman", "course": "CMSC330", "review": "I'm not actually his student for this course, but I've relied entirely on his posted lectures and supplemental code to get me through this course, so I felt I should leave a review since I chose another professor over him due to the lack of reviews. He's very knowledgeable, charismatic, and sometimes humorous. I've heard great things from his students. The way he explains things just sit super neatly in my head which I am not used to in CS. Take Kauffman!!", "rating": 5, "expected_grade": "", "created": "2023-11-08T02:27:15.907269Z"}, {"professor": "Christopher Kauffman", "course": "CMSC216", "review": "Awesome lecturer, extremely fun, smart, and just overall a chill person. Projects are challenging but really improve and solidify my understanding on the course material. Exams don't have any surprises or curveballs and I feel that I can only blame myself when getting subpar grades. His late policy and extra credit on projects really cut down my stress when struggling to figure out that one bug in my code one hour before submission time. He takes suggestions very well and is extremely communicative with students. Also, guest lecturer Parker solidifies him as a solid professor.", "rating": 5, "expected_grade": "B+", "created": "2023-11-09T18:23:51.950144Z"}, {"professor": "Christopher Kauffman", "course": null, "review": "So I took this class when he was co-teaching with Cliff and I really wish I had taken it when it was his own class with his own exams, quizzes, and projects because he always talks about how he would do something even if it's not what he can do in the present moment. \r\nIn case you need some sort of statement of his character he dressed up as Peter Parker for Halloween and it was hilarious. Also, he has a dad-tone sort of lecturing style and I'm here for it. He will adjust the lectures to account for students' questions. \r\nHe also admits when mistakes are made or something doesn't work out like he hoped it would. (i.e he wrote some open-ended questions for the exam for it was a shit show but he owned up to it)", "rating": 5, "expected_grade": "A-", "created": "2023-11-09T22:01:29.517110Z"}, {"professor": "Christopher Kauffman", "course": null, "review": "TAKE HIM. New and learning the UMD specifics but will quickly become one of the best in the CS Department", "rating": 5, "expected_grade": "", "created": "2023-11-13T17:29:29.147404Z"}, {"professor": "Christopher Kauffman", "course": "CMSC330", "review": "Very funny and helpful guy who cares a lot about your learning. Take him!", "rating": 5, "expected_grade": "A", "created": "2023-11-17T13:13:07.831578Z"}, {"professor": "Christopher Kauffman", "course": null, "review": "Truly incredible. A super genuine guy who takes teaching seriously. Prof Ks class is super engaging and fun", "rating": 5, "expected_grade": "A+", "created": "2023-11-17T15:20:53.012505Z"}, {"professor": "Christopher Kauffman", "course": null, "review": "Kauffman has been an incredible teacher... highly recommend!!!", "rating": 5, "expected_grade": "A", "created": "2023-11-28T20:43:05.586094Z"}, {"professor": "Christopher Kauffman", "course": "CMSC216", "review": "Lectures are great, assignments and exams are relatively easy", "rating": 5, "expected_grade": "", "created": "2023-11-29T20:33:39.426909Z"}, {"professor": "Christopher Kauffman", "course": "CMSC216", "review": "Prof K is on his way to being one of the GOAT's of CS professors. His lectures are great, the exams are manageable and actually test content that has appeared in the course before. His projects are a little difficult but I think that's just the class itself.", "rating": 5, "expected_grade": "B", "created": "2023-12-05T23:55:35.064675Z"}, {"professor": "Christopher Kauffman", "course": "CMSC330", "review": "Professor Kauffman is easily one of the best professors I've had at UMD so far, up there in Justin levels of greatness. Right here is a teacher who really seems like they care about the subject can teach it in a way thats easy to understand and seems to care for the students as well. He's personable, funny, and I am probably more engaged in his lectures than I am in any other CS lecture I've had before. One thing I love is that he'll always answer questions and is happy to do so. He's got funny little nerdy references in his slides as well which is nice coming from Larry. Overall, his command of the subject is impressive but not surprising given his experience. Everything he teaches in based off of textbooks or some source so you know what you're learning is legit and is following some level of a standard (and not just the arbitrary musings of some researcher). He comes off as a little passive agressive sometimes, but in a funny way and only when its warranted (a kid won't stop asking questions that are pointless and interrupt class, someone asks a question that was just answered, etc.). His slides were also pretty good, sort of dense but filled with useful motivating examples. The worst part of this experience with him was that it felt like he was always being hampered down by coteaching with Cliff, which makes sense. This is a man with 20+ years of educational experience, coming from the University of Minnesota and GWU (with raving reviews at both) and he shouldn't really have to coteach so I hope he isn't in the future. The projects that he himself wrote (project 7 and 8) were easier to understand and do compared to the collaborative ones which is good and I felt like I put in my time, learned something, and could walk away happy. If there are seats open for this man, take him. I just hope he stays at UMD because I think his ways of teaching should be an example for the whole department.", "rating": 5, "expected_grade": "A", "created": "2023-12-07T19:51:45.573246Z"}, {"professor": "Christopher Kauffman", "course": null, "review": "For context, I am BAD at cs. I’ve never learned more from a professor than from Prof K. His lectures are fantastic. I am insanely antsy so focusing for a 75 minute lecture is HARD, yet when he’s teaching I am locked in. He’s also a huge advocate for his students!", "rating": 5, "expected_grade": "C+", "created": "2023-12-09T16:41:26.637386Z"}, {"professor": "Christopher Kauffman", "course": "CMSC330", "review": "Professor Kauffman nailed everything you could want and expect of a professor. Despite being new to the department and the class, he quickly took charge of the material. His slides were excellent, covering history, documentation, example code, and exercises with answers. He gave us time to work on exercises, discuss with classmates, and always answered questions.\r\n\r\nHe genuinely cared about making sure we understood the material. He had amazing integrity, owning up to his own mistakes. He even provided recordings of the sessions. Professor Kauffman went above and beyond by sharing his opinions on the topics and discussing their practicality. He questioned why we covered certain topics and where the information came from.\r\n\r\nOverall, Professor Kauffman is a great addition to the CS Department, and I would recommend taking a class with him if you get the chance.", "rating": 5, "expected_grade": "B+", "created": "2023-12-10T11:23:49.282926Z"}, {"professor": "Christopher Kauffman", "course": "CMSC216", "review": "Great teacher, knows his stuff and is well prepared. start the projects early and utilize office hours. The class is great overall as he makes everything available on his GitHub and is quick to respond to emails", "rating": 5, "expected_grade": "", "created": "2023-12-13T04:07:26.380352Z"}, {"professor": "Christopher Kauffman", "course": "CMSC216", "review": "An amazing teacher that really goes above and beyond to help his students not only understand hard concepts, but really helps them apply it to things that will be applicable in the future and help these concepts stick. Projects are a little challenging but really interesting and class is extremely engaging.", "rating": 5, "expected_grade": "", "created": "2023-12-14T04:30:07.302468Z"}, {"professor": "Christopher Kauffman", "course": "CMSC216", "review": "Kauffman is the best professor I've had thus far at UMD. His lectures are pretty typical, but his course structure is excellent. His slides are well-organized and great review material. He gives out weekly homework and discussion exercises, which along with projects were my main learning drive in the class. \r\n\r\nHis exams are open-note and open-laptop but feature some difficult questions, the class average was about consistent with a typical CS class. I vastly prefer this style of exam, and I did well on both midterms. The final wasn't very difficult either, although I haven't gotten my score back as of writing this review. It is structured the same as the midterms.\r\n\r\nThe projects are pretty good. There aren't many of them compared to other classes, but the middle ones were fairly difficult. More projects might have been a little helpful, but in the end I don't feel like I missed out on much. \r\n\r\nThe last comment I have is on his extra-credit system. Kauffman has 'engagement points', which are optional extra-credit opportunities. By doing every optional assignment and participating in class you can get a couple percentage points of extra-credit, which lent me a sense of security. \r\n\r\nAll-in-all, take Kauffman if you ever have the opportunity. He's a great professor.", "rating": 5, "expected_grade": "A", "created": "2023-12-14T16:09:29.385235Z"}, {"professor": "Christopher Kauffman", "course": "CMSC216", "review": "I took him in F23, which was his first semester at UMD from UMN. If I could take him for another class, I would.\r\n\r\n(I assume some of the things he does will change as he works at UMD for longer, so I can't promise that every policy thing will be the same as when I'm writing this. But I doubt his personality or ability to teach or create great assessments will change anytime soon.)\r\n\r\nPERSONALITY:  He's easygoing and approachable but very serious about his class. He made sure that everything he wanted to be covered got covered, and that it was covered well. He expected us to care about the class and to be working hard on it. That being said, he was happy to make geeky references and jokes, signed off his emails with \"Cheers\", and made sure I got my ADS stuff properly. I just felt like he genuinely cared about all of our success.\r\n\r\nAS A LECTURER/MATERIAL: He's very competent, and I think he explained things quite well. He moves a little fast, but he did record and has good slides so that was rarely a concern. Ask questions. He didn't follow the same order or material that the other sections did, but I think the order we followed was good for understanding what we needed to and we really learned a lot of material. Like, looking back, wow. That was a lot of material. \r\n\r\nTESTS/PROJECTS/GRADING: None of my projects had secret or release tests, which ruled. Also we had open resource exams, which REALLY ruled. Will say that projects weren't easy, and many of us spent ages in OH. But they were SO useful for making sure you knew what you were doing. Like after I finished I felt really solid on concepts. His exams were great in content coverage and fairness, everything felt evenly asked about. And his \"engagement point\" policy was so student-friendly!\r\n\r\nTips for students who are taking his class:\r\n- haunt Piazza. \r\n- ask any questions you have in lecture. it actively benefits your understanding and your grade\r\n- go to discussions (not mandatory, but super useful. it just turned into to OH half the time)\r\n- start his projects early. it's easier to do when you have a lot of time.", "rating": 5, "expected_grade": "A-", "created": "2023-12-15T06:01:26.429279Z"}, {"professor": "Christopher Kauffman", "course": "CMSC330", "review": "Great lecturer. I had him when he was coteaching with Bakalian, but the content was well-taught, and the online notes were good. Has extra credit for participation in lectures and discussions, which can be a huge advantage, and course is project weighted.", "rating": 5, "expected_grade": "A", "created": "2023-12-16T06:17:06.666279Z"}, {"professor": "Christopher Kauffman", "course": "CMSC330", "review": "Kauffman is a great dude, and I really enjoyed his lectures. He was co-teaching with Cliff this semester, but his exams and quizzes were still fair and he owned up to when they were not. His lectures are super engaging and have good activities baked into them. \r\n\r\nOverall, 330 was not what I expected it to be - I thought it would be more of a software engineering course, but it was more the theory behind programming languages and deep exploration of functional programming (Ocaml)", "rating": 5, "expected_grade": "C-", "created": "2023-12-20T00:43:21.985443Z"}, {"professor": "Christopher Kauffman", "course": "CMSC330", "review": "Incredible Professor, definitely the best CS professor I've ever had, and he makes it a point to answer everyones question and make sure the class understands topics at a high level. Study the material in class and practice on your own with all the examples he provides in slides and discussions as well as actually understanding the projects, you'll be fine", "rating": 5, "expected_grade": "B", "created": "2023-12-21T00:08:06.709540Z"}, {"professor": "Christopher Kauffman", "course": "CMSC330", "review": "From my course eval:\r\n\r\n\"Professor Kauffman's lectures were extremely helpful in understanding the material and I appreciated the amount of time he spent going over concepts and the depth at which he covered them. His in-class activities were a breath of fresh air after previous lecture-heavy CS courses and helped solidify concepts. He answered questions during class thoroughly and was clearly passionate about the material and about his students' success. His slides were both informative and visually appealing (as a hobbyist graphic designer, I approve). His nerdy lecture examples were memorable (I recall a Lord of the Rings-themed one demonstrating OCaml records). When extenuating circumstances arose, he was quick to respond to emails and quick to be accommodating. He was extremely open to feedback and willing to sit down in office hours with his students discussing said feedback at length. I do not think I could have had a better 330 professor than him, and I will be looking forward to taking future courses with him (if possible).\"", "rating": 5, "expected_grade": "", "created": "2023-12-21T02:15:03.228155Z"}, {"professor": "Christopher Kauffman", "course": "CMSC216", "review": "Can tell that he genuinely cares about his student's understanding. He doesn't use secret tests because he doesn't believe that they improve student's learning. He takes time to introduce concepts on an easy level with discussion exercises and homework before testing your understanding of the concepts harder in projects and exams. Kauffman is a great, down-to-earth guy and I highly recommend any of his classes.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T22:03:15.319524Z"}, {"professor": "Christopher Kauffman", "course": "CMSC216", "review": "Well, where should I start? I came into this semester fearing 216 because I knew this course was going to be tough and I had no clue how the professor was going to be since he was new. But Kauffman made the class so much more exciting and fun than it was supposed to be. The way his course is structured really benefits the students quite a lot. 40% of the grade is in your pocket since it's all assignments, projects, and homework, which are fairly graded. The midterms and final exams have the same weight, i.e. 20% each. His projects can get a bit lengthy but the pro is that you can make up on a project that you didn't do well on by attempting the bonus credit for other projects. I would say that his exams can be a little tricky at times, but it is fair given the fact that it is an open book, and he also provided a sample paper, which was almost like the actual paper we give. He really cares about his students and answers basically any question you ask him, even if it is out of the syllabus. His entire concept of bonus engagement points is SO HELPFUL. You answer a question in class or on piazza and that gives you a bonus point! I would highly recommend you all to take him for whatever class he teaches because I can guarantee you that he won't let you down. As long as you do your work on time and understand the concepts well, you are guaranteed at least an A in this class!", "rating": 5, "expected_grade": "A", "created": "2023-12-22T11:48:30.006644Z"}, {"professor": "Christopher Kauffman", "course": null, "review": "He teaches the course like he's preparing you for industry, not an exam. He has a great sense of humor and occasionally brings in fun guest speakers. His project descriptions are very detailed, but not overbearing. It's nice to have the guidance of project descriptions and the video semi-walkthrough he makes for each project. The exams are open notes & computers, but not open internet. So you can check the slides and test code during the exams, as he's preparing you for industry and how programming is actually done not a silly test. Overall a great professor and a great human!", "rating": 5, "expected_grade": "A+", "created": "2023-12-23T18:45:07.805185Z"}, {"professor": "Christopher Kauffman", "course": null, "review": "Lectures are recorded and all the materials are online. Though you get bonus points for interacting during the lecture (just answering his questions or asking a question of your own). The bonus point are calculated based on a log base 2 function so for each bonus point (\"engagement point) you get the next one will need twice as many questions. so if you ask 15 questions you'll get 4 engagement points (l,ll,llll,llllllll). Each discussion and hw is worth an engagement point, so if you miss one, but still talk in lecture you're fine. You can also submit projects up to 48 hours late with each 24 hour increment costing an engagement point.", "rating": 5, "expected_grade": "", "created": "2023-12-23T18:51:29.018853Z"}, {"professor": "Christopher Kauffman", "course": "CMSC216", "review": "Prof. K. is the BEST professor for 216 (and likely any other course you see him teaching). He takes time to make very helpful slides + super engaging lectures. He makes help readily available with him and TAs having office hours + being super responsive on Piazza. Exams were open-resource this semester, as he felt it was more fair to make exams similar to how you would actually be doing development in the real world (and the exams were not a trap, they were very manageable). Projects can be difficult, so definitely start early, but there is a lot of help available, including the professor's detailed project website pages as well as his YouTube videos which overview the entire project with hints. He also offers makeup credit on projects which is very attainable. Finally, he gives extra credit w/ a sort of complex system, but basically if you do the labs and ask a couple questions in class, you'll get extra credit. If you see anyone not giving Prof. K. a 5-star for 216, ignore them, this is the best prof at UMD.", "rating": 5, "expected_grade": "A", "created": "2024-03-27T17:34:10.892635Z"}, {"professor": "Christopher Kauffman", "course": "CMSC216", "review": "Excellent teacher, just attend classes, start early (just to get a feeling for it) and labs.\r\nAgain, great teacher and person.", "rating": 5, "expected_grade": "B+", "created": "2024-03-28T15:12:31.020969Z"}], "name": "Christopher Kauffman", "slug": "kauffman_christopher"}