{"courses": ["CCJS230", "CCJS325", "CCJS350", "CCJS370", "CCJS331", "MLAW305", "MLAW358R", "MLAW358T", "MLAW358Z", "MLAW404", "MLAW358A", "MLAW305", "MLAW358T", "MLAW404", "MLAW304", "MLAW305", "MLAW358T", "MLAW404", "MLAW358T", "MLAW358Z", "MLAW404", "MLAW304", "MLAW358T", "MLAW358T", "MLAW358Z", "MLAW404", "MLAW304", "MLAW358T"], "average_rating": 3.0, "type": "professor", "reviews": [{"professor": "Christine White", "course": "CCJS325", "review": "Professor White is not an academic expert on this subject, but has professional experience with it. She is prepared to teach and manages to keep most students engaged, even though each class is two and a half hours long. It is absolutely necessary to do the assigned readings!", "rating": 3, "expected_grade": "A", "created": "2018-01-02T00:03:36Z"}, {"professor": "Christine White", "course": "MLAW358T", "review": "Boring lecture but the professor was pretty nice. To be fair, I think she had some personal stuff going on that affected the quality of the course.", "rating": 3, "expected_grade": "A", "created": "2023-02-18T06:05:58.395843Z"}, {"professor": "Christine White", "course": "MLAW358T", "review": "very very interesting class. no exams or final. barely any assignments. you just genuinely learn about human trafficking and its super interesting. professor white is super nice and very accommodating. loved her she's great. this is a super super easy great class.", "rating": 5, "expected_grade": "A", "created": "2023-03-28T17:14:37.006965Z"}, {"professor": "Christine White", "course": "MLAW304", "review": "I hate to have to give a low rating because she is super nice and I think pretty interesting. However the semester ends in a week and not one non-participation thing has been graded. Impossible to know where you stand if your on the right track or anything. Would avoid the headache if you can.", "rating": 2, "expected_grade": "B", "created": "2023-12-04T02:03:20.985955Z"}, {"professor": "Christine White", "course": null, "review": "Professor White is honestly such a sweet person. She wants to engage her students and teach, and also get to know you! While her grading can sometimes be slow, and it is hard to see where you stand, she is nice and accommodating to any situation you may be in, and gives extensions if needed. She even said she's willing to talk to us about grades and re-doing things since she has been taking so long to grade, since she is the only grader for multiple pretty large classes. There are no exams in her class, and the only assignments are really just short papers throughout the course.", "rating": 4, "expected_grade": "A", "created": "2023-12-16T07:26:20.523427Z"}, {"professor": "Christine White", "course": "MLAW304", "review": "I want to be clear - Professor White is incredibly sweet, super nice, and very knowledgeable about law and society. However, the class seems to be very disorganized. By early December, only 3 out of 17 assignments had been graded, so you never knew how you were doing in the class. Discussion posts were disorganized when they were posted, and some were difficult for students to find on Canvas, making it challenging to complete them without missing any. Now, don't get me wrong; this class seems pretty simple and easy. However, as I am writing this in late December after finals are over, with 8 assignments worth 80% of my grade yet to be graded, I have no idea how I am truly doing. This is frustrating and disappointing and puts a damper on what was really an interesting class. While I recommend her as a professor, this class can truly be a headache, as another reviewer said, and something that should be known.", "rating": 2, "expected_grade": "", "created": "2023-12-21T01:12:31.094983Z"}, {"professor": "Christine White", "course": null, "review": "The professor is nice and knowledgeable. Her class is very disorganized, nothing is listed in the syllabus nor expectations for assignments. When you ask her for a rubric she says “no”. Not to mention the TA (who is an undergrad) grades super harsh like she’s a graduate student and not accommodating when you ask for an extension. The TA is also crude and thinks she’s superior to you. The class is super interesting but the assignments and lack of organization makes me regret taking the class.", "rating": 2, "expected_grade": "", "created": "2024-03-06T03:36:17.838417Z"}], "name": "Christine White", "slug": "white_christine"}