{"courses": ["SOCY100", "SOCY100", "SOCY227", "SOCY100", "SOCY227", "SOCY100", "SOCY227", "SOCY100", "SOCY105", "SOCY227"], "average_rating": 3.3333, "type": "professor", "reviews": [{"professor": "Christopher Malackany", "course": "SOCY100", "review": "Professor Malackany cares a lot about sociology. I took this class online and felt it was very easy. The class assignments are very easy, most of them involved watching a video and answering two questions. One question would be specific and the other would simply be what did you like most. The tests were very straight forward with a mix of multiple choice and true/false. On test days you are given the entire day to start the test so you can pick a time that works best for you to take it. There were also quizzes that were easy. You have 3 days to take a quiz so there is a lot of flexibility, but once you start a quiz you only have 5 minutes to take it. All lecture slides are posted before the lecture. You can miss this class without an issue about making up work or missing information.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T03:07:04.497174Z"}, {"professor": "Christopher Malackany", "course": "SOCY100", "review": "Malackany definitely tried to explain the content on his slides thoroughly. However, it became tedious listening through zoom for his online class. His quizzes were the most tricky component of his class. The limited time and true/false questions that did not pertain to his slides were definitely challenging. Most terms and definitions were in the textbook but they didn't help much for the test questions. Surprisingly quizlet material helped more. Was a so-so class, had an abundance of information and did not retain much. I would recommend choosing another course for the gen-ed or elective.", "rating": 3, "expected_grade": "A", "created": "2023-01-02T23:31:43.515755Z"}, {"professor": "Christopher Malackany", "course": null, "review": "such a boring lecturer", "rating": 3, "expected_grade": "A", "created": "2023-04-19T14:27:13.451160Z"}, {"professor": "Christopher Malackany", "course": "SOCY100", "review": "For an intro level sociology class, this class sucked. His lecturing was quite boring and he would talk in a monotone voice. Almost impossible to pay attention and stay focused in that class. His lecture material doesn't always coincide with the textbook. There are almost weekly textbook reading quizzes that are short but good grade boosters. Overall, this class was really really boring and I would never take it again.", "rating": 1, "expected_grade": "A-", "created": "2023-05-03T19:08:03.851255Z"}, {"professor": "Christopher Malackany", "course": "SOCY100", "review": "The class itself is pretty easy - we are given a good amount of assignments to help boost our grades. But this class was actually so boring and there was no motivation for me to ever go. He does a good job explaining the concepts but is not engaging at all. Overall an easy gen-ed but if you are looking for an interesting sociology class this is not it", "rating": 2, "expected_grade": "A", "created": "2023-05-21T01:48:16.934710Z"}, {"professor": "Christopher Malackany", "course": "SOCY100", "review": "Dr. Malackany was super kind and understanding and you can tell he cares a lot about sociology. The course structure is super traditional, and the exams were multiple choice and super easy. However, his lectures could be kind of boring at times. Overall this class was an easy A with a light course load, and I'd recommend it for a gened credit.", "rating": 4, "expected_grade": "A", "created": "2023-08-23T11:39:25.566442Z"}, {"professor": "Christopher Malackany", "course": "SOCY227", "review": "This class was actually really enjoyable. There's a lot of reading, but it's somewhat interesting. Lectures are not mandatory (except for a few days he dictates on the syllabus) and you can still get an A if you skip a few lectures. Most of the assignments and exams are pretty easy. Overall, I liked this class and feel like I learned a lot of interesting stuff.", "rating": 5, "expected_grade": "A", "created": "2023-09-18T15:45:26.407789Z"}, {"professor": "Christopher Malackany", "course": "SOCY100", "review": "Dr. Malackany is your standard 100-level social science professor.  Class was highly organized with fully online exams, weekly reading quizzes, short writing assignments (based on external readings or documentaries), and short participation assignments.  All of the media and real-world examples were pretty outdated but still applied to the concepts.  Lecture was always recorded and slides were always uploaded prior to class.  His lecture style is pretty boring especially since the connections weren’t current and he didn’t get through a lot of slides in class.  \r\n\r\nBe prepared for an odd textbook. The textbook had a section where the author blamed public school teachers/administration for why American students' performances are suffering and not the fact that schools rely on test scores for funding.  The textbook also had a section complaining about how school shootings aren’t that big of a problem and cited data that was cut off in 2014 (right before shooting rates spiked).  \r\n\r\nOverall the class was easy and a great way to get your gen ed, I was just confused as to how an interesting subject like sociology was made so lackluster/boring.  If you’re actually interested in sociology I’d take a different professor.", "rating": 3, "expected_grade": "A-", "created": "2023-12-07T15:12:01.231176Z"}, {"professor": "Christopher Malackany", "course": "SOCY100", "review": "I liked this class a lot, Professor Malackany is very kind and passionate about what he teaches. I found his lectures to be interesting. The course load was very manageable, and you can miss most lectures without penalty (although sometimes there are 5-point participation assignments.) Each class he goes through slides that are already posted on Canvas, which only covers some of the content you will be tested on. I didn't realize how important reading each chapter of the textbook was until the first exam, so I would say read/skim each unit as you go through the content in class. \r\n\r\nEach unit also comes with an online 5-minute 5-question quiz that you have 3 days to complete. All of the exams are 50 MCQ online, including the final exam which is not cumulative. In addition to this, there are multiple writing assignments based on either critical thinking or documentaries assigned to watch outside of class. The TA grades them on content, not completion.\r\n\r\nFive or six lectures were switched to Zoom, which made it a little harder for me to focus on the content, but I really enjoyed the in-person lectures and did well in the class. I would recommend Malackany's class to anyone who needs a gen-ed or is interested in Sociology.", "rating": 4, "expected_grade": "A-", "created": "2023-12-23T00:43:58.953333Z"}], "name": "Christopher Malackany", "slug": "malackany_christopher"}