{"courses": ["BMGT450", "BUDT758A", "BUMK758G", "BUMK762", "COMM107", "BUMK758H", "BUMK764", "BUSO705", "COMM107B", "BMGT198C", "BMGT198D", "BUMK762", "COMM107B", "BMGT450", "BUMK764", "BUSO705", "BMGT198E", "BMGT198C", "BUSO705", "BMGT198D", "BMGT162", "COMM107B", "BMGT264", "BMGT450", "COMM107B", "BMGT162", "BUMK758G", "COMM107B"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Christine Schaaf", "course": "COMM107B", "review": "The nicest woman ever. I just had my last class today and I was sad! She is very accommodating to the needs of students and cares a lot about her class. As a person, she has tons to offer. Take her advice in and outside of class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T01:58:13.686525Z"}, {"professor": "Christine Schaaf", "course": "BMGT198D", "review": "Professor Schaaf is an amazing and kind woman - someone who I was very lucky to meet and have as a professor. She keeps things simple and understandable when talking to others, and wants to get to know all of her students individually. She's always willing to meet one-on-one with students - she helped give me career advice and give her insight on some thoughts of mine. She wants her students to succeed, but more importantly cares about them and treats them with great amounts of respect. A great listener and speaker and has so much to share. She has great stories and experience - ask her and communicate with her, you'll learn a ton!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T21:47:42.583549Z"}, {"professor": "Christine Schaaf", "course": "COMM107B", "review": "Professor Schaaf is incredible. She is so kind and caring as a person, and as a teacher. She not only is a wonderful person but she is so knowledgeable on all things business and marketing, and is someone to look up to. If you have the opportunity to take her course and get to know her, take it!", "rating": 5, "expected_grade": "", "created": "2023-12-07T19:27:12.906152Z"}], "name": "Christine Schaaf", "slug": "schaaf"}