{"courses": ["HIST254", "HIST328M", "HIST408O", "HIST200", "HIST619G", "HIST429I", "AASP298C", "HIST608A", "HIST319I", "HIST408G", "AMST328Y", "AASP298C", "HIST254", "HNUH218B", "HIST819G", "HNUH218B", "AASP298C", "HIST254", "HNUH218B", "HNUH218B", "AASP298C", "HIST254", "HIST619G"], "average_rating": 4.1818, "type": "professor", "reviews": [{"professor": "Christopher Bonner", "course": "AMST328Y", "review": "Very engaging professor who makes you want to learn the material. Relatively easy grader and gets to know students personally.", "rating": 5, "expected_grade": "A-", "created": "2019-04-25T17:00:53Z"}, {"professor": "Christopher Bonner", "course": "AMST328Y", "review": "Honestly, one of the nicest professors on campus. Clearly defines the structure for the class and tells you how to prepare for exams.  Papers are very easy and he gives good feedback. Taking him again for another class. I got a B+ because I didn't participate that much, but that is the only difference between an A and a B. ", "rating": 5, "expected_grade": "B+", "created": "2019-11-05T23:59:44Z"}, {"professor": "Christopher Bonner", "course": "HIST200", "review": "I was surprised to not see more reviews for Professor Bonner, he is an amazing lecturer, and is extremely approachable on any matter, his class is interesting and he records his lectures so you can go back and watch! I highly recommend this class!", "rating": 5, "expected_grade": "A+", "created": "2021-12-06T21:37:47Z"}, {"professor": "Christopher Bonner", "course": "HNUH218B", "review": "Bonner's lectures are incredibly efficient, yet very detailed. Rarely was I bored in his class. Outside of the weekly readings, the writing assignments are minimal and easy to get a good grade on as long as you put effort and aren't doing it last minute. Class organization was easy to follow. If you're in UH, I would definitely recommend taking this class with Bonner.", "rating": 5, "expected_grade": "A", "created": "2023-05-03T14:15:53.796272Z"}, {"professor": "Christopher Bonner", "course": "HNUH218B", "review": "I absolutely LOVED his lectures. I took this class with his Spring '23, and on the syllabus, it says that he does not give A+, which was personally an immediate red flag. The grade is made up of 2 blog posts, 2 essays, and participation; however, he does none of the grading his graduate TA does. His TA was super nice, but he would take points off for small things and would never explain why he took points on that. Also, all of the essays and blog posts had really vague questions with no rubric, so you had absolutely no direction while writing. My biggest issue with the class was that there were no rubrics for the assignments and even after asking they provided no guidance, but overall the way the content was presented was great.", "rating": 4, "expected_grade": "A", "created": "2023-05-14T18:25:39.686046Z"}, {"professor": "Christopher Bonner", "course": "HNUH218B", "review": "Great lecturer. You can tell he really cares. Assignments are very engaging and I learned a lot in his class. Definitely recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-12-04T15:59:40.472347Z"}, {"professor": "Christopher Bonner", "course": "HIST254", "review": "Prof. Bonner is a great guy. He deserves the 5 stars he has. His lectures are interesting and thought-provoking even for me, a stem major who doesn't like history too much. His essay assignments/midterms at least for my class were fair and pretty easy to do well on with an hour or two of studying the night before.", "rating": 5, "expected_grade": "A", "created": "2023-12-06T23:43:22.749477Z"}, {"professor": "Christopher Bonner", "course": "HNUH218B", "review": "absolutely love this class and professor bonner. his lectures are genuinely so interesting and the way he tells these stories is so captivating and it helps me understand the content so easily. im not the best writer so i personally feel like the essay prompts were a bit broad, making it hard for me to be confident in receiving a good grade on them, but that could just be me. i actually enjoyed going to lecture because of how good of a lecturer he is. super understanding and engaging. 10/10 recommend! this might be my favorite honors class i've taken.", "rating": 5, "expected_grade": "A", "created": "2023-12-08T03:43:41.937854Z"}, {"professor": "Christopher Bonner", "course": "AASP298C", "review": "He is a very harsh grader and barely explains. His class is useless and his slides don’t even cover enough information. Do not take him!", "rating": 1, "expected_grade": "B", "created": "2023-12-17T21:25:27.461650Z"}, {"professor": "Christopher Bonner", "course": "HIST254", "review": "He's a good teacher and a really nice guy, but his grading system is a little weird so beware", "rating": 4, "expected_grade": "A-", "created": "2023-12-22T05:08:14.088516Z"}, {"professor": "Christopher Bonner", "course": "AASP298C", "review": "He's a nice guy and the class itself is not very hard. However, he is an extremely harsh grader (not a single person in the class got a 100 on any assignment) and there are not very many grades. If you are looking for a free A DO NOT TAKE THIS CLASS", "rating": 2, "expected_grade": "B", "created": "2024-02-21T09:04:52.766699Z"}], "name": "Christopher Bonner", "slug": "bonner"}