{"courses": ["MATH140", "ENPM809B", "ENPM663", "MATH140", "ENPM663", "ENPM663", "MATH140", "ENPM663", "MATH140"], "average_rating": 4.8571, "type": "professor", "reviews": [{"professor": "Craig Schlenoff", "course": "MATH140", "review": "BEST MATH TEACHER I HAD EVER HAD!!\r\n\r\nI did take BC Calculus my senior year but after hearing from other students with different math profs, I got really lucky with Schlenoff. He really cares about his students and tries to make class fun (also tries to tell a math joke at the beginning of his class).\r\n\r\nLectures and notes are amazing. He writes out each step of problems and also goes over it again if you are still confused. Every problem he does is what you'll expect on the exams, quizzes, and final. TAKE NOTES IN CLASS.\r\n\r\nHis weekly homework quizzes are two problems and are easy if you DO THE PRACTICE PROBLEMS that he assigns optionally. The quiz is just two of those practice problems with different numbers so they should be an easy 10 points. He is also a very lenient grader.\r\n\r\nHis syllabus is really clear. He drops two of your lowest quiz grades and 3 WebAssign. The lowest of your 4 midterms will be worth half the points.\r\n\r\nHe responds really quick to emails and is always enthusiastic/approachable to ask questions.\r\n\r\nIf you can take MATH140 with Schlenoff, DO IT!!!!!", "rating": 5, "expected_grade": "A-", "created": "2018-12-19T22:31:57Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Taking Calculus 1 with Schlenoff was the best decision I made this semester.  Hands down.  He's super chill, his lectures are clear, and his tests and quizzes don't have surprises.  If you listen and take notes in class and do the recommended homework problems, you should do perfectly fine.\r\nAlso, he drops the lowest quiz, 3 lowest WebAssigns, and makes your lowest test grade worth half the points.\r\nDefinitely worth it.", "rating": 5, "expected_grade": "A", "created": "2019-12-05T15:34:17Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "If you're in FC and are taking math140, TAKE SCHLENOFF. NOW. He is extremely clear, fair, understanding, and the workload is very manageable. I wouldn't say it's an easy A but it is very easy to figure out what specific work you need to do for the A. The weekly quizzes are almost always based on the textbook practice problems from the syllabus so it's easy to do well on the quizzes. He doesn't have office hours but he is extremely responsive to email. He is chill and relatable and approachable and really is on the students' side. It's a shame his schedule only allows him to teach FC. Anyway, take Schlenoff.", "rating": 5, "expected_grade": "A", "created": "2020-01-29T02:02:03Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "This dude is a G. Huge interest in how we do in his class, but he also does a fantastic job of teaching the content. The TA got annoying, but he had little to do with that.", "rating": 5, "expected_grade": "B+", "created": "2021-01-27T04:14:09Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "The other reviews do not lie, if you're reading this and have the chance to take Schlenoff, do yourself a favor and sign up for his section. Extremely nice and approachable if you have questions, tells you exactly what you need to know for every quiz and exam, very effective lecturer, there's honestly not a single bad thing to say about him. He has been my favorite math teacher of my entire schooling experience, and I honestly didn't even interact with him as much as I probably should've. Participate in his class, pay attention, do the extra problems that he gives you to prepare for quizzes and exams and you'll be more than set with Dr. Schlenoff. On top of this, if you have never taken calculus before, don't worry about that either. I hadn't before this class and Dr. Schlenoff went at a pace that was perfect for the few in the class that hadn't whilst also not boring to death the ones that had taken it before. TA was also very knowledgeable, funny, and approachable if you had any issues with grading. Again, take this class with Dr. Schlenoff if you can.", "rating": 5, "expected_grade": "B+", "created": "2021-12-10T05:09:12Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Amazing teacher, if there are available spots for this class, definitely take it. He's really good at teaching and teaches thru examples, unlike other teachers. Posts the lecture recordings if you email him and is very understanding. I've never taken calculus and he did a really great job explaining. He is very engaging and his main goal is to help us do better. Couldn't have asked for a better math class this semester, no complaints.", "rating": 5, "expected_grade": "", "created": "2021-12-13T02:22:07Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "He is an amazing teacher, definitely one of the best math teachers I've ever had. He is one of those teachers that is 100% on the student's side, so if you need to take calc then take his section. ", "rating": 5, "expected_grade": "", "created": "2021-12-13T23:34:09Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "If you have the option to take calc 1 with Schlenoff DO IT!!!! He really cares about his students and enjoys teaching which really helps. I took AP Calc AB in high school but I did not understand it well. Schlenoff explained everything amazingly and was always helpful with questions. He teaches by mainly doing practice problems which is how I learn best so that was a plus. He gives weekly quizzes but they are very easy and the exams are not too bad.", "rating": 5, "expected_grade": "", "created": "2021-12-15T02:42:53Z"}, {"professor": "Craig Schlenoff", "course": null, "review": "Dr.Schlenoff swears he is the nicest guy on the planet but will fail you without thinking about it twice, he moves at about 1000 mph and barely notices when students have questions and when they do the answer is at 2000 mph and you will not understand it. Definition heavy and super heavy work load.", "rating": 2, "expected_grade": "", "created": "2021-12-17T18:21:05Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Coming into 140 with no prior calc experience, I was absolutely terrified. I expected to immediately withdraw and hate the course for the rest of my life. Schlenoff changed that. He not only is an incredibly smart and talented lecturer, but a caring person who deeply wants his students to understand and excel at calculus. His exams are hard, the quizzes suck, and the homeworks are annoying... but by god you will learn calculus well and he will be rooting for you all along the way. I feel incredibly prepared for MATH141 after taking this course, and coming from someone who thought they would have to take 115 after dropping 140, Schlenoff is an amazing professor. If you can, take him. There is a reason why he has a 5 star review here, and the moment you start the class, you understand. ", "rating": 5, "expected_grade": "", "created": "2021-12-18T00:57:54Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "I hate math, but Schlenoff saved my butt with his grading policy. He halves one of your exams, drops one quiz, and erases 3 of your homework assignments. One time, the whole class bombed one exam and allowed us to correct our mistakes for half of our points back. If you know nothing, you gotta do your own studying (to the person who rated him 2 stars). If you DO know Calc, you'll be fine. Glad I had him as my professor because I would have failed with another professor. If you are in Freshman Connection and have him, don't switch out unless you know you suck at math. It's calc, did you expect it to be easy?", "rating": 5, "expected_grade": "", "created": "2022-01-05T03:46:15Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "The course is difficult, and Schlenoff doesn't provide any curves. On the other hand, he allows for grading exceptions such as dropping the lowest quiz grade or halving the lowest midterm exam grade. He may be fast paced but does his best to listen to the students. As long as you stay up to date and follow his recommended course of study you can get a good grade. If you find yourself struggling, make sure to reach out to him, Schlenoff does his best to help you whenever possible. For three weeks straight I requested for a one on one session that helped me review what we went over in class, and it helped tremendously. He has a good personality and has never shown a hint of a negative attitude throughout the entire semester. Even though I found the course difficult, it easily become one of my favorites just because of him.", "rating": 5, "expected_grade": "", "created": "2022-01-11T22:37:04Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "He is a good teacher and he knows it. He put some of his lectures online and by the end of the semester, there were less than 10 people showing up for the discussions. He drops some assignments and wants everyone to do well. ", "rating": 5, "expected_grade": "B+", "created": "2022-01-14T20:51:31Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "prof schelnoff is absolutely amazing, and his TA is incredibly friendly. it can be hard to understand the content of things at first if you've never taken calc or took it forever ago and forgot about it- he goes over a lot of practice problems which helped me a lot, he also does review sessions before exams- just pay attention in class and take notes, you'll be good. I've never taken calc before but I still managed to get an a- ", "rating": 5, "expected_grade": "A-", "created": "2022-01-18T00:36:07Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "A really good choice for FC students. Calc is hard in general but he makes it not too bad.", "rating": 4, "expected_grade": "C", "created": "2022-02-02T03:02:35Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Calc is a very difficult course but this professor knows what he is doing. He grades very fairly and is very understanding when it comes to course work", "rating": 5, "expected_grade": "C", "created": "2022-12-06T20:49:53.056569Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Really helpful instructor. Do the problems he puts on the syllabus and you'll pass every quiz. He also drops 3 quizzes, a few homeworks, and half of your lowest midterm. Take this professor if you want to learn and finish with a good grade.", "rating": 5, "expected_grade": "", "created": "2022-12-11T04:14:09.473973Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Prof Schlenoff is an excellent professor. By far the best 140 professor from what I have heard. His lectures are super affective at teaching the material and I never felt lost. The exams, while challenging, are completely fair game with absolutely no surprises on the content. This course is challenging but completely managable with prof schlenoff. If you are an FC student I 100% recommend taking 140 with him.", "rating": 5, "expected_grade": "B", "created": "2022-12-14T01:57:18.590062Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Amazing Professor. Super personable, answers all your questions without being condescending, and just wants you to succeed. Definitely take him if you get the chance!", "rating": 5, "expected_grade": "A-", "created": "2023-01-25T21:44:33.525848Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "One of the best math instructors I have ever had. If you are not that confident in your math skills, Prof. Schlenoff will help you in every way that he can. I was in danger of failing this course but he and his TA sat through hours of office hours with me and provided me the support I need to pass. Truly a great teacher. Very fair grading policies and some opportunities for extra credit as well. Also, do the problems in the back of the book as they are almost identical to his test and quiz questions.", "rating": 5, "expected_grade": "", "created": "2023-05-09T21:18:37.412221Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Although I am expecting to receive a C- in the class (I hope), Dr. Schlenoff is a great professor. I recommend you sign up for his section if you can as he is extremely helpful and does all he can to provide support to his students, which is hard to find in some other professors.", "rating": 5, "expected_grade": "C-", "created": "2023-11-17T14:49:14.598795Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "TAKE THIS PROFESSOR. Dr. Schlenoff was an amazing professor. His lectures were very important and meaningful for providing the base you need to understand the topic, and the homework gradually enhanced your ability to master that topic. He speaks very clearly, answers questions perfectly, and occasionally offers extra help 30 minutes before and after class. He also put multiple practice questions from the textbook for each section (not just chapters but each section like 3.1, 3.2, etc). If you do these problems every week, you will undoubtedly get A's on all of your quizzes. Sometimes to persuade you to utilize the practice problems, he will put a problem on the quiz that is the same concept and uses similar methods as the practice problems. He also provides you with practice exams for your exams. Overall, you have all of the resources needed to get at least a B in this class. Don't slack, take the time to do your homework, and don't wait until the last minute to do so, use the resources he provides, and you will do great.", "rating": 5, "expected_grade": "A", "created": "2023-12-06T23:45:28.839757Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "best calc professor, explains everything in detail and always answers questions, quizzes and tests are very reasonable to what we do in class, always understanding about issues on your end, 10/10 recommend", "rating": 5, "expected_grade": "A-", "created": "2023-12-08T20:01:30.081892Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Dr. Schlenoff is an extremely nice and helpful professor. He wants his students to succeed and always provides resources and encourages questions during class", "rating": 5, "expected_grade": "B", "created": "2023-12-11T21:38:47.049179Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Professor Schlenoff is the guy. He's funny at times but efficient, focused, and not at all rude in any way compared to other professors. If you need math140, he will get to the point regarding the work and efficiently prepare you for the final exam. With emails he's very responsive, and if you have a question, he will explain it in a way to help you understand in solving the problem. Don't get it confused, all Calc classes are hard might as well take it with someone who can teach well. You do need to make an effort, take notes on the problems done within class, review and try on your own. If you label each step he does, it makes absorbing the info easier. He does have quizzes once a week which can seem intimidating but they truly help you prepare for the midterms and final. He has an excellent ability to actually teach and help you learn. I'd taken calc before in HS and never understood the processes until this class. I'm glad I had him as first semester FC student.", "rating": 5, "expected_grade": "C", "created": "2023-12-17T03:52:54.615460Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Professor Schlenoff is a fantastic guy and was one of my favorite professors this semester. Make it a point to get to know him and form a connection. He has relatively large lectures so it can become easy to skip classes and lose out on participation points. Just be engaged in lectures, go to discussions, and go to office hours if struggling. I promise you it will be worth your while and you will pass the class if you engage.", "rating": 5, "expected_grade": "B", "created": "2023-12-20T15:39:33.265884Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Fantastic professor! If you participate, go to office hours (if necessary), and go to discussion you will pass the class. Professor Schlenoff was one of my favorite professors this semester. It is worth forming a connection with him. Would highly recommend.", "rating": 5, "expected_grade": "B", "created": "2023-12-20T15:58:25.366996Z"}, {"professor": "Craig Schlenoff", "course": "MATH140", "review": "Dr. Schlenoff is great.  It is easy to tell that he actually cares about his students and wants them to do well.  His class is extremely well organized and he lays out exactly what you'll be doing each day.  His lectures are easy to follow because he knows which topics are difficult and paces the lecture accordingly.  The exams are pretty fair and you will do well if you go to the lectures and prepare yourself.", "rating": 5, "expected_grade": "A-", "created": "2024-02-06T04:14:57.336960Z"}], "name": "Craig Schlenoff", "slug": "schlenoff"}