{"courses": ["CMSC828N", "CMSC624", "CMSC624", "CMSC424", "CMSC624", "CMSC424"], "average_rating": 4.6667, "type": "professor", "reviews": [{"professor": "Daniel Abadi", "course": "CMSC424", "review": "Really nice and lenient grader. Exams aren't too hard", "rating": 5, "expected_grade": "A-", "created": "2018-05-02T20:42:33Z"}, {"professor": "Daniel Abadi", "course": "CMSC424", "review": "Good Professor, kinda boring to listen to during lectures but the material is interesting. Willing to listen to students about concerns with the class and will actually do something to address these issues. Exams are pretty hard though, but he curves them enough.", "rating": 4, "expected_grade": "A", "created": "2018-05-14T17:06:10Z"}, {"professor": "Daniel Abadi", "course": "CMSC424", "review": "Pros:\r\nNice guy\r\nLenient grader\r\nListens to student's concerns\r\nEasy and fun material in the beginning \r\n\r\nCons:\r\nExtremely boring lecturer\r\nThe class material is extremely boring for the most part\r\nTowards the end of the semester the material becomes very difficult", "rating": 3, "expected_grade": "", "created": "2019-07-08T15:26:53Z"}, {"professor": "Daniel Abadi", "course": "CMSC624", "review": "Abadi is a genius about databases. The material was difficult and he asked questions to challenge us. The midterm was very hard but he provided a generous curve. Try to participate in class (ask questions, answer his challenge questions, demonstrate you read the papers, etc.) and you will do well.", "rating": 5, "expected_grade": "A", "created": "2022-01-25T16:14:20Z"}, {"professor": "Daniel Abadi", "course": "CMSC624", "review": "Abadi is the best lecturer I have had at UMD, he is extremely passionate about the material and very good at explaining topics. He goes at a very fast pace but I was always able to follow along and learned more from this class than any other. Course material and exam was very difficult but if you care more about learning than grades you will really enjoy his class.", "rating": 5, "expected_grade": "B+", "created": "2022-02-15T22:32:45Z"}, {"professor": "Daniel Abadi", "course": "CMSC624", "review": "Abadi is the best professor I ever had and he's also the smartest person I ever seen. The lectures are very engaging and he asks a lot of non-trivial questions. Projects and homeworks are not easy, but they are well organized and you can learn a lot from them. You can tell he cares about students and the material he taught.", "rating": 5, "expected_grade": "A+", "created": "2022-04-07T03:36:06Z"}, {"professor": "Daniel Abadi", "course": "CMSC424", "review": "Enjoyed this class with Dr Abadi. You will learn a fair amount about SQL and using DBMS properly, but even more about the in depth technical details of designing databases. The first half of the class is straightforward and fun, learning about writing SQL queries and E/R models. Midterm was pretty easy if you paid attention. The material gets very very difficult towards the end of the semester. Reading quizzes get hard as the semester goes on. The projects become very time consuming and somewhat confusing as well. As always, if you start early, they are doable. Final was egregiously hard, but Dr Abadi informed us that there was a mistake made regarding the difficulty level. A quite substantial curve was provided on the final exam. Overall, would recommend, but be ready for a moderately heavy workload at times.", "rating": 5, "expected_grade": "B", "created": "2023-05-20T03:22:21.350692Z"}, {"professor": "Daniel Abadi", "course": "CMSC424", "review": "Incredibly knowledgeable about databases. Great lecturer, projects and weekly quizzes are difficult but you get all the help needed. Definitely recommend!", "rating": 5, "expected_grade": "B-", "created": "2023-05-29T18:37:05.968181Z"}, {"professor": "Daniel Abadi", "course": "CMSC424", "review": "1. Did you find the exams and major assignments fair? \r\n· The reading quizzes are connected to the readings, but some questions can be tricky and require close attention. \r\n· Clicker questions are free as long as someone provides a reasonable justification during class. \r\n· The midterm exam was fair. The final exam was challenging but had a significant curve (20%). \r\n· The projects were manageable, taking about 10 hours each. The last two projects are based on Berkeley's database class and require understanding the existing codebase before applying class concepts.\r\n· The breakdown was projects (32%), midterm (20%), final (32%), clickers (8%), and reading quizzes (8%). \r\n—\r\n2. Did you feel the professor had reasonable expectations for the students in the course overall? \r\n· Yes. There were reading quizzes almost every week. Clicker questions were challenging but thought-provoking. Exams were reasonable. Participating during class and answering non-trivial questions was expected. Fair application of what we cover in the textbook and class.\r\n—\r\n3. Did you like the professor's teaching style?\r\n· I enjoyed the professor's teaching style as he provided clear guidance on how to prepare for and succeed in the course.\r\n· He offered ample practice problems, gave advice on studying for exams, and emphasized hands-on practice. The midterm heavily focused on the projects. \r\n· What I particularly enjoyed was the professor's dedication to creating a positive classroom culture. He made an effort to personalize interactions by remembering and using our names. He encouraged questions and fostered discussions. It was evident that he cared deeply about the subject matter and his students. His enthusiasm was reflected in his attire as well, as he wore a suit to every class. Very caring.\r\n—\r\n4. Was the workload appropriate for the number of credits? \r\n· The workload was appropriate but slightly heavy, considering 17 reading quizzes (approximately 1.5 hours each), 4 projects (each taking 10 hours), and 2 exams (requiring 10 hours of study each). \r\n—\r\n5. Was this course valuable or a waste of time? \r\n· This course is highly valuable, especially for those interested in software engineering and data science/machine learning. Interacting with databases is a crucial skill in various careers.  He emphasized making 424 practical rather than overly theoretical. \r\n· The first half of course covers advanced SQL, ER diagrams, schemas, normalization, and database building components. The second half focuses on theoretical aspects, considering memory constraints and algorithm costs. Cost considerations of queries was one of my favorite topics. B-trees are a significant topic as well. \r\n· Projects 3 and 4 provide excellent practice working with large existing codebases. \r\n· The TA's (Pooja, Cuong) contribute to the positive learning experience.\r\n—\r\n6. How much support did you receive throughout the semester (office hours, extra resources, etc.)?\r\n· Four hours of TA office hours were available each week, and the TAs were responsive to Piazza and willing to provide assistance with code privately.\r\n· The professor had office hours by appointment (after class) and was always willing to explain clicker and reading quiz questions. \r\n· He offered a bonus project to raise project grades and had a generous project late penalty.\r\n· Three reading quizzes and three clickers were dropped. \r\n· While the professor sometimes spoke quickly and didn't record classes, the classroom culture, energy, and support were excellent. Attendance was required. \r\n—\r\n7. TLDR Weekly reading quizzes, clicker questions, mandatory attendance, relevant concepts, fair projects and exams, exceptionally caring and intelligent professor who encourages participation during class. Decent workload, but this is my favorite CS class at UMD. I highly recommend it with Abadi.", "rating": 5, "expected_grade": "A+", "created": "2023-08-26T00:20:10.588760Z"}], "name": "Daniel Abadi", "slug": "abadi_daniel"}