{"courses": ["PHIL362", "PHIL140", "PHIL438D", "PHIL318B", "PHIL418E", "PHIL204", "PHIL100", "PHIL203", "PHIL308T", "PHPE308B", "PHIL309K", "PHPE308E", "PHIL203", "PHIL203", "PHIL309K", "PHPE308B", "PHPE308E", "PHIL203", "PHIL318B", "PHPE308B", "PHIL203", "PHIL309K", "PHPE308B", "PHIL203", "PHIL318B", "PHPE308B", "PHIL203", "PHIL309K", "PHPE308B"], "average_rating": 3.5833, "type": "professor", "reviews": [{"professor": "Daniel Blair", "course": "PHIL140", "review": "Dan Blair is the boy, if you get the chance to take him you have to, he makes class very enjoyable and his assignments are fairly easy", "rating": 5, "expected_grade": "A", "created": "2019-05-06T00:34:04Z"}, {"professor": "Daniel Blair", "course": "PHIL100", "review": "He sets very clear expectations for what will be on the quiz (if you know what i mean lol). His lectures are boring, 90% of people dont pay attention in class, but whenever he goes off task, he is social and funny. If you just show up to the lectures, expect a B-. All of the tests are essays so you should go to office hours if you want to learn what he is looking for.  Also, he seems a little crazy, just like every philosophy professor. He opened his first lecture about how he grades finals (just enough Scotch to not get drunk, enough Excedrin to get acetaminophen jitters). He pauses in between sentences to compose his thoughts, but literally every single sentence he says is something very detailed, almost like straight off a dissertation.\r\n\r\nALSO: he repeats this in class a lot (easily 5 times): \"When I made the test, it seemed like I taught you all nothing, but then I looked back at my notes and I realized I taught you too much.\"\r\n\r\noverall, meh class, meh lectures, cool professor, easy grading.", "rating": 5, "expected_grade": "B", "created": "2019-11-24T03:44:52Z"}, {"professor": "Daniel Blair", "course": "PHIL100", "review": "i have no idea why more people haven't reviewed him. good professor, boring lectures, easy exams, easy quiz every week. most people @ lecure watch football and take notes on the side", "rating": 5, "expected_grade": "B-", "created": "2019-12-05T15:32:52Z"}, {"professor": "Daniel Blair", "course": "PHIL140", "review": "Dan Blair will be your favorite. Show up, take notes, study come the exams, you'll get an easy A. Half the time he either gives you exam questions or spells out what you need to know in review sheets. He's also funny and willing to joke about himself. Anyone who dislikes Dan Blair probably couldn't handle having to put in an ounce of effort.", "rating": 5, "expected_grade": "", "created": "2019-12-11T05:40:53Z"}, {"professor": "Daniel Blair", "course": "PHIL140", "review": "I think his way of teaching is the definition of \"fair\" (go figure for an ethics professor lol). What everyone else says on here about his course is true. His lectures are boring and it can be sometimes difficult what is happening in the big picture but overall he is a good professor.  He comes off as a great guy so it's easy to approach him and he is willing to look over tests for a second time. My experience was overall positive but it was stressful at times.", "rating": 4, "expected_grade": "A", "created": "2020-01-29T02:09:15Z"}, {"professor": "Daniel Blair", "course": "PHIL309K", "review": "An understanding and interesting professor. Has clear expectations for assignments and grades fairly. I really enjoyed the multiple classes I have taken with Dan. I thought his lectures were more interesting than most other philosophy professors I have taken. And he can be hilarious. ", "rating": 5, "expected_grade": "A-", "created": "2021-12-16T23:24:35Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Blair is an easy-going and understanding teacher. He answers questions, likes to engage with the students, and is responsive to emails. PHIL 203 is an easy course so long as you attend the discussions. Discussions are where you learn the content more specifically that helps prepare for the midterms. Each discussion had a 2 point quiz which was easy if you pay attention in the discussions. Blair requires you to have the textbook, but 95% of the time, you can not read the required sections and be okay for exams if you attend lectures and discussions.", "rating": 5, "expected_grade": "A-", "created": "2021-12-27T18:17:32Z"}, {"professor": "Daniel Blair", "course": "PHPE308B", "review": "If you have any other options besides him, I would take them. His course is incredibly unstructured and his lectures are some of the most unengaging and pointless lectures I have attended. The only assignments he provided were quizzes and test. Don't do well on one, and there's your entire grade. ", "rating": 1, "expected_grade": "", "created": "2022-05-10T23:45:34Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Funny, engaging, uber-knowledgeable - can't be bored by Professor Blair. He presents relevant topics in an easy to understand style, summarizing key readings and doing something most Professors can't do: making you think, not just answer. Readings are fair in length and comprehensibility, and as long as you read, go to lecture, and study well in advance of the exam, you'll do just fine. Very quiz-heavy grading, but quizzes are short and ace-able, completed in a laid back discussion section environment. Plenty of opportunities to build up your grade throughout the semester, and if you get to know Blair, he's one of the coolest Professors you'll meet at UMD.", "rating": 5, "expected_grade": "A", "created": "2022-05-26T15:48:42Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Dan Blair himself is a good guy but not the best professor. His lectures are all over the class. The slides do no match the readings at all. I passed this class because of the wonderful TA. This is not an easy A type of class.", "rating": 1, "expected_grade": "A", "created": "2022-11-09T19:36:48.394280Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "definitely not an easy A. he is a great guy but all over the place with his lectures. the tests are 5 short essay questions that ask such vague questions. its like a hit or miss whether or not you will do well. The only reason I have an OK grade is because of the TA. But it shouldn't be a hard class. The material I have to say is kind of thought provoking and interesting, he just does not do a goof job at explaining or preparing you for the exam at all", "rating": 2, "expected_grade": "B+", "created": "2022-11-30T18:24:28.825358Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "If you want an i-series/gened that is an easy A, this is NOT the course to take. Two midterms, each worth 20% of your grade, one final worth 30% and 3 point weekly quizzes that overall make up 30% of your grade. If you get one question wrong on the quizzes it impacts your overall grade significantly. The lectures are disorganized and hard to follow, and do not prepare students for the exams well at all. The tests themselves consist of 5 vague questions (which are actually 3 sub-questions each) that you are expected to write 2-3 paragraph answers for, in the course of 50 minutes. Overall, the content of this course is interesting and thought provoking, but I would not recommend taking the class if you're looking for a manageable gened.", "rating": 2, "expected_grade": "B+", "created": "2022-12-16T20:20:20.798906Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "I'm not sure why the other reviews are complaining when he literally tells you the exam questions before hand during the exam review. He's obviously not going to be like \"What is the definition of __?\" part of the point of the class is know what the questions are asking and what ideas he's referring to. Philosophy is not a math class where everything is straightforward. The class itself is not hard if you go to class, but most people just don't. His slides definetly match the readings and his lectures. Take him. He's funny and understanding and his exams are very fair. TAs are incredibly helpful and the weekly quizzes are basically free points. I loved the course and always looked forward to lectures.", "rating": 5, "expected_grade": "A+", "created": "2022-12-20T03:30:54.108230Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "The people are right who say this class is not an easy A, the lecture slides are really disorganized and he takes forever to upload them. However, the content is really interesting and my TA was incredible.", "rating": 3, "expected_grade": "A-", "created": "2022-12-22T03:38:29.118156Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Not an organized professor but if you take the time to study the material and go to discussion you're good. However there are easier classes to take to get an A.", "rating": 3, "expected_grade": "A", "created": "2022-12-24T03:46:36.214260Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "As far as lecturing, he is not very good at being organized. The teaching is sometimes more of a conversation between him and a certain few students and it feels like he rambles all over the place. However, I'll have to disagree with the reviews saying its not an easy A. I didnt attend lecture or any review sessions after around the first month, but I did attend each discussion section since it is basically required for the quizzes. The powerpoints may not be very detailed but they are helpful enough to answer the exam questions, along with the TA's teaching in the discussion section. On top of that, the exams are all taken online on canvas which makes it even easier.\r\n\r\nsome advice: at least show up to each discussion question and try hard for each quiz so that it will serve as a form of review, and also each quiz is worth about 3% of the final grade (there are 10 quizzes about 3 points each), so you dont want to slip on them since an A in this class is a 94% or above.", "rating": 3, "expected_grade": "A", "created": "2022-12-24T03:51:05.519599Z"}, {"professor": "Daniel Blair", "course": "PHIL318B", "review": "Dan Blair is a very good professor. The quiz questions are online and the exams are pretty straight forward. There are no slides for this class, so attendance is mandatory, but I enjoyed the class. Every class, we talk about a new topic or refine one we’ve talked about. As long as you listen, the weekly online quizzes are a piece of cake. Same for the exams, just listen and take light notes.", "rating": 5, "expected_grade": "A", "created": "2023-03-27T03:11:30.995695Z"}, {"professor": "Daniel Blair", "course": null, "review": "The lectures were entirely useless, I stopped going after the first week. If you're genuinely interested in philosophy, they're probably great, but he rambles so much that the TAs in discussion have to cover what he missed. I ended up just going to discussions because my TA was really good and would cover the entire weeks worth of content. That being said, Blair was really nice and really cared about his students and the material. Overall for Phil203 this is a gen ed definitely worth taking, not a lot of work and fairly interesting.", "rating": 4, "expected_grade": "", "created": "2023-04-18T17:45:20.091958Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "I really like Professor Blair and this class.  If you ever have to fulfill a gen ed or have extra space in your schedule, I would definitely recommend this course if you're interested in this sort of thing at all (ie. topics of abortion, war, animal rights, etc.).  Exams aren't too difficult and quizzes are a decent percent of your grade, so make sure to do well on them weekly.", "rating": 5, "expected_grade": "A-", "created": "2023-05-06T15:12:32.401013Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Professor Blair is not a good prof to take if you are not a philosophy major. If you love arguing then this is the class for you but if you're taking this as a gen ed don't do it. Prof Blair spends 50 mins of class speaking the whole time without actually saying anything. He is also not at all accommodating,  I sit writing this review in the ADS testing office bc he forgot to open my final exam on elms. He also leaves his diet soda bottles uncapped sitting in a warm classroom while teaching", "rating": 1, "expected_grade": "A-", "created": "2023-05-17T17:06:50.495142Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Blair is a very sweet guy and teaches a fascinating course. His goal is, regardless of your prior views on a given subject, to make you question those beliefs, and he does a pretty good job. The philosophers and their arguments are very thought-provoking. He spends a lot of time sort of getting side-tracked by some of the more outspoken students, but these tangents are, if not productive, generally entertaining. He very generously posts his slideshows, which were very helpful in preparing for the exams - the best thing you can do to prepare is attend the lecture right before a test because he goes over what kinds of questions will be covered in pretty great detail. One important thing to understand is that, as he puts it, you are not supposed to be editorializing your own ideas on the tests. You are \"manifesting competency of the subject.\" Basically, you are proving you know the arguments from the material (he's not terribly concerned with memorizing who said what, just what the arguments are and how to interpret them).\r\n\r\nAs for the class structure, it's 30% quizzes (10 three-point quizzes in the weekly discussion sections, so you do need to attend these to get the quiz prompts), 20% each for two midterms, and 30% for the final. There is no homework, and no graded work in the lectures, which are not mandatory. Exam grading can depend on who gets it; for me, my TA seemed harsher than Blair. Our averages were 85% for the first midterm and 89% for both the second midterm and final. Blair and the TAs note who participates and give a small boost to this group (basically if Blair knows your name or the TAs remember you participating in discussion you'll get this). Besides that, there is no curve, and an A is a 94%. It's not an easy A, but you can get by without going to many lectures, and it was way more interesting than most other gen-eds I've taken.", "rating": 5, "expected_grade": "A", "created": "2023-05-21T01:38:50.803086Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "Super intriguing class if you read the readings and like to think about complex issues. Professor Blair is also a really nice guy and steers your thought process in the right direction to provoke interesting thoughts. Unfortunately, the rest of his lectures just aren't good when you consider the class objectives. He rambles and beats around the bush in class in a way which makes it extremely hard to understand what the main points hes trying to make about certain arguments are. He never once clearly stated the premises and conclusion of an argument. This made the class extremely hard as basically your entire grade is based off of being able to regurgitate these arguments from different philosophers. Also a very harsh grader considering he doesn't make what you need to know in the class clear. It's like he wants you to play hide in seek in the lecture notes (which he posts in an unorganized manner) to find the right answers to potential exam questions. Also he did not monitor TA grading at all. TA grading was very inconsistent. Overall, interesting class, but at the end of the day the fundamentals of the class are lacking when considering how they allow you reach class objectives of learning/knowledge.", "rating": 1, "expected_grade": "A-", "created": "2023-05-24T03:09:05.121753Z"}, {"professor": "Daniel Blair", "course": "PHIL309K", "review": "Professor Blair is a great guy and a super interesting lecturer. However, his lectures are sort of meandering and unstructured. Oftentimes he talks about stuff that's just completely unrelated to the class. They are entertaining for sure, but honestly you could probably pass all of the exams and quizzes without attending a single lecture (so long as you did the readings and maybe went to office hours occasionally). It helps that he's a very lenient grader. I would still recommend going to the lectures though, Professor Blair has had an interesting life and has a lot of fun stories. Would definitely recommend this class (PHIL309K) since you do theoretically have the option to skip lecture if you're swamped with work in other classes.", "rating": 3, "expected_grade": "A", "created": "2023-12-21T02:36:01.592634Z"}, {"professor": "Daniel Blair", "course": "PHIL203", "review": "The lectures are pretty pointless, and he does tend to ramble on tangents for a while. It makes discerning the main point behind different readings extremely difficult.\r\n\r\nThat being said, the intention of the class is that you do the readings yourself outside of class. This adds a TON of work to the curriculum, but will allow you to get a better feel for course content. Just would have been a lot better of a class if he actually went over the main points in lectures. \r\n\r\nAlso discussion sections were incredibly pointless. Probably was just my TA, but he went over literally nothing even remotely related to what we were learning.", "rating": 3, "expected_grade": "A", "created": "2023-12-22T16:25:38.415225Z"}], "name": "Daniel Blair", "slug": "blair"}