{"courses": ["ENGL391", "ENGL393", "ENGL394", "ENGL297", "ENGL393X", "ENGL398R", "ENGL241", "ENGL398A", "ENGL393", "ENGL398R", "ENGL393", "ENGL398R", "ENGL393", "ENGL398R", "ENGL250", "ENGL393", "ENGL398R", "WGSS255", "ENGL393", "ENGL398R", "ENGL393", "ENGL398R"], "average_rating": 4.2, "type": "professor", "reviews": [{"professor": "Danuta Hinc", "course": "ENGL393X", "review": "guys she is the cutest and nicest professor ever, I took her for professional writing and really all I had to do was submit my work and got a 99%. It was online and class was supposed to happen 2 days a week but she only had it once so it was super easy ", "rating": 5, "expected_grade": "A+", "created": "2022-01-17T03:19:48Z"}, {"professor": "Danuta Hinc", "course": "ENGL398R", "review": "Amazing Professor. She cares so much about her students and helping them improves in their writing. Definitely a class I would take ten times in a row. Very chill with deadlines and just gotta complete the work really. Very free to write about whatever you want which is great too and she will read all that you write. Amazing Class.", "rating": 5, "expected_grade": "A", "created": "2022-12-15T00:42:44.278653Z"}, {"professor": "Danuta Hinc", "course": "ENGL398R", "review": "Class is super easy and Professor Hinc is very nice. If you have a problem with deadlines just talk to her, and you can work something out. \r\n\r\nIt is a gen-ed, so there are a ton of useless assignments that the department requires her to give us. Luckily, you basically just have to complete them. I think there were too many readings, but you could probably get by without reading all of them if you are more strategic than I am.\r\n\r\nI didn't find her essay feedback very helpful. She usually only wrote a sentence or two in response to a 5-page essay. She wasn't very clear with the instructions on the three main essays, but this is because she wants you to focus on writing something good, not towards a rubric.\r\n\r\nThe class should probably be called \"(non-fictionish) Creative Writing\"\r\n\r\nDefinitely an easy A if that's what you're looking for.", "rating": 4, "expected_grade": "A+", "created": "2023-04-30T19:22:46.942953Z"}, {"professor": "Danuta Hinc", "course": "ENGL393", "review": "Professor Hinc was one of the best professor I have had at UMD. She is not a harsh grader and leaves great feedback. The class consist of weekly discussions, four different projects, and 4 different voicethreads. The class wasn't hard overall just got to make sure you do the work early and read the modules other than that this class is a easy A.", "rating": 5, "expected_grade": "A+", "created": "2023-05-11T20:51:36.644654Z"}, {"professor": "Danuta Hinc", "course": "ENGL398R", "review": "There are a ton of busywork assignments, but that's to be expected from a professional writing course. Most assignments are graded based on completion, and the only real grades are the three main essays and participation. It's an easy class but a lot of work. Participation is worth a huge amount of your grade (30%), but the way she grades feels unfair and she is very harsh with this grading. Most of the class is discussion-based, and I thought it was chill but also very shallow. I disagree that Professor Hinc is nice, as many of her comments seem very egotistic, aggressive, or inappropriate. Much of the class is just her talking about herself. She does not like to be disagreed with, and it may affect your participation grade. Her essay feedback is not very helpful, as it seems she only leaves a few unrelated comments. I did not feel like I improved as a writer through this class, and would recommend a different PWP class if you're interested in that.", "rating": 2, "expected_grade": "A", "created": "2023-05-29T18:44:24.026277Z"}], "name": "Danuta Hinc", "slug": "hinc"}