{"courses": ["CMSC330", "CMSC818O", "CMSC389O", "CMSC818F", "CMSC389R", "CMSC798", "CMSC614", "CMSC414", "CMSC388U", "CMSC396H", "CMSC388U", "CMSC388U", "CMSC396H", "CMSC614", "CMSC396H", "CMSC614", "CMSC396H", "CMSC414", "CMSC396H", "CMSC614"], "average_rating": 4.5455, "type": "professor", "reviews": [{"professor": "Dave Levin", "course": "CMSC414", "review": "AMAZING AMAZING AMAZING Professor.\r\nOne of the best professors I had at UMD.", "rating": 5, "expected_grade": "A", "created": "2018-05-04T04:26:33Z"}, {"professor": "Dave Levin", "course": "CMSC414", "review": "Wonderful lecturer. Great teacher, and great guy in office hours. His projects are difficult and the specs contain typos, but I believe that is the fault of the grad student TAs, not Dave's. I recommend taking the class, but make sure we're working with someone.", "rating": 5, "expected_grade": "C", "created": "2018-05-11T00:00:28Z"}, {"professor": "Dave Levin", "course": "CMSC414", "review": "Best lectures I've had for a computer science course. Lecture recordings were also posted online so attendance wasn't mandatory. Exams and projects weren't easy but they were certainty fair. Highly recommend taking CMSC414 with professor Levin.", "rating": 5, "expected_grade": "A+", "created": "2018-06-02T16:50:16Z"}, {"professor": "Dave Levin", "course": "CMSC414", "review": "Love this man. We would do our work in the student lounge, he would pass by and say hello since he recognized us and would hang out for a little while or ask us about the class. Always went up to him after lecture to ask questions and he was very cool about it.\r\n\r\nThe material itself I became less and less interested in. The exams were quite open ended. A lot of short answers and a few multiple choice or word bank style questions thrown in. I did awful on all the exams, but fortunately the projects for the class were 50% of the final course grade. I did very well on all the projects but they were quite challenging...Basically they are a bunch of individual tasks you have to try out and they range from write a .c file that does this or make a txt file with a piece of code that does blah. \r\n\r\nI really disliked the final project which was a paired/team project. It caused me a lot of distress. Also several people did not submit a working project so there were only 20% of the class where you had to try and 'break' their code and write reports about it.\r\n\r\nTaking this class, I learned that Security is NOT for me. This class was more security than it was Networking which I actually like a lot more. Maybe the last month or so was focused on the Networking aspect of the class which I found quite disappointing.\r\n\r\nIf you like security and networking, Dave is the man for you. His shiney bald head will make you fall in love with him.", "rating": 5, "expected_grade": "C+", "created": "2018-07-29T19:06:00Z"}, {"professor": "Dave Levin", "course": "CMSC414", "review": "Favorite cs professor ive had. great lecturer. super nice guy. projects and exams were extremely fair", "rating": 5, "expected_grade": "B+", "created": "2018-10-23T21:37:32Z"}, {"professor": "Dave Levin", "course": "CMSC414", "review": "He seemed like a good professor, but I think co-teaching 414 was a mistake. Between the three professors (Bobby, Michelle), he was the best lecturer but was barely there and oftened talked about the more interesting but less important (for exams) topics.", "rating": 3, "expected_grade": "A-", "created": "2019-06-11T18:01:44Z"}, {"professor": "Dave Levin", "course": "CMSC414", "review": "Great lecturer, poor administrator. He co-taught the class with Bobby and Michelle and logistics were an absolute nightmare. Project descriptions were changed in random, unpinned Piazza posts at a whim, right up until the day a project was due. Points were deducted arbitrarily as there was no grading rubric and no defined test cases on the submit server like there are in other cs classes, so if you fail a single edge case that might have been covered in one test on the submit server, it could cost you a lot of points. After a while into the semester his lecture start to sound more like Ted talks than informative lectures about cyber security. At least they were entertaining. Build it break it at the end of the semester was very disappointing. Most of the points were just for writing a report, and there was very little emphasis on actually trying to break your peer's code.", "rating": 3, "expected_grade": "A-", "created": "2019-11-17T20:21:41Z"}, {"professor": "Dave Levin", "course": "CMSC414", "review": "He is a super passionate professor that knows a lot about security. His lectures are great since he seems to really enjoy it, and brings up ideas from his research and experiences. The only negative of his lecture style is that he doesn't do a lot code modeling which hurts some students.", "rating": 4, "expected_grade": "", "created": "2020-06-08T21:29:27Z"}, {"professor": "Dave Levin", "course": "CMSC414", "review": "(Disclaimer: had him during fall 2020 virtual semester)\r\n\r\nHe’s a really chill and caring professor. Some of the projects were a bit difficult, but he provided plenty of extra credit so you can definitely make up for a poor project grade with that. We were virtual so tests were open note, but I thought they were fair. ", "rating": 5, "expected_grade": "A+", "created": "2020-12-26T16:53:55Z"}, {"professor": "Dave Levin", "course": "CMSC414", "review": "Really interesting lectures and great instructor!", "rating": 5, "expected_grade": "", "created": "2021-09-28T19:37:37Z"}, {"professor": "Dave Levin", "course": "CMSC414", "review": "He's nice and includes all sorts of really cool cybersecurity stuff in the lectures including some of his research. The course organization was stressful at times BUT he also gave us a million extensions and wild amounts of extra credit, and the exams were easy and take home. So it all works out, 5/5.", "rating": 5, "expected_grade": "", "created": "2022-01-23T02:27:40Z"}], "name": "Dave Levin", "slug": "levin_dave"}