{"courses": ["ENCE302", "ENES100", "ENSE698E", "ENCE402", "ENES100A", "ENCE688D", "ENSE799", "ENCE201", "EDSP652", "GEMS102", "GEMS104", "GEMS202", "GEMS208A", "GEMS208B", "GEMS208M", "GEMS296", "GEMS297", "GEMS396", "GEMS397", "GEMS496", "GEMS497", "GEMS208D", "GEMS208E", "GEMS208F", "GEMS296", "GEMS297", "GEMS396", "GEMS397", "GEMS496", "GEMS497", "GEMS202", "GEMS208A", "GEMS208B", "GEMS208M", "GEMS296", "GEMS297", "GEMS396", "GEMS397", "GEMS496", "GEMS497", "GERM103", "ENCE402", "GEMS102", "GEMS104", "GEMS208D", "GEMS208E", "GEMS208F", "GEMS296", "GEMS297", "GEMS396", "GEMS397", "GEMS496", "GEMS497", "ENES100", "ENSE799", "ENSE799", "GEMS202", "GEMS208A", "GEMS208B", "GEMS208M", "GEMS296", "GEMS396", "GEMS397", "GEMS496", "GEMS497", "GEMS100", "ENCE402", "GEMS102", "GEMS296", "GEMS297", "GEMS396", "GEMS397", "GEMS496", "GEMS497", "GEMS100", "GEMS208M", "GEMS296", "GEMS396", "GEMS397", "GEMS497"], "average_rating": 2.0833, "type": "professor", "reviews": [{"professor": "David Lovell", "course": "ENCE302", "review": "I thought Lovell was a great teacher. He tells you what you need to know for his exams and he gets right to the point with the material. He is a fair grader and applies a generous curve. He is a nice, funny guy and I was never bored or confused in his class.", "rating": 4, "expected_grade": "A-", "created": "2014-06-03T15:20:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "Dr. Lovell is a pretty good guy if you ask him for help. If you never ask a single question, you're going to be completely lost on your hovercraft. If you ask him for help, he will gladly help you if you continue to ask questions.\n\r\nOur class was one of the most prepared when it came to building the hovercraft. \n\r\nHe is a very harsh grader, and a pretty boring lecturer, but once you get to creating the actual hovercraft, it will be fine.", "rating": 3, "expected_grade": "A-", "created": "2012-12-07T03:21:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "**********************************\r\nAVOID THIS PROFESSOR AT ALL COSTS\r\n**********************************\n\r\nHe wastes your time every class.\r\nWhich could be cool, yeah...\r\nExcept for when you get to the homework, quizzes, and milestones, and ask yourself \"HOW THE HELL AM I SUPPOSED TO DO THIS?\" because you have never once seen Lovell do an example problem in class.\n\r\nENES100 is a stressful, difficult class for most students who have decent professors. ENES100 is HELL when it is taken with Lovell.\n\r\nDo yourself a favor.\n\r\nIf you find yourself in the same situation as I did, where the only ENES100 class that would fit into your schedule happened to be with Lovell...\n\r\nDROP THE CLASS BEFORE IT IS TOO LATE.\n\r\nTake it another semester. For your own sanity.", "rating": 1, "expected_grade": "", "created": "2012-10-05T05:36:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "Butthole. Doesn't really teach. Too harsh of a grader. Won't help you. ", "rating": 1, "expected_grade": "B", "created": "2011-12-28T22:08:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "He's a horrible professor. He's stern and overly critical. He grades so harshly on all of the presentations and design reports. After the last homework set, he showed up once every two weeks to class. And he never helped any group. Don't take him. ", "rating": 1, "expected_grade": "", "created": "2010-12-22T13:48:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "Dr. Lovell had a pretty good sense of humor, but he was often absent throughout the semester when we most needed his help in constructing the hovercraft. Also, after talking to friends in other sections, it seems as if Lovell is a much more harsh grader and is much later in giving grades back.", "rating": 3, "expected_grade": "B", "created": "2010-12-19T02:33:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "He's a chill guy. He, however, is very boring and does not teach well. He speaks monotonously through the whole class, whole 1 semester. Sometimes he jokes but not many laughs. He makes the class material hard and when we presented, he took off of unnecessary points, and gave criticisms which did not need to be addressed. BUT, if you know the material, then take him.", "rating": 1, "expected_grade": "", "created": "2010-05-04T21:41:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "Dr. Lovell is a great professor and is very helpful to anybody who asks. He does expect you to work hard, but his expectations are reasonable. He is also very knowledgeable about the field of engineering and is a great resource for ENES100 students.", "rating": 5, "expected_grade": "A", "created": "2008-12-19T18:40:00Z"}, {"professor": "David Lovell", "course": "ENES100", "review": "His attitude can be a little polarizing since his humor is dry and he seems strict, but his lectures were solid. But his homework was tough. The majority of work is with teams, so he's not really too involved with the programming or building of the rover, but that's where the TAs come in. His quizzes are on random information he said like once. Overall, I would give ENES100's course difficulty a 4/5 with him, because although he grades fairly, if not a tad harshly, he expects you to know random information he said like once in lecture and he doesn't teach most of the content on these exams. ", "rating": 3, "expected_grade": "A-", "created": "2019-01-29T14:44:21Z"}, {"professor": "David Lovell", "course": "ENCE402", "review": "He is the least approachable professor you can have, and seemingly cares little for the student's well being. During COVID asynchronous class, assigned 2 large assignments due within a day of the final exam. He has belittled students when they ask questions in office hours. You will likely pass his class, but will have to sacrifice some of your soul.", "rating": 1, "expected_grade": "C", "created": "2021-05-14T13:47:40Z"}, {"professor": "David Lovell", "course": "GEMS102", "review": "Does not know how to engage students and how to get then excited about true research in Gemstone.", "rating": 1, "expected_grade": "A+", "created": "2022-01-27T22:59:33Z"}, {"professor": "David Lovell", "course": "GEMS102", "review": "Arguably the most boring person you will ever meet. His lectures have no engagement at all and are a complete waste of 75 minutes every week. Everytime I have to sit through one of them it makes me rethink my decision to join GEMS", "rating": 1, "expected_grade": "B+", "created": "2023-05-09T01:50:48.312523Z"}], "name": "David Lovell", "slug": "lovell"}