{"courses": ["ENGL398N", "ENGL398N", "ENGL398N", "ENGL394", "ENGL398N", "ENGL394", "ENGL398N", "ENGL398N", "ENGL398N"], "average_rating": 1.25, "type": "professor", "reviews": [{"professor": "David Todd", "course": "ENGL398N", "review": "Literally the worst professor ever. Is always at least 5-10 minutes late to every class, and is NOT clear at all on any instructions whatsoever. We are doing class online and he spends at least an hour explaining what is due and changing due dates and deadlines when he could just make a SCHEDULE ON THE SYLLABUS and an ASSIGNMENTS TAB. His writing is incoherent even though he’s a lawyer. Very disorganized and nobody ever knows what is due. Do not take his class.", "rating": 1, "expected_grade": "", "created": "2021-02-25T13:42:06Z"}, {"professor": "David Todd", "course": "ENGL394", "review": "Professor cares about his student's success but does not communicate assignment procedures well. He is very unorganized, his elms page is a mess and as a result, much of his instructions are unclear. Additionally, he often leaves the beginning of class for 5 min or so to get TEA which I find discourteous considering students are paying for the course.", "rating": 2, "expected_grade": "B", "created": "2023-02-24T17:13:50.354913Z"}, {"professor": "David Todd", "course": "ENGL394", "review": "The most logistically challenged professor. Avoid him at all costs. Somehow finds a way to overcomplicate the most simple tasks and manages to waste your time through it all. \r\n\r\nMany people complain about his habit of starting every class fifteen minutes late but that's not even that bad when considering just how complicated he makes the structure of the class. His ELMS course has a thousand different due dates on it, half of which he tells you to ignore- whch makes it even harder to find what's actually due. The frustration when realizing you lose a couple points from an assignment simply because the course structure on ELMS didn't prepare you for it is nothing short of an embarassment for this institution.\r\n\r\nJust a terribly organized professor who ought to change his ways. In terms of his teaching ability however, I would say he is average and unremarkable. You'll certainly gain some value from this class but it'll be a hell of a lot easier with a professor who knows what they're doing.", "rating": 1, "expected_grade": "", "created": "2023-02-28T18:39:14.697763Z"}, {"professor": "David Todd", "course": "ENGL394", "review": "Please God do not take any classes taught by this professor. This is probably the first review I have ever written on this site and it is because I believe it is imperative to avoid this professor at all costs. The workload for his version of this class are far more then basically every other version of ENGL394, and the way he explains everything makes no sense. He also just makes everything far more complicated then it needs to be, and the final project for the class can be basically over 20 pages. I haven't even mentioned the worst part about this professor, which is the fact that he basically shows up 15-20 minutes late to every class. It is actually unreal how often he would just stroll in 20 minutes late. It was probably the most disrespected I have felt as a student. I agree with the other comments, do not take this class with him no matter what.", "rating": 1, "expected_grade": "A-", "created": "2023-12-07T17:59:10.473290Z"}], "name": "David Todd", "slug": "todd"}