{"courses": ["ARHU390H", "BUMK701", "BMGT498Q", "BMGT498K", "BUMK758L", "BMGT438A", "BMGT490H", "ENES490H", "ENES489A", "BMGT398N", "ARHU398Q", "BMGT390H", "ENES390H", "BUSI730", "BMGT438T", "BMGT490H", "ENES490H", "BMGT438T", "BMGT490H", "ENES490H", "BMGT390H", "BMGT438T", "BMGT490H", "ENES390H", "ENES490H", "BUSI730", "BMGT758R", "BUSM701", "BMGT490H", "ENES490H", "BMGT390H", "ENES390H", "BMGT390H", "BMGT490H", "ENES390H", "ENES490H", "BMGT390H", "BMGT490H", "ENES390H", "ENES490H"], "average_rating": 2.5, "type": "professor", "reviews": [{"professor": "David Ashley", "course": null, "review": "I can't believe no one has reviewed Dr.Ashley yet!! He's a super nice guy, amazing. I would take any class with him!", "rating": 5, "expected_grade": "", "created": "2021-01-12T20:55:55Z"}, {"professor": "David Ashley", "course": null, "review": "I have a lot to say about Professor Ashley. First of all whoever is reading this, I am in QUEST and also took an outside elective with him for his multi cultural class. Everyone thought this was going to be the easiest class ever and I literally have an 89 right now and might end with a B+. He uses no notes and no rubric when he watches presentations, I gave a status update and next thing I know I got a 17/20 with no comments, no rubric, and he watched all the presentations right in a row so how on earth could he have actually accurately judged mine. He also RUNS OVER CLASS TIME AND ITS SO ANNOYING my lecture ends at 7:40 after starting at 5 and there are multiple days where I don't get out until past 8. This was supposed to be an easy elective and ended up being such a frustrating class. 438T is not worth your time ", "rating": 2, "expected_grade": "", "created": "2022-05-14T14:06:59Z"}, {"professor": "David Ashley", "course": "BMGT438T", "review": "Really mixed feelings because he's a really charismatic speaker but not that great of a professor. Class is mostly just discussion which I don't mind, but expect to be teaching yourself most of the material for exams. He also gives no instructions or rubrics for projects and just expects you to know what to do. For a class that is over 2 hours long, there is no real structure/learning and it's really hard to stay engaged", "rating": 2, "expected_grade": "", "created": "2022-11-26T21:10:18.129897Z"}, {"professor": "David Ashley", "course": "BMGT438T", "review": "He gives off major white savior vibes. He just talks about countries he’s been to and the one Indian wedding of his Pakistan friends. So I guess that qualifies him to teach this class. He’s incredibly unorganized and his class just consists of him asking surface level questions. Exam questions are based on vibes. His grading is based on his mood. There are no comments or clear instructions  given. Don’t take him. You’re better off looking up the definition of “culture” on Google.", "rating": 1, "expected_grade": "", "created": "2022-11-27T22:07:25.481181Z"}, {"professor": "David Ashley", "course": "BMGT438T", "review": "The very definition of a waste of time. He’s a terrible professor", "rating": 1, "expected_grade": "", "created": "2022-11-27T22:18:22.367831Z"}, {"professor": "David Ashley", "course": "ENES490H", "review": "I would agree with some of the other reviews about the fact that he does ramble a good amount, and sometimes the class felt unstructured. However, his knowledge and experience are pretty robust, and he gave us some good advice on how to deal with clients and is very well-connected, so he can point you to many people who would be of help. He is also just a nice guy in general, and made our late evening class enjoyable.", "rating": 4, "expected_grade": "A", "created": "2022-12-27T16:45:41.577809Z"}], "name": "David Ashley", "slug": "ashley_david"}