{"courses": ["INAG110", "INAG110", "INAG110", "INAG110S", "INAG110", "INAG110", "INAG110", "INAG110", "INAG110", "INAG110"], "average_rating": 4.2105, "type": "professor", "reviews": [{"professor": "David Gormong", "course": "INAG110", "review": "This is literally the worst teacher I've ever had. He completely invalidated my thoughts and opinions 100% of the time and treated me with blatant disrespect in front of my class. Do not under any circumstances take INAG with him.", "rating": 1, "expected_grade": "A+", "created": "2021-12-09T01:08:32Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Since this was his first semester teaching at this university, he followed the curriculum that he was given rigorously and did not allow much leeway. We have 5 total speeches (4 individual, 1 group - tho this speech was a breeze). While he knows his stuff, he is kind of boring. He does not post his PowerPoint online as he believes this will cause students to slack off in his class. You are expected to take notes by hand unless you are excused by UMD to use an electronic device. What I found most annoying was two things. He gives pop quizzes on the occasion and while they are worth 5 points, they can be unexpected and hurt your grade a little bit. The other thing is that when you are giving a speech, and you go even a second above or below the time limit, he will deduct 3 points from your final grade. If you are giving a speech worth 50 points, those 3 points mean the difference between a letter grade. Plus when you are giving a speech, you have no way of knowing the time so you really have to practice to get within a certain time frame. I will say, he did not grade that harshly on speeches and he is approachable if you have a problem. He is a nice professor and you will learn a lot in this class. You get weekly reading quizzes which aren't too difficult, and a weekly video response which if you put the minimal work in on those, you will get 5/5. There are definitely better professors out there for this course, but Professor Gormong is new so he is getting used to the culture here at UMD. ", "rating": 3, "expected_grade": "A", "created": "2021-12-12T20:33:19Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Pros: \r\n1.) Friendly & easy to approach. He smiles a lot and respects his students. He's not one of those professors who would stare at you blankly if you told a joke.\r\n2.) You can tell that he's very passionate and enthusiastic about the subject that he teaches. If a professor hates their job, the students probably will hate the subject.\r\n3.) His assignments are very easy.\r\n4.) Lenient on grades for speeches. \r\n5.) When you're presenting your speech, he gives his full, undivided attention and occasionally nods (which personally makes me feel less nervous).\r\n\r\nCons\r\n1.) Speeches are worth 60% of your grade so if something random occurs and you miss any...you're pretty much doomed. I know this class is supposed to prepare you for public speaking, but even 40% would be reasonable. The midterm and final need to be worth WAY more. Or maybe he can incorporate other assignments...for example projects. \r\n2.) Though his assignments are easy, with other classes college can be overwhelming. There is no leeway for late work at all. You don't even get 50% of the credit. \r\n3.) I never understood why we couldn't have electronics in class (even for notes). We're adults. If someone gets carried away on Instagram, that's their problem.\r\n4.) Pop quizzes\r\n\r\n", "rating": 4, "expected_grade": "", "created": "2021-12-14T03:03:50Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "This professor is very nice tho a bit awkward at times. I feel like someone else perfectly summarized his teaching style but let me reiterate that he is new and because of this I feel like it is the reason for why he is so strict on following the curriculum to a tee. One thing that did make me hesitate to give him a higher score was that he does give pop quizzes sometimes, although on some of them, he allows you to collaborate with your fellow peers. However, twice he gave a matching quiz and once you get one wrong, you basically get two wrong and these five points, although small, can have a huge impact on someone's grade. I feel that he is a lot more harsh than some of the other INAG professors I've heard about from my friends when it comes to grading your speeches. He really cares about your movements in your speech, along with your hand gestures and make sure you practice at least two nights in advance because he will take off points if you look at your note cards too much. Other than the speeches, I feel that the other assignments are just busy work and can be completed in thirty minutes or less. He doesn't allow electronics but people in my class constantly go on their phones and he doesn't say much about it (this didn't really bother me because I have other classes that also don't allow electronics but it might be an issue for someone who doesn't like to write out their notes). He really does care about his students and their opinions but also just making sure that all of us understand the content that he is presenting. As long as you work hard, prepare well for each speech, and listen to/attend class lectures (also he does not post his powerpoint slides or recordings of his class lecture because he thinks this will make his students think they can just skip his class), it should be easy to get an A in his class. ", "rating": 4, "expected_grade": "A", "created": "2021-12-17T05:49:54Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "This was his first year teaching so I assume that's why he took the course so seriously. My friends had other INAG professors and, in comparison, Gormong graded the harshest and took off points for the littlest things which did add up. His midterm and finals were also both LockDown browser, closed-book, and made us come in-person for it while other profs allowed you to take it home and open-note. If you take INAG with him, you actually have to put in a little more effort than if you were to take the other profs so if you were looking for an extremely easy A, take any other professor. Other than that, it is very doable to get an A with him as long as you use gestures (he takes those super seriously) and practice your speech often. I am very relieved that his class is finally over and, if I could, I would have taken a different professor.", "rating": 3, "expected_grade": "A", "created": "2021-12-21T16:23:11Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Would not recommend if you're genuinely not good at public speaking or have anxiety ", "rating": 2, "expected_grade": "B+", "created": "2022-04-22T06:24:59Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Okay for starters Gormong is a very nice professor and he really does care about teaching us important communication skills. The way he grades presentations is ridiculous. He talks points off for every little thing and make sure you hit the time or you'll get a lot of points off. The way he grades is directly out of the book and he doesn't let anything slip. Also when you go to ask him a question about the grading he gets super defensive and almost rude. He gives a lot of homework throughout the semester, but don't get me wrong it's easy homework. For the amount of homework he gives there is almost like no point because it doesn't effect your grade at all. The midterms and finals are dumb because you have to take them in person and with a lock down browser, when you should be able to take those online and not in class because that's what other professors do. Overall, he is a nice person but a tougher grader for an oral communications class that is just supposed to be an easy GenEd. I mean in my opinion everyone should be getting a 85+ automatically if they are getting in front of the room and talking about the topic. Honestly the class wasn't that hard and the presentations weren't that bad but I would suggest to take a different professor if you can. ", "rating": 2, "expected_grade": "A", "created": "2022-05-06T22:03:26Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "This was his first year teaching at UMD, so he followed the curriculum to a tee and was very very strict at grading. Lectures were insanely boring, and most of them had a quiz worth 5 points. He allows you to collaborate with students after so that you get a 5/5, but if you miss class, the 0/5 can really hurt your grade. He was by far the harshest INAG professor, grading speeches extremely harshly. The midterm and final exam were both in person, closed-book, and on a lockdown browser. I had an 89.9 that he refused to round up, but he assigned an extra credit final essay worth .48 points, so you could do that if you were within .48 of a letter grade. With other INAG professors, this wasn't the case. He was so insanely hard for absolutely no reason, avoid if possible because he will make your life and INAG experience so much harder than it needs to be. ", "rating": 2, "expected_grade": "A-", "created": "2022-05-13T20:07:53Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Graded very harshly in comparison to other INAG teachers. Follows the curriculum too seriously and doesn't allow any electronics and doesn't post lectures. He also is very strict with the speeches and if you are not a perfect speaker immediately you will get a lot of points off. Takes points off for very small things. Expects way more commitment than is needed for this class. Honestly take any other teacher. ", "rating": 1, "expected_grade": "A-", "created": "2022-05-14T05:18:06Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "If you are on this website, you are most likely looking for the best professor for this class with the best grading breakdown. If you want an easy A, do not take Gormong. He grades harshly on the four speeches for the class with major deductions for your grade if you are a second over or under the time requirements. Homework is easy but doesn't really affect your grade. Exams are harder than other sections and he makes the class use a lockdown browser in person to take them. Our average on the final exam was 78%. All the speeches we had had about an 85% average score. This being said, He is a very genuine and good person and is passionate about the course that he teaches. He tries very hard to keep the class engaged and knows about communications. However, this may be the reason he takes the class way too seriously. Unlike other professors in INAG, he does not offer extra credit in any form except for a .48% increase to your grade at the end of the semester. Take any different section if you want to raise your GPA with an easy comm credit. ", "rating": 1, "expected_grade": "A-", "created": "2022-05-19T00:37:07Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Nice person, but a harsh grader. Getting an A would be far easier if you take this course with another professor.", "rating": 3, "expected_grade": "A-", "created": "2022-11-07T03:09:56.301551Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Gormong helped me get better at speech/presentations. Class has very easy HW (sometimes just 1 question HWs or MC straight from the textbook), assignments are super easy, he grades the speeches very lightly, light quizzes that he gives you the answers for. The class is fun for the material he has to teach, he’s a nice guy and will make you better", "rating": 5, "expected_grade": "A", "created": "2022-11-22T06:52:11.069518Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Good professor overall, kind to students. 4 main speeches + group speech, grading isn't too harsh, pace may seem aggressive at first but pays off later in semester. Weekly textbook readings + MCQ HW, quizzes he gives you the answers for. Midterm and final are just like HW. No curves but shouldn't be necessary cause of speech grading. Some controversial topics at times but was generally respectful. Definitely helped me be more confident with speaking.", "rating": 5, "expected_grade": "A", "created": "2023-01-27T16:37:56.948477Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Grades very harshly, but pushes you to become a better public speaker. Does not easily give 100s on speeches, but will give you an A as long as you practice. Does give quizzes often in class, but he gives you the answers so its really just attendance", "rating": 4, "expected_grade": "A+", "created": "2023-02-06T19:19:52.795850Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "I had really low expectations coming into this class, but I ended up LOVING it. There are 4 speeches and then one little group project at the end, and honestly they’re really not that bad. Talking for 8 minutes (the last speech) sounds really hard, but you just have to pick something you really like to talk about and it will come naturally, as well with the shorter speeches.  There are weeklyish homeworks about the textbook, but just use ctrl-f and they shouldn’t take you longer than 15 minutes. There are quizzes, but he literally goes along with us in class and makes sure we all get 100 lol.  Looking at  earlier reviews, I am confused because Professor Gormong is great. He’s super friendly and seriously wants everyone to succeed and do well. His grading is fair to easy - I completely bombed my second speech yet he still gave me an A. He really promotes the whole class getting to know each other, so that helps take away a lot of the jitters before giving your speech.  I cannot recommend taking inag110 him enough!!", "rating": 5, "expected_grade": "A+", "created": "2023-05-03T19:43:54.512558Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "If you need to take a credit for your comms gen ed, definitely take INAG110 with Professor Gormong!  He legitimately wants all of his students to succeed and he is pretty lenient with grading.  I was terrified of public speaking prior to this course, but now I feel so much more confident.  He's also just a really nice guy and super easy to talk to, so I really recommend him!", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T16:09:43.673628Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "He is a great guy and really not that hard if youre willing to learn to talk to people in a new and more constructive ways.", "rating": 5, "expected_grade": "A", "created": "2023-05-08T17:10:21.922522Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Gormong is super nice and friendly. Speeches weren't graded too harshly unless you went over/under the timeframe that was posted on the rubric ahead of time. Most of the time you can get a good grade on your speeches if you just check every box. We had a lot of weekly homework quizzes that were based off of a chapter in the textbook, but they weren't really difficult at all. They offer a lot of extra points if you preform well and outside of class there wasn't too much work. He lets you choose when to sign up for speeches so you can give yourself as many or as little days as you need to prepare. The only thing is that during speeches he doesn't let you take a timer up with you or give any indication if you're talking too long or too short which was sometimes difficult because you wouldn't know unless you asked someone for your time or waited until the speech was graded. Overall, great professor and would recommend.", "rating": 5, "expected_grade": "A", "created": "2023-05-08T17:11:57.004914Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Professor Gormong is truly great at his job. He makes class fun, makes an effort to get to know his students, and actually cares about making you become better at public speaking. His grading was not as harsh as everyone made it out to be in previous semesters--as long as you make a genuine effort you'll be fine in this class. 4 individual speeches, weekly MCQ HW based on the textbook, and a group presentation at the end of the year plus in-class quizzes that he reviews the answers for before submitting.", "rating": 5, "expected_grade": "A", "created": "2023-05-12T19:11:22.944797Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "I don't know what these 1 star reviews are talking about Professor Gormong! He is amazing. Actually the sweetest man I have ever met. His class is extremely easy and all he wants is for his students to be confident. There is no final exam and the speeches are very clear. It is literally impossible to fail this class. There's a quiz once a week but they are so easy. If you have the choice to take him do it!! He is AWESOME!", "rating": 5, "expected_grade": "A", "created": "2023-12-04T21:49:43.960472Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "I loved Professor Gormong. His class does require more work than other comm courses, but I definitely recommend him. This was a very easy A. He grades extremely leniently and there are easy participation points each class. I would definitely take him if you have the chance!", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T17:20:07.056757Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Very good at what he does, as long as you do your stuff and complete your assignments on time, you're going to get an easy A in the class. Do not believe the other reviews that say he is hard, or mean, genuinely one of the nicest professors you will ever have.", "rating": 5, "expected_grade": "A", "created": "2023-12-07T06:17:34.544393Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Although Professor Gormong made it so that we had weekly work that can seem pointless, at the end of the class you realize that the work was helpful to your improvement. Your grade depends on how much work you put into the class, but it is very easy to just pay attention and you will be successful. Overall he grades pretty easily until the last speech and by then you already are a better speaker so it should be easy.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T16:14:36.080339Z"}, {"professor": "David Gormong", "course": null, "review": "I honestly don't know what some of these reviews are on about; the course is easy, the speeches aren't difficult in the slightest, and other assignments are easy to complete. Just don't be lazy.", "rating": 5, "expected_grade": "", "created": "2023-12-07T16:15:25.621148Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Take his class!! Professor Gormong is a very nice person and I think grades very fairly. He creates a fun and very not intimidating atmosphere to present speeches. Your public speaking will improve a lot this semester and course load is pretty light. There are weekly practice speeches with quizzes and 4 big presentational speeches- very manageable.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T16:15:42.715216Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Absolutely amazing teacher! Connects with his students and really cares. 100% recommend him to anyone and everyone.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T17:44:36.949244Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "He really wants you to have a good grade in the course but he does narrow down the rubric for speeches really specifically. And is strict with attendence and rules. But he is very nice and you will get an A.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T17:45:13.606606Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Teacher mad calm", "rating": 5, "expected_grade": "A-", "created": "2023-12-07T17:46:31.249449Z"}, {"professor": "David Gormong", "course": null, "review": "Wonderful Professor and has improved a lot since the low star reviews! I would recommend to anyone. Made the class feel comfortable, especially those with anxiety in public speaking.", "rating": 5, "expected_grade": "", "created": "2023-12-07T17:47:24.311561Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "I loved Prof. Gormong for this class! I know some other reviews said that he graded harshly, but I asked him about it and he said that his old boss required this stricter grading, but his new boss does not. He graded my class very leniently. The rubrics for the speeches were really clear and you'll get a good grade if you follow it. We also had weekly quizzes based off of the textbook, but I just did control F for all of the topics and took like one note each topic and got a 100 on almost all of the quizzes.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T17:58:30.089617Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Professor Gormong is so kind and genuinely cares so much about his students. This class could be really annoying but he really tries to make it as painless as possible. He made us do a lot of practice which may seem annoying at the time but it actually really helped me improve. I feel like my public speaking skills really improved a lot and I got a lot more confident. Theres four big speeches which get progressively a little harder, but he prepares us really well and as long as you follow the rubric you should be totally fine. There are like maybe 10 small quizzes based on the textbook but they're really easy and you don't usually need to read the textbook in depth. Definitely try to get Gormong if you can!", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T21:15:06.069143Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Professor Gormong is a great teacher. He very clearly truly cares about his students and tries his best to ensure his students succeed not only in his class but in life in general. Super friendly guy. The class itself is easy if you do the work and he offers plenty of extra credit opportunities.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T19:12:36.028947Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Amazing professor! I recommend anyone who has to take a Comm class to take Professor Gormong's class. He is very understanding and wants you to succeed. He truly cares about his students and takes the time to make personal connections.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T19:13:19.472920Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Professor Gormong is a caring and dedicated professor who genuinely cares about helping his students improve.\r\n\r\nThere are 3 graded speeches, a group presentation, and a final presentation. A lot of class times are dedicated to short practice speeches which are graded by participation. Sometimes there are quizzes based on the info from the textbook but it's mostly common sense. Just show up to class to continue collecting participation points.\r\n\r\nA lot of the reviews here state that he doesn't give much extra credit, but he has changed his policy and offers 4 extra credit opportunities over the semester.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T19:18:27.260450Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "The reason Professor Gormong's ratings are so low is because they are from when he was a harsher grader/instructor which is no longer true. I took this class completely uncomfortable with any form of public speaking but he really made the class welcoming, comfortable, and inclusive. The class consists of weekly practice pass/fail speeches, weekly (easy) quizzes, and 5 big speeches. As long as you put in effort and show that you tried you will get good grades in this class. (the lowest grade on our big speech was an 84). Professor Gormong really cares about his students and is extremly accommodating because of it. He gives you all that you will need to be successful in his class, and makes it fun and lighthearted at the same time. This class was a refreshing break from my harder classes and gave me a chance to breathe. I really recommend this professor for INAG110.", "rating": 5, "expected_grade": "A", "created": "2023-12-12T03:12:33.395332Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Professor Gormong is one of the best professors I have had during my academic career at UMD. Not only does he grade fairly, but he makes the class easy with his quizzes, worksheets, and speeches. Regardless, of the previous reviews from a year ago up to now. I assure you he is one of the best INAG-110 professors on this campus. If you put in the work and effort YOU will pass. So please take his class as he grades very fair and cares about every single one of his students. Please do not judge a book by its cover this review should be the most current as of why you should take his INAG-110 class. His quizzes require you to read the online FREE version of the textbook, but at max it takes 20-30 minutes to review the content. So expect a tiny bit of the work to be put into that. Practice speeches are quite easy if you put in the time and effort only taking 10-15 minutes of my time to do. Please take this class, great professor, great takeaways from public speaking, and an easy A if you put the work into it.", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T20:16:13.784772Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "All the reviews saying that he was a harsh grader no longer apply. He explained to my class that he had been required to do so in the past due to his old boss, however he has since changed his teaching style. He gives you all you will need in order to be sucessful in the class, as well as provides good feedback to help you do better on your next speech. The class consisted of weekly pass/fail practice speeches, reading quizzes (super easy), and 5 big speeches. This class can truly help you become a better public speaker as Professor Gormong truly cares about the success of his students.", "rating": 5, "expected_grade": "A+", "created": "2024-01-03T21:03:58.194093Z"}, {"professor": "David Gormong", "course": "INAG110", "review": "Professor Gormong is one of the best professors in my opinion. He is the sweetest person out there and very understanding. He doesn't grade harshly at all and is very fair. I would recommend him to anyone! The one downside to the class is having to do mini speeches each class but everyone gets a 100% on them so it helps if you don't do as well on a quiz or actual speech. He really cares about each of his students and takes the time to get to know everyone!", "rating": 5, "expected_grade": "A+", "created": "2024-04-09T18:28:19.439082Z"}], "name": "David Gormong", "slug": "gormong"}