{"courses": ["THET285", "SPHL601", "SPHL602", "SPHL603", "UNIV100", "THET285", "THET285", "THET285", "THET285"], "average_rating": 4.0, "type": "professor", "reviews": [{"professor": "Drew Barker", "course": "THET285", "review": "Professor Barker was easily my favorite professor this semester. There were at least 6 different presentations to give throughout the class, however, we were given plenty of time to prepare and rehearse. He generally gives feedback on most assignments, whether that is words of encouragement or suggestions for improvement. For all presentations, he uses the same rubric which made adjusting based on feedback easier for future presentations. There were not many busy work assignments or things to turn in that I did not see a purpose behind. For every assignment that was given, I understood what I was supposed to be gaining from completing it. I am definitely a better speaker/performer after leaving this class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-20T16:52:06.410463Z"}, {"professor": "Drew Barker", "course": "UNIV100", "review": "Barker would sometimes get overwhelmingly obnoxious over topics in this course about how to get through college during your freshman year. Very strict about phones or being on your laptop while he's rambling, and will press you about attendance or if your late.. he'll also encourage you to wear a mask but do not take offense to that. If you just complete all your assignments and pay him no mind then you'll be fine. He does have a participation grade he adds at the end of the semester so you should be good if you say something here and there. He probably would want you to say something every single class to receive a 100% but it is not worth it..", "rating": 2, "expected_grade": "A+", "created": "2023-01-03T23:03:22.646887Z"}, {"professor": "Drew Barker", "course": "UNIV100", "review": "Super nice professor! Just don't use your phone during class. Really understanding if you miss class and chill grader.", "rating": 5, "expected_grade": "A+", "created": "2023-01-11T00:42:25.712761Z"}, {"professor": "Drew Barker", "course": "THET285", "review": "prof barker is just kind of a weird guy but like that's what i expected going into it because he's a theatre teacher. like he is a very generic theatre teacher guy. the assignments aren't super difficult, almost every speaking assignment you get to have your notes/script in front of you, there were like three things we had to memorize but they were all very short so those weren't hard. it is lame that he's having us do our final presentations during our final exam time like i wanna go home fr but it's whatever. he's a little weird about attendance/showing up late so i just sucked it up and tried not to be late/skip ever. if you email him/talk to him in advance and give him a reason tho then he's fine. there were a bunch of little homework assignments but those also were not bad. he was pretty nice despite his quirkiness. we all gotta get our FSOC credit and prof barker is not a bad choice to get it done with!", "rating": 4, "expected_grade": "A", "created": "2023-05-09T17:29:42.358151Z"}, {"professor": "Drew Barker", "course": "THET285", "review": "This class was so much fun to take! Professor Barker is very particular about some things like phone usage and timeliness, but he is also very willing to make accommodations or at least hear you out. He gives you ample time to complete assignments and is willing to take things late if you give him a heads up. No one in my class was a theater major, but we all learned something and improved our speaking skills.", "rating": 5, "expected_grade": "A+", "created": "2023-05-24T02:45:43.676146Z"}, {"professor": "Drew Barker", "course": "THET285", "review": "Mr. Barker isn't a bad guy, but if you can take another professor, do it. The class itself is fairly easy, we had about 13/14 presentations, I believe, and he had us speak in front of the class at least once weekly. The presentations themself were probably more entertaining and fun than regular comm presentations, but the lectures were so boring. He doesn't allow any electronics, and drones on for the entire class period about useless information. The grading is so heavily up to his interpretation, and he seems to believe the information he teaches is the most important information ever. Prepare to participate and prepare to be bored.", "rating": 2, "expected_grade": "A", "created": "2023-12-18T02:35:02.876789Z"}, {"professor": "Drew Barker", "course": "THET285", "review": "Professor Barker's intolerance for phones and lateness made his class feel like a high school one. Regardless of this, he managed to make the class enjoyable with his witty remarks and interesting assignments. His class was one of my favorites, however, I felt he was a harsh grader. No one in my course ever received a 100% on a major assignment, even if they had done an excellent job. Besides being a somewhat harsh grader, Professor Barker is a nice guy whose passion for speech really shows.", "rating": 4, "expected_grade": "A", "created": "2023-12-26T04:26:39.146855Z"}, {"professor": "Drew Barker", "course": "THET285", "review": "prof barker was a really fun guy! although some might find his humor a bit annoying? either way, he's a really nice guy. always willing to help you improve and give you pointers with speeches if you just ask him. i almost got an A- because i lowkey didn't put in the work until the end, but he can tell you have given your presentations effort, he will give you a good grade on them. he's particular about being on your phone and being late, but if something comes up, he's super flexible if you let him know.", "rating": 5, "expected_grade": "A", "created": "2024-01-04T07:34:53.554479Z"}], "name": "Drew Barker", "slug": "barker_drew"}