{"courses": ["TLPL101", "SPHL601", "SPHL602", "SPHL603", "CMSC389N", "CMSC125", "CMSC320", "CMSC125", "CMSC131", "CMSC320", "CMSC395", "CMSC125", "CMSC131", "CMSC132", "CMSC395", "CMSC125", "CMSC125", "CMSC131", "CMSC398N", "CMSC125", "CMSC132", "CMSC125", "CMSC131"], "average_rating": 4.6, "type": "professor", "reviews": [{"professor": "Elias Gonzalez", "course": "CMSC389N", "review": "Good professor. Class is ridiculously easy though.", "rating": 5, "expected_grade": "A", "created": "2020-05-02T17:20:09Z"}, {"professor": "Elias Gonzalez", "course": "CMSC389N", "review": "I had Professor Gonzalez for CMSC389N and he was really nice. He was very accommodating and always willing to help. The content in the course is not very difficult but could sometimes be a little boring. Overall, I would recommend CMSC389N for those who are looking for a computer science elective.", "rating": 5, "expected_grade": "A+", "created": "2021-01-12T05:24:34Z"}, {"professor": "Elias Gonzalez", "course": "CMSC125", "review": "If you have the opportunity to take a class with Elias, I highly recommend you do it. He's very easy going and lenient with basically everything. He's a good lecturer and tries to make things interesting when they're not. Any extension requests are always accepted and honored, his email is always open, very helpful during office hours, and is overall a great person. The class was pretty easy, as long as you put in effort you can get a good grade. The coding in the class is pretty basic and if you have a little background you'll be set, even if you don't the assignments are very doable and he always explains things in detail during class. The rest of the class is about the tech field and is still relatively interesting, but there is one section of the class that's done on code.org and it's not really that interesting in my opinion. This class was my first one that was about tech and he made it a better experience than I could've hoped for. The only complaint was that there always seemed to be issues with my grades being wrong and assignments not being able to be opened (we used google doc links for a lot of them), but that's partially due to the TA's. This was the most annoying part of the class, but it's an easy fix if you talk to him in class or over email, he'll usually regrade it and give points back. Overall, I would take his class again in a heartbeat. ", "rating": 5, "expected_grade": "A", "created": "2022-05-16T00:30:31Z"}, {"professor": "Elias Gonzalez", "course": "CMSC320", "review": "Did a good job with the course although the content and lecture was kind of boring at times. Projects and exams weren't too bad.", "rating": 5, "expected_grade": "A-", "created": "2022-09-08T18:43:52.463631Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Elias is a solid teacher, the lectures are not super boring, and he gives in-depth explanations. Plus when the exams were harder he would give a nice curve, he really seems to care. Find out which TA's are good, as that will make the class easier. The exams cover exactly what is discussed in discussions and lectures, always go to the discussion before a quiz/exam as they will drop helpful hints. No complaints", "rating": 5, "expected_grade": "A", "created": "2022-12-07T17:05:49.114396Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Elias is great, he makes lectures interesting and tries to interact with his students. He is always helpful and seems to enjoy answering questions. Elias understands his students and tries to make the class a learning experience rather than a testing environment. I really enjoyed his class, none of the lectures felt useless and the discussions helped me a lot too.", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T00:19:04.179722Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "He's the third CS professor I've had and he is by far the best. He's really good at teaching first year CS students especially if you've never touched code before. Not only does he explain the concepts really well, he spends most of lecture showing examples and actually reviewing code which helps a lot on projects. As long as you pay attention in lecture and go to discussion you'll pass no problem.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T16:21:48.958688Z"}, {"professor": "Elias Gonzalez", "course": "CMSC395", "review": "The class is just very chill in general when it comes to just talking about our experiences as a TA, and how we as TAs can better accommodate for students. He's extremely knowledge within pedagogy and education as that's his speciality and truly believes in helping students understand the material which I greatly respect. Overall, Elias is just an awesome guy to chat about a bunch of different things and he's very receptive to feedback. As for the logistics, there are some assignments ranging from in class assignments to two page papers but are very easy to complete as it's a reflection of our experiences. This class is definitely a no-brainer to take. It's an easy A+, a free credit, and an enjoyable one hour session mingling with other teaching assistants and Elias.", "rating": 5, "expected_grade": "A+", "created": "2022-12-10T03:45:16.640488Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Pretty cool guy. He is very understanding and granted a lot of extensions. However, if you slack off you probably won't do so well. This class requires a good amount of effort/studying to do well. From what I can tell, he gives easier quizzes and homework than the other 131 professors but his midterms are more difficult. Came in with no cs experience and thought I was going to fail the class after the first midterm. He helped me work through some stuff and now I'm very confident about 132.", "rating": 5, "expected_grade": "B", "created": "2022-12-11T03:57:06.723699Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "I thoroughly enjoyed 131 with Elias. The concepts can be challenging if you don't have previous experience, but Elias will make sure you understand the material. Lectures can be a bit boring at times, but nothing that is a big problem. Office hours are super helpful so utilize them if needed. As long as you start projects early, you will do fine. Elias is an excellent choice for 131 and is lenient with grading and assignments. Definitely would recommend.", "rating": 5, "expected_grade": "A-", "created": "2022-12-14T01:54:16.213173Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "I enjoyed Elias's class. His lectures were kind of slow, but if you go to all of them you will definitely pass. He explains concepts really well, and strongly encourages students to ask questions about things they don't understand. The projects were a good level of difficulty; I didn't find myself struggling too much as long as I started early and went to office hours. The only part of his class that I had an issue with was the exams, I felt like they were pretty inconsistent. The first one was of comparable level of difficulty to  first exams of other classes, but the second one was way too long, and I the third one was overly difficult (at least for me). However, I'm sure this is a side effect of it being his first time teaching this class, so his exams will only get better from here. Definitely recommend you take Elias if you get the chance.", "rating": 4, "expected_grade": "A-", "created": "2022-12-15T00:06:14.700592Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "HIghly recommend him. He goes over the concepts of this class very well. If you are a cs major, which I'm assuming you are if you're taking this class, I recommend taking it with him because it will build a good foundation for cs. Exams, quizzes, and projects become so much easier when you actually understand the material conceptually. He does many examples throughout class of every new unit we learn. His style of explaining and teaching makes it so simple to understand what he is saying. If you do not know any cs, you will be fine in his class. He is also very very nice so if you talk to him after class or go to his office hours, he will help you a lot.", "rating": 5, "expected_grade": "A-", "created": "2022-12-15T01:25:13.813674Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Elias is a great teacher, he is a very down-to-earth guy and definitely puts students first. His class was not too difficult and the pace of the class and lectures were great.", "rating": 5, "expected_grade": "A", "created": "2022-12-15T23:37:13.744194Z"}, {"professor": "Elias Gonzalez", "course": "CMSC395", "review": "Easy A, good prof", "rating": 5, "expected_grade": "A+", "created": "2022-12-17T05:58:59.461801Z"}, {"professor": "Elias Gonzalez", "course": "CMSC125", "review": "Super chill and lenient professor. You learn a lot and it should be an easy A if you do the work.", "rating": 5, "expected_grade": "A", "created": "2022-12-28T19:59:58.991473Z"}, {"professor": "Elias Gonzalez", "course": "CMSC395", "review": "He is a very nice prof.", "rating": 5, "expected_grade": "A+", "created": "2023-01-04T02:27:41.010863Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Elias is a great professor, very lenient, open, helpful, and genuinely wants you to succeed; if you have him, do not be scared to talk to him if you are having trouble in his class. He made lectures relatable and engaging, you could even submit a picture of your pet, and he would put it on the slides the next time we would have a lecture. \r\n\r\nThe reason why I am giving 4 stars though, is because of certain TAs. Later in the semester, I began to realize that TAs that do not teach discussion was not helpful at all. I would often find myself and other students at office hours staring blankly at our code because we would be more confused after asking for help. A certain TA though, Takeshi, who would be at office hours in the morning had a terrible attitude towards students, there would be times when he would make comments and snarky remarks that discouraged me from even attending office hours in the morning. I hope no other student had a similar experience to what I did but I prefer TAs who teach discussion for help with coding projects.", "rating": 4, "expected_grade": "B", "created": "2023-01-08T02:21:25.657330Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Elias is down-to-earth, lenient, and very smart. His lectures are well planned out and very informative. He's very easy to approach about issues your having with your code (or anything really). He gave someone in our class an extension on half of the projects because their computer got bricked earlier in the semester. One complaint I have however is that he sometime does not respond to emails but that's what piazza is for so it is not too big of a problem. I made sure to take CMSC132 with him next semester.", "rating": 5, "expected_grade": "A-", "created": "2023-01-11T22:05:41.934211Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "His lectures are kinda useless (records them too) but Elias is a fabulous instructor and really cares about the success of his students. Class isn't too hard. Make sure utilize office hours if you need help.", "rating": 5, "expected_grade": "B+", "created": "2023-02-09T20:39:02.483102Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "I want to disagree with a lot of these reviews about Elias. Don't get me wrong, he's a super cool guy and very supportive/understanding of his students. However, his teaching methods suck. His lectures are absolutely useless because his teaching style is just so jumpy. He doesn't go deep into what he's talking about and only provides a super shallow and confusing explanation of a concept. I feel like we haven't learned much in class. We've been learning more from YouTube videos than lecture themselves. I've heard Fawzi is better because he can clearly explain things and says it in a way that actually makes sense.\r\n\r\nOverall, the class is easy, but it's just annoying that he doesn't teach well. I guess that's going to be every CS class from now on, (especially seeing the reviews on CMSC351).", "rating": 2, "expected_grade": "A-", "created": "2023-03-08T04:06:00.344172Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Professor Elias was a fantastic teacher. He genuinely sounds passionate about the things he's teaching and most often is able to explain in a way that anyone, even students who have never taken a programming class before, could understand. We had 3 midterms which were curved according to class averages and, with a certain exam, Professor Elias recognized that it was too long to be finished within the given time constraint so the class was given extremely lenient grading.\r\n\r\nWe also had about 8 programming projects which were actually pretty difficult despite being an intro-level CS course. You are however given a generous timeframe to complete them (about a week or-so). I definitely recommend taking Elias.", "rating": 5, "expected_grade": "B+", "created": "2023-03-10T20:58:59.388034Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Super chill, exams are reasonable, easygoing professor", "rating": 5, "expected_grade": "A", "created": "2023-04-30T03:04:43.378624Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Hands down one of the best CMSC teachers, if you get the chance to take him take it. Super helpful, and will explain and answer questions . Lectures are interesting and recorded in great quality, his office hours are very useful and he will help you and link you to valuable resources. His tests and projects are very fair, and often link with what Nelson is doing. Ta's can really help you out, but overall he is just a great guy. He taught high school before and doesn't care if the exam scores are high, he also curves and gives bonus points on exams and projects. Great guy, and his exams, lectures, projects, and overall class are a billion times easier and more interesting than Fawzi's. Elias GOATzalez", "rating": 5, "expected_grade": "A+", "created": "2023-05-01T18:18:16.714516Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Elias is one of the best professors I’ve ever had. He genuinely cares about his students and their success in his courses. If he makes a mistake he holds himself accountable and will not penalize you for it and in fact it will most likely benefit you. The lectures are useful and he will provide great examples which really help you learn the concept. He also gives out fair exams that you will do well on if you study. His TA’s are really really good. Specifically Hana, Dominic, Ipsa, and Tanaya. They all will go out of their way to explain things if you don’t understand something and work hard to provide the best assistance. There’s only really one TA that is unhelpful. Regardless, if you get the chance to take Elias for 131 or 132 you 100% should.", "rating": 5, "expected_grade": "A", "created": "2023-05-01T21:25:04.313472Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Good teacher. His projects are harder than Fawzi or Nelson and his exams can be inconsistent and confusing sometimes, but he's a very nice professor. Lenient with extensions. Only downside is some of the TA's in this class can be condescending or rude to students sometimes. The discussions are also pretty useless or boring at times; in my discussion most students don't even bother to show up unless there's a quiz. Overall not a bad class, mostly due to Elias being an understanding and fair teacher.", "rating": 4, "expected_grade": "", "created": "2023-05-02T21:28:06.621482Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Elias is a nice teacher, but overall his projects are harder than Fawzi or Nelson projects in my opinion. He is also very lenient and understanding. The one issue is with the TA's. Certain TA's like Hana, Dominic, etc. are all very nice, but there are some exceptions to this. There's one really condescending and rude TA, he's been named here for a 131 review before, and mentioned without a name on another review.", "rating": 4, "expected_grade": "", "created": "2023-05-02T21:38:34.219184Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Best CS professor ever!!! Very chill, records all his lectures, can use three 48-hrs extensions among all the projects per semester (but if u email him, he will grant u more). Very reasonable and flexible.", "rating": 5, "expected_grade": "A+", "created": "2023-05-04T16:24:24.072732Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Best CS professor ever!!! Very chill, records all his lectures, can use three 48-hrs extensions among all the projects per semester (but if u email him, he will grant u more). Very reasonable and flexible.", "rating": 5, "expected_grade": "A", "created": "2023-05-04T16:24:46.997086Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Elias is great. His projects are literally the same projects as Nelson's, so I don't really understand what the review below me is talking about. However, it's true that his project descriptions are unclear (for example, due dates contradict with each other in the title and in the body paragraph). He doesn't respond to emails sometimes, but literally GO TO OFFICE HOURS!! I only started going after some midterms and I really wish I'd visited from the beginning of the semester. He's very accommodating in-person. Just be honest about your reason for an extension, make-up, or grade concerns, and Elias will do his best to help you. \r\n\r\nIn terms of lecture, I honestly preferred him over Nelson because they're fun and engaging, but not straight up stand-up comedy. That way, I was able to come out of lecture with understanding of the material instead of several concerning (yet still funny LMAO) jokes. \r\n\r\n(Regarding my expected grade -- I got 0s on a few project assignments because I'd been struggling to get my grade up for MATH141 (UGH) so I just messed up on those. Before taking a 0, make sure to talk with Elias. This was my biggest mistake y'all... Don't do what I did! My other project grades were all solid 95s-100s, so you really would be helping yourself by talking to the instructors.)", "rating": 4, "expected_grade": "C+", "created": "2023-05-08T20:26:42.834040Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Insanely nice, projects were the same as nelson, but he made the class super enjoyable. He had some really good TA's, office hours were super key before exams. He was very reasonable and ha just moved up from high school. Take him if you can", "rating": 5, "expected_grade": "A", "created": "2023-05-11T00:29:56.396544Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Gonzalez is a very nice person and one of the most down-to-earth professors I've met at this school. Despite this ,I feel as though his lectures at times can be subpar in terms how he teaches the content. But with a combination of good TA, I think most of them are good but apparently there is one who isn't, and taking at least a little bit of time to go over concepts you might struggle with (either office hours or self studying), you should be good. Projects were never to hard as long a you take time to understand the concept and work on them consistently. His exams were definitely a curveball from how you would expect a CS exam to be like, but I think they are really good at forcing you to understand some of the topics conceptually and I think this is reflective of his teaching style. I think the lack of practice exams compared to 131 may also be a bit of a shock. Overall a pretty good professor and class.", "rating": 4, "expected_grade": "A+", "created": "2023-05-11T02:47:41.552330Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "This dude is such a goat. His lectures are amazing and I can always relate to him since he’s not old and weird. He is also such a NICE AND CARING person. Class is very straight forward. Same with the projects. Take him", "rating": 5, "expected_grade": "A", "created": "2023-05-16T04:43:47.709184Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "His reviews are true. He is very very good. I had him for 131 and 132 both. He is an amazing teacher and makes the class very engaging. I looked forward to his lectures. The class is not that hard. If you put in the work, you can do well. He does not throw any trick questions on the quizzes, tests, or projects. It is all straightforward.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T18:27:45.966460Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "DO NOT HAVE UME HABIBA as a teacher assistant. SHE IS THE WORST. You will teach yourself everything. if you go to office hours, just know you will be helping yourself. She says i dont know; i dont think so. Then it actually is. like how are you so clueless. Elias says one thing will be on the exam then it is not. He says this won't be on the exam; it is on the exam. like, come on bruh.", "rating": 1, "expected_grade": "", "created": "2023-05-20T00:58:27.023594Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Gonzales is actually not a good professor.\r\n\r\nI wish I had taken Fawzi instead and not trusted all of these positive reviews. \r\n\r\nGonzales is nothing but a copy of Nelson with a few twists. If you are given a choice between Nelson and Gonzales, then it would be better to take Nelson anyway. \r\n\r\nGonzales for the entire semester wore a face mask, even when coming to lecture. Evidently he cared a great deal about the risk of COVID infection. Also evident was that he did not care about this enough for his students, because the office hours room was a windowless room in the AV Williams Building with no ventilation in which students were supposed to go to be crammed as sardines. If there was ever a greater risk of infection, it was this place. However much Gonzales cared about his own health, he did not care enough about that of his students to get a different room for them. \r\n\r\nWith regards to the projects, the only advantage over Nelson was that the first deadline would not cost you points if you missed it, but was rather just extra credit. However, the extra credit would barely be one or two points. I doubt that it would be enough to swing your grade by any significant amount either way. \r\n\r\nGonzales cannot lecture or teach well at all. His teaching style is terrible, with no continuous train of thought. \r\n\r\nHis slides are atrocious, with the code lacking basic things which he asks for in the same projects such as proper indentation and variable names. You are far better off using Nelson's slides for the subject. \r\n\r\nI stopped going to his in-person lectures early in the semester. I could not understand anything. He records his lectures anyway, so you can be confused at home instead of in the lecture hall.\r\n\r\nOffice hours were brutal and a complete mess. It was common to find a ten-person line of students for two TAs who were in attendance. \r\n\r\nIn any case, Gonzales would go to bat for his own TAs. He seemed to forget that this class was being run for the students and not for his teaching staff. He allowed them to cancel and reschedule their office hours however much they wanted.  You might end up in desperation at office hours, only to find out all the TAs cancelled last minute.\r\n\r\nBecause of the extreme latitude Gonzales gave his TAs, they abused it to the point where you would have days where there would be zero TAs at all, followed by days when there would be three or four TAs all at the same time. Never present when you actually needed them, of course. Most of the time, there would just be one brave TA (Dominic) holding down the fort reading through some crummy Google Doc office hours queue system instead of something respectable like the Quuly that Nelson used.\r\n\r\nOut of desperation I just stopped going to office hours. It was less effort for me to spend the weekend holed up in my room, than to waste time during the week trying to get a few minutes with a TA who would never show up. \r\n\r\nWhat was also frustrating was the sheer number of typos that Gonzales is capable of. During the final exam, he actually had to pause time for him to go through them. \r\n\r\nOn the second exam, he gave us some hashing question with some ridiculously large calculations. He realized that we were wasting our time on them and put up the values of the calculations on the projectors. Good luck if you were one of those people who had already wasted large amounts of time during the exam calculating things by hand. \r\n\r\nThis kind of flip-flopping and lack of consistency was typical. For instance, he allowed, then banned, then allowed again notes while doing the quizzes. \r\n\r\nGonzales provided little support for his exams. His \"practice questions\" would be mostly unrelated to the final exam and hopelessly RIDDLED with errors. You will spend more time trying to figure out what is wrong with the question than actually answering it.\r\n\r\nMost frustratingly of all, Gonzales always REFUSED to do the common-sense thing and provide answers to his own sample questions. He would constantly tell us to crowd-source answers on Piazza. Which of course, never happened. At least had past exams WITH SOLUTIONS that you could practice with which would make things dead easy. \r\n\r\nGonzales' communication was just very snarky and condescending in general, although he was decent enough in person. You will be going to him in person often, because he often does not resopnd to email. He would write things like \"as a treat for you all there will be no lecture today\". I wonder what that implies about his own evaluation of his own teaching. \r\n\r\nDiscussions were really depressing. My TA in particular would give a confusing explanation, then react sharply to the most innocent clarifications.", "rating": 2, "expected_grade": "B", "created": "2023-05-20T23:55:03.237755Z"}, {"professor": "Elias Gonzalez", "course": "CMSC125", "review": "Perhaps the most caring professor I've ever had. Makes class engaging and is super attentive to the feedback of his students. Workload is manageable and work is straight forward.", "rating": 5, "expected_grade": "A", "created": "2023-05-21T22:56:03.783141Z"}, {"professor": "Elias Gonzalez", "course": "CMSC125", "review": "Great professor, class was engaging and he was approachable and helpful", "rating": 5, "expected_grade": "A+", "created": "2023-06-01T15:08:08.724644Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "So good!! Elias is so understanding and his exams are fair. He records his lectures so I learned by watching the recordings and they were really helpful.", "rating": 5, "expected_grade": "A", "created": "2023-06-04T02:47:31.597011Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "I had Elias for both 131 and 132. He is an excellent professor that all should not hesitate to take. He is helpful, responsive to emails, and cares about all the students a lot. The reason I gave a 4 star despite giving him a 5 star for 131 is for two reasons. First off, my TA was terrible. If you get a bad TA consider going to a different section. My TA was not very knowledgeable and discussion was a waste of time. Also, throughout this semester I felt that Elias' lectures tended to be very boring. Besides these two semi minor details, Elias is excellent and deserves a 5 star rating.", "rating": 4, "expected_grade": "A-", "created": "2023-06-04T17:54:43.904596Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Very nice and down to earth teacher. He was a CS student here not too long ago, so he is understanding if you talk to him. Knowledgeable on the subject and generally prepared. Explains topics well. The projects aren't too bad, but it wouldn't hurt for him to be a little more specific at times. Same goes with the occasional poorly written test question. But I believe these are largely due to him being a newer teacher and I'm sure he will improve as time goes on.", "rating": 4, "expected_grade": "A", "created": "2023-06-25T18:10:21.640869Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Elias is a good person. And he is who you want if passing the class is all you care about. However, if you want to have a deep understanding of the content, you probably shouldn't go with him. He has a lot of positive reviews because people tend to remember not what you do but how you make them feel. Elias is a poor lecturer and made mistakes on nearly every exam and project we had. He was too lenient on the TAs to the point where most of them basically weren't doing their job. His study guides are also misleading. This is due to him adding topics to previous study guides and calling them new. For example, he had concepts from the beginning of the semester and even from 131 on the study guide for the 3rd midterm. And, big surprise, none of those old concepts were on the midterm. But everything on the study guide is \"fair game\" for the exam so it can be confusing to decide how you should spend your time studying. BUUUUUUUT, Elias has a really great personality and is EXTREMELY forgiving and just wants to see you succeed. He makes you feel good as a student. That's what people tend to remember. And that's why his reviews are so good. I would try to get him if you struggled in 131 or are still unsure about pursuing CS beyond 132.", "rating": 5, "expected_grade": "B", "created": "2023-11-01T20:14:52.912175Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Elias is a great lecturer who explains all of the topics very thoroughly. He's kind, has a great sense of humor, and is always willing to help if you don't understand certain topics or need help on a project/assignment. He's also a relatively younger lecturer here and is a UMD alumnus himself, which is a huge plus for freshmen adjusting to campus. It does take a while for him and his TAs to grade certain assignments, but that's perhaps the only drawback I can think of. I 100% recommend him for CMSC131 and plan on having him for CMSC132 next semester!", "rating": 5, "expected_grade": "B", "created": "2023-12-05T23:12:05.452550Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Really nice guy, but can't comment on lectures because I didn't go at all. Office hours are helpful, he's understanding and will take the time to help you. He tends to make mistakes on assignments and exams, which is annoying but not a big deal. Start projects early and you shouldn't really have a problem finishing them on time, and he gives 3 48 hour extensions. Exams are pretty fair but the study guides can be a bit confusing. Class really shouldn't be that hard if you have prior experience or just make sure to not fall behind.", "rating": 4, "expected_grade": "A+", "created": "2023-12-09T21:05:02.067162Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Coming into 131 with somewhat prior knowledge of coding, I'd say Elias did very well with this class for Fall '23. Even though many other reviews seem to be shaky on Elias with his lecture style, frequent mistakes, glaring problems, etc, they seem to have been very much improved over this semester. While there were indeed still some typos on exams and quizzes, they were almost immediately addressed. Though while it would be better to see none, I assume it's going to be improved as time goes on as this is his second time teaching 131 (based on when reviews started for him). He is very humble, kind, funny, and like others have said, down-to-earth, especially being the product of UMD CS this past decade. Elias seems very passionate about teaching this course at his alma mater so I don't doubt his classes will only get better. His practice exams are extremely similar to the real exams, which have been very helpful studying tools! His office hours are also very chill and has no trouble explaining concepts or even just having a chat with him. I'll post another review of him in the spring as I will also have him for 132!", "rating": 5, "expected_grade": "A", "created": "2023-12-15T04:07:36.022285Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "GOAT!!! Very helpful with everything and all TA's are great. Open note quizzes and group labs make maintaining a good grade easy. Midterms weren't to challenging and the final was extremely easy.", "rating": 5, "expected_grade": "A", "created": "2023-12-18T03:32:20.807731Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Prof. Gonzalez is a sincere professor and truly wants his students to succeed, which is something really rare. He tries his best to make computer science fun and interesting and isn't just a boring coding lecture like most other professors. He is really understanding and accommodating to students' situations. He is thoroughly a good person.", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T21:59:47.742653Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Elias was about as good as a teacher as you could hope for. CMSC131 will be a bit challenging if you have no programming experience but he did a good job explaining the concepts and was happy to re-review things if you asked. \r\n1/2 weekly discussions are required because he will give you a 'lab' to write in class, which is graded. Otherwise, discussion is completely pointless, Elias is very lenient with TAs, and honestly, TAs weren't very helpful with questions either. Use piazza to ask for clarification on projects because it will be much quicker and more accurate.\r\nElias is also super responsive and is happy to talk to students so feel free to drop in to office hours.", "rating": 5, "expected_grade": "A", "created": "2024-01-04T04:01:41.733854Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "Elias is a great lecturer and professor overall. As someone for whom this was their first ever cs class, it was a bit overwhelming, but going to his and the TA's office hours is a huge help and will come easier over time.", "rating": 5, "expected_grade": "B", "created": "2024-01-05T03:26:28.824798Z"}, {"professor": "Elias Gonzalez", "course": "CMSC131", "review": "The class itself was really easy in my opinion. Elias is very helpful and actually teaches in his lectures. He even lets you know what topics will be converted in the midterms. This semester, he didn't make any mistakes (other than an occasional spelling error or something on an exam or quiz), but made the class very manageable and easy to pass. His TAs and office hours are really helpful and he is a great guy. \r\n\r\nTLDR - amazing teacher and easy class, take Elias if you wanna pass :)", "rating": 5, "expected_grade": "A+", "created": "2024-01-18T04:17:42.959947Z"}, {"professor": "Elias Gonzalez", "course": "CMSC132", "review": "Pros:\r\n- Really sweet professor,  nice, younger\r\n- Knowledgable, definitely knows the subject well\r\n- Exams are relatively easy, provides some practice\r\n\r\nCons:\r\n- Not responsive to emails\r\n- His lectures aren't super detailed at times. He goes over topics, but skips over on some of the smaller details that exam questions specifically test. It will fall upon you to fill in gaps of your own understanding.\r\n- He posts Nelson's past exams and a few of his past exams but doesn't post the solutions to his until last minute.\r\n- TA resources are decently inadequate. OH system is disorganized (and quite frankly not long enough), TAs don't respond to Piazza posts in timely manner", "rating": 4, "expected_grade": "", "created": "2024-03-09T22:57:24.092928Z"}], "name": "Elias Gonzalez", "slug": "gonzalez_elias"}