{"courses": ["FMSC332", "FMSC110S", "FMSC280", "MIEH240", "MIEH309", "CPGH230", "CPGH240", "CPGH250", "CPGH270", "EXST030", "SPHL260", "FMSC110", "CPGH100", "FMSC265", "SPHL399", "CPGH100", "FMSC110S", "GERM103", "FMSC265", "MIEH309", "SPHL399", "FMSC789", "FMSC110", "FMSC110", "FMSC110S", "CPGH270", "FMSC265S", "FMSC110S"], "average_rating": 4.0, "type": "professor", "reviews": [{"professor": "Elisabeth Maring", "course": "FMSC110S", "review": "Prof Maring is amazing! She's so nice and makes class really interesting. She always includes examples about her family and makes the material very relatable. \r\nTests are relatively easy.\r\nDefinitely take her for fmsc110s if you are in GPH scholars. ", "rating": 5, "expected_grade": "A", "created": "2012-12-19T23:01:00Z"}, {"professor": "Elisabeth Maring", "course": "FMSC332", "review": "Dr. Maring is a very kind, approachable woman. Her class is very easy-4 midterms, 6 online quizzes, and a few in class activities.  She also shares a lot of stories from her own experience parenting, which is very cute.\n\r\nHowever, I will add that she does dumb down course material quite a bit, and her lectures move very slowly.  Not the best class/professor if you're looking to stay engaged or challenged.", "rating": 3, "expected_grade": "", "created": "2011-04-11T12:44:00Z"}, {"professor": "Elisabeth Maring", "course": "FMSC110", "review": "I'm taking the asynchronous version of this class during the summer. It bugs me that all she does in the lecture videos are read from her pre-written notes and go through some slides. The course doesn't seem well prepared. There are a lot of assignments that are due every day and the instructions given are not clear enough. Unless you have no other choice, I recommend not to take this class with Dr. Maring, and not to take this class in general in the summer. I don't know how Dr. Maring expects students to read two entire books AND watch all her lecture videos, all while doing at least two assignments per day and interacting with other students for almost 15 days. ", "rating": 1, "expected_grade": "", "created": "2022-06-02T16:15:33Z"}, {"professor": "Elisabeth Maring", "course": "FMSC110", "review": "What an interesting class. The class overall talked about both families and public health, but more public health. I could connect my learning to previous learning and it was so reinforcing. There were quizzes that were open note, lectures that were recorded, and a few assignments/discussions. We had a larger project where we interviewed a classmate and talked about our backgrounds. Great if you get a great partner!! Dr. Maring provides great and supportive feedback. The class will be challenging if you do not watch the videos, especially because the quizzes are based on them. The textbook/book wasn’t necessary in my opinion. Would take again & would take another class with Dr. Maring!", "rating": 5, "expected_grade": "A", "created": "2023-08-19T20:58:45.025527Z"}, {"professor": "Elisabeth Maring", "course": "FMSC110S", "review": "Dr. Maring is an amazing professor! She is super nice and super easy so class was not hard at all. You don't really need to pay attention in lecture because she gives a study guide and all of the content is on there. Easy A TAKE HER", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T22:07:05.613500Z"}, {"professor": "Elisabeth Maring", "course": "FMSC110S", "review": "A very nice and forgiving professor but can be quite boring at times. She basically reads off the slides the whole lecture, but the class was very easy so it did not matter much. No final exam either.", "rating": 4, "expected_grade": "A", "created": "2024-01-04T02:02:38.323442Z"}, {"professor": "Elisabeth Maring", "course": "FMSC110S", "review": "In retrospect, I really appreciate the depth of this class. I learned a lot through the research project we were assigned (don't procrastinate!) and the cultural interview project was a fun activity. Dr. Maring holds weekly office hours and is very willing to answer questions.", "rating": 5, "expected_grade": "A", "created": "2024-01-18T03:22:40.115423Z"}], "name": "Elisabeth Maring", "slug": "maring"}