{"courses": ["CHEM135", "CHEM482", "CHEM177", "CHEM271", "CHEM131", "CHEM272", "CHEM134", "CHEM135", "CHEM177", "CHEM135", "CHEM481", "CHEM135", "CHEM135", "CHEM177", "CHEM135", "CHEM480", "CHEM135", "CHEM177"], "average_rating": 4.2157, "type": "professor", "reviews": [{"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Griffiths taught the material pretty well and kept it interesting enough that I rarely wished I wasn't there even if I wasn't engaged. Hefty curve and reasonable exams, and from what I hear of other professors is that Griffiths is a lesser of a few evils for 135", "rating": 4, "expected_grade": "A-", "created": "2018-12-18T23:05:38Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "absolutely the best professor for chem135 ", "rating": 5, "expected_grade": "A-", "created": "2018-12-19T03:35:06Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "She is one of my favorite professors at UMD. Hilarious, straightforward, clear, and concise. She states her expectations, gives hints during lectures, and provides useful problems during both lecture and discussion. Her exams might be harder, but that only means that the curve is higher. Get her if you can because her teaching helped me so much. For course difficulty, I would give CHEM 135 4/5, since its a very difficult class. ", "rating": 5, "expected_grade": "A", "created": "2019-01-29T14:27:12Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "She's nice but I highly recommend looking at the grade data for her. If you think you'll excel with her teaching style, then go for her. However, you'll see in the grade data she curves so majority of the students get C's", "rating": 2, "expected_grade": "", "created": "2019-05-16T18:34:34Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is a great teacher who seems to know the content very well and is very good at managing the course. Her class is difficult, but there are no curve balls or tricks on the exams, and she will even explain the topic distribution of each test ahead of time. (On the final exam, we were given whole questions ahead of time!) Attendance is mandatory, and there are graded in-class participation questions, but they are not very hard.", "rating": 5, "expected_grade": "A+", "created": "2019-06-09T03:05:13Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM131", "review": "She is an excellent professor who is very knowledgable and seem pretty excited whenever she teaches, and she is super sweet. However, her exams are tough, and she does in-class clicker questions so make sure you pay attention during lectures. The good thing is that she curves the class by 10 %. Also, everyone that I knew got a B or lower in this course. ", "rating": 3, "expected_grade": "C", "created": "2019-11-10T16:59:00Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "This professor is great at her job. But her TAs are horrible. You'll be lucky to scrape by with a B. She often has her TAs grade her assignments, if not all of them. It's obvious that they are not doing their job when it comes to grading based on the rubric and instead they grade based on whether or not they like the student. I was expected an A or A- in this class until the TA-graded assignments rolled in...", "rating": 2, "expected_grade": "D+", "created": "2019-12-15T00:44:18Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is a really great professor! The class is challenging but she is very straightforward about what to expect on tests and teaches exactly what you need to know. And she does curve the class.", "rating": 5, "expected_grade": "B+", "created": "2020-04-02T02:01:27Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "if you can get Dr. G for CHEM135, do it. She is one of those rare professors who clearly are here because they love to teach. The class is tough but the curve is generous and there are lots of bonus points", "rating": 5, "expected_grade": "A", "created": "2020-08-10T01:09:34Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "CHEM135 is already hard, but Griffith tries her hardest to make it manageable. If you are feeling stuck like I was, go to her office hours! Shes honestly really approachable and wants to help you and wants to see you learn. Only reason I didn't do better is because I waited until it was too late. ", "rating": 4, "expected_grade": "C", "created": "2020-09-02T14:47:14Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is a fantastic professor and really cares about your learning. She takes her job as an instructor very seriously, and is willing to work hard for you as long as you show up and are respectful. I was super nervous taking chem135 because I was always so bad at chem in general, but she really helped me out in office hours and was very approachable. She expects a lot of her students, and her class is tough, but completely worth it for the quality of learning she facilitates.", "rating": 5, "expected_grade": "B", "created": "2020-11-02T20:11:50Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "Dr. Griffith was nice but not very understanding, and the way that she structured chem177 this semester was pretty terrible. The labs were in person, but we didn't get lab partners which made things very tough and time-consuming. She made no changes to the labs themselves to make them more manageable for one person to do. It was very easy to mess things up in the lab, and with no partner you had no one to check you. For each lab you write a lab report which make up the bulk of your grade, and they can be graded quite harshly. Dr. Griffith left many comments on them, and could sometimes be pretty passive aggressive. As for the lectures, they were kinda dull and most of the time was spent in breakout rooms working on a worksheet with your group. The worksheets did help prepare us for writing lab reports, though. The midterm exam wasn't too difficult, but the amount of time you had was insanely low. Most people barely finished within 50 minutes, and there was no time to check anything. One major problem with the class was how Dr. Griffith expected us to read and understand some very complicated scientific papers. Each week we were assigned a paper to read and answer questions about. And for the final, we had to write a paper summarizing 3 of the articles published by a faculty member. It was bit extreme of her to expect us to understand and explain all these technical papers that went way beyond us. ", "rating": 2, "expected_grade": "A", "created": "2020-12-16T21:10:34Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM134", "review": "Dr. Griffith is an excellent lecturer and is very effective at communicating content from the course. She took over CHEM134 at the middle of the semester, so adapting to her expectations was a bit difficult, especially when it came to the final. Because of the switch, it was significantly different from most of what we did in class, although it was still manageable to a very well-prepared student.", "rating": 4, "expected_grade": "B", "created": "2020-12-18T19:14:44Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "The class is hard and a lot of writing, but I think Dr. Griffith does her best with what the class is. The class is curved a little at the end which was really good and she says she rarely gives - grades.", "rating": 5, "expected_grade": "A", "created": "2020-12-31T23:44:22Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "First, and foremost let me be clear that CHEM 135 is ABSOLUTELY BRUTAL no matter who you get. This class is so poorly designed and structured to set people up to fail and the order of topics covered makes no sense at all. If you have never taken AP Chem or if you have not taken chem recently (or not taken chem at all) then this class can become a nightmare. However, she did a great job at explaining things and trying to accommodate students. She rushes through the majority of the work however that is the fault of the pace of the class, not hers. Attendance is necessary. She gave students 1 index card of notes during exams. To make up for the difficulty of the class she does a pretty generous curve at the end of the year, somewhere around 15%. Assuming you do all your classwork attendance participation and homework and score around a 50 or 60 on all your exams you can pass because of said curve despite those horrible test scores.", "rating": 5, "expected_grade": "B+", "created": "2021-10-12T04:17:37Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith explains things very simply and eloquently. The content in class generally lacks depth, but it is sufficient for an introductory course and the exams. The pacing is relatively fast, but not unmanageably so. I think some of the topics are covered too quickly, which makes it difficult to do problems without supplementing your knowledge with a textbook or online sources (e.g. hybridization). \r\n\r\nExam average this year is a low-to-mid C, which isn't as disastrous as previous years, and better than most of my other classes. I heard the curve is relatively generous, and Dr. Griffith wants people to be as successful as possible. Exam formats are handed out before exam day, and exam difficulty is very similar to previous years and pretty straightforward. Discussions are good for practicing problems.", "rating": 5, "expected_grade": "A+", "created": "2021-11-01T18:53:46Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "She is a really good teacher! You can tell that she really loves her job and that is seen in her teaching. She explains things really well and wants everyone to have a good understanding of the material. Her lectures are very clear and she does a lot of examples and a lot of them are similar to what will be seen on the exams. She even let us have a notecard that we can write stuff on for each exam. She also provides a lot of previous exams to practice with which a very very similar to what your exam will be like. SO I really recommended on studying with them. She also host review sessions before each exam which are really helpful and she brings the answer keys to all her previous exams.\r\n\r\nSo overall if you can take her for CHEM take her. \r\nIt is a hard class but she makes it a little easier and she curves it really well. \r\nThis is coming from someone that didn't take AP chem in high school.", "rating": 5, "expected_grade": "A", "created": "2021-11-18T00:54:39Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I started off with Dr. Koppel and the beginning of the semester but for some reason she stopped teaching and our class now has Griffith. Her teaching style is a million times better than Koppel. She reminds me of a high school teacher in that even in a lecture with 200+ students she tries her best to engage students, answer all questions, and make sure students are following along. She has a great sense of humor and makes the class itself tolerable. Her online lecture videos are almost better than in person because you can pause the videos and go at your own speed. It's difficult to be a good professor for such a difficult and unfair class as CHEM135 but Griffith does a very good job. I'd highly recommend.", "rating": 5, "expected_grade": "B-", "created": "2021-11-22T17:24:56Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "AMAZING PROF\r\nyou have to go to class!!!!!!!\r\nyou have to study in class notes to do good on exams\r\nexams are 8-10 easier multiple choice or write ins then 1-2 problems that are CHALLENGING and require knowledge and work \r\ndiscussion worksheets are optional practice to do with your TA, i personally have an A- before finals and have never done one discussion worksheet. \r\n", "rating": 5, "expected_grade": "B+", "created": "2021-12-06T13:57:29Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "This class (CHEM135) is definitely a hard class regardless of what teacher you have, but taking Griffith is such a blessing. The difference between her and other teachers is that she actually wants you to succeed in the class and gives you multiple opportunities to do so (has a decent amount of extra credit opportunities, hold exam review sessions, gives previous exams,  gives fair curves, etc.). Although her lectures can hold a lot of information, she tries to make sure that the class understands the material before moving on, creating different ways to explain a topic, or simply writing out how to do different processes rather than most teachers who just read off slides. She is the best teacher I've had at UMD so far, and would highly recommend taking her for this course.", "rating": 5, "expected_grade": "B+", "created": "2021-12-07T19:05:35Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "Dr. Griffith is a great lecturer and you can tell she loves teaching. She is a bubbly person and that makes going to lecture fun. Now the class is not a fun class however that is not Dr. Griffith's fault. The course is a lot of writing and the grading tends to be harsh. This class is extremely time consuming. I highly recommend going to office hours since you figure out things that are needed in the report that she may not explicitly say in lecture. I do not recommend taking Monday labs since you learn what you need to put in your report in the Friday lecture and then only have the weekend to write the report. Overall she is a great professor but this is a bad class. This was my worst course during the semester.", "rating": 5, "expected_grade": "A-", "created": "2021-12-08T04:17:19Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is an excellent teacher who did her best to keep us all engaged the entire year.  She tries her best to make everyone understand the content, and wants to see people do well.  She even openly acknowledged that people wouldn't be as interested in chem, and has this class designed to see people pass.  She makes it clear that she wants her students to be engaged, and sometimes class is even fun!  She always comes to class full of energy, with a smile on her face, excited to teach a subject that she very clearly enjoys, and successfully makes a huge lecture actually enjoyable, not droning on like other teachers sometimes do.  I would very highly recommend Griffith for chem, as she is a superb chemistry teacher.", "rating": 5, "expected_grade": "A", "created": "2021-12-10T14:25:52Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Literally the best professor I ever had. She made this awful course somewhat ok. If you have to take this course make sure you take it from her. I had Dr. Koppel at begging but for some reason the instructor changed to Dr. Griffith. I thought I was going to fail when I had Dr. Koppel but with Dr. Griffith I am pretty sure I will get an A. ", "rating": 5, "expected_grade": "A", "created": "2021-12-10T18:39:37Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I really enjoyed having professor Griffith for CHEM135. She was energetic and was very flexible with the class and made chemistry as entertaining as chemistry can be. ", "rating": 5, "expected_grade": "A", "created": "2021-12-18T00:20:14Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr.Griffith is definitely the teacher to take for CHEM 135. She always seems excited to teach the material, and her exams test you on your ability to understand the underlying concepts for each topic rather than just memorize them. \r\n\r\nShe also gives plenty of opportunities for her students to meet with her, and is very quick to respond to emails. \r\n\r\nTLDR; she wants you to do well and I think that's a pretty desirable trait for a professor.", "rating": 5, "expected_grade": "B+", "created": "2021-12-21T00:48:24Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I highly recommend Dr. Griffith for CHEM135. \r\n\r\nCHEM135 is a hard class. It goes lightening speed and there is A LOT of material that needs to be covered which can be confusing. I was having a hard time keeping up even though I took AP Chem in high school. Having said all this, I believe Dr. Griffith is the only professor capable of going over this material all while making it comprehensible. She gives AMAZING examples which really help us understand the mountain of information we were presented with. Not to mention the practice problems and discussion worksheets she gives are almost always identical to the problems you will see on exams. So as long as you try your best to understand the practice problems she provides you with, you will do well on her exams. Now lets say you don't do well (which is bound to happen at one point or another), Dr. Griffith provides a very generous curve to the class at the end of the semester. \r\n\r\nNot an easy A class, but Dr. Griffith makes that A possible. Good luck :)", "rating": 5, "expected_grade": "A", "created": "2021-12-21T03:39:04Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I initially started with Dr. Koppel until she left and Griffith replaced her for the rest of the semester. This was a MIRACLE in disguise because Griffith taught exponentially better than Koppel. She always came to class energetic and ready to teach. She empathizes with her students as many engineers dislike CHEM135 by making the class more bearable, like giving use notecards on the exams. Although her midterms/exams are definitely harder, she goes through many examples during lectures and always gives us a chance to try the question first before she solves it. My tip for the class would be to go through previous midterms and practice them to study. 12/10 would take again", "rating": 5, "expected_grade": "A", "created": "2021-12-21T18:09:00Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "Dr. Griffith is extremely fun and outgoing. All the TAs for the most part were ready to help--you just have to ask for it. The class requires effort for sure but she did apply a curve at the end and I think it was more than fair. You have to be on top of your shit in this class. Don't wait till the last minute to do your workups and reports bc it will just drain you!!! ", "rating": 5, "expected_grade": "A", "created": "2021-12-23T16:39:54Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "My favorite professor for my first semester of college. No one brings the amount of energy and positivity into the classroom setting like Dr. Griffith does. It kinda makes you forget how hard the class actually is lol. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-24T00:52:41Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I highly recommend Dr. Griffith for CHEM135.\r\n\r\nShe is an amazing person but the class is super hard. She made this awful course somewhat ok. ", "rating": 5, "expected_grade": "C+", "created": "2021-12-27T03:00:10Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "My grade really suprised me, very generous curve. Understands that the people who take chem135 do not care about chemistry and just want to pass. ", "rating": 5, "expected_grade": "B-", "created": "2021-12-31T01:56:12Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I heard a lot of bad reviews about CHEM135 before going into this class, and was completely surprised when I enjoyed class. TAKE GRIFFITH SHE IS AMAZING (plus the curve was insane). She is very organized, understands the concepts, sometimes jokes around, and adjusts to the needs of the class. If you took ap chem, you will be fine because it will all be review. The hw assignments are mastering chemistry (aka they take a long time and are boring) do yourself a favor and break up the hw into sections and don't do it last minute. ", "rating": 5, "expected_grade": "A", "created": "2022-01-07T20:11:46Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith was very accommodating, giving extra credit and pushing back homework assignments. Tests were fair, would give an outline of each test the lecture before. Definitely recommend.", "rating": 5, "expected_grade": "A+", "created": "2022-01-12T01:46:49Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is an excellent professor who listens to the needs of the class and adjusts her lesson plans accordingly. The tests were fair for the most part and she was good about letting us know what to expect before each exam. If you are able to take her, do it!", "rating": 5, "expected_grade": "A", "created": "2022-01-12T01:49:22Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "Very nice lady, but worst class I have ever taken. I spent more time on this 1 credit class than all my other classes combined. Class averages were regularly in the 50s, and nothing was ever curved. Everything depends on your luck with which TA grades your assignment. There is zero standard. Spent 20+ hours on a lab report and got a 53 (class average was a 50). All of the little assignments brought my grade up, but it was miserable to make it to an A.", "rating": 2, "expected_grade": "A-", "created": "2022-02-04T20:02:38Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM271", "review": "Dr. Griffith was by far my favorite teacher this semester. She is super energetic and encouraging which is fantastic in a chem teacher. She makes this very difficult class feel easier by a little bit making you feel like a kindergartener who just wants a treat for doing school, but like in a good way. Definitely take her if you have the chance.", "rating": 5, "expected_grade": "A+", "created": "2022-05-15T17:03:03Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM271", "review": "honestly, she really does want her students to succeed and will give outlines of exams. However, they seem easy but they are not. Its all about how you perform as a student, if you are old at conceptual multiple choice questions - this is the right teacher for you. I am personally better at straight forward math and would prefer calculations on an exam. this class makes you work hard, but at least there are clickers and homework to boost your grade!!! PAY ATTENTION TO WHAT SHE SAYS. she hints at her exams while teaching and you do not even realize. ", "rating": 2, "expected_grade": "B-", "created": "2022-05-18T00:27:07Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "this class sucks. professor sucks. no instructions. have fun self learning chem in a LAB", "rating": 1, "expected_grade": "W", "created": "2022-10-10T21:41:20.623322Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "She's nice but sucks at giving proper instructions on assignments and sucks at teaching. She also does not grant you extensions on assignments even though it was a problem with lab materials, not a student error. If you haven't taken chem lab before that has a heavy workload, you will struggle.", "rating": 2, "expected_grade": "", "created": "2022-10-13T04:16:30.084918Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM271", "review": "Nice professor, exams are hard, does NOT know how to curve. A C should not be curved to a C+ idc. Avoid", "rating": 1, "expected_grade": "C+", "created": "2022-11-05T20:54:12.442584Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Professor Griffith's CHEM135 is hard, that's nothing new. But she is a great professor to do it with. She explains things REALLY well. Her PowerPoints are well made (and evidently haven't changed much over the years), and discussions sections are a MUST. Also gives a lot of little extra credit clicker questions and super generous with the curve. Recommend.", "rating": 4, "expected_grade": "A-", "created": "2022-12-01T01:19:13.378226Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "While CHEM135 is a difficult course, Griffith explains concepts in a way that makes sense, using a lot of examples and hand writing the examples down while working through them rather than just using a PowerPoint. her PowerPoints are very thorough and useful, but the handwritten examples are even more useful. She will answer any question as completely as possible and ensure you understand the answer. Make sure to do the homeworks.", "rating": 5, "expected_grade": "D", "created": "2022-12-01T16:51:52.212144Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is such a good professor. Sure, the content is hard but she makes sure to repeat concepts multiple times and answer any questions. She also does many practice problems during lecture and gives a lot of study material. Her old exams are almost identical to the ones you take in class. She is also extremely personable. She likes to banter and make jokes in class which definitely makes chemistry more enjoyable. She is easily one of the best professors here at UMD. She genuinely cares about the students doing well and always makes herself available to help with any material you may be struggling with. She also posts videos on ELMS so if you miss lecture, you can watch the videos. Do yourself a favor and take her class, I haven't taken chem in years and I somehow did really well in this class .", "rating": 5, "expected_grade": "B+", "created": "2022-12-02T02:25:06.597205Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Coming into the year I heard all the standard things about how chem135 was an impossible weed out class. Looking back, CHEM135 is not impossible, there's just a lot of material that you have to learn in a very short time frame. Thankfully, Dr.. Griffith does an amazing job at making sure that all of the material is approachable and easy to pick up if you pay attention and do the work. She's a great lecturer, she's always available, she maps out her exams question by question (content, not exact details) in advance so you know what to expect- I can't really think of too many things she could have done to make this easier for us beyond giving us the exam answers ahead of time too. If you're an incoming freshman engineer and need to take CHEM135, take it with Griffith; I'd imagine it'll be even easier once she finishes the redesign of the course she's working through.", "rating": 5, "expected_grade": "A", "created": "2022-12-08T19:02:32.918342Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Chem135 sucks as a class, but Griffith made it possible. There's too much material for one semester and so some of it ends up as rushed, but Griffith made what would have been an impossible class into something manageable. She's clear about grading and is very fast to start giving bonus points to give some grade boosts. Even though I only actually talked to her a few times, she genuinely felt like she wanted every single person in the class to succeed. I hope after the redesign, the class is less impossible, but regardless, if you have a chance to take Griffith, take it.", "rating": 5, "expected_grade": "A+", "created": "2022-12-08T23:08:29.180643Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Lectures and powerpoints are detailed and the exams are fair", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T20:43:08.038655Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "Separate the class from the professor. CHEM177 is not the best class because it is a lot of work per week. The work is a pre-lab assignment, a report, and an additional assignment per week. There are 7 experiments in the semester with two being more than a week resulting in major reports which are scientific paper style. The class is difficult but manageable if you put in the work. However, Dr. Griffith is always there to help. Go to her office hours! She will answer every question you have no matter how stupid it is. She is very approachable and knows what she is talking about.", "rating": 4, "expected_grade": "A", "created": "2022-12-10T01:28:21.101107Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "First of all, I want to say that CHEM135 is just a hard class, no matter your professor. However, Dr. Griffith made the class extremely bearable. Not only is she a good lecturer, but she provides a huge curve that helps a lot of people's grades. She posted online lectures from her previous online classes which helped a lot when you miss something in class. She answers all questions and tells you during lecture what questions she will consider putting on the exam. On top of that, either the two lectures or the lecture before the exam, she will give you a question layout of the entire exam so you know exactly what question on every exam will ask you. The lectures were sometimes weird, as we would end a unit halfway through class and start a new unit the other half, but she explains the concepts really thoroughly. If you don't understand something, make sure you clear it up as it's really easy to get behind in the class. If you don't understand chemistry or haven't taken a previous chem class, I would highly recommend you take it with her. But honestly, even with prior knowledge, this class will still be a little difficult.", "rating": 5, "expected_grade": "A-", "created": "2022-12-10T22:39:26.055627Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "I'd give this class a 3.5 if there were the option to. This class is one of the hardest if not the hardest class I took this semester, and it took a lot of stress and effort to get to the end. My problem with this class is that the grading is incredibly harsh—there is no consideration for the fact that we're first-semester freshmen who've never taken a lab-based class and don't have experience writing full research papers biweekly. My one advice is go to office hours. Even if you don't have questions, listen to other people's questions. Dr. Griffith is an amazing person and will answer all your questions during office hours, but she is very strict about grading so make sure to read the rubrics before submitting. **Be very careful about deadlines, even if it's a minute late it automatically gets 25% off. Double check, triple check, quadruple check, quintuple check deadlines, and whether you submitted.", "rating": 3, "expected_grade": "A", "created": "2022-12-15T22:26:26.358805Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Hard class but Griffith is a great professor and the exams weren't bad, even though the averages were in the 50s normally.", "rating": 5, "expected_grade": "A+", "created": "2022-12-16T02:09:22.952564Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Basically have one homework a week and three exams plus clicker points. You have to go to lectures to get the clicker points even though she has all of them posted. Clicker points may seem insignificant but they add up and actually can make a big difference. I usually just watched all the lecture videos over and did a few practice exams to prepare for the exams and did average. She makes the exams way to hard which I think is dumb but its whatever because the curve is huge as everyone says. Honestly the difficulty of this class is overrated by everyone. It hard to get an A and you will need to work for it but if you just want to pass its not that bad just show up and do the homework.", "rating": 4, "expected_grade": "B-", "created": "2022-12-16T03:40:44.971306Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "This class is DIFFICULT. As an engineering major, you just got to get through it. If you do not like chem(like me), you won't like this class. There is a ton of content to cover. Work hard and you can get through this. Griffith has all the PowerPoints for her lectures posted at the beginning of the semester. Get through your homework early and do NOT fall behind on the content. It is a lot and you want to be on top of things. Griffith curves nicely, but that only works out if you study hard. You can get through this, just do your best.", "rating": 4, "expected_grade": "A-", "created": "2022-12-16T07:39:01.151453Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Griffith is a good lecturer, and although the exam averages are usually terribly low, she does give the letter grade cutoffs after each exam, so that definitely gave me some peace of mind during the semester and kept me from being stressed out about grades after receiving the score back. \r\n\r\nIn Fall 2022, she did also allow you to take a notecard into the exam. I am not sure if the other professor(s) allowed you to do this or not.", "rating": 4, "expected_grade": "C+", "created": "2022-12-18T04:16:21.367898Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Even though CHEM135 is a difficult class, especially if you did not take AP Chemistry in high school, you'll still do well with Dr. Griffith. She's really helpful and makes the lectures bearable, and there's a huge curve in the class. I'm not entirely sure how the course will look like after the redesign, but if you are good at test taking (unlike me), then you can definitely get an A in this class.", "rating": 5, "expected_grade": "B+", "created": "2022-12-20T17:39:33.542631Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "She is a great professor and a REALLY good lecturer, however her exams were very difficult (averages usually lie around 50-60). It is absolutely essential that you attend lecture to succeed in this class. Curve is really good at the end given the exam averages are so low (about 10%).", "rating": 4, "expected_grade": "B", "created": "2022-12-26T03:18:14.202617Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is an incredibly nice person, but more importantly, is amazing at lecturing and makes chemistry genuinely interesting. Prior to this class, I only had bad experiences with chemistry and was dreading this class. I had heard terrible things and was beyond nervous. But since Dr. Griffith is a physical chemist, she explains chemistry in a way closest to how most engineers would understand. If you like physics and have experience with things like Coulomb's law from electrostatics, then this class is made significantly less stressful since so much of chemistry can be explained with physics and Dr.Griffith is the one who made that connection.", "rating": 5, "expected_grade": "A+", "created": "2022-12-27T04:49:55.156243Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith was a very very sweet woman and seemed incredibly caring. The curve at the end of the course was very generous. With that said, this was the hardest course I have ever taken in my life. She moves through content incredibly fast, about 1 1/2 units a class. The content on the tests were incredibly difficult and the averages on the tests were 40's and 50's. I would recommend taking Amanda Scheck. I heard that her class moves slower and the tests are easier. If you have not taken AP  Chem or are not good at chemistry, do not take Griffith.", "rating": 3, "expected_grade": "C-", "created": "2023-01-08T00:58:51.319028Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Overall Griffith is a pretty good prof for 135; she answers emails, has good lectures, and makes a lot of study resources available. Her exams are pretty brutal but the curve helps and she is pretty accommodating overall. I definitely recommend using the textbook because her lectures match the book content very closely.", "rating": 4, "expected_grade": "B", "created": "2023-01-10T02:14:49.147943Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "FANTASTIC lecturer, makes everything very clear and actively takes feedback in lecture. Lets you use index cards on exams and final. Great curve and lots of extra credit opportunities. Lecture videos available. She's lowkey petty sometimes when the lecture hall gets talkative and sometimes she complains a lot but it's okay, her lectures were honestly a highlight of my week because of how clear and informative they were. Ask questions because she will answer them well. \r\n\r\nRelatively easy class if you've taken AP Chem, entire class is basically dimensional analysis. Definitely don't fall behind and don't be afraid to ask questions.", "rating": 5, "expected_grade": "A", "created": "2023-01-20T18:41:06.679295Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Chem 135 is one of the toughest courses a freshman can take, but don't worry, Griffith is a great proffessor. As someone who never had a proper chem class before, this was a challenging class that moved quickly, especially in the last two units. That being said, Griffiths teaching and her assigned work will help prepare you for her exams. They are hard but the class is curved. If you are willing to put in the work, and understand instead of memorize, you can do well in this class. Also in case you are worried, AP chem is not a prerequisite.", "rating": 5, "expected_grade": "B+", "created": "2023-01-23T02:30:19.223492Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Griffith is an amazing lecturer. Every day, she enthusiastically engages with the class  throughout her lectures. Although attendance is mandatory, she generously rewards participation points which are a great way to raise your grade. Expectations and deadlines are always clearly established, and she declares test material ahead of time! As a bonus, tests are always graded within 1-2 days. Although CHEM135 is an incredibly difficult class, Griffith makes it possible to get a good grade!", "rating": 5, "expected_grade": "A-", "created": "2023-01-26T19:04:11.884371Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I was pretty nervous going into this course that AP chem was a pre-requisite, that's not true at all. Griffith is very friendly and will do her best to prepare you for the \"most accelerated class in the chem department.\" Homeworks and practice problems are instrumental in learning each of the topics. After the second exam, a new topic is taught per day and it becomes very important to attend lectures. During lectures, Dr. Griffith will tend to hint at possible exam problems and will go over problems by hand which is vital to staying on track. Clickers also give generous opportunities for extra credit, don't skip lectures. Exams are challenging, but the entire class is curved in the end to make up for this. Her office hours are also welcoming and very useful to answering questions. As long as you study hard and challenge yourself, it's possible to get an A, even if you have never taken a proper chemistry class before.", "rating": 5, "expected_grade": "B+", "created": "2023-01-27T03:30:56.831401Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "If you can take the biology version of chem 1 lab, do it. This class is the hardest 2-credit class you will take in your freshman year. Expect spending anywhere from 6-24 cumulative hours writing the lab reports. I guess all I can say is that this class throws the heavy reality of science as a profession directly into your face. It is absolutely a weed out class for chem/b-chem majors even though the department refuses to admit it.", "rating": 2, "expected_grade": "A", "created": "2023-01-30T21:03:05.939849Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "It is chemistry so it is of course hard work. But the good thing is that I got an A- when I should have a B.", "rating": 4, "expected_grade": "A-", "created": "2023-02-28T19:14:18.121146Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM481", "review": "I do not recommend", "rating": 1, "expected_grade": "", "created": "2023-03-03T10:09:02.781936Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "I'm late reviewing her but she is just terrible. Yes, she is nice and does not make her lectures boring but her exams are rediculous and lectures do not cover exam material in the slightest. She does do around a 10% curve as I got a 75% at the end despite failing the final and I ended up getting a B. Take another professor if you can!", "rating": 1, "expected_grade": "B", "created": "2023-03-11T01:23:23.411895Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Great professor who explains things well. If you attend lecture, discussion, and do some practice you will be set up to succeed. You will see problems from discussion and the lecture worksheets on your exams so make sure to practice those. The final was pretty tough but the curve at the end of class was very generous.", "rating": 5, "expected_grade": "B-", "created": "2023-05-18T14:55:11.712001Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "This semester Dr. Griffith taught this class with Dr. Schech. Dr. Griffith is a nice professor and willing to help her students, but her lectures move very fast so it's easy to fall behind on note-taking. Homework can be long and sometimes difficult. Exams make up the majority of the grade and are often challenging, but reviewing problems from the discussion sections can help. This class is doable and Dr. Griffith does a good job of making it interesting, but it takes work. I took this class as a non-engineer and without AP Chem and did fine. She curves at the end of the semester.", "rating": 4, "expected_grade": "B", "created": "2023-05-19T01:09:34.852599Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Insanely good! She is so nice and welcoming, writes fair tests, and teaches AMAZINGLY. This course is obviously hard, and most students are doing it for the requirement, and she acknowledges it. I would have gotten a C with any other teacher. The slides are really detailed, she knows when to work through problems with us versus just showing us the information on pre-made slides. She answers all questions students ask, even if it is cutting into time she needs to teach more information. She provides practice exams and exam tips, and sends out an email about two days before the exams saying the broad topic each question will be with how many points. All questions on exams are clearly related to what we learned in class, so just make sure you are listening and study before exams (I personally do all of the textbook problems she recommends from the syllabus for the topics that will be on the exam). She grades SUPER quickly, like in three days for regular exams, and literally just one day for the final. The curving is fair. Also, what is really good about this class and how it is taught is that the topic we learn are not just chemistry topics on their own, but how they apply to things us engineers may actually use, like combustion engines, batteries, biodegradable stitches, solar panels, and for wastewater treatment.", "rating": 5, "expected_grade": "A", "created": "2023-05-21T20:34:26.800174Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Professor Griffith is incredible and brilliantly smart, she is very clearly an expert in the field and tries to make the material interesting and relevant to us as engineering prospects. She although seems salty about teaching CHEM 135? She makes a lot of condescending jokes during class if no one answers a question, and takes jabs at the fact that the students in the lecture are trying to go into engineering and don't have any interest in chemistry. She has very professional slides, and if you go to class you will do well. I think the tests were fair, and they are very generous with the curve, and VERY FAST at grading tests! It was impressive.", "rating": 4, "expected_grade": "A+", "created": "2023-05-29T20:46:23.745602Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM481", "review": "Very fair assignments and exams. She is a good lecturer and also uploads lectures which is great since the lectures are always at 9 am. she is also very helpful if you have any questions or with exam help so def take her", "rating": 5, "expected_grade": "A", "created": "2023-06-07T14:13:11.258869Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM481", "review": "I would totally recommend taking Dr. Griffith. She recorded and posted every single lecture, which was great since chem481 is a 9am MWF class. She was also very transparent about the types of questions that would be on exams and would recommend practice problems that were very similar to what was going to be on the exam. The homework was a bit on the challenging side, but I think it was outweighed by how fair the exams were. Her lectures were very well organized and her pacing is pretty good, sometimes a bit on a the slow side though. I learned a lot from her and I would totally take a class with her again given the opportunity.", "rating": 5, "expected_grade": "A+", "created": "2023-07-10T16:34:33.998122Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Exams are nothing like online homework, homework are around 3 hrs + , lectures are fast paced", "rating": 1, "expected_grade": "W", "created": "2023-08-28T18:01:44.091849Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Hated every moment. Exams are beyond college level making not sense. HW are dumb and long. Reviews are fake.", "rating": 1, "expected_grade": "", "created": "2023-09-14T01:26:12.581268Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Griffith is extremely smart and knows what she's talking about. Chances are if you ask her any question she'll answer it with a good explanation. However, her lectures move pretty fast and it's pretty hard to keep up with her pace at times and her exams were extremely difficult compared to the already difficult HW but she does curve at the end of the semester. Overall I'd recommend Griffith for CHEM135.", "rating": 4, "expected_grade": "C", "created": "2023-10-27T19:32:31.802905Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM131", "review": "Great teacher, super kind, funny and overall cool. If you have prior chemistry knowledge this class will be a cake walk. Attend her lectures, pay attention, and look at her past exams and you will do well.", "rating": 5, "expected_grade": "A", "created": "2023-11-26T07:41:18.468261Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Terrible professor. Very uninteresting, makes the tests way too difficult, and quite frankly gets off topic too often. I would avoid at all costs.", "rating": 1, "expected_grade": "A-", "created": "2023-11-28T21:44:35.220785Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is genuinely one of the best chemistry professors I have ever had. She is extremely caring and really wants her students to do well. She was always willing to work with me if I couldn't come to office hours or needed any help. I had a really bad TA so I mostly relied on her office hours to help me get through. She offers tons of in-class bonus points through clickers. Her lectures are a little fast, but she tries to give as many examples as possible and shows the derivation of each of the concepts so it is easy to understand where the formulas were coming from if I ever forgot one. Her lectures being fast also is not her fault at all there is just a lot of material that needs to be covered in the class. By no means is it an easy class, but she offers tons of help and support to make things a little easier.  We get to use a notecard on every exam and also on the final. She also provides an outline of every exam before and shows all of the point values and the concepts tested for each question.  The exams are difficult, but fair and she is willing to regrade for partial credit. If you stay on top of your assignments and ask for it if you need help you should be good. She is also redesigning her class right now which is making the material a lot more manageable. Overall, Griffith is a really great professor, and I would definitely recommend her class.", "rating": 5, "expected_grade": "A", "created": "2023-11-29T16:17:37.553410Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is great!! She records all of her lectures, always gives bonus clicker questions in class, and is always available to help out. She is a great teacher and definitely knowledgeable about chemistry. Her exams are hard but we get a decent-sized notecard and she tells us the outline of the exams with point values and the concepts tested so with that and all of the previous exams and keys it is not too hard to find the format of the questions. Obviously, like any teacher, she throws curveballs on her exams but she does give partial credit and is always willing to work with you if you need help. She also posts all of her lecture recordings which is really helpful to look back on. If you do the homework, show up to class, make a good discussion group, and ask her if you need help it is not a bad class. Definitely recommend Dr. Griffith!!!", "rating": 5, "expected_grade": "A", "created": "2023-11-29T16:23:08.266357Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM131", "review": "Great professor for Chem 131. She was pretty flexible with homework deadlines and helpful at office hours. Also did grade cut-offs for the exams. This course will be easy is you took AP Chem otherwise you will be struggling.", "rating": 5, "expected_grade": "A-", "created": "2023-12-01T14:25:15.359611Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "Dr. Griffith is an amazing professor and is always willing to offer reliable help. Don't be afraid to request regrades because the class has a lot of grading and there are bound to be slip ups. The TAs are extremely helpful too especially Andy.\r\n\r\nThe thing about CHEM177 is that it WILL be difficult at first. You're learning about how to write research papers or the general jist of it, but Dr. Griffith helps you through it during lecture times. It's a lot of work if you want an A, but it's definitely doable with commitment. You don't really need too much chem knowledge and if you have taken AP Chem it will definitely help, but it's not necessary to succeed.\r\n\r\nI promise that it will get better after Major Report #1 and don't give up!! You'll be surprised how much you can do and again, Dr. Griffith is an amazing professor and don't be scared to talk to her!\r\n\r\nMain takeaways are: GO TO OFFICE HOURS!!! AND GO TO LECTURE!!!", "rating": 5, "expected_grade": "A", "created": "2023-12-05T17:12:31.829387Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Great professor, so many opportunities of extra credit. Fair deadlines and exam content is clear. Posts old exams for practice that are very similar to those.", "rating": 5, "expected_grade": "A", "created": "2023-12-08T16:41:20.961186Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Best CHEM135 professor!!! Allows us to vote on 3 questions for the final which are identical to one question from each of the midterms. Gives lots of bonus points during lectures. Lectures are recorded. Always helpful during office hours and email.", "rating": 5, "expected_grade": "A", "created": "2023-12-10T19:36:57.249639Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Very good teacher. She records all of her lectures, which includes her written notes + powerpoints. She provides plenty of resources in order to stay afloat in her class. The class did move at a very fast pace but she never assigned extra lecture videos or extra homework (I never took chemistry either so everything was brand new to me). Outside of class, I dedicated about 5-10 hours a week doing homework and rewatching lectures to understand the class work.  She really does want all of her students to do well. I really recommend her!", "rating": 5, "expected_grade": "C", "created": "2023-12-10T22:55:35.280230Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Great professor for Chem 135. Lectures are easy to follow along and she does a great job explaining the concepts and going through examples. All lectures are recorded and she uploads all lecture slides and handwritten notes to ELMS. HW assignments weren't bad and she gives a lot of points through clicker questions during lecture and offers bonus points as well. Tests were hard but she does curve the class and gives you a notecard to use during the test. She definitely made a notoriously difficult class a lot more digestible, and I would definitely recommend her.", "rating": 5, "expected_grade": "B", "created": "2023-12-13T15:18:18.030924Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is such a good professor! She is extremely personable and is so passionate about chemistry, and it shows in how she teaches and her attitude. However, this course was very hard for me. The magnitude of information you're expected to retain and the difficulty of those topics make this course very rigorous. However, if you keep up with the lectures, do practice problems on top of homework, and understand the module activities throughout the semester, you should be fine. She offers a lot of bonus extra credit and lots of advice and insight for her exams (like the layout and the topic of each question). She knows how difficult this course is and is constantly offering support and help, she wants you to succeed and she believes in you!! For the final, she let us vote on 3 questions we wanted from the midterms to be on the final, so those were guaranteed points. I would go to her office hours frequently, you can gain valuable insight from questions asked by other students as well and she's such a great person to talk to. Continuing this semester (Fall 2023), she and another professor are redesigning the course so you kind of jump around in the chapters in the textbook. She applies the actual chemistry to topics engineers will need to know later down the line (like combustion or corrosion). I also did not find discussions particularly useful. There are videos that Dr. Griffith recorded in a previous year that you have to watch before the discussion, then the TA basically reteaches it. Unfortunately, I did not have a good experience with the TA as he did not teach well at all, so I would definitely just watch the videos. Although I really don't like chemistry, I am overall happy and satisfied I took this class with Dr. Griffith!", "rating": 4, "expected_grade": "", "created": "2023-12-13T22:18:45.496915Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Before taking this course, I, like many of you reading this, was extremely scared to take CHEM135 as it has a reputation for being a notoriously difficult class. After taking this course I can confidently say that this course is a weed-out class NOT because it is impossible, but because it is a test of how much effort you are willing to put into it. For context, I came in with little chemistry knowledge (no AP just chemistry sophomore year of high school) and ended the class with an A+. Much of this is due to Dr. Griffith. Dr. Griffith is an amazing professor who clearly wants everyone to succeed. Her tests are hard but fair, but the averages are usually low (between mid-60s to mid-70s). However, her averages are usually low because people do not take advantage of all of the study materials she provides. She provides numerous past exams to practice with that prepare you for the types of problems that she gives on exams (speaking from experience, this is the BEST way to study). For those taking CHEM135, here are some tips: first, make sure that you attend office hours if you are confused about something. Many of her exam problems are conceptual and if you are confused about one topic it will make it far more difficult on exam day. Second, make sure that you do as many practice questions FROM HER PAST EXAMS as possible, as the concepts are VERY similar to the ones you need on the actual exam. Third, do not stress if you bomb one exam. I did, and in the end, it was fine because she gives so many opportunities for extra credit. Overall, I would definitely recommend Griffith for CHEM135 as she gives you all of the resources you need to succeed!", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T00:09:38.445212Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "Dr. Griffith is a FANTASTIC lecturer and tries to make the class as straight-forward as possible. The class itself is grueling. The labs are easy enough but the post-labs are very time-consuming and difficult. This class was a struggle for me, but it was not because of Dr. Griffith.", "rating": 4, "expected_grade": "C-", "created": "2023-12-15T21:29:23.216380Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Very smart and knowledgeable of chemistry. This class is very hard because of the amount of material that must be covered; however, Dr. Griffith explains everything well and simplifies things to make it manageable. Do not expect this class to be easy even with a great teacher, it will still be difficult, just not as bad. She gives our extra credit generously, so even if you do really bad on one of the tests you can still get a good grade.", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T23:12:10.647056Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Great professor and interesting course. I had basically zero chem experience and was just taking this course as a gateway to engineering, but I learned so much, and the applications of chemistry to engineering in this course were really cool! Very organized Prof and recorded lectures and notes, easy to understand despite the fast pace. When I say fast paced I mean this class is super duper fast paced. Like zooooommm.\r\n\r\nMake sure to try on the homeworks and definitely check out the past exams. She has the exams posted in elms and keeps the keys in her office which you can take photos of. Review notes and you'll do well! Definitely do lots of practice math since this course is like 70% math and plug-and-chug. You do have to put in the hours. It's pretty important to know some of the ions for the exams, so I suggest just writing them all on your notecard lol (you can also just memorize them if you're built different). Many, many extra credit opportunities which saved my grade. Also great curve!!! I got an 87.7% in the class and it surprisingly got rounded up to an A-!! Did not feel like as much a weedout course than math141", "rating": 5, "expected_grade": "A-", "created": "2023-12-16T22:09:52.781190Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM131", "review": "She is such a good teacher. It is definitely not an easy class, but if you put in the work, then you will do well. If you need extra help, go to office hours, she is super happy to help, and it always makes the information easier to understand after. The final was worth about too much at about 30 percent, but other than that, the class is structured greatly. She gives out clicker points for coming to class, and it doesn't matter if you get them right, so just show up to class. Also, she records all of her lectures so you can go back and watch them before the tests. She doesn't curve the individual tests, but after every exam, she adjusts the letter grade cut-offs. Her exams are hard but fair, and just make sure to study and put the work in.", "rating": 5, "expected_grade": "A", "created": "2023-12-17T01:28:21.543588Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "You definitely want Dr. Griffith for Chem135, the course sucks and she is your best bet. \r\n\r\nGriffith is extremely knowledgeable and very fair with her grading. She speaks pretty fast, but she is always available during office hours and she records her lectures. She provides a lot of opportunities for bonus points (on the exams, homework, and with in-class clicker questions). Her exams are fair but very difficult, she lets you use a notecard and also provides an outline of the exams beforehand. The homeworks are usually pretty easy which is nice but they don't really prepare you for the exams, past exams are the best study material.\r\n\r\nI found this course to be pretty difficult (I am not a chemistry person and my high school chem class was online) but she is a great professor and there were enough fluff grades that failing a couple of exams will not kill you.", "rating": 4, "expected_grade": "C", "created": "2023-12-19T23:18:35.155998Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "This class is 2 credits but should be 3. HOWEVER, this has /nothing/ to do Dr. Griffith, it's just how the class is set up, and she can't change it. This lab really teaches you how to collect data, put together a lab report, and analyze data. Your grades will go up and down throughout the semester, and the reports do take a decent amount of time but I still enjoyed this class. It also depends on the TA who ends up grading your report. You can and should always go to her office hours for more information. You can also submit regrade requests if you feel like something was unfairly graded and you deserved more points. She usually gives some back. There are also more free points than you realize, so don't worry. Complete your lit assignments, trust me, especially with the bonus points.\r\nALSO, three important things: go to class for participation points, turn in assignments on time or 10% deduction, and try to avoid Monday lab. The lecture is Friday, where you'll learn all the important information for your report. So you have the weekend to fix it, but this semester anyway, she didn't have OH on Monday so we couldn't get more info. So yeah, avoid Monday lab.\r\nAnd no need for a fancy lab notebook, just get one from Amazon. \r\nFinally, she curves (not by that much by still a good amount), so again, don't stress over your overall grade. \r\nDr. Griffith is probably my favorite chemistry professor I've ever had. She loves teaching this class, she's such a kind person, and I enjoyed being in her class despite the workload. Don't listen to the bad reviews. She's incredible. \r\nAnd BTW if you're a Biochem or Chem major, don't take CHEM132 because it will complicate things when completing your major. Take 177 because it is the requirement. Otherwise, you're giving your future self a big headache. Technically 177 gives credit for 132, but 132 does not for 177. So you HAVE to take it. Unless you get permission or something from your advisor (idrk how it works but just try not to risk it).", "rating": 5, "expected_grade": "A", "created": "2023-12-20T02:58:56.001901Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "She's really nice and communicates her expectations for the class clearly. Keep in mind that this is a weeder class, so it was in no way easy, however Prof. Griffith did a good job with this class. I learned a ton in one semester!", "rating": 4, "expected_grade": "B", "created": "2023-12-20T18:42:15.219216Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Good professor but it's obvious she doesn't like teaching a class full of people who don't wanna be there. There's a ton of content in each lecture. GO TO LECTURES. Even if you know the material, her clicker questions are easy points and you don't want it to come down to a couple points at the end of the semester. Not a great curve this semester, not gonna lie. The discussion wasn't helpful and I never learned anything. But her lecture videos she sometimes gives as resources were very helpful. Her exams were very hard but easier than other professors. Exam is crazy hard but it's graded in a day. Go to office hours, she made a bonus on her final you would have no idea about unless you went to her final. Online homework is helpful for understanding but not really similar to the exam questions. For exams, go through all the previous exams.", "rating": 3, "expected_grade": "C", "created": "2023-12-21T04:14:09.521364Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith is an amazing teacher and I'm really glad I got to take CHEM135 with her. I had very limited chemistry instruction beforehand (1 semester high school chemistry class where the teacher gave up on teaching once the pandemic began), but I felt like the way she taught was very digestible. While the exam questions don't parallel the homework questions super well, they match the examples she does in class. She also gives a lot of opportunities for bonus points (bonus clicker questions in class, bonus questions on homework, bonus questions on exams). The class is fast paced (which it is required to be by the chemistry department), but she does a very good job with the time she's given. 10/10 very few complaints.", "rating": 5, "expected_grade": "A+", "created": "2023-12-22T20:39:05.084358Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM131", "review": "I didn’t take AP Chem and thought this class was very hard especially as a freshman, but look through the resources she gives you and do the practice past exams she puts out. I never went to office hours but she was so sweet and you can tell she really cares about her students. She also emphasizes that she wants us to understand the concepts rather than have to do tons of memorization and gives us huge cheat sheet notecards for each exam and an even bigger one for the final. Would definitely recommend taking her", "rating": 5, "expected_grade": "A", "created": "2023-12-24T16:28:38.339297Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "You need to allocate at least 12 hours for this course per week. The labs are not difficult, but the lab reports are. Most questions on reports should be clear as to what they are asking for, but if they're not (or if you have any questions at all) you NEED to go to office hours. Depending on what section you choose you can get screwed if office hours are two hours before the due date.\r\nThe professor herself is not bad. During lecture (which you should always go to!) she goes over what to include in lab reports and how to write certain parts of them. It's handy to either take pictures of the slides or save the entire slideshow off ELMS.\r\nIt's best to work with a friend (while also keeping academic integrity) because the reports and major reports can get super confusing. Don't slack because you will regret it.", "rating": 3, "expected_grade": "A", "created": "2023-12-29T05:11:38.960304Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "I don't think there is anything I could've done to prepare me for CHEM177. I don't say this in a bad way and it's definitely not Dr. Griffith's fault, but this course is just difficult. For 2 credits, you are expected to do a pre-lab assignment, prepare your notebook for class, go to lab, complete a LOONG lab workup, and a literature assignment every week. The amount of time I spent weekly on CHEM177 surpassed the time I spent on any of my 3 or 4 credit courses without fail every week. This is a weed-out class for biochemistry and chemistry majors, but once you make it past this you'll be alright. Grading is picky and harsh; don't wait until the last minute and turn in a clearly bad quality assignment (you probably won't get away with it like you did in high school). There is little consideration for external circumstances and turning things in late (even on accident) is not tolerated. There are very severe consequences for late work, so check to make sure you turned in reports on time multiple times. Doing well in this class really depends on the effort you are willing to put into it, and you really can't let a few bad report grades make you give up (even if you really want to).", "rating": 4, "expected_grade": "A+", "created": "2024-01-13T19:48:47.426951Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Wonderful lecturer providing real world applications to the concepts being covered in lecture. Many office hours were made available. Only a few major exams that averaged around 65-70, but making use of all the study materials provided in the canvas page can pretty much ensure decent grades. Highly recommend Dr. Griffith.", "rating": 5, "expected_grade": "B-", "created": "2024-01-17T00:58:39.752952Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM177", "review": "This class is challenging, there's no other way of putting it. The work is bearable, but do not let it compile. Be sure to take advantage of Professor Griffith's office hours early on. Be sure to consult her elms page-it has a lot of resources that are super helpful for writing the lab reports and becoming familiar with the lab of that week.", "rating": 5, "expected_grade": "A", "created": "2024-01-18T03:17:45.484929Z"}, {"professor": "Elizabeth Griffith", "course": "CHEM135", "review": "Dr. Griffith:\r\nShe is a very nice and knowledgeable person but sort of sarcastic during lectures (which i find funny, but others not so much). She is very fast paced, but this course has a lot of content to cover. Her organization of her slides are not the best, but she is, for the most part, able to get the content across. However, I found her exams to be quite difficult, even I felt I knew the content. There were times when I felt good taking the exam, but got a poor grade back. There are clicker questions every class that are graded on participation.\r\nCHEM135:\r\nI recommend only taking this course if you are studying engineering, and this is required. My professor continually said that this course has much more additional content than a usually gen chem course since the engineering department requires it, so don't take this course unless you need to.\r\n(is the work hard/a lot, is the grading forgiving, is attendance mandatory, is there a curve is the teacher boring, stupid, hard to reach, or strict be specific).", "rating": 3, "expected_grade": "C", "created": "2024-02-01T19:38:05.692787Z"}], "name": "Elizabeth Griffith", "slug": "griffith"}