{"courses": ["ENGL101", "CMLT277", "ENGL211", "ENGL101H", "CMLT275", "WMST275", "ENGL250", "WMST255", "ENGL255", "ENGL256", "ENGL293", "ENGL311", "ENGL391", "ENGL393", "ENGL101S", "ENGL265", "LGBT265"], "average_rating": 4.3, "type": "professor", "reviews": [{"professor": "Emilee Durand", "course": "ENGL101", "review": "Although, she makes sure her students are comfortable with the material she's teaching, she makes it almost impossible to get a more than decent grade on writing assignments due to her strict grading guidelines (if you're expecting a close to perfect grade on writing assignments, think again and proofread to death). Her lectures aren't the most captivating, but she tries her best and manages to teach what she must.", "rating": 3, "expected_grade": "A", "created": "2017-12-11T09:54:51Z"}, {"professor": "Emilee Durand", "course": "ENGL255", "review": "I really enjoy the way she teaches a class, it feels a lot like book club. As long as your willing to do the readings and participate in class you should get a good grade.", "rating": 5, "expected_grade": "A", "created": "2018-05-02T19:33:23Z"}, {"professor": "Emilee Durand", "course": "ENGL101", "review": "She is a very strict or harsh grader. Make sure to proofread all your work at least 10x. A lot of work is busy work also. ", "rating": 3, "expected_grade": "A", "created": "2020-12-17T17:09:34Z"}, {"professor": "Emilee Durand", "course": "ENGL256", "review": "Dr. Durand is engaging and genuinely excited about the texts she teaches. She is a thorough grader, offering students many opportunities to improve and refine their writing.", "rating": 5, "expected_grade": "A+", "created": "2021-12-29T20:15:28Z"}, {"professor": "Emilee Durand", "course": "ENGL256", "review": "I had a blast in this class! It felt very much like a book club, and the atmosphere was so relaxed that these meetings were what I looked forward to! Dr. Durand is one of the kindest and most thoughtful professors you'll encounter, and is accommodating when situations arise. The texts you read for this class are absolutely delightful and it is evident that Dr. Durand enjoys the texts too. The class is flexible and is easily adapted to both in-persona and virtual settings. The class heavily uses small-group discussions, which makes it incredibly unique. About half the time was dedicated to group discussion, with the other half dedicated to whole group discussion. I found this helped get classmates engaged and involved with others that they may not normally get engaged with. There are two papers, but they are not too bad and you get to write about what you choose. Overall, I have only good things to say about this class, and I am so glad that I got to have a class like this with Dr. Durand at least once in my time at college. If you get the chance, absolutely take this class with Dr. Durand!", "rating": 5, "expected_grade": "A+", "created": "2022-05-19T17:11:13Z"}, {"professor": "Emilee Durand", "course": "ENGL265", "review": "Dr. Durand is fantastic! She's a great discussion leader- she makes every course text interesting to talk about, even when they're not very fun to read. She gets paper feedback & grades to you pretty quickly, and gives insightful comments about what to improve/what worked well. I didn't feel like she was a particularly tough grader, but maybe that was just me. Definitely would recommend her for any literature class.", "rating": 5, "expected_grade": "A+", "created": "2022-05-20T02:20:09Z"}, {"professor": "Emilee Durand", "course": "ENGL101", "review": "She's a good professor but has strict grading compared to other professors. Every writing assignment earned me a B. The topic you choose dictates the amount of effort invested in the assignment.", "rating": 3, "expected_grade": "B", "created": "2022-11-24T14:24:22.310749Z"}, {"professor": "Emilee Durand", "course": "ENGL101", "review": "I loved this class! She is an amazing professor and likes to make sure her students understand everything she is talking about!", "rating": 5, "expected_grade": "A", "created": "2022-11-30T19:47:43.561839Z"}, {"professor": "Emilee Durand", "course": "ENGL101", "review": "Dr. Durand is an engaging professor who I can tell wants her class to have fun. There are a lot of assignments to help boost your grade say you ever forgot to complete one or just messed up on something. I will note though however she is a bit of a harsh grader but gives you plenty of opportunities to fix your mistakes with multiple revisions and rough drafts before any final assignment is due. The only complaint I have about the class is there is, at times ALOT of busy work that makes you feel as if you're stuck in high school. Good professor overall.", "rating": 5, "expected_grade": "A", "created": "2022-12-06T18:54:19.458230Z"}, {"professor": "Emilee Durand", "course": "ENGL101", "review": "Dr. Durand is super understanding who gives great feedback on assignments. I would say her grading is pretty strict but she genuinely wants you to succeed and her feedback on assignments proves it. There's plenty of room for late makeup work but you'll have to communicate that with her. There's a ton of busy work in ENGL101 and you definitely need to attend class to receive participation credit (it adds up). Overall, I would recommend taking her, she's a good professor.", "rating": 4, "expected_grade": "A-", "created": "2023-05-15T23:23:02.559756Z"}], "name": "Emilee Durand", "slug": "durand"}