{"courses": ["INAG110", "COMM398Y", "INAG110S", "INAG110", "INAG110", "INAG253", "INAG110", "INAG110", "INAG110", "INAG253", "INAG110", "INAG110", "INAG252"], "average_rating": 4.9286, "type": "professor", "reviews": [{"professor": "Eric Dunning", "course": "INAG110", "review": "Entertaining and very reasonable workload", "rating": 5, "expected_grade": "A", "created": "2018-04-05T01:45:37Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Eric Dunning is absolutely the best professor to take for INAG110. His lectures are fun, and if you have him on Tuesday/Thursday for the hour and fifteen minute time, you will always get out early. He likes to come in, get things done, and get out. \r\n\r\nThere are a lot of in-class exercising that are simple, goofy and fun to help with public speaking and speech structure skills. His grading of speeches is straightforward and he will always give you feedback if you want it. The lowest grade on any speech in my class during the semester was a 92, so you will do well.\r\n\r\nHe does have a midterm and a final, which are basically extra points, They are based on the chapters from the book which are super simple and it is basically a glorified vocab test. Most people studied the day or or the night before and did great.\r\n\r\nHe does have pop quizzes for the readings, so going to class is important, but you can also predict when they are going to be, but class is fun so you might as well go. For the pop quizzes, if you look over the vocab at the end of the chapter right before class, you will be set.", "rating": 5, "expected_grade": "A+", "created": "2019-05-07T14:38:41Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Very easy grader when it comes to speeches. He gives pop quizzes, often at very inconvenient times (for our semester, he gave a pop quiz before the midterm, and after the midterm), so make sure that you're ready for those. The quizzes are just vocab, so if you read through the chapters, and learn the vocab, you should be fine (he pulls from headers and bolded words FYI). I ended up getting caught off-guard by a couple quizzes, so if you find yourself in this situation, Dunning will give extra-credit if you wright an essay for him, so it's still not so bad. Otherwise, he's very engaging and fun to take, so I highly recommend", "rating": 5, "expected_grade": "A", "created": "2019-05-26T23:09:07Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Dr. Dunning is a really chill professor. He's laid back, a little funny, and seemed to adapt well to online learning. There isn't much work in the class, but you do have to read the textbook, or at least skim it, as there are pop quizzes based on the reading. If you have to take an FSOC class(which you do), I wouldn't tell anyone not to take him.", "rating": 5, "expected_grade": "A", "created": "2020-11-19T02:31:50Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Eric Dunning is a great professor. Just by the way he lectures, it is clear to see he is well qualified to teach a course about public speaking. He gives a few easy quizes on readings and the midterm and final are multiple choice. The course load is low, but you really need to spend your own time outside of class prepping for your speeches. He also usually lets the class out a little early.", "rating": 5, "expected_grade": "A", "created": "2022-01-04T11:50:44Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Super chill professor. Lectures are informative and entertaining. 10/10 would take again. Quizzes are worth a lot of your grade but aren't worth many points so definitely need to do all the readings. Other than that his grading on speeches is very reasonable and class activities are engaging and fun.", "rating": 5, "expected_grade": "A-", "created": "2022-01-25T04:06:46Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Overall, Dunning is a great choice for INAG 110. He's super laid back and will be pretty entertaining. He actually cares about teaching so he'll infuse the lectures with his personality but he is very chill with grading. Make sure to prepare your speeches ahead of time and write it exactly to the rubric but other than that, you'll really be fine. \r\n\r\nVery important: The reading quizzes are super valuable and have very few questions so you really can't mess them up. I bombed a couple and fumbled an A in this class, don't repeat my mistakes. Do the reading, use quizlet, just make sure to get perfect scores on those reading quizzes and the rest will fall into place. This class isn't a lot of work, just nail the quizzes, be passingly engaged in class, be competent in your speeches, and everything will be ok.", "rating": 4, "expected_grade": "A-", "created": "2022-12-22T02:05:16.621231Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Very chill professor. His chapter quizzes are kinda annoying because it means you can't skip class, but they're pretty easy and straightforward. The midterm and final are basically the same as the chapter quizzes but, just, longer; be sure to study for them using Quizlet, though. His lectures are pretty fun and entertaining, but that said, there's some content he covers that you just don't need for any quizzes or exams, so be sure to actually read the textbook.  As for speeches, he's a very lenient grader, so long as you look at the rubric and specifically tailor your speech to them.", "rating": 5, "expected_grade": "A", "created": "2022-12-24T00:42:16.467289Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Absolutely baller professor. Grades very lightly on speeches (there are 3). Please take him.", "rating": 5, "expected_grade": "A", "created": "2023-05-15T23:05:44.773923Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "super chill. Chapter quizzes on canvas but he provides the textbook and the quizzes are open note and you can retake them, plus they are only due by the end of the semester. Other than that three speeches (plus a short intro-get-to-know-me like 2 minute thing at the beginning). grading is very realistic and his lectures are actually really entertaining. would def recommend. no final or midterm.", "rating": 5, "expected_grade": "A", "created": "2023-11-09T15:31:36.055599Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "I loved INAG110 with Dr.Dunning. Though the class is lecture-based, taking notes is not required since the majority of the learning is done through practicing the different speech structures you'll learn in class. Dr. Dunning is hilarious and finds ways to apply all the concepts in the course to our daily lives. This class is an easy A (so long as you \"don't reinvent the wheel\" and follow the rubric). This semester the final was a video you could pre-record where you explained how to give a speech. I loved this class! It's my favorite gen-ed yet!", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T16:12:21.460670Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Like many other reviewers, I have to say that Dr. Dunning's lectures were very engaging. His class was also pretty easy. There were three speeches, an introduce-yourself talk (free points), a final project (explain how to write a speech), and open-book quizzes on Canvas (no due date, and you can take 'em twice.) If you're naturally confident and like public speaking, this is an easy A. It took me about a hour and half to whip up each speech and only minimal practice to deliver them. If you're newer to public speaking, I would still highly recommend Dr. Dunning's classes--there's a lot of practice speaking spontaneously in classes, and he is very helpful in office hours as a sounding board for your speeches. Plus, the speeches are graded pretty leniently as long as you adhere to the structure he teaches in class and the rubric he gives you.", "rating": 5, "expected_grade": "A", "created": "2023-12-19T15:24:32.639014Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "This was a pretty easy class and attendance was not mandatory. He provides a clear rubric to follow, and everyone pretty much gets a 90-97 on every speech (based on canvas highs-lows). He said that \"mandatory\" class activities factored into our final grade, but I don't think he ever ended up putting them in. It's still nice to go to class and hear his lectures/participate in activities because they tend to be fun and he gets to know you better (and might give you a higher speech grade if he recognizes you).", "rating": 5, "expected_grade": "A", "created": "2024-01-13T20:00:19.249945Z"}, {"professor": "Eric Dunning", "course": "INAG110", "review": "Prof Dunning is the best. He makes his lectures fun and engaging. He grades relatively lightly on the speeches. Easy A. Take him if you can.", "rating": 5, "expected_grade": "A", "created": "2024-03-01T01:20:33.403975Z"}], "name": "Eric Dunning", "slug": "dunning"}