{"courses": ["ECON414", "ECON401", "ECON200", "ECON465", "ECON181", "ECON181", "ECON354", "EDCP108I", "ECON200", "EDCP108I", "ECON354", "ECON200", "EDCP108I"], "average_rating": 3.8333, "type": "professor", "reviews": [{"professor": "Erin Moody", "course": "ECON200", "review": "Gives a lot of opportunities for extra credit and posts slides/practice exams online. Everything on the exam is in the slides and lecture. \r\nShe says to read the slides before class, but it's useless since she just reads the slides and draws a graph. No new information is given in lecture - there's extra credit in class though. \r\nShe uses LearnSmarts - so don't bother reading the textbook more than highlighted portions online. You don't need a physical copy of it. \r\nHer voice is annoying and the class is kind of boring. Make sure you're in the class group chat. ", "rating": 4, "expected_grade": "", "created": "2018-06-24T16:44:14Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "I really appreciate her bubbly personality that comes out during her lectures.  The material is dry but she conveys it well and offers plenty of assistance.  She drops a few of your lowest grades in assignments st the end of the term to help people out.", "rating": 5, "expected_grade": "B+", "created": "2018-10-18T18:31:39Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Great teacher, very understanding and explains material well", "rating": 5, "expected_grade": "", "created": "2019-05-13T22:15:18Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "classes were boring, reads from the powerpoints, exams are impossible to study for ", "rating": 1, "expected_grade": "B+", "created": "2019-12-17T22:44:50Z"}, {"professor": "Erin Moody", "course": "ECON181", "review": "So fun and bubbly in lecture. Made discussions optional a bunch of times, usually an extra credit opportunity if you do go. Midterm and final are fine if you look through the slides which she posts.", "rating": 5, "expected_grade": "A", "created": "2019-12-18T03:48:51Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "I came to her ECON200 class after being academically dismissed from UMD for 2 semesters, I had doubts in me and in the beginning of the semester I already planed to get a B for the class. But nope, Dr. Moody and her personality has made the dry material wayyy more fun to learn, except the Game Theory which I found it to be very entertaining to learn. It is quite IMPORTANT that you do those pre-lecture SmartBook assignments. I usually just do them right before the class starts because I'm lazy as f. But I think these SmartBook assignments are more important than the after class HW and gave a good general understanding for incoming lecture, it usually takes me less than a hour to finish them and she already highlighted all the important stuff on the assignment's reading part, just take notes from the highlighted paragraphs and bring them to lecture then you would find yourself follow her lecture drastic easily. Her mob lab extra credits are easy points to get if you follow my previous advice. And GSS sessions are also helpful btw especially before the exam. Her midterms are not hard at all if you do her practice exams, I mean literally we had 2 graph problems that we need to do ourselves then the next 30 or so questions are just multiple choices, and I appreciate she often do not test us on those controversial and theoretical questions. She is very reachable after class and have confidence in yourself, I'm writing this as I'm holding a 1.7 cumulative GPA, this class is not hard compare to other science courses I had at UMD, there is no nasty number and confusing formulas that you need to memorize, a good understanding of the demand and supply curve is sufficient enough. ", "rating": 5, "expected_grade": "A", "created": "2021-04-22T09:01:57Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Great teacher, explains concepts well, paces the content well and creates fair exams. For all her exams she makes practice tests that are very similar and give you practice for the content. She is very generous and drops some of the lowest assignments. She also provides extra credit opportunities which can increase your grade past 100. (great buffer for the tests/final) Additionally, this semester she has decided to make the final not cumulative which is awesome. Only real \"complaints\" would be that the exams have a high weight but this is college so nothing surprising there!\r\n\r\nIn terms of the biggest pro I would say is her energy, always comes to class excited and ready to teach. Very responsive to students and always happy to be in the classroom (even though its just zoom)", "rating": 5, "expected_grade": "A", "created": "2021-04-29T22:26:23Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Prof moody is always all over the place. Lectures were optional for attendance online but going to them made me more confused than I would be before attending the zoom. It was a lot of busy work and all assignments were through McGraw hill connect which I hate. Although the class sucked and I feel like I learned nothing it was still easy to get an A since most of the grades are through the chapters (you get a 100% if you complete it) and the HW which you get 2 attempts on. If you have the option take a diff prof.", "rating": 2, "expected_grade": "A", "created": "2021-05-10T18:42:40Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Class was easy but boring. I only went to two class meetings. Class requires McGraw Hill materials which you have to pay for. Major grades are two midterms and a final. Also small quiz-type assignments every week or so based on reading. Just read the textbook, take good notes, do the assignments, and you should be fine.", "rating": 3, "expected_grade": "A", "created": "2021-05-25T22:20:00Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Dr. Moody did the best she could with this class considering there were 300 people in my section alone. For anyone reading, my best advice is not to worry about the professor but GO TO GSS MEETINGS! They are the only reason I passed this class.", "rating": 4, "expected_grade": "B+", "created": "2021-06-16T22:02:09Z"}, {"professor": "Erin Moody", "course": null, "review": "The class was pretty easy with a small background in economics and Professor Moody did nothing to make it harder. A fun personality she is not an outstanding teacher but I had nothing wrong with her. Passionate about what she teaches and responded to emails. Never taken attendance but have clicker questions occasionally that sort of act as attendance. Overall would recommend Econ 181 with Moody not a hard course and an interesting Topic. The TA's were good people but did very very hard to understand. Many people never or rarely went to discussion sections.", "rating": 4, "expected_grade": "A", "created": "2021-12-02T16:54:43Z"}, {"professor": "Erin Moody", "course": "ECON181", "review": "I absolutely love Dr. Moody. She is so fun and definitely has a lot of energy. She clearly has a lot of interest in what she's teaching and she's extremely passionate. Her grading system is very forgiving and you can tell that she wants to help you and give you a good grade. ", "rating": 5, "expected_grade": "A", "created": "2021-12-02T17:53:11Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Nice woman but honestly not a great professor. She constantly says confusing things in lecture and explains things differently than the way the book does which gets really confusing. Also, mcgraw hill sucks", "rating": 1, "expected_grade": "C+", "created": "2022-04-07T01:53:35Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Dr. Moody gives out a lot of extra credit, and as long as you study/do your homework, you should be able to do well on the exams. She is super passionate about the subject and always connects what she's teaching to real world examples which is very interesting and helpful for studying. Go to the GSS sessions, they're super helpful for studying. ", "rating": 5, "expected_grade": "", "created": "2022-04-07T17:24:48Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "She is very nice and energetic in lectures and obviously knows and cares about what she is talking about. She made lectures optional all semester and recorded them on zoom while simultaneously holding them in person. She gives extra credit throughout lectures (In the grand scheme of things it only accounts for around a 1% bonus in your final grade so it's not much) The class is VERY test-heavy, making up75% of the grade and the other 25% being LOTS of hw assignments. She had a change of heart this semester and made the tests open-note and you can bring any old practice exams to help. This is honestly the reason I have an A in this class because I only study the day before an exam. Go to class and go to lecture however, hundreds of students this semester are idiots who skip class or never attended in person and complain to her about them failing their exams when she honestly is a good teacher.", "rating": 5, "expected_grade": "A-", "created": "2022-04-08T04:09:04Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "She's nice but hard to learn from. I would recommend taking this somewhere else or from another professor... 3 exams including the final, online hw assignments, gss leaders are not very helpful ", "rating": 2, "expected_grade": "C-", "created": "2022-05-04T22:28:36Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "if you want to do well: go to lecture, read the chapter before you complete the smart book assignments, and go to gas (even if only to prove to yourself that you know everything). lots. of zoom options. even though exams (3 of them) are 75% of your grade, they aren't all weighted evenly which is nice. moody is an upbeat person, but an overall average professor.  ", "rating": 4, "expected_grade": "A", "created": "2022-05-16T17:20:11Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "This class is mandatory for GVPT, business, econ, and public policy majors, so a lot of people don't want to do this class, so at least for my semester, she curves the exams. There are 3 exams worth 75% of the grade, but she weighs the lowest scoring one as 18%, middle as 25%, and the highest as 32%. The last test is cumulative, but it focuses mostly on the stuff she teaches after the 2nd exam. The other 25% of your grade should be free points, but its a lot of work. You  could attend her classes physically or virtually, and she records them in case you don't want to come. She gives extra credit, but it doesn't really raise your grade by that much, probably 1%, but if you know you're going to struggle, just go to her lectures and do it. ", "rating": 3, "expected_grade": "A", "created": "2022-05-26T20:40:42Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "She is really kind but really bad at explaining concepts. it kind of seems like SHE is confused sometimes. mcgraw hill is terrible and its hard to learn in this class ", "rating": 1, "expected_grade": "", "created": "2022-06-23T14:30:48Z"}, {"professor": "Erin Moody", "course": "ECON181", "review": "Dr. Moody is so passionate about what she teaches which makes all the difference in her class. She is excited, kind, and super willing to help whenever she can. I find that she does a good job at going over concepts and giving examples. She is knowledgeable and I recommend taking her if you get the chance.", "rating": 5, "expected_grade": "A", "created": "2022-11-11T15:40:04.232962Z"}, {"professor": "Erin Moody", "course": "ECON181", "review": "Dr. Moody is incredibly passionate about economics, and this fun i-series is a great basic introduction to environmental economics, even if you don't know anything about economics. She tries to make the concepts understandable and explains how they are connected, bringing in lots of real-world examples to get the point across. She is very open to questions and is willing to let everyone understand. The class wasn't too hard, only big annoying grade is a final presentation but it is certainly manageable.", "rating": 5, "expected_grade": "A", "created": "2022-12-18T01:49:04.872010Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Horrible horrible horrible horrible lecturer. Take this class online at community college, you won't be disappointed. It will transfer and you won't have to sacrifice your mental sanity or gpa. This class is literally a gen ed there's no reason to spend money taking it at umd when you can do it cheaper at community college.", "rating": 1, "expected_grade": "", "created": "2023-01-06T00:47:48.046650Z"}, {"professor": "Erin Moody", "course": "ECON181", "review": "Super passionate professor that keeps you engaged in the class. It honestly wasn't that time-consuming besides the final project. Would recommend taking this class!", "rating": 5, "expected_grade": "A-", "created": "2023-01-21T04:53:41.286923Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "I did not enjoy learning from Moody. I wish I took this pre-req course at a CC and transferred over. She is really nice but omg I have never struggled so hard in a class to learn from a professor.", "rating": 2, "expected_grade": "C-", "created": "2023-02-18T05:49:27.085181Z"}, {"professor": "Erin Moody", "course": "ECON181", "review": "Great class, but over 50% of the grade comes in the last week of the semester (final exam, final project). Moody is super sweet, and the course was pretty easy.", "rating": 5, "expected_grade": "A+", "created": "2023-04-19T16:53:23.892317Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "I am currently in this class. \r\n\r\nPlease don't believe this class is easy or anything. It is actually pretty tough. I thought it would be an easier class, but that is wrong. \r\n\r\nSome people act like this is easy and if you don't get an A in this class then you are just stupid and it is all your fault. \r\n\r\nThe guided study sessions are ALWAYS overcrowded and the environment isn't the way they make it seem. \r\n\r\nIf you know someone in the class, then please study with them. I don't know anyone, so most people is hostile and stay in their cliques. \r\n\r\nI am giving it 3 stars because the professor is nice and she lets you attend sessions on Zoom (like I am currently doing)\r\n\r\nAlso, I know that there are many classes and many professors that are worse than this one. \r\n\r\nI will post an updated review when I am closer to the end of this.", "rating": 3, "expected_grade": "", "created": "2023-10-05T14:49:08.337046Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "I would give 6/5 if I could. My favorite professor I have had here, if you get a chance to take her, do it. She teaches for her students to understand and it shows. She explain things in ways they make sense. GO TO OFFICE HOURS!! She will explain everything again over to you and she is the most helpful prof for office hours. Take her!!", "rating": 5, "expected_grade": "A", "created": "2023-10-30T19:48:53.499894Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Absolutely love her! Prof. Moody is incredibly sweet and you can tell she genuinely cares about her students. She is always willing to accommodate for students and make sure they understand the material. I haven't gone to her office hours but heard she explains concepts in-depth to students to ensure they succeed and I believe it because she already does that in class. I personally wasn't a huge fan of the GSS which is why I'm giving a 4/5 because I just didn't find them that helpful as they're crowded and mostly individually paced so there wasn't much \"guiding\" tbh. \r\n\r\nI would say that coming out of high school having taken AP Econ, I definitely had an advantage. Prof Moody posts practice exams and they're pretty much exactly like what you should expect on the real one. On our first midterm, one of the FRQs was basically identical to the one on the practice (with a different scenario of course but the concepts/questions were the same) so definitely use the practice exam. \r\n\r\nThere are SO many resources available to you. The practice exam, posted slideshows from class with annotations, posted recordings of lecture, and of course the guided study sessions. I also highly recommend Jacob Clifford on YT, he helped a lot for last minute studying because I find it difficult to not zone out during lecture. She allows for you to join lecture through Zoom and there's opportunity for a tiny bit extra credit if you get the clicker questions right. Just go to lecture, review materials, do the practice exams, and you'll be more than okay! She's a great professor who only wants you to succeed.", "rating": 4, "expected_grade": "", "created": "2023-11-16T14:57:34.935362Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "content is easy, the lectures are pointless, you only go for the attendance points. She is very nice and helpful", "rating": 4, "expected_grade": "A", "created": "2023-12-05T21:38:40.148496Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "She's okay. For a person who doesn't understand econ at all, she does an okay job. No extra credit except clickers.", "rating": 3, "expected_grade": "B-", "created": "2023-12-06T03:55:54.277252Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Dr. Moody is absolutely amazing! Probably the best professor I have ever had. Her lectures are not boring at all and her lessons and teaching style are so clear and understandable. She records lectures, so whenever you feel like you didn't understand something, it is so helpful to rewatch them. If you watch the lectures and do the homework, you will be absolutely fine! Her practice exams are SO similar to the real ones. She allows a full sheet of paper front and back on the final. She is very understanding. Nothing but good things honestly. Will report back after the final though.", "rating": 5, "expected_grade": "A", "created": "2023-12-07T23:49:43.207186Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "TAKE HER!! She is the most amazing, helpful, and engaging professor you will find. Econ is a hard class, but she makes it doable. Anytime I didn't understand something I went to office hours and everytime it was so helpful, best office hours I've had by far. Wish I was an econ major just to take her as a professor again. Teaches for her students to actually learn and understand. Wish I could rate 6/5.", "rating": 5, "expected_grade": "A", "created": "2023-12-16T00:30:37.836996Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Pros:\r\n-She is an extremely energetic lecturer and is never dull\r\n-She does clicker questions during class which give you 100% credit if you get them wrong and 125% credit if you get them right, meaning that you can get a few overall percentage points in extra credit if you participate and go to class\r\n-She gets exam grades back to you fairly quickly\r\n-There is not a lot of homework and the smartbooks and HW can be knocked out in usually 30 minutes\r\n-She gives you 4 attempts on the HW meaning that it is basically impossible not to get a 95%+ on them\r\n-She drops the lowest 3 smartbook and HW assignment grades\r\n-She curved the first midterm by 7% because the class average was too low\r\n-She posts the slides with her annotations on ELMS meaning that you can go back and look over them to study or if you missed a class\r\n-You can also attend class on zoom rather than in person\r\nCons:\r\n-Her practice exams are imo easier than the real exams and on her actual exams she puts a lot of questions that involve picking more than one option or includes none of the above which I find a bit annoying\r\n\r\nOverall she is a very solid professor and a great choice for ECON200. I feel like a lot of the older reviews are oddly harsh on her as I personally have not had any negative experiences with her or the class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-16T02:48:00.270729Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "Dr. Moody is a great professor that wants her students to succeed. She is a great lecturer and makes sure to answer questions so that students understand the content. She even provides her slides and practice tests to students to help them study. The class wasn’t too difficult, but you have to stay on top of the material since there are a few exams. But I would recommend taking Moody if you need to take ECON200.", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T17:48:39.508394Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "She comes off as very energetic, almost too energetic for my liking. The beginning of this course was fine, as the material was far easier but once we really got into it I felt like there was a lack of explanation and reasoning when she did something. On top of that, when someone asked a question, it felt like she confused the person more than they originally were or said something along the lines of \"let me get there in just one second\", though I felt like she never actually got there at times. As for the GSS's, they were also fine at the beginning of the year when they were smaller and more personally focused but eventually, they just got way too big and the TA would just end up giving out a test for you to do where you could ask questions. I'm never one to turn down extra test preparation but it wasn't really what they were advertised as and I expected more thorough evaluations of each topic rather than just quizzing us on it. Can't fully blame her because she offers Zoom for lectures and I got lazy halfway through the year and lost focus going to those but definitely a rougher course than I had imagined.", "rating": 2, "expected_grade": "C+", "created": "2023-12-21T23:08:43.806609Z"}, {"professor": "Erin Moody", "course": "ECON200", "review": "When I was picking my ECON200 professor, I was a little hesitant to choose Professor Moody since her initial rating was a little low. But I am here to say that Professor Moody is hands down the BEST microeconomics professor! I absolutely loved Professor Moody and you could tell she genuinely enjoyed teaching econ. She teaches the information in a way that is not extremely boring, which made lectures somewhat fun. Her exams are extremely fair and are sometimes curved; she also posts practice exams and answers to help prepare (definitely recommend doing them!). She gives a lot of smartbook activities and homework’s, which seem annoying at first, but they really help boost your grade. She also does clicker questions which are great opportunities for extra credit. You can definitely tell that she cares about her students and genuinely wants us to enjoy the content. Overall, take Professor Moody for ECON200! I wish she was teaching macro so I could have her again. I totally recommend!", "rating": 5, "expected_grade": "A-", "created": "2023-12-24T18:22:15.806962Z"}], "name": "Erin Moody", "slug": "moody"}