{"courses": ["PHYS276", "PHYS260", "CHPH618", "PHYS778", "PHYS270", "PHYS272", "PHYS272H", "PHYS778", "PHYS270", "PHYS778", "PHYS778", "PHYS171", "PHYS270", "PHYS778", "PHYS171H", "PHYS171", "PHYS171H", "PHYS778", "PHYS270", "PHYS778"], "average_rating": 2.7143, "type": "professor", "reviews": [{"professor": "Eun-Suk Seo", "course": "PHYS270", "review": "I'll admit I didn't attend most lectures. She talked really quite, so combined with her accent, it made it difficult to follow lectures. She lectures from slides which I'm not usually a big fan of but that's just my preference. Homework's were done online with expertTA and were fairly easy, and would help reinforce concepts with easy questions that tended to lead to somewhat more challenging questions. However her tests were quite a bit more difficult than the homework's, and would sometimes test on material not found in the homework which I found difficult to study for. There were review worksheets which were somewhat helpful, however. The key to this class is a good equation sheet. Really try to cover your bases because one obscure missing equation can really trip you up in an exam. Overall not bad I just wasn't super impressed by the way the class was set up, but it is still completely possible to do well in this class and get an A.  ", "rating": 3, "expected_grade": "B+", "created": "2021-12-25T15:07:15Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS171", "review": "Dr. Seo is really nice and her class is not hard to pass at all. There are 3 exams total, and your lowest grade is dropped completely. There are also weekly quizzes, but they are completely optional and worth extra credit. However, when it comes to teaching, Dr. Seo's teaching can get very confusing as she overcomplicates topics and when she writes on the board, it is an incomprehensible mess. Her accent is not hard to understand at all, and she is loud enough in my opinion. On exams, there are some major points of disconnect between what her/the TA write and the assumptions we believe we can make based on how the exams written. The homework assignments are also decently hard. Overall, if you have a good group to study with, attend discussions, and ask questions, your grade will be fine. But having a good study group is CRUCIAL. I also think she is harsh and blunt with how she talks to people at times, like if you ask a question she thinks you should already know or if you give a completely wrong answer, she will let it be known and make you feel dumb for it--which I really did not like. But she really does try to be nice throughout the course. If you have a better option I would say take it but if not, you are in decent hands with Dr. Seo and will learn what you need to.", "rating": 3, "expected_grade": "A-", "created": "2023-05-02T23:21:23.024039Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS171", "review": "I didn't like her lectures, because she lectures from slides and is very rushed and all over the place on her chalkboard. The chalkboard was on the side of the projector and she would start writing tiny when she was running out of space, instead of just erasing unnecessary stuff, or just getting ride of the board altogether. \r\n\r\nOn the other hand the first two exams are beyond easy, and 1 out of three exams gets dropped. So even though class average on the 3rd exam was a 57, the other two had averages in the 80s and since I took 2 years of physics in high school, the topics were familiar and easy to navigate. \r\n\r\nHer attitude after the 3rd exam was also a little off: She suggested that we just had been slacking off which was why the average was low. No we weren't, it's just a much harder topic and her lectures were never good but when its an unfamiliar topic and awful (even worse than before because it's more nuanced) lectures about it, that is going to reflect in the grades. \r\n\r\nThere were a few instances where she got irritated at people asking questions which confused her and she started yelling about how they don't know what they're talking about. \r\n\r\nThe TA was wonderful and her discussion and office hours is helpful. \r\n\r\nI also recommend taking PHYS172 with it (1 credit pass fail course which is just an extra 171 lecture), the professor Shawhan is a great additional once/week lecture and was in my opinion much more helpful than Dr. Seo. \r\n\r\nShe's such a sweet, funny lady so it pains me to say this, but I hope she can improve her lectures in the future.", "rating": 2, "expected_grade": "A", "created": "2023-05-05T00:58:54.472703Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS171", "review": "Dr Seo is living proof that being a good person and a good researcher does not under any circumstances make you a good professor. Seo’s lectures were borderline incomprehensible and her TA was almost hilariously harsh on grading. The only silver lining is once you get through that, the class is very very easy. However, this was going to be a 3 star review until the final. We don’t get practice tests, so we were counting on it being somewhat like the midterms. It was not. The final was full of questions that were either borderline impossible or we just did not learn. Dr Seo is a very sweet person and clearly loves her students, but her class simply does not reflect it.", "rating": 2, "expected_grade": "B", "created": "2023-05-21T17:56:02.208417Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS171", "review": "Lectures were incomprehensible. Its only phys171 but the drawings she wrote on the board looked like they were from a 400 level class. I only got an A because I was able to get through the first two midterms with prior knowledge. On the bright side she is very nice and has an easy grading policy with your lowest midterm being completely dropped.", "rating": 2, "expected_grade": "A-", "created": "2023-06-25T20:41:51.147756Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS270", "review": "I don't know why Professor Seo has such bad reviews. I was worried about this class at the start of the semester, but she has done a great job teaching it. She's very smart so sometimes she does gloss over topics that should be explained a little more but overall she does a great job preparing us for exams. Overall I'd say her class is very fair and there's reason to avoid her as a professor.", "rating": 5, "expected_grade": "A-", "created": "2023-11-15T02:35:07.951372Z"}, {"professor": "Eun-Suk Seo", "course": "PHYS171", "review": "lectures generally not helpful at all. Any prior knowledge can grant a easy pass. if you had ap physics it will be a easy A+, otherwise it is very hard to say. Dr Seo is a fine professor, answers questions and does office hours as fine professors do. on the other hand, there are two things considered significantly downside: 1, class participation through a scan bar code and vote on google form, kind of need to exist there in class (slight portion on grades, does not matter that much); 2, the TA grades the written homework (expertta hw but also need to submit written process) harshly to the content of not exactly making sense (worse than high school rubric), tried very hard on deducting points.", "rating": 2, "expected_grade": "A", "created": "2023-11-15T17:49:00.543039Z"}], "name": "Eun-Suk Seo", "slug": "seo_eun-suk"}