{"courses": ["AASP200", "AASP310", "AASP299T", "AASP398Z", "AASP399", "AASP100", "AASP100H", "AASP100", "AASP100H", "AASP200", "AASP200", "AASP398P", "AASP100", "AASP100H", "AASP200", "AASP310", "AASP100", "AASP100H", "AASP200", "AASP398P", "AASP100", "AASP100H", "AASP200", "AASP398Z", "AASP100", "AASP100H", "AASP200", "AASP398P", "AASP100", "AASP200", "AASP310", "AASP479"], "average_rating": 2.6667, "type": "professor", "reviews": [{"professor": "George Kintiba", "course": "AASP200", "review": "Dr. Kintiba is very unorganized and confusing. He would present the material in class very poorly, and expect everyone to remember all of the tiniest details from 30 pages of reading on the quizzes. He deviates from the syllabus often, adding and dropping assignments. He even added a quiz less than 24 hours before we took it. He seems to grade assignments with no rubric as it is almost impossible to get a 100 on anything, including simple summary homeworks. Theres next to no feedback on mistakes, specifically  Don't let the grade spread fool you, take another humanities elective. ", "rating": 1, "expected_grade": "A-", "created": "2019-12-03T23:51:02Z"}, {"professor": "George Kintiba", "course": "AASP200", "review": "Worst professor ever. Took this because the grades were high on this website but do not be fooled he is the worst teacher ever. So much unnecessary work, he is arrogant and his style of teaching is just calling on random people all class then lecturing. for 10 minutes.", "rating": 1, "expected_grade": "A", "created": "2020-04-16T22:32:31Z"}, {"professor": "George Kintiba", "course": "AASP200", "review": "Not sure how the reviews are so bad. Kintiba is very knowledgeable and really helps students learn concepts. This was one of my favorite classes freshman year. I also found it easy to get an A. This class was really eye opening and one I wont forget.", "rating": 5, "expected_grade": "A", "created": "2020-11-30T19:24:16Z"}, {"professor": "George Kintiba", "course": "AASP200", "review": "I took AASP200 for the fall term while there is a pandemic going on. Do not even hesitate to take his class y'all!!! He is the sweetest, nicest, caring, and cool professor. It is not hard at all. You. will also truly learn a lot. I do not recommend skipping his class, you might think it is boring, but it's worth it. I would no doubt retake his class, really no words can describe how great of a professor he is. ", "rating": 5, "expected_grade": "A-", "created": "2020-12-14T18:38:10Z"}, {"professor": "George Kintiba", "course": "AASP200", "review": "I see these negative comments, and I can KIND OF see where they are coming from. Dr. Kintiba is a very knowledgeable professor and with that he makes an accurate and effective class. I do feel as though some things kind of go to his head, but he does not come off as that arrogant professor who is only there for a paycheck and research. Overall, I found his teaching style to be effective. He clearly has a specific lesson plan that he goes by. At the beginning of the semester he spends time reviewing the map of Africa(learn everything about the map. Don't  choke, like me, when he calls on you), and then he gets into the actual material. \r\nThere seemed to be a lack of organization when it came to our assignments, and he straight up ignored a few of our assignments, granted he had family problems going on during the semester. I highly recommend taking his class, but only if you can handle reading and \"pop-quizzes\".  ", "rating": 4, "expected_grade": "A", "created": "2021-12-08T14:42:58Z"}, {"professor": "George Kintiba", "course": "AASP200", "review": "take this class! he's the nicest professor and very understanding, makes the content we learn so interesting, and it's not very difficult, just pay attention during lectures and you'll be good. would definitely take again. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-09T05:52:40Z"}, {"professor": "George Kintiba", "course": "AASP200", "review": "He is very knowledgeable, and his class was interesting. However, his assignments/quizzes are all over the place and often pretty unclear in what he is looking for. He also expects people to remember the tiniest details from lectures/videos that are over an hour long.\r\n\r\nTLDR; If you are interested in the material and learning, he can be a good professor. If you are just looking for an easy Gen-Ed, look elsewhere.", "rating": 2, "expected_grade": "A", "created": "2022-09-27T02:08:20.619882Z"}, {"professor": "George Kintiba", "course": "AASP100H", "review": "The teacher is very disorganized and does not present good guidelines for assignments. Calls on students randomly and expects detailed expert answers. Expect students to fully understand and remember all specific details about the readings. Fails to let students know what is essential for readings and does not set up students for success.", "rating": 1, "expected_grade": "A", "created": "2022-09-29T16:02:48.096128Z"}, {"professor": "George Kintiba", "course": "AASP100H", "review": "Let me preface this with I enjoyed sitting in his class. But he is so incredibly disorganized. His quizzes are based on parts of the class that was barely touched on and question-wording was confusing. He does not communicate what is going on. His TA did not respond to a few of my emails. If you talk semi-frequently in his class he will adore you though, especially in the beginning few weeks.", "rating": 1, "expected_grade": "A", "created": "2022-12-05T18:41:36.712925Z"}, {"professor": "George Kintiba", "course": "AASP200", "review": "Dr.Kintiba is very knowledge, but is not organized at all. He did not follow the syllabus at all this semester, and his quizzes/tests are all over the place. He randomly calls on students in class and expects detailed answers. I some what enjoyed learning about African culture, but he made it very difficult to want to be in class.", "rating": 2, "expected_grade": "A", "created": "2022-12-07T04:25:15.839803Z"}, {"professor": "George Kintiba", "course": "AASP200", "review": "By far one of the best professors I've had! He's super nice and he really cares about all of his students. He does map quizzes and assigns a fair amount of reading, but if you pay attention to the main ideas he points out in class, his class isn't hard. His final is in groups, and is pretty easy. Even if you think you're doing bad, you'll still pass with a fairly high grade. Just take good notes in class and you'll be fine.", "rating": 5, "expected_grade": "A+", "created": "2023-04-24T02:49:59.035931Z"}, {"professor": "George Kintiba", "course": "AASP200", "review": "Dr. Kintiba is a nice man and generally a good lecturer but he is extremely disorganized. He canceled over 10 classes this semester, many of them late the night before or as early as the hour before class started. He had a lot of personal things going on which may have contributed to this but it was frustrating at times. He always goes over class time, every time, and it is frustrating, especially for someone who has a class right after. He is not respectful of students' time, is unclear about when assignments are due, assignments are worded poorly and are often very confusing, he never provides a rubric, and his feedback is often on grammar and not sustenance. I rarely got a response from his emails and would have to ask him in class or at another time. He is a nice enough man, and is understanding about turning in assignments late, but he is so disorganized and unclear that it detracted from the learning experience.", "rating": 3, "expected_grade": "A", "created": "2023-05-08T17:21:18.248693Z"}, {"professor": "George Kintiba", "course": "AASP100", "review": "The class is easy to do well in because exams are online, but there are a lot of assignments for this class. The class has two papers, a group project, and like 5 exams. Once again the exams are online though so they are not bad. The class is super boring but I am doing well in it and if you need a diversity credit it is not a bad option.", "rating": 4, "expected_grade": "A", "created": "2023-12-01T20:41:06.130531Z"}, {"professor": "George Kintiba", "course": "AASP200", "review": "Easily the worst class I've ever taken. Professor is arrogant and won't hesitate to laugh at you when you get a question wrong. He calls on people randomly, you have 6 papers, 4 map quizzes, 6 exams (questions are short essays), and the final is a group oral presentation and you don't get to bring notes. Final is also on the last day. His questions on exams also don't make sense. Oh and the \"map\" quiz is not an actual map quiz. If you think its just labeling the countries and rivers you are sadly mistaken. Don't make the same mistake I did and take this class. It is so bad.", "rating": 1, "expected_grade": "B", "created": "2023-12-12T21:35:58.121663Z"}, {"professor": "George Kintiba", "course": "AASP200", "review": "This was the most disorganized and overall worst class I've taken at UMD. He's strict about deducting points for grammar but his slides are filled with grammatical mistakes. His slides are just huge, unhelpful paragraphs too. Never responds to emails. Gives very unreasonable assignments like \"summarize this entire book in 3 pages\". He's knowledgeable but he sometimes teaches things you can't even find google. Takes attendance very very serious yet he constantly cancels his own classes last minute, and he almost forgot my group needed to do a presentation. At the end of the semester, we filled an entire conference room of students who needed to talk to him about various problems. I don't think he's evil, but his teaching style feels outdated, just constant cold calls that are just memorizing random facts.", "rating": 1, "expected_grade": "A-", "created": "2023-12-13T04:21:06.567113Z"}, {"professor": "George Kintiba", "course": "AASP100", "review": "Undoubtedly, this professor takes the title as the most appalling educator I've ever encountered. The workload is nothing short of a Herculean task: imagine grappling with six exhaustive papers, navigating through four grueling exams comprised solely of short essay questions—this doesn't even account for the midterm. As if this wasn't enough to fray the nerves, the final exam is an unforgiving group oral presentation, executed without the slightest aid of notes. To add insult to injury, the professor not only grades attendance but also finds amusement in students' mistakes, openly laughing when a question is answered incorrectly. Assignments are prematurely graded, often before their due dates, and the introduction of new assignments is so abrupt that they're handed out on the very day they're due. This teaching approach is nothing short of a pedagogical nightmare.", "rating": 1, "expected_grade": "A-", "created": "2024-02-26T23:19:25.829752Z"}, {"professor": "George Kintiba", "course": "AASP100", "review": "Worst teacher at umd. DO NOT TAKE HIM!!", "rating": 1, "expected_grade": "B", "created": "2024-02-26T23:23:09.386830Z"}, {"professor": "George Kintiba", "course": "AASP200", "review": "easy just do the assignments on time it's not that hard, also i would go to office hours regularly and he is really lenient with everyone, just reach out", "rating": 5, "expected_grade": "A", "created": "2024-03-13T17:00:32.371224Z"}], "name": "George Kintiba", "slug": "kintiba"}