{"courses": ["INAG110", "INAG110", "INAG110", "INAG110", "INAG110", "INAG110", "INAG110"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "George Kurtzweil", "course": "INAG110", "review": "I hate public speaking but George is able to make class fun and relaxed. He also manages to make the content interesting. Great teacher and easy grader!!", "rating": 5, "expected_grade": "A", "created": "2019-09-19T23:03:03Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is pretty quirky but makes our class really fun and chill. Easy grader, speeches are the biggest grade but he gives out tons of other points with little writing assignments every week. Def take his class if you get the chance its the easiest way to get through that comm get ed", "rating": 5, "expected_grade": "A", "created": "2019-10-07T05:31:11Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "He is literally the most thoughtful human being ever and he actually cares about his students. Class was always engaging and I was so grateful to have had him for INAG110. Take a course with George!!!!", "rating": 5, "expected_grade": "A+", "created": "2019-12-18T13:52:33Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "TAKE THIS PROFESSOR! He is so nice and makes public speaking easy even though I hate it. He grades easy and is so fun. You will not regret taking this for you OC gen ed.", "rating": 5, "expected_grade": "A", "created": "2020-01-27T04:21:29Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "I thought this class was going to suck but George actually made it fun. Fair grader and super nice guy", "rating": 5, "expected_grade": "A+", "created": "2020-05-15T19:02:38Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "Great teacher and very easy grader. The workload is also extremely light. Best way to get gen ed credit. ", "rating": 5, "expected_grade": "A+", "created": "2020-11-15T07:11:35Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "Very fun class, we didn't meet that often and it was a very light load. George is also a very fair teacher.", "rating": 5, "expected_grade": "A", "created": "2021-01-11T22:24:42Z"}, {"professor": "George Kurtzweil", "course": "INAG110S", "review": "Amazing and chill professor. Tells a lot of good stories and is super friendly. Easy and fun class. A must take professor. ", "rating": 5, "expected_grade": "A", "created": "2021-04-04T00:10:18Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "He is a must-take for this course. He made every class engaging while still holding us to a standard. He is also very chill about most things. Definitely recommend his course!", "rating": 5, "expected_grade": "A", "created": "2021-12-02T01:35:27Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "I really enjoyed taking this class with George. He is super chill, and managed to make the class super enjoyable! The class is not too much work either. I would definitely recommend that you get your communication gen ed credit with him!", "rating": 5, "expected_grade": "A", "created": "2021-12-07T20:26:40Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "Amazing teacher. I didn't think one of my favorite classes would be a subject I generally hate, but George made it really nice. He's super chill, super funny, and just generally makes class enjoyable. The workload for the class is pretty light, pretty much the only big thing is the actual speeches. There are some occasional reading checks that are basically free points. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-09T22:50:59Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is a very fun, kind, and relaxed professor. Our class always had a very light workload under him and for the few assignments we did get, he was a very fair grader (in my opinion, you'll really have to try to fail in order to get a bad grade in his class). Prof. Kurtzweil always let our class out early and was very understanding when it came to having to reschedule assignments.\r\n\r\nIf you have the option to, TAKE GEORGE KURTZWEIL!\r\nYOU WILL NOT REGRET IT!!!", "rating": 5, "expected_grade": "A+", "created": "2021-12-11T20:23:41Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is the best professor I've had this semester as a Freshman here at UMD. As long as you treat George with respect, he'll respect you. Not only is he hilarious, he's more than fair with his grading and wants to give every single one of his students a chance to succeed. \r\n\r\nIf you have to take INAG and can take his course, please do so. The workload is light and he is willing to work around YOUR schedule. Not many other professors are willing to make amends, especially if you missed a speech or need to move it to another day. He is one of the few professors that understands that we as students have our own struggles and schedules; his course bottoms out towards finals with practically no work. \r\n\r\nGeorge is a champ. You'll probably love his course if you take it, especially since he's so chill about everything.", "rating": 5, "expected_grade": "A+", "created": "2021-12-17T19:34:28Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is awesome! This class is definitely one you can BS your way through; very minimal work required besides speeches. In my opinion, he's a bit critical of speeches but overall a fair grader. He is also super understanding. I highly recommend taking George for INAG.", "rating": 5, "expected_grade": "A-", "created": "2021-12-18T01:25:19Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is great -- very chill, teaches with personality, makes expectations for speeches clear, and doesn't make the class any more work or more complicated than it needs to be. ", "rating": 5, "expected_grade": "A", "created": "2022-07-01T05:00:27Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "I probably don't even need to write much here; the other reviews sum it up pretty well. There are sometimes weekly textbook readings/quizzes, but these are mostly vocabulary, and they don't take long if you just have the book open while you do them. The speeches are the biggest part of this class. I'm usually annoyed by Gen-Ed type classes, but I think being able to speak in front of an audience is an extremely important skill, and throughout the semester I felt myself getting more confident for the speeches. With George, this class is very chill, and you'll probably make a new friend in class.", "rating": 5, "expected_grade": "A", "created": "2023-04-27T22:52:35.379961Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "If you're a student who just wants to get the oral communications gen-ed out of the way in the easiest and simplest way possible, George is your guy, no questions asked. Super chill and laid-back guy, and he understands that students don't exactly prioritize his class over their other classes. In fact, he does not even want you to expend a large amount of time to his class compared to, for example, hard STEM classes. George was more of a friend than a lecturer to his students, and he holds a great presence. All weekly assignments take no more than half an hour total, and the speeches are not even that hard to prepare for. The midterm and final are also absolutely nothing to worry about, and I mean that literally because I don't think anyone will study for that for anything more than 10 minutes honestly. Classes are not mandatory, but you might miss a participation grade or two if you miss a day on a group activity day. I feel like I only went to like 50% of the Friday classes in all honesty. If you do go to class, George does lecture well and straight-forward. Overall, this guy is the absolute best professor I've ever had.", "rating": 5, "expected_grade": "A+", "created": "2023-05-09T18:50:19.008698Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is the GOAT, no questions asked. So great, so chill, so many good stories. I felt comfortable in this class and really enjoyed it. Take George!!!", "rating": 5, "expected_grade": "A+", "created": "2023-05-15T16:00:20.633297Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "Amazing professor, makes class interesting and is the easiest A ever please do yourself a favor and take this man!", "rating": 5, "expected_grade": "A", "created": "2023-05-27T01:31:26.205622Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is a great professor and an even better person. He makes class entertaining and is an understanding professor. He knows that students have other priorities besides INAG110, so the workload is pretty light. The main assignments are 4 speeches throughout the semester. George is a fair grader and I definitely recommend taking comm with him, you won’t regret it and I actually looked forward to attending class because of him", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T01:52:30.432643Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is the goat. Laid back and barely spent much time preparing for speeches. Take George to get this gen ed out the way stress free", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T19:08:46.867480Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is an amazing Professor. He is very generous with grading speeches, and treats this class like the 100 level class its supposed to be. He builds good relationships with his students and creates a positive learning environment every day. There are four speeches which make up the majority of your grade, but if you practice you will be fine. George is there to help you overcome any anxiety you may have. Attending this class is genuinely enjoyable. Take George for this required Gen-Ed, trust me.", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T20:25:41.463419Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "I hate speeches, but love George. Ends class early often, and sometimes cancels. The lecture feels more like a conversation cuz it's so chill. Just practice your speeches a couple of times and you're good.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T07:07:47.099793Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "I loved George, and he was super laid back, the work was at times non existent for this class. Great guy, and made class fun. Please take him!", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T07:34:35.736310Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George was a great professor that actually cares about his students' wellbeing. Not only was he an understanding grader but he truly made you feel heard and supported. I would take him again if I could. He makes every class enjoyable and understands that students have heavy workloads. He responds to emails super fast and is really attentive in class. I felt like I actually learned how to be a better speaker without all the stress of public speaking.", "rating": 5, "expected_grade": "A", "created": "2024-01-31T21:02:39.261910Z"}, {"professor": "George Kurtzweil", "course": "INAG110", "review": "George is amazing, great teaching style and enjoyed his class!!", "rating": 5, "expected_grade": "A", "created": "2024-02-02T20:03:37.675161Z"}], "name": "George Kurtzweil", "slug": "kurtzweil"}