{"courses": ["PLCY101", "PLCY388W", "PLCY101", "BSGC102", "PLCY101", "PLCY101", "PLCY201", "PLCY388R", "PLCY201"], "average_rating": 4.25, "type": "professor", "reviews": [{"professor": "Gregory Ramsay", "course": "PLCY101", "review": "Super sweet professor!!! he's so nice and genuinely cares about his students! he posts all of the lectures online and the exams are only based on the lectures so you don't really need to go to lecture but you should because he gets sad when people don't. you do need to go to discussion because they take attendance but i had julian and he's super cool and laid back. there are 2 essays 1 exam and the final. the essays are grades easily and fair. don't need to read the textbook really.  ", "rating": 5, "expected_grade": "A", "created": "2019-04-16T18:01:52Z"}, {"professor": "Gregory Ramsay", "course": "PLCY101", "review": "The four stars are mainly for the class content. It is kind of boring and the reason is, is that professor Ramsay stands at the front of the classroom and literally reads off each slides for 45 minutes. So if you do attend lectures, it can get pretty boring. However, he does post all his slides online, and the midterm and final are all based off the slides (and online) so they are easy. There are two papers in this class and a group project, but if you put in the work, you are bound to get an A. I do really recommend going to lecture often, and participating in discussion because he does participation grades that at the end of the semester are out of 150 points, and getting a low grade on that can mess with your average. Also, go to discussion because the TAs take attendance. Additionally, only Professor Ramsay does the grading, not the TAs. Overall, this is not the most interesting of classes although, it is a great class to get a good grade in.", "rating": 4, "expected_grade": "A", "created": "2021-12-23T22:02:29Z"}, {"professor": "Gregory Ramsay", "course": "PLCY101", "review": "Trust me when I tell you he is the sweetest guy. He is so understanding of students and more than willing to accommodate each and every one of them. He does an excellent job of grading and it is very fair. The way the final policy brief is structured is so that by the time it is already due, the majority of it is finished. He understands how students work, and using this structure made the entire assignment more approachable. Seriously, he has a good vibe.", "rating": 5, "expected_grade": "A+", "created": "2023-03-09T16:49:52.055886Z"}, {"professor": "Gregory Ramsay", "course": "PLCY101", "review": "This guy is so sweet but unfortunately his classes are SO boring. He literally just reads off the slides for 50 minutes. Still go to lecture though because he gets sad if no one does. I would recommend doing the readings because he chooses really interesting ones that are super relevant to the topic. The class isn't hard at all, a midterm and a final that are all found in the slides, and a final brief that's structured so its not too much work.", "rating": 3, "expected_grade": "A+", "created": "2023-05-22T00:08:59.806348Z"}, {"professor": "Gregory Ramsay", "course": "PLCY101", "review": "Ramsay is genuinely the nicest professor I have ever had. His TA's take attendance in discussion, but there his no attendance for lecture and he posts the notes. I never had to use the book for the class and I never really did the readings either and I still got an A+. There are a few big assignments and an online/open book exam. Ramsay takes the time to grade your paper himself and leave comments. He is extremely knowledgeable, yet approachable and will definitely work with you if you need help.", "rating": 5, "expected_grade": "A+", "created": "2023-05-24T02:14:26.930032Z"}, {"professor": "Gregory Ramsay", "course": null, "review": "Dr. Ramsay is great! The class was easy and laid back, and the simulations were truly fascinating. There are only three assignments, but they are fairly easy.", "rating": 5, "expected_grade": "A+", "created": "2023-11-02T14:32:19.841075Z"}, {"professor": "Gregory Ramsay", "course": "PLCY201", "review": "This man is the nicest professor and human being on campus! I'm not a policy major but I took this for a gen ed and ended up loving it, mainly because of how kind Professor Ramsay is. The class is very easy and interesting, each week is a \"simulation\" about a real, relevant public issue and you meet in groups to discuss your solution. Three press releases and a final paper but they are not bad at all. Take this clas!", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T01:28:51.841687Z"}, {"professor": "Gregory Ramsay", "course": "PLCY101", "review": "Dr. Ramsay is a very sweet man - grandpa vibes. I had him in Spring 2023. However, unfortunately, his lectures and class are incredibly boring. His class is an easy A almost all of his quizzes are found online (this is why everyone likes the class). Most of the class did not attend lectures because the class was easy and boring. He is nice but old.", "rating": 2, "expected_grade": "A-", "created": "2023-12-11T21:08:39.867440Z"}], "name": "Gregory Ramsay", "slug": "ramsay_gregory"}