{"courses": ["CMSC216", "CMSC351", "CMSC351", "CMSC436", "CMSC351", "CMSC132", "CMSC436", "CMSC351", "CMSC424", "CMSC436", "CMSC351", "CMSC436"], "average_rating": 4.1765, "type": "professor", "reviews": [{"professor": "Herve Franceschi", "course": "CMSC216", "review": "Herve is a solid prof. He is new to the CS department, and he has been co-teaching 216 with Yoon this semester. Honestly, his lectures can be a little dry, but he teaches you all the key points (outside of some things you need to go to discussion to in order to learn). From what I've heard, his exams/quizzes have been much fairer than Yoon's have been. I can't speak for the comparison, but in my experience, the quizzes and exams have been very fair. He obviously wants his students to learn, and takes time to answer student questions thoughtfully.", "rating": 4, "expected_grade": "B+", "created": "2022-11-10T01:59:22.921774Z"}, {"professor": "Herve Franceschi", "course": "CMSC216", "review": "Agree with the other review posted. His lectures can be a little bit boring at times but you can tell he cares about you trying to understand what is going on and takes things step by step. He is new and co-teaching with Yoon so I can't speak about how he organizes his classes because he just does what has always been done in 216 at UMD. All of his exams and quizzes have been very fair- if you feel comfortable enough with the material you'll do well. There's no \"gotchas\", just go to class and discussion and make sure you know everything on the slides. He also records lectures which is nice!", "rating": 4, "expected_grade": "A-", "created": "2022-11-22T19:56:31.422803Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "i love this guy; fairest exams out and really smart. also posts his lecture slides at the start of the week and opens office hours whenever people need them.", "rating": 5, "expected_grade": "", "created": "2022-12-13T15:18:09.885203Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Exams are fair but I didn't go to lectures that often because I couldn't extract knowledge from them compared to Justin's lecture notes. Overall, I had a pretty good time.", "rating": 4, "expected_grade": "A", "created": "2022-12-16T05:49:21.228277Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Really nice guy who wants you to succeed and his exams are relatively fair and definitely not too hard. However, his lectures are really poor, and it is hard to follow him while he is lecturing off slides.", "rating": 4, "expected_grade": "", "created": "2022-12-18T14:30:05.715687Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Don't take this class with him... Just dont. Unless you want to be fuel for Justin's curve (Justin is a much better teacher with easier exams, they co-teach the class, and sum both class grades together at the end, fucking over anyone who took Herve) simply do not take his class. You will learn more about the class from the Homework questions than his lectures, which really says something.", "rating": 1, "expected_grade": "D+", "created": "2022-12-21T16:59:52.509400Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "absolute goat. Exams were pretty fair and helped since the final was hard and had a lower average. Holds review sessions before exams and is incredibly approachable outside of class. Very nice guy!", "rating": 5, "expected_grade": "A", "created": "2022-12-22T03:40:41.765294Z"}, {"professor": "Herve Franceschi", "course": "CMSC216", "review": "Herve was doing well until midterm 2. His lectures were okay, but boring to me. Midterm 2 had a big typo but we didn't get any notification until the end. I thought he would do better for the final exam, but no. I have to agree that the final exam was pretty easy but it was so bad due to the typos and vague questions. It has about 6-7 errors in the final exam", "rating": 3, "expected_grade": "A", "created": "2022-12-24T03:46:38.623521Z"}, {"professor": "Herve Franceschi", "course": "CMSC216", "review": "Very nice guy who gives fair quizzes/assessments, but has kind of boring lectures and his TAs grade slowly. That being said, he's still very knowledgeable and is very willing to answer questions and help students.", "rating": 4, "expected_grade": "B", "created": "2022-12-24T14:12:09.731478Z"}, {"professor": "Herve Franceschi", "course": "CMSC216", "review": "I was a bit unsure about him at first, he can be a bit dry and boring during lectures. During office hours, he's a completely different person. He's always willing to meet one-on-one to help you debug code or go over the material. His second midterm was pretty abysmal, but he made up for it with a more than fair final. My biggest gripe with 216 was that its design is atrocious. This is not necessarily a reflection on Franceschi, however, as it was his first time teaching the class with Yoon. The projects are likely leftover from one of Nelson's past semesters but are nevertheless poorly written/explained. So much so that the wait time for a TA during office hours would be 1-2 hours on a good day. Given the natural stresses of 216, Franceschi was very fair and understanding of circumstances and was great at reading the class and adapting to fit their best interest.", "rating": 3, "expected_grade": "", "created": "2022-12-29T03:04:25.586019Z"}, {"professor": "Herve Franceschi", "course": "CMSC216", "review": "Overall, I think Herve did the best he could with what he was given. The project descriptions were abysmal (which might have been because Herve was co-teaching with Yoon), but the exams were generally fair (minus a few typos that were significant but mentioned during the exam). He held exam review sessions which were pretty helpful, and I think it was a pretty fair course.", "rating": 4, "expected_grade": "B+", "created": "2023-01-03T17:40:10.772749Z"}, {"professor": "Herve Franceschi", "course": "CMSC216", "review": "As a professor, Herve isn't too bad. He includes a lot of examples in his lectures which really helps sometimes, if you can stay awake long enough to listen to them. The course structure was terrible, OH waiting times were nearly impossible, and since Herve doesn't check up on grading with his TAs, we always got our grades back really late. It was also his first time teaching at UMD so I understand why the project descriptions were so vague, since he told us he didn't handle anything about the projects himself. Also, no curve or cutoff adjustment. Final average was 79.5 which isn't too bad imo.", "rating": 3, "expected_grade": "", "created": "2023-01-06T13:20:40.701795Z"}, {"professor": "Herve Franceschi", "course": "CMSC216", "review": "This was my first semester at UMD, so not a lot of comparisons to make in this program, but boy did I enjoy learning from Herve this semester. \r\nMy experience is that Herve is a smart and approachable, and makes difficult concepts easier to understand.", "rating": 5, "expected_grade": "B+", "created": "2023-01-06T21:50:38.170132Z"}, {"professor": "Herve Franceschi", "course": "CMSC216", "review": "Herve is the absolute best professor.", "rating": 5, "expected_grade": "A", "created": "2023-03-16T17:34:22.391802Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "CMSC351 is a tough class. The TAs are hit or miss during office hours. Get started on all the homework early.", "rating": 2, "expected_grade": "C+", "created": "2023-04-01T18:33:42.518379Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Clear lectures, fair exams that you can prepare with past exams, practice problems, and homework. Homework is fair, relevant to practicing with the material + exam, and derived from his lectures and examples. Records lectures, responds actively on Piazza. Quick grading turn around (within a week or so usually) because there are many auto graded questions. Similar exam averages (80-85%) and style to Justin. Especially helpful during office hours, he's willing to patiently work with you and comes up with examples and go through them multiple times until your confusions are cleared. Highly recommend.", "rating": 5, "expected_grade": "A", "created": "2023-04-06T03:44:46.872828Z"}, {"professor": "Herve Franceschi", "course": "CMSC216", "review": "Herve makes the exams extremely fair, but the lectures are really boring. Most of my learning was done outside of class time because he reads straight off the slides. That being said he is worth taking just because you know what you are in for", "rating": 4, "expected_grade": "B", "created": "2023-04-18T17:41:09.739807Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "I've taken Herve for both CMSC216 and CMSC351 and I'm very glad I did. He joined UMD just recently yet he was a much needed addition, as it is rare to find a professor who teaches such hard classes fairly. \r\n\r\nIn both classes, despite their difficulty, the assignments/exams he gave have always been fair. Unlike many professors who teach these courses, he isn't unreasonable with content difficulty or work load. He is very understanding and willing to help students who need it. I got COVID-19 early this semester before a test, and he worked with me on a make-up exam date and even opened his Zoom office hours late to help me with the homework since I no longer could go to office hours. His lectures can be a bit disorganized at times, but overall he feeds you the right information, and everything you need to know can be found on his slides, which are very solid in my opinion. His CMSC351 course structure is very similar to Justin's (since they co-taught in the previous semester) which allowed me to utilize Justin's notes in my studying, which is a very helpful resource. \r\n\r\nBoth CMSC216 and CMSC351 were ridiculously hard classes, yet Herve managed to make both manageable and fair, which is something that not many professors in the Computer Science department do. \r\n\r\nSome of the most difficult challenges I found with CMSC216 were due to the fact that he was co-teaching with Yoon, whose class was a nightmare. As for CMSC351, there haven't been any unreasonable challenges, and he isn't co-teaching with a professor who likes to make their students' lives terrible. He even opens up Zoom review sessions that he personally teaches which are not only very helpful, but something that I wish more professors would do.\r\n\r\n He may not seem like a department-wide favorite like Justin and Nelson considering his other reviews, but he is a very solid professor which is quite a rarity for such crucial CMSC classes.", "rating": 5, "expected_grade": "B+", "created": "2023-04-24T23:35:26.850221Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Herve is a solid professor for 351 in that you know what you can expect in his course. The exams are fair, with relevant homeworks and practice exams to help prepare you, and I found that just knowing how to do those is enough to do well on his exams. His actual lectures themselves can be dry and sometimes seem convoluted, so I didn't do much of my learning in class, but his lectures (proofs and all) seem more in depth than the level of understanding we need to do his assignments and assessments, so it was fine overall. Herve does have a habit of having multiple typos on exams which isn't ideal, but what CS professor doesn't, really. I had him for 216 as well which I've held back on reviewing, since I've realized my suffering in that class was probably more due to that fact that he was co-teaching with Yoon (meaning we had the same atrocious course structure but without their class's curve) than anything on Herve's end. Would recommend Herve for 351 especially over some of his counterparts.", "rating": 4, "expected_grade": "A", "created": "2023-05-01T21:30:10.213148Z"}, {"professor": "Herve Franceschi", "course": "CMSC436", "review": "The way Herve lectures is by coding an app during lecture along with some slides that define the functions and things we are using. Projects are pretty easy and most can be done in a a day or two if not a couple hours. Main gripe with the class is the quizzes. Quizzes are very syntactical which makes them feel unfair/pointless when the the IDE the course uses autocompletes for you and makes it seem more like a memorization test. However he did mention that he wants to reduce the need for memorization and provided documentation on the midterm and final. Class also was a little disorganized with quizzes, as there was no schedule for them and we only really knew about them from the profs in class/elms announcements, and there were sometimes mistakes/unclear details in the project requirement papers, though he is very receptive to questions.", "rating": 3, "expected_grade": "C", "created": "2023-05-05T23:22:09.773687Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "I came into 351 fresh out of Yoon 216 and you and I know that was a dumpster fire. My first few lectures with Herve felt weird because I had never before expected to immediately understand what came out of his mouth. Felt weird having a good cs professor. The homeworks and practice exams are really really good practice and his slides are pretty good. He and the TAs are pretty active on piazza as well. Very fair professor, take him. You don't want kruskal bro.", "rating": 5, "expected_grade": "B+", "created": "2023-05-15T15:51:27.463122Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "I had him for 216 and it was  just a tough class because 216 projects are just hard. Still he gave fair exams and was very pleasant to interact with. I had him for 351 and he is the reason I passed. His style of testing and homeworks is to make the exams manageable.  Just a super nice guy and a real win for the CS department.", "rating": 5, "expected_grade": "", "created": "2023-05-17T15:27:07.105423Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "The class is challenging, but you can pass it by meeting with TAs and working with other students for homework and exams. Herve's exams can be graded harshly but they doesn't really matter if you ace the homeworks.", "rating": 3, "expected_grade": "C+", "created": "2023-05-25T04:01:30.241533Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Great professor for 351. Teaches straight from Justin's notes an provides decent examples during lecture. I had taken 351 with him over the summer, so the class was mostly online. Being online, most of the lectures were just him going over the slides and focusing on certain topics when they were very theory heavy. He would do a great job of explaining the tougher concepts and it would leave me surprised that I am actually understanding everything; even after every single person I know telling me 351 is going to be near impossible. The homeworks are not very theory based at all, so as long as you can grasp the concepts taught in class, the homeworks will be pretty easy. This extends to the exams too. The exams in this class were very fair. If you spent a good night or two studying over past homeworks and sample exams, you would be fine for any exam.\r\n\r\nDefinitely take 351 with him if you can. I think his class is one of the better ways to get through 351.", "rating": 5, "expected_grade": "B", "created": "2023-07-07T17:17:45.462835Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Herve is honestly the best CS teacher I've had. The way he teaches in lecture is amazing. I had Justin for 250, and even though Justin great, Herve just breaks down content and explains concepts much better. He's extremely approachable. He's always willing to help you out in office hours, even outside the scheduled times. His TAs (especially Nikhil) are truly amazing at teaching and helping you out. Exams are extremely fair and really similar to the practice exams. Honestly, I was so nervous for this class, but this has got to be the most engaging, interesting, best designed, and well taught class I've taken. As someone who has taken both Herve and Justin, Herve is the way to go!", "rating": 5, "expected_grade": "A", "created": "2023-07-08T04:48:16.431976Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Herve saved me from taking the devil of 351(Kruskal). His homework is fair in terms of the work and the deadline to finish it these aren't bad at all. He does recordings so missing a lecture isn't a problem and is super helpful during office hours and can meet outside of office hours. His exams are easy asf cause the style match to the practice he's going to give and it the questions are not bad at all. Some of the improvements he can make are that sometimes the hws and solutions can have errors and lectures can get boring as he reads off the slides. In the end Herve is also chill so with him and Justin teaching 351, it's honestly an ez class for a A/B", "rating": 4, "expected_grade": "", "created": "2023-07-11T06:30:23.325524Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "amazing professor!! he explains concepts so clearly (and basically follows justin's notes while adding some additional interesting concepts along with way). lectures are very clear and follow the slides. sometimes he has minor typos on homeworks and slides but they're easy to catch and trivial because if you point them out he'll correct them so it's not that big of a deal. the TA's are great and generally we get our questioned answered fairly quickly. 351 is a hard class but his homeworks help reinforce concepts - nothing is busy work. exams are incredibly fair but beware if u make small mistakes you'll easily lose 10% or something so make sure to practice a lot, clearly read questions, and not make tiny algebra errors. also his fits + kicks are fire!! really cool chill dude", "rating": 5, "expected_grade": "A", "created": "2023-07-11T14:42:30.655458Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Love his French accent.", "rating": 5, "expected_grade": "A+", "created": "2023-07-15T03:20:48.098301Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Herve has the easiest exams and the best slides I've ever seen. He basically reads off his slides in lecture but I don't blame him cause his slides are so good. At some point, I stopped going to class and still did well because of his slides (he does not record lectures). I originally had Maks co-teaching with Kruskal for 351 but I dropped it to take it with Herve over the summer and it was the best decision.", "rating": 5, "expected_grade": "B+", "created": "2023-11-09T02:38:21.156957Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Kind and very passionate. He kindly replies all the Piazza questions for students.", "rating": 5, "expected_grade": "A-", "created": "2023-11-15T06:53:54.920089Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "He co-taught with Justin this semester, which I guess this might be a review more for Justin. I didn't go to class and just studied from the online notes, which saves a lot of time and provides all the information you need for exams. Piazza helps a lot.", "rating": 5, "expected_grade": "A", "created": "2023-12-16T06:18:23.668371Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Really helpful slides and straightforward exams", "rating": 5, "expected_grade": "A-", "created": "2023-12-20T23:13:30.038648Z"}, {"professor": "Herve Franceschi", "course": "CMSC436", "review": "Very average CS professor. Doesn't teach that well (lectures are just run-throughs of code snippets), but the class is super easy and the projects are simple. Everything about this class and the professor felt very fair - take 436 with Herve if you want an easy A.", "rating": 3, "expected_grade": "A+", "created": "2023-12-23T04:11:34.048568Z"}, {"professor": "Herve Franceschi", "course": "CMSC351", "review": "Herve is a very kind professor and goes through a lot of examples in class to help you work through everything. 2/3 exams were very fair and reflected what we had gone over in class, past exams, and the homeworks. However, one exam was unexpectedly hard compared to the practice exams we were given, causing a lot of students' grades to go down. He is very helpful and so are the TAs in office hours, so they will work with you on the homeworks and ensure you understand the concepts. Study and prepare well for the exams because the class grade depends entirely on your exams rather than other assignments.", "rating": 5, "expected_grade": "A", "created": "2023-12-28T01:05:44.247344Z"}], "name": "Herve Franceschi", "slug": "franceschi_herve"}