{"courses": ["ARTT110", "ARTT110S", "ARTT210", "ARTT110", "ARTT110", "ARTT110S", "ARTT110", "ARTT210", "ARTT110", "ARTT110S", "ARTT110", "ARTT210", "ARTT110", "ARTT110S"], "average_rating": 4.75, "type": "professor", "reviews": [{"professor": "Irene Pantelis", "course": "ARTT110", "review": "Professor Pantelis is a great instructor. The course itself was a bit intimidating, especially since you're working with peers that have great artistic abilities. However, Pantelis does her best to provide guidance to anyone who is seeking it. She's kind and can really help improve your artistic abilities. I would 100% recommend her to anyone interested in taking this course.", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T03:14:51.947658Z"}, {"professor": "Irene Pantelis", "course": "ARTT210", "review": "This course has many talented students so you might feel intimidated at first. Professor Pantelis is not the easiest grader, but she is always willing to help you with your projects. If you take her course, I would suggest asking for help and putting a lot of effort into your work. I also would advise staying after class to work on projects because you will definitely need more time to complete the projects than you are given.", "rating": 4, "expected_grade": "A", "created": "2023-05-14T20:26:54.569932Z"}, {"professor": "Irene Pantelis", "course": "ARTT110", "review": "Incredible instructor and she is willing to go the extra mile for you to succeed in her class, I asked for a religious exemption from some assignments and she was happy to indulge to the point where she made an entirely new curriculum for those assignments just for me. She is an easy grader if you are willing to put in the effort, but this class is not a cake walk as you will most likely need to put in more time outside of class to finish assignments unless you draw very fast. But professor pantelis was always very helpful and lenient.", "rating": 5, "expected_grade": "A+", "created": "2023-05-28T02:24:45.022835Z"}, {"professor": "Irene Pantelis", "course": "ARTT110", "review": "I loved this class! It was such a nice break from the structure of a \"normal\" class. Professor Pantellis is very kind and creates a very welcoming environment for all her students. I would highly recommend this course as a gen-ed!", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T22:34:19.541970Z"}], "name": "Irene Pantelis", "slug": "pantelis"}