{"courses": ["COMM107", "COMM200", "COMM360", "COMM330", "COMM371", "COMM371", "COMM324", "COMM398T", "COMM371", "COMM398T", "COMM324", "COMM371", "COMM371", "FIRE198", "FIRE398", "COMM371", "COMM398T", "FIRE120", "FIRE298", "FIRE398", "FIRE198", "FIRE398", "FIRE120", "FIRE298", "FIRE398"], "average_rating": 4.6667, "type": "professor", "reviews": [{"professor": "Jaclyn Bruner", "course": "COMM107", "review": "Dr. Bruner is one of the easiest going teachers. She made the lectures interesting, interactive, and allowed students to understand the material. There are online quizzes, but as long as you do the reading, the quizzes are easy. Very light grader when giving speeches.", "rating": 4, "expected_grade": "A", "created": "2020-02-12T15:15:27Z"}, {"professor": "Jaclyn Bruner", "course": "COMM107", "review": "I did not want to take COMM. She understood most people were there because they had to be and did a good job teaching to that.  The class was interesting and not too difficult even if you arent interested in the material", "rating": 4, "expected_grade": "A", "created": "2020-05-03T16:54:55Z"}, {"professor": "Jaclyn Bruner", "course": "COMM107", "review": "Prof. Bruner is one of the kindest professors I met. She is very understanding of circumstances and is a fair grader. If you put the effort in then you will surely succeed in that class. She gives you all the materials and lessons to be prepared for this class. ", "rating": 5, "expected_grade": "A+", "created": "2022-01-24T03:18:56Z"}, {"professor": "Jaclyn Bruner", "course": "COMM107", "review": "Dr. Bruner somehow made a class that happened at 8AM and, as a bonus, involved me speaking for long periods of time to a room full of strangers an enjoyable experience. While I don't necessarily recommend that time slot, I would recommend taking her for COMM107 whenever you get around to it.", "rating": 5, "expected_grade": "A", "created": "2022-12-08T19:04:25.214033Z"}, {"professor": "Jaclyn Bruner", "course": "FIRE198", "review": "She is, without a doubt, the kindest and most understanding professor I have ever had in my life. this woman is a GEM. in visualizing social justice she tried to teach us about public memory concepts which were pretty difficult to grasp but she really engaged us and understood that this new material would be difficult for us. after i had to submit assignments late for personal issues, she told me that it didn't matter to her that the work was late, what mattered was that it was turned in. and some people may say that she sounds like an easy prof to take advantage of, and in theory yes, but the thing is that no one really wants to take advantage of her because we respect her and want her to be proud of our work. if you are in fire and considering the VSJ stream, i heavily recommend it b/c even tho this was bruner's first semester with the program and i'm sure some things will change for the future as she settles in, she is an incredible person to know. and i guess she teaches comms too lol i'd probably take anything she teaches. JB 4EVER!", "rating": 5, "expected_grade": "A+", "created": "2023-05-09T17:35:43.592025Z"}, {"professor": "Jaclyn Bruner", "course": "FIRE298", "review": "i stuck with bruner for my third fire semester and i don't regret it at all! visualizing social justice is such an interesting topic and bruner really let us branch out into all of our interests. everyone's final project was soooo different and i think that shows how open she is to new / important ideas, even if our projects don't align with her projects in solving cold cases. i am staying on a PRM and i can't wait to keep working with her! if there is an assignment in the lab you don't want to do, you can literally not do it and it'll be fine lol like half the class skipped a bunch of assignments but it's no big deal. pretty much everyone else i've talked to in different fire streams isn't happy / doesn't like their stream / professor but that is so not the case with VSJ!", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T14:47:26.956223Z"}], "name": "Jaclyn Bruner", "slug": "bruner"}