{"courses": ["BSOS233", "PSYC300", "BSOS188B", "BSOS233", "PSYC300", "PSYC417", "BSOS188B", "BSOS233", "PSYC300", "SURV400"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Jacob Coutts", "course": "PSYC300", "review": "Literally one of the best professors I've had so far at UMD. I've never felt the need to write a review about a professor on here until now. I took his class virtual, but I can tell that he is super understanding and actually cares about his students. He's always willing to help and if you can take PSYC300 with any professor, take it with Dr. Coutts.", "rating": 5, "expected_grade": "A", "created": "2023-12-11T23:52:41.198713Z"}, {"professor": "Jacob Coutts", "course": "PSYC300", "review": "I don't see any reviews for Dr. Coutts so I thought I'd start it off. If you have to take PSYC300, please take his class! Dr. Coutts is such an amazing professor. He is passionate and truly cares for each and every student. His personality makes students feel comfortable and he is very receptive if a student is struggling with the material or in general. During my time at UMD, I've never had a professor quite like him and he has made this semester very memorable. Just take his class - you won't regret it!", "rating": 5, "expected_grade": "A", "created": "2023-12-13T03:33:46.685480Z"}, {"professor": "Jacob Coutts", "course": "PSYC300", "review": "PSYC300 has a reputation as a moderately hard and workload intense course. Dr. Coutts did his best to lessen how much work we had to do. His lectures were interesting and there were only 14 in the entire course, almost all are around 40 minutes each. We got lots of drops for papers, he gave lots of opportunities for extra credit, and made the lab not too difficult. The use of R in this course is minimal, and he provides tutorials that make it very easy to learn. One of the best UMD professors I have had, and certainly the best psyc professor. If you can take PSYC300 with him, do it.", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T01:52:18.409293Z"}], "name": "Jacob Coutts", "slug": "coutts"}