{"courses": ["PHYS606", "PHYS761", "PHYS762", "PHYS272", "PHYS373", "PHYS604", "PHYS272H", "PHYS610", "PHYS611", "PHYS260", "PHYS260H", "PHYS260", "PHYS260H"], "average_rating": 3.3478, "type": "professor", "reviews": [{"professor": "James Drake", "course": "PHYS721", "review": "Drake is a wonderful professor that really has a knack for teaching. I took this same class with a different professor (Bernake) and I simply couldn't understand him. On the other hand, Drake teaches in a slow and methodical fashion that's incredibly easy to understand so long as you attend each and every lecture. He goes into much detail around the example problems he gives that are very similar, if not identical, to the problems that he gives on exams. The HW can get difficult at times, but the professor is always more than willing to help however he can.\r\nWhen it comes down to students, Drake shows genuine care in the success of his students and at one point, had an intervention of sorts when the class failed to meet his expectations. He holds review sessions before every exam and lets us know what's going on at all times, including exam days, review days, how far we are in the curriculum and so on.", "rating": 5, "expected_grade": "A", "created": "2013-12-17T02:23:00Z"}, {"professor": "James Drake", "course": "PHYS272", "review": "Dr. Drake is one of the best physics professors I've ever had. He is extremely knowledgeable in regards to his subject matter and has a sincere desire to see his students do well. The review sessions he holds before the midterms are extremely helpful. I highly recommend you attend all of them. He is very accommodating, and he doesn't have any issues talking with you one on one outside of class. I would definitely recommend taking a class with Dr. Drake.  ", "rating": 5, "expected_grade": "A", "created": "2013-12-02T16:57:00Z"}, {"professor": "James Drake", "course": null, "review": "Professor Drake is amazing. His lectures are always very clear, and he explains everything quite well. He will go out of his way to help students succeed and holds a review session before exams just to make sure students know the material. His grading system is very fair, and if you put in the effort, you will do very well in his class. He loves answering questions and helping students out. If you can take Professor Drake's class, do it.", "rating": 5, "expected_grade": "", "created": "2013-11-15T20:24:00Z"}, {"professor": "James Drake", "course": "PHYS270", "review": "Dr. Drake is a great professor.  Gives very clear and informative lectures with very good notes.  If you go to lectures and take the notes he writes up on the board you can get an A without ever opening the textbook.  Exams and assignments ask fair questions that are representative of the material covered in the lecture and are graded fairly as well.  Dr. Drake personally holds a review session before every exam and the final and is more than happy to meet with students outside of class to help them.  It is very easy to make a time to meet with him as he is in his office very regularly.  If you need help go talk to him and he will help you.  If you miss a lecture go talk to him and he will copy his lecture notes for you and go through them with you.  Take a class with Dr. Drake if at all possible.", "rating": 5, "expected_grade": "A", "created": "2008-05-18T15:24:00Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "He's a nice professor in terms of how he responds to students and the grading but that does not make up for his confusing lectures and insanely difficult HW problems", "rating": 2, "expected_grade": "", "created": "2023-09-13T18:16:05.396436Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "The homework is very difficult to do without any help from TAs or previous knowledge and his lectures are really confusing and hard to read even if you're close to the front.", "rating": 2, "expected_grade": "", "created": "2023-10-11T00:40:17.386491Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "ill keep this short and simple. cool guy terrible teacher. impossible homeworks insanely confusing lectures.", "rating": 2, "expected_grade": "", "created": "2023-10-11T20:31:25.959325Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "James Drake is a nice man, in general. However, he is not a good teacher at all. His knowledge of the subject is very apparent, but he does not explain the course material or homework expectations well at all. While most physics courses use ExpertTA, Drake has us work on problems from the textbook to submit for an accuracy grade. The homework is exponentially harder than the unclear examples he gives in class. If you are a physics major, or graduate student, by all means, take James Drake. Otherwise, save yourself the trouble and just don't.", "rating": 1, "expected_grade": "", "created": "2023-10-12T03:15:48.280467Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "I do not recommend James Drake. I typically make very good grades in my classes, because I work hard. However, Drake makes it impossible to succeed in his class. No matter how hard you try in this class, YOU WILL NOT DO WELL.", "rating": 2, "expected_grade": "C", "created": "2023-10-12T03:17:26.021175Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "please save yourself the trouble and dont sign up with this professor. Im warning you now. take at your own peril. or if you are a physics genius then youll have a blast maybe. His teaching and the text book do overlap but he takes a lot of prode in his teaching style without any regard for whether the students are actually learning anything. From the first unit to unit period more than  half the class still remains confused about what in gods holy name is going on. youd be better off just reading the book for basic understanding but at the same time he will make you derive a formula rather than how it can be applied. maybe he assumes we aspire to be theoretical physicists or something but i dont think he gets that we are busy college students who thrive on straightforward teaching (tell me what i need to know, the tricks and caviats and move on). Anyways, I would not recommend, if you can avoid please do.", "rating": 1, "expected_grade": "C-", "created": "2023-10-17T04:08:13.354768Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Cares about his students, has frequent office hours. Asks for student feedback often. Knows his stuff, passionate about the subject and explains well and clearly. class was well organized. An overall nice guy trying his best. Don't hate on him just because physics is hard. Id take him again.", "rating": 5, "expected_grade": "B", "created": "2023-10-18T23:28:54.496404Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Dr. Drake is absolutely amazing! This is his first time teaching this class, but it is very clear he cares and tries really hard for his students. He makes his own lecture notes based on what he thinks is important for the students to know so that they do not have to read the textbook. He assigns homework problems slightly harder than the exam problems, and makes sure the homework problems match the kind of topics on the exam, so that we are well prepared and have those for an effective review material. He also writes out his own in depth solutions for the homework problems and has review sessions covering all of the topic we need to know the day before the exam (with it explaining how to do problems very very close to those on the real exam) and review sessions for each homework that are completely informal and inviting. He also posts a practice exam for us, and the real exam is very fair. He responds to emails quickly and is ALWAYS willing and happy to talk to students in office hours. It honestly upsets me seeing these low-scoring reviews for him because, if you compare him to the other professors who teach this class, he is the nicest of all professors. I have heard horror stories about the other professors, like how they do not care for their students and their learning and how they do not teach the right lesson plan for the final exam so they learn irrelevant material then have to speed through the actual class material (that is already a lot to learn in one semester). Dr. Drake cares so much about his students and it is abundantly clear. He is worth an 8am class.", "rating": 5, "expected_grade": "B-", "created": "2023-10-26T22:03:15.068658Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Overall confusing lectures that no one learns in, convoluted homework assignments for which the lectures do not help, and just a passive aggressive professor. Off the bat the class started on a confusing note and at a different section of the textbook than all the other classes. Very low exam averages with no curve in sight. Avoid at all costs.", "rating": 1, "expected_grade": "B+", "created": "2023-11-13T06:12:51.917115Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Basically spends lecture just doing derivations on the board and giving you like five different equations that all solve for the same thing. Then when you try to do the homework, it's barely connected to what we did in lecture so the homeworks tend to be kind of time-consuming. Organic Chemistry Tutor saved me.\r\nThere's one homework per week, each worth ten points, two midterms, and the final. No quizzes or anything else. He gets a star because the exams are EXTREMELY similar to the sample exams he posts on Canvas, if you want to do well on the exams just memorize the sample ones and go to the review sessions he holds before the exam.\r\nThe other star is because he seems like a really nice and smart guy who cares about his students, he just isn't that great at teaching physics at a lower level. He holds office hours and if you can't make those you can talk to him and he'll set up a time.\r\nHe's not too bad, but I can't really say I learned much in this class because I basically just waited for the sample exams and memorized those.", "rating": 2, "expected_grade": "A", "created": "2023-12-06T06:50:43.264051Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "The sweetest guy ever!! His exams are very similar to his practice exams. Yes, his lectures are a bit confusing. But, if you memorize how to do the practice exams you will be fine. He is the best choice out of all the physics professors for sure.", "rating": 5, "expected_grade": "B-", "created": "2023-12-14T03:26:00.867763Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "He is a great guy. He is nice, has a good personality, and is personable. He is great to have a conversation with. However, he cannot teach. You will not pass unless you already come in with a great knowledge of physics. His exams are extremely hard compared to the other professors.  The homework is long and tedious. Regarding the final, we had two extra chapters on our final compared to Hailu's class. We do not use numbers and calculators in his class, so you can expect the exam questions to be very conceptual. For exams, we cannot bring our cheat sheets. He provided us with a handwritten (yes handwritten) formula sheet of his own. It is unfortunate because he is a great guy ... but this is your warning.", "rating": 1, "expected_grade": "C-", "created": "2023-12-19T11:22:59.751169Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Drake is a nice professor and it seems like he really cares that all of his students do well. His tests are pretty challenging, but he gives practice exams that are fairly similar in content and question style. His lecture aren’t that engaging, but he makes good lecture notes from the textbook chapters, so the textbook readings are that necessary. His homework are tricky, but they were from the textbook, so you could always find answers online. The grading scheme is really forgiving if you mess up an exam. I would recommend Drake is you’d like. Professor who cares. He was organized and communicative, but not so tech savvy.", "rating": 4, "expected_grade": "C+", "created": "2023-12-20T01:14:47.303316Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Pretty good professor. His lectures are pretty much the same as the notes he gives out for each week. The notes are based on things that he think is important for you to know for the exams and are similar to the textbook. His lectures are not that useful to me since I never learned about physics electromagnetic and magnetic field topics so it was kind of confusing to grasp. But after reviewing all the notes, his exam review session is very helpful because you would pretty much see the same topic or problems that are going to be on the exam. Overall he is a pretty good professor and is willing to help students pass his class.", "rating": 4, "expected_grade": "B-", "created": "2023-12-20T23:29:43.639133Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "His ratings have drop significantly since I initially registered for him but I believe that is unfair. Dr. Drake is a great professor when it comes to going out of his way for his students. He is always more than willing to schedule time to meet with you to discuss homeworks/concepts/exams. He also holds weekly review sessions on previous weeks material and before exams he holds a massive review session going over his sample exam. \r\n\r\nHe isn't perfect of course. I found that I was often lost in his lectures, partly due to the difficulty of the material and I felt like he didn't prep us enough before delving straight into the material which caused a snowball effect of confusion. Keep in mind that this professor focuses on the conceptual stuff. All the exams are purely conceptual and will not be asked to calculate a single number. Sorry guys, you can't plug and chug your way out of this class. If you can grasps the concepts then you'll be fine but if you are more of a numbers person than you might want to consider a different professor or put in the effort to understand the theory and logic. His exams are somewhat similar to his sample exams and there are really no surprises. He also makes sure it's graded where you get the maximum partial credit. ie. if you get part a wrong and part b needs the solution to part a, you can still get full credit for part b using part a granted that you follow the correct steps.\r\n\r\nThis semester the physics department really screwed over everyone with suddenly changing the curriculum causing professors to change their lecture materials. Due to this, we all had our own finals which I think worked in everyone's favor since all the 260 professors covered different material. Drake drops a midterm or half of the final and there was still an additional curve to the class. \r\n\r\nI genuinely do hold the opinion that Dr. Drake goes above and beyond for his students, it is just up to you to take advantage of that.", "rating": 4, "expected_grade": "C", "created": "2023-12-22T04:23:19.486309Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "I do not believe he is a bad person or professor, in hindsight of this past semester (Fall 2023).\r\n\r\nHis lectures are mainly derivations/algebra on the chalkboard, which can be difficult to see at times. However, his exams are similar to the sample exams he provides, which is a lot more conceptually-focused than anything else; if you truly understand what is going on in class, you will be able to do well in the class, but you do need to study/practice a bit, as his sample exams are not similar to the homeworks he provides.\r\n\r\nThe homeworks in the class are definitely challenging. They come straight from the textbook, but you'll need to take your time on them. Textbook solutions are not always accurate, meaning once again, if you don't really understand what is going on in lecture, you may feel like the homeworks are too much. However, if you skim through the textbook, you can find formulas that can help you solve the problems you're assigned, and Dr. Drake is willing to help you understand the material and complete the homeworks (he hosts weekly review sessions as well as separate exam review sessions). \r\n\r\nHis grading structure is pretty lenient too; he drops either one of your two midterms, half of your final, or all your homeworks. He also seemed to curve a little at the end of the class (I think ~3%).\r\n\r\nDuring the semester, this course was definitely challenging, especially as a lot of us didn't really know what was going on in lecture and didn't fully understand the homeworks, but if you actually take your time and study the content outside of lecture and discussion (besides doing the homeworks), you'll perform well in his class.", "rating": 4, "expected_grade": "B", "created": "2023-12-22T20:31:33.078792Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Don't get me wrong, Drake is an extremely kind and down to earth man and he is clearly passionate about physics. He genuinely wants his students to succeed and gave a super generous curve at the end of the semester. However, I have not learned a single thing in his class. Drake is a terrible teacher and the only reason I survived was by memorizing his practice exams because that's all you can really do since they're somewhat similar to the actual exam. His lectures are extremely confusing and the homework's are impossible to do without help. The whole class felt like a theoretical physics class. If you're a physics major you'll love this guy, if not, save yourself the suffering and choose another professor.", "rating": 2, "expected_grade": "C", "created": "2023-12-23T22:32:23.376929Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "Really great guy. The class is hard because of the material; not him. If I had a different professor I probably would not have done nearly this well. This sentiment is all coming after I got my final grade, and is probably a more accurate rating of Dr. Drake than the other reviews that were written before the second (for some even the first) exam scores were even posted.", "rating": 5, "expected_grade": "B", "created": "2023-12-26T02:19:21.440364Z"}, {"professor": "James Drake", "course": "PHYS260", "review": "This professor has gotten a lot of negative reviews which a lot of them are correct but overall I think he taught the class very well, especially compared to the other professors you get as an option to take. I took Drake for phys260 and Hailu for phys161 and James Drake is much better than Hailu. A lot of James Drake's lectures could be pretty confusing but he posts his notes ahead of time which is nice. Also the big reason why I think he is great is because his practice exams are very very similar to the actual midterms. I am not a physics genius and I am usually pretty bad at physics but I was able to get an A in the class. When he teaches his material it can be confusing, after almost every lecture I would have no idea what is going on but the key part about his class that made me get an A is that before each midterm and the final he would have a review session where he went over in depth the practice exam. So I would just memorize how to do the practice exam and understand the concepts on the practice exam and then I would do well on the midterms as the midterms were almost exactly the same but different questions. The homeworks are really hard and useless (I just found the answer key online and never really understood most of the hws and still got an A). Also once a week he has workshops that are really helpful as well. Also you can actually listen to him where Hailu I would literally fall asleep in class because of how bland his voice was.\r\n\r\nTLDR: If you want to learn and fully understand the concepts then he might not be the right choice but if you want to get an A then I would take him and just only understand the concepts on the practice exams and go to his workshops and review sessions. HWs are hard and useless (can easily find answers online though). Also, I was supposed to end the class with a B+ but he curved the final  (which brought me to an A-) and then he curved my overall grade to an A. So go to his review sessions and do the practice exams and the class won't be bad. Most of the reviews were posted before final grades came out, he ended up curving a lot which was very nice.", "rating": 5, "expected_grade": "A", "created": "2023-12-27T21:53:36.864785Z"}], "name": "James Drake", "slug": "drake_james"}