{"courses": ["ASTR100", "ASTR101", "ASTR100", "ASTR101", "ASTR100", "ASTR101", "ASTR100", "ASTR101", "ASTR100", "ASTR101", "ASTR100", "ASTR101", "ASTR100", "ASTR101"], "average_rating": 4.6667, "type": "professor", "reviews": [{"professor": "James Hunt", "course": "ASTR100", "review": "Dr. Hunt is a chill dude. I loved his class- he is communicative, clear, and entertaining during lectures. During COVID, exams were open note and you could use the internet. A great course if you find this stuff neat. There are boring bits, and if you aren't super into ASTR then this course may drag a lot of the time. ", "rating": 5, "expected_grade": "A+", "created": "2021-01-07T19:20:42Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "Dr. Hunt is very passionate about Astronomy, and that's what makes him a great teacher. If you find astronomy interesting, this will be an easy class (take 101 the lab class)", "rating": 5, "expected_grade": "A", "created": "2021-12-02T06:53:03Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "He's a great professor and really cares about the subject and his students!  I took it during covid so our exams were all online which made it more difficult for me.  However, he is awesome and I recommend the class!  TA's are also super helpful!!", "rating": 5, "expected_grade": "B-", "created": "2022-04-14T19:19:25Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "Dr. Hunt is very passionate about astronomy which makes his lectures engaging and he answered everyone's questions. His entertaining and very clear/communicative about materials on the exams. TAs were a bit harsh at grading but other than that Dr. Hunt is a chill guy and the class was not that time consuming or stressful.", "rating": 5, "expected_grade": "B", "created": "2022-12-07T23:03:25.346344Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "He is very passionate about astronomy, which is what makes his lectures engaging (for the most part). However, he rambles a lot (not necessarily a bad thing, since it's connected to the material) which is why I sometimes lost focus during the lectures. Overall, he is a very good lecturer, but just prepare for him to ramble about the material.", "rating": 4, "expected_grade": "A", "created": "2023-07-20T13:52:34.427562Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "Dr. Hunt teaches well and the class is pretty easy.", "rating": 5, "expected_grade": "A-", "created": "2023-08-20T04:41:34.033113Z"}, {"professor": "James Hunt", "course": "ASTR101", "review": "Professor Hunt is very nice and is willing to help his students in any way he can to help them succeed in his class. He is so passionate and knowledgeable about astronomy which made class more interesting. Lectures can get a bit boring because Professor Hunt rambles sometimes, but they are bearable. He is very interested in history so he tailors his teaching more toward the historical side of astronomy, rather than the scientific side. The test questions came right from the slideshows and were not difficult. If you have to take a lab, I recommend ASTR101 because it is so easy.", "rating": 4, "expected_grade": "A-", "created": "2023-12-11T23:01:51.059418Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "Prof. Hunt was awesome! He is so passionate about astronomy, and his lectures were very interesting. Test questions come directly from the slides he presents in class, so if you pay attention, you're pretty set. He really seems to care about his students and really enjoys what he does, I would highly recommend him for ASTR100.", "rating": 5, "expected_grade": "A", "created": "2024-02-14T16:27:48.797944Z"}, {"professor": "James Hunt", "course": "ASTR100", "review": "He's a great professor and is super passionate about astronomy, but he tends to ramble a lot, which made lecture quite boring.", "rating": 4, "expected_grade": "A", "created": "2024-02-15T14:56:21.124029Z"}], "name": "James Hunt", "slug": "hunt_james"}