{"courses": ["CHEM482", "CHEM135", "CHEM395", "CHEM395", "CHEM395", "CHEM131"], "average_rating": 1.8889, "type": "professor", "reviews": [{"professor": "Janice Reutt-Robey", "course": "CHEM135", "review": "I took CHEM135 my freshman year fall 2012.  This was one of the most awful experiences I have had with chemistry. \r\nReutt-Robey was extremely monotone and she could not project to the back of the classroom.  She did not take advantage of the microphone for the room either.  She got confused by her own powerpoint slides and often stumbled around the content.  Lecture was pointless to go to other than the clicker questions which were often on material that we had never seen before.  \r\nThe tests were full of tricky questions on content that she glazed over.  My TA was also very incompetent, I went to most discussions and he could not answer many questions that the students asked pertaining to the material.  \r\nAlthough she curves the class, it is almost impossible to get an A.  If you are stuck with her, you can get a B with copious notes and reading the book.  I was only 1% off of a B- because I gave up on the class halfway through, but it is very possible to get a B with the curve.  Good luck if you get this professor.   ", "rating": 1, "expected_grade": "C+", "created": "2013-06-08T11:42:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM135", "review": "Reutt-Robey is nice, knows her stuff, and sincerely tries to teach. The problem is, she's not very good at teaching.\n\r\nNote-taking is extremely difficult to do because she relies on slideshows that tend to have extraneous information left and right... you basically don't know what NOT to write down until after you've already taken the test. She tries her best to answer questions but tends to make people even more confused afterward. She doesn't use the volume needed to teach 300 kids in a lecture hall - people tended to talk over her after a while, so if you're not very good at chem, it's almost mandatory that you sit in the front.\n\r\nChem discussion with the TA wasn't very helpful either. The best thing I ever did for this class was go to the GSS sessions. They prepared me much more for the tests than the lectures with Reutt-Robey ever did. The tests themselves aren't very hard, it's just that Reutt-Robey doesn't always cover everything that's on it. There was always a handful of questions that seemed to be like completely new material simply because Reutt-Robey only briefly mentioned it or never talked about it at all.\n\r\nIf you can, avoid her. Nice person but a dead-awful teacher.", "rating": 1, "expected_grade": "B+", "created": "2013-05-06T20:53:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM135", "review": "Please save yourself the time and don't take this professor. Honestly the WORST professor I have ever had in any level of school. Middle, High, College, and College Camps. Horrible professor, she speaks so quietly you can't even hear her. Besides this when you can hear her she stutters and is impossible to understand. I use to love chemistry, after taking this class I hated chemistry, which when thought about is extremely sad. Every single class, one minute before class is over she would ask what time it was, after this she skipped around six to eight slides of material that we would never see again in the next lecture to do her click question. Thus you're missing almost ten percent of the content over the semester. I'm sure she's extremely smart but she needs to be in research and not teaching. Sorry. ", "rating": 1, "expected_grade": "", "created": "2012-12-15T01:17:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM135", "review": "The nicest professor you will meet in the science department. She is soft-spoken, so sitting up front will help your learning experience. It is mandatory that you go to the lectures for the clicker questions that are reasonably fair. Dont bother taking notes from her slideshows, but try to pay a decent amount of attention. Most of the learning will occur outside the classroom and in the textbook. The teaching assistant wasnt much help for this class either. The online homeworks were a doozy and very time consuming. There are 3 exams and 1 final, so if you want an A you'd better study for all 3 and work on the practice problems in the book! Other than that good luck.", "rating": 3, "expected_grade": "B", "created": "2012-01-25T00:36:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM135", "review": "Course: CHEM135\n\r\nTeaching Style:\r\nReutt-Robey's weakest point. While I will concede that Dr. Reutt-Robey clearly knew the source material she was lecturing on, her ability to communicate is lacking. Multiple times during the semester, she was observed to trip up on certain sentences, making certain examples unnecessarily obtuse. Adding to her ambiguous communication, her class room control was very poor. While admittedly difficult to control 300 some freshman, it was impossible to hear if sitting anywhere but the front 10 rows, and difficult even then.\n\r\nAssignments:\r\nAssignments and given in two formats: one point in class responses, and online homeworks. Neither are particularly exceptional, and are average. Not terribly difficult, however.\n\r\nExams:\r\nThe exams were a point of contention for me. While average exams in every respect, I found the exams to be filled with trick questions, typos, or ambiguous wording. Somewhat below average, though not terrible.\n\r\nGrading:\r\nReutt Robey's grading system is relatively standard for most freshman classes, however, it should be noted. Dr. Reutt-Robey will not curve this class. Do not expect to get an A grade with an 85. It won't happen.\n\r\nOverall Review:\r\nAverage class with below average Professor. For most, it's not an optional course, but Reutt-Robey could certainly improve the class but refining her teaching style.", "rating": 3, "expected_grade": "A", "created": "2011-12-17T22:27:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM135", "review": "I respect Janice's lab, but she is not meant to teach. Luckily I didn't need her to know chemistry, but my friends struggled. She, in a monotone voice, just read off of her slides and did a poor job of explaining concepts to students who had never taken college-level chemistry before. Terrible.", "rating": 1, "expected_grade": "", "created": "2011-12-17T10:59:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM482", "review": "this class was at 8 am. its quantum chemistry. it's hard to think that much at 8 am. she's a poor teacher as well.", "rating": 2, "expected_grade": "B+", "created": "2010-10-27T00:18:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM146", "review": "Easy class; showed up half the time and barely made it to the final. RR gave quick quizzes and online Homeworks which were a super easy way to boost your grade. Exams are fair. Approachable outside of class and very nice and understanding. Knows what she's doing, but sometimes has trouble conveying it. ", "rating": 3, "expected_grade": "A", "created": "2010-04-19T17:26:00Z"}, {"professor": "Janice Reutt-Robey", "course": "CHEM146", "review": "Dr. Reutt-Robey is a very quiet and reserved professor.  She seems very reclusive, anti-social, and kind of a hermit.\n\r\nWith all that said, she is very very knowledgeable on the subject of chemistry and is very approachable outside of the large lecture hall.", "rating": 2, "expected_grade": "B", "created": "2009-03-26T21:25:00Z"}], "name": "Janice Reutt-Robey", "slug": "reutt-robey"}