{"courses": ["HESP300", "HONR279Y", "HESP818C", "HESP818", "HESP214", "NACS898", "EXST030", "HESP468H", "NACS799", "HNUH278A", "HESP300", "HESP468H", "HNUH278A", "HESP468H", "HNUH278A", "HESP468H", "HNUH278A", "HESP300", "HESP468H", "HESP214", "HESP468H"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Jared Novick", "course": "HESP214", "review": "Dr. Novick is absolutely the best. He is super clear in his lectures and made the class super easy to understand even if you have little to no science background (I'm a business major). I loved this class, it was an easy class that got me thinking differently than the rest of my core classes! ", "rating": 5, "expected_grade": "A+", "created": "2019-10-29T17:02:23Z"}, {"professor": "Jared Novick", "course": "HESP214", "review": "Amazing professor! Truly cares about his student's success. I took this course while it was online and it took up maybe 1-2 hours max a week. So worth it!!", "rating": 5, "expected_grade": "A+", "created": "2020-12-20T19:21:27Z"}, {"professor": "Jared Novick", "course": "HONR279Y", "review": "Took this course last year and loved it. Novick gets to know each student and cares for them. Lectures were always easygoing and fun. You get what you put in, so he expects you to do the readings and think critically. Super supportive, you don't have to be a language science major to learn a lot from him.", "rating": 5, "expected_grade": "A", "created": "2021-03-23T16:24:35Z"}, {"professor": "Jared Novick", "course": "HESP214", "review": "Took online and asynchronous. He always made sure that students knew he was there for us. The class itself can be hard if you're not experienced in reading and analyzing scientific papers. Read a couple web articles a week and a scientific paper ~every 2 weeks. Workload also includes writing summaries for 4 scientific papers. Final is a paper reflecting on what you learned.", "rating": 5, "expected_grade": "A", "created": "2021-05-25T22:06:58Z"}, {"professor": "Jared Novick", "course": "HNUH278A", "review": "Kind of a GOAT. The workload is super light - four article summaries and three reflections make up a large part of the grade, each one having a two page *maximum*. The subject is also pretty interesting, and Novick is super enthusiastic and caring, and makes you want to learn more. Overall, a really great and easy course, and you learn a lot about the issues discussed.", "rating": 5, "expected_grade": "A+", "created": "2022-11-05T04:19:59.580875Z"}, {"professor": "Jared Novick", "course": "HNUH278A", "review": "He makes lectures feel like TED Talks and the subject itself is something I think most would have at least a mild interest in. He's very knowledgeable when it comes to the subject material and is really enthusiastic about transferring his passion to the class though not in an overly didactic way. \r\n\r\nOverall, the class was pretty easy with its workload with lighter readings and short 1-2 page writing assignments every week or so. As long as you put in a genuine effort to keep up (attend lectures, read the readings and answer discussion questions), you're basically guaranteed an A.", "rating": 5, "expected_grade": "A+", "created": "2022-12-20T07:21:15.036799Z"}, {"professor": "Jared Novick", "course": "HNUH278A", "review": "Dr. Novick is an extremely kind professor and kept our classes engaging. He is an understanding and thoughtful professor, and the workload was never too much. As long as you show up to classes and participate you should be able to do well in this course. He definitely sets you up to succeed!", "rating": 5, "expected_grade": "A", "created": "2023-04-26T23:06:36.887595Z"}, {"professor": "Jared Novick", "course": "HNUH278A", "review": "Literally such a caring and nice professor! His lectures are surprisingly entertaining/engaging and he is always receptive to our feedback as to how to make the class better. Also a very lenient grader, no terribly difficult assignments, and fun activities occur throughout the semester!", "rating": 5, "expected_grade": "A+", "created": "2023-05-26T19:02:37.526030Z"}, {"professor": "Jared Novick", "course": "HNUH278A", "review": "If you have the opportunity to take him for a class, take him. He is the most caring and personable professor I've ever had and you can tell he really cares about every student. He wants you to learn (!!!) and the class is not a lot of work at all. Even if you're not a language science person, it is still interesting.", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T02:02:29.588394Z"}, {"professor": "Jared Novick", "course": "HNUH278A", "review": "Great professor and very kind man who really cares about students and is passionate about the material he's teaching! He gives helpful feedback on assignments and really wants to see students succeed both inside and outside of his class. He makes himself available to help outside of class and is super flexible and understanding of different circumstances and situations students are in. In addition, he's an entertaining lecturer who actually makes you want to come to class! Highly recommend taking one of his classes if you can.", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T21:25:23.980509Z"}, {"professor": "Jared Novick", "course": "HNUH278A", "review": "LOVE THIS MAN.", "rating": 5, "expected_grade": "A+", "created": "2023-12-17T18:07:43.906655Z"}], "name": "Jared Novick", "slug": "novick"}