{"courses": ["ARTH290", "ARTH488F", "ARTH489F", "ARTH484", "ARTH789A", "ARTH488C", "ARTH389K", "ARTH789B", "ARTH488R", "ARTH389R", "ARTH488I", "HHUM205", "FILM426", "FILM429C", "WMST498J", "FILM329K", "FILM359N", "FILM429I", "FILM329B", "FILM359G", "SLLC368B", "SLLC368G", "ARTH488T", "ARTH389Q", "ARTH489Q", "FILM359X", "FILM429G", "FILM329D", "SLLC368D", "FILM329M", "FILM459M", "EXST030", "ARTH488X", "FILM429L", "HONR239Q", "SLLC368M", "SLLC468M", "ARTH778A", "FILM329C", "SLLC368C", "ARTH392", "FILM329L", "CINE329C", "CINE329D", "WGSS498J", "ARTH391", "CINE426", "CINE335", "ARTH392", "ARTH488C", "CINE337", "CINE429C", "FILM329L", "WGSS498J", "ARTH391", "ARTH778A", "ARTH778B", "CINE335", "CINE329D", "CINE359T", "SLLC368D", "SLLC368N", "CINE329B", "CINE459M", "SLLC468M", "CINE329B", "CINE459M", "SLLC368B", "SLLC468M", "ARTH392", "ARTH489L", "CINE337", "CINE459L", "WGSS498K", "ARTH391", "ARTH428X", "ARTH698", "ARTH778C", "CINE335", "ARTH392", "ARTH488Z", "CINE337", "CINE459Y"], "average_rating": 4.2, "type": "professor", "reviews": [{"professor": "Jason Kuo", "course": "ARTH290", "review": "Our grade was based on 5 quizzes (he drops 1), 2 papers, 1 midterm and 1 final(cumulative).  I took this course in 2012 Fall semester, Dr Kuo is nice person, but the lecture is really boring; however, you have to take good notes to be prepared for the exam. I only give 3 stars to Dr Kuo, but 5 stars to my TA:Madeline Gent. Ye, she is strict, but she really help you to understand the course content that covered by Dr. Kuo. I have taken some core courses, many TA just go over the assigned reading that is totaly not related to the course materials, but Madeline is not the one. She will cover the important materials and make sure you understand it.  One thing needs to be mentioned: our exams and paper topics were determined by the TAs, the mid-term final, and quizzes was format in matching(vocab), multiple choices(from your notes), fill in blank, and short answers. No long essay which is my favorite part. It would be painful for someone to memorized over 100 slide IDs and vocab for the exam. But for me, it's fine ", "rating": 4, "expected_grade": "", "created": "2013-04-11T21:33:00Z"}, {"professor": "Jason Kuo", "course": "ARTH290", "review": "PERSONAL BACKGROUND:\r\nI took this class because I needed to fulfill a \"History/Theory of the Arts\" requirement for CORE. I was a spring transfer so I only chose it because it fit my schedule - I had very limited options!\n\r\nAt first, I hated the class, but I grew to appreciate it because it really did open my mind to Asian culture/philosophy/art.\n\r\nIt should be noted that Dr. Kuo is not a consistent teacher of this class and only teaches this large lecture every few semesters.\n\r\nHOMEWORK:\r\nFor those of you who are unfamaliar with Art History (as was I), the class is reading intensive. The readings will come from the assigned books (yes, you'll have to purchase multiple small books) and posted PDFs. The book readings are quite dull, but the PDFs are more student friendly. From the readings, you'll have to grab overall concepts and memorize vocab if any are mentioned. I'd recommend doing the reading AFTER the lecture because then you can sort out what you really to know. \n\r\nLECTURE:\r\nExpect a very large lecture hall. The lecture will consist of Dr. Kuo presenting a slideshow of different Asian art. He starts his lecture with a brief historical background and then talks about each art piece featured. His analysis of the culture/art is fantastic and very interesting. He is very insightful and has a great command of English grammar. He also tries to inject humor every now and then. However, Dr. Kuo is very old and has a strong Chinese accent, so you'll need to be very attentive to pick up on what he is saying. Often, I'd be knocked out by the last 10-15 minutes. The lectures reinforce the readings and his analysis can help you on the essay section of the tests. It is not imperative to attend the lecture (I skipped a few times), but I recommend going.\n\r\nTESTS:\r\nYou will have 1 midterm, 1 final, and several quizzes throughout the semester. They are all similar in format. For the midterm & final, you'll have to memorize the artist/title/date/medium/dynasty for 60+ images that they post on Blackboard. You'll also have to memorize vocab terms and enough art history to do well on the compare&contrast essay. You will definitely have to do a lot of studying and memorization to succeed on these tests. It is a lot to memorize, but if you review the image IDs/readings every week (or at least a few days before the test) you'll be fine.\n\r\nMUSEUM PROJECTS:\r\nYou'll have 2 3-pg visual analysis essays throughout the semester. These will require you to visit the Freer&Sackler Art gallery in DC. With no art history background, I initially found these assignments to be challenging. Luckily, my TA was a great resource for teaching me how to analyze an object and then write about it. \n\r\nDISCUSSION SECTION:\r\nYou basically have to attend the discussion sections. They go over important concepts that you need to know for tests. Additionally, this is where you'll be taking your quizzes, receiving clarification about subjects, AND receiving instructions about other assignments. \n\r\nTEACHER ACCESSIBILITY: \r\nFor me, Dr. Kuo was a wise old man who was not to be approached. I just can't imagine approaching him outside of class and asking him to help me write an art analysis paper! My most important resource was my TA. \n\r\nOVERALL:\r\nThis class was a real wildcard for me. I never thought an art history class could be so insightful. I thought I would fail the class, but ended up earning an A+. It was very intensive, but also very eye-opening. I'd recommend it - but of course, if you're looking for an easy HA, this is NOT the course for you!\n", "rating": 4, "expected_grade": "", "created": "2011-05-31T16:07:00Z"}, {"professor": "Jason Kuo", "course": "ARTH290", "review": "Our grade was based on 5 quizzes (he drops 1), 2 papers, 1 midterm and 1 final. The final covers the second half of the class and is NOT cumulative. We also had an additional paper for 5% extra credit.\r\nThe quizzes if you pay attention to your TA, in the previous discussions and memorize all the object ID's, you'll be good.\r\nThe papers are 3 pages long and its complete BS. As long as you write 3 pages and answer all the questions, you will get an A.\r\nThe midterm had three parts: object ID's, matching and a comparative essay. Object ID's were complete memorization. Matching was a list of vocab words that they tell you. The comparative essay was comparing two images and talking about them. If you remember atleast some of the things your TA mentioned in discussion, you are good to go. The final was exactly like the midterm.\r\nDr. Kuo is a really bad professor. He has an accent and mumbles into the microphone. There were only two classes when I was able to stay awake and take notes and that was when the TA's were subbing for him. He assigns a ridiculous amount of reading, which I never read. The class is supposed to be about Asian art but its primarily focused on JUST Chinese. We probably had 2 weeks about Japanese art and 2 weeks about Indian art. Everything else was Chinese. \r\nTo do well in the class:\r\n1. make flash cards and spend a couple hours the night before the quiz/exam memorizing them.\r\n2. Go to every TA discussion and take notes. Going to class is completely pointless.", "rating": 3, "expected_grade": "A+", "created": "2011-05-21T14:21:00Z"}, {"professor": "Jason Kuo", "course": "CINE337", "review": "I don't think I learned much in this course, but I got to watch good movies, so who am I to complain? Professor Kuo does not do any actual teaching, there is no lecture. We watch a movie in every class and have a 5-minute discussion afterward. There are 4 papers that are not difficult and one final exam in class. This class is just an excuse to watch some really good movies.", "rating": 5, "expected_grade": "A", "created": "2023-11-09T02:34:37.698160Z"}, {"professor": "Jason Kuo", "course": "ARTH489L", "review": "One of the sweetest and chillest professors I've had at UMD! We watched a film every class and then had a short discussion. You can tell he's passionate about film and wants you to be too. He's not a harsh grader and made it clear the papers are more for your learning and exploring what interests you. Only assignments are 5 papers and a short take home final.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T03:20:05.152181Z"}], "name": "Jason Kuo", "slug": "kuo"}