{"courses": ["ENGL394", "ENGL395", "ARHU275", "ENGL275", "ENGL394", "ARHU275", "ENGL275", "ENGL394"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Jay Wilcox", "course": "ENGL394", "review": "Professor Wilcox is an exceptional professor who really cares about Business Writing and puts in the effort to make the class as enjoyable as possible. He is very well-spoken, extremely friendly, and is always there to help you. His classes are some of the most engaging I've ever been to, which really helps you to remember the content that is closely aligned with the major writing assignments. He prepares you well for the assignments by going over examples and peer-reviewing papers to highlight what he's looking for, as well as detailed feedback on each paper to help you on the next. There are many opportunities for extra credit and ample time to complete each assignment. Jay Wilcox is one of those professors you just never forget, and I guarantee you won't regret taking ENGL394 with him.", "rating": 5, "expected_grade": "A+", "created": "2022-12-05T23:44:44.739766Z"}, {"professor": "Jay Wilcox", "course": "ENGL395", "review": "Professor Wilcox is definitely a professor I will never forget! Professor Wilcox was a great professor who genuinely wanted his students to be better writers in the professional setting while at the same time providing multiple opportunities to excel in his class. The class was at 11 am at Tawes so it was quite a walk from where I lived, but I always tried to attend class even though attendance wasn't mandatory. Professor Wilcox made the class very interactive, interesting, and fun while still keeping a very professional setting. He even allowed us to revise any major assignments for points back if you did poorly. If Professor Wilcox is teaching for your semester, he is an absolute MUST PICK of a professor, you will not regret it!!!", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T08:06:12.718567Z"}, {"professor": "Jay Wilcox", "course": "ENGL394", "review": "If Wilcox is teaching, Just take the class! Seriously!! You wont regret it....", "rating": 5, "expected_grade": "A+", "created": "2023-01-06T12:06:17.949904Z"}, {"professor": "Jay Wilcox", "course": "ENGL275", "review": "Professor Wilcox is one of the best professors I have had at the university. His priority is not harsh grades or strict criteria, rather his sole focus is helping you improve as a writer. His classes were engaging and entertaining while also providing valuable insight. I highly recommend taking this course or any other taught by him.", "rating": 5, "expected_grade": "A+", "created": "2023-12-04T15:33:36.321454Z"}, {"professor": "Jay Wilcox", "course": "ARHU275", "review": "Professor Wilcox is one of the best professors I've ever had. He is always super friendly and helpful, not a harsh grader at all and is solely focused on helping you improve your skills as a writer. He is super welcoming and open to any and all ideas that his students have to offer and is super easy to come to with questions or concerns. I would highly recommend taking any class he teaches!", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T20:08:56.048856Z"}, {"professor": "Jay Wilcox", "course": "ENGL275", "review": "BEST TEACHER EVER!! I love how encouraging he is towards your work and makes an effort to seem as engaging as possible. If you're trying actually to improve in your writing pick him, I would do it a hundred times over.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T03:56:07.045212Z"}], "name": "Jay Wilcox", "slug": "wilcox_jay"}