{"courses": ["AOSC652", "AOSC458J", "AOSC247", "AOSC123", "AOSC200", "GEOL123", "AOSC201", "AOSC123", "AOSC200", "GEOL123", "AOSC123", "AOSC200", "AOSC652", "GEOL123", "AOSC200", "AOSC247", "AOSC200", "AOSC201", "AOSC200", "AOSC247", "AOSC200", "AOSC247", "AOSC123", "AOSC200", "AOSC652", "GEOL123", "AOSC200", "AOSC247", "AOSC123", "AOSC200", "AOSC652", "GEOL123"], "average_rating": 4.7838, "type": "professor", "reviews": [{"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "He's very nice and reasonable with grades/assignments. Is definitely willing to help when you ask for it. However, his synchronous sessions were often slow and unhelpful, making it more of a self-learning course from the textbook. Still, tests were closely related to the material and were by no means too difficult.", "rating": 4, "expected_grade": "", "created": "2020-12-20T18:02:02Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC123", "review": "Really chill and really likeable guy. Class was easy, only two easy midterms and a final 6-10 page paper, which was not bad. No readings necessary, discussion and lecture were basically optional. You can take this class online no problem, as the modules contain all of the information you need. Quizzes are plentiful and are a small portion of your grade and are extremely easy. Recommend the class for gen ed.", "rating": 5, "expected_grade": "A", "created": "2021-12-04T13:04:39Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Really cool and engaging professor. I found the course super interesting with the way he taught it and he always explained all the concepts really really well. Even when the textbook felt hard to grasp, he made it seem so simple and easy to understand. Overall just a great professor. The quizzes were open-book, lectures prepared you more than enough for the midterm, workload is light besides the occasional group project in the discussions. Would highly recommend.", "rating": 5, "expected_grade": "A", "created": "2021-12-09T23:04:00Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Great teacher, always willing to answer questions and makes review/lectures engaging with Kahoots, and icebreakers. Also canceled the final due to COVID concerns, which really helped with dealing with stress and preparation for other exams. ", "rating": 5, "expected_grade": "A", "created": "2021-12-17T06:14:27Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "I took Professor Henrikson for AOSC200 and paired it with AOSC201 lab. I got an A in 200 and A+ in lab. Really interesting professor and an interesting class. The projects are kind of intensive but graded easily. He records lectures and answers every question that students have. He has 2 quizzes and 1 midterm along with the final, which he made optional due to a rise in covid cases. Take this class with Jeff if you need DSNS/DSNL class", "rating": 5, "expected_grade": "A", "created": "2021-12-22T02:03:45Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC123", "review": "He is an incredibly understanding professor and genuinely wants to see students succeed. He's passionate about what he teaches which made the course very meaningful. He is accessible outside of class and all his assignments have clear rubrics. One of the best professors at UMD.", "rating": 5, "expected_grade": "A+", "created": "2021-12-22T05:22:13Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC652", "review": "Literally the most understanding and flexible professor at the university! Always willing to help you understand things! Best professor I've had at the university! ", "rating": 5, "expected_grade": "A", "created": "2021-12-22T19:28:36Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Had him for the winter course version! Although fast-paced, he always explained things well and was super helpful during office hours! Genuinely wants students to succeed! ", "rating": 5, "expected_grade": "A", "created": "2021-12-22T19:31:54Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "A fast-paced, manageable winter course that will teach you the ins and outs of the weather and its relevance to your everyday life beyond simple forecasts. Held asynchronously online, this course was a sure way to knock out a science Gen Ed and the professor, Jeff Henrikson, is exceptional. His video lectures are clear and concise, giving you the ‘need to know’ minus the fluff. While a textbook is required, the exams are 90% according to the videos so watching Jeff’s lecture videos will suffice if you want an A. The topics are engaging and require little to no math, making this course perfectly suited for a non-science major looking to take a science course/lab and earn a high grade. Granted, it takes a considerable amount of work to earn a high grade, but it’s not because Jeff is a harsh grader - he’s fair and considerate - but rather, the course is condensed into 3 weeks so there’s much to cover and learn. However, whenever you need help, Jeff is there and holds Zoom office hours 4x a week. Overall, this is a must take if you are reading reviews of science courses and wondering: ‘which is going to make me the least stressed, the most interested, and the most invested?’ This is the one. Take it.", "rating": 5, "expected_grade": "A", "created": "2022-01-23T19:09:55Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "I never write any professor reviews but this professor is literally so flexible, understanding and helpful that you just have to take him for this course. ", "rating": 5, "expected_grade": "A", "created": "2022-01-24T15:28:56Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Took him for the winter version of this course. A very easy and simple lab class to complete. All the instructions and assignments were easy to find and follow. Definitely a good lab for the winter if you need to fulfill a gen ed.", "rating": 5, "expected_grade": "A", "created": "2022-01-25T00:55:16Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Great, enthusiastic and understanding professor. While AOSC200 was fairly easy, he was very knowledgeable and easy to talk to if you had a genuine interest in the topics. ", "rating": 5, "expected_grade": "A", "created": "2022-02-02T17:42:37Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC247", "review": "Amazing professor, literally nothing bad to say at all. Going to echo the other reviews in saying he is understanding and easily approachable. Also highly recommend AOSC247 as a class.", "rating": 5, "expected_grade": "A", "created": "2022-05-23T02:28:09Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff is a great professor. You can tell he's passionate about Atmospheric and Oceanic science and he wants his students to succeed. He's extremely understanding and overall very positive and welcoming.", "rating": 5, "expected_grade": "", "created": "2022-09-15T18:39:38.161342Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Great professor, very passionate and very understanding. Exams not super challenging and ample prep is given. Would highly recommend his class.", "rating": 5, "expected_grade": "A", "created": "2022-10-24T23:42:54.217561Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Take it during the summer for an easy A. Quizzes/Exams go online, and they conduct the experiments for you in AOSC201 the lab. Not a class that requires a lot of studying imo.", "rating": 5, "expected_grade": "A", "created": "2022-11-28T02:54:57.457954Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Most kind and caring professors out there. He really wants his students to do well and is willing to accommodate for his students. He understand that the majority of people that take this class are not science people and he explains concepts in ways that are easy to understand. He also records all of his lectures and if you're ever confused about anything he is willing to go on zoom, one on one to help you. The workload is manageable, there were small quizzes due before each lecture and a weekly assignment that were pretty easy. There we 2 big projects in the discussion sections, as long as you don't have a bad group you’ll be fine. As far as the content in the class itself, I learned a lot of things about the world around me that I never knew and it was genuinely interesting. Jeff is a great guy and a great professor.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T00:22:11.947793Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Great professor, highly recommend this class for lab gened", "rating": 5, "expected_grade": "A+", "created": "2022-12-18T13:17:14.684931Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "He's a great prof but an even better guy. The final was from 4-6pm...WRONG. It was 10:30am. I missed it. He emailed me back within two minutes and said I could take it in his office. I get to his office crying and he gives me gatorade and chocolate and an office to cry in and tells me I should compose myself before taking it because I can't take a test while crying. He encouraged me to ask him questions before I took the final. He has a turtle named Aida. No other professor would have even responded to my email. The final was directly relevant to what we learned. Things definitely could've gone worse from missing a final, but things couldn't possibly have  gone better.", "rating": 5, "expected_grade": "A", "created": "2022-12-19T11:45:47.147237Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff was a very kind professor. He seemed really friendly and caring, and the class was very straightforward. I didn't go to class often since the textbook was enough to prepare for exams, but the exams were fair and his lectures were usually interesting.", "rating": 4, "expected_grade": "A", "created": "2022-12-20T19:45:49.436919Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC247", "review": "This dude is the GOAT. Take AOSC247 if you want to pick up some coding skills while not having to deal with all the pressure and deadlines of the normal comp sci classes. He teaches the concepts really well and is super nice. He would create zoom meetings and meet with you outside of class just to get you caught up and help you out on assignments. He also doesn't have a late penalty on his assignments as long as you talk to him and let him know. Great guy, one of the best professors I've had.", "rating": 5, "expected_grade": "A+", "created": "2022-12-25T19:03:38.216355Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff is the sweetest person ever. However, his lectures of kind of boring. This is not because he is boring, the topic is just not the most interesting. But it is a generally easy class where all you gotta do to get an A is: read the textbook, go to lecture close to exam time for his review session, and do your part in the group projects. Don't really have to go to lecture and it's recorded anyway.", "rating": 5, "expected_grade": "A", "created": "2022-12-26T03:47:06.307581Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "if you go to class you will get an A. I got a B+ because I skipped 75% of them", "rating": 4, "expected_grade": "B+", "created": "2023-01-02T02:13:01.080326Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Came in expecting this class to be very dull (just taking it for gen ed credit), but I was pleasantly surprised with how the material was presented. Not only were his lectures easy to follow, but you can tell he is very passionate about the subject matter and brought in a lot of examples applicable to our lives. Couldn't recommend his class more! Only downside was the discussion portion of this class, but this is led by TAs and consists of two group projects which can get a bit boring", "rating": 5, "expected_grade": "A", "created": "2023-01-16T21:53:50.615208Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC123", "review": "Best professor ever. He is super passionate about what he teaches and teaches it very well. The final is honestly really fun even if you are not a science person. The class is easy to follow and keep up with. If you struggle with anything he will be super understanding and flexible as long as you communicate with him. Recommend 100%", "rating": 5, "expected_grade": "A+", "created": "2023-01-26T17:55:21.844153Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "The goat", "rating": 5, "expected_grade": "A+", "created": "2023-02-09T18:07:18.560724Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Prof Henrikson is very welcoming and clearly passionate about atmospheric science. A very understanding professor with a refreshing attitude. If you're going to take AOSC200, Prof Henrikson is simply the way to go.", "rating": 5, "expected_grade": "A-", "created": "2023-04-26T22:04:54.037698Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff is an extremely kind and thoughtful professor. This class was not too difficult if you show up and take notes. Lectures can be a bit boring though.", "rating": 4, "expected_grade": "A-", "created": "2023-04-26T23:13:33.561677Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff is the best he's really cool and relax on the work side. If you pay attention and attend lectures and essentially do the bare minimum you will learn alot in this class. He's really great at explaining and really approachable. Honestly just take him and you will see why he's so highly rated.", "rating": 5, "expected_grade": "A", "created": "2023-05-11T05:27:37.534231Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff is a great guy. Does his best to make lectures interesting, and is easy to talk too. He’s very accommodating and willing to help out with any extenuating issues you may have. I’m not a science major so I found this course taught by him is a good bet to knock out the gen-ed requirement. I think the weather stuff is interesting to know about too.", "rating": 5, "expected_grade": "A-", "created": "2023-05-13T20:53:57.291873Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff is an awesome professor. You can tell he actually cares about his students and their well-being. The exams are not difficult if you show up to lectures and understand the material. I learned a lot and enjoyed this class because of him. Would recommend.", "rating": 5, "expected_grade": "A", "created": "2023-05-22T23:46:54.710055Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "This dude is a great professor. In terms of the course there is a fair amount of padding that he gives you to get a good grade. The admission tickets, weekly activities, and the group project are a fairly easy 95%+ as long as you do the work.  This means you need to make sure you do good enough on the quizzes and exams. The quizzes are open note and the he gave us a review for the midterm and final so that we were very prepared for them. The final even had a fair bit that was word for word a copy from the review. In addition, he essentially gave us 2 extra credit points on both the midterm and final. In terms of a professor I echo the other reviews, he is extremely nice and helpful. I went to his office to correct some grading, and he was extremely fair. He also has a turtle in his office which was awesome. Lastly this doesn't really matter but the boundary for an A+ was a 98 which I don't even know how others are able to do that well but it feels a bit high. Overall, if you have the option to take him PLEASE DO, great professor.", "rating": 5, "expected_grade": "A", "created": "2023-12-22T23:18:08.742212Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "I took AOSC123, AOSC200, and AOSC201 with Jeff in the same semester as a CS Major. I would definitely recommend Jeff for any of these classes. He is very passionate about the content and is happy to answer any questions. He's also very flexible and understanding with deadlines. The only downside is that his lectures can be boring at times. You can get an A in his class without putting too much effort in. Good natural science choice.", "rating": 5, "expected_grade": "A", "created": "2023-12-31T03:02:08.320079Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "Jeff does a great job and explaining the content and makes good slides that he presents well. The class is overall fine but is not as easy as you might hear it is. If you have a heavy schedule it might be harder to manage than you expect. Aside from that, you learn a lot and it is pretty interesting.", "rating": 5, "expected_grade": "B+", "created": "2024-01-01T19:04:38.681748Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC123", "review": "This class was incredibly easy, and Professor Henrikson made it like that. If you put in the bare minimum effort you will get an A, anything more and you will get an A+. He wants all of his students to succeed, and there is not a single complaint I have about his class.", "rating": 5, "expected_grade": "A+", "created": "2024-01-03T22:04:02.731748Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "I took this course in the winter, along with the lab. It's super fast-paced, but you only spend maybe 2-3 hours each day (sometimes 4). The lecture videos were easy to understand, and I learned much about weather and climate from this class. A lot of the content was very applicable to my daily life as well. Dr. Jeff was really friendly and super helpful during office hours. For each test, he did Kahoots for exam review, which was awesome, and in some discussion posts, he had us send weather/climate memes. There's also no final exam for the winter term.", "rating": 5, "expected_grade": "A", "created": "2024-01-20T06:17:25.693024Z"}, {"professor": "Jeffrey Henrikson", "course": "AOSC200", "review": "This class was very tedious. Was looking for an easy A, but not the case. Look for easier Gen Ed.", "rating": 1, "expected_grade": "C+", "created": "2024-03-25T21:11:39.599593Z"}], "name": "Jeffrey Henrikson", "slug": "henrikson"}