{"courses": ["THET285", "SPHL601", "SPHL602", "SPHL603", "THET310", "THET285", "THET285", "THET285"], "average_rating": 4.8, "type": "professor", "reviews": [{"professor": "Jennifer Ring", "course": "THET285", "review": "really nice professor and very easy class. it actually teaches you to become a better presenter and i can definitely see my improvement in that aspect from the beginning of the semester. it's also a pretty interesting class with interesting conversations ", "rating": 5, "expected_grade": "A+", "created": "2021-12-09T05:57:19Z"}, {"professor": "Jennifer Ring", "course": "THET285", "review": "Jen is a very nice professor who is definitely knowledgeable about public speaking, acting, and theatre in general. Her class is less hw but more reliant on participation (not that she gives participation points) so it’s important that you attend so you don’t miss important information and learning. She is very lenient and open to communicate with students. Though her methods can be a bit questionable, they are very engaging and can be helpful. I definitely recommend you take her!!", "rating": 5, "expected_grade": "", "created": "2021-12-19T18:38:43Z"}, {"professor": "Jennifer Ring", "course": "THET285", "review": "Professor Ring is super passionate about theater and knows a good deal about public speaking. The workload was also light, which made the class more enjoyable. There is a large participation grade, however, so be prepared to speak in class.", "rating": 5, "expected_grade": "A", "created": "2021-12-31T06:03:37Z"}, {"professor": "Jennifer Ring", "course": "THET285", "review": "amazing class. take it", "rating": 5, "expected_grade": "A", "created": "2024-01-23T20:40:59.695329Z"}, {"professor": "Jennifer Ring", "course": "THET285", "review": "Easiest class I've ever taken. She will give you an A as long as you put effort into what you're doing. Pretty much no work outside of class. Just be careful though. I thought this was a public speaking class but it was more of an acting class. Get ready to do weird acting exercises and act.", "rating": 4, "expected_grade": "A+", "created": "2024-01-29T06:37:20.820924Z"}], "name": "Jennifer Ring", "slug": "ring_jennifer"}