{"courses": ["ENSP102", "ENSP330", "ENSP400", "ENSP340", "ENSP342", "GEMS296", "GEMS396", "ENSP399E", "GEMS297", "GEMS397", "GEMS496", "GEMS497", "ENSP370", "ENSP330", "ENSP330", "ENSP400", "ENSP102", "ENSP330", "ENSP370", "ENSP330", "ENSP400", "ENSP102", "ENSP370", "ENSP330", "ENSP400"], "average_rating": 4.9231, "type": "professor", "reviews": [{"professor": "Joanna Goger", "course": "ENSP400", "review": "Easy, sort of a pushover. Very interested in policy, obviously. Her tests are a breeze. Values participation and attendance, but it won't make or break your grade. Take advantage of extra credit if you want an A+, I guess. ", "rating": 4, "expected_grade": "A-", "created": "2012-12-19T13:09:00Z"}, {"professor": "Joanna Goger", "course": "ENSP102", "review": "I've had Dr. Goger for Ensp102, and capstone, and she's great. She makes everything interesting, gets the class to participate, and you really learn. In her policy class, she did a great job of incorporating very current news in environmental science. I wish I could fit her environmental law class into my schedule as well. ", "rating": 5, "expected_grade": "", "created": "2012-10-25T12:50:00Z"}, {"professor": "Joanna Goger", "course": "ENSP102", "review": "Awesome teacher. She is a really nice professor who knows what she is talking about. The course is not very challenging if you go to lecture. There are a few easy homework assignments and a research paper and also the opportunity for extra credit. Take this class!", "rating": 5, "expected_grade": "A", "created": "2011-05-19T15:26:00Z"}, {"professor": "Joanna Goger", "course": "ENSP330", "review": "Professor goger is a fantastic teacher who really cares about policy and law. She's very fair about what she expects and while her tests are a lot of writing, if you show up to class and actually do the work and pay attention, you should do well. One of my favorite teachers and courses. ", "rating": 5, "expected_grade": "A-", "created": "2018-03-28T15:59:07Z"}, {"professor": "Joanna Goger", "course": "ENSP400", "review": "Goger is my inspiration for joining ENSP and teaches in a way where law is actually fascinating. She is super approachable, exams in ENSP330/ENSP102 are fair, and has clear expectations for all of her courses (including ENSP400). ", "rating": 5, "expected_grade": "A", "created": "2018-12-11T22:52:55Z"}, {"professor": "Joanna Goger", "course": "ENSP102", "review": "Professor Goger was a great professor for environmental policy, even during online lectures. She was constantly engaging with the class by asking questions, doing polls, and asking for our opinions on current events relating to environmental policy and politics. I would say you definitely need to pay attention to everything as her tests are application-based. The memo assignment that stretches throughout the semester is simple enough as long as you keep up with the work. She was very understanding of how we felt about being online the entire semester and managed to make the class seem interesting. Overall, she’s a great professor!", "rating": 5, "expected_grade": "A", "created": "2021-05-17T01:04:35Z"}, {"professor": "Joanna Goger", "course": "ENSP102", "review": "Goger is a great professor. She is always keeping the class engaged with the class. She encourages discussion during lecture (so much that we usually had to rush to finish the rest of the lecture) and updated her slides as news came out. I wasn’t 100% I wanted to be an ENSP major before this class, but Goger’s interest in the materials convinced me to stay an ENSP major. I’m excited to take her 330 class in a couple of years :)", "rating": 5, "expected_grade": "A", "created": "2021-05-17T16:12:54Z"}, {"professor": "Joanna Goger", "course": "ENSP102", "review": "LOVE PROFESSOR GOGER! Super interesting class and she is so sweet. TA's are also really helpful and the tests are easy if you go to the review sessions and take notes. Take this class", "rating": 5, "expected_grade": "A", "created": "2022-04-28T01:30:55Z"}, {"professor": "Joanna Goger", "course": "ENSP102", "review": "Knows her stuff, always willing to help", "rating": 5, "expected_grade": "A+", "created": "2022-05-15T01:22:36Z"}, {"professor": "Joanna Goger", "course": "ENSP102", "review": "Professor Goger's ENSP102 is very easy to do and does not expect much of you. It is so nice to have a light class. She is a very nice professor and is very fair.", "rating": 5, "expected_grade": "A", "created": "2023-04-26T23:33:17.403948Z"}, {"professor": "Joanna Goger", "course": "ENSP102", "review": "Genuinely the nicest professor I’ve had at UMD so far. You can tell she’s super interested and knowledgeable in the subject and always goes out of her way to answer students questions. Exams were fair and the amount of work was reasonable in my opinion.", "rating": 5, "expected_grade": "A+", "created": "2023-05-21T19:46:21.531612Z"}, {"professor": "Joanna Goger", "course": "ENSP102", "review": "I absolutely loved Professor Goger this semester. She is so knowledgeable, engaging, and overall just a very sweet woman who cares about her students. We only had a handful of homework assignments, majority of which tied into our final memo assignment. Great professor, she was such a delight for my first semester at UMD. The TAs are also amazing people who know their stuff and are very willing to help!", "rating": 5, "expected_grade": "A", "created": "2023-05-24T00:52:37.881899Z"}, {"professor": "Joanna Goger", "course": "ENSP330", "review": "I've had her for a few different classes. She's a gem. Super engaging, teaches very clearly, and such a nice person.", "rating": 5, "expected_grade": "", "created": "2023-11-07T20:10:38.772891Z"}], "name": "Joanna Goger", "slug": "goger"}