{"courses": ["HONR219D", "GEOL212", "GEOL342", "GEOL431", "CPSG230", "CPSG250", "GEOL331", "CPSP359G", "CPSG100", "CPSP118G", "CPSP218G", "CPSG240", "CPSG200", "GEOL388I", "BSCI392", "BSCI393", "GEOL391", "GEOL392", "BSCI333", "CPSG100", "CPSG200", "GEOL212", "GEOL331", "CPSG230", "CPSG240", "CPSG250", "CPSP359I", "GEOL431", "CPSG100", "CPSG200", "GEOL212", "GEOL342", "CPSP359G", "BSCI392", "BSCI393", "CPSG230", "CPSG240", "CPSG250", "CPSP359G", "GEOL391", "GEOL392", "BSCI333", "CPSG100", "GEOL212", "GEOL331", "GEOL386"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "John Merck", "course": "GEOL331", "review": "Dr. Merck is amazing! Kind, funny, engaging lectures and he is very clear about his expectations and always happy to help out. ", "rating": 5, "expected_grade": "A+", "created": "2018-11-20T06:09:20Z"}, {"professor": "John Merck", "course": "CPSG200", "review": "Funny, engaging, and extremely reasonable. One of the nicest professors who make learning actually interesting. If you can take him, do it!", "rating": 5, "expected_grade": "", "created": "2020-12-14T21:16:37Z"}, {"professor": "John Merck", "course": "CPSG100", "review": "He's a really nice, funny guy and tries to be engaging. He's also always available to help and will never shame anyone. Unfortunately, the online format of this course made it less interesting for Fall 2020, but Merck was still awesome nonetheless.", "rating": 5, "expected_grade": "", "created": "2020-12-20T17:56:06Z"}, {"professor": "John Merck", "course": "CPSG100", "review": "Dr. Merck was very kind and engaging! I remember that I emailed him to let him know that I wasn't going to be able to come to colloquium one day, and he made sure to check up on me afterward. Great lecturer and definitely knows his stuff", "rating": 5, "expected_grade": "A", "created": "2021-02-06T15:50:41Z"}, {"professor": "John Merck", "course": "CPSG101", "review": "Very, very kind person. Genuinely wants to see your success, grades leniently(although this is a 1 credit course). Is a great mentor and definitely someone you can reach out to for anything. He really does care about what he is teaching and does care about his students", "rating": 5, "expected_grade": "A+", "created": "2021-05-18T10:47:25Z"}, {"professor": "John Merck", "course": "CPSG200", "review": "Very easy 1 credit course, put almost no effort into it, but still gained a lot of good knowledge. Probs the best of the 3 cpsg courses ", "rating": 5, "expected_grade": "A+", "created": "2021-12-24T21:31:08Z"}, {"professor": "John Merck", "course": "GEOL212", "review": "If I could give Dr. Merck more stars I would. He seriously shines and has an evident passion for the class that made it incredibly enjoyable. He prioritized our learning and comprehension of the material and has solidified himself as my favorite professor at UMD so far with his humor and genuine zest for life. Although homework can be a bit tedious, the class content is incredibly interesting, and I think that anyone with even a slight interest in the solar system or astronomy would greatly enjoy this course. Cannot recommend Merck enough!", "rating": 5, "expected_grade": "A", "created": "2023-01-18T21:17:37.399522Z"}], "name": "John Merck", "slug": "merck"}