{"courses": ["ENGL101", "ENGL212", "ENGL265", "ENGL241", "LGBT265", "CMLT277", "ENGL250", "WMST255", "ENGL394", "ENGL101S", "ENGL360", "ENGL101S", "ENGL301", "ENGL222", "ENGL394", "ENGL301"], "average_rating": 4.7857, "type": "professor", "reviews": [{"professor": "John MacIntosh", "course": "ENGL101", "review": "Very energetic and enthusiastic. Flexible with his assignments as needed for the students' benefits. The class is not difficult, just tedious. The assignments are relatively and easy and well spaced out, and the final project begins as small assignments each consecutive assignments builds on the prior assignment, culminating in cool website project. He does grade a slightly harder than I would expect, but that is a personal opinion.", "rating": 4, "expected_grade": "A-", "created": "2020-03-25T17:05:51Z"}, {"professor": "John MacIntosh", "course": "ENGL101", "review": "Classes are a bit boring, but he is a nice guy and you can tell he cares about his students. He is very flexible and an easy grader. The assignments are fairly tedious though, especially the final paper, but he'll do his best to help you work through it.", "rating": 4, "expected_grade": "A", "created": "2020-12-10T04:48:30Z"}, {"professor": "John MacIntosh", "course": "ENGL101", "review": "Very nice guy and he makes his lectures interesting and entertaining. Though the content can be boring, it can be important for the assignment you are working on. He graded reasonably, and you'll get an A if you write your papers using the techniques and organization that he teaches you for that assignment. There is a decent more amount of work than I anticipated, but he is a good teacher, and I'd recommend taking him.", "rating": 5, "expected_grade": "A", "created": "2021-12-26T00:51:55Z"}, {"professor": "John MacIntosh", "course": "ENGL301", "review": "Really great guy! Dr. MacIntosh is incredibly nice and caring. He is very understanding and caring about his students and what they may be going through. He makes the classroom a very good learning environment for discussion-based classes and tries to engage meaningful conversations. He is thorough in the reviews of texts and makes sure that every students comprehends what they read. I found that he was a pretty lenient and easy grader. He leaves pretty good comments on essay assignments to know how to improve. The final was an accumulation of the semester, so it would be wise to take notes of keywords/concepts for the different units. Overall, he is a great guy that is a fantastic teacher! Definitely consider taking him. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-19T16:17:20Z"}, {"professor": "John MacIntosh", "course": "ENGL101", "review": "Easy and understanding. Take him", "rating": 5, "expected_grade": "A", "created": "2022-11-22T19:01:53.951113Z"}, {"professor": "John MacIntosh", "course": "ENGL101", "review": "Great teacher. Explains all the ideas in class well and is very helpful when needed. The coursework was a bit tedious, but he graded pretty leniently. As long as you put in a little effort you will get a good grade.", "rating": 5, "expected_grade": "", "created": "2022-12-05T15:09:17.902166Z"}, {"professor": "John MacIntosh", "course": "ENGL101", "review": "Very friendly with students, and very understanding to any extenuating circumstances. Really puts his students first and is very approachable with any questions you could have. Work can get a bit tedious but just talk to him if you are struggling, forgiving about late work as long as you talk to him. Grading is fair and comments on work are very helpful. Assignments are due at midnight and not the start of class, meaning you have the whole day after class to finish the work and still get it in on time if you need it. Class can get boring but try to answer the things he's asking, 9 times out of ten if you think you know the answer, you likely do and if you say the wrong thing it doesn't hurt you in any way", "rating": 5, "expected_grade": "A-", "created": "2022-12-12T00:23:14.391068Z"}, {"professor": "John MacIntosh", "course": "ENGL101", "review": "I love John, he is a really kind and understanding professor who really cares about his students. English 101 can at times be a really tedious course, but if you ever need help John will be more than happy to work with you. There are a lot of back to back papers in this course, but it is manageable if you pace yourself. If you're able to take John, highly recommend you do so!", "rating": 5, "expected_grade": "A-", "created": "2022-12-12T16:45:19.790191Z"}, {"professor": "John MacIntosh", "course": "ENGL101", "review": "Dr. Macintosh (but he's fine with just John) is a really great guy. He definitely cares about his students and he grades everything himself, meaning if you need help, he is easy and approachable. The course itself can be fairly tedious and is a bit of work, but if you manage your time and pace yourself it is easily passable. Highly recommend you take him if you can!", "rating": 5, "expected_grade": "A", "created": "2022-12-24T18:58:21.425868Z"}, {"professor": "John MacIntosh", "course": "ENGL101", "review": "Great professor. Overall very nice guy and is very lenient. Always wants to help you improve and get a better grade.", "rating": 5, "expected_grade": "A", "created": "2023-05-18T04:09:02.235131Z"}, {"professor": "John MacIntosh", "course": "ENGL101", "review": "Super nice guy, class has a bunch of smaller writing assignments that lead up to a larger \"position paper\". You can write it on anything you want, mine was on terrorism. Super good with giving feedback and lenient grades. In between each assignment is a \"peer review\" that is super helpful with the assignments and it is super clear what he is looking for. He makes sure to mix class time with lectures and discussions. There are readings every week that you discuss in class but honestly no one does them (Sorry Dr. MacIntosh).", "rating": 5, "expected_grade": "A+", "created": "2023-10-21T20:41:20.125351Z"}, {"professor": "John MacIntosh", "course": "ENGL101", "review": "Super nice always wanted to see you improve. But, he does not have any rubrics for any of your papers so the grading is very inconsistent. You will also have to make an infographic at the end, which is something that the other classes do not have to do. Overall I liked him even after all of that because he genuinely is super nice.", "rating": 4, "expected_grade": "A", "created": "2023-12-06T21:27:08.766692Z"}, {"professor": "John MacIntosh", "course": "ENGL101", "review": "AMAZING PROFESSOR. Best one you'll ever have at UMD.", "rating": 5, "expected_grade": "B+", "created": "2023-12-10T19:13:48.236896Z"}, {"professor": "John MacIntosh", "course": "ENGL101", "review": "I loved this professor. If you needed help he was always willing to meet with you. My class was half online half in person and it was great. The expectations for assignments are clear and he gives example essays for each assignment (if he doesn't just ask). I think he grades fairly and the workload is not too much, very spread out.", "rating": 5, "expected_grade": "A", "created": "2024-01-21T04:12:43.726848Z"}], "name": "John MacIntosh", "slug": "macintosh"}