{"courses": ["ENGL394", "ENGL394", "ENGL394", "ENGL394", "ENGL394"], "average_rating": 4.3333, "type": "professor", "reviews": [{"professor": "Jonathan Rick", "course": "ENGL394", "review": "I can’t believe I have to take him. My father saw us on zoom and heard a snippet of class, and was shocked and amused with how he stated subjective things as fact in such an arrogant manner. I feel like I will do well in his class, but he is an annoying teacher to have- not someone I would want to know in a personal or professional setting. And he does love talking about himself.", "rating": 1, "expected_grade": "A", "created": "2020-09-20T14:51:27Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Professor Rick equips you with practical tools needed in the real world. He’s passionate & informative about what he teaches!", "rating": 5, "expected_grade": "", "created": "2021-06-14T23:37:34Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "This course makes you think and gives you a chance to learn real life job skills. This course from any other prof is useless and boring. He runs this course like a workshop which makes it more engaging and participation-based than a regular class. \r\n\r\nHis bad reviews are from people who don't read his (detailed, and very clear) hw instructions.\r\nSorry, in the real world, you need to read instructions, or you don't get paid. \r\n\r\nWant to goof off and get an easy A? Want to waste your time and not learn? \r\nTake a different course.   ", "rating": 5, "expected_grade": "A-", "created": "2021-06-23T12:42:44Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Professor Rick is an extremely entertaining and engaging professor. He made a 3 hour long 6-9pm English class bearable and interesting. This class is not a cakewalk however and professor rick has very clear expectations that are outlined in his assignment instructions. If you follow his instructions and take his feedback to heart and apply it to future assignments then you're golden. Every time I met with him after class he would outline each and every thing I did right and wrong and how to improve in a respectful and kind manner. \r\n\r\nProfessor Rick also provides you with valuable writing skills that have helped me in all of my future classes and even with landing a job.", "rating": 5, "expected_grade": "B+", "created": "2022-02-02T16:19:03Z"}, {"professor": "Jonathan Rick", "course": null, "review": "Professor Rick’s class was by far the most helpful in preparing me for post college, professional life. His guidance on résumé writing, cover letters, and email etiquette stand out as things I will carry with me for years to come. Students must put in the work to succeed, but those who do will find a great professional connection moving forward.", "rating": 5, "expected_grade": "A", "created": "2022-10-13T22:58:50.649270Z"}, {"professor": "Jonathan Rick", "course": null, "review": "Professor Rick’s class was by far the most helpful in preparing me for post college, professional life. His guidance on résumé writing, cover letters, and email etiquette stand out as things I will carry with me for years to come. Students must put in the work to succeed, but those who do will find a great professional connection moving forward.", "rating": 5, "expected_grade": "", "created": "2022-10-14T22:19:30.436067Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Professor Rick provides everything you need and more as a business writing professor. His interactive lectures teach you in depth tactics to create a resume, produce a proper email/memo, and enhance your overall writing ten fold in just a semester. He uses gives his students the same advice that he would give to his professional peers.\r\n\r\nThe grading is extremely clear but tedious. If you pay attention to details it wont be a problem.", "rating": 5, "expected_grade": "B", "created": "2022-10-24T02:25:25.432124Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Great professor! His knowledge and enthusiasm for Business Writing is legitimately off the charts. He wants you to succeed as much as possible, as well. Though, his teaching style can strike you the wrong way (at first) if you're not ready for it. He constantly calls on random individuals to read/participate whether they want to or not. Personally, I did not find this to be a problem (as it's really not a big deal if you mess up). Though, this caught me off guard the first couple of lectures.", "rating": 5, "expected_grade": "A-", "created": "2023-01-11T21:40:11.153495Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Professor Rick is easily one of the best professors at UMD. He openly admits that he is a stickler for details, but if you really try on the assignments that are only due once or every other week, it's not hard to get an A on every assignment. There's no busy work, the readings take 10 mins max to do, and the class itself is extremely engaging. He is a great speaker and does an awesome job at not making the 3 hour class feel so daunting. Professor Rick is extremely knowledgeable and makes the course content really stick. The class was honestly fun, there was never a dull moment and he is relatable! I got so much out of his class, he really wants you to do well and learn. An easy A if you take his feedback with a grain of salt, pay attention, and show genuine interest.", "rating": 5, "expected_grade": "A", "created": "2023-04-25T23:51:18.993760Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "His assignments aren't hard as long as you follow instructions. His classes are a lot of fun, and he makes it a point to constantly interact with students.", "rating": 5, "expected_grade": "A+", "created": "2023-05-04T16:38:35.802133Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Attendance is mandatory, he reviews slide decks each class with a few exercises. Very particular - flexible with some things but unmoving with others.", "rating": 2, "expected_grade": "A-", "created": "2023-05-21T23:34:14.173715Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Ignore the other reviews they’re fake. This class is up to you, if you want highly involved class participation and hard grading. The assignments aren’t bad and he does make class fly by, but compared to other ENGL394 courses, they have less coursework and much easier grading.", "rating": 2, "expected_grade": "A-", "created": "2023-05-27T22:21:14.379870Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Probably one of the best teachers I've ever had. My class period was long and late at night, however, Professor Rick never failed to keep the class's attention. He's funny, energetic, and genuinely cares about his students. You will learn so many skills that you actually use in the real world (how to send professional emails, present/create engaging slideshows, and create effective résumés). I don't think other professional writing courses offer what this class does. You'd be foolish not to go with Professor Rick.", "rating": 5, "expected_grade": "A", "created": "2023-08-31T14:23:04.269070Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Professor Rick's ENGL394 course has been one of the most useful courses I've taken at UMD. He's 100% committed to helping students grow both professionally and personally. GREAT sense of humor, and what you learn in class you WILL apply to your real life. Professor Rick is very open to feedback and genuinely cares about his student's success. Show up to every class, ask questions, do the readings, and it's the easiest A you'll get.", "rating": 5, "expected_grade": "A", "created": "2023-09-14T14:28:08.708059Z"}, {"professor": "Jonathan Rick", "course": "ENGL394", "review": "Professor Rick’s class is super engaging and informative. He’s very passionate and knowledgeable about writing and wants everyone to learn. There’s no busy work or textbook for the class. Overall, if you follow the instructions on assignments and don’t rush them, you’ll do well.", "rating": 5, "expected_grade": "A", "created": "2024-03-11T01:59:47.225247Z"}], "name": "Jonathan Rick", "slug": "rick_jonathan"}