{"courses": ["PSYC100", "PSYC221", "PSYC100", "PSYC221", "PSYC420", "PSYC100", "PSYC221"], "average_rating": 4.75, "type": "professor", "reviews": [{"professor": "Joseph Barnet", "course": "PSYC100", "review": "Loved Professor Barnet. He was super funny, and personable. Something especially helpful was his explanation of the applications of concepts that could be confusing. He made Psych extra interesting, which persuaded me to take his social psych class, PSYC221. The only thing that I wasn't a huge fan of was how fast he would go through slides and would have to skip sections of content due to timing. Overall, he is a great professor and I recommend taking any of his psych classes.", "rating": 4, "expected_grade": "A", "created": "2023-12-08T00:50:34.549634Z"}, {"professor": "Joseph Barnet", "course": "PSYC221", "review": "Enjoyed the content of this class and Dr. Barnet was very student-oriented. It seems like he really cares that you do well in his class. Content on Exams was all application based but predictable. He drops the lowest exam score so that also took a lot of stress off finals. There is some writing in this course but the essays and content were interesting and he provides a lot of resources to use as support. His lectures are almost straight out of the textbook, so both re-enforce each other. Would definitely recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T16:16:49.574653Z"}, {"professor": "Joseph Barnet", "course": "PSYC100", "review": "Dr. Barnet is the undisputed GOAT. He makes psychology more interesting than it is which is already hard to do with his engaging lectures and authentic personality. He's super funny, down to earth, and always looking to strike up conversations with students. He's also super young so he understands the youth and how we learn best. His workload is super doable and interesting. He dropped one of our tests as well, as long as you study you should be golden for them although the final was a bit harder than his usual exams. Overall 100% recommendation.", "rating": 5, "expected_grade": "A+", "created": "2023-12-20T07:08:22.961275Z"}, {"professor": "Joseph Barnet", "course": "PSYC221", "review": "Joseph Barnet is the nicest professor I've ever had and he really tries to make an effort to make each student feel important. His lectures and discussions are interesting and he is extremely generous with grading. He often offers various extra credit opportunities to boost your grade and the test is always like the powerpoint notes.", "rating": 5, "expected_grade": "A+", "created": "2023-12-21T19:22:56.142248Z"}, {"professor": "Joseph Barnet", "course": null, "review": "Good Professor. He's really understanding and allows extensions when you communicate with him. Also he really cares about APA format. It's a lot of content for exam but it is also common sense. Make sure you study, majority of content is on slides, so you don't necessarily need to attend lecture, but it is highly encouraged.", "rating": 5, "expected_grade": "B+", "created": "2024-01-08T23:24:26.129982Z"}, {"professor": "Joseph Barnet", "course": "PSYC100", "review": "Dr. Barnet is the undisputed GOAT. He makes psychology more interesting than it is which is already hard to do with his engaging lectures and authentic personality. He's super funny, down to earth, and always looking to strike up conversations with students. He's also super young so he understands the youth and how we learn best. His workload is super doable and interesting. He dropped one of our tests as well, as long as you study you should be golden for them although the final was a bit harder than his usual exams. Overall 100% recommendation.", "rating": 5, "expected_grade": "A+", "created": "2024-01-17T19:31:20.505575Z"}, {"professor": "Joseph Barnet", "course": "PSYC221", "review": "He always keeps his lectures interesting. The writing portion of the class can be a little frustrating sometimes because different TAs grade it each time, so you never really know what they want since they have different expectations. He drops the lowest test grade which can also be your final. His tests are very reasonable, I usually prepare using the review slides he posts.", "rating": 4, "expected_grade": "A", "created": "2024-01-19T18:32:37.989631Z"}, {"professor": "Joseph Barnet", "course": "PSYC100", "review": "Chill guy, down to earth, likes to relate to the students.", "rating": 5, "expected_grade": "A", "created": "2024-02-01T03:09:01.771197Z"}], "name": "Joseph Barnet", "slug": "barnet"}