{"courses": ["AAST200", "EDCP776", "SOCY410", "EDCP498A", "EDCP772", "EDCP775", "SOCY627", "EDCP741", "AAST222", "AMST298C", "SOCY699V", "AAST378", "AAST388", "EDCP799A", "AAST498A", "EDCP798A", "EDCP798D", "AAST498B", "SOCY498G", "EDCP655", "EDCP888A", "HESI202", "EDCP788", "SOCY380", "AAST378", "AAST388", "EDCP742", "EDCP772", "HESI202", "EDCP788", "EDCP888A", "EDCP888A", "EDCP798G", "AAST222", "AAST388", "EDCP772", "SOCY222", "AAST200", "AMST298C", "EDCP788", "EDCP888A", "SOCY627", "AAST200", "AAST388", "AMST298C", "SOCY410"], "average_rating": 2.4, "type": "professor", "reviews": [{"professor": "Julie Park", "course": "AAST200", "review": "Professor Park is a very reasonable professor. She is willing to adjust her expectations based on class feedback and performance. She expects you to do the readings and contribute in class, but other than that there is not consistently much work you have to put in.\n\r\nAssignments:\r\n3-4 pop quizzes, sometimes open book/open note\r\n1 final paper (5-7 pages)\r\n1 midterm\r\n1 final.\n\r\nShe has extra credit opportunities as well. \n\r\nIt is pretty critical that you pay attention and take notes in class, as all of her exams/quizzes are based heavily on this material.", "rating": 4, "expected_grade": "", "created": "2015-01-20T18:21:00Z"}, {"professor": "Julie Park", "course": "SOCY410", "review": "I can't believe Dr. Park only has 2 stars.\n\r\nWorkload:\r\n-Readings\r\n-Min. 5 Page Paper\r\n-2 Small assignments that supplement the project\r\n-Project poster board and presentation\r\n-Midterm\r\n-Final\n\r\nHer syllabus was very clear in what she expected of her students. On the 2nd day of class she presented us with the requirements of the project and paper, which weren't due until near the end of the semester. She was very well prepared and always professional. Her power points are great, but she doesn't share them. She wants you to show up to class!!!\n\r\nGO TO CLASS!!! She isn't a boring professor. The concepts are a little tough, but she explains and relates them in a manner that makes sense and questions you to think. Like any SOCY class, discussion is always demanded.\n\r\nI LOVED how Dr. Park split us into small groups to come up with our collective ideas and then brought us all back together to go through everything as a class. She then took our group notes and made copies so that everyone could have an identical set.\n\r\nHer tests are all short answer (2-6 sentences). She always has an excellent review to prepare those that have been paying attention and taking notes.\n\r\nShe is VERY friendly, nice, and has a sense of humor...unless you're constantly hounding her. She does her best to make sure her students succeed and grasp the ideas, and does it in a great way. She is very good about replying to emails.  \n\r\n**** RECOMMENDED PROFESSOR**** ", "rating": 5, "expected_grade": "A-", "created": "2012-12-19T17:35:00Z"}, {"professor": "Julie Park", "course": null, "review": "Grads extremely hard, does not matter whether you understand materials or not, she wants you to regurgitate every word she says.", "rating": 1, "expected_grade": "", "created": "2012-04-02T03:28:00Z"}, {"professor": "Julie Park", "course": "AAST200", "review": "Prof Park really isn't bad for AAST200. The key to getting a good grade is to pay attention to the the points she brings up over and over again as she will most likely test you on those (e.g. 1965 Immigration Act, Paper Sons...etc) There is a midterm, oral history paper, and final. She \"takes attendance\" by making you do these group assignments during class to turn in at the end. \n\r\nYou don't have to read any book except Asian American X. Show up and listen somewhat and you'll be fine.", "rating": 4, "expected_grade": "A", "created": "2011-05-24T03:44:00Z"}, {"professor": "Julie Park", "course": "AAST200", "review": "The readings assigned every class are at times boring but pretty manageable. The lectures are a little scattered and unorganized which makes it hard to follow but Professor Park is pretty nice. The midterm consists of 11 short answers and if you know the material, you'll do well. There aren't that many grades so if you do poorly on one of them it's really hard to get a good grade in the class.", "rating": 4, "expected_grade": "A", "created": "2011-04-09T22:04:00Z"}, {"professor": "Julie Park", "course": "AAST222", "review": "First of all, this lady takes ATTENDANCE so you have to go to class. She wont tell you that she is. \r\nThe class isnt boring but, this is the worst class anyone can take just because of the tests and paper. IT IS USELESS! AND THE PROFESSOR SUCKS! Granted she is new. There arent many homework assignments. You do not need to buy the books. DO NOT BUY THE BOOKS! I wasted my money on them! I only used one and that was for a project. Her project is easy. She grades hard for the midterm and final. FOR NO REASON! You have to study lecture notes for the exams. The notes consist of dates and definitions. AND there is a TEN PAGE PAPER for this useless class. This class doesnt teach you anything. Im not a sociology major so i dont care, but if you are this class is pointless. Shes not teaching aast222 anymore but this should be known. \n\r\n1-8-10 - i have to say...again... THIS LADY SUCKS!. ", "rating": 1, "expected_grade": "A", "created": "2010-01-08T18:51:00Z"}, {"professor": "Julie Park", "course": "AAST222", "review": "One of the least professional teachers i have ever had in my college experience. She knew literally nothing about the subject, horribly ineffective in teaching the material. If you can put up with her stupidity and attend every single class you'll do well, otherwise i suggest never taking any class with her. Her finals cover more about the movies you watch then the information she teaches, leading me to believe that she thinks it is a film class. If you are taking this as a supporting course for sociology, DO NOT, because it is not taught from a sociological perspective whatsoever. ", "rating": 1, "expected_grade": "", "created": "2008-12-26T15:28:00Z"}, {"professor": "Julie Park", "course": "AAST222", "review": "Worst professor. Truly unprofessional and takes grades away from students from her ego. Lectures are hours of constant note taking and assignment grades are given not based off of proper measure. ", "rating": 1, "expected_grade": "", "created": "2021-10-05T19:32:19Z"}, {"professor": "Julie Park", "course": "AAST222", "review": "You have to write so much in this class its crazy. An hour of just pure writing notes, no break, no nothing. Her grading and environment just feels so hostile, very aggressive I just feel like I can't even speak.", "rating": 1, "expected_grade": "A", "created": "2023-10-31T01:07:00.918566Z"}, {"professor": "Julie Park", "course": "SOCY222", "review": "Class isn't hard but genuinely I have never met a more passive-aggressive person in my life holy hell. I walked away from a conversation with her with my jaw literally on the ground because I could not believe how rude she was.", "rating": 2, "expected_grade": "A", "created": "2023-12-05T02:33:21.182224Z"}], "name": "Julie Park", "slug": "park_julie"}