{"courses": ["COMM386", "COMM107", "COMM288", "COMM288", "COMM386", "COMM288", "COMM386", "COMM288", "COMM386", "COMM288", "COMM386", "COMM288", "COMM386", "COMM288", "COMM386", "COMM288", "COMM386", "COMM288", "COMM386", "COMM288", "COMM386"], "average_rating": 2.6, "type": "professor", "reviews": [{"professor": "Julie Gowin", "course": null, "review": "SHE IS TERRIBLE!!!! She is super rude and is a terrible professor. Her guidelines are terrible and when you ask her a question, she totally attacks you. She attacked my character at one point. I wish the Comm department would realize how terrible she is to students and stop letting her teach this class because it's not fair for anyone!! Nothing that she wants from you is clear and like I said, when you ask for clarification or if something you did was acceptable, she attacks you and makes you feel like crap about it. There are two reviews on here dating back to the past 3 years and she hasn't changed a thing and is still terrible to students. I say this is a power trip and she does what she wants because she doesn't care or doesn't have to worry about it.", "rating": 1, "expected_grade": "", "created": "2015-07-05T20:43:00Z"}, {"professor": "Julie Gowin", "course": null, "review": "Gowin is without question the worst professor I have come in contact with throughout my entire time in college. She is unnecessarily and excessively rude, passive aggressive, asks questions to purposefully make you feel stupid, and feels superior to her students. She is unreasonable and is easily the most bitter person I've ever met. The idea of the course is great, the coordinator is not.", "rating": 1, "expected_grade": "A", "created": "2013-02-21T12:09:00Z"}, {"professor": "Julie Gowin", "course": "COMM386", "review": "Julie Gowin is probably the worst intern coordinators on campus. Not only did she yell at my supervisor on my internship site, she also changes assignments without notice. If there are conflicting \"last day of classes\" dates to go by, she should clarify with a definitive answer. She did not. Moreover, her attitude and superiority complex are not needed here. Take the course, but be ready for administrative miscommunication that could potenitally lower your grade.", "rating": 1, "expected_grade": "A", "created": "2012-08-20T10:29:00Z"}, {"professor": "Julie Gowin", "course": "COMM107", "review": "I'm confused by the over reviews listed below because I thought she was an excellent prof. She was so sweet and actually made the class entertaining with her fun anecdotes. I really enjoyed her class.", "rating": 5, "expected_grade": "A", "created": "2021-12-13T06:49:36Z"}, {"professor": "Julie Gowin", "course": "COMM107", "review": "Not sure what changed between the older reviews and now, but Prof. Gowin has been a great instructor and I would highly recommend her!", "rating": 5, "expected_grade": "A", "created": "2022-12-15T05:02:16.839812Z"}], "name": "Julie Gowin", "slug": "gowin"}