{"courses": ["ENGL101H", "ENGL101", "ENGL101S", "ENGL101X", "ENGL292", "ENGL391", "ENGL395", "ENGL388C", "ENGL388V", "ENGL394", "ENGL297", "IDEA101", "ARHU380", "ENGL378Q", "ENGL393", "ENGL395", "ENGL395", "ENGL292", "ENGL388C", "ENGL395", "ENGL391", "ENGL391", "ENGL395", "ENGL292", "ENGL388C", "ENGL395", "ENGL395"], "average_rating": 4.3333, "type": "professor", "reviews": [{"professor": "Justin Lohr", "course": "ENGL101S", "review": "Professor Lohr is great!!!!!!! Honestly I didn't know he had that many bad reviews on here. He is very relaxed but he knows exactly what he is talking about. He is very passionate about what he teaches and its obvious. I think that's a GREAT quality for an english teacher to have especially for a Freshman Writing Class. I would definitely recommend him. Professor Lohr is so helpful he is blunt which helps. He alway gives great feedback and he writes nice letters on the comments sheet when he grades your paper. I love professor Lohr and trust me I do not like writing. God blessed me with Professor Lohr! I love him I would certainly recommend him.", "rating": 5, "expected_grade": "", "created": "2016-01-10T22:08:00Z"}, {"professor": "Justin Lohr", "course": "ENGL101H", "review": "First I'll give you the good: He's an excellent teacher and a fun guy. Lectures are generally interesting and you can tell he really cares about teaching you writing, and he's definitely really passionate about it himself. He outlines what he expects from you fairly clearly and the activities we do in class are really relevant to the course material. The homework helps also, though it's a little excessive. The class is interesting in general, and you get to pick your own topic to write about, which is nice. \n\r\nNow the bad: He's an evil grader. He literally never gives higher than an A- and only 2% of his students even get that much. I wanted a 4.0 for this semester and this class ruined my chance at that, otherwise I would have gotten it. I worked like hell for this class too, I spent six hours just editing some of my papers, I don't even know how long I spent writing them. Like I said before the homework is also excessive, it helps for the most part and most of it ties into the bigger assignments but there's way more than any other section gets. When you have four other classes it's hard to fit in that much extra stuff, even if they're smaller assignments. I'm a bio major, I want to focus most on my other classes more related to my major but this class takes up so much time. Even if I didn't do A level work, I know some of the other people in my class definitely did. It's just plain mean to outright not give anything above an A-.\n\r\nIn summary: If you really need to get better at writing and you're not too worried about your gpa, this is a good class. But otherwise stay far away from it, it's far too much work for little pay off. ", "rating": 3, "expected_grade": "B", "created": "2014-12-20T23:41:00Z"}, {"professor": "Justin Lohr", "course": "ENGL101H", "review": "Take Lohr if you are looking for: an exciting English class that allows you to follow your interests in-depth and become a truly better writer. You will feel like you learned a lot about writing and improved tremendously over the course of the semester.\n\r\nDon't take this class if you are looking for: An easy A and a manageable workload. Lohr is a harsh grader (w/ justification given for why he takes points off always) that demands a lot in his assignments. Lots of essential reading to do every week and the big projects take serious time to do well. \n\r\nOverall, it depends on what you are looking for. If you have the attitude of wanting to learn over getting a 4.0 GPA, then Lohr is your guy - the class, I am confident, will help in the long-term much more than any other ENGL101 class. ", "rating": 4, "expected_grade": "B+", "created": "2014-12-14T17:49:00Z"}, {"professor": "Justin Lohr", "course": "ENGL101H", "review": "Lohr was by far the best and most caring English teacher I have ever had. Granted, his class had a significant amount of more work than other sections had, but the work rarely ever seemed completely pointless. In other words, just about every single assignment he gives is geared to hone your skills in a specific area of writing. His lectures are always crystal clear, and he covers all the main points in the reading out of Engagements for each class. \r\nAlso, he is so helpful in his office hours and is very generous in the amount of time he gives up to help students - you can even email him over the weekend and he'd get back to you in no time. He basically handed me my ideas for my final two papers.\r\nFinally, he has some of the best character traits I have ever seen. Not only is he very nice and respectful in class, but he also responds to joking and side topics very positively - to a reasonable extent, of course. And his mannerisms are always entertaining, to the point where it becomes fun to joke about what a character he is outside of class with other classmates.\r\nFinally, he reads every single word of your papers and is always willing to write comments in the margins, sometimes even stretching from the top to the bottom of the page. And his love notes at the end are always pleasant, following the format: \"Dear ---, thank you for submitting this draft. In it, you....Work on these skills in future projects. I look forward to reading them\".\n\r\nOverall, great guy, great teacher, great class. I highly recommend him.\n\r\nOh, and PS: He does grade fairly harshly, but it is very manageable to get a high grade in the class as long as you put in a fair amount of effort. Don't let that 2% A distribution scare you away.", "rating": 5, "expected_grade": "A", "created": "2013-12-15T11:06:00Z"}, {"professor": "Justin Lohr", "course": "ENGL101H", "review": "Lohr made me like Englich class.  All throughout high school I hated English so much and had an awful foundation in writing, etc.  Lohr made the class so engaged and current that I actually (for the first time ever) looked forward to going to English.  He is a bit of a tough grader, but it was Honors; that's to be expected.  I definitely could have put forth more effort than I did, but I feel that I got the grade I deserved.  Lohr is an amazing professor, and is very approachable.  I highly recommend him to anyone in the Honors College!", "rating": 4, "expected_grade": "B-", "created": "2013-04-29T12:41:00Z"}, {"professor": "Justin Lohr", "course": "ENGL101H", "review": "Lohr's class was more difficult than most writing courses I've taken in the past, but he made it generally pleasant.  While he graded somewhat harshly, I was more driven to put significant effort into my essays, and I think my writing improved as a result.\n\r\nInterestingly, he never particularly cared about the tiny details of formatting or citations, nor was he particularly harsh regarding style.  He graded essays mostly based on their content and arrangement, rather than anything else.\n\r\nOverall, he kept class fairly interesting.  When I'm next forced to take a writing class, I'll try to find one that he teaches.", "rating": 4, "expected_grade": "A-", "created": "2013-01-01T22:46:00Z"}, {"professor": "Justin Lohr", "course": "ENGL101H", "review": "Lohr is a great teacher. You will learn a lot and improve your writing. I felt like he was the only professor who cared about teaching me the entire semester. \n\r\nThat being said, he is a harsh grader. Do not expect an A unless you are Shakespeare. \n\r\nI would recommend him for improving your writing and a pretty worthwhile class, but not for raising your GPA. ", "rating": 4, "expected_grade": "B", "created": "2012-12-07T03:26:00Z"}, {"professor": "Justin Lohr", "course": "ENGL101", "review": "The good stuff:\r\nOne of the wisest and knowledgeable professors I've had. Really cares about his subject and cares that his students learn and grow as writers. He is always willing to help and will always work with you to improve your writing skills and confidence. I learned more about writing in his class than any other English class. Really nice and respectful guy. Also cracks some funny jokes in class too.\r\n\r\nThe not so good stuff:\r\nHe is a tough grader. This is because his standards are high and expects good work from his students. It makes sense because he puts in lots of effort to teaching and expects the same from his students. He gives more homework than the average ENGL 101 professor but it's mostly readings I never bothered to read.\r\n\r\nAdvice:\r\nIf you work hard, show him you care, and don't procrastinate - you will get the grade you want.", "rating": 5, "expected_grade": "A", "created": "2018-05-08T06:58:00Z"}, {"professor": "Justin Lohr", "course": "ENGL393", "review": "Professor Lohr provides some of the best feedback I've ever received on a paper and also loves to help his students improve their writing. So long as you actually read the instructions for each assignment and meet all the assignments requirements you'll get an A. It's as simple as that. \r\n\r\nPro tip: don't wait until the last minute to do the major assignments, trust me; It's not worth it. ", "rating": 5, "expected_grade": "A", "created": "2021-07-09T17:54:06Z"}], "name": "Justin Lohr", "slug": "lohr"}