{"courses": ["BSCI201", "BSCI447", "BSCI440", "BSCI329", "BSCI342", "BSCI202", "BIOL709I", "WMST326", "BSCI201", "BSCI329", "BSCI201", "BSCI329", "BSCI447", "BSCI201", "BSCI329", "BSCI450", "BSCI342", "WGSS326", "BSCI201", "BSCI450", "BSCI201", "BSCI329", "BSCI447", "BSCI201", "BSCI329", "BSCI450", "BSCI201", "BSCI329", "BSCI447"], "average_rating": 3.8475, "type": "professor", "reviews": [{"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "*Dr. Opoku is a solid OK* This is a review for her summer course \n\r\nTemperament: \r\n1.Dr. Opoku is pretty nice unless you have a question regarding her lecture. Like a reviewer below me said -- she will shut you down REAL quick. She can get kind of mean if you question her in the slightest. \r\n2.She has some serious issues regarding body image. She makes some pretty awful jokes regarding skinny girls such as \"oh, well you'll get osteoporosis meanwhile us big boned girls wont.\" It really made me and the rest of the class uncomfortable-- considering most of the class was girls. \r\n3. Unless you're willing to sit through her ranting for 30 min, do NOT ask her about basic research. You've been warned. \n\r\nGrading/Lecture: \r\n1.She does not curve. Her class is out of 1000 points. With two exams and a final. (final is not cumulative.) She also has these \"summary sheets\" that are 30+ easy points. DO THESE.  \r\nHalf of the class points come from lab, which has a MASSIVE amount of information. Learn the diagrams by heart and use the power points given by the TA's during lab. \r\n3. She writes her notes on an overhead projector like in middle school. Her handwriting is AWFUL and she writes unbelievably fast. I would suggest either bringing a laptop or prepare to get wrist cramps. \r\n4. Her exams are fairly ok, if you went to class. They come straight from her notes. so no book necessary here. \r\n5. Her exams consist of multiple choice, T/F, short answer, and a matching that creates a phrase. \r\n5. She has tons of extra credit points! (hence no curve) \n\r\nStudy Tips:\r\nThis class has a lot of material and she will ask you on everything she talked about in class. She hates the book(even though she uses it) and usually has slides that are from the book just to say \"NOPE this is not the right thing. \" So, I would suggest going to class. This class is totally doable and not really that hard if you take the time necessary to look at her notes. She's nothing special, a 3/5. \n", "rating": 3, "expected_grade": "A-", "created": "2015-07-06T15:16:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "OPOKU IS BAE. Literally this woman is a queen, and her outfits slay the game. On point every single class. Lecture exams aren't bad, just be on top of your stuff. I got A's on all of them. I think my lowest test grade was a 91 on the final. Yeah, so they're not hard, just study and you'll be fine hahah I don't understand how people were getting D's an F's on them when they're really not difficult as long as you prepared yourself. Overall, lecture is pretty good and it's a fun environment. Opoku likes to make jokes and talk about her kids and her life in general, so you always left lecture with a smile even if you were learning about atherosclerotic plaques or synchondroses or some other seemingly boring topic. \n\r\nLab, however, is a different story. I've gotten the general gist that with Opoku, Lecture is okay, and lab is awful, and with Lombardi it's the opposite. This is very true for Opoku, but not as bad as it seems. With lab, you just have to know a LOT more information for the practicals than you do for lecture exams. There are 4 practicals: tissues and cells, skin and bones, muscles, and the nervous system/senses + endocrine system. I got a 94, 83, 86, and 100, respectively. Know. Your. Shit. There is no way else that you'll be able to make it through. Your lab experience will also be defined by your TA. My TA was very sweet and lenient when appropriate. Instead of asking us to identify more challenging muscle origins/insertions like the brachioradialis or tensor fasciae latae, she'd give \"easier\" ones like....deltoid or gluteus maximus, that everyone knows haha. The first practical is a piece of cake. Once it gets to the skeletal/muscular practicals, the volume of information to know SKYROCKETS, but you can do it. Honestly, above all, this is a bio course, and ALL of biology is just memorization. So if you're good at that, this class isn't a problem. Also, don't forget to do the 7 online prelab quizzes. They're online and open note, and probably the easiest 70 points to earn in this 1000-point class. I think I ended up with a 56/70 cus I got 8/10 on a few and I forgot to do one before the deadline. But honestly, don't lose petty points on easy things like prelab quizzes. ALSO, she doesn't curve at the ended since literally 1/5 of every exam/assignment is extra credit. So if you're at a 89.999999% in the end, and your TA isn't nice, expect to get a B+. I had a 92.95% (which is an A-) and thank GOD my TA gave me a straight A, but some aren't so nice. \n\r\nOverall, you can get an A in this class if you put in the work. It's not that big of a commitment for a 4-credit course. And Opoku is the queen of everything, so that makes it 10x more enjoyable. I highly recommend taking this! ", "rating": 5, "expected_grade": "A", "created": "2015-06-06T17:04:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "At first I freaked out about this class because there were a lot of reviews saying it was really hard BUT, the class isn't hard, you just need to put in the effort. The first exam is a wake up call because you realize just how much information you are expected to know for the exam. After that, alter your studying style appropriately and put in enough time and you'll do well! She gives SO much extra credit on tests and in lab, I ended up having over 100% in the class which i never thought was possible. Make sure you study a lot, about a week before the exam at the very least. My studying style was to go through class notes and the lecture slides and make index cards for every topic/term and then go through them a bunch until i knew everything. Making the index cards takes up half of the studying time but trust me its worth it in the end and makes studying so much more effective and easier. Make sure to go to class or you will miss important notes! And study just as much for the lab practical! they have alot of info on them. The third practical nearly killed my brain. ", "rating": 5, "expected_grade": "A", "created": "2015-05-10T22:47:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Dr. Opoku is a really cool teacher and always made me smile in class. She knows a lot about the material and says everything at least twice in lecture, which helps you remember it. She handwrites notes rather than putting it all on a powerpoint, which is good and bad. It's good because you can see the thought process that goes into something rather than just a solid block of text to look at. It's also good for any diagrams that she needs to show us. However, sometimes it's hard to read her handwriting or if you miss something you can't go look on the slides later. It also sucks when you can't make it to lecture, because she puts most of the important information into the parts that she handwrites.\r\nShe will tell you questions that she always asks on the exams and she does not try to trick you on them. They have a matching section that spells out a phrase which is awesome. \r\nAlso, the final is not cumulative which is very helpful in a course that has as much information as this. \r\nThe lab was the hardest part of this course. The info wasn't lined up with the lecture info, so you were basically teaching yourself names and processes and then two weeks later Opoku goes over it in lecture and you finally understand it, after you've already taken the practical. I think the amount of information you need to know for the last couple practicals is entirely too much, I got B+ on the first two and a D+ on the third, and I don't feel very confident for the 4th.\r\nOverall, this is a tough course but I think Dr. Opoku does a really great job with it.", "rating": 5, "expected_grade": "B", "created": "2014-12-05T16:52:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "she's a very definite OK. The class itself is very time consuming, and her lecture style is weird. Her handwriting is terrible, i repeat, TERRIBLE. Shes a fair tester, HOWEVER if you every disagree with anything she'll immediately shut you down, and even laugh in your face. Like i said prior, a very firm mediocre.  ", "rating": 2, "expected_grade": "B", "created": "2014-04-15T01:53:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI447", "review": "Stay away from this woman. Whoever gave the 1 star had it absolutely right. I cannot say anything about the 201 experience, but 447 was a nightmare. I took 17 credits the semester I had Dr. Opoku and received high A’s in all of my classes except this one. She purposely picks a TA with no background in the field to grade your exams so they can’t justify why they took off points beyond saying “it’s not on the key.” There were arithmetic errors in my grade calculation on each exam. The entire class had to go to her office hours to argue about each question on the exam, but she was very dismissive about each argument, especially if the whole class had an issue with a question, which contrary to conventional practices. Even if you wrote answers that were verbatim from the slides (which are the only answers she says she will accept), you will get a lot of points off without explanation. The extra 10 points set up on each exam are virtually worthless because it is nearly impossible to finish her exams. The questions are ambiguous in terms of what is being asked and the grading is worse. There is no grading rubric, and points are taken off subjectively and unevenly from test to test. In other words, there is no amount of preparation and readiness that you can demonstrate to do well on the exams. It is completely out of your control. I don’t know where her grading distribution is coming from because most of the class was failing or had low C’s coming into the final. The average on the final was a 75% (153/200). So considering the class average was already in the low C range, and about 50% of the class scored less than a 75%, a great portion of her class obtained failing marks. I had more anxiety about this class than for my MCAT. Even people who had A’s in her class hated the exam grading/teaching style. When exams were compared side-by-side, some people had a lot of points taken off for the exact same answers that received full credit, but appeals for regrades were dismissed with little to no explanation. Her accent is difficult to understand sometimes and her handwriting is atrocious, which becomes an issue when you have to understand big vocabulary words and have no idea what she’s saying or writing. It is also an issue when you have to distinguish hyper/hypofunction and cannot understand which one she said. There is a slight 2-3% curve in the class to account for +/- grades, but it is not 10% like the person was saying below. That 10% is in reference to the extra 10pts on each exam. The material is actually pretty easy, but the grading is frustrating and insufferable. So even if you know the material backwards and forwards and put up correct answers on the exam, you will still get failing grades (60’s) on your tests. Take this class with any other professor than Dr. Opoku. \n\r\nIf you do get stuck into taking this class, she emphasizes hormonal effects on hypertension/hypotension (what caused it, why, what’s the mechanism of action, how do you treat or manage it). She loves GH, cortisol, and insulin. Our final had a few sections (about 20% of the test) on adrenergic receptors in terms of where they act, so BSCI440 was helpful for this class. She hinted at diseases we were going to see again for final, which helps prepare for cumulative review. Make sure you know the distinction between management and treatment. She favored D and E in her multiple choices, so if you don’t know, go with one of those. In general, we had to know symptoms of diseases well because her prompts included minute differences that indicated what the disease was. She used large vocabulary words, both medically pertinent and grammatically, on her exams. Make sure to know both (they will be in her slides) so you understand what will be asked. Sometimes we were asked to define the words, sometimes they were just used and we had to explain how the phenomena occurred. But if you didn’t know what the word meant, you were out of luck, even if the word had nothing to do with biology. We only needed to know signal transduction in detail for the 1st exam. After that (including the final), the most we had to know about it is what type of path it takes, but not the actual process for it. Your best bet is to memorize the slides and regurgitate what they said. Do not deviate from them or you will get the whole question wrong (-10pts) per problem. The final also asked about the same diseases over and over, so don't be concerned if you end up describing the same disease 3 times in 3 different sections on the final. Acromegally, anything cortisol related, and ADH related was heavily emphasized. (She might hint at what she will emphasize for your final in the few weeks approaching it, so be sure to go to class then.)\n", "rating": 1, "expected_grade": "B-", "created": "2014-02-20T20:38:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI447", "review": "Extremely chilled for a 400-level bio class. Just take good notes, have a good level of understanding, and the exams should be simple. The final was rough, but still doable. I do not think she curves but has built-in extra credits on every exam. But given how well the class was doing this semester, curving should be unnecessary. \n\r\nDr. Opoku is also super nice, has a good sense of humor, and is very knowledgable about the subject. This class is also very clinically relevant. You'll learn a lot about several different endo diseases. Should be interesting if you are planning to go into medicine.  ", "rating": 5, "expected_grade": "A", "created": "2012-12-21T23:30:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "I love Dr. Opoku! I had her for Summer Term I and am expecting B+ (hopefully an A-). Opoku is a very fair professor, and although she doesn't curve, she gives a lot of extra credit on her exams and take home assignments. I definitely put a little more effort into this class than I did in some of my other science courses - just because getting an A in this class is very possible. Attend all her lectures and keep up with your notes. Personally, I typed up, re-organized, and printed my notes toward the end of each week and reviewed the info days before each exam/practical. Study everything before you look at the review sheets and do the practice exams - the study sheets were helpful in highlighting key areas of focus, but I felt more comfortable studying everything. \n\r\nLike I said, Opoku doesn't curve, but she does help you out. She adds like 10-20 extra credit points onto each exam and the matching section spells out a phrase, making it almost impossible to eff up. And her handwriting sucks at first, but you get used to it.\n\r\nThe practicals were a little harder to study for. They were mostly straight up memorization (ID'ing structures and functions) so pneumonic devices will definitely help. Considering there aren't review sheets for these - study everything. \n\r\nAlso, I didn't buy the textbook, and I don't recommend that you do. Just write good notes and save yourself like $100! :)", "rating": 5, "expected_grade": "", "created": "2012-07-08T21:36:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Opoku is a great for bsci201 and i wish she still taught bsci202 because obrien is horrible for 202.\n\r\nopoku's exams are straight from the powerpoints so just memorize those and you are good to go. she has matching on her exams for 20 points which also spells out a word so if you are stuck on 2 and have some blanks you can figure it out based on the word which makes for an easy 20 points.", "rating": 5, "expected_grade": "B+", "created": "2012-06-08T00:57:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI447", "review": "Great professor I took BSCI447 and BSCI 342 with her, got A's in both. She'll lecture with powerpoints up, but make sure you listen; the powerpoints alone aren't enough. I suggest taking notes with a computer because she talks quickly, and gives you a lot of information.\n\r\nShe likes to make exams with built-in curves (120 possible points, but your grade will be out of 100 so you can get a 120%). \n\r\nAll in all, she's great and you'll learn a lot from her. I'd like to clarify about concerns in the statement below though:\n\r\n1) the TA for that semester was terrible. I agree, and I hated him. But if you go back to her and actually talk to her, she'll give you points back if you deserve it (you need to write in DETAIL, not just main points for exams). \r\n2) she doesn't like giving curves, but what the poster below didn't mention was that she did give a 10% final grade curve because the final exam was difficult. So not only did she give ~100 cumulative points of extra credit built into exams, she also gave an overall 10% curve. I would call that generous. \r\n3) powerpoints aren't that bad... you just have to listen in class also", "rating": 5, "expected_grade": "A", "created": "2012-01-24T21:24:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI447", "review": "...i don't know who wrote the previous reviews or how the grade distribution for A's for her course is so high, but do not take this class. i have never gotten less than an A in any course in college. i took 4 other 400 level bio courses this semester, 70% of my studying time alone went to endo.. i got A+'s in all my other courses but struggled for a c in this course...even if your answers on your exam are correct there is a 50/50 chance that it will be marked wrong (no joke). she purposely chooses a ta who has never taken endo and has no knowledge of the course whatsoever so that he follows her answer key to the T so expect no partial credit. when i say that your answers will be marked wrong even if they are right, and you can prove it using her own powerpoints or the internet, i mean it... workwise the class is only 3 exams and a final. the average on the final (which is worth 40% of your grade) in my semester was a 40%.. she \"does not believe in curves\". think about that.. bottom line do not take this class. i would compare her teaching and grading style to bhagats except she has poorly made powerpoints.", "rating": 1, "expected_grade": "c-", "created": "2012-01-02T20:48:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Get ready to write... a LOT. Dr Opoku basically has the powerpoint up in lecture and writes down allll her notes by marker directly onto the screen. By the end of lecture you'll have like 3 pages of handwritten notes. You have to be paying attention, or you'll miss important info.. or you can just be like 1 of those people who mass email the whole class lol.  Opoku's exams are okay if you really know the exam outline she posts. \r\nBeware of lab. Lab is incredibly overwhelming at times and will absolutely suck if you have a bad TA. Be ready to memorize a lot of terms and locations on the body (muscles and bones practicals were hardest) and don't wait til the last minute to study.\n\r\nGoodluck!", "rating": 4, "expected_grade": "", "created": "2011-12-26T20:01:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "absolutely nicest professor, hands down. she gives so many chances for extra credit. review her slides/notes and you'll be fine on her exams. like everyone said, lab is a big part so make sure you study ALOT for lab practicals.", "rating": 5, "expected_grade": "A", "created": "2011-12-24T18:28:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Dr. Opoku is a great professor. You must come to class, however, to take the notes (or ask a classmate for the notes you missed). By studying from the notes, you can easily get a high A on her lecture exams. That doesn't mean that the material is easy!\r\nWorry more the lab practicals because you have to memorize, for instance, 80 muscles and their respective origins, insertions, and functions for one practical. You will likely be getting A's on the lecture exams, B's/C's on the lab practicals.\r\nHer accent is confusing at first, but easier to understand as the year goes on. In all honesty, you don't even have to listen to what she says--just write down what she writes on the slides and you're good to go!  ", "rating": 5, "expected_grade": "A", "created": "2011-12-12T21:34:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "I love Dr. Opoku! She doesn't overwhelm students with too much material but instead focuses on student's knowing the topics well. She's friendly and really easy-going. She gives you all the resources you need (without a textbook) to do well on the exams. She is very reasonable; you get the grade you deserve based on how much you study and how much you come to class. Coming to class is a must though!\n\r\nOne flaw is that class can get boring and sometimes she writes her notes too fast so it can get annoying to keep up but you can always record the lectures to get any notes you missed.", "rating": 5, "expected_grade": "", "created": "2011-05-04T12:40:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": " I love Dr. Opoku!  She is much easier than professor  O'brien, maybe not in terms of content, but Opoku's exams are easier. She gives a review sheet and practice exam before every exam which really helps! Not the mention she has a good sense of humor and charm.\r\n She recently started using powerpoints in class, along with the notes she writes down on the overhead.\r\nEven though she says you must get the notes she writes down and come to class everyday, its not THAT important. Majority of the info comes from powerpoints...so study the powerpoints word for word too! \r\nAny anatomy class is a lot of work, so just give yourself time to study...because this stuff isn't difficult, its pure memorization!", "rating": 5, "expected_grade": "A", "created": "2011-01-07T18:20:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Opoku is a great teacher. She wants all of her students to succeed. If you utilize her office hours and get to know her she will definitely push you up and help you if you are on the borderline. Start this early though because she really does make a difference and lets you know what you need to study.\n\r\nYes, at first her accent is tough to understand, but if you have any background knowledge about anatomy you will understand. If you are confused ask her about it in office hours or ask a TA. TA's dont really help in this class because none of them usually are human anatomy grad students. Mine was a flower evolutionist...but she did help anyone to her best ability.\n\r\nThe textbook is not necessary but the lab manual is. I also suggest you take pictures of the models in lab for the lab practicals. For both the test and the lab, do not leave studying until the last minute, especially if this is not your only lab class. I took micro with this class (7 hours of lab a week total) and the tests often fell within the same week. If you start studying and memorizing early you should do fine. \n\r\nAll in all, the class can be tough but very interesting. And just like all classes utilize the teacher and you will do great, especially with Opoku", "rating": 5, "expected_grade": "B", "created": "2010-12-25T17:43:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Yeah, yeah, everyone knows how amazing Dr. Opoku is - she's nice, warm, funny, intelligent, and all-in-all, a great teacher. You should take her over anyone else for any class you might take with her.\r\nONE IMPORTANT THING I WANT TO MAKE CLEAR is about the LAB PORTION of the class. The class is 4 credits, but really, at least 2 of them should be lab. Spend time in lab going over lab models and memorizing EVERYTHING. Do a little bit each week to prepare for the 3 lab practicals. I got like a 75 on the first one and was devastated, but I ended up getting a 98 on the last one. WORK HARD ON LAB and be prepared for its' difficulty. Its a lot harder than lecture. ", "rating": 5, "expected_grade": "A", "created": "2010-12-24T00:20:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Dr. Opoku is the best. Take BSCI201 with her! I have never had a teacher who actually wanted his/her students to succeed as much as Dr. Opoku did. I often went to her during office hours and she was extremely helpful. Although there is not real curve in the class, her tests are pretty much just spit-back, so memorize the notes she puts up on the board and you'll succeed. She is an amazingly warm teacher who really wants her students to do well. I would take her in a heartbeat if she taught other classes which I need. ", "rating": 5, "expected_grade": "A", "created": "2010-12-19T05:24:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Opoku was a better choice overall (other choice was O'Brien, and that wasn't going to be any better). She basically writes on the projector the ENTIRE class, but I suggest you buy the whole semester of notes from Terpnotes or something. Your hand will be sooooo tired by the end class that I see people constantly having to stop to take a break! Also, her handwriting is illegible, so you're bound to have gaps in your notes (make sure to sit next to a friend to decipher what she is writing).\r\nAnyways, her accent is super annoying and takes some getting used to (I never did). Yes, she may be nice, but I really don't see what the other reviewers are talking about. She's just OK. \r\nThe course material is very interesting, but there is A LOT of information so don't cram! The labs are easy, and same goes for the practicals during labs, do NOT cram. Don't waste your money on the textbook either, but the Lab manual is a must. ", "rating": 3, "expected_grade": "B", "created": "2010-12-17T00:21:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Opoku is one of the most intelligent professors in Maryland. She lectures based on knowledge instead of using pre-made powerpoint slides. Most professors come to class prepared with powerpoint slides, and spend most of their time reading directly off the slides. Opoku does not need to do this because she knows the material. \r\nThere are a few cons to her class though. First off, she writes very quickly, and sometimes, her handwriting is illegible. \r\nYou would obviously have to attend class because she does not post her notes online. Take her class with a friend in case you miss class and need to obtain notes. \r\nHer exam questions come directly from her notes, so it is unnecessary to purchase the textbook. Unfortunately, some of her exam questions are quite detailed so understanding the \"big picture\" is not sufficient enough to do well on her exams. You need to know the little details too. \r\nOverall, Opoku is very willing to help. Her accent takes some time to get used to, but eventually, you'll adjust to it. Do not cram for this class.   ", "rating": 4, "expected_grade": "", "created": "2010-04-13T23:23:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "I really enjoyed the class, just make sure you review her notes and you will be fine for the exam and the final...one got me was the lab, it was very hard but I even prepared a week before the lab practical, I suggest you start way earlier then that. I really enjoyed the nervous system lab(my favorite) and the bone practical and muscle practical were very hard but please study really hard for it Good Luck! :) she is a great professor ", "rating": 4, "expected_grade": "", "created": "2010-01-04T20:28:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI447", "review": "I really enjoyed taking Endocrinology w/Dr. Opoku.  As other students have said, she really knows her stuff and she has a great sense of humor.  She also adds some extra credit points to her exams, making a good grade in the course very attainable.\n\r\nThe course is much more clinically relevant than most biology courses I have taken.  Dr. Opoku focuses on signs and symptoms of endocrine diseases as well as diagnostic testing and treatment. \n\r\nI would recommend becoming friends w/whoever you sit next to b/c Dr. Opoku writes fast and you need to make sure you write down everything she does in order to be ready for the exams.   ", "rating": 5, "expected_grade": "A", "created": "2009-12-14T17:23:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Opoku is one of the best professors I've had so far in college. She is incredibly nice and the most willing person I've ever come across to help with her students' concerns. She will stay way after lecture to discuss exam questions and corrections. She has an accent, so it takes a few days to get used to the way she pronounces words. However, she basically nullifies this fact by writing out every word that comes out of her mouth...you can't possibly miss a piece of information if you pay attention. A piece of advice: DON'T TAKE YOUR NOTES ON A COMPUTER!!! Yes, the class is INTENSE amounts of hand-written notes and your hand will hurt for the first couple of lectures, but you will thank yourself later in the course if you take notes by hand. Opoku is extremely organized, and knows practically everything about human anatomy and physiology. The best thing about her teaching style is that she makes her own comments about everything, explaining why and how things happen beyond what she expects you to know. It is true you really don't NEED the textbook, but it is a fabulous text and explains things extremely well--it's more of a reference book for studying--I highly recommend it. Her exams are all multiple choice and short answer, so you need to own the information to do well. If you DO NOT PROCRASTINATE on studying and pay a lot of attention to her in class, you will do very well. Lastly, DO NOT DO NOT DO NOT MAKE FLASHCARDS TO HELP YOU STUDY. Your stack of cards will be miles high in 2 seconds. Instead, re-write your notes and draw pictures to help remember things. ", "rating": 5, "expected_grade": "A", "created": "2009-12-01T21:53:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI447", "review": "She's a great professor! She has a great sense of humor, and if you're interested in endocrinology, then this class is definitely for you. Her exams are literally word for word from her lectures, so you HAVE to go to class to do well. Exams are half multiple choice, half short answer. If you start studying for the exams a couple of days in advance, you're pretty much guaranteed an A (but DON'T wait until the last minute to start studying, you WILL NOT do well!!!). One of the easiest 400 level classes I've taken.", "rating": 5, "expected_grade": "A", "created": "2009-11-04T09:53:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "So here's how you get an A in 201 and 202 without working very hard... First off, don't waste your money buying the textbook because the course is based on lecture notes. Next, go to bookholders and pay for the entire semesters notes (going to class is pretty pointless and if you've read any of the reviews we are not lying about taking notes the entire lecture). About 3 or 4 days before the exam start memorizing. The exams are very simple in that there are no trick questions and almost no thinking outside the box. Dr. Opoku basically wants to see how much information you can retain and then regurgitate in 50 minutes. The science is very basic for a 200 level course but the volume of information is what can make this class difficult. With that being said, DO NOT DO NOT DO NOT procrastinate. If you give yourself 3 days of memorizing you will ace the exams.\r\nDr. Opoku is incredibly nice and easy to talk to so I definitely recommend going to her office hours to get to know her. She is incredibly intelligent and loves to discuss physiology and medicine so if you have a question, chances are she can answer it.", "rating": 5, "expected_grade": "A", "created": "2009-05-25T22:14:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI202", "review": "Opoku literally knows everything about Anatomy. Dont worry about the book, Exams are strictly from lecture so study hard and you will get an A. Coming to class is imperative because If you don't, Opoku is a machine and writes so much that you miss alot so make sure you have a friend who has your back. Lab manual you need though.\r\n Both lecture and lab require insane amounts of memorizing but Im assuming if youre taking BSCI201/202 you have to because otherwise this class as an elective would make you the dumbest person alive. Just make sure to study about 3 - 4 days in advance and you will be fine!", "rating": 5, "expected_grade": "B", "created": "2009-04-28T14:26:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI447", "review": "She is amazing you get everything you need in lecture word for word. She knows her stuff. She will test on her lecture and you dont need the textbook. I dont know anyone who even bought the book. One of the easier upper level A's.", "rating": 5, "expected_grade": "b", "created": "2009-02-02T13:30:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "This professor is really great.  She is intense and it is alot of work, but I really enjoyed the class.  She literally writes on the overhead for the whole class and you copy it down.  It makes your hand tired, but she is intersting.  The lab is alot of work too... tonnnnns of memorizing, but if you put in the time, it is doable.  The book is unnecessary.  The lab manual is necessary.", "rating": 4, "expected_grade": "", "created": "2008-12-15T15:40:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "She is a great teacher. I would take any course she taught. She is funny and really makes the subject interesting.", "rating": 5, "expected_grade": "A", "created": "2008-02-05T19:45:00Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "If you have to take this class for your major and need a good grade, Opoku is very much fine as her exams are fair and have plenty of easy extra credit questions. HOWEVER, her lecture style is drier than the Sahara Desert and if you cannot endure the idea of looking at her absolutely terrible hand written notes on a projector that goes faster than you can type for EVERY SINGLE LECTURE, do not take this class. To give you an idea of how horrible the lecture experience is, my TA recommended me to record every lecture while writing down notes, then listen back to the lecture again and fill out the unavoidable blanks you will have on your notes because she writes in supersonic speeds. A&P is already a dry subject, but my god Opoku's lectures suck even the smallest molecule of water out of the content and what you have left is literally just copying words from the projector to your notes.\r\n\r\nALSO, everything she hand writes will be on the exam, but when she lectures and writes at the same time her sentences are fragmented to hell, with long pauses between each word as she speaks while she writes. Imagine, instead of \"mitochondria is the powerhouse of the cell\", you get \"mitochondria -- is -- the -- powerhouse -- of -- the -- cell\". This makes the lecture very disorienting as the most important parts of the contents are spoken in a way that is hard to comprehend as one whole sentence, especially when she's talking about cause and effect stuff like functions of mechanisms.", "rating": 3, "expected_grade": "B", "created": "2019-11-13T18:12:36Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI447", "review": "The worst professor I've ever had at UMD. She is very arrogant and thinks that she is right about everything. During our first exam, a fire alarm went off and she told the class we could retake the exam another time. A couple of days later, she told the class she never said we could retake the exam and so everyone had to fight to get her to allow us to retake it. A student called her out on this, she got offended, and took extra credit away from every student on the next exam because of it. She's really a terrible lady, and will give you a lot more stress than you need. Exams are also ridiculously hard. Do yourself a favor and avoid her. ", "rating": 1, "expected_grade": "B", "created": "2019-12-19T20:34:27Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Opoku is an okay professor. The class itself isn't that bad, but her exams can be really tricky. The multiple-choice, which is 1/3 of the exams, is tricky as you have to pay attention to the wording. However, if you take notes on what she writes, you should do okay on the exam. Also, there are bonus points embedded within her exam. \r\nOn a different note, her handwriting is terrible, so it is hard to read. Also, she talks extremely fast and has an accent, so it's difficult to understand what she is saying. ", "rating": 3, "expected_grade": "B-", "created": "2020-04-16T00:20:05Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Okay heres the deal. For anyone on the fence between Opoku or Lombardi, either is a good choice but it depends on your learning style. Opoku does not do lecture well at all BUT all the stuff you need to know on the exam is in her powerpoints/from notes you take during class. So if you don't have a problem with self-study, this is a super easy class. TBH all the bad reviews are probably bc their teaching style is more of a lecture type (nothing wrong with that) but with Opoku you need to take time to study and quiz yourself on the material and you will do fine. On my exams I got 89 to 95s and all I did was cram 4-3 days before (I don't recommend doing this) but all i would do is take notes from the powerpoint and use quizlet and thats it lol.\r\nAlthough I didn't have Lombardi I went to her lectures before I had to switch out and she does lecture really well BUT her exams are less memorization and more application (so I've heard) so if that's more of your style then you should probably take Lombardi.\r\n\r\nFor my Opoku gang, I was forced to take her bc of schedule conflicts and i was so upset abt it but I ended up really liking it just bc I find straight memorization easier than application. Literally everything on the exam will be straight from the powerpoints and its straight memorization. STRAIGHT MEMORIZAION. I promise. there's multiple choice, true/false, short answer, and matching (the letters form a sentence). As long as you get the gist of how some things relate to each other and how she words it on the powerpoints you will do fine. The class in general learned how her exams are formatted and the average went from a 60 to an 80. So if you start studying the first time and you will do fine on the first exam and get ahead of the class.\r\nLab wise it depends on the TA, mine would take half the lab time and she was really lenient with answers so unfortunately you cant really control that but overall the lab practicals are also straight memorization but you NEED to study. Just reviewing wont be enough. Its hard. I got 90s on all of mine but I also studied on quizlet throughout the week and tried to connect information together. If you can push yourself to study as much as you can and have some self-control to set aside time to study, you can probably get 80-90s on each practical. Its definitely not impossible.\r\nOverall, its an okay class but if you are not willing to put in the work, you're gonna end up regretting taking the class. Its doable I promise. I wish I could answer any questions you guys might have bc it was a rollercoaster for me and I wish I could help you guys more. But for now, you got this. GOOD LUCK!!!", "rating": 5, "expected_grade": "A", "created": "2021-12-02T19:36:26Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI447", "review": "Dr. Opoku has very little regard for the well-being of her students and teaches with a large sense of entitlement. Her exams are unreasonably long, and she has a TA without any biology background grade from a rigid answer key and she almost never gives partial credit if your answer doesn't exactly match it. She speaks so quickly it's near impossible to take notes in class, and I honestly learned next to nothing at every lecture because she made the material so dense. It's a shame really because endocrinology is an interesting subject, but unless you're planning on going to med or grad school please save yourself the energy and take an easier upper-level bio course.", "rating": 1, "expected_grade": "", "created": "2021-12-17T22:59:23Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI447", "review": "Dr. Opoku has a very distinct lecture style and once you get used to it, you’ll be golden. Her exams all follow exactly the same format so after the first one, you’ll know what to expect there too. She’s the most knowledgeable (about her own field) professor I’ve ever met. You could ask her questions that are only very peripherally related and she’ll know the answer. She’s very receptive to people coming to her with questions or just for conversation. I took 440 with her as well and did not regret it. The one drawback is is that you will likely do poorly on your first exam with her bc they’re very difficult if you don’t know what you’re doing. It’s okay tho because most of her exams also have bonus points built in. ", "rating": 5, "expected_grade": "A", "created": "2022-01-09T21:14:42Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Bro... one of the worst professors I've had. The way the class is structured, she reads straight from the PowerPoints (which are very disorganized) and then writes down \"relevant\" information (which is really just reiterating what was on the PowerPoint) on paper. The amount of paper she uses has probably killed an entire forest. The information she writes down is also very disorganized. There are no supplemental assignments, so your entire grade rests on the lecture exams, lab practicals, and pre-lab quizzes. Her exams are based on memory but you really need to memorize EVERYTHING because they are so specific. There is a huge amount of material as well so this is not that easy. She may be very knowledgeable but she is not a good lecturer at all.", "rating": 2, "expected_grade": "", "created": "2022-03-30T20:43:07Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI440", "review": "She knows her stuff. Unfortunately she writes on a paper in extremely messy font, does not show all of the stuff she writes, and then moves forward without letting students capture the material. She narrates the content, but it is hard to follow and understand as she speaks way too fast and with an accent. Though I did well, exams are way too long, and are keyword based. Very disorganized overall, too specific, huge amounts of material, frustrating lectures. ", "rating": 2, "expected_grade": "A-", "created": "2022-05-09T21:26:46Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI440", "review": "If you are able to avoid this class with this Professor, do so. I have never gotten a C before. Now, I’m struggling to just pass this class and I’ve already done well in A&P . Her exams heavily focus on material she will show you 2 days prior to the exam. Also, the TA I had always rushed through discussion and ended up changing a quiz question after I took the quiz which then caused my entire answer to be wrong. So be careful. ", "rating": 1, "expected_grade": "", "created": "2022-05-11T20:06:43Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI440", "review": "this class ruined my mental health. the rubrics were so specific she was basically asking us to read her mind. don't take bsci440 with her ", "rating": 3, "expected_grade": "", "created": "2022-05-14T03:05:28Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI440", "review": "Do NOT recommend her. One of the worst professors I had at UMD!\r\nLecture: Her slides are dense and messy so reviewing them before the exam is nearly impossible. She narrates her lectures but it’s very hard to understand with her thick accent. She hand-writes her notes during lectures with unbelievably messy handwriting and a speech that is faster than typing. Opoku REFUSED to provide lecture recordings THAT SHE ALREADY HAS when I got COVID so you better not get sick during the 15-weeks of her lectures.\r\nExams: Her exams are inhumanely long (8 muti-parts problems for 50 mins). Grading rubrics look for VERY specific phrases/explanations so you need memorize exactly how she explained in class. TAs take forever to grade and hand back exams. Since the majority of your grade (~80%) is exams and the final, getting one shitty exam grade is done. She does curve slightly (about 5%) for my semester.\r\nDiscussion: Discussion and quizzes focus on different things than lecture. Very hit or miss depending on TAs. They are getting rid of it going forward so that’s good. ", "rating": 1, "expected_grade": "", "created": "2022-05-24T03:14:11Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "honestly i really like this class. i feel like im able to teach myself the content in decent time, and i really appreciate that the topics between lab and lecture so heavily overlap. since theyre considered one class, you have quite a few exams. but, i really have no major issues w the course or dr. opoku. the slides are always easy to understand. and opoku does give you everything you need to succeed for the lecture exams.", "rating": 4, "expected_grade": "", "created": "2022-11-03T15:42:53.693613Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI450", "review": "Currently taking her hybrid class. Absolutely terrible lecturer, so robotic and not engaging. Does not provide practice problems and does not leave room for questions during lectures. Class is just a verbatim repeat of her 2+ hour-long asynchronous lectures. Do not recommend her unless you want to self-teach one of the hardest UMD bio classes.", "rating": 1, "expected_grade": "", "created": "2023-03-09T18:05:41.995581Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "I was skeptical coming into her class because of all the mixed reviews but it's honestly MID rating. She gives SOLID 3-star vibes. \r\nI think she is very knowledgable, she knows what she's talking about but it is impossible to listen to her. I'm in her hybrid class so it is videos MW and then the lecture on Friday, and she literally spits out the same things that she goes over in the lecture videos. EXACTLY the same. Honestly it's impressive how she can do it, it's honestly robotic like the person below me has said about the hybrid class but it is so boring. \r\nHer lecture exams are literally you study every single detail on the slides and also be able to understand concepts, basically know everything to do good. Our first exam average was so bad that she had to add extra points...\r\nIf you do well memorizing and you have no other stem classes or a social life you will do well.\r\nI agree with others on the lab portion of this class. You need a good TA and just study and memorize and you're good to go. Lab is easier than lecture if you are better at memorizing diagrams and facts vs the concepts of lecture.", "rating": 3, "expected_grade": "B", "created": "2023-04-01T21:45:17.247068Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "This class is so hard. Get ready to study for like a billion hours for each exam, not to mention there is typically a lab practical (which are all written response) and a lecture exam in the same week, so there is quite a bit of studying to do. Professor Opoku was chill, all of our classes were online and she didn't require us to go to any of them because she posted recordings and resources for us to use for each unit. All lecture exams were online for me but we had to take them in person, all multiple choice/select all that apply/true or false. The lecture exams were significantly harder than the lab practicals, surprisingly, but they weren't impossible, you just have to really know the content in order to be successful. Ultimately, you have to pretty much self teach yourself 90% of the info in this class, but luckily you are provided great resources to do so. Also, with the amount of information you have to know it would be impossible to just simply understand it by watching a lecture. It's mainly vocabulary and memorization which is then applied to understanding physiology. I love this class, and I personally prefer this class structure, but many don't and I can understand why. Don't be scared tho, it's not as bad as literally any chem class.", "rating": 4, "expected_grade": "B", "created": "2023-05-09T15:07:09.235078Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI450", "review": "Literally the entire final was on the last 2 lectures and she gave us no warning so student who studied the early lectures did terrible and those who studied the later ones did great. She gave a “bow” at the end of the course which was cringe given she is one of least competent professors I’ve run across.", "rating": 1, "expected_grade": "", "created": "2023-05-18T19:46:34.228710Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI450", "review": "yikes. remember that this is a three credit course, equating to 10-12 hours a week. i spent well over 30 hours every week of the semester on just this class in order to score well. really think hard about it before you pick opoku. she's knowledgeable but literally doesn't communicate with the class (granted it was virtual). her slides conflict with each other, she conflicts with her slides. so many things that went wrong.\r\nif you have a bias for her because you took a&p with her and did well, she's a different person in mamphys. good luck.", "rating": 2, "expected_grade": "A", "created": "2023-05-21T19:43:07.616519Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI450", "review": "Dr. Opoku's class is a mixed bag. On one hand I really enjoyed and appreciated the in depth coverage of the material with a focus on learning and applying concepts rather than memorizing random facts, at the same time, her exams were challenging and expectations were often unclearly communicated. Our class was hybrid with lectures primarily being in the form of pre-recorded lectures which could have contributed to the confusion.\r\n\r\nPROS:\r\n- Lectures cover an extremely in depth presentation of the physiology with plenty of applications and examples to hammer home concepts she wants you to know. I definitely learned the most I have ever learned in a biology class from this class.\r\n- Dr. Opoku's lecture material will prepare you EXTREMELY well for the MCAT if you are planning on taking it.\r\n- Her exams never test you on concepts not discussed in class.\r\n- Dr. Opoku is by far the most knowledgable professor I have had in the biology department. You could probably ask her any question and she would give you a thoughtful thorough answer. She is nice when you talk to her and is always trying to help you succeed (even if her exams don't make it seem that way)\r\n- Dr. Opoku has built in \"extra credit\" on every exam: 20-30 extra points/200 points on average. However, see \"cons\" for why this isn't necessarily why this is always a good thing/helpful.\r\n- Dr. Opoku provides a 40 point extra credit assignment that can help with your grade. Note that it was quite difficult to get full points on this assignment, but extra credit is extra credit.\r\n\r\nCONS:\r\n- Exams are extremely time crunched with almost all questions being short answer. I consider myself an extremely fast test-taker typically taking only half time in other class exams. Dr. Opoku's exams took me near the whole 75 minutes. For reference, her exams were often 8-10 pages long (single sided) with at least 75% of the questions being essay questions. This means the 20 point extra points you can earn are often not \"extra credit\" but rather extra points you can spare to lose.\r\n- Few practice problems were provided directly by Dr. Opoku. If you wanted practice, you would have to use GSS practice questions.\r\n- Exam rubrics are extremely specific. If you didn't write a specific point relevant to the problem, you can lose a large majority of points associated with the problem. There is also no \"follow-through\" credit typically for multi-step physiology problems.\r\n- Your grade is solely composed of 3 midterms, a final, and the extra credit assignment = high stress.\r\n- Opoku's slides are cluttered and often hard to understand without context.\r\n- You have to know a LOT of material and there is no discussion section where you can practice. You are completely left to your own devices and if you don't have a good work ethic, Opoku may not be for you.\r\n\r\nOverall, Dr. Opoku's class is by far the most challenging biology class I have taken, but also the most rewarding. I took away a meaningful understanding of mammalian physiology but sacrificing a lot of time and devotion towards the class as a consequence. I would recommend her class if you want to challenge yourself while learning an immense amount. If this doesn't sound like you, I'd recommend probably steering clear of Opoku at least for BSCI450. Regardless, this is a hard class so whoever you take, you will need to put in the effort!\r\n\r\nTIP: If you do take her class, don't write full sentences. Use arrows to connect concepts. For example instead of writing, \"An increase in A occurs which then causes B to drop which results in C dropping\" say something like \"Up A -> Down B -> Down C.\" It'll save you time and TA's do not take any points off for this. In fact, they prefer writing answers out this way based on discussions I've had with them.", "rating": 4, "expected_grade": "A+", "created": "2023-05-27T22:22:39.206538Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI450", "review": "Dr. Opoku is an incredible professor. This class was truly my favorite class I have ever taken in college. I still go back to re-listen to her lectures to refresh on select topics. She is very helpful and responsive to emails. My class was hybrid where the lecture videos were posted for us to watch and we would meet Thursday's to review that week's material. The lectures were very long sometimes spanning five hours of lecture per week, but were very interesting. I would suggest breaking the lecture videos into chunks, so that you are not overwhelmed with the material. Also, STARTING EARLY is KEY in order to avoid falling behind in the class. The test questions are application based where you are given a situation and are asked to diagnose the patient based on the information provided. The class is a lot of work, but is definitely worth taking and doable with hard work.", "rating": 5, "expected_grade": "A+", "created": "2023-07-17T15:30:12.739406Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI450", "review": "Great professor, very knowledgeable and great at explaining things.", "rating": 5, "expected_grade": "A+", "created": "2023-10-14T19:13:54.684712Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI450", "review": "Great professor, knows what she’s talking about.", "rating": 5, "expected_grade": "A-", "created": "2023-10-16T15:31:15.588744Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI450", "review": "I had the privilege of being a student in Dr. Opoku's BSCI450 Mammalian Physiology class, and it was truly an exceptional experience. Dr. Opoku's passion for the subject matter was evident in every lecture, making the material engaging and understandable. Her teaching style was both approachable and thorough, and she always encouraged questions and discussions. Dr. Opoku's dedication to her students' success was remarkable, and she went above and beyond to provide support and guidance. I can confidently say that Dr. Opoku is an outstanding teacher, and I am grateful for the knowledge and inspiration she shared with us during the course.", "rating": 5, "expected_grade": "A+", "created": "2023-10-17T13:47:06.099273Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI450", "review": "Overall, this is a hard class. Dr.Opoku is a great teacher and didn’t make anything harder than it had to be. Her exams were fair and I felt as if she prepared me well for the mcat. Amazing professor.", "rating": 5, "expected_grade": "A+", "created": "2023-10-17T23:43:22.902480Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI450", "review": "Great professor, I love her", "rating": 5, "expected_grade": "A+", "created": "2023-10-18T05:22:31.780683Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI450", "review": "I LOVE HER!", "rating": 5, "expected_grade": "A+", "created": "2023-10-20T00:39:42.459695Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Lecture exams are multiple-choice, true/false, and matching which is nice. The matching section always spells out a message, so watch out for that. Lab practical exams are not too difficult if you study but a ton of memorization for each one. Be prepared to study.", "rating": 3, "expected_grade": "B", "created": "2023-12-01T02:50:43.104130Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "TAKE HER IF U ARE GOOD AT MEMORIZING. Her exams are taken straight out of her lecture so when studying remember every SINGLE word on the slide and you should be fine. A&P is not hard and her exams are deff very fair. She has uploaded lecture slides which can be very long and takes hella time to go through. But the class is very do-able.", "rating": 4, "expected_grade": "A-", "created": "2023-12-21T07:55:21.977419Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI201", "review": "Lecture: This class is very passable if you memorize the slides and review material. Most of the test content is directly from the posted slides and reviews sent out a week or so before exams. It's a lot of material, but the exams are fair. On the exams, there will be multiple choice, T/F, and matching. The matching will spell out a phrase. She'll usually give a bonus couple of points on the exams without mentioning it. The final this semester was not cumulative, had a review sheet to study from, and we got 20 bonus points. That being said, there was no curve in the class overall, just on the final. Class was posted videos Mon/Wed and in person on Fri, but all material was on Canvas for reference.\r\nLab: Weekly readings and pre-lab quizzes and maybe 3 or so in-class assignments. The practicals were decently easy as long as you start studying in advance. I'd recommend the posted review quizzes and anki (google it) to study. \r\nOverall a manageable class.", "rating": 4, "expected_grade": "A-", "created": "2023-12-26T15:22:14.477274Z"}, {"professor": "Justicia Opoku-Edusei", "course": "BSCI342", "review": "This class didn't have any reviews at all, so I kinda went into this class blind and took it during the winter break to raise my science GPA. I previously had opoku for anatomy and enjoyed it, so I found it interesting she taught this course also. Once again, I could say she did not disappoint. This class was not exactly as easy as I hoped, but it was very doable. It's a quick 3-week asynchronous course, so she pretty much just posts all the slides/recordings with the expectation that you are responsible for taking notes for the exams. The only assignments in the class involved 3 exams (2 midterms and 1 cumulative final -- all multiple choice), but she usually adds a lot of extra points to your existing scores on each exam, which I think is a way for her to curve them based on the class's performance. The only reason I gave 4 stars instead of 5 is the exam structures themselves, where I feel like the choices are designed to make you second-guess yourself. However, as long as you take notes on all the slides you should be okay. I think she curved our final grades as well, since I didn't actually expect to get an A- in this class. Anyways, Opuku is a great professor, so if you want a science class to take during the winter I'd recommend this one :)", "rating": 4, "expected_grade": "A-", "created": "2024-01-25T14:54:09.863781Z"}], "name": "Justicia Opoku-Edusei", "slug": "opoku-edusei"}