{"courses": ["CLAS170", "CLAS170"], "average_rating": 4.0, "type": "professor", "reviews": [{"professor": "Kathleen Garland", "course": "CLAS170", "review": "Great professor, okay course-load. This class is reading heavy and its easy to fall behind if you do not keep up with it weekly. Ms. Gardner is very understanding and answers emails very quickly. She is happy to provide clarification on any assignment. Be aware she sometimes gives out random pop quizzes.", "rating": 5, "expected_grade": "A-", "created": "2023-11-17T14:56:32.543556Z"}, {"professor": "Kathleen Garland", "course": "CLAS170", "review": "This is an easy gen-ed if you are somewhat interested in Greek mythology/classics. I was not fond of the organization of the class- pop quizzes, random tasks that make absolutely no sense (ex; check out 5000 books from the library just to never open them once), and boring lectures. She would expect us to watch boring lecture videos and then quiz us on them. Aside from the annoying assignments she gives, Garland is really nice and understanding, replies to emails fast, and is very knowlegable in Greek mythology. There are easier gen-eds out there, but this ones not a terrible choice.", "rating": 3, "expected_grade": "A-", "created": "2023-12-01T03:21:16.401665Z"}, {"professor": "Kathleen Garland", "course": null, "review": "If you are interested in Greek mythology, you will get an A. If you're like me and don't really like or hate it, the class can be a little slow at times and it's easy to not want to do the weekly readings or get lost during the classes that discuss the readings, as they can be tedious. However, Kathleen is a great professor and very helpful for students. She always has office hours and answers emails very quickly. If you need clarification on assignments' expectations, she happily answers and provides a clear idea of what is to be expected. The course load isn't bad, with weekly readings and weekly online lectures that range from 30 minutes to 1.5 hours. I'd take this course if you don't mind reading a good amount and are able to participate in weekly discussions about readings. Also, she occasionally gives pop quizzes, but allows you to bring notes. So, if you do the readings and watch the lectures and take notes, you'll be fine.", "rating": 4, "expected_grade": "B+", "created": "2023-12-06T23:54:40.880656Z"}], "name": "Kathleen Garland", "slug": "garland"}