{"courses": ["ENGL101", "ENGL101S", "ENGL101H", "ENGL101A", "ENGL388V", "ENGL393", "ENGL297", "ENGL101H", "ENGL272", "ENGL101H", "ENGL388V", "ENGL101H"], "average_rating": 3.8667, "type": "professor", "reviews": [{"professor": "Katherine Joshi", "course": "ENGL101S", "review": "Prof Joshi is the best! Not a hard grader and answers emails super quickly. You do need the textbook for her class, but the reading isn't ridiculous. I'm a STEM major and her class made me strongly consider an English minor. She really appreciates when you use her comments from old papers on the next ones, and she's happy to answer questions. One of the best profs I've had at UMD.", "rating": 5, "expected_grade": "A", "created": "2020-08-05T21:32:49Z"}, {"professor": "Katherine Joshi", "course": "ENGL101H", "review": "She's very sweet and provides helpful feedback. ", "rating": 5, "expected_grade": "A", "created": "2020-10-10T21:02:20Z"}, {"professor": "Katherine Joshi", "course": "ENGL101H", "review": "I loved her! really sweet and funny! She is super helpful and will go out of her way to assist you if you ask for it which kinda balances out the fact that she is a tough grader. Was really cool if people needed extensions or additional accommodations. I loved her and would definitely recommend her for a professor and I wish she taught professional writing so i could have her again.", "rating": 5, "expected_grade": "A", "created": "2020-11-10T21:00:30Z"}, {"professor": "Katherine Joshi", "course": "ENGL101S", "review": "Prof. Joshi is one of the best professors I've had at UMD. I had her in Spring 2020, and she handled the move to virtual classes so well. You can tell she genuinely cares about her students and wants them to do well. Going to her office hours was actually so enjoyable, she made me less scared of office hours in general. Also, unlike some professors, she doesn't give more assignments because it's a scholars/honors section which was nice. ", "rating": 5, "expected_grade": "A", "created": "2020-11-20T22:54:33Z"}, {"professor": "Katherine Joshi", "course": "ENGL101", "review": "Prof. Joshi is one of the nicest professors at UMD. She responds to emails quickly and considers her students the most to help them. Just to be clear, I am majoring in biological sciences: physiology and neurobiology with a premed track and taking courses to consider double majoring in Chemistry in the future. I had her for ENGL 101, and I know that I didn't put much effort to write the papers than other students because I really didn't have much time (this is not an excuse, you will know if you are double majoring in a STEM field), but I tried my best to not fall behind. So, my grade for every paper that I wrote is between B- to B+.  All I am saying is that if you are a STEM major and if you are taking more than 16 credits, I do not recommend taking her class. But, if you do have a lot of time to write papers and go to the writing center and all, then take her class.", "rating": 4, "expected_grade": "", "created": "2022-04-20T16:34:35Z"}, {"professor": "Katherine Joshi", "course": "ENGL101", "review": "As a STEM major, I picked this class because it met once a week and I figured with my schedule of hard STEM classes that this would be easier for me. It was not. I personally thought that she graded everything very harshly. Her response time to grading papers and giving feedback was poor and took forever which made improving your grade hard as most assingments and papers built off the previous. She does respond to emails promptly (although I did have to ask her a few times and she told me she completely forgot) and is willing to meet outside of class time to go over questions that you might have. I think if you like English and are willing to put in a lot of effort this class would be good for you but if you are looking to get an easy A in English101 I do not suggest this class.", "rating": 2, "expected_grade": "", "created": "2022-05-08T17:42:28Z"}, {"professor": "Katherine Joshi", "course": "ENGL101", "review": "Super considerate and explains things really well but such. a. tough. grader. had me on the edge all semester and I know I'm not an English major and stuff but I'd consider myself a decent writer. Her grading seemed super nit-picky cause she would take a bunch of points off just for things she said she wanted worded differently. If you have to take her class I'd recommend emailing her and asking her opinion on assignments as well as going to the writing center. Love her as a person but she will def make you work for the A so just be careful.", "rating": 4, "expected_grade": "", "created": "2022-05-12T00:36:09Z"}, {"professor": "Katherine Joshi", "course": "ENGL101", "review": "Difficult grader but very understanding with assignments and she explains everything in detail. As a STEM major, her class was challenging but not impossible. The trick to earning an A is to email her and ask her to review your papers before submission. Overall would recommend her class, but she does expect a lot of effort. ", "rating": 5, "expected_grade": "A", "created": "2022-05-19T00:34:41Z"}, {"professor": "Katherine Joshi", "course": "ENGL101", "review": "Professor Joshi was overall a very good teacher. She explains things in way that’s easy to comprehend, she clearly lays out all expectations, she structures the course in a way that makes completing even big assignments manageable. She is very understanding if you need extra time on deadlines or extra help, and gives thorough feedback. She is a bit of a tough grader - I’m not sure 100% on anything is possible. However, I still felt her grading was fair and there are plenty of other activities for points that boosts grades. ", "rating": 5, "expected_grade": "A", "created": "2022-05-23T22:19:14Z"}, {"professor": "Katherine Joshi", "course": "ENGL101", "review": "Are you a teacher's pet? Are you a Suck up? Do you have no life?\r\n\r\nIf you answered yes to any of the above questions, then by all means take Joshi. However if you are normal person looking for a Professor with whom to take English 101, Joshi is not your person. In fact, stay away from her at all costs. I will mention despite rating her like this, she is no monster. She seems like a relatively decent person, her grading standards are just insane. Joshi takes this class, which most students have clearly only taken for the sake of getting their gen ed class for English, and treats it as some kind of upper level english class that is meant for English Majors.  Like for gods sake, I am a STEM Major why do you have to take this class so seriously. For example why should you write 3 paragraph responses to her bi weekly discussion boards, and spend countless hours on papers that any other English 101 teacher would have given a 98 for, while Joshi- being the strict grader that she is - gives it a 70. Stay away from Joshi by all means, and for the sake of your GPA, please take another professor. ", "rating": 2, "expected_grade": "A", "created": "2022-06-02T03:08:39Z"}, {"professor": "Katherine Joshi", "course": null, "review": "Negative mid-semester review woohoo! I do not get excited to come to her class. It is so bland and boring and is slowly ruining the subject for me. She feels the need to push her political views on her students, which has absolutely no place in a writing class. Each day is the same thing and the class is structured exactly like a high school English class when it is not actually an English class. Couldn't be more disappointed with this class.", "rating": 1, "expected_grade": "", "created": "2022-09-22T14:21:36.680824Z"}, {"professor": "Katherine Joshi", "course": "ENGL101H", "review": "I had her for an 8am class, and I do not regret it. She is understanding if you need more time, and she will give you detailed feedback on your major assignments if you send them to her. Every assignment I sent to her (all but one), I got the highest or one of the highest grades in the class. The only reason I did not get an A+ is because I was unable to get detailed feedback for the position paper (the largest grade). I still got over a 95%, which is great considering I am a stem person.", "rating": 5, "expected_grade": "A", "created": "2022-12-22T20:07:49.961308Z"}, {"professor": "Katherine Joshi", "course": "ENGL101", "review": "Overall, Joshi’s nice, but being nice is not enough. Assigns way too much busy work. Do not take this class unless you like English. Teacher cares too much, whereas students didn’t want to be there. Hybrid option available, but people stopped coming mid-semester so she made participation a part of the grades. Expect four to five weekly assignments (i.e: discussion boards, peer review, submitting rough drafts). All of these assignments she makes you do barely boost your grade (typically at most 0.1%). Also had friends that only wrote 3 papers their entire semester, while I wrote 5, plus two projects. Harsh grader, treats this class like an advanced English class. TLDR: DO NOT TAKE THIS CLASS IF YOU DONT LIKE ENGLISH AND/OR HAVE MORE IMPORTANT CLASSES.", "rating": 1, "expected_grade": "A+", "created": "2023-05-15T19:15:38.227714Z"}, {"professor": "Katherine Joshi", "course": "ENGL101H", "review": "Joshi's class is not bad at all. I actually thoroughly enjoyed the semester with her. She's nice and willing to give extensions when necessary. As someone who doesn't like English, she wasn't a bad option at all. She is however, an extremely harsh grader. Although I don't like english, I believe I am a decent writer and produce good work. What you may think is good, may not be good to her. Every paper you write will be graded well and feedback is for the most part helpful, but not enough to help when writing the next paper. If your worried about the quality of your writing this may not be the class for you. Even still don't be discouraged and choose what's best for you.", "rating": 4, "expected_grade": "A", "created": "2023-12-18T21:37:33.660065Z"}, {"professor": "Katherine Joshi", "course": "ENGL101H", "review": "She is an amazing professor I think that she does a great job teaching this course. She grades kind of hard but if you go to office hours or ask she to review your work before submitting you will do well in this class.", "rating": 5, "expected_grade": "A+", "created": "2024-03-12T00:06:39.354716Z"}], "name": "Katherine Joshi", "slug": "joshi_katherine"}