{"courses": ["ENGL393"], "average_rating": 3.5714, "type": "professor", "reviews": [{"professor": "Kelly Cresap", "course": "ENGL393", "review": "I took this course with him over the summer which was great because he really reduced the amount of work we had to do. He's really nice and approachable, and it's quite easy to do well in his class. Just follow the textbook's examples and don't make stupid grammatical errors and you'll do fine. ", "rating": 4, "expected_grade": "A", "created": "2010-11-14T23:42:00Z"}, {"professor": "Kelly Cresap", "course": "ENGL393", "review": "Dr. Cresap is a great teacher! He keeps things light and moving. He's not that harsh of a grader. Just don't be lazy... make a solid effort, and you'll be fine. He's very approachable and easy to get along with. Awesome class.", "rating": 5, "expected_grade": "A", "created": "2010-07-13T11:59:00Z"}, {"professor": "Kelly Cresap", "course": "ENGL393", "review": "he nit picks at everything. doesn't show that he really knows the technical atmosphere as much as an engineering professor would. grades really hard bc of his nit picking. tries to be funny :/", "rating": 2, "expected_grade": "", "created": "2010-03-31T02:54:00Z"}, {"professor": "Kelly Cresap", "course": "ENGL393", "review": "Great teacher! He is kind of a harsh grader but very nice, approachable, and helpful. He wants you to do well and does whatever he can to make sure to you are successful. ", "rating": 5, "expected_grade": "B+", "created": "2009-12-23T21:01:00Z"}, {"professor": "Kelly Cresap", "course": "ENGL393", "review": "Very nice guy who makes the class very interesting. His classes may be long, but he gives you a 10 minute break, and has interesting short stories to tell each class. He is willing to work with you to meet deadlines if you give him enough warning.", "rating": 5, "expected_grade": "A", "created": "2018-05-11T00:02:17Z"}, {"professor": "Kelly Cresap", "course": "ENGL393", "review": "As nice as Cresap was trying to be, it was extremely difficult trying to understand what he’d want from us for any assignment. There’s no rubric, no sense of organization, along with the fact that you don’t know your grade unless you email or ask in person. I’m taking his course that was originally in person, now online due to the pandemic, and this situation goes to show that he’s truly not for online teaching. He took feedback on his spamming us with ELMs announcements (and us struggling to find what assignments were due that day within those 10+ announcements) and he minimized the amount and made them a bit more organized by listing everything due that day under one announcement. That was the only upside to this class. Otherwise, his critiques on my final drafts, although they should be helpful, I don’t read them because there’s no incentive for us to redo our papers when those are the final grades anyways. Whatever paper you edited after your peer review and submit to him the following week is the final draft you get graded on. He gives no direct feedback to your draft until it’s graded, so you just have to hope you magically wrote an A paper. Your grade relies on you knowing what he wants without him explicitly telling you, and hoping that the peer review somewhat helps you, and at the end only to get a nice B- for an assignment you thought you put a decent amount of effort on. I thought I could enjoy his class and get something out of it but it’s the most useless class I’ve taken. He’s also pretty good at responding fairly quickly to emails. If you’re looking for an easy A or some class to ease up your schedule a bit, I don’t recommend taking it with Cresap.", "rating": 3, "expected_grade": "", "created": "2020-05-01T15:25:48Z"}, {"professor": "Kelly Cresap", "course": "ENGL393", "review": "Please avoid taking ENGL393 with Cresap!! There is no rubric at all, and you will not know your grade unless you ask him or estimate based on your previous assignments. He asked us to fill out a mid-semester course evaluation and lots of students put that we wanted a rubric so we know what he expects for each assignment. However, he told us that \"he doesn't believe in rubrics\", so essentially it's just hoping that he likes your paper enough for it to be an A (which was a very slim chance after talking to other people in my class). The only chunk of feedback you can get is from peer reviews, but still they are unhelpful since they also don't know what he expects. The only perk to this class was that he lists out all things expected within the ELMS announcements, but there are a lot so you need to keep track of them. He might be helpful to take if you are a junior because of the resume and cover letter assignments. I am a senior, and he graded mine poorly (even though I got hired at a top company with both!!) just because it didn't meet his standard of the outdated textbook. If you'd like transparency in your grading and helpful feedback to actually learn professional writing, avoid him at all costs.", "rating": 1, "expected_grade": "", "created": "2021-01-08T15:45:15Z"}], "name": "Kelly Cresap", "slug": "cresap"}