{"courses": ["MATH241", "MATH241H", "MATH310", "MATH274", "MATH402", "MATH246", "MATH246H", "MATH410", "MATH461", "MATH411", "MATH120", "MATH140", "MATH462", "MATH246", "MATH140", "MATH241", "MATH241H", "MATH411", "MATH140", "MATH310", "MATH411", "MATH246", "MATH246", "MATH246H", "MATH411", "MATH274", "MATH140", "MATH140", "MATH406", "MATH135", "MATH140", "MATH310"], "average_rating": 3.45, "type": "professor", "reviews": [{"professor": "Kendall Williams", "course": "MATH246", "review": "Great lecturer, explains topics in a casual manner. His exams are hard but fair.", "rating": 5, "expected_grade": "A", "created": "2018-01-28T04:32:31Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "His lectures are good, and I learned a lot and understand all his concepts. However, I often am not taught how to apply these and that is what the tests are all about, and there’s no test bank on which I can practice from.", "rating": 3, "expected_grade": "B", "created": "2018-10-21T01:10:15Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "Pretty good lectures, incredibly difficult exams", "rating": 3, "expected_grade": "", "created": "2018-12-03T16:41:09Z"}, {"professor": "Kendall Williams", "course": "MATH241H", "review": "Writes definitions slowly on the board, word for word, from the book. This frustrated me at first, but once I got used to it, I started enjoying his class. He is very fair and friendly. He doesn't curve his H levels but he does drop your two lowest quiz/hw grades, and he gives you a 4.0 for 90%, 3.0 for 80%, etc. If you do your reading and suggested problems, you should have no problem getting an A. Take the H level; he says it's just a smaller class to him, so it's the same difficulty as lecture, but with 30 people instead of 200.", "rating": 4, "expected_grade": "A", "created": "2018-12-15T15:24:10Z"}, {"professor": "Kendall Williams", "course": "MATH310", "review": "Definitely, he is not a good professor. His tests are hard and he doesn't curve. ", "rating": 1, "expected_grade": "", "created": "2019-10-29T00:15:25Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "He is pretty good at explaining the topics at hand. His handwriting is great and goes through the topics just fine. Nice guy, my only real gripe is with his tests.\r\n\r\nHis tests are a real time crunch. The actual questions are not crazy difficult if you know the material but his tests are long. Basically, if you see a problem and do not know how to immediately solve it, you are not going to finish.", "rating": 4, "expected_grade": "B", "created": "2019-10-29T14:33:54Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Avoid him at all cost.", "rating": 1, "expected_grade": "", "created": "2019-11-21T22:30:34Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "I can not believe that he has a PhD in Mathematics. Exams are hard to understand and he can not explain the material in class.", "rating": 1, "expected_grade": "", "created": "2019-11-25T03:00:05Z"}, {"professor": "Kendall Williams", "course": "MATH411", "review": "His lectures are so confusion.", "rating": 1, "expected_grade": "", "created": "2019-11-26T23:15:57Z"}, {"professor": "Kendall Williams", "course": "MATH120", "review": "As a person he is very friendly and makes an effort to make his lectures engaging. However, when he explains concepts he just writes the definitions word for word on the board, its quite excessive. Then he jumps straight into practice problems without really explaining them enough. For people who have a strong background in math you shouldn't have a problem, but if you're entering one of his courses where you have little foundation in before then I really wouldn't take his class because he can make things more confusing than they have to be. His tests are also confusing in the way he words some questions and he will add things on the test that he briefly mentions for a second in lectures.", "rating": 2, "expected_grade": "", "created": "2019-12-15T01:18:25Z"}, {"professor": "Kendall Williams", "course": "MATH411", "review": "Williams is not a good professor. Please do everything to not have him ever. ", "rating": 1, "expected_grade": "", "created": "2020-03-02T17:17:59Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "I like his lectures -- his handwriting is really good and he always does lots of examples which make the concept very clear. For my class we didn't have to read the book, he just told us everything we needed to know which is nice. The exams I think are hard but fair if you do the suggested problems from the book.", "rating": 5, "expected_grade": "", "created": "2020-03-27T06:03:45Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "I don't understand the low rating for Dr. Williams. He explains his lectures well and has great handwriting, so I personally never had an issue following during class. His exams are very hard, but for a 200-level math class, that should be expected. You should be good at managing your time and always be prepared. Quizzes, on the other hand, are pretty easy. His MATLAB assignments were easy since the textbook gives examples that are very similar to the prompts. \r\n\r\nThe only complaint I have is that the written homework assignments are extremely deceiving. If it looks like the homework will only take an hour, expect to spend multiple. The questions are intentionally made to look simple but he'll throw in tricks like making the final integral only possible if you do integration by parts multiple times. Or you'll only be able to solve something by using a trig identity you wouldn't think to use.", "rating": 5, "expected_grade": "A", "created": "2020-05-19T17:41:00Z"}, {"professor": "Kendall Williams", "course": "MATH411", "review": "The only bad instructor I had in the math department.", "rating": 1, "expected_grade": "", "created": "2020-06-04T03:29:54Z"}, {"professor": "Kendall Williams", "course": "MATH411", "review": "Just don't take him for MATH 411.", "rating": 1, "expected_grade": "", "created": "2020-06-14T15:44:44Z"}, {"professor": "Kendall Williams", "course": "MATH411", "review": "He is one of the best professors in math department. One reason is he follows every step, and make clear explanation to it. Another reason is he sticks to the purview of the textbook, so you will not meet anything unexpected in the assignment or exam. However the exam could be a little challenging and the amount of work is not light at all", "rating": 5, "expected_grade": "B+", "created": "2020-09-04T18:20:28Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "I had him for MATH246 when covid hit, and let me just start off by saying he was an extremely helpful and understanding professor. When it came to lectures, he went at a fast but reasonable pace and would pause for questions from the students. His exams were fair, quizzes were easy, MATLAB assignments were also easy, however his written homeworks could be quite difficult (just don't do them the night before they're due and you'll be fine). If you need a professor for 246 take Williams.", "rating": 5, "expected_grade": "A", "created": "2020-11-18T14:49:26Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "Dr. Williams is a solid lecturer. His tests and assignments were fair and not too hard, but could be challenging at times. There was almost no graded homework, but you have to do the suggested problems to do well. His style of teaching is mostly writing down definitions and doing examples, but when he does explain things more, he does well.", "rating": 4, "expected_grade": "B", "created": "2020-11-19T02:28:38Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "Dr. Williams is a pretty chill guy who was very approachable and willing to listen to our concerns. He explained things in his lecture videos well. He also hosted problem sessions each week where he would just work through some problems, some of which were exactly like the ones that would be on the next test/quiz. There are very few assignments outside of tests/quizzes, but you definitely need to do all of the practice problems which aren't graded. The quizzes were usually easy, but some were insanely hard. The tests were generally harder. The final was also unexpectedly difficult compared to previous finals, though he probably did that since we could use our notes and look things up online. The grading on the tests/quizzes was usually pretty lenient, though. In fact, the TAs only grade 1 of the 2 questions on the quizzes, so if you mess up badly on one question you can still get 100 if they only check the other one. Matlab also sucks big time.", "rating": 4, "expected_grade": "A", "created": "2020-12-16T19:37:55Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "Williams did a pretty good job in his lectures, making the concepts relatively easy to understand. He did not explain all concepts though, sometimes just giving formulas and explaining when to use them and giving a little bit of intuition, which is how some prefer it. His tests were a little difficult but not impossible. He seems to care about his students and what they have to say, and always responded to questions and complaints we had.", "rating": 4, "expected_grade": "A", "created": "2020-12-16T20:22:53Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "Williams is a very good lecturer. He often does not spend time on the unnecessary details (like evaluating integrals) and focuses on the really important material. He was also nice and respectful when communicating with him. However, his exams were much too difficult. He made them stressful with rough time limits, and the questions were often unrelated to practice problems from the textbook. They were generally much more abstract, and he really didn't go over similar types of problems in lectures or problem sessions. He also did not curve them despite low averages on them. Additionally, he was very strict about submissions errors with online exams, as if you experience any technical difficulties he usually will just give you a 0 (unless it was specifically his fault for the error). Overall, I'd definitely take him again for his lectures, but do beware for tough exams.", "rating": 3, "expected_grade": "", "created": "2020-12-20T18:24:36Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "Williams overall was a good lecturer. Neat handwriting and follows along well. His formatting of online has been one of my favorites so far. He posted asynchronous lectures for the week but also held live problem sessions during class times that were optional. His exams dealt with fully understanding a problem even if we hadn't gone to that extent in class and the time limit on them was extremely difficult. He did not give minuses unless you were to at a very high plus ex. C+ rounded to B-. He provided 2 MATLAB assignments and 2 HW assignments which took time but were a good grade booster. No leneancy for technology issues, however he was consistent with everyone. ", "rating": 4, "expected_grade": "B", "created": "2021-01-17T17:30:15Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "Online is horrible with him. He does not give any sympathy for technological issues and it almost seems like he wants you to fail. I don’t recommend ", "rating": 1, "expected_grade": "", "created": "2021-02-21T06:15:55Z"}, {"professor": "Kendall Williams", "course": "MATH141", "review": "I took Dr. Williams spring 2021 and it was... an experience. He has zero pity for tech issues. I had my whole exam not upload in time, I watched it spin and spin, and I even took video of it spinning 5 minutes until the time went out. I had to email him the videos and he still had no sympathy. Luckily, ELMS seemed to crash for everyone, so I was good, thank goodness. His VOICE for the recorded lectures will PUT YOU TO SLEEP. I wish he had SOME kind of energy in his soul to pour into this class, but he has nothing. It makes the 50 minutes go by so slow, and I feel so disconnected to the work. I would not recommend him because of his teaching style and teaching \"attitude\" I could say.", "rating": 2, "expected_grade": "B", "created": "2021-04-02T03:19:08Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "he is literally the worst teacher. He does not care whether or not you have technological issues when submitting assignments, he will deduct 50% automatically. He has no remorse! DON'T TAKE HIM!", "rating": 1, "expected_grade": "", "created": "2021-04-30T01:48:47Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "All I can say is thank god we had P/F this semester because there was no way most of our class was making it out of this with their GPAs alive. He gives zero damns about tech issues, if you happen to have one say goodbye to half the assignment's points. The online lectures are not the best at all, so I had to watch Justin Wyss-Gallifent's. Maybe he's better in person but I can confirm the online experience was 100% certified trash.", "rating": 1, "expected_grade": "", "created": "2021-05-18T16:22:49Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Professor Williams is an amazing lecturer. This is the first fully in-person class since covid and i'm really glad that he is my professor. He explains topics very well and is very open to answering questions. His homework assignments aren't that bad and they're  group work, same with the matlab assignments. Quizzes every other week during discussion, but they aren't worth very many points. His exams are fair and not that difficult as long as you do the suggested homework problems. ", "rating": 5, "expected_grade": "B+", "created": "2021-11-22T02:25:39Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "Professor Williams was great for this MATH140. He was very thorough during lecture and helpful in office hours whenever I had webassign questions or questions on the material we covered in lecture. He makes his exams straight from the lost of practice problems that he gives to students. For our last midterm, he put a question word for word on the exam that we had worked out in class. Overall, he is a great professor.", "rating": 4, "expected_grade": "B+", "created": "2021-12-18T00:30:26Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "I was nervous to take this class because of the negative reviews, but I really don't understand the hate at all. Dr. Williams's lectures are some of the clearest and most organized lectures I've ever seen. When I had to speak with him once or twice about specific circumstances, he was genuinely empathetic, even if he's pretty strict about that stuff. He was helpful during office hours and engaging during lectures. The exams were difficult because the subject matter is difficult, not because he had unrealistic expectations. If you are hesitant about taking a class with him because of the negative reviews, know that he is an amazing lecturer and you can definitely succeed in his class if you're willing to put in the work.", "rating": 5, "expected_grade": "A-", "created": "2021-12-24T17:44:53Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Dr. Williams is a pretty decent professor. Overall, he did a good job of teaching the content. The weekly quizzes were pretty easy, and the limited homework and MATLAB assignments were doable. The class content is pretty straightforward until the last third of the class, where it felt like we were learning a bunch of random concepts. The exams were pretty straightforward but as difficult as the content. The final were pretty difficult due to the vast amount of content covered by the course.  Overall, Dr. Williams is a safe professor to go with; he isn't the easiest professor, but he's also pretty fair.", "rating": 4, "expected_grade": "B", "created": "2021-12-27T02:46:14Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "I took this course Fall 2017\r\nProfessor Williams is very straightforward and writes everything out very clearly. The exams are challenging but he doesn't give you any \"gotcha\" questions. It was a good experience overall because I definitely learned something.", "rating": 5, "expected_grade": "A", "created": "2021-12-27T17:29:56Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "He is a very straightforward teacher and like a lot of people say, it is super clear to understand him. This made the content not as hard as it should have thankfully. There are four midterm tests + a final and no quizzes, the tests are a bit difficult despite him giving us the previous semester's exam, but it is still doable if you get study hard enough, he posts suggested problems + the people who hosts GSS post their notes of the review session online. This class (in my opinion) requires a lot of memorization because there's so many concepts, but thankfully he was really clear in answering student's questions during the lectures. If you do want to get a good grade as well, GO TO THE LECTURES, he does not post lecture recordings online. ", "rating": 5, "expected_grade": "A-", "created": "2022-05-08T19:29:11Z"}, {"professor": "Kendall Williams", "course": "MATH246H", "review": "Professor Williams gave good lectures that effectively communicated the course material. My section had no discussion, so he had to squeeze in as many practice problems into lecture classes as he could. The homeworks were pretty short, so they don't have enough problems to really practice the material. I recommend doing the practice problems; they really help with studying for the exams and classes don't have enough time for practice. I was able to prepare myself for exams by going through lecture notes and doing the practice problems. Good professor, did his best in the time he had.\r\n", "rating": 4, "expected_grade": "A", "created": "2022-05-10T17:09:07Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Any professor will teach 246 simply as 'here is the process, memorize it'. There is no way to teach conceptual diff eq at a 200 level, and as such, professor Williams is a perfectly fine professor. The homework is hard but not overbearing, the Matlab is difficult if you don't know what you're doing, but the tests are okay. They're not hard, but they are graded VERY harshly. It almost seems like there's more weight put on a final answer than demonstration of understanding. I really hope he changes this, but aside from that, it's all good. Definitely would recommend him unless Terence Long is available. If Terence is teaching, take Terence instead. Otherwise, take Kendall. ", "rating": 4, "expected_grade": "B-", "created": "2022-05-14T16:01:53Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "If you just need to take MATH 140 and do not need to take higher math courses I recommend taking Dr. Williams! His lectures are very straightforward and he only goes over the application not theory- so if theory confuses you he is the right professor to take. I need to take a lot more math courses, so personally I did not appreciate his application approach. I would have liked to learn more theory behind concepts to gain a deeper understanding. Also, his lectures are on the slower side so it is easier to understand if you struggle with math. For my class he recorded lectures, however I heard from previous semesters that he never recorded lectures- so take that with a grain of salt. His exams were extremely fair and put problems on the exam that he suggests in the textbooks. My class' average exam scores were around 60-70, but do not let that discourage you! If you study the concepts and his suggested problems you should be good for the exams. Just a side note- one of my best subjects is math but I truly believe Dr. Williams teaches well and creates good exams for those who do not necessarily excel in math. The only downside to taking him as your professor is that the chapter you learn in Monday lecture will have its corresponding homework due the very next day at 7:30 AM and sometimes the homework takes a long time. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-14T18:54:06Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Amazing professor. He keeps everyone engaged in lecture, and has great large handwriting that is easy to follow. Do not be afraid to ask questions, but be mindful the amount of content needed to cover in a short time frame. Ken keeps the class personable and entertaining. \r\nThe matlabs and homework assignments are quite hard at times, but if you work with a friend than it shouldn't be too too bad. The midterms can be hard and stressful, but ultimately for me the final was much harder. There are some lin-alg concepts covered in the later part of the semester that we could not delve deep into, so I suggest watching a youtube video or two to familiarize yourself on the background, and understand why we do what wee do. Otherwise the content seems disjointed and we see no application for any of it. \r\nI would take another course with this guy if I needed any more maths.", "rating": 5, "expected_grade": "B+", "created": "2022-05-20T21:18:12Z"}, {"professor": "Kendall Williams", "course": "MATH246H", "review": "Dr. Williams was a great professor, great lecturer. His exams were fair and were the same level of difficulty as the example problems we did in class, and if you do the suggested problems he assigns you should be fine. I felt very prepared for the final as he covered all the topics (I talked to some students from Long's class and he had not taught them a couple of the topics that showed up on the final). Homeworks are a bit hard but if you can do them you can definitely do the problems on the exam. His grading system is also generous, the midterms are weighted the same as the homework and MATLABs, so even if you do poorly on the midterms your grade is not at complete loss. He also drops your lowest midterm (since there are 4). ", "rating": 5, "expected_grade": "A", "created": "2022-05-21T02:55:18Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "I'm not sure why Williams doesn't have a higher rating, he was a great and organized professor. He wrote very clear and detailed notes on the board explaining step by step how to do a problem. His exams were fair, but even if you didn't do well MATLAB and HW grades boosted your grade (plus one exam was dropped). He was always helpful during office hours and always answered questions in class - he wants you to do well. The final was very hard but I found that it didn't impact my grade too much.", "rating": 5, "expected_grade": "A", "created": "2022-06-08T01:18:39Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "There should be a certain level and respect given to students that I felt was clearly missing. Issues happen with online submissions and I believe the rules upheld by Dr. Williams didn’t respect the humanity of his students. I believe a compromise that would create a much healthier environment would be requiring the tests to be submitted 5 mins early, then allowing 5 mins of late submissions with no penalty. I understand this purely symbolic and doesn’t change anything, I think students would find this policy much more reasonable and it would reflect much better on the professor.\r\n\r\nI also understand that it is not necessary to justify one’s grading, it was infinitely less helpful getting a random fraction as my grade with no associated feedback. I would highly encourage any professor to use Gradescope or some comparable method to convey feedback and allow a dialogue in the grading method.\r\n\r\nPersonally, I wish the tests where asynchronous. I had a very difficult time managing taking the test while working.\r\n\r\nIf Dr. Williams created a more empathic policy for online submissions and implemented Gradescope with constructive feedback and correction opportunities, he would go from 3 out 5 star processor to a 5 out of 5 professor. His lectures were solid and came off as understanding during those times. His tests were difficult but overall fair, and the same goes for the homeworks and MatLabs. I also enjoyed using the online textbook with the suggested problems and solutions. ", "rating": 3, "expected_grade": "B+", "created": "2022-08-14T21:07:44Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Dr. Williams explained all of the topics very clearly and concisely, and he goes all the way to help his students to address the questions and concerns on both the HW and matlab. He also organized the class in a very fluid way. The suggested problems from the textbook really helps me to get extra and further practice with the course material. Exams are very fair (but not easy though, one has to study very hard), but I think it would be a little more helpful to provide more feedback (i.e. where one person may did which exact thing wrong/forget which exact thing) instead of just providing comments with the scores on the exams. But overall, he is still a really awesome professor, and take him for MATH 246 if you can.", "rating": 5, "expected_grade": "A", "created": "2022-08-21T04:11:50.513802Z"}, {"professor": "Kendall Williams", "course": "MATH241H", "review": "He's a chill dude overall and is definitely knowledgeable on what he's teaching. He's very open to questions and answers them well and makes sure you understand the answer before moving on. He communicates with students well and will push back deadlines if enough people ask for it. \r\n\r\nBut his exams are ridiculous. Almost every question is a conceptual word problem, and you're guaranteed to not be able to finish in time, at least confidently. You'll basically need to know how to do each problem as soon as you see it, leaving no time to properly think or check your work. (The average for two of the midterms was in the 60s... and he only curved by 9 points.) \r\n\r\nHis notes are overly wordy and make the concepts more complicated than they actually are. There are not that many opportunities to boost your grade if you don't do well on the exams, as there are only 4 homework assignments and 2 MATLAB assignments (both of which will take many, many hours to complete) and the quizzes are only worth 10 points.\r\n\r\nIn the end, if you don't have a burning passion for learning about math and its applications and don't have an already god-level intelligence in it, don't take him for calc. Just don't. There are plenty of other options that will make your journey through math requirements easier and less painful.", "rating": 1, "expected_grade": "C", "created": "2022-11-30T21:13:03.407730Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "Excellent lecturer, exams are challenging but possible if the work Is put in. Plenty of free points (quizzes, mat labs, hw), and extra credit is offered.", "rating": 5, "expected_grade": "A+", "created": "2022-12-05T19:14:37.026065Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "While he was a very good lecturer and conveyed the material well, we were never fully prepared for the exams. We were given suggested problems in the textbook that would state clearly what equations we needed to use, and what specific process we needed to follow. Dr. Williams said the exams would be made directly based off these suggested problems, yet the exam questions were not clear or specific about what was being asked. The exam questions were often too long to complete within the allotted time, and many tutors I went to for help agreed. When I would approach him for help, he would simply tell me to do more practice problems, and disregarded me when I stated that the wording was confusing. He told me at one point that the homework questions would never appear on an exam as they were too hard and time consuming, then put a homework question almost word for word on an exam. In addition we were given the same exams as the honors sections, despite not signing up for the honors class. I want to make it very clear that he was a good teacher, and conveyed the material very well, and I feel quite prepared for this final exam. However I do not think the exams were fair, or representative of the material covered or the practice questions/exams given.", "rating": 2, "expected_grade": "B", "created": "2022-12-08T21:24:16.777083Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "Dr. Williams is an extremely caring, and pleasant professor to talk to. If you stay after class and talk to him about questions in relation to course material, or college in general, he loves to talk about it with you and do his best to help you succeed. He's an awesome guy and I really owe a lot of my confidence later in the semester to his support for me. \r\n\r\nHis lectures are great. He's nice, to the point, and you can leave class with a fairly concrete understanding of the material. \r\n\r\nThe problem is that his exams are hellish. I know he does this in good faith, because he wants to challenge us and ensure that we have a deep understanding of the material, but this unfortunately has its repercussions. The exams are not taken directly from the book, as he says, because he turns them into word problems. This is not bad on its face, but very often word problems will add another layer of complexity that we are NOT prepared for in any way from the suggested problems in the textbook, and often times once the word problem has been worked through and deciphered, the actual math still isn't exactly simple. I really wish he would tone down the word problems some, because that's why our class had exam averages in the 60s, whereas other calc 3 professors had exam averages in the 80s. Again, it's done in good faith, but it kinda sucks getting bad grades on exams over and over again, and yet still somehow being above average every time.", "rating": 5, "expected_grade": "B", "created": "2022-12-12T00:35:00.411906Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "Williams is a good lecturer (loud, good handwriting, charismatic) and explains concepts well. Came out of this class understanding Calc 3 really well. Homeworks are challenging but really reinforce material solidly Matlabs suck but there's only 2. Tests are very challenging (much more so than other teachers) but manageable if you study well and do suggested problems + homework + go to discussions. Overall good teacher but sometimes work can be a little too hard (especially tests) and definitely need to put in work outside of class.", "rating": 4, "expected_grade": "B+", "created": "2022-12-13T21:29:35.314583Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "He is energetic and enthusiastic during lectures and was never boring. His explanations were a little too wordy (full sentences that seemed like they were straight out the textbook) and I wish he spent more time explaining new things conceptually. If you put in the work and do all the suggested textbook problems you are practically guaranteed an A. The quizzes are almost exactly like the textbook problems. The exams were challenging but he did give a curve and enough extra credit points to bump you up a whole letter grade. Overall, he isn't the greatest at explaining things but he gives you all the resources you need in order to succeed (suggested textbook problems). However, it is hard to do well in the class without spending hours each week doing the practice problems so don't take him if you don't want to commit to that.", "rating": 4, "expected_grade": "A", "created": "2022-12-15T03:01:20.809548Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "The only positive thing about Professor Williams were his in class lectures. His handwriting on the chalk board was big enough so that even in the back of the class you can see, he spoke loud and clear so that everyone heard him, and you can ask him question's throughout the lecture if you are confused. Those are the only good things about him, unfortunately he makes calculus 3 a much harder class than it actually is. Our homework's and math labs were very challenging and time consuming, working together is the best thing to do for these assignments as well as asking your TA's. Your TA can really make our break you in this class as well. The quizzes, were usually straight from the book and honestly are the easiest part of the class. In my class a lot of people dropped after exam 2, his exams are very difficult, word problem's these are nothing like the exams other professors were giving out. Most of the exams even if you studied it wasn't enough, now the really smart students still did well on these exams but the majority was getting a 60 percent or below. At the end of the class he did not round and or curve the final grade instead he released  7 extra credit assignments before the finals which were locked 48 hours after each one was released. This was his was of saying he \"curved\" but personally it was unfair to lock them that fast. Overall do not take him unless you are really smart, he will stress you out till the very end and don't waste your time on him. This class is only do able if all your other classes are very easy, you will need a lot of time study and he does not reply to emails.", "rating": 2, "expected_grade": "D+", "created": "2022-12-17T15:44:46.476087Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "He's overall a good teacher. His lectures are very good; he writes big and legibly on the board and takes time to go over problems from the textbook. The exams are extremely challenging and almost always uncurved though, but he does a fantastic job at preparing you for the final. For example, this semester we had 3 exams and my average between all three was 74% (counting a small curve we got on the 3rd exam), but on the final, I got a 94% which brought my grade up in the class to a B+. Also, he offered extra credit at the end of the semester which was a lifesaver. Overall I'd say you definitely have to put in work for this class but you will leave it feeling much more confident in your abilities with calculus.", "rating": 4, "expected_grade": "B+", "created": "2022-12-17T19:02:17.257171Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "This course was extremely challenging and required a lot of work, but if you did the work it wasn't too terrible. Lots of homeworks, quizzes and matlabs, but this helps extremely with the difficulty of the exams. His exams are harder than any other professor, but they will do a good job of preparing you for the final. He was a great lecturer and always made classes engaging. Explained concepts very clearly, and if students didn't understand them he would take the time to go into greater depth during the office hours. Beware that almost nothing will ever be curved in this class, even if the class average is a 55.", "rating": 5, "expected_grade": "B", "created": "2022-12-19T03:26:42.815224Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "He is a great lecturer but his assignments and exams are very hard. The average on his exams were Ds. He will say the exams are written like the textbook problems but they are much wordier and harder. He does not give a curve. The matlab and homework assignments are very challenging and even the tutors couldn’t help at some points. There was extra credit given, but this is an anomaly for his class and it did not boost your grade by much. The final is very easy as it’s written by Justin. I would recommend taking Justin if you can.", "rating": 3, "expected_grade": "A", "created": "2023-01-09T14:46:59.821931Z"}, {"professor": "Kendall Williams", "course": "MATH241H", "review": "DO NOT TAKE THIS CLASS - lets just start with that\r\n\r\nPros\r\n- Good lecturer\r\n- answers questions well\r\n- assigns plenty of practice problems that are not mandatory\r\n\r\nCons\r\n- the matlabs were difficult and dumb\r\n- the homeworks were impossible, but you can work with people which I would definitely suggest doing. Find a group of people to work with in the class. These people will be your best friends/lifelines. Shoutout to the people in my group, you guys saved me numerous times.\r\n- ah yes, the exams, the exams, the exams. I actually liked the problems presented, they were good, made you think, and were reasonable in difficulty. The problem you ask? THERE WAS NO TIME TO COMPLETE THEM. You need to literally have each problem memorized on how to do it. there is no time to think through a problem, it just has to be muscle memory bang bang bang and then its done. and no time to check work. The weekly quizzes are the same way. Its really not fair and doesn't make any sense. Because of this, do not take this class unless you have a burning passion for doing math and want to sit in your room and do practice problems all day every day because that's what you need to get an A in this class. Sooooo much easier to just take normal calc 3.", "rating": 2, "expected_grade": "B", "created": "2023-01-19T21:06:17.180400Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "it was a hard class but he explained things pretty good.", "rating": 4, "expected_grade": "B", "created": "2023-02-03T20:36:11.826536Z"}, {"professor": "Kendall Williams", "course": "MATH411", "review": "Does not even lecture, just has students learn everything on their own. Has other students answering questions from other students instead of himself. Forced people into groups, and did not respect students (I was only female in his class and treated me like shit). What is the point of lectures when there is no \"lecture,\" just group work that is not beneficial.", "rating": 1, "expected_grade": "W", "created": "2023-03-24T19:30:26.425419Z"}, {"professor": "Kendall Williams", "course": "MATH241", "review": "Professor Williams is an excellent professor. Stay on top of the suggested problems and complete hw/MATLABs, and you will do well. Most negative reviews are students complaining about his tests because they are not willing to put in the work to do well.", "rating": 5, "expected_grade": "A+", "created": "2023-04-17T01:07:34.154960Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "there's not nearly enough reviews on math140 as of recent, so I'll supply you all with one.\r\n\r\ndr williams is a great person, but not the best professor. im honestly teetering between giving 2 stars or 3 stars, but for now, i think i'll stick with two. dr williams' class should not be nearly as challenging as he makes it. it's based a lot on theory, which can be helpful for some, but the application of topics is really important for exams. and don't even get me started on the homework...half the time i would be stuck on a hw problem, and he would say smth along the lines of \"well don't worry about the way webassign puts it, i wouldn't give it like that\"....then why is it in our hw? why am i being given calculator problems when we cant even use a calculator on quizzes, exams, etc? it's just a waste of our time. i also spent a lot of time in office hours, and u can ask almost any of my friends that after a while, i would be demotivated to even go to his office hours, bc he just seemed so demeaning when u would ask him a question. it's like he didn't even want ppl in his office hours, but that's legitimately the only way to understand some concepts outside of class. \r\n\r\nif you can, maybe taken another calc teacher with higher ratings, but if you're forced to..ig take dr williams? just be weary lol. \r\n\r\nalso just some quickfire notes, that are the same amongst most calc classes: there r 4 midterm exams, 1 final, one midterm is dropped. 4 webassign homework are dropped, and webassign homework is usually due the day after classes (tuesdays and thursdays) at 7:30 am\r\n\r\ngood luck!", "rating": 2, "expected_grade": "C", "created": "2023-05-17T14:55:49.527572Z"}, {"professor": "Kendall Williams", "course": "MATH310", "review": "Do not take with this professor. Low grade no curve, literally more than half of the students dropped.", "rating": 1, "expected_grade": "D", "created": "2023-05-20T23:54:30.214123Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "I FAILED THE CLASS. I will say I was not the best student so I won't complain the exams or anything like that because I do believe thats kind of my fault. However, I will complain about Kendall Williams character. He in class says to come in for office hours if you're not doing that well, he is liar. When you go in for office hours, he does nothing but berate you for not understanding a concept. Which entirely defeats the purpose of going in for office hours at all. If this is your first calculus class I'd just be careful. Then again I was not a good student so it might be a different experience for other students. I hated this class ong.", "rating": 2, "expected_grade": "F", "created": "2023-05-23T04:49:24.256249Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "Dr Williams is a great professor. I am not super into math, but he explains concepts well, making the class manageable. The exams were mostly fair (I can remember one problem on one exam that was not fair imo). If you do the suggested problems and homework, you will do well. He was also very accessible in office hours and cared about the success of his students. Would recommend.", "rating": 5, "expected_grade": "B+", "created": "2023-05-23T22:40:13.525867Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "I personally thought that Dr. Williams was a good professor. He was a super friendly professor and did a good job of teaching all of the topics. I thought he was pretty clear on what topics were gonna be on the exams. There were 4 midterms and one final in the class and he dropped one of the midterms. The final was not very difficult. The difficulty of the midterms was a bit unusual where on two of the midterms the average was around a 50% but on the other two they were closer to 80%. I might be biased since I already took Calc 1 in high school so I knew most of the topics and was just relearning the material for the most part. I didn't put a ton of effort into the class and was able to get an A but I do think that even if you have no calculus background that if you put in the effort and did all of the assigned work that it is definitely attainable to get an A as well. Every week he gives us a list of assigned problems that we should do and I would recommend doing all of those problems because he would usually put at least one of those problems on every exam, and those were the problems that were usually more difficult. For discussion there was a quiz every week on Thursdays which were very easy and you were told what topics were gonna be on the quiz beforehand. This might differ with TA but on Tuesdays it was mostly just the TA solving any problems that we were confused about on the hw or somewhere else. I never went to his office hours but I did ask him questions after class and he was super friendly. I would recommend taking his class. I don't know how he compares to the other calculus teachers for 140 but I think he's a good teacher and you'll get a good foundation of calculus from him.", "rating": 5, "expected_grade": "A+", "created": "2023-06-08T05:54:52.273139Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "Kendall Williams is a cool professor and holds great lectures. He spends the majority of the time doing practice problems so the students can follow along and learn, as opposed to other calc1 profs. that spend too much time on tedious proofs. \r\n\r\nCalculus 1 is so easy if you don't waste your time watching youtube and playing video games. Just open up your textbook and do practice problems and you will get an A guaranteed. So many reviews on here say \"he doesn't curve\", if you are expecting your teacher to curve the most rudimentary math class at UMD you should think twice before blaming your bad grade on the professor.", "rating": 5, "expected_grade": "A+", "created": "2023-07-15T14:27:54.824232Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "Although I passed the class with a satisfactory mark, that does not mean I was satisfied with Dr. Williams. Firstly, what prompted me to even make a review in the first place is to correct a lot of lies that people are claiming he \"drops the lowest midterm.\" First of all, he does not do that. In fact, he does not curve at all despite the fact that most midterms averaged a score of 50%. What presses me even more is the fact that his office hours are not helpful at all. Instead of helping you with questions about topics from a lecture, he will tell you to \"look in your notes\" as if that was not the first thing I did. To make matters even worse, the examples he does in class are SOMETIMES unfinished. What do I mean by that? I mean that he doesn't conclude with an answer, but probably a few steps from the answer and tells us to \"finish it ourselves.\"\r\n\r\nThe only positive experience about this professor were the way he explains problems. It was a lot more direct and he focuses more on the application rather than theory.\r\n\r\nOn a final note, his midterms are NOTHING like the webassigns. There are questions that were flat-out never presented to us on our homework, so really you should be studying your textbook rather than the problems on there. This god-forsaken math department lacks any real talent, so I still believe this professor is your best bet.", "rating": 2, "expected_grade": "A-", "created": "2023-07-25T17:55:20.492657Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "This man is the larry herman of math teachers. He's a dinosaur, but a good teacher. The problem with that though is that alot of REALLY IMPORTANT INFORMATION WILL LITTERLY BE SAID ONCE AND NOT WRITEN ANYWHERE FOR PEOPLE TO LOOK AT. If you skip class, or are just the kind of person who is litterly too busy to attend slow paced lectures that waste alot of time (like me), you are going to hate this teacher by the time the first midterm comes. I just took an exam, and partial fraction decomposition from calc 2 was a REQUIREMENT FOR SOLVING THE BIGGEST PROBLEM ON THE EXAM. I was litterly uninformed. Everything was fine except for that one fucking question, and it happened all because this teacher is alergic to documenting what goes on inside of his class rooms.", "rating": 1, "expected_grade": "", "created": "2023-09-29T18:19:13.544329Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Seriously an amazing lecturer--not at all sure why his reviews aren't higher. He is a very straightforward lecturer and makes it clear multiple times throughout the semester what he wants to get out of his students. His class will not be easy but if you have a good work ethic and pay attention during lectures you will get all the relevant info needed to do well on tests and homework. Cannot recommend Dr. Williams enough!!", "rating": 5, "expected_grade": "A+", "created": "2023-10-17T03:25:31.901061Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Nice guy and a great lecturer, with clear notes. His tests and exams are 10x harder than the other classes, and if the midterm is easier he will add more questions so you will not finish the exam. I would not recommend it unless you are trying to suffer through the course. He is the exact same for calc 3 except luckily gave us extra credit. Because I took this class before and calc 3 I did better on the exams than most but when I took calc 3 with him I failed his exams multiple times and put in so much work to get a B, take this course at your own risk ion ever know how this class has so many good ratings lmao, yall are capping.", "rating": 2, "expected_grade": "B+", "created": "2023-11-07T04:17:54.371764Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "Great guy, super nice. His exams are absurdly hard for no reason. Homework is 20x as hard as the material covered in class. The worst math class I've taken, almost made me drop out. Please avoid it for your own sake.....", "rating": 1, "expected_grade": "C-", "created": "2023-12-06T23:52:03.023502Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Dr. Williams has a simple teaching style. He is a strict grader, but the exams are fair. If you are an organized note taker, and do the suggested problem sets you will do well in the class. My best professor at Maryland so far.", "rating": 5, "expected_grade": "A-", "created": "2023-12-09T02:42:29.983844Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Great lecturer with large, easy to read handwriting and clear notes. Explained concepts and in-class examples well and slowly. Spoke loudly and clearly and was very receptive to questions asked in class and office hours. Homework assignments were a little tricky, but doable. Matlab assignments were annoying if you have little Matlab experience. Only downside was that his midterm exams were insane, so be prepared.", "rating": 4, "expected_grade": "", "created": "2023-12-11T22:27:26.757270Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Great lecturer who writes easy to read and understandable notes during class. The examples he does are easy to follow along and he is very receptive to questions both during lecture and office hours. He does a good job in making sure the class understands a concept before going on. HW assignments were tricky but doable. Matlab assignments were annoying if you little prior Matlab experience. That being said, his exams were insane and he curves only if he felt that he made a mistake writing the test.", "rating": 4, "expected_grade": "B", "created": "2023-12-12T01:54:37.842134Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "Overall he's a genuinely nice person who wants to see his students succeed. That said, you have to put in A TON of work outside of class in order to understand the material, especially if you haven't taken calc before. My biggest problem is that he didn't understand what really needed to be weighted in the lectures which made it sound like he went on tangents sometimes. For example, he went on a tangent about how you can name a variable basically anything rather than focussing on the more important topic of limit substitutions. However, he did pretty much say that you have to teach yourself the textbook content on the first day in order to find value in the class so it's possible that the majority of people didn't take that seriously. That aside, if you take time out of the day to learn the textbook section before lecture (i.e reading and doing the suggested problems) you'll have no trouble with the class as the exams are fairly easy and strait forward. His office hours are also really helpful but not necessarily for the fact that he gives individual attention but more for the fact that they end up being like a discussion period for answering questions about the WebAssigns. He does not curve the class or exams but HE DOESN'T GIVE MINUS GRADES which in of itself is amazing but is also an inherent GPA boost if you're in that territory (only expecting an A because of this).", "rating": 4, "expected_grade": "A", "created": "2023-12-15T16:43:56.664558Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Good professor, nice guy. He speaks loudly and clearly and writes clearly on the board. No quizzes. Decently easy homework and Matlab assignments. His exams are super difficult though. You really have to study and know your stuff. I'd recommend him.", "rating": 4, "expected_grade": "A", "created": "2023-12-15T20:22:03.928665Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "I honestly don't know why Dr. Williams has so many bad reviews. He's a great lecturer and explains everything really well. If you pay attention in class, and redo the problems done in the lecture, the ones he suggests in the lecture, and the ones suggested in the syllabus you should honestly be fine. His office hours are pretty hectic with the amount of people in there, but you should definitely go because he'll re-explain it. My TA was also great and was really helpful with understanding the stuff we went over quickly. I will say the discussion worksheets and WebAssigns are really hard but he doesn't make them, the department does.\r\nALL IN ALL, you should definitely take him for MATH140.", "rating": 4, "expected_grade": "B", "created": "2023-12-15T20:25:11.878754Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "Math140 is honestly just a hard class in general. Williams did a good job explaining most things and made sure to answer every question without hesitation. The midterms (4 of them) were hard but he ended up dropping the lowest one which helped. The webassigns and HWs were time consuming but helped when studying. His lectures were fine but as a person he is super nice.", "rating": 3, "expected_grade": "B-", "created": "2023-12-15T21:26:32.223573Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Dr. Williams is a really good lecturer with large handwriting and clear examples. He is very understanding and curves well when the exams are too long/complicated. His homeworks, Matlabs, and exams are definitely more challenging than other professors' though, and requires more application. The final is a lot easier in comparison to his midterms.", "rating": 5, "expected_grade": "A", "created": "2023-12-17T02:17:12.691091Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "He writes his notes big on the blackboard, and is a good lecturer. But god damn it the exams. He makes the exams so hard and not finishable in the given time (50 minutes). You literally have no time to think. As soon as you read the question you have to start writing like ah solve this equation using .... and you gotta be like okay boom boom boom right there and then. The other thing is he does not give extra credit. Not on exams, not on homework, not a single point. He does not curve as well. He says “I wont curve unless it is my mistake” meaning he only curves if he made a mistake. For us (fall 2023) he gave us a 10 points “curve” for exam 2 as some students literally turned in their exams without even finishing a couple questions due to time constraints. For a 3 credit class I spent too much time studying for the exams. Maybe it is because I took this class straight from doing Calc I and II. I have noticed most students taking this class have done Calc III or linear algebra. Still don’t get me wrong he explains the content very well, but again the exams. He does not post answer keys for the exams you take, or for the one \"practice exam\" he posts on Canvas. Be aware he does not like giving answer keys to student (had this argument in class with a student). I still think he is your best bet so just be aware you gotta put in the work. What I have noticed is professors either teach the material very well, and have hard exams or don't teach the material at all and have either easy or hard exams. It is hard finding a professor who teaches the material very well (like Dr. Williams), and give a reasonable exam. Just because a professor taught the material well doesn’t mean they should make the exam 10x harder. Just give us a fair exam thats doable in 50 minutes. Is that so much to ask? Remember it is their job to teach the material with clarity. Good Luck!\r\n-MK", "rating": 1, "expected_grade": "A", "created": "2023-12-17T05:25:01.582716Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "Calc is a hard class, but Kendall makes understanding each topic easier especially if you have never taken calc before. For my class he didn't record his lectures so you needed to be at all three lectures per week. One thing that he did that all the other 140 teacher didn't do was that he didn't give out any quizzes, which I liked. You have to attend discussions because there is a graded worksheet for each one. Kendall also doesn't give out minuses, so I got an 82% but I'm still going to get a B as my grade. One thing that I heard other students complain about was that Kendall makes his test harder then other teachers. I believe his first two test were easy, however, each of the last two test had one problem that was not like any of the others that we went through in class, which most of the class would end up getting completely wrong. I think that overall Kendall is a good professor and you should take him if you can.", "rating": 4, "expected_grade": "B", "created": "2023-12-17T06:33:32.295644Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "Dr. Williams is a very good lecturer, he writes clearly on the chalkboard and makes sure to repeat important information. He does a good job explaining things in a simple and easy to understand way and he usually doesn't go too fast during lectures which is generally good, but sometimes that means we don't finish a topic and have to stop in a weird place which can be confusing at first when we come back to it next lecture. He is fairly approachable during office hours, the only thing is usually there are a lot of students there so you end up relying more on other students for help than the professor, but if other students can't help you he is willing to answer your questions. There were only 3 matlab assignments and the first one had lots of examples in the textbook to guide you through it which was good because I had never used matlab before and it helped me understand how to use it. The other two matlab assignments were group assignments which is a good or bad thing depending on your opinion of group work. The homeworks weren't that much work, usually just 3 or 4 questions and they were usually the same type of questions that would be on the exams so they were good practice. On the topic of exams I highly recommended doing at least some of the suggested problems from each assigned chapter. Sometimes you might not have time to do all of them, but at least do some of them as I think they are the best way to be prepared for the exams. It seems like he likes to have an average of about 75 on the exams and he won't curve exams unless he realizes that it is his fault. For example the 2nd exam had an average of around 65 because the exam was way too long and most people were not able to finish. Because of this Dr. Williams added 10 points everyone's grade. Don't get me wrong this class is not an easy A, but I think the exams are fair and as long as you make an effort to attend and pay attention in lectures and do the suggested problems outside of class you will do fine.", "rating": 5, "expected_grade": "A", "created": "2023-12-18T00:51:17.438935Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "Course: Overall the class is pretty well structured. Lots of assignments but that’s just expected for a common math class like MATH140. There were worksheets, online homework through WebAssign, written homework, midterm exams, and the final exam. The WebAssigns were more to assess and make sure you understood how to do the material, the worksheets are harder but will be more of what your midterm questions will be like, the written homeworks are kinda miscellaneous but they’re important to your grade. If you put effort into this class and get help from office hours, the tutoring center in Kirwan, or just online help, then you will be fine in this class. Don’t slack off on the exams.\r\nBreakdown:\r\n- Worksheets (20), 10%, they’re done EXCLUSIVELY only in discussions, and you must turn it in by the end of it, otherwise you won’t get points, so don’t skip discussions and do your best on it. You can always talk and get help from classmates if you need to.\r\n- WebAssign (28), 12.5%, anywhere from 8-15 questions per section. These are usually due at 7:30 AM on Tuesdays and Thursdays, and usually address the content that you learned the day before when you had a lecture (Monday, Wednesday, Friday).\r\n- Written Homework (5), 15%, THESE ARE WEIGHTED PRETTY HIGH. There are only 5 of them, so take them seriously. The first 3 are on your own and you have to submit both online through ELMS/Canvas and the day it’s due in discussion. HW04 and HW05 are group written homeworks that are you guys doing practice exams leading up to the final, so get with your group early.\r\n- Midterm Exams (4), 37.5%, these are all weighted equally, so don’t worry about the 1st exam being weighted more than the 4th exam. He will provide you with a past practice exam for each exam, and if you want more practice exams, just email him if he has any more. As long as you study the notes and worksheets, you should be fine.\r\n- Final Exam, 25%, study a bunch of the practice exams beforehand, go to his office hours, go to your TA’s office hours and you should be ok. Make sure to read the questions.\r\n\r\nProfessor: I think Kendall Williams is pretty good. Some people may say he moves slow, but that’s not necessarily the case, it’s just he explains every part of the example problem that he does. The examples he does in class are very well explained, any questions that you need just raise your hand and he will explain it in depth how he got there to make sure that your question is answered and that you understand it well. He doesn’t post his notes so you should go to class otherwise you probably won’t know how to do the material or know what’s going on unless you’ve already taken Calculus 1 in the past and understand it well. He emails back pretty quick, his TA’s are pretty good (shoutout Jacob). Also has a sense of humor, if he doesn’t get to the material in class, he will push back the due date for the WebAssign, and is very professional all around. I would always recommend him to other people.", "rating": 5, "expected_grade": "C+", "created": "2023-12-26T16:51:12.841776Z"}, {"professor": "Kendall Williams", "course": "MATH246", "review": "OK, everyone saying things on here that are pushing the rating to the 3-star region are being very unfair IMO.\r\n\r\nThere are no quizzes in M246 with Williams, and the discussion is basically optional so only go if you feel it is necessary (I personally found my TAs unhelpful too which was another thing but that wasn't really Williams' fault). That being said, the lectures feel very \"engineering course\"-y in the context that there is NO justification of anything being done. In DiffEq, the opportunity to explain at least some of the logical things in the course (integrating factor, method of undetermined coefficients, hamiltonian functions, greens function, etc) was there, but it felt like Williams just chose not to because there wasn't enough time and he thought people wouldn't have interest. Not only would people have interest (at least I did), I think it would've helped made some of the concepts easier to understand (since there are a lot of non-logical concepts in DiffEq like Variation of Parameters, Local Linearization, etc).\r\n\r\nIn terms of what you learn in the course though, you definitely will learn the appropriate content and he gives you enough of a basis to go out and justify some of the things he talks about in class should you feel that is necessary (like I did). Very approachable during office hours, and an overall really fun person to be around (not to mention he's super built and will talk about non-Math things as well). Cool guy overall, definitely knowledgeable... I'd definitely take Williams for M246 if you get the opportunity.", "rating": 4, "expected_grade": "A", "created": "2024-01-07T04:30:29.129369Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "He’s an excellent professor for Math140. Took him Fall 2023 and the exams were literally what he assigned to us on WebAssign and what he went over in class. Just show up to class, take notes, go to discussions and you will pass. The only thing you have to watch out for is the written homework being weighed pretty high, it is easy and you have plenty of time to do it, but make sure you check over your answers. This class was light-work.", "rating": 5, "expected_grade": "A", "created": "2024-01-25T19:47:57.064262Z"}, {"professor": "Kendall Williams", "course": "MATH140", "review": "I've only had him for a little while but I have to say I love his teaching style. He is very open to questions is super kind and is always available for extra help. Math 140 is a tough class but his slow methodical teaching style makes things easier. Definitely recommend.", "rating": 5, "expected_grade": "", "created": "2024-01-29T19:31:52.432804Z"}], "name": "Kendall Williams", "slug": "williams_kendall"}