{"courses": ["CPSS225", "ENES200", "ENES200", "CPSS225", "CPSS225", "ENES200", "CPSS240", "CPSS340", "CPSS240", "ENES200", "CPSS225", "CPSS240"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Kuan-hung Lo", "course": "ENES200", "review": "An incredibly amazing and affectionate professor. Professor Kuan-hung Lo always shows a deep concern for both the course material and his students, always being open to feedback. What's more, he's refreshingly open about himself, creating a welcoming atmosphere that made it easy to have honest conversations after class or during asynchronous lectures. TMI: his research interests include robots in everyday life, ethics in robotics and artificial intelligence, and gender issues in technology. \r\n\r\nThe best part is that the class isn't about right or wrong answers since it focuses on ethics. Professor Kuan always encourages students to express their beliefs and perspectives, emphasizing the importance of respecting everyone's opinions regardless of differences. This mindset carries over into discussions, where we talked fascinating topics and engaged in interesting activities. All these activities aimed at fostering self-awareness. In conclusion, the course provided an inclusive and diverse environment. Moreover, there is no pressure about grade because the class doesn't use standard grade system but grade contract instead, which based on timely completion and decent work. So complete your assignment on time and do it with some genuine effort.\r\n\r\nPros:\r\n- Incredibly caring and amazing professor\r\n- Deep concern for course material and students\r\n- Welcoming atmosphere for honest conversations\r\n- Emphasizes respect for diverse opinions\r\n- Inclusive and diverse learning environment\r\n- Grading contract based on timely completion and decent work\r\n\r\nCons:\r\n- Weekly assignments: there are a lot of written assignments in the course. You should expect 2 written assignments per week (a short one: pre-lecture or exit ticket AND a long one: CEC or RR). Although the workload is distributed fairly, I usually struggle with writing because I overthink. So I sometimes got overwhelmed because of my other STEM courses. But if you are good with writing with supporting evidence then there is no issue.\r\n\r\nI definitely recommend this class. The contents are informative and everyone is respectful. ENES200 gives DSHU and SCIS and is easy A course.", "rating": 5, "expected_grade": "A", "created": "2023-05-26T00:26:53.934366Z"}, {"professor": "Kuan-hung Lo", "course": "CPSS240", "review": "Kuan is the best. He's very chill and seems to really enjoy teaching. Highly recommend.", "rating": 5, "expected_grade": "A", "created": "2023-12-02T17:05:07.413899Z"}, {"professor": "Kuan-hung Lo", "course": "CPSS240", "review": "Easily my favorite teacher on campus as a teacher and even as a person. The class was small so he was able to really get to know everyone well. Each class was enjoyable even if the topics weren't because of Kuan. He was constantly asking us for feedback on how he was running the class as well showing us how much he cares. The GOAT.", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T18:05:50.503092Z"}, {"professor": "Kuan-hung Lo", "course": "CPSS225", "review": "Allow the accent, it will not interfere with the course whatsoever. The man is super chill and enjoys teaching this course, and is very caring about students' situations. Does his best to keep the class engaged and is very lenient with grading and work extensions if necessary.", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T06:07:52.433002Z"}], "name": "Kuan-hung Lo", "slug": "lo_kuan-hung"}