{"courses": ["ENST233", "ENST434", "GEMS296", "GEMS297", "GEMS496", "GEMS497", "ENST472", "ENST499Z", "ENST689Z", "ENST689", "ENST689I", "ENST689E", "ENST388", "ENST334", "ENST472", "ENST689", "ENST233", "ENST472", "ENST689", "GEMS396", "ENST334", "ENST388", "ENST472", "ENST689", "GEMS397", "ENST233", "ENST472", "ENST689", "ENST334", "ENST472", "ENST689", "ENST233", "ENST472", "ENST689"], "average_rating": 4.9167, "type": "professor", "reviews": [{"professor": "Lance Yonkos", "course": "ENST233", "review": "Professor Yonkos is awesome.  The class is extremely straightforward and moderately interesting.  Theres a ton of content each unit (the book isn't necessary, just go to lecture and discussion), but the tests are easy if you know the big picture concepts and pretty much follow his study guides word for word.  The group research project (7-10 page paper and group presentation) is annoying but they grade it very leniently.  Definitely take this class if you're an environmental studies student looking for an elective", "rating": 5, "expected_grade": "A", "created": "2015-05-10T12:09:00Z"}, {"professor": "Lance Yonkos", "course": "ENST233", "review": "Professor Yonkos is amazing. You can tell he really cares about his students. He was always positive and energetic. Although the information for this class could be tedious to get through, he always tried to make it interesting.\r\nHis office hours were by appointment so I was hesitant to make an appointment if I only had one question, therefore I never did. However I wish I did because he seems like a great professor to have a connection with for references and whatnot.\n\r\nOnto the class itself. I'll admit I didn't try hard at all in this class, yet I still managed to get a B (83.3%). I attended lectures for the first third of the semester then stopped because he put his lectures online (however I rarely looked at them). For the exams, the only studying I did was look at the google doc based on the review sheets he provided. I never even purchased the book and everything on the exam, he had on his slides so if you want to save money, don't bother buying it.\r\nThe class had three exams--2 midterms and a cumulative final (which was mainly content from the last third of the semester, then ~5 repeat questions from the first two exams). I got a 78%, 84%, and 74% respectively.\n\r\nOnto discussion. Discussion is mandatory; you receive participation points for attending/reading assigned texts prior to it. There are small (2-3 questions) pop quizzes based on discussion readings assigned. However, these weren't posted on ELMS so I think they're just factored into your TA's opinion on whether you were doing your job or not. The discussion readings were interesting and discussion was fun when people were actively engaged. I got a 4/5, though I only ever said one thing in that class.\r\nThere was also a 7-10 paged research paper and a group presentation based on it to do. Never been fond of writing--I complain when I have to write more than 2 pages. I got a 90% on it with most points taken off for formatting, so don't worry about it; especially if your topic is interesting (your group gets to select). Got a 91.5% on the group presentation as a group and a 92.5% as an individual with little preparation so don't sweat that either.\n\r\nOverall, this class is great, especially with Yonkos. If you actually attend class and go over notes, you'll likely get an A.", "rating": 5, "expected_grade": "B", "created": "2014-12-18T22:35:00Z"}, {"professor": "Lance Yonkos", "course": "ENST233", "review": "Yonkos is an overall solid professor. ENST 233 was far from challenging but he did what he could to make it interesting. If you need a GPA booster, this class is a good choice.", "rating": 4, "expected_grade": "A", "created": "2014-08-20T03:18:00Z"}, {"professor": "Lance Yonkos", "course": "ENST233", "review": "I love Dr. Yonkos! He's approachable, friendly, and can be funny. His lectures are a bit boring but he does try hard to make the material interesting - most of it is.\n\r\nUnfortunately most of this class is straight-up memorization. I got an A+ by going to lectures (though he does post slides online) and just memorizing the concepts on the study guides he gives out for every test, including the final.\n\r\nDiscussion is a bore but oh well. Don't worry about the 7-10 page term paper - usually your topic is mildly interesting so it's not too hard to write. Anyone who honestly tried hard got an A in my class.\n\r\nDO NOT buy the book for this class. It is USELESS. You will never, ever use it and he will never, ever test you on what's in it, though he encourages you to read it. It's incredibly dry and uninformative.", "rating": 5, "expected_grade": "A+", "created": "2013-04-25T23:00:00Z"}, {"professor": "Lance Yonkos", "course": "ENST233", "review": "Most of the reviews are pretty accurate. He cares about whether students are learning or not and he is very energetic and appears to be enthusiastic about the subject. His slides have a lot of information and yes he does post all of it online, however taking notes on what he says in class or paying attention makes the difference between an A and a B. \n\r\nThe class is a decent amount of work, but it is graded fairly leniently. 15minute group presentation, 7page research paper, 3 easy tests, random attendance quizzes and discussion is a waste of time. I recommend doing the discussion readings so that you can enjoy that class since participation is mandatory.\n\n", "rating": 5, "expected_grade": "A+", "created": "2012-05-18T11:13:00Z"}, {"professor": "Lance Yonkos", "course": "ENST233", "review": "I agree with everything that has been said by the others. Yonkos is a really good guy, and ENST233 was very interesting. \n\r\nHe packs a lot into his powerpoints, so that can be a bit of an issue when it comes to studying for the test. Still, I really enjoyed the class and recommend it to those who don't care much for the sciences. I really learned a lot. ", "rating": 5, "expected_grade": "B", "created": "2010-12-20T23:31:00Z"}, {"professor": "Lance Yonkos", "course": "ENST233", "review": "The professor is a decent guy--get to know him and he'll teach you lots! He's one of the most approachable instructors on campus. He actually cares about whether or not kids learn a thing or two from his lectures. Very understanding. \n\r\nHe's a great speaker, enjoyed listening to his presentations, but his teaching style overall is a bit bland. Taught straight from the slides (and graciously posted them up after every class)--which was both good and bad. Good because it's a straightforward study tool. Bad because it didn't excite me as much as I would have liked. \n\r\nIn general, test averages ranged from B+ - A-. Half of the final grade is based on a group presentation graded by fellow discussion members and TA. \n\r\nNot a bad experience, just didn't like the course content itself--focused too much on problems/theory and not enough on solutions. Also, the main evidence for most of the claims were based on \"biased statistics\" (the professor's exact words); pretty disappointing. \n\r\nBut, if you need a class to boost your GPA, take one with Professor Yonkos. ", "rating": 5, "expected_grade": "B", "created": "2010-12-07T23:07:00Z"}, {"professor": "Lance Yonkos", "course": "ENST233", "review": "This class is pretty straightforward, and Dr. Yonkos is a nice professor.  He puts his Powerpoint slides online, which is nice, but I still recommend you attend lecture because then the slides make more sense and it helps reinforce the material.\n\r\nThe material itself isn't too challenging.  There are three exams-two midterms and a final, with the final being cumulative-though Dr. Yonkos does provide review sheets for the exams.  The exams consist of a combination of multiple choice and short answer/definitions.  Some of the questions can be somewhat tricky, but Dr. Yonkos is pretty generous with the grading, so no need to worry too much.  If you pay attention in class and study, you should be fine.\n\r\nIn addition to the exams, there is a group project (later in the semester) involving a presentation and a paper-as well as the fact that you have to attend the other presentations (for participation grade).  The group projects aren't terribly difficult, and even though Prof. Yonkos decides the groups, you still have a choice of topic.  My advice would be not to procrastinate and to just try to be as fair as possible when dividing up the work.\n\r\nAll in all, this should be a good, straightforward class.  I took it purely as an elective, although many students in the class take it as an ENST requirement.  The class covers a lot of different topics on a general, basic level, but nontheless, it's interesting, relevant, and important material especially in regards to current environmental issues.\n\r\nGood luck!", "rating": 5, "expected_grade": "A", "created": "2010-05-27T21:44:00Z"}, {"professor": "Lance Yonkos", "course": "ENST233", "review": "Dr. Yonkos is great. He's a very effective lecturer (keeps it interesting and tells you just a little bit more than you need to know). Also, his exams are pretty easy as long as you pay attention to the class-- the book won't help you much if at all because he tests based off of his lectures. The discussion was a little boring, but my TA did her best. The paper isn't that bad; as long as you don't obviously add fluff, you should get an easy A on it.I spent a solid 3 hours on a 9 page paper and got a 98.", "rating": 5, "expected_grade": "A", "created": "2017-12-30T20:36:14Z"}, {"professor": "Lance Yonkos", "course": "ENST233", "review": "Dr. Yonkos is an amazing professor. He clearly explains the concepts and uses his time wisely. He takes up the entire class time but he doesn't require a textbook. So he uses up all his time to cover everything so we don't need to take time outside of class to read a textbook. He adapted well to the online environment. He cares about his students and is willing to work with them. I liked the class a lot because I learned a lot and it wasn't stressful. I would take another one of his classes if I could. I recommend taking his class over another professor if there is one.", "rating": 5, "expected_grade": "A+", "created": "2021-01-22T22:31:46Z"}, {"professor": "Lance Yonkos", "course": "ENST233", "review": "Dr. Yonkos is a very knowledgeable professor who enjoys teaching this class, making it much more interesting. A lot of material in this class can seem pretty repetitive and boring, but Dr. Yonkos makes it all seem more interesting. Exams this semester were online and pretty easy if you either went to the lectures or at least looked over the slides he posted.", "rating": 5, "expected_grade": "A+", "created": "2023-01-04T03:28:02.204038Z"}, {"professor": "Lance Yonkos", "course": "ENST233", "review": "Absolutely one of the most enjoyable electives I've ever taken. I got an A by attending lectures and involving myself with the content. It was easy to develop a passion for what Professor Yonkos was lecturing about. He made things enjoyable with funny stories and related them to much of our daily lives. The tests were online and somewhat difficult as they sometimes asked about niche subjects from lectures. But I managed to get an A nonetheless.", "rating": 5, "expected_grade": "A", "created": "2023-12-10T02:26:23.817870Z"}], "name": "Lance Yonkos", "slug": "yonkos"}