{"courses": ["AREC620", "AREC240", "AREC241", "AREC386", "AREC399", "AREC699", "AREC799", "AREC898", "AREC899", "HNUH258A", "AREC620", "HNUH258A", "AREC386", "AREC399", "AREC699", "AREC799", "AREC898", "AREC899", "AREC386", "AREC399", "AREC699", "AREC799", "AREC898", "AREC899", "AREC280", "AREC620", "AREC241", "AREC620"], "average_rating": 2.3636, "type": "professor", "reviews": [{"professor": "Lars Olson", "course": "AREC241", "review": "Lars was great and very passionate about the course material, but the lectures were very dry and hard to watch. I enjoyed learning from him but he also grades very strictly on papers.", "rating": 4, "expected_grade": "B+", "created": "2020-12-04T02:20:11Z"}, {"professor": "Lars Olson", "course": "HNUH258A", "review": "Lars is clearly very passionate and helpful with assisting students, but good god is the coursework terrible. I was legitimately so close to dropping this class in the first week because of the amount of homework he assigned us. The pacing of the class leaves much to be desired, and it doesn't help that his lectures are incredibly dry and devoid of personality. I think Lars should take an oral communications class because he has the most monotonous voice I've ever heard. I can only imagine him overjoyed at the birth of his first grandchild, only for him to say \"Yeah, I think that looks good, keep it up\" in the most flat tone ever. This is in addition to the papers in the class which are graded harshly and somehow make up the bulk of your grade. If you have the option, DON'T take this professor.", "rating": 2, "expected_grade": "A-", "created": "2021-12-11T05:24:24Z"}, {"professor": "Lars Olson", "course": "HNUH258A", "review": "This is the worst course, and professor I have ever taken in my time at UMD. Starting with the course: I learned nothing about agriculture, and we were expected to teach ourselves R language entirely on our own using a website that was a knockoff of CodeAcademy. Lars Olson added ZERO value to the course, and is an ineffective and incompetent teacher. I have learned nothing from this course and I would encourage the honors college to discontinue this course in its entirety. It is a waste of everyone's time, and I have gained nothing from my time in this course. With regard to Lars, he is unmotivated, cold, uncaring, and could not possibly care less about his students if he tried. The entire fate of this course depends who is in your group, and on how badly he will tank you on an IMPOSSIBLE final research paper. I know that the course options for STEM students in the honors college is slim, and this course appears to be a good choice since it involves data, but PLEASE, I am begging you for your own good, DO NOT take this professor, or this course.", "rating": 1, "expected_grade": "A-", "created": "2021-12-23T23:30:03Z"}, {"professor": "Lars Olson", "course": "HNUH258A", "review": "The class was more work than I anticipated for a UH course, but it was doable, and Lars and Derek (the TA) do their best if you have issues with the assignments. That being said though, we had a research paper and research poster due within a day or so of one another for our final grade, so make sure you space out your work instead of leaving things for the last minute (like me) because things will get ROUGH otherwise. I also wouldn't recommend taking the class unless you have some background in coding and you have an interest in agriculture and such already. It's also worth noting this was the first time the course has been offered, so things may change for the better the next time the course is offered. ", "rating": 4, "expected_grade": "A", "created": "2021-12-29T17:49:15Z"}, {"professor": "Lars Olson", "course": "HNUH258A", "review": "This class is absolutely horrid, and I would tell myself a hundred times over last year to not sign up. I was expecting a tolerable Gen Ed with a respectable course load, decent lecturing and pacing, and with interesting concepts but it could not have been more of the opposite. Genuinely some of the most tedious, mind-numbing, pointless work I've done with subpar grades for each due to some ridiculous expectations. Thank the UH department for phasing out this course after this year, because this is NOT IT.\r\nStarting with the coursework, it starts off decently, with the idea that you will need to learn the language R. We then have our workload build up, because we are expected to read \"scientific literature\" through the \"Web of Science\" and are expected to utilize this research in our assignments. In detail. this class is learning an entire language for which there are \"exercises\" where we fill in blanks for some random website, come up with our own topics to research, find our own data for said topic, and come up with the code to clean through all the data and write up the research in a professional manner. For an honors gened, this is absolutely intolerable and inane for work and their expectations are absurd (even with a couple of hours I only got a C on a big assignment), and the fact is an assignment that's worth 30% of my grade is still not graded (it's been a month since submission) is a display of how unequivocal their standards are for us as opposed to themselves. This doesn't even discuss Lars, who I found to be one of the most monotone and mind-numbing lecturers who made going to class made me almost instantly fall asleep. His method of communication is through writing on an \"activity log\" that he only comments on after class and by walking around in class and asking us about what we're doing in our project, without being clear about what he expects. He mostly gives comments about what he thinks is right but hardly gives us direction in what to do or how he grades. This makes the entirety of the course feel both overwhelming and unrewarding, because we have no idea how we can do well on assignments besides putting in more work and hoping he's nice on grading.\r\nPersonally, the only thing I have left this class with is a lower GPA and disdain from courses that promise a STEM aspect of research. Overall, this class is an utter waste of time where the lectures provide little benefit, the material is uninteresting, the assignments take too long to do, aren't graded in a timely fashion, and have unclear rubrics so if you aren't careful then your grade falls in a swift swoop. My best piece of advice is to avoid this course if you care for your grades and mental health.", "rating": 1, "expected_grade": "B", "created": "2022-12-14T07:16:11.756398Z"}, {"professor": "Lars Olson", "course": "HNUH258A", "review": "The pacing on this course if awful. Lars is a really boring lecturer and he expects you to understand things after going through the arguable useless datacamp and his really poorly designed slides. It is impossible to learn R if you are following the schedule of the syllabus and there are huge, time consuming projects that he expects you to use R and do your own research on Web of Science. Major assignments are graded slowly. He even put the final group presentation on a Saturday. Overall, a huge waste of time with nothing gained. Grade is unknown since huge assignments worth 30% of my grade is still not graded after months.", "rating": 1, "expected_grade": "", "created": "2022-12-16T18:32:06.629473Z"}, {"professor": "Lars Olson", "course": "HNUH258A", "review": "Lars as a lecturer was incredibly monotone and unhelpful as a lecturer. The content for the course was also extremely odd as the majority of class time is spent doing r projects in class that do not help us with assignments and are near meaningless in the long run. The majority of the class are two assignments that you get no help on and are graded rather harshly which is unjust given the lack of support you receive for these individual assignments. I also expected a nice Gen Ed and the course load was definitely higher than I thought, especially with the two large assignments. I still do not know the majority of my grade as the majority of my grade even after it has been over a month since submission. Overall the in-class work was extremely uninteresting and provided little benefit for the most part, the grading was slow and odd, and you are provided with little help on the important assignments in the class. I will say that I was happy with the help and feedback I received while working on the final group project.", "rating": 2, "expected_grade": "A", "created": "2022-12-21T04:49:10.698784Z"}, {"professor": "Lars Olson", "course": "HNUH258A", "review": "The class was extremely boring; major assignments were thrown at us and we were expected to do them even though the things we were taught in class didn't really help at all. The only reason I'm giving three stars is that Lars was helpful to me during office hours when I went and that I somehow got an A in this class after all that struggle.", "rating": 3, "expected_grade": "A", "created": "2022-12-22T17:35:28.690872Z"}, {"professor": "Lars Olson", "course": "HNUH258A", "review": "I hate to say it, but Lars could not get more boring. The course material could have been decently interesting at least, but his presentation of it in an emotionless, droning manner made it absolutely undesirable. The course itself also definitely needs some serious rework to make the workload fair and to make the course content more continuous and fluid. You're expected to have an understanding of statistics only achievable through prior coursework, and you spend the majority of the first half of class learning the coding language, R, from scratch. By the way, R is a super counter-intuitive language, and learning it casually as only a precursor to this class is nearly impossible. On top of this, the way that you learn it is entirely through assignments on a website designed to help learn programming languages, but I feel as if I learned absolutely nothing from the website. After the dreadful, ineffective attempts at learning R, you spend the rest of the class working on three assignments that act as the majority of your grade, which are graded very harshly-- a fact sheet, an egregious research paper that I probably spent 20-30 hours on, and a group project. I was lucky to have a wonderful group, but it's completely random assignment, so good luck with that. \r\n\r\nTo my knowledge, this course is going to continue in the Carillon Communities LLP, so hopefully, those of you in that community will find this and know what you're getting into. The reason I give this two stars instead of one is that I personally enjoyed the content to an extent, but that's just because I'm a computer science/data science nerd and it was only meagerly enjoyable to me personally, and I can assure you that I was that one kid in the class who seemed like he put way too much effort into the class. So take it from me, and don't take this class unless you really enjoy computer science and data science, and have some understanding of statistics already, because otherwise you'll loathe this course and it will tank your GPA.", "rating": 2, "expected_grade": "A-", "created": "2023-01-30T16:31:41.731752Z"}, {"professor": "Lars Olson", "course": "AREC280", "review": "Just to let you Carillon people know, AREC280 used to be part of the UH LLP, and was listed as HNUH258A; if you're reading these reviews, AREC280 is identical to HNUH258A, so all the reviews are directly related to the class you will be taking. And just to make it brief, do NOT take this course if you can help it, it's awful and the teacher is awful.", "rating": 1, "expected_grade": "A-", "created": "2023-04-13T00:52:51.066116Z"}, {"professor": "Lars Olson", "course": "AREC280", "review": "He is a really good professor. Not only did I learn a lot of useful knowledge about the R language, but I also learned to be rigorous about scientific research.", "rating": 5, "expected_grade": "", "created": "2023-12-16T08:25:30.188622Z"}], "name": "Lars Olson", "slug": "olson_lars"}