{"courses": ["SPAN408O", "SPAN408J", "SPAN408D", "SPAN408A", "SPAN362", "SPAN798L", "SPAN361", "SPAN798A", "SPAN408X", "SPAN798E", "SPAN698O", "SPAN303", "SPAN408F", "SPAN408T", "SPAN798Q", "SPAN408K", "SPAN798T", "SPAN798X", "SPAN363", "SPAN408K", "SPAN798D", "SPAN362", "SPAN452", "SPAN363", "SPAN798U"], "average_rating": 3.6667, "type": "professor", "reviews": [{"professor": "Laura Demaria", "course": "SPAN408O", "review": "very tough course with some long, boring readings and some interesting ones. I was at the top of the class til I turned in an assignment a day late in the last month of the semester, which dropped me to a C. not very sympathetic... ", "rating": 4, "expected_grade": "A", "created": "2013-04-22T17:41:00Z"}, {"professor": "Laura Demaria", "course": "SPAN362", "review": "This professor is one of the most difficult and disrespectful teachers Ive ever had. I would literally spend hours working on the readings each night but I would come to class and get horrible grades on the pop quiz. Its not like I didnt study because I spent quite a bit of time making sure I understood what was going on. As far as hos unbelievably disrespectful she is, its absurd. She once told someone that theyre acting like a high schooler because they read the syllabus wrong and did the incorrect reading, and thats just the beginning of how rude she really is. There have been several other instances where shes called people out in front of the class for doing something incorrectly. Telling them they did the wrong thing isnt a big deal but the fact that she does it in front of the class makes her one of the most appallingly impolite teachers I have ever had.", "rating": 2, "expected_grade": "B-", "created": "2011-04-27T13:23:00Z"}, {"professor": "Laura Demaria", "course": "SPAN362", "review": "Laura Demaria is one of the best professors I've had at Maryland.  The course (like span361 and span363) required a lot of reading of both primary texts and supplemental secondary sources.  Demaria did a great job of extracting the most useful information from each text and covered a lot of information in a clear organized fashion.  The subjects covered in the course can get a little dry at times but Demaria manages to keep your attention.  She does not lecture with powerpoints and such, but mostly uses class discussion to highlight important points needed for the exam.  She does expect everyone to come prepared to every class and doesn't do well with people who slack.  Through my experience, she has given a pop quiz or 2 because students didn't read the assigned materials.", "rating": 5, "expected_grade": "A", "created": "2009-12-09T21:59:00Z"}], "name": "Laura Demaria", "slug": "demaria"}