{"courses": ["BSCI207", "BSCI106", "BSCI160", "BSCI161", "BSCI161C", "BSCI161S", "ENTM788C", "BSCI337", "BSCI160", "BSCI160", "BSCI160", "BSCI337", "BSCI207", "BSCI160", "BSCI366", "BSCI160", "BSCI337", "BSCI160", "BSCI366"], "average_rating": 3.1, "type": "professor", "reviews": [{"professor": "Leo Shapiro", "course": "BSCI207", "review": "You need to teach yourself in this class. Going to class seemed like a waste of my time, because Dr. Shapiro would go too fast for me to read (let alone write anything) from the slides. His slides contain all the information for the exams, and he focuses heavily on diagrams for exams. If you study the slides, you will do fine on the tests. There are four exams and a final, but he drops one of the exams. I can tell he cares about his students a lot and wants us to succeed, but I just wish his lectures were more interesting and he organized the topics a little better. ", "rating": 3, "expected_grade": "A-", "created": "2016-04-15T12:20:00Z"}, {"professor": "Leo Shapiro", "course": "BSCI207", "review": "He is not the best teacher, he doesn't know how to explain some of the most important topics in the course. He often confused his students even himself. He reads off the slides which I did not like. He often seemed unprepared. Sometimes he wouldn't even know what he meant by his slides. Terrible. ", "rating": 2, "expected_grade": "", "created": "2016-01-04T11:01:00Z"}, {"professor": "Leo Shapiro", "course": null, "review": "Dr. Shapiro is not a great professor for BSCI207. He went way too fast in lectures, so I had to teach myself most of the information after the fact. I know that Dr. Shapiro covers something like twice as much material as the other BSCI207 professors. He was not very good at explaining concepts either; he tends to obfuscate just about everything. And, as much as I hate to say it, I question his understanding of some of the more difficult topics--he is an insect biologist after all, not a biophysicist.\n\r\nOn the upside, Dr. Shapiro cares about his students and tried his best to teach the course well. The tests are fair.  Also, I learned A LOT of biology as a result of this class. To summarize: if you want to learn a lot of stuff but teach yourself, take him. Otherwise, look elsewhere.", "rating": 2, "expected_grade": "", "created": "2015-05-24T20:44:00Z"}, {"professor": "Leo Shapiro", "course": "BSCI363", "review": "I was aware that he was a stand-in for the normal professor who was out this semester, but he did a reasonably good job. He is very interested in current events and genuinely interested in conservation. Some lectures seemed to drag on as he read from slides and the TA was strict on grading.", "rating": 4, "expected_grade": "B+", "created": "2009-05-20T22:19:00Z"}, {"professor": "Leo Shapiro", "course": "BSCI363", "review": "I took both the lecture and lab sections of the class.  The lecture section was interesting, but he went through really fast and relies on you going back through the lecture notes for everything.  He included guest lecturers and grad student presentations in throughout the semester which made for a good change of pace.  At the beginning of each lecture, he presents current events in conservation.  Make sure you go back and read these after class because they will be on the exams!!!\r\nThe lab portion of the class was fun and engaging.  Each class was either with a guest speaker or a field trip.  ", "rating": 4, "expected_grade": "", "created": "2009-05-13T10:52:00Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Such a great professor! You can really tell how passionate he is about the material and is eager to talk during his office hours. The work load was very manageable too. Don't hesitate to take him.", "rating": 5, "expected_grade": "A", "created": "2020-12-09T03:01:23Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Amazing lecturer. Makes this class very interesting even if you're not a Bio major. ", "rating": 5, "expected_grade": "A+", "created": "2021-01-07T04:05:37Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "I really enjoyed Dr. Shapiro. He had hands-down the most well organized class during my first semester in COVID online classes. He tells you every upcoming due date at the beginning of every lecture and lets students watch lectures at their own pace. The exams were exactly what was taught. As long as you listen to the lectures and complete the assigned LaunchPad activity you will be fine. You do not need to infer anything or do supplemental learning outside of what he assigns. I really appreciated having him as a prof for BSCI160 when most of my other classes were so mixed up and unorganized. ", "rating": 5, "expected_grade": "A", "created": "2021-01-26T17:26:47Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Very, very boring. If you do not have a passion for ecology or evolution, I do not recommend taking this class. It was extremely hard to stay awake in this class, let alone take notes that are useful for the exams. Dr Shapiro is knowledgeable and passionate about the topics covered in the class, but he is not very personable and his lectures are often confusing. ", "rating": 1, "expected_grade": "C-", "created": "2021-04-16T04:29:12Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Dr. Shapiro is a very intelligent professor who really has a passion for teaching. He does give plenty of notice when things are due. HOWEVER, lectures are basic lecture styles off slides and are very boring. The worst part is the homework/launchpad/quizzes which is also a ridiculous amount of work for the level of class this is. Would definitely not recommend taking this class. ", "rating": 1, "expected_grade": "", "created": "2021-09-16T21:06:48Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Leo reads nearly word for word off of the slide. Although slides are posted after class, you've lost the chance to take notes on what he is actually saying since you have to scribble down whatever the slide said to make your notes somewhat relevant. Exam Pts were taken off for the smallest of mistakes. I had to self-teach myself most of this class. HW (LearningCurves) are very tedious. I don't recommend Leo at all.", "rating": 1, "expected_grade": "", "created": "2022-05-18T00:34:17Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "I love this professor and I loved his class. I would 100% recommend him to everyone for BSCI 160. He is very straightforward with his assignments and due dates. He is extremely enthusiastic and intelligent in his lectures although some of them might be long winded. Some people say his lectures are boring, but I disagree I think it is what you make it. I would advise sitting closer to him in the lecture as its easier to stay engaged, and don’t hesitate to participate as it makes it more interesting! He is easily one of my favorite professors of all time.", "rating": 5, "expected_grade": "A", "created": "2022-12-08T16:57:02.517582Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Even though I'm expecting a B in this class, I absolutely LOVED it. He is extremely passionate about the subject. I have to admit, it's pretty boring at times. However, the TA's do great with exam prep and if you do bad on the tests it's honestly your fault at that point. Literally the only studying I do is going to the zoom calls and making a few flashcards on quizlet. Also matches up pretty well with ENSP101 (not related but I think will help some people)", "rating": 5, "expected_grade": "B", "created": "2022-12-11T18:38:29.204517Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Dr. Shapiro is a very intelligent and passionate professor, and he clearly loves the content he teaches.  However, the slides are often disorganized, his lectures drag, and he often rambles in circles which confuses the class and often himself as well.  The \"textbook\" work is essentially a 40 minute quiz on material we do not need to know for the exam, which doesn't help in learning the material.  He tries to post the lecture slides before class so that he can go very quickly, but oftentimes he forgets and you can't follow along.  The slides are difficult to follow without a lecture alongside them, so going back to get the notes is also difficult.  However, the class itself was pretty easy and his exams were fair.  It's a bit of a nuisance class if you have harder courses like chemistry or calculus, so if you can find a better teacher without ruining your schedule, I'd do it.", "rating": 2, "expected_grade": "A-", "created": "2022-12-16T23:00:14.283992Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Great professor. He makes the class super straight forward.", "rating": 5, "expected_grade": "A", "created": "2022-12-21T00:37:52.357873Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "I thought that overall, he did a good job. He reads off of slides and goes over them pretty fast. Taking pictures as he goes over them is helpful. He also posts the slides after class, so you can review any topics you do not understand later. Also, the TAs are knowledgeable and can help with understanding tricky homework questions and topics. The midterms were not bad, and the final exam included questions similar to previous midterms. He does tend to get passionate about topics he cares about, which can lead to him rambling for quite some time. The Achieve quizzes were easy as well.", "rating": 4, "expected_grade": "", "created": "2022-12-22T17:48:08.489771Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Pretty chill class overall. Lectures are posted on classroom, very straightforward exams. \r\n\r\nHomeworks are a bit of a drag, especially if it stacks up with other classes. For Adaptive quizzes, keep in mind that the content on this is minimally helpful in helping you for the exams.", "rating": 4, "expected_grade": "A-", "created": "2022-12-24T00:24:50.303963Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Dr. Shapiro is extremely passionate. His exams are based on his lecture slides. He also bases questions on figures/graphs on his slides. He only explains those graphs during lecture (he doesn’t record) so if you missed lecture, then you may not understand what the graphs/figures mean. There are weekly quizzes and homework worksheets. Homework is graded extremely hard..very difficult to get 100% since they grade for accuracy. Best resources for this class were GSS and TA review sessions. Overall, this class was quite time consuming and a lot of memorization. I enjoyed the content in this class the most out of my other classes.", "rating": 4, "expected_grade": "A-", "created": "2022-12-24T02:04:28.551505Z"}, {"professor": "Leo Shapiro", "course": null, "review": "I literally found him so boring. He was so monotonous. His hws are atrocious because the TA takes off points for every single minor thing and the first test average was a D (so he had to curve up 10%. The other two exams got better and the final was also much better. All you have to use is the slides. they are MCQ fill-in and free responses. Use the review videos because the questions are sometimes reused. The organismal diversity project is chill I got an A. Oh also he gets rid of the lowest midterm or downweights the final and lowest midterm to help the grade since there are no curves applied to the final grade. Im just glad I got an A- because as a neuroscience major there was no point taking this stupid class on ecology and evolution.", "rating": 1, "expected_grade": "", "created": "2023-01-01T02:43:12.537414Z"}, {"professor": "Leo Shapiro", "course": "BSCI207", "review": "Great professor! He really cares about all of his students and listens to any concerns we have about exams, homework, due dates, etc. The class is definitely hard, but the work and exams are fair. you should definitely go to lecture, he posts the slides on canvas, but he talks about them and adds a lot more info that isn’t on the power point. He adds in humor which keeps the class engaging and fun.", "rating": 5, "expected_grade": "B+", "created": "2023-04-11T19:13:31.626429Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "As a professor he was very excited to teach these topics and seemed to be genuinely interested in what he's teaching. He did this research project on a specific kind of bird and every time he mentioned it you could see his eye light up. When I emailed him at the beginning of the semester unsure if I wanted to continue to take the class as the first few weeks is an adjustment to the work load. He was very kind to me and told me that he thinks I should stick with it but ultimately it was up to me. He would show videos about some of the stuff he was lecturing about which made for a good break from just absorbing information and taking notes. The exams were fairly difficult and I got either a low B or a high C on all 3 of them. There is help for the class that I suggest going to if you want to do better in the course than I did, but it is also manageable to do on your own. Some of the homework assignments are genuinely difficult and hard to comprehend what is being asked of you, the other homework assignments were on macmillan where you had to get a certain amount of points from answering questions and those definitely took a lot of time if you were not fully comprehending the topic. The professor is a great guy and enjoys his class, but the course is still decently difficult.", "rating": 4, "expected_grade": "B+", "created": "2023-05-04T13:50:21.315261Z"}, {"professor": "Leo Shapiro", "course": "BSCI207", "review": "his class was the most boring class i've ever had to take. he would always read straight from the slides in a monotonous tone. that being said, he's accommodating and flexible and his exams are very fair.", "rating": 2, "expected_grade": "A-", "created": "2023-05-09T15:22:49.542733Z"}, {"professor": "Leo Shapiro", "course": "BSCI207", "review": "Would not recommend him for bsci207. Pls take someone else if u can. He's pretty monotone. His exams and quizzes are unnecessarily hard. Hw are annoying because T.A take a lot of points off. The only good thing is he drops the lowest midterm or down weight the finals.", "rating": 2, "expected_grade": "B+", "created": "2023-05-18T04:29:26.620755Z"}, {"professor": "Leo Shapiro", "course": "BSCI207", "review": "Really good lecturer and overall an extremely nice person. Lecture slides are posted but I highly recommend attending lectures because anything he emphasizes almost always shows up on tests. If you really just pay attention to what he is saying you can get an A. Exams are extremely fair and similar to the practice questions he posts. The quizzes always have one hard question. I got a 4/5 on almost every quiz. Homeworks are easy and graded lightly. Overall he is extremely nice he was consistently extending quiz and homework deadlines to help people out.", "rating": 5, "expected_grade": "A", "created": "2023-05-22T02:41:55.376014Z"}, {"professor": "Leo Shapiro", "course": "BSCI207", "review": "Dr. Shapiro is super nice and fun! I don't see why other reviewers called him boring. He really cares about these topics (especially scaling, so be sure to study that). His lectures are super super dense, which can be tiring, but he makes jokes to help you get through them. \r\nHe is very open to criticism. One of my classmates informed him that he lectured too fast, and by the next class it was fixed. He assigned a super hard homework, which received complaints, and he apologized. It did not happen again. You definitely don't see this type of behavior often from professors. When a class average on an exam was too low (I don't know exactly what percent that was) he would scale it up a couple points. Also, an entire exam was dropped, and there were a couple points of extra credit given during the semester.\r\nThere are small multiple choice quizzes given on each topic, and 5 homework assignments. He extended the deadline on a lot of our quizzes, but I would not expect that to occur as often in the future.\r\nThe exams are a bit tough because the material is a bit tough. But, they're fair, especially given that one of the 3 exams was dropped. Overall, I would take a class with Dr. Shapiro again. I have not had many STEM professors that care about their students as much as he does.", "rating": 4, "expected_grade": "A-", "created": "2023-05-23T17:57:57.831450Z"}, {"professor": "Leo Shapiro", "course": "BSCI207", "review": "Do not take him for bsci207. Exams are way harder than other profs", "rating": 2, "expected_grade": "B", "created": "2023-05-28T20:52:45.104010Z"}, {"professor": "Leo Shapiro", "course": "BSCI337", "review": "Personally, this is the second class I have taken with him, and have regretted it. He is a great guy, but his teaching method is incompatible with my way of learning. BSCI337 was a super fun class and luckily with the homework/ lab assignments and him dropping the lowest exam, I was able to pass at least. When I took  BSCI160 in the past with him, I failed and had to retake it in the Summer session where I got an A with a different professor. He grades weirdly and expects you to memorize really specific stuff that he doesn't mention in the study guide. His lectures felt tedious and monotone so I could not really pay attention in lecture. The exams also stressed me out, no matter how much studying I did I could just not figure out this class. That being said, a lot of the people around me would get over 100 % on the exams due to extra credit, so really think about how you learn before taking a class with this professor. Strong memorization skills are key to this class.", "rating": 3, "expected_grade": "C-", "created": "2023-05-31T17:41:34.173130Z"}, {"professor": "Leo Shapiro", "course": null, "review": "Dr. Shapiro is very kind and understanding as a person and you can tell he is passionate about what he teaches, but he is not the best lecturer. The course structure felt super messy and disorganized. However, he is super open to criticism and tried his best to make things easier for us with due dates and hard homework assignments. The course consisted of readings, lectures twice a week, Canvas quizzes and homework each week, and the midterms/final. His lectures are not recorded and the slides that he posts are often incomplete because he reveals the answer during class but that text does not show in the published PDF. The exams were tough and it was hard to expect what content would be covered, but he either drops one exam or downweights the final which is nice. \r\n\r\nI would definitely recommend going to all the lectures, starting the homework early, and going in for office hours. You can tell he cares a lot about his students and will be more than happy to help with anything you need. I'd recommend taking Fletcher if you can, but if you bring up any problems you have with Shapiro he will be super accommodating and flexible.", "rating": 3, "expected_grade": "", "created": "2023-08-23T11:10:44.836075Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Dr. Shapiro is very genuine and passionate about biology, especially birds and kale. Some of his lecture points were irrelevant to the subject, but he tries to keep the class engaged and fun. It is important to actually look at the lecture slides or you may be lost. The homeworks are unnecessarily difficult and long, and TAs will take off points for every little detail. The exams were not easy, but reasonable if you pay attention to the lecture slides and complete the homework. He tries to keep the exam grade median at around 75, so if it is lower he will add a curve. There are 3 midterms and a final, but he either drops the lowest midterm or downweights a midterm and the final (whichever gives the highest grade). Overall, I would recommend him for the intro to bio course, but more difficult classes should consider other professors.", "rating": 4, "expected_grade": "B+", "created": "2023-11-30T02:09:59.029667Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Good professor, good dude. Easy class overall, and it's really easy to get above a 85. His tests are tricky though, as 40/100 of the points are mcq questions that are always tricky. Not bad, always an option if you need to take his class.", "rating": 4, "expected_grade": "A", "created": "2023-12-06T19:34:33.578688Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Dr. Shapiro is very passionate about this subject, but is kinda boring. Most of the class he would be standing up facing the board and doing his own thing, regardless if anyone listened to him. His exams and class is harder then the other professors and does not give out extra credit. He does drop your worst exam or down weight your final. Overall he seems like a nice guy making occasional funny jokes, but personally I'd skip his class all the time and still ended up fine.", "rating": 3, "expected_grade": "A-", "created": "2023-12-06T21:20:38.198269Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "He’s a nice person BUT his class is  super messy, and his exams are HARD! The amount of content you’ll need to know for his exams is crazy and the multiple choice section is specifically designed to trick you! I just didn’t enjoy his class at all! Out of all the other classes I’m taking this was supposed to be “the easiest one” and ended up being an absolute nightmare.", "rating": 1, "expected_grade": "", "created": "2023-12-11T15:59:38.812654Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Great personality. Passionate. Cares about students. The only negative is his lecture style. He is genuinely a boring person and talks very slow. The only way I could get through this class was \"recording\" his lectures and listening again some time later in 2x speed. His slides literally include no information-just some pictures and graphs without description. So you need to focus on what he says but since it is very difficult to stay focused during his lectures, recording helps. The worst part: his slides are not organized at all so you have to make connections between topics yourself. He wants you to focus on big ideas but that's why this class is challenging for most people. Without knowing the details, it's hard to understand the big picture. He did not explain the genetics unit well yet the questions on the midterms wanted us to know the details. So good luck with that unit especially. We only learned 1/4 of what the other class is learning and ran out of time at the end (the last few topics were rushed). But again, we can use cheat sheets for all 3 midterms & the final, and most questions on the final were taken from the past exams word for word. Lastly, his TAs were very helpful (although there weren't GSS sessions, they were welcoming during office hours and a lot of people showed up to do homework and ask questions). I recommend using TA office hours to your benefit and take the practice exam before each exam.", "rating": 2, "expected_grade": "A-", "created": "2023-12-17T04:53:50.768045Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Dr. Shapiro is clearly very passionate about what he teaches. He is very understanding with curves, dropping lowest midterm, extend HW deadlines for the whole class, and even allows an index card of notes during exams. That said, he isn't the best lecturer. The class structure feels disorganized, boring, and he can go on tangents that drag on and on. Also, the HWs are graded very harshly and by accuracy. With all this said, I would still recommend him. The content of the course isn't very hard, and you will do just fine if you put in the effort.", "rating": 4, "expected_grade": "A", "created": "2023-12-18T16:57:22.586717Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Please do not take this professor if you want an A unless you have a strong background in bio. Lectures literally are so disorganized. Little to no feedback on assignments. Even asking clarifying questions somehow makes things even more unclear. Could not emphasize how much I do not recommend.", "rating": 1, "expected_grade": "", "created": "2023-12-21T18:32:49.357820Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "This class can be boring at times but not at all too difficult. He drops the lowest midterm (which helps a LOT) and can be lenient when it comes to deadlines. Exams are hard but fair: everything that is on the exam can be found on a slideshow (that he posts)", "rating": 4, "expected_grade": "A", "created": "2024-01-12T13:33:14.233935Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Extremely difficult, it's confusing even with TAs helping sometimes. Otherwise, it's boring. Don't take.", "rating": 1, "expected_grade": "", "created": "2024-02-23T04:12:54.072437Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "His tests are extremely difficult and the material he covers is not fairly represented on the exam. He yaps too much", "rating": 1, "expected_grade": "A", "created": "2024-03-14T17:32:48.067754Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Dr. Shapiro is clearly knowledgeable and a good teacher. His exams aren't too bad and the practice exams are really helpful. The homework assignments are only a few questions, but I would sometimes have to go to office hours about them. If you're still allowed to work together, I highly recommend. The course is definitely easier if you took AP/IB biology in high school (it's literally the same thing) but still manageable if you didn't.", "rating": 4, "expected_grade": "A", "created": "2024-03-16T00:18:05.405225Z"}, {"professor": "Leo Shapiro", "course": "BSCI160", "review": "Dr. Shapiro is a passionate and a nice guy but he is not the best lecturer. He is very slow to get to the point, and his lessons are disorganized and boring. The exams are difficult---half of it consists of multiple choice questions that are designed to trick you. The other half are short answers and fill in the blanks which are thankfully much easier and straightforward. I expected this class to be an easy A but be warned, it is not. Ecology and evolution was one of my favorite subjects and this class has only discouraged me.", "rating": 2, "expected_grade": "B", "created": "2024-03-28T22:11:03.817608Z"}], "name": "Leo Shapiro", "slug": "shapiro_leo"}