{"courses": ["ENGL101", "ENGL206", "ARHU275", "ENGL275", "ENGL265", "LGBT265", "ENGL101S", "ARHU275", "ENGL275", "ENGL478B", "ENGL391", "ENGL452"], "average_rating": 4.6667, "type": "professor", "reviews": [{"professor": "Liam Daley", "course": "ENGL101", "review": "I took him over the summer, but he was a very good professor. His classes were asynchronous but he was very appreciative towards anyone who showed up. He provides lots of chances for extra credit and doesn’t give a lot of low grades unless you don’t do the assignment, although he doesn’t seem to give 100s on any major papers judging from the grade distributions. His lectures were kind of rambley but that’s most likely because it’s hard to teach to a computer. He did say that the textbook is required, although all textbook readings were optional so it’s not exactly a necessity. Overall he’s a good professor and the assignments were meaningful.", "rating": 5, "expected_grade": "A", "created": "2020-08-26T19:02:43Z"}, {"professor": "Liam Daley", "course": "ENGL265", "review": "Professor Daley is likely the best professor I have had so far. He makes an effort to connect with his students in class, he is extremely funny, and although he tends to go off on tangents, all of his class discussions are thoroughly meaningful and relevant to the topics in class. The quizzes are easy if you have done the assigned readings before class and there are lots of opportunities on them for extra credits. \r\nThe major assignments in this class include two papers and one presentation, both of which he gave us extreme flexibility with on content and still managed to be relevant and thought-provoking. \r\nOverall, the class is extremely fun and everyone in it seems to enjoy it greatly as class participation is very high and enthusiastic. ", "rating": 5, "expected_grade": "", "created": "2021-11-18T04:41:46Z"}, {"professor": "Liam Daley", "course": "ENGL265", "review": "He was a nice professor who provided engaging readings with broad topics; however, SUCH a harsh grader. He seemed to disapprove of the generic, repetitive academic writing style. This is clearly shown in his grading, which is fine but I wish he could have expressed that. Many professors often approve of this style but he is set in his ways. You just need to adjust to his expectations.", "rating": 3, "expected_grade": "", "created": "2022-05-31T17:43:30Z"}, {"professor": "Liam Daley", "course": "ENGL101", "review": "Great English professor. His classes are super engaging, they're usually just discussion that's enjoyable when you engage. The projects aren't bad, there are a lot of easy discussion posts, a couple extra credit opportunities, and some larger essays. The essays aren't bad, he guides you through the process and he's a generous grader. Take ENGL101 with him.", "rating": 5, "expected_grade": "A", "created": "2023-07-17T22:32:23.796362Z"}, {"professor": "Liam Daley", "course": "ENGL101", "review": "Honestly, this was the most chaotic class but I genuinely looked forward to going every week. Prof. Daley is super engaging and gives so many opportunities for extra credit - it's really not that hard to get an A. He's not the easiest grader but he actually puts time into grading papers and leaving so many helpful comments. 10/10 would recommend", "rating": 5, "expected_grade": "A", "created": "2023-11-08T14:48:46.014410Z"}, {"professor": "Liam Daley", "course": "ENGL101", "review": "Prof. Daley sure makes an interesting class! Doesn't tolerate phones and makes that very clear to his students. Overall, he is funny, a fair grader, and tends to veer a bit off track, which makes the class fun. Definitely a good semester!", "rating": 5, "expected_grade": "A", "created": "2023-12-19T22:30:18.928531Z"}], "name": "Liam Daley", "slug": "daley"}