{"courses": ["PLCY699W", "PLCY783", "PLCY692", "PLCY790", "PLCY201", "PLCY699X", "PLCY201", "PLCY783", "PLCY201", "PLCY201", "PLCY783", "PLCY401", "PLCY201", "PLCY783"], "average_rating": 3.7778, "type": "professor", "reviews": [{"professor": "Margaret Brindle", "course": "PLCY201", "review": "Great class, not so much work. Professor Brindle is very accomplished in her field, and I found her very easy to talk to during office hours. We never had a quiz or a test, just a few papers throughout the class. Very manageable. Since there's not so much graded work you want to contribute in class. Definitely would recommend for an easy but interesting GenEd", "rating": 5, "expected_grade": "A", "created": "2021-12-07T16:49:09Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Brindle is a good professor, however, her lectures can get quite boring if you do not participate. you don't have to attend every single lecture, as long as you look over the book and go over the slideshows that she posts. You should attend somewhat though, there is a 15 percent contribution category, I don't think they actually evaluate that though, I would still show up most of the time, but if you don't really feel like going you won't miss too much. Other than that the class is pretty simple, there is a slight curve at the end, if you do badly on any assignment, just ask her if you can make revisions to it, she is very accomodating. I got a 79 on the culture audit the first time, then I asked if I could redo it, emailed her why I should deserve a regrade, and emailed her my revised copy, and got an 89 on it. I would recommend taking this class. ", "rating": 4, "expected_grade": "A+", "created": "2021-12-20T18:06:49Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "The class had a light workload, which was nice. Dr. Brindle is very knowledgeable on leadership, so she can answer potential questions you may have. The readings were pretty easy as well. If you want a decent Gen Ed, take Dr. Brindle's PLCY201.", "rating": 4, "expected_grade": "A+", "created": "2021-12-31T05:58:37Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Dr. Brindle's PLCY 201 is a pretty interesting gen ed and relatively easy as long as you pay attention during class. The lectures can get kind of boring after a while but if you participate they are certainly manageable. She is an expert in leadership and is helpful with assignment instructions. Overall a good gen ed if you are interested in leadership.", "rating": 4, "expected_grade": "A-", "created": "2022-01-19T20:22:08Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "She is very degrading at times and not the nicest. The whole class is based on participation. There were 2 major writing assignments, a group paper and the final, which was easy. The other writing assignments were all 1 page. The GA posted weekly discussion boards. This helped students who did not want to participate verbally earn a good participation grade by the end of the semester. If you don't read over the slides or the readings, it's hard to participate. PLCY201 isn't hard, but she is difficult, so if you do what she asks and deals with her moodiness, you will be fine.", "rating": 3, "expected_grade": "B+", "created": "2022-12-07T19:21:36.921023Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "I absolutely love this woman, and if she taught more undergrad classes I would definitely take them!  The subject for PLCY201 itself isn't the most interesting, but it is an extremely easy class that you really don't have to put much work into it.  Hearing about all of the things Dr. Brindle has done in her life is by far the most entertaining part of class, and she is super easy to talk to if you need clarification on an assignment or topic.  I highly recommend this class to anyone who is looking for an easy gen ed or elective!", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T03:57:06.723599Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "I love Meg, but don't take this class to actually learn about leadership. DO take this class for a chill gened without too much work. You basically have to just show up to class and pay (some) attention. You won't miss out on much if you don't do the readings. The workload really isn't that bad, though not many things are actually graded. The best part, of course, is how much Meg likes to talk about her life. Believe it or not, this made the class so much more interesting than it could have been. She has had an *interesting* life, and I almost feel like I shouldn't spoil anything so you can take the class and learn about it for yourself. We even had a bingo game going where we would mark off squares based on which stories she mentioned :D", "rating": 4, "expected_grade": "A", "created": "2022-12-13T16:53:00.517505Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "I honestly took this class because it looked like an easy GenEd, but the class ended up being super interesting and became my favorite class. There's an easy workload, as long as you pay attention and get your work in on time, this class is an easy A. Lectures are boring at times but like other reviews say, she talks a lot about herself and her leadership and it's interesting sometimes! Dr. Brindle is super sweet, knows how to teach the class and has leadership experience and I'd definitely recommend taking PLCY201 with her, whether you want to knock a GenEd out of the way or are genuinely interested in leadership.", "rating": 5, "expected_grade": "A", "created": "2022-12-19T16:07:16.428087Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Not an easy Gen ed. Assignments aren't clear and the participation is very confusing. The TA writes down the names of people who answer questions in class so be aware of that because it can cost you points. You can learn some cool stuff about leadership, but if you want an easy gen ed find something else. This is not a walk in the park at all. The professor has occasional meltdowns so be ready too.", "rating": 1, "expected_grade": "B+", "created": "2023-01-11T00:39:26.426481Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "This was my favorite class last semester!  Dr. Brindle is very nice and is extremely over-qualified to be teaching this course.  The workload is super light, just a few papers, and you could do just fine if you didn't do the readings.  I usually skimmed what I was supposed to read that week at the beginning of class and that system never let me down.  There is a participation component to the grade, but she allowed those who didn't really want to speak during class to write a small discussion post on their thoughts of that weeks' content (people usually wrote a little over 100 words) and that was good enough to give me full points.  I highly recommend her as a professor, and taking this class!", "rating": 5, "expected_grade": "A+", "created": "2023-01-24T23:35:04.054818Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Imagine the most boring class known to mankind. This class does not teach me anything and brindle needs to learn to engage her students rather than passive aggressively singling them out because they don't pay attention. If you're not a Public Policy major do not take this class with her, there are other I-series classes that are so much more interesting than this (and can count for more than one gen ed). The other one star review also applies to this review", "rating": 1, "expected_grade": "B+", "created": "2023-04-13T19:59:03.805496Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Brindle has a lot of interesting experiences she shared in the class. It may be abit annoying for those who do not like to write (almost all writing and presentation assignments), but otherwise a nice chill gen-ed to take.", "rating": 5, "expected_grade": "A", "created": "2023-05-03T21:54:20.903724Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "This class is unbelievably boring and Professor Brindle is no better. This is one of the worst classes I have taken so far in college. I feel like I have learned absolutely nothing, and Professor Brindle made it almost unbearable. She is extremely passive aggressive and disorganized. She expects you to take notes in class but her lecture slides are completely disorganized, don't actually say anything important, and she moves too quickly to take notes anyway. What I find most ironic is that she is teaching a class about how to be a good leader, and yet she embodies none of the leadership traits she teaches us about. She is extremely braggy and definitely has favorite students and students she dislikes, and she makes it clear who falls in which category. She and her GA also refuse to submit grades on ELMS for some reason, so no one has any real idea of what their grade is in the class. SOMETIMES we get emails with feedbacks and scores on papers, but not always. While she may technically be qualified, this is not the type of person you want to learn about leadership from. I am excited for this class to be over. I feel like I am walking out having learned nothing, been extremely bored and drained mentally, and feel even less confident in my leadership abilities than when I walked in on the first day. She is only getting two stars instead of one because I feel like there is a little bit of room to be worse somehow, though I would not recommend taking this class with her.", "rating": 2, "expected_grade": "A", "created": "2023-05-13T02:56:12.137977Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Took this class with her. She is so boring and talks so quietly its hard to hear. I had an A in the course the whole semester and then she graded our final paper so harshly that it brought me to a B+. Also, her TA does literally everything for her.", "rating": 5, "expected_grade": "B+", "created": "2023-10-25T19:28:03.802394Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Professor Brindle is a very well respected instructor, and will make sure you know it by the end of the semester. Engaging with interesting stories but at times it seemed like the TA was doing more work than her. Still, she was a very nice woman who is very understanding and a majority of the work for this class was simply participating. Easy A.", "rating": 4, "expected_grade": "A", "created": "2023-12-01T17:33:56.906857Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Easy Gen ed 100% should take", "rating": 5, "expected_grade": "A-", "created": "2023-12-05T21:57:28.784718Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Professor Brindle is a very nice lady and the class demands a very low workload so, if you are looking for an easy Gen Ed, this is the class!\r\n\r\nHowever, don’t expect learning anything from this class other than public speaking when presenting. \r\nThe lectures are relatively boring and the only thing I can remember is Professor Brindle talking about her sons. \r\nThe expectations outside of class are very confusing and there are no assignments ever posted. Your guide is the syllabus that lists the chapters you are supposed to be reading each week. I did the math: The page numbers can eclipse 60 pages before the next class period. It’s simply not worth the time reading all of that since most of leadership is common sense. I just skimmed the case studies at the end which were half of the in-class discussion. \r\nOn top of no assignments being posted, half the grades you receive in the class aren’t reported in canvas and you just hope that your “participation” grade is good without any information unless you directly ask the GA. \r\nOn the topic of the GA: she did almost all the work and determined how we were graded. Professor Brindle doesn’t grade much. My main gripe with the grading structure was professor Brindle made it seem as if the discussion posts were extra points of participation for reserved individuals in the class. However, when midterm grades were due, my grade was lower than expected because the discussion posts were mandatory by the GA and she would drop your participation grade. Just make sure to do the discussion posts, read the case studies before class, and you should be golden for an A in participation (I started to figure this pattern out midway through the semester)", "rating": 3, "expected_grade": "A", "created": "2023-12-22T00:07:55.657560Z"}, {"professor": "Margaret Brindle", "course": "PLCY201", "review": "Easy Gen-ed course to take, but if you do not intend to major in public policy or are 100 percent interested in public policy then I would probably not take this course. Also the TA does most of the work. The culture audit that we did in class was a fun project. Easy gen-ed to take but also this course can be very dry/boring sometimes.", "rating": 3, "expected_grade": "A-", "created": "2024-01-19T15:58:23.665273Z"}], "name": "Margaret Brindle", "slug": "brindle"}