{"courses": ["ENGL101"], "average_rating": 3.0, "type": "professor", "reviews": [{"professor": "Mariko Carson", "course": "ENGL101", "review": "Dr. Carson is overall a nice professor, but can be frustrating at times. She is very kind to her students and tries her best to keep her class both engaging and relevant to our generation. Compared to other professors, Dr. Carson had 6 major assignments (as well as warm ups and minor assignments in between) and boy will it take up your time. Each week, it felt like there was always something to do and it felt really rushed. Other professors (from what I heard) only had to do half of what we did. The mini assignments and warm-ups are easy points but some of them were an overwhelming amount of work for a mere four points or less. Carson goes over some techniques of “effective writing” for assignments, but when it boils down to what she expects of you to do, the lines can be blurred and it is really up to your interpretation. I think the most frustrating part of Carson’s class was how late she puts in the grades. Even after the first semester is officially done, she still only has half of our grades in so it is hard to gauge how well we are doing in the class. Very frustrating. One of Carson’s strong suits, however, is her effective communication with the class. There were times where she allowed extensions and due dated became flexible (sometimes for the whole class, most times for individuals) but I would not rely on that too much. \r\n\r\nOverall, Carson is an ok professor. Definitely not the worst, but has room for improvement in her class and teaching skill", "rating": 3, "expected_grade": "", "created": "2021-12-22T14:14:18Z"}, {"professor": "Mariko Carson", "course": "ENGL101", "review": "Do not listen to the three star review on this professor. Dr. Carson is a great professor for ENGL101! She is very straightforward with course content and assignments and does not overcomplicate academic writing. As long as you put a reasonable amount of effort into this class you will get an A. The assignments take a fair amount of time to complete but are not impossible. The assignments also build on one another so after you complete the first few it really does not get much harder. She is also very understanding of students and flexible with deadlines as long as you put the effort into the class.", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T17:35:42.091855Z"}, {"professor": "Mariko Carson", "course": "ENGL101", "review": "This professor did not grade assignments on time ever. Directions were never fully clear for assignments and since previous assignments were never graded, you never knew what to change or fix for the next assignment. She also does not post lecture notes or slides and expects you to take a picture of her slides as she briefly speaks on it during class so if you miss a class you'll be lost. The class itself isn't difficult but choose another professor.", "rating": 1, "expected_grade": "A", "created": "2023-12-13T00:01:02.729007Z"}], "name": "Mariko Carson", "slug": "carson"}