{"courses": ["ENGL391H", "ENGL398L", "ARHU158B", "ENGL391", "ARHU158O", "ENGL393", "ENGL388V", "HHUM205", "ENGL391H", "ENGL398L", "ENGL391H", "ENGL398L", "ENGL391H", "ENGL398L", "ARHU158G", "ENGL391H", "ENGL398L", "ENGL391H", "ENGL398L", "ENGL391H", "ENGL398L", "HHUM205"], "average_rating": 4.9091, "type": "professor", "reviews": [{"professor": "Mark Forrester", "course": "ENGL391H", "review": "LOVE PROFESSOR FORRESTER! Do yourself a favor and take him! He is one of the best, most receptive, caring and professional teachers out there. \r\nHe's a very fair grader, really cares about his students and goes the extra mile. Do the rewrites and go to office hours if you're stuck. He is extremely approachable and helpful during office hours! HE'S THE MAN. ", "rating": 5, "expected_grade": "A", "created": "2015-05-27T00:46:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391H", "review": "These 5 star reviews are no joke. Take this class. It's probably the best version of junior English available.\n\r\nIt's a class for all majors, but I seriously found it useful, even as a science major. Forrester makes it super bearable, is one of the nicest teachers I've had at UMD, and has a sense of humor. Loved taking this class. The only regret I had is that all of the writing assignments coincided with my exam days (just my luck) - but one time he even pushed back a due date to Wednesday because several people in my bio class had an exam that Monday. SUCHHH a nice guy.\n\r\nHe's kind of picky/particular, but he gives a ton of helpful feedback. And as long as you fix exactly what he tells you to, he gives you an A on rewrites.\n\r\nYou have to put in work, but it really wasn't too bad. I never went to office hours or spent too long on papers (whoops) and still got B+'s and A's on my papers. A's on papers are hard to get, but A's in the class are handed out generously, so don't be discouraged if you get like a B on 3 papers or something - DO THE REWRITES THOUGH.\n\r\nAnyway, Mark is literally the man. Do yourself a favor and take him, you'll enjoy this class.", "rating": 5, "expected_grade": "A", "created": "2015-01-29T10:59:00Z"}, {"professor": "Mark Forrester", "course": "ENGL398L", "review": "Mark is an excellent professor and really cares about his students! You have to have some interest in the humanities (movies, literature, history, languages, etc.) to truly appreciate the class, but overall his grading is fair and he's committed to making sure your writing is the best it can be.\n\r\nYou'll learn how to write more concisely and how to sustain an argument through a long paper, as well as how to write a resume, cover letter, grad school app essay/personal statement, etc.", "rating": 5, "expected_grade": "A", "created": "2014-06-16T21:30:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391H", "review": "I LOVED Professional Writing with Mark.  I learned so much from this class, and I'm so glad I took it with him. \n\r\nThe class isn't easy, but you will learn so much if you actually put in the work and try to do well on the papers.  Take advantage of the rewrites, and DEFINITELY go to his office hours.  I think that's the main reason I got an A, is because I went to his office hours repeatedly for help, and to ask questions on how I could improve.  \n\r\nHe's a funny guy, and class discussion are engaging.  I would definitely recommend taking professional writing with him.  ", "rating": 5, "expected_grade": "A", "created": "2013-11-05T16:27:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391H", "review": "Great professor, especially for a mandatory course.  Take the H-version and knock it out; it's not a complete cake-walk, but it's not too hard.\n\r\nForrester is a great teacher who takes time to connect with his students, and is always available for extra help.  He is a tough grader, but gives re-writes where you can usually get an A just by changing exactly what he said was wrong on the original.  All in all, a great professor for a course that most of us would not take if we had a choice.", "rating": 5, "expected_grade": "A", "created": "2013-05-19T19:45:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391H", "review": "Forrester is great. Advanced Comp is a pain, but he made it bearable. He's a very kind man who genuinely wants his students to learn, and will help students in any way he can. I'm SO glad I took the honors version of this class-i can't imagine it was harder than the regular version, and since it's such a group-based course, having other honors kids was clutch. Forrester is picky about grammar, formatting, etc, but that's what the class is about and you learn a ton about professional writing. Absolutely would recommend this class!", "rating": 5, "expected_grade": "", "created": "2012-12-10T16:19:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391", "review": "Really swell guy,, i followed the reviews posted by these guys below and i dont regret it. He's a tough grader yes, but he is fair,,take him..always willing to help,, did i say he was a swell guy?", "rating": 5, "expected_grade": "A", "created": "2012-08-22T11:36:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391H", "review": "I would definitely recommend taking Junior English with Professor Forrester. He is, however, a tough grader, so I recommend editing/reviewing any of the papers before turning it in. Certain little things (like font serif/color) could cost you valuable brownie points.  \r\nThe resume/cover letter workshop is extremely helpful, and because it is in the beginning of the year, it will definitely help you as you search for jobs/internships during fall semester. \r\nThere are also a series of papers that feeds into a larger proposal. However, you can choose the topic as well as your partners, so make sure you choose something you're genuinely interested about!\r\nHe is a fair, subtly funny professor who you will come to like more as the year progresses!", "rating": 5, "expected_grade": "A-", "created": "2011-12-12T21:18:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391H", "review": "This was an excellent class, and not nearly as scary as it looks from the syllabus so don't drop after the first day! Professional writing classes are notoriously dull, but he did a good job keeping the class moving and I actually feel like I learned something. Assignments are not difficult, and the final paper comes together pretty easily because of the way he structured the course. Funny guy, too!", "rating": 5, "expected_grade": "A", "created": "2011-06-02T14:30:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391", "review": "I absolutely love Mark!  Not only he is an incredibly nice guy, he is also very funny in a subtle way.  He is invested in his students and in English, and he is always more than willing to help you perform to the best of your ability in his class. And he does learn your name quickly and is personable.  All-around great guy, great class...he tends not to give A's on assignments that often, but I like him so much that I can't hold that against him! Would highly recommend taking this class with him for your Junior English. ", "rating": 5, "expected_grade": "A", "created": "2010-05-08T19:15:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391", "review": "The class expectations are outlined extremely well in his syllabus. Just do the work and you'll get the grade you expect. He's somewhat of a tough grader when it comes to all the papers, but only because he wants you to actually try and not BS the work. Real nice guy, but talks forever. Easy class.", "rating": 4, "expected_grade": "B", "created": "2009-08-29T15:19:00Z"}, {"professor": "Mark Forrester", "course": "ENGL398L", "review": "Very nice and funny guy. Easy to talk to. Assignments not too difficult, he lets you pretty much pick whatever topic you want. Grading is pretty consistent. Good professor for JuniorEnglish.", "rating": 5, "expected_grade": "B", "created": "2008-12-17T01:45:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391", "review": "I really enjoyed this class. You have to do a career portfolio, which includes a cover letter, a resume, and a personal statement, which can come in really handy for graduate programs. The rest of the course is devoted to coming up and writing about with a proposal to a problem that you could help solve. \n\r\nHe expects good work, but doesn't set the bar so high that it's impossible. You can tell that he enjoys teaching English and that he knows what he's talking about. He's super nice, learns your name very fast, and is readily available if you need to get in touch with him. ", "rating": 4, "expected_grade": "A", "created": "2008-04-30T18:29:00Z"}, {"professor": "Mark Forrester", "course": "ENGL398L", "review": "I was expecting to hate my professional writing class, but it was one of the best classes I've taken. There are a couple of big assignments due throughout the semester leading up to the final paper. The paper can be about anything you want, and he grades fairly for all the assignments. He also allows rewrites for a couple of them, but as long as you put in some effort you shouldn't have to do the rewrites. The highest grade he gives is a 95% but for final grades, a 92% is an A. ", "rating": 5, "expected_grade": "A", "created": "2017-12-21T00:30:33Z"}, {"professor": "Mark Forrester", "course": "ENGL391", "review": "Best English professor ever. Assignments are reasonable and enough time is given to finish them. He doesn't grade harshly either and wants you to succeed. He realizes everyone is a junior/senior and that we're lazy so he actually makes class fun and not stressful. All assignments are connected and are about the same topic. They lead up to the final paper which combines all the work you already did throughout the semester. Most papers aren't more than two pages, last paper is around 10. He's not strict about page or word count either. Haven't gotten below a 95% on anything", "rating": 5, "expected_grade": "A+", "created": "2018-11-13T01:18:52Z"}, {"professor": "Mark Forrester", "course": "ENGL391H", "review": "Professor Forrester is a great instructor and a great person in general. He is clearly passionate about his job and wants students to learn.", "rating": 5, "expected_grade": "A-", "created": "2020-05-11T19:48:11Z"}, {"professor": "Mark Forrester", "course": "ENGL391H", "review": "Mark is a great English teacher. He has fair expectations, and encourages to students improve their writing while keeping their own style. I enjoyed how Mark creates a lot of discussions during lecture. The discussions keep everyone engaged, and help everyone stay focused.", "rating": 5, "expected_grade": "A-", "created": "2020-06-08T21:32:00Z"}, {"professor": "Mark Forrester", "course": "ENGL391H", "review": "The goat himself. Honestly such a nice, caring individual who took the time and effort to help us develop different styles of writing. Many of his lectures regarding different writing topics were also quite engaging and informative. We also did a variety of in-class activities including student led discussions, and overall the diversity of coursework made this class interesting over the entire semester.", "rating": 5, "expected_grade": "A", "created": "2022-12-24T16:25:21.765458Z"}, {"professor": "Mark Forrester", "course": "ENGL391H", "review": "Absolute legend. Really nice guy, super understanding and encouraging, and a light grader. He really does make an effort to help students improve their writing, and even though the class itself may not be the most interesting he definitely does his part. There is a good amount of work (not particularly hard, just frequent), but this seems to be one of the easier professional writing classes that are available. If you get a chance, Forrester is a great guy and the class is easy. Highly recommend!", "rating": 5, "expected_grade": "A", "created": "2022-12-27T02:55:26.602287Z"}, {"professor": "Mark Forrester", "course": "ENGL391", "review": "One of the best professors I've had at UMD so far. Incredibly helpful and understanding. He explains all assignments clearly and gives plenty of examples of what he's looking for. If I could I'd take another one of his classes just for fun.", "rating": 5, "expected_grade": "A-", "created": "2023-01-11T16:58:25.234220Z"}, {"professor": "Mark Forrester", "course": "ENGL391H", "review": "I love this man. Such a kind hearted professor who is very understanding, and he really does care about the students. He grades based off of labor, so if you try, you'll do well regardless of how \"objectively good\" your work is. Take him if you can, you won't regret it :-) The class itself is a lot of work and is more time consuming than I expected, but I can't complain. This is probably one of, if not the best ways to finish your professional writing requirement.", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T18:23:06.754484Z"}, {"professor": "Mark Forrester", "course": "ENGL391H", "review": "An absolute king. The course is a bit more work than you might expect, but it's easy to get an A if you just put in a bit of effort because grading is largely labor-based. His assignments are well-chosen to get you to practice actually important skills like writing a resume. He's also just personable and time in class is fairly engaging.", "rating": 5, "expected_grade": "A+", "created": "2024-01-04T02:36:41.282426Z"}], "name": "Mark Forrester", "slug": "forrester"}