{"courses": ["JOUR389B", "JOUR130", "JOUR130", "JOUR130", "JOUR130"], "average_rating": 3.7143, "type": "professor", "reviews": [{"professor": "Mark Gray", "course": "JOUR130", "review": "He did not receive our syllabus for around a month because he was experiencing issues with Canvas. After Canvas had been restored, assignment due dates were a mess. Lecture was interesting for a while, then it began to feel like he was repeating the same topics. That said, you can tell he's passionate about speech and all students received an A in the course (all students received the same grade on each assignment, with maybe a 2 point difference). It wasn't horrible to take, but it did stress me out as I wasn't sure when certain assignments were due or my grade. Also, he tends to take while to respond to student messages (whether through email or text).", "rating": 2, "expected_grade": "A", "created": "2022-01-07T12:56:48Z"}, {"professor": "Mark Gray", "course": "JOUR130", "review": "Every class was repetitive and boring. No one knew what was going on in the class. The only reason why I am not giving him a one-star review is that he gave good grades.", "rating": 2, "expected_grade": "A", "created": "2022-01-31T21:16:03Z"}, {"professor": "Mark Gray", "course": "JOUR130", "review": "Easy A, but a bit disorganized (no Canvas until 2 weeks in, unclear due dates)\r\n\r\nLectures got a bit repetitive so we created a bingo chart for what would be stated in class:\r\n\"Secure the bag\"\r\n\"I may not agree with Donald Trump politically, but he is a great influencer\"\r\n\"I got BEEF\"\r\n\"Climate Change is Real\"\r\n\"You guys need to chillll\"\r\n\"There *may* have been some lack of communication on my end\"\r\n\"SECURE THE BAG\"", "rating": 5, "expected_grade": "A", "created": "2022-12-19T21:27:10.127981Z"}, {"professor": "Mark Gray", "course": "JOUR130", "review": "Very helpful. Every class was the same. Probably cared less about the class than the students, didn't have an in-person class for over 5 weeks due to class cancellations or being switched to virtual lectures.  Every lecture was the same that we made a bingo chart for same exact quotes he would mention in class. I am pretty sure that all the assignment grades were randomly generated between a 95-98. Gave everyone good grades so it's all good.", "rating": 4, "expected_grade": "A", "created": "2022-12-19T21:27:27.253501Z"}, {"professor": "Mark Gray", "course": "JOUR130", "review": "He cancels class almost all the time and there is 6 assignments in the whole semester. The assignments are a 90-second videos due each week on a topic assigned. He will always give you an A no matter what you submit. While the class is easy and is a free A it is very disorganized and his canvas has messed up due dates and is confusing. He is also bad at responding to emails.", "rating": 3, "expected_grade": "A+", "created": "2023-11-29T21:01:44.740044Z"}, {"professor": "Mark Gray", "course": "JOUR130", "review": "Easy class, cancels lectures quite often. Very chill and easy going guy, canvas was disorganized but I didn't mind it was an easy A. The final grade was a video submission talking about our personal life and school.", "rating": 5, "expected_grade": "A+", "created": "2024-01-24T18:58:42.954724Z"}, {"professor": "Mark Gray", "course": "JOUR130", "review": "Prof. Gray is such an awesome guy.  This class is a free A and I think we met less than 10 times throughout the course of the semester.  The class/canvas is disorganized, but it doesn't matter because you'll only have like 5 assignments anyway.  He is super nice and an interesting person.  You can tell he is passionate about his work and life in general.", "rating": 5, "expected_grade": "A+", "created": "2024-02-06T04:18:02.548157Z"}], "name": "Mark Gray", "slug": "gray_mark"}