{"courses": ["HONR288X", "ENGL398V", "ENGL390", "ENGL390H", "ENST702", "ARHU230", "ENGL289C", "ENGL254", "ENGL390H", "ENGL390H", "ENGL390", "ENGL390H", "ENGL390H", "ENGL390H", "ENGL390H"], "average_rating": 4.2222, "type": "professor", "reviews": [{"professor": "Marybeth Shea", "course": "ENGL390", "review": "One of my favorite professors! Took Professional Writing for Science Majors with her, and I couldn't be happier with my choice. She understood that this english class was not topping our list of priorities when we all were in junior or senior-level science classes. She was okay with us coming in a little late, asking for extensions on assignments, or even missing class now and then as long as we let her know beforehand with an email. She really took the time to help anyone and everyone that she could in office hours, during class, or by scheduled appointment. \n\r\nDidn't require a textbook or any reading outside of class. The class webpage was not on ELMS, but on a casual blog that she updated before each class. Would recommend her to anyone. ", "rating": 5, "expected_grade": "A", "created": "2015-05-18T16:15:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390", "review": "Professor Shea is a great choice for students who (1) don't know too much about their major (i.e., never read about their field in their free time and don't volunteer or do research), (2) aren't good writers, and (3) don't care too much about improving their writing.  You won't get much more than an easy A out of this class, so if you value your time and money choose another professor.  But if your parents pay your tuition and you're just at UMd for the sake of getting a diploma, Shea might be a good choice because she expects so little of her students.\n\r\n1) Professor Shea has a habit of bringing up different students' academic interests, asking them questions, and then cutting them off.  Or she'll use one student's research as an example and misrepresent it.  This is incredibly annoying.  (Her knowledge of science is fairly broad but remarkably shallow.)  If you really have no idea what you want to do with your life -- if you're one of those \"I want to save animals\" or \"I want to make a living by doing something outdoors\" types -- you might benefit from the fact that she knows a bunch of people in the area and tries to help students out.  But if you know who you are and what you're talking about she'll drive you insane.  Oh, and if you do research or want to put your writing to use, watch out.  She once asked a student for permission to share his paper with her next-door neighbor, and 30 seconds later she said, \"Your paper is sitting on his desk.\"  She also makes you post some preliminary assignments online on her public website.\n\r\n2) She assumes that absolutely all of her students are horrible writers so she grades assignments based on how many times you use the word \"it\" and silly things like that.  She gives virtually no feedback -- she only corrects student work in the way that a proofreader would, which is especially bad since her own website is so full of typos.\n\r\n3) Professor Shea does not use a textbook.  She has a badly organized blog.  Her blog has lots of links to things you may or may not have heard of, that may or may not actually be interesting and/or funny.  She also yells loudly during class time, when we're supposed to be writing, about whatever scientific topic she's \"exited\" about.  (She gets really excited whenever she smells the opportunity to talk about her fancy scientist friends, or tell us how to think.)  Do not expect to learn.", "rating": 2, "expected_grade": "A", "created": "2012-09-10T19:30:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390", "review": "Professor Shea is great! She is VERY excited about science and makes the class a lot more fun than you'd think. This is not a hard class, as long as you do all the assignments and follow her guides. One criticism is that she sometimes wastes class time with unimportant material. Instead of going over the specifics of how to write an assignment, she'll spend the ENTIRE class period before it's due discussing argument theory. I sometimes felt that she didn't really explain certain assignments very well either. That being said, she's still very helpful and cares about improving your writing. Overall, she's a good junior English professor. I would definitely recommend her.", "rating": 4, "expected_grade": "A", "created": "2012-01-14T01:48:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390", "review": "She is very approachable and always willing to spend as much time as needed to help you improve your writing; she truly cares about her students. \n\r\nEven though sometimes she may not make good use of class time, the students will walk away with a handful of documents that give them practice with writing for the workplace.  \n\r\nI would recommend this class to anyone who wants a fun junior writing class with a laid-back teacher.  ", "rating": 5, "expected_grade": "A", "created": "2010-05-22T09:39:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL398V", "review": "I've never enjoyed an english class before 398V. An english class without any books, the \"text\" is an online blog.  Writing assignments are geared for the work place and will turn out to be good writing samples for interviews.  She is very reasonable with extenuating circumstances in terms of turning in assignments.  Her main goal is to have you improve as a writer, not to make you jump through hoops.  \n\r\nI highly recommend this class and anything that MB Shea teaches.  I can't imagine a better junior english class.", "rating": 5, "expected_grade": "A", "created": "2010-04-10T17:39:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL398V", "review": "I enjoy this class, and it is easy. The writing assignments are useful, and we have many opportunities to rewrite them until they are good enough to be used as writing samples for interviews. I would agree, though, that she is disorganized. \n\r\nWe get to do a good amount of our homework in class. You don't have to be interested in the environment to take this class, it is only loosely environmental. \n\r\nI would recommend this class to anyone.", "rating": 5, "expected_grade": "A", "created": "2010-03-31T11:30:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390", "review": "If you can write going into this course (or have the ability to use any computer program and the internet), prepare to be frustrated in Shea's class. She likes dumbed down vocabulary, and gets more excited about visual formatting than the actual content of one's writing.\n\r\nI also agree with whoever said she is not organized. Some assignments were announce only mere days before they were due, and these were sometimes involved papers. She also often misplaces assignments. I had to hunt her down a few times because she never knew what she did with rough drafts that she had promised to hand back in class.\n\r\nRelatively easy to do well in this course, once you forget everything you know about writing well and figure out how to write exactly what Shea wants. ", "rating": 2, "expected_grade": "A", "created": "2010-03-06T09:52:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390", "review": "She's a great teacher, and uses new media in her assignments. They're fairly easy yet informative. Great class for science majors looking for an easy junior level writing class. ", "rating": 5, "expected_grade": "A", "created": "2009-06-23T09:50:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390", "review": "Great teacher, keeps your attention and is genuinely interested  in your work. Not very organized with giving assignments, but she has a great laid back style.", "rating": 4, "expected_grade": "A", "created": "2009-05-20T22:16:00Z"}, {"professor": "Marybeth Shea", "course": null, "review": "She’s crazy, and I mean that in the best possible way.  If you want an interesting class, take one she teaches.", "rating": 4, "expected_grade": "A", "created": "2008-05-08T23:00:00Z"}, {"professor": "Marybeth Shea", "course": "ENGL390H", "review": "One of the best professors I've had at UMD. Easy on grading and as someone who normally hates english, I enjoyed this class.", "rating": 5, "expected_grade": "A", "created": "2019-06-11T17:56:32Z"}, {"professor": "Marybeth Shea", "course": "ENGL390H", "review": "Really helpful and engaging professor and just a really nice person overall. Her assignments actually do help improve your writing, and she tries hard to make her class useful but not a huge amount of work.", "rating": 5, "expected_grade": "A", "created": "2020-03-29T19:18:57Z"}, {"professor": "Marybeth Shea", "course": "ENGL390H", "review": "She was very nice and accommodating during the pandemic. It is not difficult to do well in her class as long as you put in an ounce of effort. I didn’t learn too much in this class. Depending on how you perceive it, it’s either an Easy A or a waste of money. I did learn a few techniques to improve my writing though, so that’s a win. Also, she was a bit disorganized. It seemed unnecessarily convoluted to jump back and forth between Google Docs, her blog, and the EliReview assignment submission website. I had to have so many tabs open on my computer for services that ELMS can provide!", "rating": 4, "expected_grade": "", "created": "2021-05-18T08:01:07Z"}, {"professor": "Marybeth Shea", "course": "ENGL390H", "review": "Most accommodating professor I had during the pandemic. Her class was probably a bit too easy, and was not very much work at all. However, if you don't really care about English then it is a great class. I did pick up a few techniques throughout the class, and thought the assignments and grading were fair.", "rating": 4, "expected_grade": "A", "created": "2021-05-29T18:25:02Z"}, {"professor": "Marybeth Shea", "course": "ENGL390H", "review": "Dr. Shea has been the most accommodating English professor I’ve had. The assignments are fairly easy and the due dates were mostly flexible. I just wish that the assignments were opened earlier as we often didn’t get assignment details until a day or two before it was due.", "rating": 4, "expected_grade": "A", "created": "2021-12-20T21:48:43Z"}, {"professor": "Marybeth Shea", "course": "ENGL390H", "review": "Awesome professor, all that needs to be said. Super accommodating and understanding, she gives all students ample time to turn in each assignment. You can tell she realizes that this class is on the back burner for most students and isn't the number one priority throughout the week and I really appreciate that. She is fun to talk to and class is pretty engaging. Highly recommend and she also grades pretty leniently.", "rating": 5, "expected_grade": "A", "created": "2022-12-25T18:58:37.055170Z"}, {"professor": "Marybeth Shea", "course": "ENGL390H", "review": "This is an… interesting class. As a vague summary, I took Marybeth virtually, with classes MWF. However, around 1/2 -1/3 of the way through the semester, she canceled all Friday classes for asynchronous work time. You have 3 “assignments” throughout the semester, although each is split into multiple peer review and draft phases. \r\nPros:\r\nYou can take the class from anywhere, whether driving or sitting outside of your next class. In fact, she actively encourages it.\r\nShe does not make you participate or even turn on your camera.\r\n*Very* easy A. Easiest class I’ve taken since high school, if not earlier. *Maybe* 4 hours max on this class including in class time. The assignments don’t even start until halfway through the semester. They are normally incredibly light assignments as well. For example, one was to write 4 topic sentences and 3 bullets under each one.\r\nMarybeth is incredibly lenient regarding deadlines.\r\nYou really don’t have to show up and/or pay attention, as she posts all information online, and does not care about absences up to a point.\r\nCons:\r\nThe online format means I have made exactly 0 connections with my peers or the teacher (not Marybeth’s fault, but still lonely).\r\nThis feels like the most ridiculous waste of time in my entire life. If you already know writing basics, you will probably learn nothing the entire time. For example, we spend pretty much our entire time going over basics such as that vs which, comma vs colon vs semicolon vs period, make the verb agree with the noun, etc. Other advice seems entirely useless, such as “only include three main points.” Like… huh???\r\nShe is incredibly flighty, and spends most of the time talking about anything but the class. This includes, but is not limited to Pokemon cards, Austin Powers, her various health issues, mooncakes, how she talks to her doctors about her health issues, how Zoom and Canvas are “stealing all our data”, and her research regarding her health issues (which at least is… vaguely related).\r\nShe often treats us like 5-year olds, calls us her “M&Ms” or “darling kittens” which she has to “herd”. \r\nShe basically does not use Elms, and instead uses her own website. This would be fine, if she organized it in any way that was remotely even equivalent to Elms. Everything from class (which is not only everything said in class, but lots of additional information she just never covers) is in one big webpage, with weeks in reverse chronological order, but within the week is normal chronological. One way or the other would be fine, but the mixing makes it confusing. She does often condense all of the info for assignments into a Google doc or something similar, but not always, and that still means you have to find it.\r\nHer phrasing is often confusing, and she’ll put things into instructions that she never said in class, or vice versa, or sometimes conflicting information, so it’s never very clear what she wants.\r\nRegarding the loose deadlines: this can be nice, but if you are someone who likes to stay on top of things, this means that peer review assignments keep getting published later and later. Initially, they were published roughly midday Saturday, but it has gotten to roughly Monday morning now (due Monday night).\r\nIn summary, take this if you want an easy class with an easy A. However, you will probably learn nothing and be incredibly frustrated with her the entire time.\r\nShe also does not really provide any feedback other than the grades, relying only on peers. This means that if you are doing something wrong, you might not find out until too late (given that she doesn't even provide any grades until after the final assignment submission).", "rating": 3, "expected_grade": "A+", "created": "2023-12-01T19:47:02.175013Z"}, {"professor": "Marybeth Shea", "course": "ENGL390H", "review": "To be honest, I do not think scientific writing is a priority class for a lot of students, and MBS made sure to acknowledge and accommodate for that. Her classes were online, asynch on some Fridays, and she's very quirky! The class is laid out to be pretty easy, and she's very accommodating for any issues you're dealing with. There's three assignments spanning the whole class, each one being broken up into sub assignments with both rough drafting, peer review, repeat. It feels a bit tedious at times, but it's honestly not all that bad. Her classes are intersting, she's quirky, and loves to engage with students. She's super sweet, and makes sure that everyone is able to succeed and pass the class with flying colors.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T06:25:26.201370Z"}], "name": "Marybeth Shea", "slug": "shea_marybeth"}