{"courses": ["ARTT100", "ARTT110", "ARTT210", "HONR239D", "ARTT341", "ARTT344", "ARTT343H", "ARTT340", "ARTT343", "ARTT418B", "ARTT448B", "ARTT448F", "ARTT341H", "ARTT340H", "ARTT448A", "ARTT448H", "ARTT418", "ARTT418H", "ARTT448E", "ARTT489N", "HONR209G", "ARHU158Y", "ARTT418B", "ARTT418H", "ARTT100", "ARTT110", "ARTT210", "ARTT418B", "ARTT418H", "ARTT110", "ARTT418B", "ARTT418H", "ARTT110", "ARTT210", "ARTT418", "ARTT110", "ARTT210", "ARTT110", "ARTT210", "ARTT110", "ARTT210", "ARTT418B", "ARTT418H", "ARTT110", "ARTT418B", "ARTT418H", "ARTT110", "ARTT210", "ARTT418B", "ARTT418H"], "average_rating": 3.1429, "type": "professor", "reviews": [{"professor": "Matthew McLaughlin", "course": "ARTT110", "review": "Matt McLaughlin is an experienced and respectable art professor. I took ARTT110 during the winter semester, and found that he worked well to encourage constructive criticism between students, not just dislike or praise on their own. \r\nIn an online environment, he went the extra mile to set up still life sculptures and pieces for us to view and recreate, as well as always be available during the day to ask questions and receive feedback on padlet. The feedback was always honest, and technical. He did not necessarily comment on our ideas to change them, but our execution to bring them to fruition. I think this is a very good balance for an art professor to strike, and it was reflected in the attitude of the students as well. We were encouraged to go further out with our ideas, sometimes maybe too far away from the intended form, but to fully realize them nonetheless. \r\nHe is also pleasant just to listen to, and hear about the people/places/pieces he draws his own inspiration from. ", "rating": 5, "expected_grade": "A", "created": "2021-01-19T19:12:51Z"}, {"professor": "Matthew McLaughlin", "course": "ARTT110", "review": "Professor McLaughlin is a decent prof because the assignments are very reasonable. He's nice about giving extensions on projects if you email him. \r\n\r\nI gave him 2 stars because I can tell from elms that he did not give a single person above a 94 on any assignment!!! And the cutoff for an A is a 94, so nobody got an A in the class! This is honestly just rude of him considering it's a gen ed introductory course for non majors. Because of this, I wouldn't recommend taking this class. It's a real bummer to work very hard in a gen ed and still receive consistently low scores. Art is supposed to be subjective.", "rating": 2, "expected_grade": "A-", "created": "2021-05-21T15:24:05Z"}, {"professor": "Matthew McLaughlin", "course": "ARTT110", "review": "Prof McLaughlin is a really chill person who knows what he's doing. Our class was a very calm environment, but he does grade a bit more harsh than you might expect for an intro art class. His grading isn't unfair though, and you still can get an A in the class if you put the effort in. He doesn't really give above 94s on the drawings, but with other smaller assignments you can def manage. I wish he gave us a bit more direct instruction - during class he will walk around and give pointers but not always. I really liked his class anyway, it was def a good type of challenging. ", "rating": 4, "expected_grade": "", "created": "2022-04-19T23:35:02Z"}, {"professor": "Matthew McLaughlin", "course": null, "review": "When I signed up for this course, by the description I thought it would be an introduction to drawing class, where we would learn how to draw, learn different techniques, etc. It is none of that. We had little to no explanations/demonstrations on how to do the assignments; instead, we were just expected how to draw, expected to know how to use the right techniques, etc. AND when the teacher graded assignments, he almost never give A's to students and would NEVER give 100% as according to him \"there is no perfect drawing\". In my opinion, this is completely ridiculous because 1: He is basically saying that you can have as much talent, you can work as hard as you can and you still will not get an A+; and 2: When I signed up for the course, I thought I would LEARN how to draw, not be expected to be a Picasso or a Monet.", "rating": 2, "expected_grade": "", "created": "2022-05-11T17:28:32Z"}, {"professor": "Matthew McLaughlin", "course": null, "review": "Rude and unprofessional!!", "rating": 1, "expected_grade": "", "created": "2022-05-19T22:55:48Z"}, {"professor": "Matthew McLaughlin", "course": "ARTT110", "review": "Professor McLaughlin was a pretty good professor, and when he did give feedback it helped a lot -- but I often had to ask for it, rather than it being freely given. So if I didn't see the issues in my work on my own, I just didn't find out there was anything wrong with it until I received my grade (and he wouldn't explain why I got points off in the comments on ELMS). He also has the mentality that \"nobody ever gets a perfect score because there's no such thing as perfect art,\" which was a bit infuriating given the lack of feedback. Overall, I liked the assignments and curriculum, but you'll have to try pretty hard to get an A in this class.", "rating": 3, "expected_grade": "A", "created": "2022-05-20T00:00:43Z"}, {"professor": "Matthew McLaughlin", "course": "ARTT210", "review": "Great professor! Very chill and friendly. Matt is always looking to give constructive feedback and will laugh at your jokes. Going to his class always made my day. You will get a good grade if you ask for help and take his advice. Would 100% recommend this class.", "rating": 5, "expected_grade": "A", "created": "2022-12-21T20:45:29.678372Z"}], "name": "Matthew McLaughlin", "slug": "mclaughlin_matthew"}