{"courses": ["JWST419W", "RELS289I", "JWST219Q", "JWST419O", "JWST491", "JWST262", "RELS400", "JWST492", "JWST409E", "JWST430", "JWST419V", "RELS499", "WMST498W", "RELS219Q", "RELS419O", "WMST498T", "ENGL262", "RELS600", "LGBT448W", "RELS430", "JWST418", "JWST658M", "RELS419V", "RELS619D", "WMST491", "HONR279K", "JWST409V", "JWST678D", "JWST619", "JWST699", "PSYC603", "PSYC660", "PSYC661", "JWST171", "RELS171", "RELS271", "JWST171", "RELS171", "RELS271", "JWST171", "RELS171", "JWST171", "RELS171"], "average_rating": 4.5, "type": "professor", "reviews": [{"professor": "Maxine Grossman", "course": "RELS289I", "review": "I feel that I gained a lot from taking this class with professor Grossman. The class is formatted well, and she is both highly knowledgeable and enthusiastic about what she teaches. I’m not religious, so I was worried that I would feel out of place, but that didn’t end up being an issue at all. The tests and workload were fair. It’s definitely a bit more time consuming and difficult than your average gen ed, though. As long as you are genuinely interested in learning something about religion (it’s not just fact memorisation, rejoice), I highly recommend this class and professor Grossman.", "rating": 5, "expected_grade": "A-", "created": "2017-12-16T17:23:30Z"}, {"professor": "Maxine Grossman", "course": "HONR279K", "review": "This was a super super fun course. You talk about magic, science, and religion in really interesting ways. In terms of coursework, there are readings every class (they can be a lil long, but they're super interesting), 5 response papers (worth 30% of your grade), 1 research paper, a final, and 2 presentations. If you stay on top of the readings and write well, you'll do fine in this class. It's super fun and Professor Grossman always made herself available. I changed my paper topic and did a bunch of random changes to my research paper, but she was willing to help every step of the way. Definitely recommend!", "rating": 5, "expected_grade": "", "created": "2018-12-15T18:36:35Z"}, {"professor": "Maxine Grossman", "course": "HONR279K", "review": "She's awesome! Such a fun and engaging professor who clearly cares so much about her students. The class is very interesting and completely discussion-based, which was something I liked, but if you're not comfortable talking in class, it wouldn't be for you. I cannot speak highly enough about Prof. Grossman.", "rating": 5, "expected_grade": "A", "created": "2019-11-07T16:09:15Z"}, {"professor": "Maxine Grossman", "course": "JWST171", "review": "I have very mixed feelings about Professor Grossman. I think she is nice and the class itself isn't hard. I am just personally not a big fan of her grading methods. The entire course is just weekly response assignments, a research paper, and a final paper. The response assignments are all 120 words where you pick one sentence from the readings and write about it. It's difficult because she wants you to go to deep detail and make connections to other readings but limits you to 120 words and gets mad when you go over. Nothing is ever really good enough for her regarding the response assignments. The research paper is a topic of your choice and it's paced through the semester which I like. The downside is she's very unclear about what she wants for the research paper. She emailed the whole class after we submitted our sample paragraphs saying that most of them were C- material and not once did she think \"hmm maybe I'm the problem instead of the entire class.\" In the end, it's not a hard course and it fulfills a lot of credits so I say take it but be prepared to be annoyed by a lot of things. Oh and the structure of the class was full attendance for the lecture on Tuesday and on Thursdays half the class meets for the first 40 minutes and the other half meets for the last 40 minutes for discussion.  ", "rating": 3, "expected_grade": "", "created": "2021-04-25T18:19:49Z"}, {"professor": "Maxine Grossman", "course": "RELS271", "review": "Honestly, RELS271 is probably one of the top classes I've taken ever. Prof Grossman, as other reviews have said, is very engaging, has high expectations, will give so much help when you ask for it, and provides genuinely interesting readings/assignments. You come out of 271 with a general but still nuanced understanding of religions, theories of religion, and how to communicate well about it.\r\n\r\nIf you're not interested in the subject though? Or perhaps interested, but not great at putting in effort into readings/asking for help/talking in class? This class may not quite be your vibe, nor may Prof Grossman. But if you're interested and willing to struggle with the material a bit, you'll get SO much out of this course. Would recommend!", "rating": 5, "expected_grade": "A", "created": "2022-08-24T00:19:35.830684Z"}, {"professor": "Maxine Grossman", "course": "RELS271", "review": "Professor Grossman is very kind and does her best with the difficult task of teaching a concept as diverse and unexplainable as religion. She is very clearly knowledgeable about the subject but oftentimes has trouble containing all of her expertise in an organized and brief lecture. Lectures can often run a minute or two overtime and more often than not you will not get through the entire slideshow. Grading in this class can sometimes be unclear or contradictory. For example, one of the main assignments for the class is a weekly reading check that has a stated sentence limit. However, when staying at this sentence limit I have received comments asking for another sentence or two. My grades on these assignments increased after disobeying the sentence limit set by the professor herself. Ultimately, despite some of these causes for frustration Prof. Grossman does have a true passion for her craft and a desire to help her students succeed. Also although her assignment grading can be very technical exam grading seemed very lenient in comparison.", "rating": 3, "expected_grade": "A", "created": "2023-05-02T18:39:11.046076Z"}, {"professor": "Maxine Grossman", "course": "JWST171", "review": "Overall a solid class with a focus on thinking over getting \"correct\" answers like is seen in stem classes. Dr. Grossman is generally very interested in what students have to say, and is passionate about what she teaches. She handles difficult topics well and is a fair grader. There were weekly assignments based on readings and in-class discussions, as well as three papers (including a final paper). If you have questions, she is accessible and makes time for her students. A fair bit of work for a GenEd, but worth it.", "rating": 5, "expected_grade": "A+", "created": "2023-12-26T15:26:35.548373Z"}, {"professor": "Maxine Grossman", "course": "JWST171", "review": "Super nice, friendly, and cares for the students. If you do the readings and pay attention to her lectures, you should do well in the class. Definitely one of the more interesting gen eds to take!", "rating": 5, "expected_grade": "A", "created": "2024-01-31T02:47:56.247187Z"}], "name": "Maxine Grossman", "slug": "grossman"}