{"courses": ["ASTR100", "ASTR220", "ASTR300", "ASTR315", "ASTR310", "ASTR288I", "ASTR498", "ASTR288I", "ASTR310", "ASTR315", "ASTR498", "ASTR498", "ASTR288I", "ASTR310", "ASTR315", "ASTR288I", "ASTR310"], "average_rating": 3.5278, "type": "professor", "reviews": [{"professor": "Melissa Hayes-Gehrke", "course": "ASTR220", "review": "This course was not too difficult in general, but will require a little bit of time each week spent on it.  This IS a science course - you're not going to be getting an A+ from just spending 20 minutes per week on it.  If you come to class (mandatory anyway), actually try, and be as interested as you can, you're going to feel like you got a lot out of it.\n\r\nDr. Hayes-Gehrke is very nice and a good speaker.  She's knowledgeable and keeps everyone involved during class.\n\r\n-----\n\r\nThe rest of this review is what to expect from ASTR220 with her teaching:\n\r\nThere's pre-lecture videos (anywhere from 20-45 minutes generally) followed by a quick multiple choice quiz.  TAKE NOTES WHILE WATCHING THE VIDEOS!!  You will be hating life later if you don't because you'll have no notes to study from for the exams.  I had groupmates that took zero notes and were complaining about having to watch the videos again to study for the exam.  These are your homework (alongside projects).  No textbook.\n\r\nThe pre-lecture videos prevent you from being lectured during class.  Instead, you're going to be doing rapid fire multiple choice questions, class discussions on the topics, and a calculation here and there with your groups.  She does this to prevent the typical \"lecture until you're bored\" style of class, and it works in my opinion.\n\r\nSpeaking of groupmates...you will have them for the entire semester.  You're going to be assigned them in the beginning of the semester - some you will be ok with, some you will dislike.  Learn to get along and distribute work instead of complaining, and your life will be a lot easier.  Use Google Docs to get your work done, add comments to papers, etc. to make your life so much easier.  Set deadlines, and start early!  If you follow those guidelines, you'll never receive less than an A on the projects.  And if anyone isn't pulling their weight, you get to grade your teammates based on work effort after the project is submitted.\n\r\nYou'll have multiple projects:  \r\n1)  a research paper about a specific asteroid\r\n2)  a poster (large powerpoint slide) project on a random astronomy topic/event, which you'll have printed and present to multiple people/groups\r\n3)  a paper where you design a spacecraft to accomplish a specific goal/mission\r\n4)  a debate (group vs group) about a random topic that you'll do in front of the class\r\nThese projects span across weeks, giving you tons of time to take your time on them and not make you feel overwhelmed.  I do feel that projects were graded a little harshly though.  They weren't unfair, but it just seemed that we lost a few points here or there for minor things, which was making it impossible to get the A instead of A- or B+.  \n\r\nThe grading also seemed to get MUCH harsher as the semester went on.  I felt that she was being overly picky on many aspects of grading projects and exams towards the end of the semester, especially given how busy you are juggling all of your classes.\n\r\nTwo midterms, which are average difficulty (35 multiple choice questions that are exactly like the in-class multiple choice questions she posts on the slides) and 6 or so short answer questions (sometimes involving a quick calculation or explanation).  Equations are provided, you'll just be expected to understand concepts like \"If this asteroid has properties A, B, and C, and I do \"this\" to it, what will happen?\"  You get re-tests though:  You take the exam, and then you get another week or so to take the exact exam at home with all of your resources, classmates, etc. and bring it back in.  Your score will be the average of the two scores, and any additional points that you got from your average compared to your original score will be added as bonus points to your final exam score (since there's no re-test for the final).  i.e. if you got a 90, then re-test you got a 100, your average score is 95.  So 5 points are added to your final exam score.  Final exam was all essay/short answer questions.  Felt easy after finishing, but the grade was A LOT lower than I expected, again due to extremely nit-picky grading.\n\r\nDiscussion section is fine.  We had to get an assignment done each time (pretty easy) and just go over with our groupmates what we're doing/any progress on projects and such.  It's what you would expect.\n\r\nExcluding studying for exams, you'll likely spend about 2-4 hours per week on this class (1-2 hours on pre-lecture stuff and another 1-2 hours on projects, depending on how hard you're working).  Overall, most people learned a ton from this course and want to take ASTR315 with her next semester (and are considering Astronomy minors).  ", "rating": 5, "expected_grade": "A", "created": "2014-12-18T19:09:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR310", "review": "If you focus on lectures alone, Hayes-Gehrke is a fantastic professor. She's clear,  patient with students, and open to student concerns and questions.\n\r\nWith that said, the workload for the number of credits that the course is worth is absolutely atrocious. In terms of what I'd consider to be assignments done out of class, there were \"Pre-Lecture Quizzes\" for nearly every lecture, \"Homework\" assignments for which there were 5, and \"Projects\" for which there were 3. \n\r\nThe \"Pre-Lecture Quizzes\" are exactly as they sound like and take about 30 minutes each to complete. \"HW\" assignments could very easily be called projects in any other classes as they were fairly difficult and took a significant amount of time (upwards of 4 hours each). The 3 \"Projects\" we were assigned were even worse in terms of difficulty and time required for completion, and the last of the projects could well be considered 2 projects with a single due date. Any one of these 4 assignments would constitute a \"Final Project\" in another class.\n\r\nAnother caveat of the class is group work. You have to make resumes to post online to your classmates, against your classmates so that you can hurry and make fairly permanent groups in 10 minute scramble. This group is probably going to be with you for the rest of the semester working on each project. This can be both a good and a bad thing, as it's encouraged that you work with classmates on the HW assignments. Having a group you're comfortable with can make the HW process easier, but you're also stuck with them for 4 months. \n\r\nI've definitely learned a significant amount in this course, but not nearly as much as the work requirement should indicate. I would take the course again, but only if I were warned ahead of time of how much of a time Hayes-Gehrke demands.", "rating": 4, "expected_grade": "B", "created": "2014-12-17T16:25:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "I've taken three courses with this professor. When I was a freshman in ASTR100, I hated her. I felt like she babied her students and was condescending.\n\r\nAfter taking two more classes with her (ASTR220 and ASTR300), she became my favorite teacher. She's written me multiple recommendations, and has been very helpful to me. She was always willing to listen to questions about grading, and after getting over myself I realized that her methods, while slightly babying, are amazingly helpful for learning the material.\n\r\nYou'll never find a professor more committed to helping every single student do well. If you are willing to actually do the homework (rarely more than half an hour) and do some group projects, you'll come out of it with a lot more knowledge and a professor who will write you great recommendations.\n\r\nI fully recommend all three of the courses I have taken with her.", "rating": 5, "expected_grade": "A+", "created": "2014-12-03T07:25:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Let me start by saying that I am NOT one to write reviews but after taking this course im sorry to say that professor gherke made me feel the need to warn people about her class.im not kidding when I say that this professor does not lecture. She forces you to watch pre-lecture videos of her talking before coming to class (most upwards of 25-30 minutes) which you then take a quiz on. This is horrible for learning as much as she thinks otherwise. I know she doesn’t believe in “traditional teaching styles” but her version of teaching is terrible (because she DOESN’T teach). Imagine teaching yourself and then coming to class and being quizzed everyday --- this is astr100 in a nutshell. Mind you, the grading in this course is insanely harsh.  I am a physics major taking this course for a minor and I was completely floored by the grades I was receiving in this class. She asks incredibly specific questions that ask you to apply what you know (often times trying to trick you) and will not hesitate to give you a 0/5 for a less than perfect answer. Her questions are sometimes so watered down and baby-ish that you will actually get them wrong just by second-guessing yourself. I loved astronomy before this but this professor has been incredibly frustrating. No matter how hard you study, she will never actually test you on anything but repetitive equations and hypothetical scenarios which you’ve never talked about. This class needs to SERIOUSLY be changed. Please save yourself the headache and do not take any course with this professor. Your gpa will thank you i absolutely promise.", "rating": 1, "expected_grade": "", "created": "2014-04-23T15:41:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "After a few semesters, I've realized that professor Hayes-Gehrke is the best professor I think I've had here at UMD. She really, really wants you to learn the material, and teaches it to you how she thinks is best. If you do all the work she assigns (which really isn't that time consuming), I guarantee you will get an A in this class. She teaches you the information that you need to know before lecture in a pre-lecture video and then teaches you the same material with examples in lecture. This really drills the information into your brain. It was because of her teaching style that I got an A+ in the class and over 100 on the final exam, and frankly, I wish more teachers would teach like Hayes-Gehrke does.", "rating": 5, "expected_grade": "A+", "created": "2014-03-12T20:59:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR220", "review": "Professor Hayes-Ghehrke is a pretty solid professor.  She taught the class very clearly, and almost always had an interesting picture or story related to the topic at the beginning of every class.\r\nShe does have her students do a little \"topic briefing\" and attendance slip that they have to pick up at the beginning of class and turn in on the way out, which means you have to attend most of her lectures unless you find a way to slip your attendance paper into the box at the beginning and leave.  Her classes are very interesting though, so I recommend just going to them.\n\r\nThe biggest downfall to this class is probably the group work.  There is a lot of it.  You usually end up doing a little group worksheet in most discussions, and there is a large \"poster project\" at the end of the semester that you must do in a group of around four.  As someone who despises group work, this aspect of the class sucked, but overall, it's a very fascinating class that you learn a lot of interesting things in, and Hayes-Gehrke herself is a very clear and easy to listen to professor.", "rating": 4, "expected_grade": "A", "created": "2013-12-10T22:34:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR220", "review": "I think Hayes-Gehrke is a really cool professor. Like others have said, she talks to you like your a kid and babys you through every single activity, but that only slightly takes away from her overall success as a lecturer. She really knows her stuff. \n\r\nThe work, however is a different story. Before every single lecture, she posts mandatory \"prelecture\" videos that are often more than 30mins long. This can be super annoying. However, I find that I can skip through the videos in 5-10mins and still get a 100 on the quizzes. \n\r\nShe is really a stickler on grading group projects. She takes points off in random places and I often found myself getting Bs when i thought i deserved at least an A-.\n\r\nThe one redeeming quality to the coursework is the exams. They are a complete joke. The way she works it is that you go to the exam and take it, and when youre done you pick up a second copy of the exam which you take home and complete with youre notes. You hand in the second copy and she averages the two grades together! You really have to be an idiot to get less than a B on the exams because what ever grade you get is averaged with a 100 (which I got on both midterm ReTests). \n\r\nOverall, the class can be kind of annoying sometimes, but I think the material is interesting and it really doesnt take that much effort to get a good grade. I would recommend taking it. ", "rating": 5, "expected_grade": "A", "created": "2012-11-29T15:42:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Makes what should be a very easy class, very difficult. The workload was fairly large for a 100-level class. Also, a lot of the work that you submit for this class will be graded very harshly. Take another teacher.", "rating": 2, "expected_grade": "B", "created": "2012-05-21T02:20:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR220", "review": "I'm not really positive how I feel about Hayes-Gehrke and this class. I went back and forth between really liking her as a professor and really disliking her as a professor. I think by the end of the class, I settled into liking her quite a bit.\n\r\nThe class had a ton of group work, which became insanely frustrating at times. She did make a pretty solid effort to match the teams well, and my team was decent. Still, the class definitely could have done without a project or two, since I often felt like I was doing more work in this class than in some of my 400-level computer science courses. The exams were very easy, but they were not worth very much.\n\r\nShe kind of taught like she was speaking to a bunch of five year-olds. At the beginning of the course I thought it was a huge relief, since I'm sick of being held to a stupidly high standard in so many of my courses. After a while it became kind of annoying, and then frustrating since there was a stark contrast between how she spoke and what she expected of us in some projects, like the research poster. By the end of the course I began to appreciate it again. I don't think she does it to be demeaning, I think she is just a very kind and caring person to the point of sometimes sounding like a kindergarten teacher.\n\r\nIn the end I did well and learned a ton. I was surprised at how much I could learn while feeling like I was in a kindergarten classroom. I went from completely space-ignorant to being able to hold a serious conversation about pretty much anything related to our space program, especially if it concerned a threat of impact. I also feel like this class was among one of the most practical I took at the university, even though I only really took it because it had a badass name and I needed a core science. I feel like I'm highly informed if I ever have the chance to vote about space issues or make a case to anybody else. Overall, a valuable course, just gets super annoying at times.", "rating": 4, "expected_grade": "A", "created": "2012-01-11T03:33:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "This class was lot of fun. She had completely new style of teaching. So many activities in the classroom (no problem if you are shy); even planetarium like displays. But there is lot of work to do. You have to watch a pre lecture video before every lecture and do a quiz on that. Then you also have to write a post lecture summary every time. They seemed hard in the beginning but then you get use to it. One can get a in this class, if you devote that time here. Also, I would like to mention I learned so many new things from this course. Its completely wonderful and the only class in the week which I look forward to. TAs are one the best (extremely helpful) and professor is very sweet. There are 3 midterms and a final. There is a \"retest\" paper in all three midterms where you boost your score by doing the same exam you did the classroom now at home. She usually gives 3-4 days for that, and encourages discussing with fellow students. All exams are half multiple choice and half essay types. Scoring policies are extremely fair. Recommended!", "rating": 4, "expected_grade": "A", "created": "2012-01-09T00:52:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR220", "review": "Professor Hayes-Gehrke is an interesting professor and definitely one-of-a-kind.\n\r\nBasically, here are the main points about her that really (in my opinion) define her teaching style:\n\r\n1) She is VERY patient with students' questions which leads me to believe that she has done a lot of research about teaching styles. Honestly, this can get pretty annoying if you have a head on your shoulders as there were a couple of people in my class who would literally ask her a question that she had just explained thoroughly and she would jump right in without a thought (and waste time).\n\r\n2) As implicitly stated above, she likes to baby her students. She takes attendance, has mandatory rough draft editing for papers and never, ever refrains from answering a terrible question.\n\r\n3) This might sound harsh, but she's a fairly poor quiz/exam writer. She has a tendency to say something in class and then put an oddly worded question on an online quiz that correlates to what she said but has a slightly different answer than what you'd expect based on her wording. Her exam questions are also pretty tricky.\n\r\n4) This is the most important point of all: She somehow manages to make the class very interesting from start to finish. I think it's her delivery style but I had little trouble in following her throughout the entire lecture (unless I was exhausted). She definitely made this course a fun experience for me.\n\r\nBased on all of the above I recommend taking ASTR220 with Dr. Hayes-Gehrke. She's got her quirks but the class is pretty interesting and the exams and quizzes are easy enough where getting an A in the class isn't too much trouble. Oh, one more thing, if you like group projects than take this class -- We had to do ~5 (and they were graded fairly easily).", "rating": 4, "expected_grade": "A-", "created": "2011-12-20T15:04:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "She's definitely excited about the material, I'll giver her that. The way this class is currently structured is also really nice. I took this class once before, and it has really been streamlined since then. The textbook has been scrapped, and has been replaced by online \"pre-lecture summaries\" and \"pre-lecture quizzes\". All you gotta do is watch the pre-lecture summary and then take the 8-point or so multiple choice quiz. Sounds easy enough, but it can get aggravating when the pre-lectures are easily as long as the in-class lectures themselves. Plus you gotta do the darn things three times a week. On top of that, each in-class lecture is followed by an online \"post-lecture summary\" that is related to the lecture material, but oftentimes requires you to think outside the box more.\n\r\nThe exams are also easy (I can't say much about the final, I haven't taken that yet). The attendance policy is forgiving and the lectures are by no means boring. You can tell Ms. Hayes - Gerhke is really trying to find the \"perfect formula\" for getting students to remember information. \n\r\nOne thing I wish she would stop doing is treating the class like little kids. She has a habit of stating something that is blatantly wrong, then asking \"do you agree? Or... is that not the case?\" or something to that effect. Then she waits for people to say WHY her statement is incorrect, and all the while people just sit there going \"durr... do we really have to spell it out for you? Again?\". It might just be another weapon in her arsenal of learning techniques (specifically, the weapon of mindless repetition), and if it is, I don't like it. The flash cards she uses are also kind of lame. The colors of the cards are generic and not at all what I'd expect from a college-level astronomy class.\n\n", "rating": 4, "expected_grade": "B-", "created": "2011-12-15T17:16:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "She is a great person, nice, and never judges students or makes them feel bad. But she does baby the students around, I felt like I was in middle school. I thought this class would be a breeze because of her teaching style but I was wrong. She screwed us all over with the midterms. Yes, there is a curve, and I thought I would be fine, but I ended up getting a B and so did everyone else. She is nice but she is an unfair grader and has a TA that is the most clueless and dumb TAI have ever seen in my life. ", "rating": 3, "expected_grade": "B", "created": "2011-08-20T14:33:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "She was an okay teacher. She dumbed it down which is good if you are not a science person. On the exams, particularly the exam 3, she totally screwed us over. She made all the essays tricky and worded them badly. Basically in discussion the entire class was talking about how terrible she worded the questions to purposefully mess us up. She's a nice person and lectures aren't too bad. \n\r\nIF you wanna take this class..just remember to STUDY YOUR BUTT off for midterm 3. For a core class it could be a lot worse. Overall, I personally I am not extremely fond of her but for science she's not too bad. Just expect a lot of work. ", "rating": 2, "expected_grade": "B", "created": "2011-05-04T23:54:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR220", "review": "She's an excellent teacher. She is very friendly and open to questions. She never patronizes a student for answering a \"stupid\" question as many professors here at Maryland do (based off personal experience). \n\r\nThis class is NOT easy though. It is not an easy A at all and does require a lot of work. There is a post-lecture quiz after every lecture, 2 tests, 1 final, 1 research paper, 1 project, 1 team debate, discussion and attendance. I suggest having taken Astr100 because you do jump right into Astronomy. I recommend the teacher, not the class if you're looking to satisfy an easy CORE class.", "rating": 4, "expected_grade": "B", "created": "2010-12-21T00:56:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Interesting class, easy A, lots of work. You might be turned off by her ridiculous demanding of extremely large amount of time for a simple 100 level class, but you get to learn a LOT. You'll be tempted to skip lectures, but she takes attendance. For both lectures and discussion. \n\r\nMy TA on the other hand was useless, condescending, and self-absorbed. She would make herself sound smart by saying terms that we don't even need to know for the exams. Things that she's learned in her \"upper\" level Astr class. I mean, really though? I didn't enjoy the discussion portion mainly because of her.\n\r\nOverall, this class made me decide to minor in Astronomy. If you think it's interesting, or just need a PS core, then I would definitely recommend you taking it with Dr. H", "rating": 3, "expected_grade": "A", "created": "2010-12-10T12:46:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "I am not a science person at all, but the professor made the course material pretty interesting with examples and demonstrations of concepts in class. Some of the material can be difficult, but if you do all the work and study at least a little, you'll do fine. \r\nExams can be graded pretty unfairly on the short answer sections, because sometimes it seems like A LOT more points are taken off than should be for whatever little mistake was made. BUT after every midterm, you can choose to do an easy \"mid-term analysis\", explaining why you got each wrong answer wrong (which you can discuss with your TA) and that will give you an automatic 10% added back onto your midterm.\r\nShe takes attendance every class with a slip you have to personally hand to a TA, and attendance is a good portion of your grade. There is also a pretty time consuming \"pre-lecture video\" (usually about 30 min) accompanied by a \"pre-lecture quiz\" before EVERY lecture, and a \"post-lecture summary\" after EVERY lecture. If you do the quizzes and go to lecture, you never have to read. It's not hard work, but this class does take A LOT of time. ", "rating": 3, "expected_grade": "A", "created": "2010-12-01T00:30:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR220", "review": "She is a fantastic professor. I am always amazing how enthusiastically she will answer people's stupid questions or questions that she had answered like 2 seconds before.  She is very nice and engaging. \n\r\nThe class is extremely easy but also really awesome. I mean it's a class on saving the Earth from an asteroid collision, what could be more interesting.  There is a online quiz after every lecture that you can do anytime and questions are right from the lecture which are on elms and you can use. I have not gotten lower than a 100 on one and they take maybe 5 minutes. No homework or in class quizzes. \n\r\nThere are three projects, a 4 page research paper and 8 minute presentation on an interesting topic. A mission to build a spacecraft to study an asteroid with a budget. And finally an in class debate. All these projects are done with a group that was picked for you at the beginning of the year. Have not really met with my group once except to watch Deep Impact, and still get good grades. \n\r\nThere are three exams, two midterms and a final. All very easy, with the ability to get ten points extra on the exam if you do corrections.\n\r\nOverall, one of the easiest and most satisfying classes I have taken at UMD. I would recommend it to everyone.", "rating": 5, "expected_grade": "A+", "created": "2010-11-23T13:14:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "The professor is very engaging and interesting. She makes astronomy seem fun, and makes you want to learn. However, she is an extremely unfair grader. You can write a textbook answer on a test, and she will take off 90% of the credit because you skipped one word that did not even pertain to the question. It is still relatively easy to do well in this class, because you get a lot of points for coming to class and completing the homework, but do not expect to do well on any of the tests", "rating": 2, "expected_grade": "B", "created": "2010-10-27T13:23:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR220", "review": "Unprofessional and unfair grader. Even though answers are written correctly and explained in appropriate fashion, she cuts the points. You would think, you have given complete answer, but wait til you get grades back. I'm sure, she loves to cherry pick on your answers. I went to her office to explain grading, but she already made up her mind. (DON'T BOTHER ARGUING, YOU ARE NOT GETTING WHAT YOU DESERVE). I have answer key of her homework, I wrote it from it, still cuts the points. UNPROFESSIONAL, BIAS, AND UNFAIR. She makes fun class, confusing and complicated. She does not deserve to teach.", "rating": 1, "expected_grade": "B", "created": "2010-09-14T21:24:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "I hate astronomy and do not find this class that difficult. Yeah you have to go to class and discussion but thats like 20% of your grade and can help you a lot. Also my TA was amazing so that helped. No matter how bad you do there is always a 10% increase. So if you get a 80% on a test or homework it becomes a 90%. The teacher is enthusiastic so that is nice, she actually loves the subject. And there is only 8 hw for the entire semester and one is dropped. I would recommend this for someones non lab.", "rating": 5, "expected_grade": "A", "created": "2010-04-27T11:56:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "This class is not that bad if you go to class and do the work.  Attendance is mandatory; everyday you have to write your name on a colored slip of paper that she makes.\n\r\nHomeworks are time-consuming, but not that difficult.  You don't have to read the book.\n\r\nThe class may seem hard at first, but it gets easier.  Your TA can make or break the class, but discussions are very helpful because you always do this multiple choice worksheet which exam questions often come from.\n\r\nThe class is very organized.  She teaches until the end of class.  The professor is always willing to answer questions.  She posts the lectures online.  The slides are very informative, not broad like other professors' slides may be.\n\r\nOne of the best professors I have had.", "rating": 5, "expected_grade": "A", "created": "2010-03-05T00:14:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "I did not like her. The material in class was as easy as you would expect from a 100 level course, but the complicated and downright childish way she does things makes it ridiculous. I haven't been told \"you cannot use a calculator and you must show all of your work in this specific format\" since High School. Get real, lady. Also, the tests are only worth 45% of the grade, the rest is a random mix of homeworks, quizzes, and lecture and discussion attendance. I did not like the fact that only 50% of the points on the tests were multiple choice. Those were easy. The rest were short answer Qs that were graded harshly. I got 3 out of 10 points taken off my answer to one question because I forgot to include the words \"low density.\" \n\r\nAlso, the 2 times I communicated with her, once via email and once in her office, she seemed very snippy and not that willing to help. I really would not recommend taking ASTR-100 with her if you are looking for something that is as easy as a 100 level class should be.", "rating": 2, "expected_grade": "", "created": "2009-12-23T15:08:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Really easy class with very generous curves on the exams and interesting material, but a ton of homework and mandatory attendence in lecture and discussion.  For me, the big downside was the textbook/CD.  It costs $120 and the bookstores won't buy it back once its been opened.  The book is only alright and the CD is required for access to online homework.  If you want either one cheap, e-mail me: alangwor@umd.edu", "rating": 3, "expected_grade": "A", "created": "2009-12-21T20:36:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR220", "review": "This class is hard for no reason. The homeworks are graded harshly and there are alot of them.  Only take if you love astronomy.", "rating": 3, "expected_grade": "", "created": "2009-05-23T21:44:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "This class is ridiculous. She is extremely nice and a good teacher, but if you are looking for an easy class DO NOT TAKE IT. She takes attendence at lecutre, and their is a ton of crazy busy work (online quizzes) which aren't hard but annoying. There are also 9 homeworks, which are pretty tough and graded hard. I wouldn't reccomend this class to anyone unless you are just really in love with astronomy.", "rating": 3, "expected_grade": "B", "created": "2009-05-14T20:39:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "She is an amazing teacher. She is especially good if you are bad at science, because she explains the material in a really clear way and makes it easy to understand. The course material is extremely interesting. The homeworks count for a big part of your final grade, and a lot of what is on the tests comes from the homeworks. There are 3 midterms and 11 homeworks. Overall, a really good class, especially if science isn't your thing.", "rating": 4, "expected_grade": "B", "created": "2008-12-28T02:09:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Very nice professor. exams are straightforward and are based on lectures and homework. lectures are online but she makes lecture mandatory. homework is time consuming. the online text book is a complete waste of money.", "rating": 4, "expected_grade": "A", "created": "2008-12-28T01:28:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "She's an okay teacher, its hard to get an A in that class-you have to really focus and work on it. She's good in trying to explain things and its very helpful to go her and her TA's office hours. The discussion and textbook is very unnecessary. Its important to study the homeworks and lecture notes", "rating": 3, "expected_grade": "", "created": "2008-12-07T16:44:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "This class was way too hard for a 100-level class.  I really don't think it was fair that we couldn't even use a hand help calculator on exams.  She was nice, but it was very very hard.", "rating": 1, "expected_grade": "", "created": "2008-11-13T19:08:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Awesome teacher! She lectures extremely well, and going to class and copying down her notes is very helpful. Her homeworks are a little time-consuming, but doing them will help you learn a lot about the material. She gives quizzes once in a while, but theyre extremely easy (rewards for coming to class).", "rating": 5, "expected_grade": "A", "created": "2008-05-17T18:57:00Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR310", "review": "ASTR310 is a class that takes in a lot of effort in terms of workload and textbook use, but Dr. Hayes-Gehrke is a fantastic professor who works harder than most professors to make sure everyone understands the material and is getting the work done.", "rating": 5, "expected_grade": "A", "created": "2019-12-20T01:36:34Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "This class is awful.  I took this class thinking it would be interesting and fun but it's not.  It's a flipped format class and Gehrke doesn't teach at all practically.  You have to watch lectures outside of class and lectures are pretty much a waste of your time.  The quizzes and other assignments are not hard if you are watching the pre lectures but the exam questions are much more difficult because she doesn't stress what is actually important in for the test. Awful class. ", "rating": 1, "expected_grade": "A-", "created": "2020-04-23T19:41:49Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "THIS IS A REVIEW FOR ONLINE INSTRUCTION:\r\n\r\nI enjoyed the asynchronous nature of the course but the way the professor decided to restructure the course was WAY overcomplicated. There were no grades, just \"badges\" that you get after completing assignments. It was nearly impossible to remember what amount of badges correspond to what grade. There's more about this but it's going to be irrelevant soon anyway. This is my only reason for 4/5 stars. \r\n\r\nAs for the professor herself, she's an incredibly nice person who's clearly enthusiastic about space and teaching it to students. She's very generous when it comes to grading and seems to genuinely strive for student success. ", "rating": 4, "expected_grade": "A+", "created": "2021-05-04T14:17:10Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR100", "review": "Dr. H-G is a really kind professor. She cares about her students well-being and tries her best to make an online environment as best as it could possibly be. There were three parts to this class: chapter quizzes, discussions, and lectures. The chapters were fine but you had to complete them on your own time. The discussions were easy. The lectures were fun. The structure of this course was really confusing.", "rating": 4, "expected_grade": "A", "created": "2021-06-02T01:30:46Z"}, {"professor": "Melissa Hayes-Gehrke", "course": "ASTR315", "review": "Probably the most fun I've had in a college class. Dr. H-G is a very nice professor and really seems like she enjoys teaching and cares about everyone's education. It is very easy to keep up to pace with the class and the exams are also very simple. She puts you into groups for the semester project (which is very cool to do) based on a survey she has everyone fill out at the beginning of the semester. I'm very happy with the group I got which made the class even more enjoyable for me. If you are thinking of taking this class with Dr. H-G, I definitely would recommend taking it!\r\n\r\nNote: The project does require staying up overnight during the 2 weeks observing period (some nights to even 7 am) just to keep in mind", "rating": 5, "expected_grade": "A", "created": "2023-05-19T03:40:00.150128Z"}], "name": "Melissa Hayes-Gehrke", "slug": "hayes-gehrke"}