{"courses": ["CHEM601", "CHEM601", "CHEM401", "CHEM601", "CHEM889C", "CHEM889D", "CHEM146"], "average_rating": 3.0, "type": "professor", "reviews": [{"professor": "Mercedes Taylor", "course": "CHEM401", "review": "She makes you buy physical clickers", "rating": 1, "expected_grade": "", "created": "2023-01-30T14:56:18.680874Z"}, {"professor": "Mercedes Taylor", "course": "CHEM401", "review": "Dr. Taylor is awesome!! She's probably the nicest, most relatable and approachable professor in the chem department. Her lecture are very easy to follow, and she does a good job of explaining some of the weirder and less straightforward concepts in inorganic chemistry. A lot of people would go to her office hours, and she'd be very helpful. She's willing to have thorough conversations about the things in the course that aren't very well-defined, or \"hand-wavey\" as she likes to say. \r\n\r\nThere were four homework assignments which could pretty easily be completed just by looking at your notes, although they were graded for accuracy so you gotta make sure to check through them. And while she did make us buy actual clickers, I think in the future she'll likely transition to the app now that she's more familiar with the technology. Her exams were tough but fair, and had a combination of true/false, multiple choice, and short answer. The questions were never as in-depth as what was on the homeworks, where you might've had to do a bunch of repetitive math for group theory stuff. She usually threw in one or two curveball short answers that were hard, but could be reasonably figured out. You have plenty of time too, the exams never felt rushed.\r\n\r\nI doubt that there's a professor that could teach inorganic better than Dr. Taylor, so definitely take her if you can.", "rating": 5, "expected_grade": "A-", "created": "2023-05-27T15:02:28.234712Z"}, {"professor": "Mercedes Taylor", "course": "CHEM401", "review": "The workload of this class is actually very reasonable. All of the homework is directly related to what was discussed in class. The exams are mostly very fair, although occasionally they can ask about very obscure topics that were only mentioned once or twice. Her pacing is not the best, as there is a lot of time spent either of her looking at her notes trying to figure out what to say next or her re-drawing character tables five times in a given lecture since she just didn't use the projector for the first half of the semester. She would also occasionally have to completely re-lecture a topic the class after it was originally taught, which gets a bit frustrating. The cutoffs for the class are going to be a lot less forgiving than you might expect. Overall, this class was okay. Dr. Taylor is okay and she is very kind, but there are definitely things in her teaching that she needs to iron out as she gets more experience teaching undergrads.", "rating": 3, "expected_grade": "A-", "created": "2023-07-10T16:51:32.068789Z"}], "name": "Mercedes Taylor", "slug": "taylor_mercedes"}