{"courses": ["MATH113", "MATH140", "MATH141", "MATH120", "MATH141H", "MATH240", "MATH246H", "MATH310", "STAT401", "STAT400", "STAT410", "SURV410", "MATH140", "STAT401", "STAT410", "SURV410", "STAT400", "MATH120", "MATH140", "STAT400", "STAT401", "STAT410", "SURV410", "MATH120", "STAT400", "STAT410", "SURV410", "STAT400", "STAT401", "STAT400", "STAT401", "STAT400", "STAT401", "STAT410", "SURV410", "DATA400", "DATA400", "DATA604", "MATH120", "STAT400", "STAT410", "SURV410", "DATA400", "MATH120", "STAT400", "STAT420"], "average_rating": 4.0818, "type": "professor", "reviews": [{"professor": "Mestiyage Gunatilleka", "course": "MATH240", "review": "Stopped going to lectures because he literally just writes off the textbook and explains it in a way that leaves you more confused most of the time. Seems like a great guy but he does not prepare you well at all. Basically you can take him and self study the class and go to discussions, you probably will still do well. Just don't expect to learn from lectures.", "rating": 1, "expected_grade": "B-", "created": "2019-12-02T01:51:28Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH240", "review": "Danul is a great person, but as a lecturer isn't very engaging. Most of the semester I have spent learning the course material on my own because I don't get too much out of his lectures. If you have questions for him he is always good with answering them.", "rating": 2, "expected_grade": "B+", "created": "2019-12-04T14:36:30Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH140", "review": "His lectures are pretty hard to follow but some are okay. You honestly can just use Kahn Academy to teach yourself better", "rating": 2, "expected_grade": "A-", "created": "2019-12-04T20:25:04Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH140", "review": "This dude has absolutely no personality, he may even be a robot. He knows what he's talking about and isn't the worst lecturer. His exams are extremely difficult and the homeworks are even harder. But if I didn't make it clear enough in the beginning, the man is a robot.", "rating": 2, "expected_grade": "D", "created": "2019-12-18T18:10:40Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH140", "review": "Not the worst professors at UMD. He gets a lot of flak because so many students have an ego thinking know everything about calc since they did it in high school. His lectures are heavy from the textbook, so read the section before class and the lecture becomes a review session to solidify the material. Come to class wanting to learn and visit office hours with questions, and you will get an A. ", "rating": 3, "expected_grade": "A", "created": "2019-12-27T16:14:12Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH240", "review": "Bad lecturer with poor explanation skills.  He only copies definitions from the textbook", "rating": 1, "expected_grade": "B+", "created": "2020-02-07T04:23:16Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH140", "review": "Absolutely terrible professor that should be avoided at all costs. Gives poor explanations and basically just reads the textbook in class and provides no examples. Exams are graded harshly and some exams contain trick questions that the Ta's cant even answer.\r\nBad move hombre.", "rating": 1, "expected_grade": "A-", "created": "2020-04-09T04:29:23Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH240", "review": "I took MATH240 with Danul in Fall 2019. His lectures are incredibly dry; he basically just reads off the textbook while writing the definition word-for-word extremely slowly. Having a good TA can really help you actually learn and master the material. \r\n\r\nI stopped going to lectures halfway through the semester and it didn't affect my grade at all. The textbook is very helpful, practice problems from the book regularly and you'll be set. The exams are almost exactly like the practice exams.", "rating": 2, "expected_grade": "A", "created": "2020-04-15T19:29:24Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH140", "review": "Not that bad, not that great. Helps to go to class/watch corona-era videos because he covers what'll be on exams. Get help from TA and you'll be fine", "rating": 3, "expected_grade": "", "created": "2020-05-16T04:11:02Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH310", "review": "This guy kinda just reads from the textbook, but if you come to him about specific questions he is quite helpful.", "rating": 3, "expected_grade": "B+", "created": "2020-11-09T15:45:47Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH140", "review": "has pre lecture videos which are very helpful as his lectures will be review of major concepts/ more in depth with examples, always open to questions, good/helpful TAs. textbook is extremely helpful when studying for exams and doing homework. people say he is not that great of a teacher, but i found no problem with him ", "rating": 4, "expected_grade": "A-", "created": "2020-12-10T06:11:07Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH140", "review": "use the textbook and you will do well. he is not as bad as everyone says he is.", "rating": 4, "expected_grade": "A-", "created": "2020-12-10T06:12:41Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH141H", "review": "I took this course in Fall 2019\r\n\r\nPros:\r\n+ Okay at explaining concepts.\r\n+ He teaches based on the textbook, so it's a good resource to learn from.\r\n+ Quizzes are open note and you can ask him for help, so they're not too bad.\r\n+ Tests are fair.\r\n\r\nCons:\r\n- Could be better at lecturing\r\n- Homeworks can often feel very and unnecessarily hard compared to assessments, which can be frustrating. They can take a long time to finish.", "rating": 4, "expected_grade": "A+", "created": "2020-12-22T01:30:12Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH310", "review": "He's not as bad as people make it seem. Maybe not the greatest choice for a lower level math class with a rigid curriculum, but if you take him for 310, he's fine. Also, his exams are more than fair and he curves the class.", "rating": 4, "expected_grade": "B+", "created": "2021-01-12T20:57:59Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Don't take any class with this man. Bad lecturer with poor explanations. Exams do not reflect textbook explanations as he says what so ever and his study guides are completely garbage. ", "rating": 1, "expected_grade": "P", "created": "2021-05-06T20:48:21Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH140", "review": "After the first week I stopped going to lecture. If not for my TA and Khan Academy I would not have made it through a class that isn't that hard. Find another teacher. He has terrible hand writing, hard to understand and not a fun person. Most people I know have said the same thing. Avoid Danul at all costs.", "rating": 1, "expected_grade": "A", "created": "2021-05-06T20:50:47Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "First off, he's an average lecturer in my opinion, though he makes an effort to clear up misconceptions and overall seems very approachable. With that said, I ended up missing the final and he was nice enough to let me take a make-up exam the next day, which he really had no obligation to do. As such, I'd say he's overall a decent professor but he does care to help you through course-related troubles you experience.", "rating": 4, "expected_grade": "A+", "created": "2021-05-17T17:43:41Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "One of the best instructors I've had in MATH/STAT at UMD. He was very nice and gave fair homeworks and exams. A lot of the homework he and the TA go over to help you on them, and they prepare you well for exam questions. He could be more clear in his study guides for exams but I think this is fine because the exams aren't that tough if you do the homeworks. Some of the harder concepts he explains in what seems at first a rather obtuse way, but once you get through it and do examples it gets easier to understand. HE also takes a lot of questions in the middle of lecture (sometimes too many dare I say). ", "rating": 4, "expected_grade": "A", "created": "2021-05-18T22:04:00Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "I had Danul for both MATH240 and STAT400. He does a much better job teaching STAT400 than MATH240. Overall I would say his lectures are average they can sometimes be confusing and he can skip over material. The books however for MATH240 and STAT400 are phenomenal also Danul does make an effort to clear up any misconceptions and help students if needed. The saving grace for this class is that the practice exams are usually extremely similar to the actual exam. My recommendation for both classes is read the book, do the homework/practice exams and you can easily pull at least a B.", "rating": 3, "expected_grade": "", "created": "2021-07-12T01:56:22Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH140", "review": "He is not a very good teacher, his teaching style is confusing, takes too long to get to the point, and has difficulty answering questions. He's a nice guy and is flexible with due dates, deadlines, and so on. But the only reason I'm doing well in this class is because I've taken Calc 1 in high school. I find the best strategy for keeping up with the pace is to watch his recorded lectures on mute on double speed, much better than attending lecture in person. Look elsewhere if you're taking 140 and you haven't taken Calc 1 in high school.", "rating": 2, "expected_grade": "A-", "created": "2021-11-22T17:17:50Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH140", "review": "He's not a great lecturer -- pretty ramble-y and doesn't do a great job explaining stuff. Probably wouldn't be doing that well if I hadn't already taken calculus in high school -- definitely would look for someone else if you're a first time calculus student. However, I have no complaints about him as a person. He offers extensions on homework if enough people ask and seems to be a pretty understanding guy. If you get him as a professor it's not the end of the world -- some of these reviews are way too negative in my opinion. ", "rating": 3, "expected_grade": "B+", "created": "2021-12-06T02:02:40Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH140", "review": "Will just read the textbook to you, but he is good with questions. The TAs, GSS, khan academy, and tutors are going to be far more helpful.", "rating": 2, "expected_grade": "B-", "created": "2022-05-03T22:12:15Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT410", "review": "I thought Danul was a fine professor. The lectures can tend to drag on a bit, but he does a good job with making sure people understand the material well. He is good about responding to emails, and he takes pauses in class to ask for questions. One thing I will say is that the homeworks are pretty tough, but the exams do not reflect the difficulty of the homeworks. Not a bad choice for STAt410. Just be prepared to spend about 3 hrs/week on this class. ", "rating": 3, "expected_grade": "B", "created": "2022-05-05T02:50:27Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "STAT400 with Danul is easy enough (hence my expectation of an A- and my two stars), however his teaching style is truly the opposite of helpful. His lectures are delivered at a glacial pace and end up going in circles on some occasions. The textbook questions assigned are barely representative of the questions that are on the exams. My only saving grace in this class was my TA absolutely carrying me and the fact that the exams have a reasonable difficulty level.\r\n\r\nTLDR: If you can help it, do not take STAT400 with Danul. However, if you must, be prepared for self-studying.", "rating": 2, "expected_grade": "A-", "created": "2022-05-09T17:46:02Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "I dont quite get why people trash on this professor. Danul is pretty good at teaching STAT400 and his tests are VERY VERY similar if not identical to his practice exams he gives you two weeks before the test. Textbook questions that are assigned are much harder than what he actually gives on the tests and are a free 40% of your grade. Would recommend this guy for any stat classes you take. He is the posterboy of achieving an A in a class. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-16T21:01:40Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "I personally thought that Danul was a decent professor. The homework assignments were a decent amount of work, and they weren't too challenging. The TAs go over the homework questions during discussion, so I recommend going to them if you're struggling with it. \r\n\r\nHis exam questions were a bit different from the examples done in class but his study guides are exactly the same as the actual exam (just with different values). So if you know how to solve the problems that are on the study guide, you will get a good grade on the exams (final as well). He might change that up next time but at least that's how it was for me in Spring 2022.", "rating": 4, "expected_grade": "A-", "created": "2022-05-17T06:12:04Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Danul is a decent professor for STAT400. His lectures can be a bit confusing but as long as you attend his office hours and discussions, you'll be fine. He explains the concepts well if you ask him for help outside class. His homework assignments can be a bit lengthy but it's important because it helps you understand the materials. Danul gives fair exams that are similar to the study guides. Overall, if you understand the homework problems and study guides, the exams shouldn't be hard. Danul is a good choice for STAT400.", "rating": 4, "expected_grade": "", "created": "2022-05-19T17:42:52Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT410", "review": "Genuinely, I would give Prof. Gunatilleka 4 stars but I want to raise his reviews a little bit. He is generous and nice, the sample exams are always helpful. Besides, the exams have average around 80~90, which is decent. The HW is tough but you can always get full scores. I would recommend you guys to take his class.\r\nDisadvantages: Not well-organized, you neither know where his examples are from nor which page he is talking about. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-25T01:52:05Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "One of the best professors in STAT. He's exams are very good (nothing difficult), but you need to study hard.", "rating": 5, "expected_grade": "A", "created": "2022-06-18T03:04:00Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH140", "review": "Professor Gunatilleka was a fairly good lecturer and communicator. His teaching is nothing groundbreaking, and you'll definitely need to focus during discussion sections in order to keep up, but you can definitely do worse in terms of low-level math profs. Plus, he was willing to push back deadlines if he didn't finish covering material in lecture.", "rating": 3, "expected_grade": "A-", "created": "2022-10-10T16:43:58.791163Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Math120 was only manageable because i took ap calc in high school. he talks a ton and make you write a lot. I had to learn most of the new materials myself because his lectures are not relevant. if you didn’t take ap calc or have prior knowledge you’d probably fail his class as he cannot teach", "rating": 2, "expected_grade": "A-", "created": "2022-11-03T18:32:29.828939Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Haven't yet completed this course, but I can tell you this is the best stat professor in UMD. I took him for stat400 and now stat401 and the format for the class is set up for everyone to get an easy A or A+ in the class. He makes concepts easy to understand and all the averages for his midterms have been 90+. Everyone who is trashing this professor is in the lower level maths and complain. Take this professor for all your stat courses and you will get a free A.", "rating": 5, "expected_grade": "A+", "created": "2022-11-27T23:28:02.754536Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Pretty good STAT professor in UMD. His homework is not too challenging, he is very lenient in grading, and he tries to make lectures enjoyable.", "rating": 5, "expected_grade": "A", "created": "2022-12-01T16:44:17.765954Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Dont seem to get why this professor is getting so much hate, probably because he is a stat professor and teaching calculus. He is a great stat professor, so I can 100% recommend him for taking your stats classes, not so much calculus I guess. His exams are fairly identical to the practice exams, homework is easy, and fairly understandable lecturer. Great!", "rating": 5, "expected_grade": "A", "created": "2022-12-01T16:48:22.846728Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Great professor. Content is easy to understand from each lecture, homework are 5-6 questions each week, and midterms are easy. Would recommend this professor for stat courses.", "rating": 5, "expected_grade": "A", "created": "2022-12-04T23:52:03.354935Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Great professor, his lectures were great and quizzes/exams were straightforward. If you put in the work, you will get the grade you want.", "rating": 5, "expected_grade": "A-", "created": "2022-12-05T19:41:42.837612Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Very accommodating professor. I got some points off on my quizzes and explained my logic further and he gave the points back. Very lenient and understanding professor who truly wants you to succeed. Quizzes are free points, homework is bearable, and practice tests are literally identical to the real exams, hence why most of our exam scores were average around 91+", "rating": 5, "expected_grade": "A", "created": "2022-12-05T21:21:51.369706Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "quizzes are easy, midterms are same as the review he puts out, homework is fine, but most boring lectures ever.", "rating": 4, "expected_grade": "", "created": "2022-12-12T00:47:59.744301Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "He's great at answering questions you may have, but in terms of lecture material, he's not so good. I had to learn almost everything from the textbook. On top of that, he writes a lot of things down, and does not go through a lot of examples of the problems that are related to the material covered in lecture. Also, with homework on MingPress, it can take a long time and sometimes there are glitches that mark your answer as wrong even though you got it correct.", "rating": 2, "expected_grade": "", "created": "2022-12-12T03:38:24.491507Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Very clear at explaining statistics concepts, quizzes and exams are pretty easy. Only downsides are that his lectures can be quite dry and coding projects are somewhat annoying to do.", "rating": 4, "expected_grade": "", "created": "2022-12-15T00:53:49.177496Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT410", "review": "He has an amazing grasp of the content and his lectures were great in my opinion. He is usually very good at answering questions as his understanding and teaching ability are up there with the best I have had here at UMD. Homework is meant to challenge you, but the grading is very generous if you give a good attempt. Exams are much easier and are more closely alike to the more simple examples gone over in class.\r\nLooking at the other reviews, definitely expect to spend some time on homework as you usually need a deep understanding to get to the solution, but he often helps. He gives extensions if you ask or enough people ask. Another review said he does not tell you where you are in the book, that may have been true in the past, but this semester he always told us where we were, and if you just ask what example it is he tells you. I assume he doesn't write it on the board every time because chances are most people wouldn't need to know it.\r\nAlso, I want to give credit to him for being mature about distractions in our class as it was often interrupted.", "rating": 5, "expected_grade": "A", "created": "2022-12-16T16:28:44.097213Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Truly a 4 star professor but his reviews are a bit crazy, so I want to raise his rating a bit higher. Like others have said, do the homework, review the practice exams, and you should be fine with this class. Coding projects are a bit annoying but they are not hard. Would recommend.", "rating": 5, "expected_grade": "A+", "created": "2022-12-16T16:31:28.556031Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Great professor, exams are identical to practice", "rating": 5, "expected_grade": "A+", "created": "2022-12-16T16:31:41.499482Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Lectures are a bit iffy but he will always be there to help in office hours. TA's were great", "rating": 5, "expected_grade": "A", "created": "2022-12-16T16:32:07.629182Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Exams were literally the same as the practice exams, I think he was just lazy and did not care. Lectures were okay, you can tell he has a passion for statistics but still were a bit boring. Homework is very easy. Would recommend.", "rating": 5, "expected_grade": "A", "created": "2022-12-16T16:32:48.754953Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Great professor, would recommend for anyone taking statistics, this is my third time taking a class with him and still getting an A", "rating": 5, "expected_grade": "A", "created": "2022-12-16T16:33:15.727642Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Finished all of his classes with A+, stat400, stat401, stat410, you may think I am a genius, but that is not the case, his class is designed for students to get an A. The homeworks are straight from the textbook which are easy, exams are LITERALLY the same as the practice, LITERALLY. He does not throw any curveballs in the class and genuinely loves teaching statistics. Sure he may not be a good calculus professor as previous reviews say, but all his statistics ratings are HIGH, he is truly the most fair and generous professor in the statistics department.", "rating": 5, "expected_grade": "A+", "created": "2022-12-19T21:26:02.032514Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Best professor for statistics, makes things so easy to understand", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T19:02:06.588280Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Weekly quizzes to boost your grade, homeworks are easy, practice exams are identical to the exams, don't know what more you need to get a free a+", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T19:02:34.510789Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Lectures were boring but TA's helped with it, made sure his students understood the material", "rating": 5, "expected_grade": "A", "created": "2022-12-22T19:03:02.179193Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT410", "review": "The tests were crazy the averages were 90+ and this class was very bearable with him, would recommend.", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T19:03:21.354978Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT410", "review": "I was honestly really scared to take STAT410 because of how hard I heard it was compared to STAT400, but Danul (his first name) truly made this an enjoyable experience. First of all, the man actually cares and tries his best while lecturing and you can clearly see that. He really does try to put an emphasis on teaching people to understand the broad underlying themes and concepts of statistics rather than being pedantic on the small technical details which I really appreciate. This is the first time I've taken a statistics course and not felt like it was just another chug and plug math course- I felt myself able to apply the concepts I learnt. The HWs are a little tough, but this is no problem because you can go to his OH and he will help you through it all (I was able to get 100% for most of the HWs this way). Some HW questions are graded only for completion which really helps. Quizzes are pretty simple just review each weeks notes and you'll be fine. The exams are extremely fair and are VERY similar to the practice exams he gives. \r\n\r\nTo top it off, he is very accommodating in general. Whenever the class had a major doubt about one of the HW questions he addressed the problem directly and just gave us an extension. He dropped the number of HWs near finals weeks cuz he knew we were already very busy. Overall, this class does take effort, but it is certainly doable when you take it with this GOAT", "rating": 5, "expected_grade": "A", "created": "2022-12-23T20:24:47.153646Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Great professor", "rating": 5, "expected_grade": "A+", "created": "2023-01-03T14:32:22.888143Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT410", "review": "Pretty fair professor for stat", "rating": 5, "expected_grade": "A-", "created": "2023-01-03T14:32:34.844464Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Easy professor exams are very similar to practice", "rating": 5, "expected_grade": "A", "created": "2023-01-03T14:32:53.454850Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Easiest stat class of my life with this profesor", "rating": 5, "expected_grade": "A", "created": "2023-01-03T14:33:04.778826Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Great professor, TA's were nice", "rating": 5, "expected_grade": "A", "created": "2023-01-03T14:33:14.829366Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT410", "review": "Pretty good professor, the grade I got in the end was my fault, but if you do the work you will get the grade you want", "rating": 5, "expected_grade": "B", "created": "2023-01-03T14:33:38.634336Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT410", "review": "Danul is a very nice guy. He really cares about the success of his students. The lectures are fine. He is a generous grader on homeworks, quizzes, and exams. His exams are very similar to the practice problems. He will let you make up missed quizzes and gives homework extension if you ask him. He will also release solutions to practice exam problems (which are very similar to the actual exams)- just ask him! The exam average is very high. If you put the required effort, you can really get an A+ in his class. I had a really busy semester, so I could not put more time in this class and still ended up with a B. \r\nTake his section for Stat410 if you really want a good grade. Unlike other sections, there are no R projects in his class :)", "rating": 5, "expected_grade": "", "created": "2023-01-10T21:10:00.089503Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Great stat professor", "rating": 5, "expected_grade": "A+", "created": "2023-01-24T14:12:12.726512Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT410", "review": "Like all the other reviews said, professor is very fair, exams are easy, homework is not too bad, R projects are the only pain tho", "rating": 5, "expected_grade": "A", "created": "2023-01-24T14:12:36.914558Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Great professor, easy ass exams that are identical to review", "rating": 5, "expected_grade": "A", "created": "2023-01-24T14:12:50.629521Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Not sure why his reviews are this low. This guy is a very nice professor and clearly cares about his students. His homework is literally just like 5-6 problems each week and they can be found online. Furthermore, his tests are very similar to the practice exam, meaning he changes a few numbers and calls it a day. Would recommend.", "rating": 5, "expected_grade": "A+", "created": "2023-01-31T00:47:13.080055Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Very passionate professor and easy", "rating": 5, "expected_grade": "A+", "created": "2023-01-31T00:47:21.643917Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Danul is a beast", "rating": 5, "expected_grade": "A", "created": "2023-01-31T00:47:27.721973Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Great professor, communicative via emails, and exams are so easy.", "rating": 5, "expected_grade": "A", "created": "2023-01-31T00:47:47.724410Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "This man is a GOAT. \r\nG - GREATEST AT LECTURING\r\nO - OVERALL EXAM GRADES WERE 90+ EACH ONE\r\nA -  ALL HOMEWORK IS SEARCHABLE ONLINE AND EXAMS ARE THE SAME AS PRACTICE\r\nT -  TEACHES LIKE HE ACTUALLY CARES", "rating": 5, "expected_grade": "A", "created": "2023-01-31T00:49:04.447154Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Pretty decent professor. TA's mostly helped me, but exams were very fair and I can tell this isnt his best subject to teach, but he tries his best", "rating": 5, "expected_grade": "A+", "created": "2023-01-31T00:49:28.956439Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Nice guy, but I learned more from the textbook than him.", "rating": 2, "expected_grade": "B+", "created": "2023-02-24T19:09:02.252819Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "This class turned to be a self teaching class. He is not good at lecturing. His exams are completely opposite of his teaching materials. Moreover, his exam is nothing similar to practice exam.", "rating": 1, "expected_grade": "P", "created": "2023-03-10T02:55:12.166067Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Great professor. Lectures are easy to understand, the tests are exactly the same as the practice exam, last review guy must be dumb. Professor is great take him!", "rating": 5, "expected_grade": "A+", "created": "2023-04-05T15:05:23.725796Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Easy exams hw and projects", "rating": 5, "expected_grade": "A+", "created": "2023-04-05T15:05:34.595611Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Extremely good professor. Had him for MATH140 and now w/ STAT400. Exams are identical to practice exams (literally), HW is very fair. Very responsive with emails, and answers students' questions extremely detailed. 20/10 professor.\r\n\r\nDon't even know what the person's review 3 reviews down is on about, probably didn't even attended class and expected to be handed a free A!", "rating": 5, "expected_grade": "A", "created": "2023-04-22T02:05:02.186113Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Easy professor, like everyone said, tests are identical to practice", "rating": 5, "expected_grade": "A+", "created": "2023-04-22T19:13:37.371702Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Great professor, homework can be found online and the proefssor has easy exams", "rating": 5, "expected_grade": "A+", "created": "2023-04-22T19:13:58.693259Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Love him", "rating": 5, "expected_grade": "A+", "created": "2023-04-25T04:09:29.131577Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Class is very easy and understandable. People be putting bad rep on danul but hes honestly a goat professor. Lectures can be quite boring because this class is EASY but his exams are exactly the same as practice.", "rating": 5, "expected_grade": "A", "created": "2023-04-25T04:10:49.513432Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "He is not a good lecturer. Moreover, he explained easy concepts in a difficult way.", "rating": 1, "expected_grade": "", "created": "2023-04-27T00:43:00.205016Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "free a, just do practice exam and u straight", "rating": 5, "expected_grade": "A", "created": "2023-04-30T18:05:28.985088Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "exams are pretty much the practice exams he hands out. But otherwise not the greatest at explaining things.", "rating": 4, "expected_grade": "", "created": "2023-05-02T18:23:36.577293Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "awesome prof and super fair class, TAKE HIM", "rating": 5, "expected_grade": "A", "created": "2023-05-02T19:38:58.685572Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "I truly felt that some students just overpraised the professor. He is not a good lecturer. If you would like to learn the material find another professor, he taught the material in a confused manner. His practice exam is not enough to do well in the exam. For example, his final exam contain only few questions to prepare for the exam.", "rating": 1, "expected_grade": "P", "created": "2023-05-03T02:15:56.665667Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Really really straightforward and easy to get an A he explains stuff ok", "rating": 5, "expected_grade": "A+", "created": "2023-05-06T16:56:17.724477Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "TAKE HIM!!!!!!!!!!!!!!!!\r\nThis dude literally gives out free A's. All I needed were a 50% or higher on all the exams. The exams were exactly like the practice exams so make sure you copy down the practice exams onto your cheat sheet as detailed as possible. His homeworks and projects were free 100s. They go over the homeworks in discussion but the answers are online. The project can seem difficult so use ChatGPT or go to the math tutoring at Kirwan.\r\nDanul is a really nice guy. He talks slow so that everyone can understand and sometimes even cracks jokes.. You can pass this class with bare minimum understanding. If you really want to understand the content then just pay attention in class, participate and read the textbook. It's up to you how deeply you want to understand the content. The TAs were helpful. He responds to emails in a timely manner and is willing to answer questions.", "rating": 5, "expected_grade": "A", "created": "2023-05-15T01:04:57.971425Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "I attended 4 classes the whole year and ended with an A. The first class I went to was the introduction class (first day). The second time I showed up was for the first midterm. The third time I showed up was for the second midterm. The fourth I showed up was for the final. Homeworks are R projects are a free 50% of your grade. The midterms are the exact same as the practice exam he gives the week before. 1 sheet of notes is allowed for the exams and 2 sheets for the final. I copied down the answers and formulas from the practice exams and went in and took the real exams and got an A on both. Too easy and the professor himself is VERY NICE and understanding. He is very passionate about stats and genuinely cares for his students.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T18:33:55.373691Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Danul is a straightforward professor and STAT400 class is fairly easy to do well in if you prepare properly. The textbook is really good for practice problems and he is all around very fair when it comes to assignment grading. He should be the go-to pick for this class.", "rating": 4, "expected_grade": "B+", "created": "2023-05-17T19:34:00.634576Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT410", "review": "Great professor overall. Lecture's are very informative and very helpful in office hours. Practice exams are similar to the real exams, grading is pretty lenient too. Highly recommend!", "rating": 5, "expected_grade": "A", "created": "2023-05-18T03:42:57.628212Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "I love \"Mesty Besty\" as his teachings made sense, exams were very lenient as you were allowed your own formula sheet, and the TAs were generous with partial credit as long as you showed substantial work for your answer. STATs used to be one of my weakest subjects, but taking it with Mestiyage proved that under proper guidance you can succeed in anything. Thank you Mestiyage!", "rating": 5, "expected_grade": "A-", "created": "2023-05-18T15:50:45.160300Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Easy class with this professor where his exams are basically the same as the practice exams. \r\n\r\nHe explains things very badly in a very dry, theoretical, unnecessary complicated manner. \r\n\r\nHe records his lectures and uploads the sheet he writes on during lecture so that you do not have to attend in person.\r\nHowever, I must confess that I never went to lecture, never watched the recordings, nor read the sheets he would upload. \r\n\r\nHe had amazing TAs who taught much better than him and held great review sessions right before the exam.\r\n\r\nResponds fast to email.\r\n\r\nHomework was free points, and the TAs would just give you the answers during discussion.\r\n\r\nPractice exams were often riddled with typos. With the mathematical notation, you would often be scratching your head thinking whether the question is asking for something you've never heard before, before realizing that it's just a mistake. \r\n\r\nR projects were annoying and painful but just going to the R tutor to sort them out was good enough. He cared about his students, and was willing to grant extensions without too much of an issue. \r\n\r\nOverall, this professor did not make things unnecessarily hard. The fact that I did not get an A is solely my fault. I feel with a bit more effort I could have gotten an A.", "rating": 3, "expected_grade": "B+", "created": "2023-05-21T00:19:39.839905Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "He made everything super straightforward. No surprises on exams. He also recorded every lecture. Very nice and explained things well.", "rating": 1, "expected_grade": "A+", "created": "2023-05-21T20:34:56.464696Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Danul is a straightforward and caring professor. STAT400 is fairly easy as long as you review notes and do the practice exams (and read the textbook if you want to understand topics better).\r\nPros:\r\n- Good notes: great handwriting. He posted his notes on the weekend.\r\n- Exams: as long as you did the practice exams and understood it well enough, you passed his midterms and final.\r\n- Fair grading: show you work. Even if your answer or calculation is wrong, as long as you show your thought process, he gave a lot of partial credits.\r\n- Homework: The TAs went over the solutions in the discussion on Friday, so Danul is giving you free grades because the homework is usually due on Monday. \r\nCons:\r\n- A bit confusing. There were quite a lot of contents to cover in 75 minutes. Read the textbook or google for clarification.", "rating": 5, "expected_grade": "A", "created": "2023-05-25T23:59:03.320303Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Straightforward and easy to understand. I stopped going to the in person lectures after the first two classes because he uploads all the lectures online and commute times. As long as you watch the lectures and pay attention, you'll do fine. Would definitely recommend.", "rating": 5, "expected_grade": "A-", "created": "2023-06-17T05:23:51.049275Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "Fine professor. You could honestly skip every class and learn from the textbook and it would make no difference. I never went and just copied his notes and was fine. MingPress is annoying especially if you don't know the format of the answer so good luck with that.", "rating": 3, "expected_grade": "A-", "created": "2023-06-21T06:08:42.838396Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Exams in the class are super fair, as they are near identical to the practice exams, and some of the assigned homework questions.\r\nDanul speaks fairly slowly in the lecture, which does give you plenty of time to record/process what he says, but also can get painfully annoying sometimes.\r\nHe also tends to make a fair number of mistakes in his lectures/notes, which can be slightly frustrating to deal with at times.\r\nHe could also do a better job of explaining concepts and providing necessary formulas, as he spends a lot of time giving derivations, and also spends a lot of time explaining concepts through examples/scenarios that aren't that helpful. \r\nDanul also is a caring professor who is responsive to emails and gives many chances to ask questions.\r\n\r\nOverall, he is a decent professor, and is a decent option for STAT400.", "rating": 4, "expected_grade": "A+", "created": "2023-07-05T06:55:23.015058Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT410", "review": "Danul is a great professor. He lectures well, and if you don't understand the concept, I would either ask him right away in class as he gives detailed explanations and will restate things without hesitation, or I would go to his office hours where he is also very helpful. I went into this class only after taking AP Stats in high school, and if you're like me I forgot pretty much everything after walking out of the exam room. I would say that if you're very new to stats, the course will prove to be a little difficult and first and you might not understand what's happening, but keep on solving problems, asking questions, and eventually you'll get an intuitive grasp. \r\nThe homeworks are pretty difficult, and if worst comes to worst there are answers online that you can use as reference. For answers that are already written in the back of the textbook, I'm pretty sure Danul is okay with you looking at them, because one day I walked into office hours to ask a question and he said \"did you refer to the answer key before coming?\" which was kind of funny. He's also a really chill guy and makes occasional jokes that keep the lectures interesting. I remember one time during the finals review lecture, he said \"and I'll be grading harshly for the final,\" and the class fell dead silent. He broke the silence soon saying that exams must have had us pretty stressed out, because obviously that was a joke. So it goes without saying that him and his grader grades homeworks, quizzes, and exams very leniently, and as long as you somewhat get the concept and the calculation, he'll give many many partial credits. There was also a decent curve at the end of the semester. \r\nHis practice exam \"study guides\" are very similar to the actual exam, and the final also contains problems of the same caliber. If you can do the homework confidently, undoubtedly you will ace the exams. Even if you find them a little difficult, a bit of studying goes a really long way.\r\nThe last thing I'm gonna say, is make sure to attend lectures. I don't know about STAT400, but he doesn't record any, and does most of his stuff on the chalkboard. He's a good lecturer, so it's worthwhile going to.", "rating": 5, "expected_grade": "A-", "created": "2023-07-22T21:59:44.526002Z"}, {"professor": "Mestiyage Gunatilleka", "course": "DATA400", "review": "Great professor", "rating": 5, "expected_grade": "A+", "created": "2023-07-26T06:13:44.138144Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Great professor, tests are so easy", "rating": 5, "expected_grade": "A+", "created": "2023-08-16T23:17:12.284408Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Exams are identical to the practice exam, like I literally mean it, they are just number swapped because he probably does not care about this class. Homework can be found exactly on chegg and the quizzes are literally super easy so long as you pay attention in class. R Projects are the only hard part about this class but then again if you do well on the exams, you will be safe for an A", "rating": 5, "expected_grade": "A+", "created": "2023-08-22T04:54:02.667746Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Exams are identical to practice exam. You get a formula sheet. Homeworks are easy. This is literally STAT400 that he teaches but a little more deeper in knowledge. The first half of the course is just STAT400 review if you took it with him. Easy peasy.", "rating": 5, "expected_grade": "A+", "created": "2023-08-22T04:55:13.109564Z"}, {"professor": "Mestiyage Gunatilleka", "course": "MATH120", "review": "If you show up to class (or at least watch the lecture videos b/c he doesn't take attendance) then you'll be fine. Discussions are also important bc there was quizzes, but the TA explains everything right before them", "rating": 5, "expected_grade": "A-", "created": "2023-09-18T15:32:02.817968Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "He is a little boring at times but lectures are recorded. He acknowledges that most people taking this class are CS majors and tailors content to be relevant for them. My TA was fantastic and he was accommodating when ELMS kept deleting my homework. Exams are exactly like the study guide.\r\nThe only annoying thing is the R projects because R was never brought up in lecture(there was a pdf on ELMS).", "rating": 4, "expected_grade": "A+", "created": "2023-11-22T19:03:22.003315Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "He is a fair teacher and grader, the way the course is structured makes sense. He clearly cares about students and wants them to succeed. Only complaint is that the class is too much structured for CS majors and it makes it hard for people who must take it for other reasons to follow along, as he assumes you already understand concepts and notation that are used in CS. Over all though, he is a good professor.", "rating": 4, "expected_grade": "A-", "created": "2023-12-14T15:21:48.893170Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Danul sometimes goes over things too deeply or spends too long on one problem, but overall he's a good teacher. Answers questions effectively and cares about his students. There are homeworks (which can sometimes be very long), R Projects (also kinda take a while), two midterms (very fair exams, decent practice material), and a final (which was quite difficult and riddled with typos, causing him to call them out during the exam and having students redo the problem). But overall, not a bad prof. Take him.", "rating": 4, "expected_grade": "A-", "created": "2023-12-19T02:11:26.576945Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Literally my favorite professor at this school and I've taken two different classes with him. He's so smart and you can genuinely tell he cares and puts a lot of time into the course, but at the same time he's so accommodating of students. He literally could not be nicer. He also teaches super well and is happy to clarify any concepts!", "rating": 5, "expected_grade": "A", "created": "2023-12-19T20:13:24.078483Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Lectures are recorded and the notes are posted. The exams are fairly simply and the partial credit is very good. The only annoying part of this class was the R projects, so don't do the entire thing the night it's due.", "rating": 5, "expected_grade": "A+", "created": "2023-12-19T21:27:40.564230Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "DANUL IS THE MOST UNDERRATED PROFESSOR I HAVE EVER HAD!!!! If your put in effort, even if you are checked out for weeks, if you put in the effort you will get a good grade. He is intentional in helping students earn good grades and does everything possible to do that. He is also very well spoken, its not common to have a professor who communicates the instruction effectively while helping students get the grade they want. Must take him, you will never regret not taking him.", "rating": 5, "expected_grade": "A-", "created": "2023-12-20T05:16:37.308035Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Super great! He is a great lecturer and records his lectures. His exams are similar to his practice as well.", "rating": 5, "expected_grade": "A", "created": "2023-12-30T02:33:15.186065Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "very good statistics professor that knows what he's talking about and is passionate about statistics. he makes the class very manageable as well. There are weekly quizzes which are very easy. the exams are pretty fair and the final as well. just review his previous exams and final and you'll be fine. he also allows you to bring note sheets. the only reason I ended up with a B+ is because I started skipping class a lot. if you go to class it should be an easy A.", "rating": 5, "expected_grade": "B+", "created": "2024-01-03T18:45:05.515547Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT401", "review": "Nice! Easy class, didn't turn in an R project and still got an A-.", "rating": 5, "expected_grade": "A-", "created": "2024-02-14T01:46:05.552079Z"}, {"professor": "Mestiyage Gunatilleka", "course": "STAT400", "review": "Exams were very easy, no quizzes. Only thing that took time was the R Projects which were reproachable. However the grading for R Projects was very lax. STAT400 has the mot applicable stuff from math so far and the professor teaches it at the most surface level possible. The professor cared about the students but I don't think he cared about us actually learning the material which is understandable since this class is just treated like a roadblock on the way to getting a CS Degree by most people taking it.\r\n\r\nI recommend taking it for an easy credit but I would personally take STAT410 if I actually wanted to learn stat and prob. theory a little in depth.", "rating": 4, "expected_grade": "A", "created": "2024-02-20T21:19:38.881396Z"}], "name": "Mestiyage Gunatilleka", "slug": "gunatilleka"}