{"courses": ["HONR229X", "LBSC680", "ASTR601", "ASTR695", "HONR218D", "ASTR120", "ASTR688B", "ASTR121", "ASTR688S", "ASTR288A", "ASTR688C", "ASTR350", "ASTR680", "ASTR695", "ASTR406", "ASTR399", "ASTR680", "ASTR601", "ASTR101", "ASTR120"], "average_rating": 4.0, "type": "professor", "reviews": [{"professor": "Michael Miller", "course": "ASTR120", "review": "He's a fantastic professor for anyone who is genuinely interested in the subject and wants to learn more,  and he's super engaged in making sure everyone understands the material (including designating time to answer student questions every lecture). He is very smart but it's not daunting once you get used to him and relax a little bit. Definitely glad I had him.", "rating": 5, "expected_grade": "A", "created": "2018-12-18T04:31:32Z"}, {"professor": "Michael Miller", "course": "ASTR350", "review": "Don't let testudo fool you by saying \"for Non-astronomy majors\". Yes, some basic concepts are explained that likely wouldn't be explained in an astro course for astro majors, but there's a ton of math and hard-to-conceptualize topics that require a solid amount of studying. Don't take this course simply because you think black holes are cool. This course is difficult. The homeworks are difficult but the exams are actually pretty fair. The only problem is, the homework problems are way more complex than what's on the exams and the lectures are SO dense it's nearly impossible to adequately prepare for exams. Oh, and there's a paper you're gonna need to write on top of a final exam. \r\n\r\nProfessor Miller is among the nicest professors you'll meet. He's genuinely excited about astronomy, is happy to answer questions, and has very entertaining lecture demonstrations (he can do magic!). My only issue is, he knows so much about this topic he often forgets he's teaching non-astro majors and doesn't explain things too well and leaves us to figure things out ourselves. ", "rating": 3, "expected_grade": "C-", "created": "2022-03-28T23:57:00Z"}], "name": "Michael Miller", "slug": "miller_michael"}