{"courses": ["ENGL395", "ENGL390", "ENGL391", "ENGL398N", "ENGL393", "ENGL395", "ENGL395", "ENGL398N", "ENGL395", "ENGL395", "ENGL395", "ENGL398N", "ENGL395", "ENGL398N"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Michael Schmidt", "course": "ENGL395", "review": "Professor Schmidt is so cool to work with! He is very lowkey and his class is organized so well. I find that he is pretty easy to talk to and easygoing in class as well. He grades fairly and strictly off the rubric. Assignments are spaced out well, and he does well to cover the content in class. He has a large block of office hours to help you if you need the time/support, and he is very communicative with the class. Overall, I had such a good time in this class and got a lot out of the assignments.", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T00:49:39.191691Z"}, {"professor": "Michael Schmidt", "course": "ENGL395", "review": "Professor Schmidt is definitely a teacher that cares a lot about his class and will actually take the time to grade rather than just hand out As. However, he structures his class in such a way that you learn a ton. He really cares about all of his students and tries his hardest to get to know each and everyone of them. This class definitely takes some effort and care and it won't be a mindless A, but he is definitely someone that you could form a meaningful relationship with.", "rating": 5, "expected_grade": "A", "created": "2023-05-29T06:38:54.148746Z"}, {"professor": "Michael Schmidt", "course": "ENGL395", "review": "He is such a kind professor that really cares about students doing well in the class. Gives additional points to help you get a good grade, and also grades really good. He helps you out a lot and has long office hours if you need help.", "rating": 5, "expected_grade": "A", "created": "2023-11-01T01:19:50.183117Z"}, {"professor": "Michael Schmidt", "course": "ENGL393", "review": "Professor Schmidt is a very cool and passionate teacher at the university and is genuinely considerate of his students and their development.  He is very impassioned about his lectures and encourages participation during class to facilitate teaching.  The coursework is extremely reasonable and directly applicable to future endeavors, including resume and portfolio write-ups and reviews.  Highly recommend if you enjoy a low-key class with relevant work you will find valuable.", "rating": 5, "expected_grade": "A", "created": "2023-12-12T19:27:24.287110Z"}], "name": "Michael Schmidt", "slug": "schmidt_michael"}