{"courses": ["ENGL395", "ENGL393", "ARHU230", "ENGL395", "ENGL395", "ENGL395", "ARHU230", "ARHU230", "ARHU230", "ENGL254", "ENGL395", "ENGL395", "ARHU158N", "ARHU230", "ENGL254"], "average_rating": 4.5, "type": "professor", "reviews": [{"professor": "Michelle Moncrieffe", "course": null, "review": "#awsome!!!!!\r\n", "rating": 5, "expected_grade": "A+", "created": "2020-04-20T14:17:30Z"}, {"professor": "Michelle Moncrieffe", "course": "ENGL395", "review": "I'd start off by saying that if you don't want to go into the medical field/this isn't a required class for you, then you might not want to take it. ENGL395 is very heavy on research, and there are consecutive assignments based on the same exact topic where you're essentially building off each assignment. Since the class is small, Prof Moncrieffe also encourages participation and discussion, though she's kind, understanding, and flexible regarding anything participation based. She makes her expectations clear several times, and she will deduct points from an assignment if you didn't follow the directions, but to be fair, it's on you at that point. This class can be very eye-opening in terms of the focus you want to have within your medical field, so for those who are certain about their career in medicine, this is perfect for them. For everyone else, this class would probably just seem like a professional writing class that takes too much time and effort - for them, it's better to just do the other classes, online or otherwise.", "rating": 4, "expected_grade": "A+", "created": "2023-05-11T17:06:14.365367Z"}, {"professor": "Michelle Moncrieffe", "course": "ARHU230", "review": "love her, very passionate about the class. -1 star tho cuz sometimes the class felt like there was no structure and i found myself doing things that wasn't even related to the subject which was annoying. i didn't like the class but she's great.", "rating": 4, "expected_grade": "A", "created": "2023-11-17T15:48:43.625630Z"}, {"professor": "Michelle Moncrieffe", "course": "ENGL395", "review": "Professor Moncrieffe was an amazing teacher! She was very upfront on what she is looking for, and is very understanding on the difficulties of being a college student. While she does challenge us, she doesn't go out of her way to put extra pressure on us. If you do the work, you will succeed in this course. I would love to take her again. You can tell she genuinely cares about her students and wants to hear our opinion on certain topics. I'd definitely recommend her if you are planning on taking this course.", "rating": 5, "expected_grade": "A", "created": "2023-12-12T03:19:37.792200Z"}], "name": "Michelle Moncrieffe", "slug": "moncrieffe"}