{"courses": ["BSCI105", "BSCI170", "BSCI105M", "EXST155", "BSCI170", "BSCI170", "BSCI170", "BSCI170", "BSCI170", "BSCI170", "BSCI161", "BSCI161C", "BSCI161S", "BSCI161", "BSCI170", "BSCI161", "BSCI161C", "BSCI161S", "BSCI170"], "average_rating": 4.1081, "type": "professor", "reviews": [{"professor": "Michael Keller", "course": "BSCI105", "review": "Keller is definitely enthusiastic about the subject he teaches, but he's not the best lecturer. His lectures were probably only good before the 1st exam and then it went downhill. The Wednesday activities were sometimes just a waste of time, but sometimes they were good. It annoys me that he doesn't do + or - grading, which just sucks when you try to hard to get an A and if you are a point or two off, he will not curve or bump you up to get an A. Your grade really depends on the TA and whether or not they grade harshly in lab. Lab is basically a way to get most points unless your TA is just rude. I don't know, Keller was a nice person in general, but he has certain teaching practices that were just not considerate---like no plus or minus grading and Wednesday activities (which include clicker quizzes) that really contribute to getting a lower grade than you rightfully deserve. However, he does offer a couple of extra credit opportunities--usually only a point or two here and there, though. ", "rating": 3, "expected_grade": "", "created": "2015-12-17T23:10:00Z"}, {"professor": "Michael Keller", "course": "BSCI105", "review": "Did not like this professor much. \r\nAlthough Dr. Shields was probably the real villain behind all of this, I absolutely hated this class because of these professors. This is supposed to be an introductory course. They said in the beginning of this course that they did not want it to be a weed-out class, but they structured the class to be JUST THAT. This was not an accurate representation of what biology classes are usually like, and it made students reconsider their major. \r\nHe used my section as the guinea pig section to do some experimentation that the department wanted. Totally not fair because we were not able to choose which one we were in, and as a result, our grades suffered. Yes, he did curve in the end to make up for it, but the added stress and extra assignments we were given probably impacted the time and effort we were able to put into our other classes.\r\nHe was pretty nice about office hours and make up points and stuff, but other times he was pretty snarky and sassy. \r\nWish I took this with a different professor. \r\nDefinitely possible to get an A. It's jsut really annoyingly/unnecessarily difficult. ", "rating": 3, "expected_grade": "A", "created": "2015-06-08T14:58:00Z"}, {"professor": "Michael Keller", "course": "BSCI105", "review": "Keller is one of those teachers that thinks the material is easy because he has been teaching it for so long and expects you to know the material well. He says that he only asks about general concepts and doesn't want you to get caught up on the little details, but come the exam you will have to answer very specific questions. its also not helpful that his notes are 10% words and 90% diagrams that you have to be in class learning intently to understand.  Lab is not to bad, except my TA Randi is psycho and would kick kids out of class left and right. If you want to take BSCI105 avoid Keller ", "rating": 2, "expected_grade": "B", "created": "2015-05-24T13:20:00Z"}, {"professor": "Michael Keller", "course": "BSCI105", "review": "Dr. Keller recently changed the structures of his exams. They are directed towards a more application-based testing rather than rote memorization. He does not know how to write these types of questions. You will encounter very vague questions that can have multiple correct answers but his answer will take precedence, even though he doesn't ask for a best answer. Pray your TA is forgiving, but they mostly do not know what the man is doing. The lab and quizzes will help you a lot, but unless you're getting his style of questioning you will find yourself frustrated. Test averages for the last four exams were D's, including the final exam. He does not do +/- grading, which is nice unless you're close to the border where he will not be forgiving (0.7% curve). I recommend another teacher. ", "rating": 2, "expected_grade": "B", "created": "2015-05-20T14:50:00Z"}, {"professor": "Michael Keller", "course": "BSCI105", "review": "I have no idea what the person below is talking about... Dr. Keller is such a nice guys and prepares you SO well for the tests. He never tries to trick you and is super generous when it comes to giving points back and giving you materials to study from. He gives you study guides online for every single chapter, and you just make sure you know everything on those study guides. Take the class seriously, it can be very difficult at times with the amount of studying required for tests. Make sure you read the chapters and take notes so you can later study from those notes. His exams are straight from his powerpoints and the book, so you have to read. ", "rating": 5, "expected_grade": "A", "created": "2015-03-06T00:36:00Z"}, {"professor": "Michael Keller", "course": null, "review": "Dr. Keller is the absolute worst person. He is not responsive to student concerns and problems. In the lab report that you write for this class if you follow the instructions you where given to write essays by your high school english teachers you will get an XF. Using quotes and citing the lab manual is not ok. Having more than 3 words from the lab manual in a row will earn you an XF, even if its cited. Never ask for a regrade from this man. Avoid all interactions with him, if you do not want your semester to turn into misery.", "rating": 1, "expected_grade": "D", "created": "2013-06-01T19:45:00Z"}, {"professor": "Michael Keller", "course": null, "review": "Don't really need to read the book for his class, but it may help you if you don't understand something.  He posts the lecture slides on elms and his tests are really easy if you study his power point slides.  To do well, pay attention in his lectures because he tells you what is on the test and what is not on the test. ", "rating": 5, "expected_grade": "A", "created": "2011-01-05T18:03:00Z"}, {"professor": "Michael Keller", "course": "BSCI105", "review": "obviously bsci105 isn't an easy class, but i think Keller really made the class easy enough that if you really worked for that A, you could get it. \n\r\nAs the class went on he made the tests easier than I think they were meant to be, which is really nice on his part, but kids will always complain. \n\r\nI'd definately recommend taking him", "rating": 5, "expected_grade": "B", "created": "2010-12-17T02:20:00Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller isn't the best professor around, but as long as you show up to class and study hard for exams, you should be fine. Take advantage of GSS and make sure to look over your exams because sometimes the TA's take off points for no reason", "rating": 3, "expected_grade": "C", "created": "2018-12-19T18:28:15Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller is an interesting professor. His exams aren't necessarily tough, but you definitely have to get used to the way he wants you to answer the question. For example, in his class, he does not want you to think that glucous is a product of photosynthesis. ", "rating": 3, "expected_grade": "B", "created": "2019-11-10T17:02:13Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "For an introductory biology course, this class really requires you to put in three times the effort. Dr. Keller is very tedious with his assignments and exams; your answers can never be too general even if they're right, so pay attention to every little word that man says during lectures or you're gonna lose points. I really feel like this course was designed to trick you, so be careful. Even some of the homework assignments and quizzes can be hard and require you to think twice about your answers. If you're able to pay attention to every little detail and remember every one of them for the exams, then you may be fine.", "rating": 3, "expected_grade": "B-", "created": "2019-11-12T00:14:19Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I really hated this class. It put me through so much grief. The homework assignments are ridiculously hard. Dr. Keller looks for answers so specific to what he wants; if it is not worded to his exact specifications, it is wrong, even if it is scientifically technically correct. Some of the Wednesday activity sessions are pointless, only the question review sessions help. Both Keller and Shields get off topic very easily and cannot take control of their classes. The entire course was made so much harder than it needed to be. I'm sure a lot of the BS was because of Dr. Shields. Keller is really enthusiastic and I'm sure he's a nice person, but in terms of a professor that will help set you up for the future, you can do much better.", "rating": 2, "expected_grade": "A", "created": "2019-12-09T15:43:16Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Doctor Keller is a nice guy however, his exams are quite difficult. He is very knowledgeable but if I had to do it all over again I wouldn't take his course or recommend it to anyone.", "rating": 2, "expected_grade": "C", "created": "2019-12-18T18:07:34Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Personality wise- Dr. Keller is a great professor. He makes corny jokes sometimes. Very understanding if you need an extension or miss an assignment, just make sure you tell him in advance bc communication is key. His exams are not TOO hard but he does look for specific wording or details that he has gone over in class. This also goes for the HWs so you need to be careful bc i would get several points off for not being thorough. Topic wise, this class isn't hard if you put in effort or have background knowledge of biology. Dr. Shield's class was exactly the same as Dr. Keller's for spring 2020. All the hw, quizzes, tests etc", "rating": 4, "expected_grade": "", "created": "2020-08-16T03:30:18Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Really cool teacher. His exams are okay if you study and understand concepts thouroughly. Reasonably difficult but most concepts in the test are in his lectures/study materials. Moderate workload/homeworks. (Virtual class)", "rating": 4, "expected_grade": "B", "created": "2020-12-09T21:11:41Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller was a solid professor who did a good job teaching things in his lecture videos. There is quite a bit of material in the class, but as long as you take good notes from his videos and modules, you can easily do well on all of the quizzes, exams, and the final. We also never read from the textbook, since the videos included everything we would need to know for the class, so that was a plus.", "rating": 5, "expected_grade": "A", "created": "2020-12-18T14:13:37Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Professor Keller is a nice guy, but his class is quite hard. Lectures can be very long but very informative and helpful. The weekly quizzes sometimes ask questions that are too specific to what was in the lecture, making it much harder. Exams have been pretty hard. He expects your answer to be exact to words he expects; if not, you get it wrong.", "rating": 3, "expected_grade": "", "created": "2020-12-18T23:16:47Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Great professor! Even with asynchronous classes, he clearly demonstrated what we needed to know for his tests.", "rating": 5, "expected_grade": "A", "created": "2021-01-17T18:15:15Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a great professor!! He's an incredibly nice person and an understanding teacher. He's very considerate of students' time and other possible concerns (he was always flexible with due dates). More importantly, his teaching is very thorough yet straightforward. He always makes assignments and quizzes/exams on the concepts discussed/covered in class, so if you pay attention during lectures and take good notes you'll do very well in the class. I absolutely recommend his class!!", "rating": 5, "expected_grade": "A+", "created": "2021-05-07T17:30:41Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "This class is very doable if you put in the work and study a couple of days before the exam. Making sure you understand the information presented in lecture and understanding the assignments is key for learning and doing well in the course. Keller is extremely nice and understanding as well, so taking the course with him is recommended. However, I will say sometimes I didn't enjoy his teaching style but overall it was still effective.", "rating": 4, "expected_grade": "A+", "created": "2021-05-22T18:14:55Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a great guy. He really cares about his students and is incredibly nice. I would say there is an average amount of work for a bio class. A fair amount of assignments can be completed reasonably late without penalty. The tests are fine for the most part as long as you study. Much of the studying is memorization, understanding the material is key. The good news is he has a lot of places to find that information such as powerpoints, modules, and extra videos. Sometimes his lecture style can be a little boring, but he very clearly communicates what is meant to be known for his tests. If you want to succeed in this class it is incredibly doable. ", "rating": 5, "expected_grade": "A+", "created": "2021-11-20T17:49:11Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is such a great and funny professor. He teaches relevant information during lecture and wants to see all of his students succeed. He also gives out extra credit through clickers so definitely show up to class for a grade booster. Exams are fairly simple especially compared to the other professors. Study for the exams using his resources provided and you will succeed. ", "rating": 5, "expected_grade": "A", "created": "2021-12-05T01:39:33Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "GOAT", "rating": 5, "expected_grade": "", "created": "2021-12-06T00:53:43Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Great professor. Heard a lot of bad things going into the class about him and I can't imagine how they came up with bad thoughts about him. Tests are super easy if you take notes in lecture and pay attention. Clicker points boost avg by about 3 percent if all completed. ", "rating": 5, "expected_grade": "A", "created": "2021-12-06T04:17:43Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I strongly recommend taking Dr. Keller. I feel that he really cares for his students, and his tests are easier than high school exams. take advantage of gss meetings and make sure to study the modules, because they are quite literally the exams. He does not go into too much detail for anything and keeps things pretty simple. ", "rating": 4, "expected_grade": "A", "created": "2021-12-06T17:45:47Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a great professor. He wants all his students to do well and teaches information that you need in order to do good on the exams. The exams are straight from the lectures and by studying the content a little, you are guaranteed to get a good grade. He gives about 20 points extra credit through clickers and lots of opportunities other than exams to boost your grade. Definitely recommend!", "rating": 5, "expected_grade": "A", "created": "2021-12-07T22:45:52Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Pros\r\n- Dr. Keller is a decent lecturer, information is conveyed clearly through his own speaking and his slides\r\n- Lectures are relatively engaging, with light humor\r\n\r\nCons\r\n- Bad at communication (i.e. emails)\r\n- Highly passive-aggressive\r\n- As of the Fall 2021 semester, it is CLEAR that he does not care about the health and well-being of his students. Some context: there is currently a massive uptick in COVID-19 cases, and President Pines has mandated the wearing of KN95 masks (which will do little to negate the spread, considering how students must sit elbow-to-elbow for two hours for a single final exam). Dr. Keller has aggressively refused to move his final online despite other professors doing so.\r\n\r\nFor the last point alone, he nets a single star out of five. He is an actively immoral human being.", "rating": 1, "expected_grade": "B+", "created": "2021-12-17T01:57:32Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller isn't an awful professor, but its glaringly obvious he could not care less about any individual student. He constantly seems annoyed by students emailing him and makes people feel bad for asking questions about concepts he glazes over. Highly recommend taking Compton instead if you have the option.", "rating": 2, "expected_grade": "B", "created": "2021-12-17T02:52:56Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a great professor to have for this class. The course load consists of worksheets, weekly quizzes, practice exam problems, four midterm exams, and a final. The amount of midterms can seem overwhelming, but Dr. Keller provides study guides that perfectly outline the material you need to know. GSS worksheets are also available to study from as well.\r\n\r\nI decided to give Dr. Keller a 4/5 rating due how he handled the current Omicron situation. Students were very concerned about sitting shoulder to shoulder with others while having to take this exam, and he was very passive aggressive in his remarks to those with concerns.\r\n\r\nOverall, the class is pretty straightforward, and he gives out a lot of extra credit!  ", "rating": 4, "expected_grade": "A", "created": "2021-12-17T18:06:59Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "this class was pretty easy if you put in the work and study for the exams. the exams were really straightforward and easy. i recommend going to gss, reading the modules, and looking over the study guides he posts on elms because they were extremely helpful when studying for exams. dr. keller himself is nice and sometimes funny. lectures can be boring sometimes but you NEED to attend to get the extra credit clicker points! clickers rlly carried my grade. this would have been a 5 star review but it is 4 stars since he is pretty passive-aggressive. ", "rating": 4, "expected_grade": "A+", "created": "2021-12-19T17:58:22Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I am seeing all of these negative reviews and am taken aback. Dr. Keller is a great teacher and gives very easy and straightforward exams. (They are super similar to the gss worksheets so do those!). He is a very nice man and cares about making sure everyone is learning well.  If you try to do well in this class and study, you will do well, it is that straightforward. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-20T07:14:49Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a great professor. He gets the class very engaged in the lecture and never just reads off the slides. He makes good analogies that better the understanding of the topics when he could tell some people can't understand. I would recommend never missing a lecture and always taking notes. If you just pay attention for every lecture the exams will be very easy and minimal studying will be required to do well. He gives out a ton of studying resources which are very similar to the exams. Beside his poor communication with the students and passive aggressive responses, he is an amazing professor. ", "rating": 4, "expected_grade": "A", "created": "2021-12-20T21:19:16Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Great professor, gives not much homework but when he does, it's pretty helpful and relevant to the upcoming test. His modules on ELMS are top notch, especially the study guides he posts before exams. Pretty nice overall and attend his classes for extra points! This can really help your grade ", "rating": 5, "expected_grade": "B+", "created": "2021-12-27T05:59:12Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller was an awesome professor. His lectures were were very clear and he followed a slide show which he showed on the projector and posted on ELMS.  He was pretty funny too which helped make the class more engaging. The coursework is pretty light with some worksheets every couple weeks and easy online quizzes. Tests were pretty easy and tested you on exactly what he said in lecture and put in the notes on ELMS. He also had clicker questions in class that were free bonus points for participation. It's an easy class if you pay attention in class and are actually interested in the material.", "rating": 5, "expected_grade": "A", "created": "2022-01-11T23:11:10Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "He is an amazing teacher who really knows his stuff. As long as you listen in class you should be fine. The tests are very fair but the weekly quizzes are a bit tricky. Overall, I had an amazing experience taking Dr. Keller.", "rating": 5, "expected_grade": "A-", "created": "2022-01-24T23:47:52Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is an amazing professor who has open discussion boards for specific questions (where he personally responds to you), detailed slides that he shows during the lecture and posted on ELMS, and records his lectures. He speaks loud and clear for the entire room to hear and he cares about all of his students. It is worth an early time slot and/or a Friday class in order to have Dr. Keller. I have not heard anything good about other BSCI170 teachers and would even wait until Dr. Keller's class is open to take BSCI170. Amazing teacher.", "rating": 5, "expected_grade": "", "created": "2022-02-23T15:51:07Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller is one of my favorite professors at UMD thus far based on his teaching. I always felt engaged and understanding with the content. His exams get progressively harder just study and go to the GSS if possible and you should do fine.", "rating": 5, "expected_grade": "A", "created": "2022-04-13T02:11:27Z"}, {"professor": "Michael Keller", "course": null, "review": "The best professor. He makes class so enjoyable and engaging. He gives extra credit and drops some assignments to help your grade. His tests are very fair, and you will do well as long as you study his material posted on ELMS. I would highly recommend Dr. Keller, he is amazing!", "rating": 5, "expected_grade": "", "created": "2022-04-22T15:17:48Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "great class. lectures are super engaging and makes really good examples to relate content to stuff you know. I'd say tests are pretty fair he gives weekly quizzes and practice exam questions that really help out. Sometimes he does talk a little fast and goes over complicated concepts like they're nothing so I recommend watching a quick crash course video before his lecture to kind of get a better sense of what he's referring to. he also gives lots of clicker question credit and posts all his slides", "rating": 5, "expected_grade": "", "created": "2022-05-12T00:41:23Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I thought Dr. Keller was a pretty good teacher, but he definitely could have done a better job explaining some concepts. He does have amazing recourses to learn and understand everything, and a lot of extra credit from clickers. As long as you show up to class and study from his modules, you will do well", "rating": 4, "expected_grade": "A", "created": "2022-05-13T01:00:23Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller teaches off of slides every class, but he manages make it not a monotone lecture. He also creates modules for every lesson which I strongly encourage looking over. The information he provides in the modules is not overwhelming, and definitely helps build a clearer picture. His test are pretty straight forward as long as you listen to what he says during lecture. He is also a fair grader, and puts in the effort to explain concepts during office hours. You will honestly be fine. (And just to be clear, I expected a B- in this course; however, I received an A-. And in the beginning, I thought it would be hard too).", "rating": 5, "expected_grade": "B-", "created": "2022-08-25T04:49:53.619259Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "great professor overall", "rating": 5, "expected_grade": "A", "created": "2022-12-06T15:21:44.166775Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is an alright professor if you're looking to learn biology. He teaches from the slides and doesn't really give much insight past that so attending lecture isn't that big of a deal. The exams are not what you'd expect either. The lectures teach the material to you in an elementary fashion, but the exams are much more than that. If you're looking to pass the class with a decent grade you'll have to do a lot of outside studying on the basic material.", "rating": 2, "expected_grade": "B", "created": "2022-12-09T16:29:32.638149Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I really like Keller. He simplifies as much as possible and will do visual demonstrations that are helpful. He also supplies lots of resources that are in easy access on canvas. You don’t need a textbook for his class. Exams are pretty easy but you do not get practice exams. Great class and professor overall.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T17:26:34.342157Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "He's a goat; his class is not easy, so don't think it is, but if you work hard, you can get an A, He's a lot of fun, and I plan to TA for the class, I need a 69% on the final to get an A and a 75 for an A+. Keller is fair and gives back many points if you ask I remember I got an exam regraded from 81 to a 90 if you can prove you are right, he will not trip. He gives really good study guides he's really fair he's so good. If u want to learn, take Keller. If u want an easy A, then look at fletcher (Idk if that's how you spell his name lol), But his class is just easy it will not help you if you have more Bio to take. All this to say, go take Keller he's good he really cares about his kids. gives extra credit, and always had a smile when class started. I wish he taught more bio I would keep taking his classes", "rating": 5, "expected_grade": "A+", "created": "2022-12-14T22:48:52.785187Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "his exams are fairly easy. Just study his modules.. His slides contain nothing so you have to take notes as he lecture. There are quizzes and worksheets every week but he drops many stuffs. Extra credits from clickers", "rating": 4, "expected_grade": "A", "created": "2022-12-19T22:05:48.228108Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I liked Keller's style of lecturing. Unlike the other review, I thought that his slides did contain a lot of information that was relevant for notes, but definitely pay attention to what he says because he gives a lot of little hints about stuff that will be on quizzes or that will be important for you to know. His clicker questions end up being quiz questions too, so write those down. I ended with an A in the class, didn't really study much for the exams because GSS was so helpful in their reviews. There wasn't a final GSS session, but you can go back and redo the old GSS worksheets to review. I got a 97% on the final by doing that.", "rating": 4, "expected_grade": "A", "created": "2022-12-24T14:31:04.080975Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a pretty good professor. His style of lecturing is easy to understand and follow along with. He makes it very easy to review and study for the exams. His clicker questions test you on stuff that will be on the exam. He uploads his slides and other very helpful resources on canvas that I would definitely recommend studying.", "rating": 5, "expected_grade": "B", "created": "2023-01-11T22:18:34.334584Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller was great. He projected so everyone could hear him. He was lively during his lectures, which made them easier for me to concentrate on. He's also very approachable and nice, so don't be afraid to ask him questions. His exams are also not bad, if you study the material and go through the modules. I really don't have a single complaint about this professor, he was amazing. 10/10 would recommend.", "rating": 5, "expected_grade": "B", "created": "2023-02-09T18:59:30.464932Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller is a great lecturer. He provides really good examples and simplifies things to make it easy to understand. His exams are fair - what is on his study guides is on his exams. He doesn't word them weird. His quizzes and worksheets are very helpful for studying. He gives many opportunities for practice. Would definitely recommend.", "rating": 4, "expected_grade": "B+", "created": "2023-05-03T19:01:20.819254Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is a fantastic professor and his lecture style is incredibly easy to follow. He teaches the course almost like a middle-school type feel (and I mean this in a positive way) where he explains many concepts well as if it is the first time you are hearing about it. The lectures do not feel dragged out, and he provides great summaries of concepts on his ELMS page inside the modules. The exams are very straightforward, and the open-note weekly quizzes are nothing to worry about since they can be finished usually in less than 10-15 minutes. He also had worksheets for us to complete for concepts that required a more out-of-the-box thinking, which were helpful. I didn't think it was a lot of work either, and the studying before the exams didn't take long. I highly recommend Dr. Keller as a professor.", "rating": 5, "expected_grade": "A", "created": "2023-05-09T18:31:29.948052Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller is an incredible professor. His exam format is really nice and makes sense. Definitely use his study guides because they help so much for the exam. He is really flexible and super approachable, so never feel scared to ask him any questions. His lectures are really straight forward and he does an awesome job at explaining.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T20:50:12.437603Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Loved dr Keller. I wish he taught more bio classes that I could take. He was quirky, but overall lectures were somewhat engaging. His exams were very reasonable and pretty easy. I liked his grading system which was by points instead of what canvas actually says. Overall he’s an amazing professor and I’ll miss his class.", "rating": 5, "expected_grade": "A-", "created": "2023-05-19T22:07:32.285159Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Such an awesome teacher! Take him if you can!", "rating": 5, "expected_grade": "A", "created": "2023-05-21T18:29:37.698085Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller was great. He tries his hardest to keep the students engaged. He's great at explaining topics, I do feel like he oversimplified some complex topics and wouldn't spend enough time on those. Which is especially concerning because some complex questions were on the exam. However, I think a little research into the topics wouldnt hurt. There wasn't any curving in this class, but relatively the exams weren't too difficult. I would say the photosynthesis/calvin cyle unit is the most difficult so just be careful during that unit and make sure you pay attention. His study guides are great and good for  exams. Wished he gave practice exams tho.", "rating": 4, "expected_grade": "C", "created": "2023-05-23T04:59:13.879816Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller is an amazing professor who cares about his students. He simplifies all the concepts so they're easy to understand and I never felt too confused in his class. If I was, doing the worksheets normally solved that problem (he only keeps the highest 5!) or I could just go back and watch the recorded lectures since he posts them. His class sets you up for success. Make sure to show up to class because you can get up to 20 extra credit points from clickers, and the clickers themselves actually help you apply what you're learning throughout lectures. Also he explains a lot more in depth during his lectures than what's on the slides and a lot of this information really helped me for the exams. His exams are super fair, if you learn the material, you'll do great. He posts exam study guides that include everything that'll be on the exam, nothing on the exams were ever a surprise.  I honestly have no complaints, I'm so glad I had him as a professor. Pick Keller.", "rating": 5, "expected_grade": "A", "created": "2023-05-23T21:25:22.518294Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller provides so many supporting materials that there is really no way to be unprepared for exams. He posts written summaries of each lecture and study guides for each exam detailing exactly what you need to know. It's important to attend lectures as he says many things that aren't included on the slides, but he records lectures. The only downside is that he can be slightly passive-aggressive. Otherwise, I highly recommend Keller.", "rating": 5, "expected_grade": "A-", "created": "2023-05-30T20:10:11.498384Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "as someone who is horrible at Bio, i passed with a B! his lectures are very good, i would just skip too many lol. He teaches well, and the tests reflect that. However the tests are way more complex and complicated than what we learned. So you really have to understand the overall structures to get some of the questions.", "rating": 4, "expected_grade": "B-", "created": "2023-06-11T17:58:37.192604Z"}, {"professor": "Michael Keller", "course": null, "review": "I had him for the summer. Exams will make or break you. If you do not have a background in biology, then this class will be difficult for you. He also changed the grading scale of the class last minute and made me think I was going to pass. Please beware.", "rating": 1, "expected_grade": "D+", "created": "2023-07-10T02:02:34.530039Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I thought his teaching style was confusing. He would throw a ton of information at you but wouldn't end up applying it to the bigger picture, which made everything a lot harder to remember even after studying for the exams. He's truly a really nice guy, but his teaching style could be confusing for someone who's not a STEM major (like me).", "rating": 2, "expected_grade": "W", "created": "2023-11-27T21:56:20.742840Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I think he would be a great professor for someone in a STEM major with a comprehensive background in biology. He is very knowledgeable in his field and clearly wants to help us learn, but he explains things in a way that only someone with prior knowledge can understand. His explaining methods confused me because he would throw a lot of information at you, but wouldn't do a concise job of connecting it to the bigger picture. However, he's a really nice guy and a pretty engaging lecturer.", "rating": 2, "expected_grade": "W", "created": "2023-11-27T22:01:28.576447Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "AMAZING PROF, he was so engaging and he got to the point. His tests are extremely fair - only info based off his ppts. Clicker questions are an easy way to boost your grade and its only participation based. gss is super duper helpful, especially the exam review gss because they give you all the answers to the practice problems due before class. super nice and fair guy, take him if u can.", "rating": 5, "expected_grade": "A", "created": "2023-12-01T13:25:57.211374Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "As the first major-related class that I had to take, I'd say that Professor Keller does a really good job of teaching us what we need to know. You can get a gist of the topics through the slideshows but the major points are super helpful when trying to get the small details of what you learning. He has weekly quizzes and has a lot of worksheets that are helpful to review before exams. Just to note, he's a silly little guy and I feel like he's super nice once you get to know him! Great professor for BSCI170 ! :)", "rating": 5, "expected_grade": "B+", "created": "2023-12-09T03:34:53.843774Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I really enjoyed taking this class and Dr.Keller was definitely my favorite professor this semester (BSCI170). He only puts exam content from his lectures so the textbook content is only a re-enforcer. He explains content very well and in a very step by step manner. If you attend lectures and pay attention//take notes you will do good in the course. He also uses completion clicker questions to boost your grade as extra credit if you attend class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-11T16:06:32.956893Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I really like this professor, he was sometimes passive aggressive but otherwise did a good job at explaining the content, and between ta's / gss / his office hours there was a lot of opportunities for extra help. Exams were always pretty fair and not too hard, the study guides tell you pretty much exactly what would be on it, so definitely had to study a lot but then they wouldn't be too hard. He also posts major points for every lecture which helps if you didn't understand any points on the slides. There's a good amount of extra credit in the form of just participation in class, you can get 20 points maximum and the whole class is out of 700, so almost 3% extra. Worksheets also helped a lot with understanding the concepts, so overall it was a pretty good class and not too difficult given that I'd never taken any biology before this.", "rating": 5, "expected_grade": "A-", "created": "2023-12-17T23:19:41.591187Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "He's a really nice professor and he does seem to genuinely care about his students. You can get an extra 20 points just by doing the extra credit clicker questions. Exams are based only on lecture content, I never read the textbook and have been doing fairly well. He drops 5 of the lowest worksheet assignments (there's only 10) and other than that there was just the weekly quizzes and the practice questions before each exam. I found a lot of the content and his teaching/explanation style to be difficult to understand - maybe people who are in STEM majors have an easier time understanding him - but he's always willing to help and there also GSS sessions that can be helpful. This was definitely the class I had to study hardest for when it came to my exams, but it's not bad if you're willing to put in the effort.", "rating": 4, "expected_grade": "A-", "created": "2023-12-17T23:29:09.788989Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Exams are a breeze if you look at the study guides. They never covered anything he didn't talk about during the lecture. Always summarized his lectures online with his main points.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T02:30:44.736837Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Dr. Keller was an engaging lecturer and provided a lot of materials to help students do well in the course including slides, summaries of every lecture, study guides, related book chapters (not required reading), and helpful worksheets. He was also always happy to help students outside of class and was accommodating to legitimate excuses for needing extensions or rescheduling exams. I enjoyed his teaching style overall, but I am a stem major (though I’ve never taken any bio other than ecology) so I can see how this course could be hard to follow for non-stem students. I also thought his exams were straightforward and generally included topics on the study guide and questions similar to the quizzes and practice questions. Exams are worth a lot of points though.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T03:42:58.219723Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Man do I not like his teaching style, gosh. He says at the beginning of the semester that you don't need to have any chemistry background, but a lot of the concepts that he teaches relies on understanding some chemistry concepts and I had a friend who struggled so bad with these concepts because she just could not rationalize this info, but if you're taking this class alongside orgo 1 you'll be great! You will have 4 exams but none are dropped. The first exam is a mini exam that should be relatively easy if you already have previous knowledge in the topics. The rest is your doom and you need to buckle up for an un-joyful ride. Exams are fair tho I just didn't think his style of teaching was made for me. He would post the slides and an additional word doc that would highlight the most important concepts, but he doesn't record lecture and a lot of the things he says during class is very important and may pop up on an exam. Obviously he is the better option out of the other bsci170 professors but don't think you won't need to put the work in because he's the \"easy\" professor. He drops 5 out of 10 wks and that helps a little but those quizzes will catch up to you and will dock your grade since he drops none and you will need to do well on them. But if I were to say one good thing about him, he adequately presents information valuable for the exams. The final tho? please don't stress out trying to learn every single thing, because he will not give you a study guide or anything to work with. But instead go over the areas you are not comfortable with like at all, that's better than nothing I promise.", "rating": 3, "expected_grade": "B", "created": "2023-12-22T03:36:22.413351Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Good professor but the class and concepts are difficult to understand unless you already have a background in biology. A lot of the course is weighted on the exams and they aren't weighted but overall he was a great professor.", "rating": 4, "expected_grade": "B", "created": "2023-12-22T19:38:47.375355Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "I thought Dr. Keller was an amazing professor! Pay attention in class, study the worksheets, and study the main points he puts out for each lecture. He literally summarizes the main points from each lecture, puts together a study guide for each test, and the worksheets are given so that we actually UNDERSTAND the concepts not just busy work. I went to GSS a couple times before exams and they were very helpful as well. Would definitely recommend Dr. Keller", "rating": 5, "expected_grade": "A+", "created": "2023-12-24T16:23:13.722932Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Keller himself is nice and approachable, but I really struggled with the exam formats in this class. His exams are often fill in the blank, matching, short answer, labeling pictures, etc. This mixed with his monotonous lecturing really messed with me and my grade. I would recommend taking good notes and attending GSS when you can.", "rating": 4, "expected_grade": "B-", "created": "2023-12-26T03:53:17.029843Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "Good professor, he provides an outline for his exams almost question to question. He does provide a good amount of extra credit. His final exam is almost the same as all of his midterms jsut combined and slightly modified. While i wouldnt want to talk to him one on one, he is still good for lectures. He makes the terms easy and a lot of the stuff he says in person and not on the slides are the exact answers for mid terms. Defniletly dont look at just the slides make sure to listen to him. His homeworks were easy, some of the TA's were questionable with their grading.  His weekly quizes are easy and often times will help you study for mid terms. His practice questions for the midterms and finals are helpful, a lot of the times the same exact questions on the practice questions were on the exams. I think that if you like studying on the notes you write personally, then this professor is for you. His lectures are not recorded btw.", "rating": 5, "expected_grade": "A-", "created": "2024-01-09T16:57:59.493970Z"}, {"professor": "Michael Keller", "course": "BSCI170", "review": "His exams were based on the slides, clicker questions, and practice problems. He is a great lecturer, summarizes his main points, and condenses them, which is nice. He honestly gives you all the tools to succeed.", "rating": 5, "expected_grade": "A+", "created": "2024-03-25T17:45:34.491636Z"}], "name": "Michael Keller", "slug": "keller"}