{"courses": ["WMST370", "WMST628", "WMST488J", "WMST602", "WMST263", "WMST601", "WMST488D", "WMST250", "WMST709", "WMST618", "WMST379A", "AASP498D", "WMST360", "AASP398Y", "WMST379B", "WMST379E", "AASP298B", "WMST265", "WMST368", "WGSS368", "WGSS265", "WGSS250", "AASP298B", "WGSS265", "WGSS360", "WGSS368", "WMST601", "WGSS250", "WGSS378", "WGSS488F", "WGSS250", "WGSS368", "WMST618", "WGSS378", "AASP264", "LGBT264", "WGSS264", "WGSS488F", "AASP361", "LACS348P", "WGSS250", "WGSS360"], "average_rating": 2.5385, "type": "professor", "reviews": [{"professor": "Michelle Rowley", "course": "WMST200", "review": "Professor Rowley's WMST 200 class is a huge bore. you sit in class for an hour and forty minutes. i personally facebooked the whole time but for multiple lectures she lets the TAs teach and she sits in the back and watches everyone...so you cant text or be on your computer without her saying something about it. class was easy but you had to do EXACTLY what they were looking for in the in-class activities. discussion was an easy way to boost your grade and the midterm and final were both take-home. final was a reflection of the class...easy easy", "rating": 4, "expected_grade": "A", "created": "2010-05-15T16:14:00Z"}, {"professor": "Michelle Rowley", "course": "WMST200", "review": "easy class, it's beyond me if you go to lectures and not get an A. engaging professor, reviews concepts of the material in class so that you understand (even if you didn't read the material.) as long as you understand the concepts you'll fly right through the class. rowley is passionate about what she teaches and memorizes everyone's names without even haven spoken to you (somewhat creepy?). ", "rating": 4, "expected_grade": "A", "created": "2010-05-14T11:10:00Z"}, {"professor": "Michelle Rowley", "course": null, "review": "One of the best professors ever. She is extremely intelligent and knowledgeable about her field which makes class very interesting. It was a reading intensive course, but that was to be expected since it's a senior seminar. She was also great at getting discussions going and clarifying concecpts. I would take any class with her again.", "rating": 5, "expected_grade": "A", "created": "2009-03-31T21:18:00Z"}, {"professor": "Michelle Rowley", "course": "WMST250", "review": "Very nice lady but EXTREMELY hard grader. Took this class because i heard it was easy but Professor Rowley makes it 10 times harder. If you're looking for an easy A, do NOT take this class with her.", "rating": 2, "expected_grade": "A", "created": "2019-05-24T16:05:57Z"}, {"professor": "Michelle Rowley", "course": "WMST250", "review": "Extremely hard grader, unreasonable, crazy. Class is a big waste of time, you will learn absolutely nothing. Class is a trap for white people. ", "rating": 1, "expected_grade": "B", "created": "2019-12-30T21:20:21Z"}, {"professor": "Michelle Rowley", "course": "WMST250", "review": "Class has essays due every other week, 2 main writing assignments about 7-9 pages each. Overall, class material is really easy to understand but Rowley is an extremely hard grader.  ", "rating": 2, "expected_grade": "B", "created": "2020-01-08T05:04:25Z"}, {"professor": "Michelle Rowley", "course": "WMST250", "review": "Tough grader, would look for another professor. All the projects are fairly simple so she’s got to make the class look legit somehow I guess. She rambles a lot during class. Most of the time no one knows what she’s talking about.", "rating": 1, "expected_grade": "B-", "created": "2020-01-15T19:24:30Z"}, {"professor": "Michelle Rowley", "course": "WGSS250", "review": "I had to take this class because I needed a last minute gened that was online but i’d recommend you not take this class at all. Rowley is very rude and expects so much out of the class. She makes you log your participation throughout the class on a point system that’s extremely confusing and if you make a mistake, she gives you a snarky comment. She’s not understanding because even though i joined the class a week late, she was not helpful in getting me on track and rather took off points and told me i was wrong. I didn’t have my camera on for one small portion of the class and me and someone else in a breakout room were muted when she came in and she made a rude comment about us not talking. Don’t take this class. Definitely not worth the effort given it’s level and topic.", "rating": 1, "expected_grade": "", "created": "2023-02-14T14:27:23.023667Z"}, {"professor": "Michelle Rowley", "course": "WGSS488F", "review": "My main qualm about Professor Rowley was the lack of clear expectations for assignments. Assignments would have expectations added on after turning them in and a weekly assignment went from 1-2 pages to ~7. Due EVERY SUNDAY. In addition to that assignment every week for class we were expected to read 30+ pages of readings as well as 1-2 films. This isn't to say that I didn't like Professor Rowley as a person, she always tried to be reasonable and accommodating, but her style of running this class just isn't it. As for finals we were expected to do a class facilitation in addition to a 10 page 1.5 space font research paper which was really overwhelming. Felt more like a graduate class than an undergrad senior seminar.", "rating": 2, "expected_grade": "A", "created": "2023-05-31T22:30:06.668649Z"}, {"professor": "Michelle Rowley", "course": "WGSS250", "review": "she's misunderstanding, rude, and demeaning toward her students. she definitely has her favorites too, which is unfair to other students. she has super high expectations despite knowing that we're all taking more classes than just hers. she also assigns you an unrealistic amount of readings and expects you to write about them every other week. it's insane. don't take her class.", "rating": 1, "expected_grade": "A", "created": "2023-11-02T21:59:10.228326Z"}, {"professor": "Michelle Rowley", "course": "WGSS250", "review": "im adding to my other review. she refuses to compromise with her students. she assigned us to go to an event that was required for the midterm, but it was in the middle of the day at a time other than our class time, which i had a meeting. after telling her i couldn't go, she refused to help me or even find a recording (which she could've done in the first place for students who couldn't make it). she also had this super weird point system that half the class couldn't understand and it made seeing my grade in the moment very difficult. again, don't take her class.", "rating": 1, "expected_grade": "A", "created": "2023-11-03T06:14:20.558616Z"}, {"professor": "Michelle Rowley", "course": "WGSS250", "review": "This year professor Rowley made every assignment completion. So pretty much if you do the assignments you get an A. The work load is fair. She has weekly readings but i never read them because they were extremely long. You have to write three reading reflections within the year (you chose when you want to complete them) and that was the only time I looked at the readings. Her lectures are interesting and make it easy to get participation points.", "rating": 4, "expected_grade": "A", "created": "2023-11-30T05:15:15.181940Z"}, {"professor": "Michelle Rowley", "course": "WGSS250", "review": "This class definitely has a lot of work from the pre-class readings to reading-reflections to the insanely long final, but I think it was all worth it. Professor Rowley always made lectures really engaging and always managed to make the readings make sense and feel relevant. I definitely came out of the class having learned a lot that I can use in other areas of my studies and life with her focus on different frameworks and models of viewing art/the world. \r\nEspecially with the change to a completion-based grading model, it is not that difficult to get an A (or a B by simply not doing as many assignments). Attendance is mandatory as participation is a part of your grade, so just be prepared to ask and answer questions in class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T21:02:17.240388Z"}], "name": "Michelle Rowley", "slug": "rowley_michelle"}