{"courses": ["ENME392", "ENME442", "ENPM808E", "HACS279", "HACS100", "ENPM686", "HACS102", "ENRE684", "HACS289", "HACS298", "HACS299", "HACS287", "HACS479", "HACS318A", "HACS498", "CMSC798", "HACS200", "HACS202", "ENME392", "ENME442", "ENRE684", "HACS100", "HACS200", "ENME392", "ENME442", "ENRE684", "HACS100", "HACS200", "ENME392", "ENME392", "HACS101", "ENME392", "HACS100", "HACS200"], "average_rating": 1.2727, "type": "professor", "reviews": [{"professor": "Michel Cukier", "course": "ENME392", "review": "This is by far the worst professor I have ever taken. \n\r\nHomework assignment on the second half of the semester to up to 10 hours to do. And they had nothing to do with the exams because you cant use excel on the exams, but he expects you to know how excel calculated it and for you to show it on the exam. \n\r\nHe did not give ANY practice exams. We all just groped in the dark, guessing for questions for practice. I think he's lazy and tries to recycle materials from semester to semester and doesn't want students to see the past ones. \n\r\nAlso he does not give you your exams back. If grading was incorrect you will never know about it. He makes the exams cumulative but he doesn't give you back exams so you have no idea what you need to work on more for the next exam.\n\r\nThe formal sheet he gives you for the exams have nothing labeled. If you don't know what the equation is for already you are pretty much screwed.\n\r\nSummary: Way too much work for a 3 credit class. Hard exams that are even harder to study for. ", "rating": 1, "expected_grade": "", "created": "2010-12-11T21:13:00Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "Wow Frostea took the words straight out of my mouth... \n\r\nHis own HW problems are horrendously awful and take incredibly long to complete (HW is worth 25% of your grade). Like Frostea said, you *waste* half your time figuring out what he wants!\n\r\nThe TA's were such a blessing. I wish Mary was teaching the class.. \n\r\nThis is the worst class I've ever taken and statistics is an incredibly important subject. Its a shame this guy is so awful, avoid him like the plague. \n\r\nDr. Barker teaches this class sometimes, he's an excellent professor. \n", "rating": 2, "expected_grade": "", "created": "2010-11-23T19:29:00Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "I honestly get the impression he is teaching this course not out of desire, but necessity. \n\r\nBe *very* careful with this teacher; he purposefully quickly glosses over information and AVOIDS explaining it when he intended to have a clicker question on it or emphasize it on the exam. This isn't always the case, but often is. \n\r\nHe is very passive aggressive in his teaching style. When he makes a mistake on his custom made homework problems since he worded it unnecessarily vaguely, he says it's your fault for not assuming X, Y, or Z, when it could very well be that the assumption could be invalid if you interpret the data differently. \n\r\nStudents actively argue with him about his homework problems, which are often UNNESSARY. If he assigned just book problems, they would be bearable. But a HUGE amount of time always goes into trying to interpret his custom problems, NOT into actually applying the material. \n\r\nI did very well on the first exam but awful on the second exam as I had ZERO sleep due to staying up all night trying to play catch up for my other classes after one of his god awful homeworks that I had to spend my entire weekend + monday in order to complete with some understanding of the material. So I was a complete wreck for his exam. \n\r\nIn a nutshell: he has a very typical professor-complex where he considers his class the only one in existance and expects you to \"get rid of conflicts\" if you can't attend the problem solving sessions on friday. Sorry sir, you cannot ask a student to drop classes just to attend the friday sessions. That is not only egotistical but also unethical. This a 3 credit class that you assign 6-9 credits worth of work per week. \n\r\nI've researching the necessary paperwork to report this teacher to the academic board; his unethical practices are negligent and destructive. If you do not like to teach, please leave. I shouldn't pay you tons of money to berate us in class. ", "rating": 2, "expected_grade": "B", "created": "2010-11-13T15:50:00Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "This guy is a horrible lecturer.  His lectures don't help (learning from the book is better) and he is bad at answering questions.  When asking questions during class, he will be easily confused with your question and probably give you a BS answer like \"it depends what you're doing\" and continue on with lecture. \n\r\nHe gives the worst clicker questions at the end of his lectures (usually 2 or 3 questions) which are on some mundane detail of his lecture he went over for 30 seconds. These count for 5% of your grade (syllabus is not clear).  \n\r\nHe gives more homework than my other engineering classes (like 12-20 problems per week along with analyzing raw data).  Also, he'll take off 2% of your final grade if you don't pick up your homework from his office.  Seriously, wtf??\n\r\nTests are tricky on purpose, so you'll need to be very careful reading the problem over and over.  They are long and you'll need to be proficient to finish on time.\n\r\nHe does hold problem solving sessions on Fridays (can't go to them because of class), but I hear they are largely useless like his lectures. \n\r\nOverall, one of the worst professors I've had, especially for a course that needs a lot of careful explanation.", "rating": 2, "expected_grade": "", "created": "2010-11-02T16:54:00Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "Michel is a difficult professor to put a grade to.\n\r\nHis lectures are largely useless even though he does put them online.  They are very scattered and doesn't show work, so often it looks like he just jumps to the answer with no explanation.  \n\r\nThe worst part of the lectures was the clickers at the end.  There are 2 questions that are graded as quizzes.  The questions are usually about some very minuscule detail and his wording is sometimes very unclear.  If you have him, I recommend bringing the textbook or his lecture notes and looking up the answers because he allows this.\n\r\nSample exams: \"How do you mean sample exams?\" was one of his quotes from the year. He does not give sample exams and his regular exams are very hard and curves them to around a 75% average.\n\r\nHomework: Gives a lot of homework but pays more attention to effort, though the correct answer does count.\n\r\nAvailability: He makes himself very available to students and is very approachable and a nice guy, and is always willing to help out students.\n\r\nHis accent was somewhat of a barrier, but once you learn what certain words are, it's not too bad.\n\r\nThe curve at the end seemed pretty large because the average grade was very low. I'm sure you could do worse than Cukier, but I'm sure you could do better as well.", "rating": 3, "expected_grade": "A", "created": "2010-08-29T14:19:00Z"}, {"professor": "Michel Cukier", "course": "HACS200", "review": "\"Dumpster fire\" barely suffices to describe the horror of this course.\r\n\r\nTLDR: \r\ncourse: absolute train-wreck, 0/10 would not take again. The students being so happy that a course is over is really something.\r\ninstructor: performance beyond awful in running the course and for encouraging p-hacking. Would rate 0 stars if I could.\r\n\r\nFirst and foremost, this was way to much work for a 2cr 200-lv course.\r\n\r\nLack of documentation / spec doesn't help either. \r\nUsing MITM software provided by the course staff is virtually required, which wouldn't be too bad except for the fact that it's broken and lacks documentation.\r\nImportant bug fixes to it were made multiple weeks into the semester, and the entire setup relies on deprecated packages, so updating breaks it.\r\nEven after those fixes, it's still bugged. (This is treating the \"it's a feature, not a bug\" aspects as features)\r\n\r\nNext up is asinine / lack of grading criteria. \r\nInitially, assignments at least had rubrics provided. (Marking in adherence to the rubrics, not so much)\r\nPeer reviews were used to give feedback (rather than instructional staff) for a large assignment early on, which wouldn't be an issue if the peer review comments correlated with the marks given.\r\nGrades were assigned here pretty arbitrarily, using justifications like 'this section was not 2 pages' (paraphrased) to deduct points from groups that had slightly above 2 pages as well as those with slightly below.\r\nWith margins though, no group could possibly have exactly 2 pages. \r\n\r\nEarly on, there were also marks for more subjective things like presentations, for which grades were not released until months later.\r\nThe thing is, no rubric was used in grading these -- just \"a general feel[ing]\" (direct quote). (???) This is MONTHS after the actual presentation! \r\nI barely remember what my teammates talked about, much less little details of other groups; there is no way the course staff remembers details sufficient to assign meaningful grades months later.\r\n\r\nWhen confronted about this, though, they doubled down and refused to provide grading criteria for the final presentation/paper.\r\nNow, rumor has it that Dr. Cukier was attempting (successfully?) to make the course appear \"rigorous\" by assigning low grades.\r\nI personally have no evidence of this one way or another, but consider this case:\r\n\r\nThe course staff told students that our proposals (worth about 20% of the overall grade) would be rejected and we would be asked to repeatedly revise them if they were not sufficiently well written.\r\nHowever, one entire group's proposal was accepted and subsequently scored 11.3/20 (probably 11.25 actually due to ELMS rounding) -- an F (mean was 15.3/20). \r\n\"F denotes failure to understand the subject and unsatisfactory performance.\" An unsatisfactory proposal should have been rejected, no? \r\n\r\nWhile other students undoubtedly have a long list of grievances about this course, I'll just touch on this one.\r\nHe actively encouraged p-hacking (see https://xkcd.com/882/) to groups who initially failed to reject their null hypotheses.\r\nThis included suggesting \"regrouping the data\" and even as far as \"just looking at one week [of 1-2 months worth]\" (paraphrased).\r\nThis is questionable at best, and most researchers view it as cheating in the experiment -- perhaps just shy of scientific fraud.", "rating": 1, "expected_grade": "B", "created": "2018-12-13T22:53:30Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "This is by far the worst course I’ve taken at UMD. The professors are incompetent, constantly retracting their own statements and overall a complete disgrace to the university. The course layout is awful and inefficient. We are expected to watch all lecture videos and do homework before coming to class which begs the question, Why even come to class? Furthermore the professors instruct us to asks further questions on Piazza, which they have frequently neglected to answers for multiple days on pressing issues. Cuckier is frequently wrong in his demonstrations which only further confuses students, while Fuge insults is by only asking for “high level questions”   Lastly, no one can ever seem to give a straight answer without having to “confer” which in other words means they will never tell you the answer and are dodging the question. The worst part of all is the use of prarie learn. Each question must be completed twice to get full credit but if a student doesn’t compete one single part of a question, they have no way of earning any points on the second attempt. Furthermore the exams use instant feedback which i will admit is nice, but the professors don’t even bother with partial credit which destroys all hope of earning credit for displaying what you know.", "rating": 1, "expected_grade": "", "created": "2021-04-30T05:15:31Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "Let this be a warning to anyone that has to take it with either Cukier or Fuge. Granted they may teach it differently once things are back in person, but being taught through zoom and asynchronous videos was just a huge mess to deal with it. Cukier, you won't understand his notes at all unless you've been keeping up with lecture to the dot. The notes that he does during lecture are a joke, typing out the solution makes interpreting his work difficult since this class is heavy on the notations. Its quite the headache. \r\nThe HW you have to do is extremely tedious and time consuming, granted I didn't expect it to be a walk in the park, but they are very long and take time too. \r\nBy the way, they also catch you off guard with how heavily emphasized MATLAB is used in the course. So if you haven't coded before or barely utilized it you're in for a great time. \r\nTests are extremely challenging, there's a reason why the averages are low, you can't get partial credit, unlike a normal practical exam you can still get some sort of credit for attempting it. Here however, you only can salvage some credit when you get the question RIGHT. So really its either all or nothing with these exams.\r\nUltimately you're gonna take an L with whichever statistics professor you have. This department needs to be investigated.", "rating": 1, "expected_grade": "", "created": "2021-05-22T03:44:47Z"}, {"professor": "Michel Cukier", "course": "ENME442", "review": "Everything everyone has said about Cukier is true. He is not the professor to take for any class. I don't care if you really want to take the class, I promise he will ruin it for you. He doesn't lecture well. His notes are useless to follow. He doesn't give clear expectations on assignments and then grades with scrutiny. He doesn't provide rubrics. It took him an entire semester to grade our midterms. We received our 1st midterm grade after we already took the 2nd midterm. The 2nd midterm had repeat content from the first so I got it wrong twice not knowing my error until I spoke to my friend about it. He is definitely passive aggressive about the way he teaches. He will not give you a full picture of the course content that will be on the exam and try putting in \"gotchas\" on the exams to lower our grades. All of his 442 exam questions are written in a way which lets him subjectively grade them and the exams are not returned for you to review where you lost points.\r\n\r\nAvoid this professor at all costs!", "rating": 1, "expected_grade": "", "created": "2021-12-15T03:42:55Z"}, {"professor": "Michel Cukier", "course": "ENME442", "review": "This class is abysmal. He sold it as one thing in the beginning of the semester and the class ended up being totally different to how he described it. We had to use security tools for our homework and he never mentioned how to use them once during the entire course. I literally had to Youtube how to do every homework assignment and some of them took way longer than they should have just trying to figure out how to use them. He spent every lecture talking about nonsense for the first 20 minutes at least and when he was teaching his lecture slides were harder to decipher than hieroglyphics. His tests are dumb and usually had barely anything to do with what we learned in class. A trainwreck is a generous description of this abomination of a class. If you need any more convincing, he literally spent half of one lecture talking about how one of his former students who works in IT emailed him and roasted him because his class is not useful for learning about information security at all. I put in so much effort into this course and still feel like I’ve barely learned anything useful. It’s a god damn shame because I like the subject material and find informaton security interesting, but this class made me question why I’m paying for a college education. Avoid this class and this professor like the plague, at least for your own sanity!", "rating": 1, "expected_grade": "B-", "created": "2021-12-15T03:55:59Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "A genuinely awful professor. I seriously have no idea how he is allowed to teach.\r\n\r\nHe has no idea what is going on half the time. He teaches the course so that you are forced to utilize Matlab, but he never teaches you how to use Matlab. He does not even know himself how to use Matlab. His office hours are useless. He does not know how to answer any sort of question unless it is a question that he has an answer key for. The exams are at least pretty easy. The homework rely on Matlab. but even the TA's do not know hot to grade them properly. We did not know any of our homework grades for a large chunk of the semester. He uses the tiny whiteboard in the class to write notes on, but all his notes are irrelevant and useless because they are all already on the screen.\r\n\r\nAvoid this guy if possible.", "rating": 1, "expected_grade": "B", "created": "2022-05-27T05:38:01Z"}, {"professor": "Michel Cukier", "course": "HACS100", "review": "He doesn't actually teach this class, he just takes credit for it", "rating": 1, "expected_grade": "A", "created": "2022-12-15T05:05:40.535542Z"}, {"professor": "Michel Cukier", "course": "HACS100", "review": "He does not actually teach this class - everything he is supposed to be teaching is taught through asynchronous videos that don't cover everything you need to know to complete the assignments. The person in the videos isn't even him -  it is another professor that you never meet.", "rating": 1, "expected_grade": "A", "created": "2022-12-18T18:19:25.913705Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "A terrible terrible terrible teacher, does not teach class at all. Taking class with him is just a waste of time and money.", "rating": 1, "expected_grade": "A", "created": "2022-12-19T19:51:13.521026Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "This is a terrible and awful professor. Don't take any class with him, that's a waste of time and money. Lazy and doesn't know what he is doing. University should not allow him to teach", "rating": 1, "expected_grade": "A", "created": "2022-12-20T02:10:50.658112Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "Cukier really wants to be a good professor, but he can't seem to do anything right. He makes mistakes in lectures, gets confused whenever he is asked a question, and has no confidence in his own teaching style. The homework for this class is absurdly difficult and requires you to do complicated things in matlab despite them not teaching a single thing about how to do things in matlab and the matlab class not even being a prerequisite. I wish the ENME department would get rid of this course and just require STAT400 instead.", "rating": 1, "expected_grade": "C", "created": "2022-12-28T23:57:15.324630Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "This guy really does not know what is going on in this course. He is a terrible professor, and people rarely go to his class just because you can't learn anything in this class. Finding a good study group or using the textbook is much more helpful.", "rating": 1, "expected_grade": "C", "created": "2023-01-03T11:40:25.641719Z"}, {"professor": "Michel Cukier", "course": "HACS200", "review": "Cukier has way too high expectations. He expects all students to come in with an understanding of statistics as if that's a prerequisite for this course (which it's not at all). He complained about the way we did our statistics despite not actually teaching us anything. Thankfully it didn't end up impacting our grade, but it made the course unbearable entirely. We had to repeatedly explain our entire research project every time we spoke with him and it required multiple people explaining it each time before he understood. Literally a waste of time.", "rating": 1, "expected_grade": "A", "created": "2023-01-03T17:31:44.074255Z"}, {"professor": "Michel Cukier", "course": "HACS100", "review": "I don't know why he's listed as an instructor for this course since I have never seen him.  He doesn't teach anything, we just watch prerecorded lectures from another individual.  These videos are not very informative, and quite a few of the homework assignments had errors in the instructions.  Everything was graded by TAs who didn't really know what they were doing, and I feel like I didn't really learn anything from this course.", "rating": 1, "expected_grade": "A+", "created": "2023-04-22T02:51:52.835975Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "Terrible professor, you can't learn anything from his class.", "rating": 1, "expected_grade": "C-", "created": "2023-05-03T15:09:27.769773Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "You have to be a legendarily horrible professor to get 1.26-star rating with 20 reviews.\r\n\r\nThis man will make you regret becoming an engineering major because of how dumb and confusing his lectures are. I didn't attend 90% of the lectures and solely survived off of equation sheets. If I had to choose between sitting in his lecture for an hour or stabbing a rusty, deformed, nail into my big toe I would take the latter.", "rating": 1, "expected_grade": "A-", "created": "2023-05-07T07:13:59.429809Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "This is the WORST class I have ever taken in my entire life. This professor should be avoided at all cost. His lectures are completely useless and I learned literally nothing from the course. The department should let us take STAT400 instead and honestly this is just a much worse version of the class. If you are planning to take the class and he is the only choice, just wait a semester until he is gone.", "rating": 1, "expected_grade": "D+", "created": "2023-05-08T20:42:27.665655Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "There is a reason why this guy has such a low score. It is amazing he still has a job. He doesn’t care that the tests are too long for the time frame given. Nobody finished the test in my section. UMD, fire this man PLEASE!!!!", "rating": 1, "expected_grade": "C-", "created": "2023-10-03T13:43:10.266722Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "I think this is the worst professor I have ever had in my entire life. He has no empathy for his students and on the last midterm, nobody in my section that I know of actually finished it. He is a confusing and horrible lecturer and I can see why his ratings are so low. AVOID THIS MAN AT ALL COSTS LIKE YOUR LIFE DEPENDS ON IT BECAUSE IT DOES.", "rating": 1, "expected_grade": "B", "created": "2023-10-16T03:09:42.017639Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "He can’t even do the HW problems he assigns on prairielearn correctly. I don’t think he actually knows how to calculate statistics because I haven’t seen any evidence of it yet. He may have lied to get this job, UMD should really address this. This class has been a pretty big waste of money.", "rating": 1, "expected_grade": "C-", "created": "2023-10-19T16:43:34.561626Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "This professor is so incompetent you wonder how he actually got the job. The sole reason he is probably teaching this class is because the university is forcing him to do it. He puts in below minimal effort and when students are suffering, he does a great thing called neglecting and thinks that it will solve the problem. Really does deserve his atrocious rating.", "rating": 1, "expected_grade": "B-", "created": "2023-11-03T21:49:21.901159Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "Doesn’t create a safe space conducive to learning. He gets intimidated when students ask difficult questions to which he doesn’t know the answers and then retaliates by saying “you figure it out” to instead of saying “I don’t know, let me look into it”. \r\n\r\nIt’s pretty clear he does not like to lecture because he comes to class unprepared and gets confused by his own slides.\r\n\r\nFor some reason he thinks it’s a good idea to have us use Matlab or excel on the HWs but expects us to do it by hand on the tests.", "rating": 1, "expected_grade": "C", "created": "2023-11-09T15:38:50.500562Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "Not a nice person. Needs to reevaluate why he wants to teach at all. Does not give students sympathy and overall just a dick. Doesn’t take much to be a good person…", "rating": 1, "expected_grade": "", "created": "2023-12-18T02:46:31.371199Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "Very unprofessional and rude. Gives the demeanor that he does not want you to succeed. It is just the first day and I already see little future with this professor and many others feel the same as 8 people have already drop his section since his first lecture. EIGHT!", "rating": 1, "expected_grade": "", "created": "2024-01-26T14:29:48.869231Z"}, {"professor": "Michel Cukier", "course": "HACS101", "review": "Day 1 and I arrive to class from Iribe, I am 6 minutes late. These are his words to me and subsequent students that come from the same building.\r\n\"Last time you are late next time do not come to class if you are late again, I don't care where you were change your schedule.\"\r\nNever have I ever met someone so unsympathetic and rude on the first day of classes and to someone he's never even met before! Unfortunately this professor is the only one that teaches this course and my schedule cant be changed to accommodate for his lack on leniency for students that have these slight conflicts. Will update review as semester goes on but he is already not starting off on the right foot with his students.", "rating": 1, "expected_grade": "", "created": "2024-01-29T06:45:43.623763Z"}, {"professor": "Michel Cukier", "course": "HACS200", "review": "cukier is a poor communicator and unnecessarily aggressive all the time. he had very unclear expectations which he did not even seem to understand himself at times.", "rating": 1, "expected_grade": "", "created": "2024-01-30T04:11:01.097240Z"}, {"professor": "Michel Cukier", "course": "HACS101", "review": "He doesnt even teach... I guess thats a blessing in disguise...", "rating": 1, "expected_grade": "A", "created": "2024-02-28T00:32:04.049010Z"}, {"professor": "Michel Cukier", "course": "ENME392", "review": "I think Professor Cukier has taken the past reviews to heart and tried to improve his teaching. He is not mean to students, but he might joke around and have fun when responding to questions or when talking. He seems to be pretty nice and caring about the students' learning and has worked hard with the other professors and departments to improve the class structure. While some explanations would benefit from more detail and sometimes the slides are a little rushed when presenting making it hard to write down notes, I appreciate the effort to improve the class based on feedback and hopefully, this review helps balance out the others.", "rating": 5, "expected_grade": "A", "created": "2024-03-28T20:44:49.517662Z"}], "name": "Michel Cukier", "slug": "cukier"}