{"courses": ["HIST289K", "HIST455", "HIST454", "HIST619R", "HIST131", "HIST134", "HIST201", "HIST134S", "HIST619M", "HIST462", "EXST030", "HIST289V", "HIST319Q", "HIST134", "HIST134S", "HIST619M", "HIST131", "HIST455", "HIST134", "HIST134", "HIST319Q", "HIST134", "HIST134S", "HIST454", "HIST131", "HIST455", "HIST134", "HIST134S", "HIST429J"], "average_rating": 4.5, "type": "professor", "reviews": [{"professor": "Michael Ross", "course": "HIST134", "review": "Dr. Ross is the BEST professor I have ever had at UMD. I originally took this class because I needed an I-Series gen-ed, but I was scared of taking a history class, since I've never really done well in history before, let alone enjoyed it. Dr. Ross made the subject matter so engaging and interesting! This was the one class I never even considered skipping for a second. I wish all my teachers made my courses as interesting as Dr. Ross did. Do yourself a favor and take whatever class he's teaching!", "rating": 5, "expected_grade": "A", "created": "2016-12-07T13:30:00Z"}, {"professor": "Michael Ross", "course": "HIST455", "review": "Dr. Ross is easily one of my favorite professors I've ever had at this university. He is clearly well-versed in history; it's actually remarkable how in depth he can go on each and every topic. It honestly feels like I'm being told a story every time I'm in class - like in a really good way. He makes everything so interesting and easy to remember. Aside from academics he's has a lot of great jokes and doesn't take himself too seriously. I really really recommend taking a class with him. ", "rating": 5, "expected_grade": "", "created": "2016-03-10T01:10:00Z"}, {"professor": "Michael Ross", "course": "HIST201", "review": "Professor Ross is an extremely knowledgeable professor! He has a lot to say about History, but he also says it in a very interesting manner. The way he approaches is lectures kept me interested the whole time and I would suggest everyone take at least one of his classes!", "rating": 5, "expected_grade": "", "created": "2015-05-07T18:21:00Z"}, {"professor": "Michael Ross", "course": null, "review": "the Good:  He is very passionate and very knowledgeable.  he did inspire me to want to know more about the civil war.\r\nthe Bad:   harsh grader who doesnt grade quickly so you (or I at least) dont know where you stand in the course.  Also his tests are tough, there are 3 i.d. questions and an essay.  doesnt sound hard except for 2 things, first the list he gives you of possible i.d.'s to study from is at least a 100 i.d.'s long and when you learn them you better learn every detail (even then I thought I gave really complete answers and the best i got was 18/20) and second the essay is tough because he wants a ton of details and if they're not there expect a bad grade.  I also felt like he should keep a timeline in the class to help you keep track of where you are in history because he jumps around and sometimes you have no idea about when he is talking about.", "rating": 3, "expected_grade": "B?", "created": "2014-07-13T13:03:00Z"}, {"professor": "Michael Ross", "course": null, "review": "I took HIST157 my first semester, and I was blown away by how this class was. His power points could use a little bit of an improvement, but just listening to the man speak his knowledge made up for it. he was one of the best history teachers that I ever had, and honestly makes you know the material in an engaging way that never bores you. I never skipped a class and I finished with a pretty good grade.\n\r\nHe is the standard I hold teachers to at UMD. I recommend taking a class with him.", "rating": 5, "expected_grade": "", "created": "2013-08-22T15:40:00Z"}, {"professor": "Michael Ross", "course": "HIST455", "review": "Prof. Ross is a great professor. He is funny and very engaging. The material is very interesting.\n\r\nTake a class of his.", "rating": 5, "expected_grade": "B", "created": "2013-05-12T16:06:00Z"}, {"professor": "Michael Ross", "course": null, "review": "This is one of my all time favorite classes and professors at maryland. He makes the material so interesting. tAKE ANY CLASS WITH THIS PROFESSOR!!", "rating": 5, "expected_grade": "A", "created": "2012-06-10T11:13:00Z"}, {"professor": "Michael Ross", "course": null, "review": "I took this class in fall 2011, and it was a last minute decision because I needed more credits. It turned out to be my favorite class. Professor Ross was a funny yet informative lecturer and very happy to be teaching. He presented material in a memorable way with lots of slides, so it was very easy to recall things come exam time. Take good notes and you will be fine. I was surprised I didn't get an A, but most people in the class didn't. He is fair though. Most of all, I learned so much about American History and it has served me well in other classes. I would recommend this class to everyone. There is also only one midterm, a term paper and a final so it is not a lot of work. This class was awesome", "rating": 5, "expected_grade": "B+", "created": "2012-05-13T22:05:00Z"}, {"professor": "Michael Ross", "course": null, "review": "Dr. Ross is a  phenomenal speaker! Usually I really don't like history, but could I never not pay attention to his lectures. He made the latter part of American History very interesting. If you just pay attention in lecture, you really don't need to read the textbook. The workload consisted of a few articles to read for discussion every week (really easy) and 2 medium length papers, that weren't too much hassle. The midterm and final were both simple enough - Write 3 IDS out of a choice of 5 and 1 essay for the midterm and 2 essays for the final. Take this class if you can!", "rating": 5, "expected_grade": "A", "created": "2011-12-24T18:48:00Z"}, {"professor": "Michael Ross", "course": null, "review": "Dr. Ross was an awesome professor. I am actually sad the class is over. I highly recommend going to lecture; other than it being really interesting, it is necessary. Dr. Ross is pretty funny and passionate about the subject. LOVED the class. My TA, Allison Finkelstein was good too. Discussion is required and is a big part of your grade. To get an A in it, all you really need to do is participate. ", "rating": 5, "expected_grade": "A", "created": "2011-12-13T19:14:00Z"}, {"professor": "Michael Ross", "course": null, "review": "This was an awesome class! It was very interesting and Dr. Ross was very engaging.  There are two papers (not too hard), a midterm (choose 3 out of 5 IDs, choose 1 out of 2 essays) and a final (choose 6 IDs out of 10, choose 1 non cumulative essay out of two, choose 1 cumulative essay out of 2)Take this class if you can!", "rating": 5, "expected_grade": "A", "created": "2011-12-12T13:38:00Z"}, {"professor": "Michael Ross", "course": null, "review": "Prof. Ross is an outstanding teacher who brings enthusiasm and passion to each lecture. He has an amazing mastery of the material and covers very interesting topics. The class had two exams and two papers- both not too difficult- however, I had a TA who royally screwed me over, accused me of cheating, and consequently I got a B despite getting over a 90 on every assignment.", "rating": 5, "expected_grade": "B", "created": "2011-03-15T14:59:00Z"}, {"professor": "Michael Ross", "course": null, "review": "Warning this is coming from a history major.\n\r\nAmazing professor!! Is really engaging and most people are at lecture because it is interesting. I really recommend going to lecture. Two books assigned: Text Book and \"Voices of America.\" You only need to read the voices book to participate in lecture you are never tested on it, and the text isn't really needed if u go to lecture and take notes but it could help. Take Ross he is great!! ", "rating": 5, "expected_grade": "A", "created": "2010-05-25T15:07:00Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Dr. Ross is a fantastic lecturer, undoubtably one of the best at UMD. However, you have to be willing to work hard for his class. He gives over 100 IDs to study for each exam and his \"short\" papers are actually 8 pages long. Would audit if possible", "rating": 3, "expected_grade": "A-", "created": "2018-12-20T04:07:24Z"}, {"professor": "Michael Ross", "course": "HIST131", "review": "Undoubtedly my favorite professor of all time. Dr. Ross is approachable and down-to-earth and he LOVES his job; he really wants you to succeed. His class was incredibly entertaining and informative, plus he's hilarious. Exams are a little tricky though--over 100 IDs to study from. But if you pay attention in class and participate a little in discussion, you'll be just fine.", "rating": 5, "expected_grade": "A", "created": "2020-02-19T07:22:30Z"}, {"professor": "Michael Ross", "course": "HIST131", "review": "You would be doing yourself a HUGE disservice if you had the opportunity to take one of Dr. Ross' classes and didn't. He's so interesting so you'll no trouble paying attention. There are a lot of IDs to review before an exam, but he only selects a handful for the test. Everyone does well in his classes. Seriously... take Dr. Ross", "rating": 5, "expected_grade": "A", "created": "2020-03-27T18:32:26Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Dr. Ross is an engaging professor who is entertaining but if you're looking to take HIS134 as an easy GenEd, run. DO NOT DO IT. You have to read 3-4 books and write 3-4 papers and the final paper requires you to include hundreds of terms synthesizing all the cases and themes. The final paper is worth 40% of your final grade. Yeah. FORTY PERCENT. My entire class was in over their head with the workload. There is also a required discussion section each week about outside material and you must participate for points to boost your grade. ", "rating": 3, "expected_grade": "P", "created": "2021-05-10T19:50:22Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "I took this thinking it was interesting and would be an easy GenEd. Neither were true since Ross is unfair with his assignments and is overall just boring. DO NOT TAKE THIS CLASS.", "rating": 1, "expected_grade": "P", "created": "2021-05-11T15:50:17Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Definitely not an easy gen-ed, it's an I-series for a reason. However, the class itself is super interesting and Dr. Ross is a great lecturer, you will not be bored and class is almost like getting told stories for an hour. You will have to write several long papers and the TAs grade fairly harshly. For some reason the final paper is worth 40% of your grade and you have to include over 100 terms from the class in it, making it a fairly difficult assignment. ", "rating": 3, "expected_grade": "", "created": "2021-05-19T03:14:00Z"}, {"professor": "Michael Ross", "course": "HIST455", "review": "Amazing class and amazing professor. He makes learning history and usually dry topics fun and enjoyable. He teaches history like a fun story, and leads some really interesting discussions during class about cases and our own takes on legal/constitutional interpretations, which I find really fun. He gave us plenty of notice for readings, quizzes, exams, etc., and is a really fair grader. This has been one of the most interesting classes I've taken at UMD, and it's probably my favorite class (even though it's outside my major haha)! I highly encourage this class or any class with Dr. Ross. He's such a funny and engaging guy", "rating": 5, "expected_grade": "A", "created": "2021-05-21T04:20:04Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Loved the way every lecture felt like a story more than a lecture itself. The essays we wrote, although still essays, were fun and exciting. I loved this class and anyone, either into history or not, will love it too. ", "rating": 5, "expected_grade": "A+", "created": "2021-06-16T22:03:13Z"}, {"professor": "Michael Ross", "course": null, "review": "Dr. Ross is literally such an amazing lecturer. His lectures are so interesting and immersive. Although he moves through the lecture slides very quickly and doesn't upload the slides, his class is definitely worth it. He makes confusing historical events very digestible and I strongly recommend the class!! ", "rating": 5, "expected_grade": "", "created": "2021-12-06T00:07:04Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "the class itself was particularly interesting and i really enjoyed the content. the issue was the speed he went through the lectures and the minimal amount of grades that do not give much opportunity to excel. nothing to do with the professor in that regard since he did not grade them but overall the class was okay. my only issue was the TA but otherwise i would say think twice about taking the class and be sure you’re good at retaining information. ", "rating": 3, "expected_grade": "", "created": "2022-01-17T15:56:11Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "History has always been my least favorite subject and I had been dreading filling my remaining history credit, however Dr. Ross taught this class in such an amazing way ended up I looking forward to every class. His classes were more like a story than a boring lecture and he was so thorough in setting up the  context that led to the historical events we were discussing that by the time we got to the actual event the actions of everyone involved made sense for the context of the time. And just the way and passion with which he discussed history was so refreshing and there were times where things he said changed my entire perspective. Our discussion topics each week invited a deep conversation surrounding issues discussed in class with enough room for forming opinions and our TA did a great job of balancing everyone who wanted to talk. I will say that his final paper was very tedious, but I put in a little extra work and ended up with a 100% on the paper. As long as you're willing to put in some effort you shouldn't have any problem in this class, and the workload was still far less than any of my in major classes so it was a nice break from my more STEM heavy classes. ", "rating": 5, "expected_grade": "A+", "created": "2022-04-14T01:53:03Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Fun class, he's great at making the lectures interesting and something I look forward to. The only thing is though theres like 5 grades for the entire year, two exams, two essays, and participation. This makes it very stressful and unclear if I will get an A or not.", "rating": 3, "expected_grade": "B+", "created": "2022-12-08T16:13:24.922317Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Very interesting lectures but definitely makes it very clear where he stand on certain issues, almost enough to make it annoying (we get it, you don't like communism). Grading was fair but there are only a few grades for the course, so if you mess up on one thing it would be easy to get screwed over.", "rating": 4, "expected_grade": "B", "created": "2022-12-09T16:39:40.232267Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "He's awesome! He makes jokes throughout the lectures and engages with students to make sure the class is not all boring notes. He's very chill and personable but also gets through the material pretty clearly. This class not a breeze, but definitely manageable and the discussion section I had with my TA was always one of my favorite classes to go to. Take this class!", "rating": 5, "expected_grade": "", "created": "2022-12-09T17:49:39.364370Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Professor Ross was the best lecturer I had for the fall semester. Very funny and very informative. The only issue with the class is that there are really only 4 assignments for the whole semester plus the participation grade for attendance. Grading is completely fair imo, the assignments I did not do so well on were the two essays in which I did not read the books.", "rating": 4, "expected_grade": "A", "created": "2022-12-27T22:39:01.461302Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "HIST134 was my favorite course this semester! Professor Ross is a pro at making lectures fun and immersive whilst keeping them informative. This class covers a lot of different historical time periods and Prof. Ross does a great job of equipping you with all the context you need to know for all of them in the lectures. With all of that said, this is a time-consuming course, not an easy gen-ed. You will have to do a lot of reading, and there are only a few assignments in the class so doing poorly on one can dock your grade by a lot. TA's also take a while to grade so you may not know where you stand in the course until very late in the semester. It's not easy, but its worth the effort you put into it.", "rating": 4, "expected_grade": "A", "created": "2023-01-25T23:53:29.305709Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "He's an incredibly nice teacher and honestly, my favorite from last semester. He makes class so interesting to follow and he's just really good at talking. The class itself was a little difficult, as it is a lot of history and he throws so many unnecessary facts at you. You will know more than just the story, which can be overwhelming for exams or papers. But I think it's better to be overprepared than underprepared. And the stories he picks are truly so fun and interesting. I ;pve his teaching style and if you want a GenEd or a History course, make this your one", "rating": 4, "expected_grade": "B+", "created": "2023-04-11T15:15:53.418743Z"}, {"professor": "Michael Ross", "course": "HIST455", "review": "I do not have enough good things to say about Dr. Ross, he is by far the best professor here. He makes every lecture so interesting and likes to joke around a lot which makes classes even more enjoyable. I highly recommend HIST455, I have never had much knowledge or interest in constitutional history, but it is literally my favorite class I've taken at UMD. He makes intricate topics so easy to understand and I genuinely feel like I gained a lot from taking this course. The work load was very manageable considering its a 400 level class. Two readings a week which were never more than 5 or 6 pages. There are also four books you have to read, but I found them to be pretty useful to my learning. There aren't many grades though, so just make sure you do the readings and study well for quizzes/exams. If you are thinking about taking this class you definitely need to do it!!", "rating": 5, "expected_grade": "B+", "created": "2023-05-02T00:18:31.075834Z"}, {"professor": "Michael Ross", "course": "HIST131", "review": "Dr. Ross is an excellent teacher. His class is very content-heavy but he delivers it in a manner that is both easy to understand as well as interesting. I have never found myself bored during his lectures. My only gripe is that there are only a handful of graded assignments, so you have very little margin for error.", "rating": 5, "expected_grade": "B", "created": "2023-05-09T18:29:37.535878Z"}, {"professor": "Michael Ross", "course": "HIST131", "review": "Honestly one of my favorite professors when it comes making the content interesting and engaging. You can tell he is really passionate and knows what he's talking about and it translates to the lectures. There were a decent amount of readings from various books you need for quizzes and discussion but with a bit of searching you can find a free online copy of every book. He was also pretty transparent with what you needed to know to be prepared for the quizzes and discussions with the guiding questions. Exams can bit a intimidating with the amount of IDs but if you go to lectures, take some time to study, and go to the TA review sessions you should be fine. My only two critiques are that the term paper can be a bit of a drag if you aren't readily able to get your hands on the information needed to complete it and I wish that he would've recorded lectures or at least posted the slides because a lot times I might have missed something in my notes and it would have been nice if I could go back and fill in the holes. Overall though a very good teacher and pretty good class.", "rating": 5, "expected_grade": "A-", "created": "2023-05-11T02:33:21.144421Z"}, {"professor": "Michael Ross", "course": "HIST131", "review": "I highly recommend HIST 131 if you are looking for a history gen ed. I loved Dr. Ross - he was very engaging in lectures, and I found the class material to be genuinely interesting. You only really get a few grades for the semester: 2 book quizzes, the midterm and final exams, a participation grade for discussion, and the term paper (only 6-7 pages). \r\n\r\nThe midterms and finals are set up similarly to AP history exams, but with only short answer prompts and long essays. If you took APUSH in high school, the exams are a breeze. Dr. Ross gives a study guide of topics before the midterm and final exam, and essay prompts are almost verbatim from the study guide. I found it to be easy to get a good participation grade in the weekly discussion as well -  most of the discussion topics came straight from lecture notes, and I was able to participate thoroughly in discussions most weeks without reading the assigned readings (granted, I skimmed the readings and read summaries). For the term paper, we researched the ancestry of two families, which I found to be a genuinely fun essay to write. \r\n\r\nOverall, I felt that the coursework was not overwhelming (especially as an engineering major), and HIST 131 was a very worthwhile class to take.", "rating": 5, "expected_grade": "A", "created": "2023-05-13T14:53:03.076369Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "I loved Dr.Ross for HIST134. I am not a history major but was always totally engaged in lecture and was able to keep up with what was going on. There are little to no grades for the class just a few book reports and a few exams which are pretty easy to take if you pay attention and come to lecture. TAKE THIS CLASS!!!!", "rating": 5, "expected_grade": "A", "created": "2023-09-18T01:28:57.918861Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "He was a pretty entertaining lecturer and great at telling the stories about the course content. The grading system was absolutely WILD  in this class. The TAs were harsh graders on the exams and in discussion participation for no reason this is a 100 level class. If you want an interesting class take it. If you want an A you might have to work hard on the exams, papers, and participation to get that grade.", "rating": 3, "expected_grade": "", "created": "2023-10-03T00:34:47.411807Z"}, {"professor": "Michael Ross", "course": "HIST131", "review": "One of the best classes I've taken and one of the best professors I had. Professor Ross makes his lectures so engaging and interesting. I took this class as a gen ed and it's definitely the best gen ed I've taken. There was a midterm and a final plus a few quizzes, all of which were short answer, but not difficult by any means. Take this class just for the professor at least!", "rating": 5, "expected_grade": "A-", "created": "2023-11-09T02:03:31.498377Z"}, {"professor": "Michael Ross", "course": "HIST134S", "review": "Professor Ross makes all of the information super interesting. He always comes to class prepared, and there are no extra assignments. The midterm and final are a lot of studying, but all of the information is taught directly in the class with no surprises. I would highly recommend this class with Professor Ross", "rating": 5, "expected_grade": "A+", "created": "2023-11-14T15:29:42.364745Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Dr. Ross is an exceptional professor. He is engaging, thorough, and super passionate. You can really tell he loves what he teaches. This class is very laid back! There are only a few assignments you have to turn in throughout the entire semester, the rest of your grade is based on exams and discussion points. I 10/10 recommend this course!! The subject matter is super interesting and its an easy A!", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T01:33:53.591342Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Love this class and love Dr Ross. There were two short (three page) papers, a midterm, a final, and graded discussion each week. His lectures are so interesting and he really seems to care about each students' understanding of the content. He doesn't record lectures or post any of his notes which is annoying, but as long as you're paying attention it is pretty easy to keep up during class.", "rating": 5, "expected_grade": "A-", "created": "2023-12-09T00:14:13.024405Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "This class was a good gened to take. You need to show up to every lecture because he doesn't post the slides and it's really important information. There is a lot of assigned reading but if you skim it it's fine, you just need to know most of it to be able to talk a couple times in discussion. Also, Dr. Ross is hilarious and is passionate about the trials. Overall, take this class it's great.", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T17:18:26.102254Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Professor Ross is one of my favorite professors at UMD so far! I definitely plan on taking another course with him in the future. His lectures are very engaging and he genuinely cares about students' learning and benefit from his course. I took this class as part of my history major but also feel that it's an excellent choice for anyone looking to get a Gen Ed credit or just take it as an elective.", "rating": 5, "expected_grade": "A", "created": "2023-12-14T22:45:02.540015Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "If you need any gen eds covered and this class fits into them, I would highly recommend taking it. The course work is very light and the topics are very interesting. Attendance isn't required for lecture but I still went to all of them because Dr. Ross teaches in a very engaging and interesting way which made class enjoyable. He doesn't record his lectures which can be annoying, but in the end I think is better because the mid term and final quiz you on things from lecture. \r\nDr. Ross is a really entertaining guy with a good sense of humor. You can tell he is a very passionate about what he teaches because he will give great detail about the trials. \r\nHighly recommend this class BUT make sure you study well for the midterm and final because there are only 4 grades for this class which include those and 2 essays.", "rating": 5, "expected_grade": "A", "created": "2023-12-15T17:23:06.101542Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Definitely the most entertaining and engaging lecturer I've had so far at UMD. He teaches HIST134 really well. One thing that was weird about this class is that there are only 5 grades for the semester: Discussion grade, two essays, and two exams. One thing that ticked me off was that the lectures aren't recorded, and I did sleep through a lot of them. The exams were a bit difficult because of the quantity of IDs but it was doable. Discussion participation is pretty crucial in this class and there are a lot of readings, but if you just pay attention during lecture and skim through the documents, you should be fine. Shoutout to TA Ashley, she was a fair grader and gave opportunities for extra credit, which helped bump my grade up from an A- to an A.", "rating": 4, "expected_grade": "A", "created": "2023-12-20T03:44:09.647582Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Dr. Ross himself is an amazing professor. He makes his lectures super engaging and is genuinely passionate about the subject! However, he does teach at a very fast pace. So be prepared for that! \r\n\r\nPLEASE NOTE, the lectures are NOT recorded and the presentation slides are NOT posted. He does this so that students don't skip the class. I accidentally overslept once and missed a lot. I almost felt like I was done for. That's one thing I didn't like...but I understand why he does that. :(\r\n\r\nThere are two essays, a midterm, and a final. The first essay I didn't read the book and got a B. The second one I read it and got an A+. That is to say, you'll get the grade that corresponds to the effort you put in this class. Especially with the fact that there are only 4 graded assignments apart from the discussions, make to study well! Don't think this is an \"easy gen-ed\", but it's an interesting one for sure! \r\n\r\nI will add that the GTA you have really makes the difference. I LOVED the GTA for my section. SHE WAS AMAZING. I never considered myself a history person, but she and Dr. Ross made the course a fun break between my STEM classes. :)", "rating": 5, "expected_grade": "A+", "created": "2024-01-13T18:49:03.236905Z"}, {"professor": "Michael Ross", "course": "HIST134", "review": "Professor Ross was so amazing! He was my favorite teacher this semester since his class always felt like story-time rather than a lecture. He liked to engage the students. The content is so interesting and I am not a history person! Very straightforward midterm and final. My TA (Chloe) was so helpful and was so prompt with responding back to emails. I would 100% take the class over again!", "rating": 5, "expected_grade": "A+", "created": "2024-01-20T01:28:06.872887Z"}], "name": "Michael Ross", "slug": "ross_michael"}