{"courses": ["AASP298L", "ENGL101S", "ENGL101", "ENGL234", "ENGL344", "ENGL132", "ENGL101A", "ENGL101H", "CMLT398C", "ENGL329A"], "average_rating": 4.5714, "type": "professor", "reviews": [{"professor": "Mike Kolakoski", "course": "ENGL101", "review": "Very smart and pleasant guy. Always willing to meet with students and a rather lenient grader. Also, he cancels class quite often which is nice if you can get your work done without meeting in person every week. Definately one of the better professors for this course.", "rating": 5, "expected_grade": "A", "created": "2022-05-30T01:33:21Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101H", "review": "Really nice, and gives decent feedback. Wouldn't say he is an above average professor, but he does make an effort for his students. I would totally recommend taking class with him. His grading tends to be fair, and he does value students who seek out help (like he is more sympathetic to your grades if you tried to get help), so if you take his class go to office hours and the writing center. However, he does not believe in giving 100% on essays. With that said, he does pack his ENGL101H classes with a lot of easy participation points (that does mean there is some busy and pointless work) which helps with grades.", "rating": 4, "expected_grade": "A", "created": "2022-10-28T20:13:24.054428Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101H", "review": "This guy is pretty cool. Fair grader and gives good feedback. As a STEM major, I'm happy with my English 101 experience. Part of this is because he canceled class at least once a week, which was perfect for me. He is very nice. Lots of work but that could be because I accidentally signed up for an honors section.", "rating": 4, "expected_grade": "A", "created": "2022-12-06T05:27:48.633630Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101H", "review": "Very nice and chill professor. He cancels class very often which is nice. You can do all his work online so you honestly don't really need to go into class. Fair grader and won't give you below an A as long as you do your work. He is always willing to meet to go over essays. Take him if you get the chance.", "rating": 5, "expected_grade": "A", "created": "2022-12-09T03:58:01.990934Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101H", "review": "Very good professor. Fair grader and gives good feedback. Never gives 100% on major writing assignments but I've never gotten below a 95% because his expectations are so clear. A lot of pointless busy work but it helps with easy grades to boost your overall grade.", "rating": 5, "expected_grade": "A", "created": "2022-12-10T02:22:48.137825Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101H", "review": "I would highly recommend him if he teaches ENGL101H again. As others have said, the class was canceled at least once a week, if not more. This was great, and it allowed me to focus on other classes. I feel that he takes into consideration that he is not the only professor students have, and lets his students know in advance when the workload will be heavier. He is a fair grader, and his comments on major writing assignments are helpful. Overall a great guy.", "rating": 5, "expected_grade": "A", "created": "2022-12-22T20:20:42.095907Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101H", "review": "This man is an angel. I never got below a B on any of his assignments. His rubrics are so clear and his assignments are supplementary to the major writing assignments we do. Also, this man literally canceled class once a week. Ill be like completely honest, I had this class MWF, but out of all the 16 weeks I had him, I never had a single week where there was class all three days of the week. It was beautiful", "rating": 5, "expected_grade": "A", "created": "2023-01-01T02:15:34.492414Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101S", "review": "He is a great professor, but some of my friends who have him found it a little strange that we're not meeting in person for class a lot of the time. Personally, I took advantage of that time and either caught up with assignments or just hung out on McKeldin Mall or in Eppley. During class and on Zoom meetings, he is a good lecturer and provides great feedback, but I found him to be a rather tough grader.", "rating": 4, "expected_grade": "A", "created": "2023-03-08T02:34:47.992252Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101S", "review": "The course is not challenging and Professor Kolakoski is a good professor and will give you help. Only thing is that he basically runs his class asynchronously. This semester we maybe had 4 actual classes. If you prefer an in person class than this probably is not for you.", "rating": 4, "expected_grade": "A-", "created": "2023-05-17T05:26:28.874907Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101S", "review": "He is a great guy! It's clear that he is knowledgeable in the field of English and rhetoric. I like the activities that he made us do because they were individual steps in which we were able to almost \"finish\" the final product for each unit by the time it was introduced to us. Like what the comment below me mentioned, it was a bit odd that we had less than 10 in-person meetings, but the class moved along fine with asynchronous itineraries.", "rating": 4, "expected_grade": "A", "created": "2023-05-26T06:39:12.448216Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101S", "review": "Dr. Kolakoski is great. He is very helpful and always available for questions. He is also accommodating in that he hears your opinions on due dates and often makes small changes. A lot of his classes were cancelled or asynchronous, but if you treat it as extra work/sleep time you will do very well in his class. The class has 3 major papers, a website, and a final reflection. It was manageable and did make me a better writer.", "rating": 5, "expected_grade": "A", "created": "2023-12-02T04:05:46.740659Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101S", "review": "A great professor! He was very accommodating. He is kind and is welcome to any feedback or questions students have. Quite an easy grader and cancelled class almost at least once a week (which did not affect my understanding or grade at all, was a positive).", "rating": 5, "expected_grade": "A", "created": "2024-01-04T01:54:31.317420Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101S", "review": "Dr. Kolakowski:\r\nOverall, he seems like a nice guy, but I found his in-class time to be used ineffectively. There was no real content he taught in class, and if there was anything important, he would make a recording on it. However, he is very lenient of grades and is flexible with submission dates.\r\nENGL101S:\r\nI look AP English Literature and Composition in high school (scored a 2), so I found this course to be a recap. There are a lot of assignments/essay checkpoints that have required dates, but as long as you stay on top of it, this course shouldn't be too bad. However, I dread writing about topics I could care less about (I'm a STEM guy), so put off assignments and it took days of procrastination to write the essays (depending on your professor, there are about four). I think if you took a non-scholars ENES100, there would be less small assignments, but I am unsure. Overall, not a class for me (I'm glad it's over), but not a difficult one either.", "rating": 4, "expected_grade": "A", "created": "2024-01-08T16:41:03.377069Z"}, {"professor": "Mike Kolakoski", "course": "ENGL101S", "review": "Very knowledgeable about rhetoric - his grading is fairly lenient and as long as you put effort into your essays and assignments you should be fine. Just make sure that you are staying on top of assignments and not falling behind on certain deadlines as the papers build on top of previous activities", "rating": 5, "expected_grade": "A", "created": "2024-01-24T16:45:58.539140Z"}], "name": "Mike Kolakoski", "slug": "kolakoski_mike"}