{"courses": ["ECON201", "ECON317", "ECON201", "ECON317", "ECON201", "ECON317", "ECON201", "ECON317", "ECON201", "ECON317", "ECON201", "ECON317", "ECON201", "ECON305", "ECON317"], "average_rating": 3.25, "type": "professor", "reviews": [{"professor": "Naveen Sarna", "course": "ECON317", "review": "Sarna is boring and talks quietly. I found it very difficult to pay attention in class. He posts all of the slides online and the review slides closely correspond with the exams. Because of this, most people didn't come to class except to give their presentations. There is no homework except for a big presentation/group paper, which he grades leniently. DO NOT BUY THE BOOK. He never uses it. This course is a glorified intermediate macroeconomics course. Although I did not like Sarna's teaching, he is very helpful and cares about what he is saying. If you can bring yourself to come to class and pay attention, you'll probably do fine.", "rating": 1, "expected_grade": "B", "created": "2016-05-16T23:45:00Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "Professor Sarna is by far the best teacher I have had at The University of Maryland, he does an excellent job making sometimes challenging concepts about ECON easy to understand, he goes over concepts multiple times and draws out tons of examples.  Further, he is very responsive to students needs, for example he made us a mock exam and the TA's gave it too us in class for each exam and that was insanely helpful and was similar to the questions on the regular exam.  In addition he has review sessions in class.  The only thing I would recommend is that you sit in the front because he writes on the board a lot and is hard to see in the big lecture hall.  You cannot rely on the power points in order to get an A because the on board examples is where you do a lot of learning.  Excellent teacher, take him not Neri! ", "rating": 5, "expected_grade": "A", "created": "2016-05-05T15:38:00Z"}, {"professor": "Naveen Sarna", "course": "ECON317", "review": "I took this class my senior year at UMD and I wish I had taken it earlier. Sarna's class is one of the few econ classes where i learned concrete info about how world economics work and allowed me to understand and easily interpret changes in the world economy or even simply reading the WSJ or the Economist. Its not an easy A as his tests are tricky and are often frustrating because of hazey wording. However, the material itself is straightforward once you understand how the different variables effect each other. I learnt the most about actual econ in my entire time at UMD in this class, instead of just how to move curves around and take derivatives. Also econonmetrics with Vlaicu is a great class but im not sure he teaches at umd anymore. anyways, take this class, study hard, you will be grateful once you graduate. also keep the textbook its helpful for me to refer to sometimes to brush up my knowledge. this class should be required after econ 200/201. and it should be broken up into two classes so as not to cram so much into one semester and allow time to really drill the concepts in.\n", "rating": 4, "expected_grade": "A-", "created": "2015-07-06T18:24:00Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "Made the class very easy to understand. One of the best professors I've had so far. He is very knowledgeable in economics. Explains concepts simply and makes sure students understand the fundamentals. Exams were fair", "rating": 5, "expected_grade": "A", "created": "2015-06-29T18:43:00Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "Just got  my grade for the class and wanted to write a review for Professor Sarna because he definitely deserves one.  \n\r\nEconomics is my major so I'm very into the material. Lectures were enjoyable for me. Professor Sarna knows his stuff. He teaches in a manner that forces you to understand the models and apply them when tested. He doesn't want his students to memorize and then just regurgitate the material come exam time. And his teaching style reflects that. He is VERY approachable and very nice. He really wants his students to understand the material and do well in his classes.\n\r\nI didn't go to a single discussion and found that reading the chapters in the book prior to lectures was very beneficial. Midterms and the final averaged B/B- for the class. Final grade was curved by 3%. \n\r\nFairly easy class though it will require some diligence as it is a 4 credit class. Bottom line if you have to take ECON201 take it with Professor Sarna. He is an excellent professor.\n\r\nUpdate: I took his ECON317 policies class. He has to be one of the best econ professors I've had. He has lots of real world experience and he brings that knowledge into the classroom. Great lecturer, great class. The class does require considerable effort though if you want an A. ", "rating": 5, "expected_grade": "A", "created": "2015-02-13T02:09:00Z"}, {"professor": "Naveen Sarna", "course": "ECON317", "review": "He really knows what he is teaching and wants students to learn things for the real world. He is a nice guy and very approachable. It was hard for me to get an A because I am not a great test taker. There is 2 quizzes, 2 exams(MCQ & short answer), group projects, 6 article summaries (easy). He is straight forward on what exactly he tests on.", "rating": 4, "expected_grade": "B", "created": "2013-05-02T14:46:00Z"}, {"professor": "Naveen Sarna", "course": "ECON317", "review": "Dr. Sarna is definitely in my top list of professors at UMD. He really makes the material very interesting and explains the material very well. He is an absolute genius when it comes to economics and turns explains material with easy to understand stories. I would recommend this professor!!! ", "rating": 5, "expected_grade": "", "created": "2012-05-20T02:05:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "One of the best professors I've had at UMD. He explains very complex charts and relations in a very simple manner that makes them seem common sense. He tries to make lectures enjoyable and is very good at what he does. The book is not that boring either so if you get lost, reading up won't be too bad, although the book isn't absolutely necessary because his slides are very good", "rating": 5, "expected_grade": "A", "created": "2012-03-27T00:39:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Best econ class ever. he is funny, explains the material in a very comprehensible manner, and the tests are very very very easy... as long as you have actually somewhat paid attention to lecture/read the text book you'll do just fine. the only problem was the aplia problems. i thought they were more difficult than the exam questions but when i went to get help the TAs weren't allowed to answer our questions. ", "rating": 5, "expected_grade": "", "created": "2012-02-03T23:22:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Sarna is a great professor but the class is difficult.  He's very approachable and will go to every length to help a student.  He relates the class to real life and keeps it interesting.  However, the TAs are absolutely useless.  I went to discussion once and it was a true waste of time.", "rating": 4, "expected_grade": "B", "created": "2012-01-10T02:37:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Great professor. Really no complaints. Clear explanations, clear powerpoints, easier tests than the other sections (i think). Wants everyone to do well and he tells us that he is our \"friend\". Has a slight accent which may be unclear at times but just listen carefully and you will be fine. If you need to take micro definitely take Sarna. \n\r\nI actually ended up with a B in this class but that's because I stopped studying the material towards the end of the final. THat was a mistake. If you keep up with the material there is no reason why you should get less than an A. ", "rating": 5, "expected_grade": "A", "created": "2011-12-25T15:27:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Sarna is a really great professor! Unlike other professors I've had in the past, he really cares about how well his students do in the class and wants them to really understand economics. \n\r\nI ended up getting a C+ in the class (78!!) because i get really bad test anxiety but thats a whole other issue. \n\r\nIf you take your time with the course and look at it simplistically (microeconomics is a pretty simple subject that can get confusing if you think too much about it)you should do fine. His exams are not even directly from any readings from the textbook so mainly pay attention in lecture and/or go to his office hours you should get a B or higher.\n\r\nThe only thing I didnt like was that the other class got to do an extra credit assignment and we didnt! It probably would have brought my borderline C to a B. ", "rating": 5, "expected_grade": "B", "created": "2011-12-20T13:11:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Professor Sarna has a great sense of humor! For Micro, it wasn't really necessary to go to lecture though, because he posts his lecture powerpoints online after class, and they include information that's all in the textbook. \n\r\nHe genuinely cares about his students though! On the first exam, I guess many people didn't do very well, so he dedicated twenty minutes of the next lecture asking the lecture (of over 200) what could make a difference for them on the next exam. We also have mock exams before every exam.\n\r\nHe was a little rude a few times when people asked questions in class, but I think it was mostly unintentional. Overall, good professor and easy class!", "rating": 4, "expected_grade": "A", "created": "2011-12-09T22:33:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Awesome professor, awesome class. Challenging at times, but it's really not that hard at all as long as you keep up with the content. All the topics build upon each other as you progress through the course so just make sure to keep up. Sarna is great at teaching and I definitely learned a lot. If you have an interest or need the course, take it.", "rating": 5, "expected_grade": "A", "created": "2011-12-01T15:15:00Z"}, {"professor": "Naveen Sarna", "course": "ECON317", "review": "If you are not familiar with macro concepts this class might be a little tricky for you. There were 3 quizzes, a midterm, a paper/presentation, and the final. Paper/presentation was easy, around 20 pages split between 4 people and a presentation that lasts ~20 minutes. \n\r\nHe explained things clearly and kept things relevant, using the first few minutes of class to discuss world economic events and how we could use what we've been learning to explain what's going on. Funny guy too. Be prepared to put in a good amount of time for the class, there's a lot of info to cover/understand.", "rating": 4, "expected_grade": "B", "created": "2011-05-20T09:37:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "The material is straight forward and he follows the textbook very closely.  I definitely would have skipped lectures if another professor was teaching but he's too funny.  If you actually listen to his lectures, he's a really funny guy, although not always intentionally.  For the first few weeks, he somehow managed to mention Georgetown cupcakes in every lecture.  If you need to take an econ course and he's teaching it, definitely take him!", "rating": 5, "expected_grade": "A", "created": "2011-02-01T23:06:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "How well you perform in this class depends on how much you understand the concepts presented in the lectures. Therefore, attending class is mandatory. Having said that, this class will teach you a lot of things about the world of economics and how they relate to every day's life. \n\r\nThe professor is nice and knows his material. He has an accent but that factor will not stop you from learning what you need to. The power points slides are equally helpful in explaining concepts that are difficult to understand. \n\r\nDiscussions in general are optional. The professor encourages students to attend discussions but I find them very boring and merely reiteration of the concepts the professor has talked about during lectures. Nevertheless, if you don't understand something in lecture, come to discussions for clarification.\n\r\nYou will have several problem sets during the course which will be online. I suggest you start them early as some questions might take up a bit of time. The course has a midterm and a final, they are straightforward and cover the topics have been talked about during lectures. \n\r\nI personally recommend this class because it can be very interesting once you understand the concepts and able to make the connections from the classroom to everyday's life.", "rating": 4, "expected_grade": "B", "created": "2010-12-29T02:21:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Professor Sarna was a great teacher. For my first time taking Economics, I definitely learned a lot and it was not at all difficult. In this class, we had homework every other Sunday and only 2 tests throughout the year and one final. The final wasn't cumulative. All of his lecture slides are online. I never went to discussion because I didn't need to because he taught everything well in class. This class did not give me any stress.  Definitely take him for Economics!!!!!", "rating": 5, "expected_grade": "", "created": "2010-12-12T02:59:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Professor Sarna was great for my first experience learning economics. He explains the material clearly, and always adds in little jokes to keep the class intresting. All the matrial can also be learned from reading the textbook and reviewing his powerpoint slides which he posts online, so its not a big deal if you miss a class or space out. His tests are very fair and if you understand all his powerpoints, you will do fine. I'm definitely taking him for ECON201 next semester. Discussion is pointless. I only went once this semester. ", "rating": 5, "expected_grade": "A", "created": "2010-12-02T21:57:00Z"}, {"professor": "Naveen Sarna", "course": "ECON200", "review": "Professor Sarna did a great job of making economics interesting and understandable. He takes difficult concepts and breaks them down into simpler analogies that are easier to understand and relatable. His tests are generally 45 multiple choice questions and very straightforward. He genuinely wants everyone to do well. In addition to the tests there are online assignments through aplia every other week which are worth 25% of the your grade. These are also generally very straightforward and it is not hard to do well. He posts all his lecture slides online, and his lectures follow the textbook. I really enjoyed going to lectures. Overall i really enjoyed this course and would highly recommend Professor Sarna. ", "rating": 5, "expected_grade": "A", "created": "2010-12-02T18:29:00Z"}, {"professor": "Naveen Sarna", "course": "ECON317", "review": "Professor Sarna explains economic models with simple analogies that help you better understand them. I wish I had him for 200 and 201 rather than bad lectures. The material I failed to learn in my fundamental courses, he reviews in class. He curves at the end. There is a presentation and paper that is easy. If I did not have a heavy schedule, I would have received a B in his class. There are 2 quizzes 1 midterm 1 project (presentation & paper) and 1 final. He's not as boring as other economic professors, which is a plus. He has a slight accent but it does not affect his teaching style/ability. Overall I enjoyed the course.", "rating": 4, "expected_grade": "C", "created": "2010-06-01T14:16:00Z"}, {"professor": "Naveen Sarna", "course": "ECON317", "review": "REALLY easy to not pay attention, but you have to try. Don't take unless you have a solid macro background", "rating": 4, "expected_grade": "B-", "created": "2018-05-16T02:45:05Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "SO BORING. It is honestly impossible to pay attention in this class. When I was able to pay attention he was a good teacher but just brutal for a long lecture. You're signing up to teach yourself the course. ", "rating": 3, "expected_grade": "D+", "created": "2018-05-22T23:36:35Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "Easy material in general, I knocked a star off because his lectures can be rather dry, and you have to sit in the front of the class to understand his graphs. With that said he's funny and gives interesting analogies related to real life economics. The material isn't difficult, and he doesn't complicate the material making it a relatively easy class.", "rating": 4, "expected_grade": "B+", "created": "2018-09-06T16:53:05Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "Kind've a GOAT, makes a lot of jokes about food. Hard to pay attention in class though, ended up using the textbook ", "rating": 5, "expected_grade": "B+", "created": "2020-05-16T04:13:54Z"}, {"professor": "Naveen Sarna", "course": "ECON317", "review": "A great prof. Lectures are kinda boring but he cares about students and willing to answer questions. The final is hard. I thought I can get an A but I end up with B+ so study hard before exams. ", "rating": 5, "expected_grade": "B+", "created": "2020-10-12T22:11:29Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "Such a good professor, only a few assignments per semester, and the exams are very fair. Lectures can be a little boring, but overall a great professor! Take him", "rating": 5, "expected_grade": "A", "created": "2021-04-29T15:31:04Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "Excellent professor. Economics is not exactly my main area of interest, but Sarna's lectures were engaging, and he did a great job explaining things in a relatable and understandable manner. The only criticism I can think of is that he had trouble understanding students' questions, but he always did his best to answer them.", "rating": 5, "expected_grade": "", "created": "2022-03-24T01:21:47Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "literally 8 assignment the entire semester, lectures are slow and then when he finally puts information on the board to takes notes of, he clicks by it too quick to take notes. He poorly prepares students for the exams and overall just doesnt give students enough content to review. I BEG YOU PLEASE DONT TAKE SARNA! YOU WILL REGRET IT.", "rating": 1, "expected_grade": "A-", "created": "2022-03-25T02:37:46Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "He gives boring, sleep inducing lectures that do very little in preparing you for the exams. I am a straight A student that came up short in his class because of his lack of effort. He did little to help us prepare for exams, giving s a half baked mock exam that reflected NONE of the themes of the actual exam! I have only ever had ONE bad teacher before in my scholastic career, Naveen Sarna has increased that number to 2! Avoid him!", "rating": 1, "expected_grade": "B+", "created": "2022-03-25T02:38:03Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "Everyone's reviews are very bipolar, either saying he is very engaging or very boring, and that he is both a bad and good lecturer.\r\nI took his class this semester, and have friends who also took his class. Here are my thoughts, coupled with theirs as well:\r\n(1) Sarna can be EITHER boring or engaging, depending on your attention span and willingness to focus. \r\n(2) He gives EVERYTHING needed for exams and your success (anyone who says otherwise just didn't use the resources presented to them).\r\n\r\nTo address (1), if you have a short attention span, you'll have to pull yourself up by your bootstraps. For me, I thoroughly enjoyed his lectures, and thought he was quite engaging. He has a slight (Indian) accent – which doesn't inhibit his ability to lecture!! – but his tone is soft and rather monotonous, so it is easy to lose focus espeeeeeciiially if you use a computer for notes. While I indeed liked his lectures, I also cannot count the amount of times I got sidetracked playing tetris. Side-note: he isn't monotone in a way that suggests he's not passionate about his course (the reality is the opposite), and he makes subtle jokes here and there.\r\n***My biggest suggestion is if you get distracted easily,*** take notes on a notebook and don't worry about making them look pretty. Sarna gives EVERYTHING you need on his powerpoints, which are all linked in Canvas; but he doesn't link the drawings and figures he puts alongside the powerpoints, which can be helpful for review (hence why notebooks are also good, since you can scribble the figures down). \r\n\r\nAs for (2), do not underestimate the class content. I took this class as a gen ed, and came in thinking I wouldn't have to ever review content. This was absolutely wrong, and I was surprised & disheartened at my first exam score. Understand the big-picture concepts, and memorize the equations. As with what the other reviews said, his exam review materials aren't great. His mock exams don't reflect the real exam at all, but I was lucky to have helpful TA's who made a mock exam that I believe will help me on the upcoming 2nd exam. Again, his EXAM REVIEW materials suck. NOT the powerpoints, which you can easily use as review material.\r\n\r\nTry to attend class IRL, and not over Zoom (which he gives an option for at the same hour). If you attend his lectures over Zoom, you can't ask questions since he mutes the students and doesn't look at the chat since he's in-tune with the IRL classroom.\r\n\r\nOverall, a good class. 7 homework assignments (the lowest 2 are dropped), 2 midterms, and a final. Lightly study, and don't be afraid to ask Sarna for help. Good luck!", "rating": 4, "expected_grade": "B+", "created": "2022-04-12T18:22:06Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "Really boring lectures. Very slow moving class. I had to teach myself everything, but if you put in the work you can get a decent grade.", "rating": 3, "expected_grade": "B+", "created": "2022-04-27T21:35:31Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "While there is very little homework and readings assigned, lectures are very unhelpful and exams can be tricky with wording and graphs. I found that not attending class and understanding the textbook well was what allowed me to get by, but I would recommend taking another professor if you actually want to learn the material.", "rating": 2, "expected_grade": "A", "created": "2022-04-28T18:18:57Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "Dont take Sarna, Shea seems to be the better option. Sarna gives boring, monotonous lectures. He really does not seem to care. Mock exams and review materials are half baked and don't reflect whats on the exam what so ever. He's probably tenured so I doubt he really cares at all. ", "rating": 2, "expected_grade": "", "created": "2022-05-17T18:23:40Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "DON'T TAKE SARNA. Just don't. He isn't a great teacher for this class - his lectures are quite boring and he also doesn't really prepare us well for the exams. The mock exams also don't help. ", "rating": 1, "expected_grade": "C", "created": "2022-06-23T14:56:14Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "No one ever went to his lectures. Very boring and gives no information in class. He repeats the book content but more vaguely during class. His test info sessions are useless as well. Few exams throughout and they were all in-person, multiple-choice tests on paper. Much more difficult than the content he talks about. I would definitely recommend really understanding the macro econ concepts before taking the exam. They're not that difficult tbh just a bit confusing. The class was very boring though. Only read the book content. No assignments except for an occasional online bookwork that was graded for correction.", "rating": 2, "expected_grade": "A-", "created": "2022-07-25T13:20:18Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "horrible teacher. So slow, quiet, monotone, and boring. He rambles on about random topics not related to class like goldy locks (not kidding). I have not been to a single class since early October (it is finals week now). I teach myself everything from the textbook. I am expecting an A-. It is not too difficult of a course but requires so much outside effort because Pr. Sarna is so bad. Avoid him at all costs if you can!", "rating": 1, "expected_grade": "", "created": "2022-12-15T02:23:31.508438Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "Just not good at teaching. His practice exams are super short and have little representation of the actual exams.", "rating": 1, "expected_grade": "", "created": "2022-12-21T16:33:50.766358Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "He is an incredibly smart and nice man. But his skills as a professor are lacking, especially with the content of the lectures lining up with the textbook and the test materials. Exam reviews were not helpful in any manner and were hard for students to stay focused and engaged in lectures, so a ton of people opted out. I am retaking this course currently and the content I am receiving in this lecture/ textbook is worlds different from what was given in Sarna's lecture. Again, great man, but bad teaching style/ set up.", "rating": 1, "expected_grade": "C", "created": "2023-01-04T21:28:21.938322Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "Dr. Sarna gives very long winded explanations and makes everything appear more complicated than it is. I was way more successful in this class when I had to thoroughly teach myself all of the concepts and not even look at class notes. Learning it myself made everything more simple than his explanations! Exams weren't too difficult if you understood the material but it took a lot of effort outside of class.", "rating": 2, "expected_grade": "A-", "created": "2023-04-26T23:12:37.068024Z"}, {"professor": "Naveen Sarna", "course": null, "review": "too few assignments and a lot rides on doing well on them. he has basically no study materials and it is very hard to prepare", "rating": 1, "expected_grade": "C-", "created": "2023-05-02T20:11:43.358740Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "I'll echo what many people have said about Dr. Sarna - he is a wonderful person and this is nothing personal with him at all. He simply isn't a great professor. His lectures are unengaging and went a bit too fast for my liking. He tries to teach the concepts of macroeconomics but does not do a good job with it - while his anecdotes/examples can be funny, they can also be irrelevant and make concepts actually harder to understand. I find that he tiptoes around the true definitions/rules of macroeconomics that could be made much more simple. I would definitely recommend taking another professor if possible or even completing economics at another institution because I know that UMD doesn't have great reviews for a lot of undergrad economic courses/professors.", "rating": 2, "expected_grade": "B+", "created": "2023-05-04T15:27:01.602860Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "The Econ department in general isn't that great here, and this is just another example. Lectures were not engaging at all, you pretty much learn all the material on your own. Also he doesn't assign a lot of work, so grades are heavily relied on exams. However, with such a heavy weight on exams, multiple practice exams would be expected. However, he gives you half of a practice test. Avoid Professor Sarna if you value going to class and understanding the material.", "rating": 1, "expected_grade": "C", "created": "2023-05-15T01:39:07.224731Z"}, {"professor": "Naveen Sarna", "course": "ECON317", "review": "Provide no study materials to prepare for the exam. He posted PowerPoint slides way later so that lecture material faded out. He lacks clarity as a professor, and I wouldn't recommend him to anyone.", "rating": 1, "expected_grade": "C", "created": "2023-05-18T00:59:57.289956Z"}, {"professor": "Naveen Sarna", "course": "ECON201", "review": "He's a nice professor but his lectures are absolutely terrible. He would take at least 3 class periods to get through two topics and the lectures would just not be engaging enough. The exams are a huge part of the grade and there isn't enough hws and other grades to balance things out. TAs and him would not allow for the posting of the slides before the class or even after and would be posted a while after the specific lecture which was annoying and again not helpful to understanding the material while it was taught.", "rating": 1, "expected_grade": "C+", "created": "2023-09-30T05:10:19.134086Z"}, {"professor": "Naveen Sarna", "course": "ECON317", "review": "Professor Sarna is a really great guy and INCREDIBLY knowledgeable. Unfortunately, he isn't the best professor. What doesn't help is the fact that half of our lectures across the entire semester were allocated to presenting group projects on our \"research\" findings of other countries' economic climates. Mind you, the first presentations started only a few weeks into the semester and took up an entire day in a 2x/Week course. \r\nBecause of this, instead of learning about macroeconomic concepts from a man who has worked at the World Bank, and lived firsthand what he is supposed to be teaching, we get to listen to quarter-baked presentations from our peers who haven't even learned enough to create comprehensive presentations because it is so early in the semester. \r\nBefore the exams, you will be lucky if he shares any tailored review materials, for the first exam and final it was only 2 or 3 PowerPoints were all that we got. There were only 2 days of lectures dedicated to material that would comprise the majority of the final. \r\nThere are only, Participation, Exams 1-3, a simulation exercise (1 in-class activity), and the group presentation. Group presentation is graded leniently\r\nA curve of an unknown amount was applied to the end-of-semester grades.", "rating": 2, "expected_grade": "A", "created": "2023-12-21T04:31:19.151609Z"}, {"professor": "Naveen Sarna", "course": "ECON317", "review": "Legit one of the worst professors I’ve had at UMD, class is so boring, he’s not great at explaining the concepts covered and there’s not even close to enough grades, the 1st exam is easy bc there’s great study material out there for it but the 2nd 3rd and final exams are insanely hard. Avoid at all costs!", "rating": 1, "expected_grade": "D+", "created": "2023-12-26T18:04:04.741432Z"}, {"professor": "Naveen Sarna", "course": "ECON317", "review": "Sarna is so beyond boring about a subject that could really be interesting. There are very few graded assignments over the course of the class, and the ones that aren't impossible tests are decided arbitrarily- like the simulator which he did not explain then just chose grades with barely any explanation for why. DO NOT TAKE", "rating": 1, "expected_grade": "B", "created": "2024-01-16T03:13:33.959265Z"}], "name": "Naveen Sarna", "slug": "sarna"}