{"courses": ["BSCI170", "BSCI207", "BSCI370", "BSCI207", "BSCI150", "BSCI207", "BSCI170", "BSCI370", "BSCI207", "BSCI207", "BSCI151", "BSCI170", "BSCI370", "BSCI170", "BSCI207"], "average_rating": 4.8036, "type": "professor", "reviews": [{"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Very good professor. His lectures are very interesting and thorough. Exams are based on lecture material and have a reasonable level of difficulty. Also he’s a nice guy!", "rating": 5, "expected_grade": "A", "created": "2020-10-04T21:15:04Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "He's a very good professor, and is really helpful during office hours and answers questions. His lectures and lecture notes are thorough and prepare you well for exams. His exams are relatively easy, as long as you keep up with the lectures you'll be fine. ", "rating": 5, "expected_grade": "A+", "created": "2020-12-03T23:03:14Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Super nice, broke lecture videos into parts so they weren't too long, also gave a survey for extra credit", "rating": 5, "expected_grade": "A", "created": "2021-01-26T02:19:34Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Great professor with interesting and easy-to-follow lectures. Dr. Fletcher's exams are not too difficult and if you watch all the lectures as well as take good notes, you should be fine. He also has some really cool pets that he shows on the zoom calls sometimes :)", "rating": 5, "expected_grade": "A-", "created": "2021-03-23T14:46:47Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Fantastic professor, fantastic person. Cannot recommend him highly enough. Lots of material, but his lectures are great and exams are not too bad if you study. He clearly cares about his students. All around stellar person and professor. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-03T19:09:30Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "He's such a caring professor! He makes the BSCI170 material super engaging and actually makes you interested in what you're learning. He also gives plenty of opportunities to get an A ", "rating": 5, "expected_grade": "A", "created": "2021-05-07T16:08:42Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "I LOVED HIM AS A PROFESSOR!!! He made the material so easy to understand and made it very possible to get an A (I suck at bio for reference). He's so nice and caring and definitely wants to see his students succeed.", "rating": 5, "expected_grade": "A", "created": "2021-05-11T17:56:53Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "AMAZING AMAZING AMAZING PROFESSOR. If you have the opportunity to take his class I couldn't recommend him more. He's extremely kind and caring to his students and genuinely tries his best to make sure that his class knows the material and is able to work hard. He also had one of the highest grade point averages for a BSCI170 class this semester which was very impressive. Honestly, just make sure to pay attention to his lectures and do work on time and you will be all set. His exams aren't too difficult but at the same time they aren't too easy. Really they are just the expected amount of difficulty and he doesn't throw any curve balls. HE ALSO SHOWS HIS PETS ON ZOOM ALL THE TIME.", "rating": 5, "expected_grade": "A-", "created": "2021-05-13T16:31:08Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Genuinely nice guy. Awesome professor. Engaging material. Definitely my favorite class. I was a nervous freshman coming into BSCI207 but feel very confident in my abilities in his class. Definitely inspired me to continue down the biology track. TAKE HIS CLASS!!! All his lectures are recorded, he provides study guides, multiple attempts on concept checks, and you really dont have to read any textbook stuff except for the short GAE readings to pass his class. AND you get a cheat sheet on every exam!!", "rating": 5, "expected_grade": "A", "created": "2021-10-25T14:27:50Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Such an amazing professor! His lectures were easy to follow and he takes his time explaining the material. He really cares about his students and is easily approachable if you have an issue. He drops the lowest test grade which is a big help. If you go to the lectures and study the material you will do good on the exams.", "rating": 5, "expected_grade": "A", "created": "2021-10-28T22:11:55Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "If I could go past 5 stars, I would. He may be one of the most understanding, kind, and humorous professors I have had. He is extremely organized, his page is easy to follow, and he is so aware of the difficulty of the class. He provides his students with literally everything you will need to succeed. We have homeworks that are graded on effort, GAE quizzes and concept checks that are sometimes directly questions that are put on the exam, and he allows a cheat sheet during exams. You really can't ask for anything more from a professor, let alone a biology/STEM prof. He is amazing and I wish I could take more classes with him!", "rating": 5, "expected_grade": "A", "created": "2021-12-01T00:27:02Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Best professor for BSCI207. He is the most understanding and flexible professor there is. My friend has the other professor for this class and failed. There’s a lot of assignments to help boost your grade. One exam gets dropped. He has concept checks after every lecture to help ensure you understand the material. He allows cheat sheets for exams with equations etc. He is also kind and funny. He has a cute dog. He makes class fun and there’s a lot of hands on activities. 10/10 recommend. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-08T22:56:25Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "I would agree with all the other 5 star reviews, this man deserves nothing less than a 5/5 on any teacher rating platform. He's literally so understanding and tries to make the loads of information as manageable as possible. He's funny and will tell you the crazy things about his life and he is very accessible outside of class. Cannot stress this enough, TAKE HIM IF YOU CAN. I would write more about what his grading is like but I'm too lazy, just look at the review from 12/01/2021 for a breakdown.", "rating": 5, "expected_grade": "", "created": "2021-12-09T21:28:31Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Dr. Fletcher is seriously the best I love him so much. The material in this course can be very difficult as its a very in depth explanation of many concepts, but Dr. Fletcher gives you all the tools to succeed. For every exam he allowed an entire sheet of paper for cheat sheet notes which was very helpful. He's super understanding and knows exactly what he's talking about and how to explain it. Seriously take him for any class you can, you won't regret it. ", "rating": 5, "expected_grade": "", "created": "2021-12-19T21:08:57Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Dr. Fletcher was a real highlight for me during my time at UMD. His class style is clear and engaging, making taking on such large chunks of information very doable. Learning expectations were clear and success in his class is viable given some effort. Outstanding professor and I would recommend him to anyone. ", "rating": 5, "expected_grade": "A", "created": "2022-01-06T19:04:12Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "I loved loved loved Dr. Fletcher! He gave you all the resources you needed to pass and didn't make his class more difficult than it needed to be. Everything connected with each other, there wasn't any busy work. The work load was absolutely fine, and the entire class was graded on (pretty much) completion except for the exams.", "rating": 5, "expected_grade": "A-", "created": "2022-01-11T02:06:59Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Awesome teacher, take if you have the option! He actually cares about kids doing well and learning and has a pretty consistent schedule that makes it easy to keep up with. Also posts lecture material very soon after class which is helpful if you miss or are late. ", "rating": 5, "expected_grade": "", "created": "2022-02-18T17:32:05Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Unpopular opinion but I did not think Professor Fletcher was worth taking an 8 AM. He only gave 3 exams, versus other classes that gave 4 so therefore there was more information on each exam. His \"exam guides\" had like 4 example problems and the rest pretty much told you to go through each of this 40 page powerpoints that you'd have at least 7 of per unit. I feel as though he wasn't super helpful and didn't give me an easy way to do well in the class. I have a lot of friends who agreed with me and regretted not taking Kehler", "rating": 3, "expected_grade": "B", "created": "2022-04-25T20:13:15Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Maybe the people who reviewed Fletcher well had him online because I personally did not understand the hype especially when I took this class at 8am. His review guides are not helpful as there are only about 4 questions on it which don't constitute a study guide in my opinion. While he does post all lectures online, and textbook reading isn't really required, be aware there are group activities once a week that are mandatory. Exams had an incomprehensible amount on them also, I think he could spread the topics out more. Be ready to spend a majority of your time studying the week of exams if you take this class. ", "rating": 3, "expected_grade": "B", "created": "2022-05-06T02:33:30Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Took an 8 am for his class in spring 22', I honestly don't think it was really worth taking. I went to nearly all his lectures and his tests were ok, it contained a lot since there were only 3. From the reviews and grade data for his 170 class, there was a high chance of getting an A for the class. But now that I think about it, the grade data only showed for previous years when his class and exams were online. Connect the dots. Overall he's a really nice and helpful professor. GSS is also very helpful, especially Saad's, he goes in-depth with explaining and it's much easier to understand in lecture. ", "rating": 4, "expected_grade": "B-", "created": "2022-05-09T19:39:59Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "I understand where the other reviews are coming from, but people must understand 170 is a very content-heavy course. Almost any biology course will cover a lot of information and I believe his exams were really fair. None of the exam questions were trick questions or surprises. Everything on the exam is something that he has gone over in lecture or are very similar to the in-class activities we are required to go to. He is also really lenient with grading as he allows you to drop the lowest assignment in each category. Fletcher was more than generous when it came to grading and I found his exams to be easier than other 170 professors when I compared with friends. Plus, he recorded his lectures so it wouldn't be the end of the world if you slept through his class. ", "rating": 5, "expected_grade": "A", "created": "2022-05-17T05:28:51Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Great professor. He requires a lot of effort, but his exams are straight forward and it's possible to do well in his class. Attending GSS or office hours before the exams, and reviewing the concept checks were helpful for studying.", "rating": 4, "expected_grade": "A-", "created": "2022-05-19T00:42:22Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Fletcher is a great professor who frankly made 207 a very easy class to get a good grade in. Lectures were easy to follow, and he also provided an additional resource that was kind of like an online 207 textbook that could be helpful sometimes. The work load was not heavy at all. Following every lecture would be a quick 2 point concept check which you get 3 attempts on, and every couple weeks there would be a homework assignment that was usually pretty challenging, but they were really just graded for effort, not accuracy. There would also be these in-class group assignments (GAEs) every other week which were probably the most annoying part of the class; we had to watch a lecture video and complete a quiz in preparation for it, and the assignment itself was done on one piece of paper for the whole group of 5 or 6 people, meaning not everyone really got to see what was going on. But again, these were only graded for completion so it wasn't much of an issue.\r\nThere were 3 midterm exams which weren't that tough, considering we could make a one-sided cheat sheet paper to cram all our notes on. Same goes for the final, but the cheat sheet could actually be two-sided. He also dropped our lowest midterm grade, as well as the lowest grade in every assignment category. And there were some small extra credit questions on the exams too, so as long as you made a good cheat sheet, getting an A on them was not much of a challenge.\r\nOverall, Fletcher is a nice guy who is very approachable and passionate, and has a cute dog.", "rating": 5, "expected_grade": "A+", "created": "2022-05-20T15:52:25Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Dr. Fletcher might be the best teacher in all of UMD. I took his class Tuesdays and Thursdays, and since he was used to having MWF lectures the class pace was a little fast, but he is such a fantastic lecturer it didn't make class any more difficult. He posts lectures for review, too! He drops the lowest assignments and test grades. There are three tests and a final, but he makes it SO EASY to review for tests. The work isn't too difficult (and if you don't understand it, there were three TAs, two GSS leaders, and Fletcher himself to help) and the work is super helpful for studying. Textbooks are not necessary, but they are helpful. If you take the class seriously and make sure you understand most of the content, it is very easy to get an A. TAKE THIS PROF!!!", "rating": 5, "expected_grade": "A", "created": "2022-05-22T21:03:09Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "I think that Flectcher is a really great professor. His class is low stress, and I thought that all the assignments were very easy, even the exams. The concept checks were really helpful, and the exam questions were entirely based off of the Powerpoints. Having mandatory group activities on Fridays wasn't great, but they were very easy points. He also drops the lowest assignment in every category, so if you missed one, it wasn't a big deal. His lectures are a bit dry, but I still think he's worth taking. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-24T14:20:25Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Dr. Fletcher is a great professor. His assignments were pretty easy and you could go to his office hours where he's happy to answer any questions on the homework and basically gives you the answer. All of his assignments were very helpful in understanding the material. I will say there is a lot of material covered in this class and most of the questions on the exam are straight memorization and a few conceptual. I found the exams to be challenging but Dr. Fletcher is such an amazing professor so if you have any questions at all he'll be happy to help and explain things thoroughly. He also drops the lowest assignment and lowest test so if you're happy with your grade you don't need to take the last exam. Overall I would definitely recommend Fletcher for BSCI207 as it is a challenging class but he makes it as easy as possible.   ", "rating": 4, "expected_grade": "", "created": "2022-07-13T18:02:45Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Nick is a really fun and interesting lecturer. He encourages students to talk to each other and has weekly group activities. All of his lectures are on panopto with subtitles so if you miss something during class or couldn't hear something he said it isn't a problem. You can also bring a formula sheet to exams and write on it which is pretty great. If you take any other prof 4 207 you are making a mistake.", "rating": 5, "expected_grade": "A", "created": "2022-10-12T22:27:37.921849Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Dr. Fletcher is a super easy-going and overall kind professor who implements a lot of grading policies that are super beneficial for his students. With three classes per week, generally two of them are lectures and the other is a Group Active Engagement Session (GAE) that allows you to work with classmates on a worksheet, which is graded for completion. It's a great way to make a big class feel smaller. Before the GAEs, you have to do prep work and then take a quiz, which you only get one try on.\r\n\r\nAfter every class, you have a 1 point concept check to take, which is usually 3-5 questions, and you have three tries to get 100%. These are also easy ways to get points since you can go look back at the lecture slides and your notes.\r\n\r\nDr. Fletcher also assigns homework approximately every two weeks that are graded on effort. They're usually not too hard. \r\nIn regards to all of the assignments listed above, some of your worst scores get dropped since there are so many of them. So hypothetically, you could not do some of them and be completely fine since they'd be dropped.\r\nThe exams are not too too hard if you study, but if you don't, I can bet they're difficult. This class builds off a lot of previous bio classes, so having prior knowledge can help you out a lot. Dr. Fletcher allows you to bring an equation sheet that serves as a cheat sheet that you can write on for every exam. Then, he drops your worst exam grade out of three. The only bad thing about this is that I don't think there's a curve at the end of the class since one gets dropped and the class average is a C on most exams. So, you really just need to study and get good exam grades to get an overall good grade in the class because you can't rely on a curve. \r\nThe main reason I give Dr. Fletcher 4 stars instead of 5 is because I think his lectures can get a little boring. Some of the content of this class is interesting, and Dr. Fletcher's passion does make it more interesting, but some lectures are just really hard to sit through when it's just him talking. I think it would be more engaging if some videos or animations were shown so students could see the biological processes in action.\r\nOverall, I highly recommend Fletcher for BSCI207. I don't think you can find a better professor for it.", "rating": 4, "expected_grade": "A", "created": "2022-12-03T19:26:16.437922Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Nick is an engaging lecturer and is great at helping freshmen make the transition to college. He previously taught at MC so I think he has a lot of understanding regarding the difficult transition that freshmen have to make which is important for teaching 100 and 200 levels. I took 207 as a junior due to procrastination and it almost felt “too nice”. However, you are expected to stay on top of things in this class. There will usually be either one HW or one GAE (group activity) every week and there will be a concept check after every lecture. Be aware of this and always do your work. You do not want to lose easy points in this class!", "rating": 5, "expected_grade": "A", "created": "2022-12-06T19:43:03.258710Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI150", "review": "Good lecturer, funny person. Class is easy and gives 3 gen eds. Not much HW, optional final, exams are allowed a cheat sheet.", "rating": 5, "expected_grade": "A+", "created": "2022-12-07T17:10:44.758670Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Fletcher's a good professor but I personally don't really like his class. He goes really into depth with everything, but a lot of the time its just way too much talking. My lectures were only 50 minutes long but they are packeddd with information and its kind of overwhelming. It's very very useful to have cheat sheets for the exams because it's usually a lot of material. Its easy to do well in this class as long as you are prepared for each exam. The homeworks and GAE's are all graded for completion and you have a lot of opportunities to bring your grade up with the online quizzes. He gives you 3 attempts for the concept quizzes after every lecture, but just one for the GAE quizzes before the GAE to make sure you watched the GAE lecture and  material beforehand. He also drops the lowest exam, quiz, and homework. He's a really nice, engaging, and easy-going lecturer, but this class just wasn't for me. I do recommend him though.", "rating": 3, "expected_grade": "A", "created": "2022-12-11T21:10:40.979010Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI150", "review": "This professor is a godsend compared to Paczolt as he wants you to understand the material and won't respond to you in a condescending way. Fletcher teaches Bsci 150 alongside Philip Johnson and Kimberly Paczolt, Fletcher was easily the best professor out of the three. When he taught, the topics were much clearer to understand as his examples were much more related to real-world concepts and his experiences which made it easier for the information to stick.  The assignments were weekly quizzes, daily clicker questions, a term paper about your family history, 3 midterms, and an optional final. \r\n\r\nThe midterms are mainly application based while relying on examples instead of memorization. At a minimum, you should start studying at least 3 days before the exam to make sure you are getting a well-rounded understanding of the material and have any chances to ask questions about the study guides they post with each exam. Utilize the example questions in the study guide as many of those questions will actually be on the exam. They don't give out the answers to the guide so make sure you ask fletcher for the correct answer before the exam and you're golden. \r\n\r\nThe labs were tedious and involved a lot of waiting around. If you are anything like me and not a natural sciences major, some of the tasks can be unnecessarily confusing and complicated for no reason. But they give you a week from the day it's assigned to complete the lab so you can ask your TA any questions. Overall this class had some interesting topics and the content wasn't outlandishly difficult. But don't expect this course to be a cakewalk as you can easily earn a bad grade if you don't put in a fair amount of effort.", "rating": 5, "expected_grade": "A+", "created": "2022-12-14T05:18:07.263964Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Dr. Fletcher is great. I can only say positive things about him. He’s always smiling and you can tell he cares about what he is teaching which makes his lectures that much more interesting. He does everything in his power to make getting a good grade easy. Everything is completion other than the exams, you can drop the lowest midterm, and you can have a cheat sheet on each exam.", "rating": 5, "expected_grade": "A+", "created": "2022-12-18T21:23:25.086850Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI150", "review": "Dr. Fletcher is one of the best professor you can have. He explains things well. NGL this class has lots of workloads but if you are willing to ask questions and go to office hour, you are pretty much fine. Fletcher really cares about his students can is always nice and sweet.", "rating": 5, "expected_grade": "A", "created": "2022-12-18T21:57:22.417123Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Dr. Fletcher is the nicest professor for 207. This course has a lot of content that is straight memorization but he lets you use cheat sheets and gives you plenty of resources to study from. After each lecture there are concept check quizzes which are questions that always end up on the midterms and the final. Attend office hours if you want answers to the exam study guides, or lecture content. He makes the classes entertaining and interactive, which is so different from other professors. He also records lectures so if you miss a few it's not a big deal. As long as you study in advance of the exams this class will be easy.", "rating": 5, "expected_grade": "A+", "created": "2022-12-18T23:07:45.519359Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Fletcher is an amazing professor who genuinely cares about his students and what he's teaching. He's always really clear on what is expected on assignments and exams, and he grades leniently. This course, in general, is super content heavy, so definitely make sure to watch all of the lectures, as each 50 minute lecture has loads of content. He is really great at explaining each concept. The fact that he allows a cheat sheet on his exams definitely helps, and his exams accurately reflect his exam guides, homework, and GAEs. As long as you do all of the work and keep up on lectures, you will be fine. I would highly recommend taking Fletcher.", "rating": 5, "expected_grade": "A", "created": "2022-12-19T04:19:01.322260Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Dr. Fletcher is a great professor! He records all his lectures, drops the lowest grade in each category, and has very fair exams. The questions are always straight forward and I never felt like there was a question that we never covered. He also sometimes cracks jokes or asks you to discuss with your classmates during lecture which keeps you engaged. One complaint though is that he sometimes talks fast and covers a LOT of information in one lecture. It can be really hard to keep up and can get boring at times if you're not interested in the topics. However, I feel like the fact that he records lectures compensate for this since you can always catch up on information you missed later. Overall, nice guy and I would for sure recommend him for 207.", "rating": 5, "expected_grade": "A+", "created": "2022-12-20T21:03:56.566444Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Aside from being a great professor. He's just a great person all around. He's willing to help you in and out of class. One of the best professors I've ever had. I had him couple of semesters ago and I still wish all of my professors were as good as he was.", "rating": 5, "expected_grade": "", "created": "2022-12-21T00:23:48.830642Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Fletcher is the nicest guy you'll ever meet; he makes the class environment super welcoming towards new students and won't hesitate to help you. However, I found his exams kinda difficult; they are very detail-oriented, and while it holds true that everything comes off of his slideshows, his slideshows are each about 75 slides long, and there's around 10 slideshows per unit. It's a lot of content to cover. If I could retake the course, I'd start reviewing information earlier before exams because a lot of it is memory based. \r\nI also think his lectures are more on the ramble-y side, but he records them, so you don't have to attend if you don't want to. Overall, great and approachable guy!", "rating": 4, "expected_grade": "A-", "created": "2023-01-08T17:10:13.015052Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Like the other reviews say he is a great lecturer and an amazing teacher. His exams are straight to the point and cover more content less in depth and not one that has a bit of content but very in-depth (if that makes sense). TA's were good and the GSS sessions were very useful. I highly recommend him and see him as the top option for BSCI170", "rating": 5, "expected_grade": "A", "created": "2023-05-03T19:48:16.304542Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI370", "review": "Literally the best professor at UMD. I had Dr. Fletcher for BSCI207 and BSCI370. Extremely personable, understanding, and down-to-earth. Simply a fantastic professor and person. He creates such a welcoming environment. He also records his lectures, so if you ever miss a day, you can keep up with the notes. Despite the recordings, I still found myself showing up to class every single day because of how amazing Dr. Fletcher's teaching style is. His powerpoints are so clear. His concept checks really keep you up to speed with the current topics. He gives amazing feedback too. I find his exams to be extremely in-line with what we learned and there is never anything unfair or surprising on them. I wish he taught more biology classes because I would take any class he teaches. Even if you don't like the class, Dr. Fletcher makes it as easy to understand as possible.", "rating": 5, "expected_grade": "A+", "created": "2023-05-10T00:17:48.271126Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "I'll keep it simple. Take him", "rating": 5, "expected_grade": "A", "created": "2023-05-25T14:40:16.236312Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "I would recommend taking Fletcher for this course. The only negative I can come up with is that he can rush through the slides sometimes, but everything else about the course is well done. You are typically given concept checks and group activity quizzes that are in place to help boost your grade and understand the material. The concept checks went over what we learned in lecture slides, and the group activity quizzes would help you prepare for the group activity worksheets. These worksheets helped to understand the material and were some more grade boosters. His tests were fair, and some of the questions in the review guide would be on the test. He also records his lectures, so if you miss a class or want to review material you can watch them. He would also drop the lowest midterm, so only two midterms will impact your overall grade at the end.", "rating": 5, "expected_grade": "A-", "created": "2023-05-25T14:44:10.020162Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI370", "review": "Easy money per usual. I tip my hat to this good man.", "rating": 5, "expected_grade": "A", "created": "2023-05-25T18:52:24.861787Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI170", "review": "Dr. Fletcher is the nicest most kind professor I have ever met. He records almost all of his lectures so going to class is optional except for about once a week where he has group activities to reinforce content. The group activities are relatively easy and reinforce topics. After each lecture and before each group activity you will have a short quiz these are easy and great to check your understanding. For the ones post-lecture you get three attempts while for the group activity ones you only get one. I found his exams to be difficult and very detailed oriented despite everything coming off his slides. There are 3 midterms and a final. He drops your lowest midterm. A lot of this is memory based and I wish I had started reviewing material earlier in the unit because I would have done better. The final was really difficult but manageable. It's just a lot of information and content to cover. The TAs, GSS people, and Dr. Fletcher himself are all super helpful and willing to answer your questions.", "rating": 5, "expected_grade": "B", "created": "2023-05-25T23:12:20.482695Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI370", "review": "There's not much more to be said about Dr. Fletcher that other reviews have not covered. He is literally the nicest professor I have ever had. Lectures were dense but concise, and as long as you took notes and paid attention, exams were not difficult. All lectures are also recorded so you can always go back and review concepts you did not understand. In office hours, Dr. Fletcher always answered all questions thoroughly and was really direct in telling us what was and was not important. If you have the opportunity to take him, definitely do!!", "rating": 5, "expected_grade": "A+", "created": "2023-05-29T14:49:49.737836Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "He's very nice and he's a great lecturer!", "rating": 5, "expected_grade": "", "created": "2023-09-19T21:44:18.314376Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Literally the best professor I have ever had. He cares about his students so much, and wants all of us to do well in his class. I hope to have him again for BSCI370 because he makes me enjoy the class, and his teaching style makes everyone enjoy coming to lecture. If you have a chance to take a class with him, do it.", "rating": 5, "expected_grade": "A", "created": "2023-12-06T15:59:48.133605Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Probably one of the best professors i've had. He actually cares about his students and always comes in with a smile, which does more than you think if you're having a stressful day :). I would love to take him again. My advice is don't try and memorize the powerpoints. I would write almost everything on the powerpoint on my reference sheet and it would barley help. This is because he wants you to have a good understanding of overall concepts, rather than trying to memorize a bunch of facts. Great class, if you do the work, it is easy to succeed with Dr. Fletcher!", "rating": 5, "expected_grade": "A", "created": "2023-12-12T03:44:52.213748Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Would recommend taking Fletcher. He tries to make lecture engaging and is very enthusiastic about the material. For assignments there are a few homeworks, which are challenging but not too difficult, concept checks after every lecture, and the group worksheets done usually once a week or once every two weeks. The exams are very fair and he allows a note sheet for each one. In lecture he also explains the topics beyond just what is written on the slides and records his lectures which is very helpful for studying. Great teacher!", "rating": 5, "expected_grade": "A", "created": "2023-12-12T21:52:09.922064Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "dr. fletcher is so sweet!! he's an amazing professor and really explains so many concepts very well, making them both interesting and informative. lectures are recorded, there are concept checks and outside pre-work usually once a week (GAEs), and homework is graded for completion. while the slides were dense, they're always easy to come back to and relearn if you don't fully understand or miss a concept during class. the work is very manageable and dr. fletcher is the GOAT!! :D", "rating": 5, "expected_grade": "A+", "created": "2023-12-15T03:09:31.830563Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Dr. Fletcher is amazing. A good person, fair grades (lowest midterm is dropped!), extra credit, and reasonable workload are all things you get with him. Additionally, he encourages questions, is good at explaining topics, and is very welcoming. For the workload, he assigns a short concept check after every lecture, the classes with the group activity have some prep material involved, and there are usually 2-3 homework assignments per midterm, but that's it. For studying, Dr. Fletcher posts an exam guide before every exam that includes some practice exam questions that might even appear on the actual exam. He also allows you to write notes on your equation sheet to use as a reference on the exams. Thank you so much Dr. Fletcher for allowing the reference sheet because there is just so much content covered in BSCI207, I wouldn't even know where to begin studying for it. The exams themselves aren't that hard and they accurately reflect the lecture and GAE material, but there's just a lot of material you have to remember. He also records his lectures which is extremely convenient for note-taking considering the amount of content in this course. The only real downside I can think of is that the final exam is worth more than 1/3 of the final grade, so you really have to study for it. Even then, having this downside is more than worth everything else Dr. Fletcher has to offer.", "rating": 5, "expected_grade": "A+", "created": "2023-12-16T03:57:16.214410Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "All his lectures are recorded and he never tests on anything that he didn't cover. Very good teacher who cares about his students. Definitely would take him again.", "rating": 5, "expected_grade": "A+", "created": "2023-12-18T16:27:28.603664Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI207", "review": "Dr. Fletcher is a great professor and he makes it very easy to succeed in his class! If you put in just a little bit of time (which I didn't do and still ended up with a B+) you can totally get an A. A decent amount of stuff is graded for completion and one exam is dropped. I always enjoy having him as a professor and he really wants to see all of his students succeed.", "rating": 5, "expected_grade": "B+", "created": "2023-12-25T01:34:16.728715Z"}, {"professor": "Nicholas Fletcher", "course": null, "review": "Take Dr. Fletcher, if you are choosing classes while reading this and his class has a spot stop reading and just lock it in. He is an amazing lecturer, the nicest professor I've met, and his exams are fair, have extra credit every time, and very few assignments/hw but when there are they are fun, interactive, and help you learn. There's no curve but there are GAEs which are free point you get with your friends once a week. He rushes through slides a bit but he posts slides and lecture recordings so there's never a problem.", "rating": 5, "expected_grade": "A", "created": "2023-12-26T19:43:10.355234Z"}, {"professor": "Nicholas Fletcher", "course": "BSCI151", "review": "Best Biology Prof at UMD. Humble, down to Earth, and truly cares about his students. Answers questions in the most open way possible, you will never feel like he doesn't have time to answer your question or that your question is unimportant. Makes sure you have full understanding before he moves on. Always smiling and checking on his students between lecture slides. Makes it so fun to learn the content!", "rating": 5, "expected_grade": "B", "created": "2024-01-19T23:50:44.067362Z"}], "name": "Nicholas Fletcher", "slug": "fletcher_nicholas"}