{"courses": ["ENGL101X"], "average_rating": 1.4545, "type": "professor", "reviews": [{"professor": "Olubukola Salako", "course": "ENGL101X", "review": "Absolute horrible professor. She goes to class 10 minutes late and has the audacity to mark students tardy. She does not teach at all and gives unclear instructions for assignments. Her grading is basically random since she herself don’t understand the assignment.", "rating": 1, "expected_grade": "A", "created": "2023-11-23T18:10:05.605279Z"}, {"professor": "Olubukola Salako", "course": "ENGL101X", "review": "She does not teach, gives unfair grading, arrives 10 minutes late every lecture, is clueless half the time, makes instructions more confusing than it should be.", "rating": 1, "expected_grade": "A", "created": "2023-11-27T00:29:19.433464Z"}, {"professor": "Olubukola Salako", "course": null, "review": "Dr Salako is a good teacher. She's nice to speak to after class, but I understand why she has a low rating. She arrives late to class and cuts marks without a proper explanation.  Her classes are homework-heavy. We're given good marks if we show up to class the next day after submitting the homework, or we get a 75% on the assignment which might be deemed unfair. She disregards sick notes and other exemptions from the university. The instructions for the assignments are clear but several assignments are clubbed into one, making them appear unclear. There is no apparent pattern in her grading, it's always unpredictable and we don't get the grades for the actual assignments until a month or two after we've submitted them.", "rating": 3, "expected_grade": "A", "created": "2023-11-30T21:10:37.372166Z"}, {"professor": "Olubukola Salako", "course": null, "review": "I would not recommend taking her as a professor even if she is your only option. Coursework isn't too heavy but the pacing of her class versus other professors is so bad, she is always behind and the grades are all over the place. She arrives late to class and cuts points if you are late(if she arrives on time). These class activity points are also cut even if you have a sick note, which means you will either have to  go to class while you have a fever, or lose some points. When you and you classmates ask her a question, she will end up with the same explanation. Her remarks on your work are also too vague. She has wasted an entire semester of every student of hers. Expecting a curve to save the students.", "rating": 1, "expected_grade": "A", "created": "2023-11-30T23:10:28.444393Z"}, {"professor": "Olubukola Salako", "course": null, "review": "Dr Salako consistently arrived late to class, displaying a lack of respect for students' time. Teaching was convoluted, hindering comprehension, and minimal feedback on assignments left me feeling unsupported. Despite a valid sick note, the professor refused exemption from in class acitivities, revealing an unfortunate lack of empathy. Overall, the experience was marked by unprofessionalism and a failure to prioritize students' learning and well-being.", "rating": 1, "expected_grade": "", "created": "2023-11-30T23:23:59.968461Z"}, {"professor": "Olubukola Salako", "course": null, "review": "Horrible professor, don't take her unless you want to make your life a living hell. She comes late to the class and then cuts marks if you're late. She does not consider any medical leaves or emergencies. The coursework is really heavy and rushed because she does not  have a proper schedule. She is as confused as the assignments she makes. Just corrects grammar and does not give any constructive feedback in major assignments, where she also cuts points for no reason as every other assignment. Half of the assignments haven't been graded and it's the end of the semester.", "rating": 1, "expected_grade": "A", "created": "2023-12-04T07:21:58.078311Z"}, {"professor": "Olubukola Salako", "course": null, "review": "DO NOT TAKE HER!! She has a really shit grading, does not know how to read and grades the assignments so late that you wont be able to correct your mistakes until 3-4 more assignments and guess what? you have already made the same mistakes for 4 more assignments by then. However, if you are on excused absence, why do you want to miss the class with this amazing professor? BECAUSE YOU CANT UNTIL OR UNLESS YOU WANT A LATE GRADE (75%) OR 0% on assignments.", "rating": 1, "expected_grade": "A-", "created": "2023-12-07T03:47:18.159952Z"}, {"professor": "Olubukola Salako", "course": null, "review": "Dr. Salako has proved that PHDs do not make you smart. This woman is consistently late to class has the audacity to cut points from students being late and does not excuse absence, even if you have a doctor's note, which must be against the guidelines. She does not complete her course on time and then comes up with lame excuses to cut students' grades without any valid reason and due to her own faults. She should be reported to the Division of Academic Affairs due to the torture she has put the students throughout the semester. She also hates good planet terp reviews because she purposely would want you to lose points by making a single assignment worth 25% of your grade (which she did not even explain) and still wont give u more then an 85/100. This means no one is getting an A unless she curves it, and I don't think she knows what curving even is. Do not pay tuition to umd to study under this horrendous professor. Anyone who takes her class should be paid to attend her class.", "rating": 1, "expected_grade": "A-", "created": "2023-12-07T22:25:31.179606Z"}, {"professor": "Olubukola Salako", "course": null, "review": "DO NOT TAKE HER!!! Her grading is really bad. Grades the assignment so late. I am writing this review on Dec 12 and my assignments from oct have not been graded yet. Idk how many mistakes i have made. I am a CS major but i spend most of my time on English rather than CS. Plus she doesnt give any excused absence does not matter if you are sick or have somewhere to be. She cuts points for no reason and without providing an explanation. If you have a choice, i repeat \"DO NOT TAKE HER\" until or unless you want to be our guest.", "rating": 1, "expected_grade": "A-", "created": "2023-12-12T05:23:53.366046Z"}, {"professor": "Olubukola Salako", "course": null, "review": "She was a good teacher to me. Don't expect to get marks if you don't show up to class. As long as you finish your work on time and submit your best work, you should get good marks. I don't know what y'all are talking about. She's always on time to class and she gives okay-ish feedback. All in all, I liked her class. She's not as bad as you guys paint her.", "rating": 4, "expected_grade": "A-", "created": "2023-12-13T06:12:15.419324Z"}, {"professor": "Olubukola Salako", "course": null, "review": "I've been putting off this review for a while because if I were a professor and read this, my heart would be broken. Also, I didn't want to harm this professor because, at times, she seemed nice, but my final grade just got on my last nerve. If, by any chance, professors read this source, Dr. Salako will immediately recognize me. Still, for the sake of expressing my true opinion and concern for future generations of students, I'm writing this anyway.\r\n\r\nHonestly, I'm not the type to write nasty reviews or harm anyone, even if I don't like something. However, since Dr. Salako chose to be \"fair\" (I'll explain later what I mean), I'll fairly rate her and express all my concerns. First things first, the course itself is incredibly confusing and unstructured. As of Fall 2023, the only class she had was ENGL101x (for international students), and all these reviews are dedicated to this course. We had a small group, around 15 people, where everyone knew each other, so the communication between students was very well-established and I am absolutely certain that every single student shares the same opinion about this professor. Everyone in this class was misled and confused all the time. I attended every single lecture, even when I was sick with a fever. I listened to every word she said, did all my homework, and asked a lot of questions. However, asking questions proved useless; she either wouldn't answer or would confuse you more. Even if you argue with her and your whole group tries to prove that what she's saying doesn't make sense, she would never admit it.\r\n\r\nShe tries to pretend to be a nice and caring person, but she won't give you credit for classwork if you didn't come to class, even if you did it at home anyway (assuming that you have a legitimate reason, like severe illness with proper documentation). One time, I had been writing a paper all night and had an exam the next day. I submitted my paper and realized there was one more thing to do for homework. It seemed logical to me to submit the second small task to the second submission attempt. I left a comment indicating my paper was in attempt 1, and the second task in attempt 2. During the lesson, I got a grade for a paper that was a zero. Confused, I asked Dr. Salako what was wrong, and she replied, \"I only check the second submission attempt.\" I apologized and explained my mistake, suggesting she could make an exception since I indicated in comments that I made a mistake, and she could easily access the first submission. It's not a crime, and I am the only one who made this mistake. Yet, she insisted on giving me a zero. I went to the bathroom, started crying, came back not looking good, and she told me not to cry in front of the front group. She said I could still get a good grade for a second draft, but I tried to tell her that giving me a zero is not fair since she knows I did the work and submitted it on time. She didn't care and continued saying things that made no sense, with the whole class watching. After class, she insisted on me staying in her classroom and telling her about my problems (she was convinced that I was actually crying about some \"family issues\" and not about the paper that I had been writing for 6 hours straight). The further conversation is rather private, but I can say she made some untactical comments about me.\r\n\r\nYes, she is called \"sweet\" by another student in this comment section only because she is hardly trying to sound and look like such; her voice and manners seem very nice. But, in reality, she doesn't care about her students, proven by that story and by giving out zeros to sick students who do their work even with a fever.\r\n\r\nTo conclude, I worked my ass off in this class; as I mentioned earlier, I did absolutely all I could possibly do. Still, I got a B. Honestly, I'm a stem major, and I've taken classes that are traditionally supposed to be much harder, but I didn't get a single B, except for this one. The class ENGL101 is not hard itself, but she made it the hardest class I've taken. There were kids in this class who were much smarter than me, but they dealt with the exact same issues that I did. I highly doubt that anyone got something above A- (I might be wrong though), but I am pretty sure that the majority was shocked by their final grades. She didn't do any curve, didn't adjust any cutoff, she did nothing even though she had a class of very smart  and hard-working students who were always attending lectures, paying attention in class and trying their best (almost everyone in this class was acting like that and was actually taking this class seriously!). So, since she decided to be \"fair\" to us, I am being absolutely fair and honest about her. DO NOT TAKE DR.SALAKO! unless you want to make your life a living hell.", "rating": 1, "expected_grade": "B", "created": "2023-12-23T03:29:12.703093Z"}], "name": "Olubukola Salako", "slug": "salako"}