{"courses": ["ENGL202", "ENGL222", "ENGL245", "CMLT280", "ENGL101", "ENGL295", "ENGL329A", "ENGL329R", "ENGL329I", "ENGL329L", "FILM419B", "FILM245", "CMLT398C", "FILM359Q", "FILM344", "FILM359L", "ENGL433", "ARHU275", "ARHU375", "ENGL275", "ENGL280", "ENGL144", "ENGL329F", "FILM319A", "ENGL329G", "ENGL391", "FILM319B", "ENGL101C", "ENGL293", "SLLC368A", "FILM319K", "ENGL329B", "FILM319F", "FILM319L", "SLLC368L", "ENGL101S", "CINE319L", "ARHU375", "CINE319F", "ENGL256", "ENGL329B", "CINE319K", "CINE369K", "ENGL329K", "ENGL329L", "CINE319L", "SLLC368L", "CINE319B", "SLLC368A", "CINE319B", "SLLC368A", "ARHU375", "ENGL101H", "CINE319A", "CINE344", "CINE319F", "CINE359Q", "ENGL329B", "ARHU375", "CINE319K", "CINE359Y", "ENGL329L", "ENGL329O"], "average_rating": 4.7143, "type": "professor", "reviews": [{"professor": "Paul Cote", "course": "ENGL222", "review": "Cote is great... Yeah it can get boring, but you can tell he's trying to help and not punish you with info, or be a tryhard like other grad students. You're crazy if you don't take a class with him!", "rating": 5, "expected_grade": "A-", "created": "2013-02-04T16:42:00Z"}, {"professor": "Paul Cote", "course": "ENGL101", "review": "hes a nice a guy but let me just say Paul Cote's class was sooooo boring.  the work was mostly just the research papers which every engl101 class has, but attendance was mandatory and even though there wasnt ever work in class i kind of wish there was because he sat there and talked the full hour and 15 minutes and reviewed stuff that we read in a book that was common sense. i had to prevent myself from falling asleep all the time", "rating": 3, "expected_grade": "A-", "created": "2011-01-02T22:51:00Z"}, {"professor": "Paul Cote", "course": "ENGL245", "review": "Honestly, I took this class because I thought it was going to be a joke. But, the class is basically analyzing films just like analyzing English literature. Basically, if you're good at English and love watching film, this is the class for you. Cote's lectures were discussion-based, but still enjoyable and informative, especially with film theory. As for the class's difficulty level, I would give ENGL245 with him a 3/5, since it's not necessarily hard, but work still needs to be put in to get a decent grade. ", "rating": 3, "expected_grade": "A", "created": "2019-01-29T14:29:38Z"}, {"professor": "Paul Cote", "course": "ENGL280", "review": "one of the nicest professors I've had. his expectations are very reasonable and his exams aren't made to trick you -- he says this himself. Though I took this class to fulfill a gen ed requirement, I'd definitely take more classes with him if I was more interested in English.\r\n\r\nFor 280, the structure with him worked like this:\r\n4(!) exams\r\n1 final\r\n1 paper proposal\r\n4 homework assignments\r\n5 online discussions\r\n\r\nthe midterms come quick, but they aren't hard. They're basically half multiple choice (super common sense questions, too), and half short answer or fill in the blank.\r\n\r\nThe final he was nice enough to make online as he figured it would help people do better on it, and openly said to feel free to use your notes or any other resource.\r\n\r\nThe paper proposal was his way of bringing some form of writing into the class, as this is a class on the history/structure of English rather than a literature or film class. We basically had to choose a topic that we talked about in class and think of a thesis that we could argue. We only had to write an abstract, and then also have two sources which we wrote an annotated bibliography for. Again, not hard at all.\r\n\r\nThe homeworks were essentially mini exams, honestly. Super easy and he would sometimes hint at what some of the answers were. The problems were super similar to things that we did in class, so there were no surprises.\r\n\r\nThe online discussions were kind of annoying, but not difficult. We had to write discussion posts on ELMS that were sometimes way too long for what the topic was (250 words for something that you can talk about in 3 sentences) so a lot of it ended up being fluff. Not hard, but kind of stupid.\r\n\r\nOverall this class was a 5/5 for me, especially with Cote.", "rating": 5, "expected_grade": "A+", "created": "2019-05-16T20:11:16Z"}, {"professor": "Paul Cote", "course": "ENGL101", "review": "Professor Cote's the best. He is super accommodating & understanding, and directs the content and papers so that they're based on your interests. Reading isn't heavy at all either. ", "rating": 5, "expected_grade": "A", "created": "2020-12-04T21:46:43Z"}, {"professor": "Paul Cote", "course": "ENGL101", "review": "more like paul goat, enough said", "rating": 5, "expected_grade": "A", "created": "2020-12-10T01:49:52Z"}, {"professor": "Paul Cote", "course": "ENGL101", "review": "So nice and caring about his students. He was great with zoom and really understanding about the pandemic, and class is directed towards your interests as well. Best English prof i’ve had", "rating": 5, "expected_grade": "A", "created": "2020-12-15T00:25:37Z"}, {"professor": "Paul Cote", "course": "ENGL101S", "review": "If you need to complete an academic writing requirement, PLEASE take it with Paul. You will not regret it. He genuinely cares about his students and does everything in his power to make the course as easy and stress-free as possible. 85% of the course is graded pass/fail based on completion, and the other 15% is graded based on effort, not perfection. He never expects perfection, so as long as he can see that you put effort into the assignment, you will get a 100. And due dates are not strict an there is no penalty for turning in assignments late, so you could turn in every assignment on the last day of class and still get a 100 in the class. Paul (he says we are allowed to call him by his first name) really is the sweetest man. He frequently ends class early if he thinks most students in the class are tired or stressed out, and there is very little work in his class compared to other ENGL101 classes. What's more is he spent a couple sessions talking to us about how he can make the class even easier than it already is, and he eliminated two or three papers and extended due dates. And his feedback on papers are very uplifting. In his feedback for my papers he always emphasizes that my writing and analysis was extremely impressive, and then he follows it up with constructive feedback in a very non-harsh way. And he has a great sense of humor, which makes classes very entertaining. I actually don't want the semester to end because I don't want to never see him again. I don't think there are many other professors as caring as he is.", "rating": 5, "expected_grade": "A+", "created": "2021-12-04T20:06:24Z"}, {"professor": "Paul Cote", "course": "ENGL101S", "review": "One of the best english teachers! He actually allows you to explore your interests in writing without having to worry about your grade. Extremely understanding as well! I highly recommend!!", "rating": 5, "expected_grade": "A+", "created": "2022-01-19T16:41:02Z"}, {"professor": "Paul Cote", "course": "ENGL101S", "review": "Very understanding professor and wants you to succeed. Gives feedback in a timely and fair manner. Definitely would recommend taking him if you can!!", "rating": 5, "expected_grade": "A+", "created": "2022-04-28T18:22:03Z"}, {"professor": "Paul Cote", "course": "ENGL101S", "review": "Super easy class and professor! Minimum effort class to get an A but he still gives great feedback and is very approachable. I felt that while it was a minimum work class, I was still able to learn how to make good arguments in my writing. It would be a mistake not to take him if you can.", "rating": 5, "expected_grade": "A", "created": "2022-12-08T15:57:39.537203Z"}, {"professor": "Paul Cote", "course": "ARHU375", "review": "This is by far the best class I have ever taken and Professor Cote is by far the best professor I have ever had. I have absolutely nothing bad to say about him or this class. I highly recommend taking this class if you are interested in scriptwriting. Best class decision I have made. He is very understanding and supports creativity in his class. If you have the opportunity to take any class with him, DO IT. I have never met a teacher who actually understands how to TEACH, and do so in a way that drives students to retain and want to learn information. This class felt like a breath of fresh air in a sea of stress. I could go on and on about my experience but I will my ranting here. Thank You Mr. Cote.", "rating": 5, "expected_grade": "A+", "created": "2022-12-09T05:17:06.275517Z"}, {"professor": "Paul Cote", "course": "ENGL329L", "review": "I have nothing to say except to TAKE HIM. Just do it. Like, don't even think about it, just do it.", "rating": 5, "expected_grade": "A+", "created": "2023-05-12T00:09:56.477271Z"}, {"professor": "Paul Cote", "course": "ENGL101", "review": "Mr. Cote is hands down the best professor in the English department at UMD. He is very understanding of his students' situations--he literally changed his whole syllabus to ease up on us during finals. His final is a 5-page minimum position paper, and only four of his discussions are graded. He allows you to explore your interests throughout each assignment, too! Cote is a professor who will provide meaningful feedback on how to improve your writing and comprehension of complex topics in literature. He does ramble a bit and you can get lost in your daydreaming, but overall this class is an easy A if you put your best foot forward.", "rating": 5, "expected_grade": "A+", "created": "2023-12-06T03:42:03.332345Z"}], "name": "Paul Cote", "slug": "cote"}