{"courses": ["EDCI440", "EDCI441", "EDCI689", "EDCI416", "EDCI447", "TLPL451", "TLPL479C", "TLPL478C", "TLPL489C", "SPHL601", "SPHL602", "SPHL603", "TLPL451", "TLPL479C", "TLPL478C", "TLPL489C", "TLPL451", "TLPL479C", "TLPL478C", "TLPL489C", "TLPL451", "TLPL479C"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Peggy Wilson", "course": "EDCI416", "review": "Great professor who puts a lot of effort into preparing for class and she is extremely helpful and (too) understanding.  A lot of students take advantage of her generosity (submitting late assignments, not attending classes, etc.).  All around, one of the best education professors at UM.", "rating": 5, "expected_grade": "A+", "created": "2011-12-26T00:31:00Z"}, {"professor": "Peggy Wilson", "course": "EDCI416", "review": "Peggy is wonderful, dont hesitate to take her class. Like most teachers in the ED department, she is caring and basically the most amazing person ever. Beware that you will have to get fingerprinted ($62.00) and go to observe at schools for 30 hours. You need a day off from classes, or at least a morning off or two a week. Try to do the observation at Northwestern Highschool also if you dont have a car because its so much easier. ", "rating": 5, "expected_grade": "A", "created": "2011-12-13T14:50:00Z"}, {"professor": "Peggy Wilson", "course": "EDCI416", "review": "Peggy is a wonderful professor. She's goofy and down to earth and very helpful. The workload was fairly light, just a chapter reading every week. The only hard part of the class was that you had to do 30 hours of observation at a local high school over the course of the semester. But, again, Peggy is very helpful in making sure you can get it done and in helping you contact the school and whatnot. \r\nOverall, a pretty easy course, very great professor. ", "rating": 5, "expected_grade": "A+", "created": "2009-12-14T22:06:00Z"}, {"professor": "Peggy Wilson", "course": "TLPL451", "review": "Peggy is a rockstar. Literally zero negative things have ever been said about her by anybody ever. You'll love her. She's def the kind of professor you'll tell future students about.", "rating": 5, "expected_grade": "A+", "created": "2021-12-16T01:17:11Z"}, {"professor": "Peggy Wilson", "course": "TLPL451", "review": "I LOVE Peggy. She's a super chill teacher that is very relatable and does everything to make sure that class is enjoyable. She is very honest and you can tell that she loves her job. She writes amazing recommendation letters and does a good job at helping to place you for your teaching internship. She makes the class about learning about the career, not about grades. \r\nOverall, very easy class as she is lenient with due dates. 100% reccomend", "rating": 5, "expected_grade": "A+", "created": "2022-08-04T19:26:46Z"}, {"professor": "Peggy Wilson", "course": "TLPL451", "review": "Peggy is great. She is super kind and helpful, especially with finding and getting settled in our placements. She's also very accommodating and easy to talk to. She is very experienced in teaching and always has a lot to discuss about the field and the subject of English and I always find our discussions interesting. I would definitely recommend taking a class with her; she is awesome!", "rating": 5, "expected_grade": "A", "created": "2023-11-09T22:39:30.608515Z"}, {"professor": "Peggy Wilson", "course": "TLPL451", "review": "peggy slays best woman ever", "rating": 5, "expected_grade": "A+", "created": "2023-11-15T15:00:51.587036Z"}, {"professor": "Peggy Wilson", "course": "TLPL451", "review": "Peggy is the best. She is so kind and passionate about both teaching and English and it really rubs off. She is really good about answering emails and being available to talk after class. She has so much experience and knowledge about what works in the classroom. She's also very funny and sweet. I can see why so many people keep in touch with her; she's truly a great mentor to have.", "rating": 5, "expected_grade": "A+", "created": "2023-12-07T17:37:35.369872Z"}], "name": "Peggy Wilson", "slug": "wilson_peggy"}