{"courses": ["PHIL140", "PHIL482", "PHIL209N", "PHIL878C", "PHIL408C", "PHIL878J", "PHIL878A", "PHIL209J", "PHIL878D", "PHIL788", "PHIL202", "PHIL418C", "PHIL879B", "PHIL202", "PHIL202", "PHIL879", "PHIL202"], "average_rating": 4.1818, "type": "professor", "reviews": [{"professor": "Peter Carruthers", "course": "PHIL209N", "review": "He is a really nice and cool professor and the class is pretty easy for most of the semester. There is one midterm exam and one final exam which isnt too bad because the questions are posted before hand and you go over some practice ones in class too. Each week you have 2 readings to read that are usually about 10 pages each. They can get kind of long so i usually end up skimming, but everything is really interesting, definitely more of a psych class. Each week you have one quiz on lecture notes and on the readings for that week, just by going to class and skimming the readings i dont think i ever got lower than a B on the quizzes, and he curves them at the end. The only part about this class that sucks is the group project. It has to be 4000-5000 words and can be hard to write if you have a bad group. But overall the course was really interesting and relatively easy.", "rating": 4, "expected_grade": "A", "created": "2016-08-20T12:20:00Z"}, {"professor": "Peter Carruthers", "course": "PHIL209N", "review": "The lectures are interesting but the quizzes are have a lot of trick questions, plus we don't get them back so it can be hard to know exactly what you missed in the readings. Which brings me to my next point, there are two papers you are expected to read a week which can be very long and very dense. Also this class is listed as a philosophy course, but it's more of a psych course. The test questions are released before hand, which is helpful. There is also a group project that is worth a large portion of your grade.", "rating": 3, "expected_grade": "", "created": "2014-11-05T18:57:00Z"}, {"professor": "Peter Carruthers", "course": "PHIL209N", "review": "I really really loved taking Phil209N with Carruthers.  He is truly a brilliant man and I'm astounded by the books and papers he has published.  I've even cited them in BSCI papers that I've done.  Some of the topics can seem obvious and dry but a lot of his lectures are truly amazing and can't help but capture your intrigue.  There's a quiz every week on usually VERY long empirical readings.  Even though I've read these types of papers for my science courses I still found it difficult.  The exams are not difficult as long as you don't slack off a lot.  There was also a group paper to write which was incredible annoying.  But as a professor he is very approachable and fair and does a brilliant job at presenting his material.  And he has an awesome accent", "rating": 5, "expected_grade": "A", "created": "2013-01-23T19:54:00Z"}, {"professor": "Peter Carruthers", "course": "PHIL209N", "review": "An excellent professor. Carruthers is one of the best in the field of philosophy of mind, and though he does not have a background in psychology, he does a great job of explaining findings in cognitive psychology and thinking about them critically. I'm a psyc major and I learned more psychology in this class than I did in many of my other psyc classes. The one downside for this class is the group project. I had a bad one and the papers are graded harshly. But I was still able to pull off an A by doing well on the quizzes and in-class exams. Overall I would recommend this course.", "rating": 4, "expected_grade": "A", "created": "2012-12-21T01:02:00Z"}, {"professor": "Peter Carruthers", "course": null, "review": "This guy is awesome. He's brilliant and lucid. It doesn't hurt that he's one of the leaders in field. He's calm and prepared in every class, fields questions like a pro, and is never condescending (even when he probably should be).\n\r\nThe class is amazing. It's the perfect progression of interesting, relevant papers to make you feel like you've truly understood the main contemporary issues.\n\r\nThat said, this class (Phil482) was HARD. It explores pretty nascent philosophy that you can't exactly look up on wikipedia yet, so it's super important to go to class and read the papers. Don't be afraid to ask him questions at all, because he'll go out of his way to explain things in a different way.\n\r\nThis was probably the best, most interesting philosophy class I've ever taken. If Carruthers offers another upper level class, I'm definitely going to take it.", "rating": 5, "expected_grade": "A", "created": "2012-05-18T19:16:00Z"}, {"professor": "Peter Carruthers", "course": "PHIL140", "review": "Professor Carruthers is seriously the best. He puts all of his slides online but they can be a little confusing if you don't go to class, plus he's just an awesome lecturer. He's British, which is awesome, and he explains things really clearly. There are 3 debates that you have to do in addition to a 7 page (2000 word) paper. The final is 40% of your grade, but  he gives you the questions beforehand. It's not that hard of a class but it is REALLY interesting and I always left with something to think about. Also, I got a lot better at arguing. \n\r\nI would definitely, DEFINITELY recommend this class", "rating": 5, "expected_grade": "A", "created": "2012-05-08T14:43:00Z"}, {"professor": "Peter Carruthers", "course": "PHIL209N", "review": "This is really a psych course about decision making. The content is pretty cool and interesting. Carruthers himself is a pretty good lecturer. The class is on the easier side. Each week there is a little reading and quiz in discussion. Besides for that there is a midterm that is basically a few essay questions. You are given different options of prompts beforehand and then you have to answer a subset of those prompts at the midterm. The final is the same format. They grade the exams pretty leniently. The averages when I took the class were in the high 80's. The big assignment in the class is the group paper, which has to be 4000-5000 words. They walk you through the assignment but your experience with it depends on your group. Overall, it was a good class and I'd recommend if the topic interests you.", "rating": 4, "expected_grade": "A", "created": "2020-05-07T16:58:59Z"}, {"professor": "Peter Carruthers", "course": "PHIL202", "review": "PHIL202 is the same as 209, pretty sure. Like everyone was saying, it's a lot more of a psyc class than Phil, but there was still a lot of interesting course material that was really cool to learn.\r\nI had this class over zoom and it was done asynchronously. Each week, he posted a 10 minute video of him introducing the topic, and then two slide shows which taught the topics of the week. Fridays we had a discussion section with the TA.\r\nHere are my thoughts on that: I really wish he would have posted video lectures instead of slide shows. The 10 minute weekly video was always very nice. It was entertaining and intelligent, and I felt myself engaged. The slide shows, though they were very interesting, were not engaging. I found myself always just doing a whole week's worth of material Thursday night before taking the weekly quiz. I think I would have gained so much more from the class if it were done through video lectures, even asynchronously.\r\nStill, overall I found him to be a solid teacher.", "rating": 4, "expected_grade": "A", "created": "2020-12-18T17:23:09Z"}, {"professor": "Peter Carruthers", "course": "PHIL202", "review": "Prof. Carruthers was an enjoyable lecturer and made the class enjoyable, I also had a great TA so that helps. The course content is fascinating and the amount of work is very manageable and the expectations are very clear. Most of the course decisions are founded on some empirical finding, which is nice and kinda cool. The biggest downside was having to read the PowerPoint lectures, I wish they could have been presented verbally. Overall, this was one of the most interesting courses I've taken at UMD and Prof. Carruthers was a big part of that even with the limited interactions.", "rating": 5, "expected_grade": "A", "created": "2021-05-08T20:10:59Z"}, {"professor": "Peter Carruthers", "course": "PHIL202", "review": "Lectures are extremely interesting, and he grades fairly. You can get an A without going to lecture with a little leg work to understand his sometimes confusing slides. Quizzes weren't bad. Would take him again. ", "rating": 5, "expected_grade": "A", "created": "2021-12-16T23:32:38Z"}, {"professor": "Peter Carruthers", "course": "PHIL202", "review": "The lectures are fine - kind of jumbled and he usually gets off topic pretty easily. The content is easy to understand and quite interesting. But his quizzes are awful. Limited time frame to take them, you get a very short amount of time, and you only get one submission. You have to take a quiz every week, read 2 scientific journals, make a discussion board post, and present at your discussion. Not to mention the 5 essay exams. Don't take this class for an easy gen ed, it's way too high maintenance.", "rating": 2, "expected_grade": "C", "created": "2024-02-01T20:39:07.816540Z"}], "name": "Peter Carruthers", "slug": "carruthers"}