{"courses": ["ECON111", "ECON681", "ECON848", "ECON410", "ECON708", "ECON410", "ECON848", "ECON111", "ECON410", "ECON848", "ECON410", "ECON848", "ECON111", "ECON410", "ECON848", "ECON848", "ECON111", "ECON410", "ECON848"], "average_rating": 3.2727, "type": "professor", "reviews": [{"professor": "Peter Murrell", "course": null, "review": "I didn't have to go to class to pass this class basically. It's the dumbest Gened class ever and i regret taking it because he makes the Midterm and Final so hard for no reason. He is also a petty teacher. He calls students out for using phones or laptops. Unnecessary class with an unnecessary prof ", "rating": 1, "expected_grade": "", "created": "2016-05-19T17:32:00Z"}, {"professor": "Peter Murrell", "course": "ECON111", "review": "Word of warning: There's no point in showing up to lectures. I showed up every class with the printed powerpoints (as instructed by him) and found myself hardly ever annotating them because he hardly elaborated on his slides, he just reads straight off of them. The homework is only 15 mins worth of reading for discussion every week (Heath was my TA and he did an excellent job elaborating on the concepts). Honestly though if it wasn't for Econ200 I would have done worse, which is why I only recommend this GenEd if 200 is taken alongside it.", "rating": 2, "expected_grade": "B-", "created": "2017-12-22T01:57:50Z"}, {"professor": "Peter Murrell", "course": "ECON111", "review": "Easy class to get a B in, slightly hard to an A. There are 5 grades. 1st grade: participation quizzes. Once a week in discussion there is an easy quiz based on the assigned readings for the week. Make sure you do the readings. The reading usually took me around half an hour per week. My TA was Heath and he was great and messaged us once a week on what readings to do. 2nd grade: presentation. You make a short presentation with a partner in discussion and present it in discussion. I’m awful at public speaking and blanked at one point and somehow still got a B on it. So dw too much. 3rd grade: midterm. The best way to study for his exams is to do all the practice problems he has available in files on elms. Going over slides can help too but it’s mostly the practice problems. He provides solutions. 4th grade: paper. This is a bit difficult and took me some time but there’s only 1 per semester and it’s due at the end of the semester. Make sure you pick a good article and make a plan. 5th grade: Final. Do the same thing as the midterm. I only studied for each Econ exam for 2-3 hours where I just did his practice problems and got an above average grade each time. And I went to 2 lectures total! His lectures are useless and there’s no point in going. Just make sure to go to discussions.", "rating": 4, "expected_grade": "A-", "created": "2018-05-22T15:30:45Z"}, {"professor": "Peter Murrell", "course": "ECON111", "review": "Prof Murrell is a nice guy and is knowledgeable about the subject but the class is a major headache for a gen ed 100 level course. I thought I could get through this class without a great deal of stress since I took introductory econ courses in the past but that wasn't the case. The lectures aren't particularly helpful and the tests are hard and graded harshly to the point where I needed curves to get a semi decent grade on them. If you need an i series course, look somewhere else.", "rating": 2, "expected_grade": "", "created": "2020-12-20T21:43:34Z"}, {"professor": "Peter Murrell", "course": "ECON111", "review": "Murrell is a great guy and treats students with respect. I thought the course was interesting, however, it is hard for a 100-level gen ed class. It is kind of hard to get an A.", "rating": 4, "expected_grade": "", "created": "2021-01-06T02:58:00Z"}, {"professor": "Peter Murrell", "course": "ECON111", "review": "Honestly, I liked Prof Murrell. If you attend the lecture and participate he will like you and you will like the class. Tests basically make up your grade, so definitely study for them and you will be fine. I took AP Econ in high school, got an A, and took this class and got a higher grade. This class also rarely has homework, just studying and a presentation once a semester.", "rating": 4, "expected_grade": "A", "created": "2021-12-05T21:40:17Z"}, {"professor": "Peter Murrell", "course": "ECON111", "review": "His lectures are vague and the out of class work is mainly watching videos. Attend lecture and participate and he will like you. Its really not that difficult of a course if you have common sense", "rating": 4, "expected_grade": "A", "created": "2022-12-13T21:29:07.564436Z"}, {"professor": "Peter Murrell", "course": "ECON111", "review": "This professor is terrible. The worst teacher and class that I have ever taken in my life. The most boring lectures I have ever attended. He expects you to read countless articles and watch hours of recordings outside of class. Not even close to worth it for an I-series. DO NOT TAKE.", "rating": 1, "expected_grade": "C+", "created": "2022-12-17T04:25:38.310019Z"}, {"professor": "Peter Murrell", "course": "ECON111", "review": "Easy class. I literally learned most of the material from discussion.", "rating": 4, "expected_grade": "A", "created": "2023-12-13T03:12:58.843469Z"}, {"professor": "Peter Murrell", "course": "ECON410", "review": "Really knowledgeable. 3 exams + paper make up all the grading for this class. The exams are difficult but he curves. Always willing to help students outside of class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-22T22:03:52.275837Z"}, {"professor": "Peter Murrell", "course": null, "review": "Good professor. Cares about his students. 3 exams that are reasonable if you study and 1 paper. Lectures can be boring, but overall easy class and very knowledgeable. Would recommend.", "rating": 5, "expected_grade": "A+", "created": "2024-01-24T16:50:56.186135Z"}], "name": "Peter Murrell", "slug": "murrell"}