{"courses": ["ENGL101", "ENGL101A", "UNIV104", "ENGL101S", "ENGL393", "ENGL101H", "ARHU158K", "ENGL391", "ARHU158E", "ENGL101H", "ENGL375"], "average_rating": 4.8667, "type": "professor", "reviews": [{"professor": "Peter Grybauskas", "course": "ENGL101", "review": "Haven't finished the semester yet but he is funny and makes the class interesting. There's a moderate amount of work (not much when compared to what I've heard from friends with other professors). If you're unsure of which professer to take for ENGL101 I would definitely reccomend Prof G.", "rating": 4, "expected_grade": "A-", "created": "2018-10-16T18:29:07Z"}, {"professor": "Peter Grybauskas", "course": "ENGL391", "review": "Prof G. is the man!\r\n\r\nI didn't really know what to expect when I took ENGL391. I thought it would be your run of the mill English class with reading and writing. However it turns out the course was centered around food themes. Who doesn't like food?\r\nThe readings that were assigned were very engaging and surprisingly so were the assignments. He brought in some interesting speakers as well.\r\n\r\nConclusion: if I had to take an english class again I would take him as an instructor for sure.", "rating": 5, "expected_grade": "", "created": "2021-05-15T01:13:07Z"}, {"professor": "Peter Grybauskas", "course": "ENGL391", "review": "Prof. G is a really cool guy. Yeah he's quirky, but it works! Also, the food writing aspect of this class is TOP TIER. Other 391 classes have to write full on essays and stuff while we write recipes, interview chefs, and review restaurants. As a con, I guess he isn't always super clear on what he's looking for in his assignments. But if you just ask him questions in class he's always willing to guide you. Overall, I highly recommend his class.", "rating": 5, "expected_grade": "A", "created": "2021-12-21T00:01:58Z"}, {"professor": "Peter Grybauskas", "course": "ENGL101", "review": "Prof G was awesome! He does not give you lots of unnecessary work, instead letting you focus on the actual papers and projects that matter. He can be a little wonky in class, but he is always helpful and does not set unrealistic expectations. I love this guy.", "rating": 5, "expected_grade": "B+", "created": "2022-01-24T19:51:48Z"}, {"professor": "Peter Grybauskas", "course": "ENGL101", "review": "He's a very passionate, fun, high-energy, Tolkien-loving dude. His class wasn't really for me bc I'm avoidant, so the highly social energy just scared the shit out of me. But if you're not super skittish and love literature then I'd def recommend.", "rating": 4, "expected_grade": "", "created": "2022-11-30T14:21:39.526759Z"}, {"professor": "Peter Grybauskas", "course": "ENGL391", "review": "He is amazing. His food writing class in Italy is so much fun - literally the best study abroad program. He’s really intelligent and is a great teacher, and knows so much about Italian food and culture. If you want to go on vacation for 3 credits, this is your class.", "rating": 5, "expected_grade": "A-", "created": "2023-03-06T14:31:18.598992Z"}, {"professor": "Peter Grybauskas", "course": "ENGL393", "review": "Best professor you could ever have. The workload is very small and he is  a goofball who is fun and entertaining every class. poof!", "rating": 5, "expected_grade": "A", "created": "2023-04-10T02:23:17.768509Z"}, {"professor": "Peter Grybauskas", "course": "ENGL101", "review": "Prof G. (as he claims is his nickname) is an awesome dude. Doesn't give a ton of unnecessary assignments - main focus is on a few big papers that will be spaced out very well across the semester. He loves (and studies) J.R.R. Tolkien and lots of his writing, so much of the content is based upon Tolkien's work. I had no idea who Tolkien was before this class and probably won't ever engage with his work in the future, but Prof. G did a great job of explaining Tolkien's writings and made it really easy for us to write about his works. Sometimes the guidelines for assignments can be vague, but if you ask him or shoot him an email he is always willing to help/explain. If you are more reserved/introverted sometimes classes can be awkward because he hosts discussions on occasional readings, but he doesn't dock your grade if you're shy or anything. He's a super goofy dude and loves joking around in class. Definitely cares about his students and their well-being. He's a very laid back guy - the type of guy that I'd want to hang out with outside of class.", "rating": 5, "expected_grade": "A", "created": "2023-05-04T15:53:56.513278Z"}, {"professor": "Peter Grybauskas", "course": "ENGL101", "review": "Prof. G is very smart and pretty funny. Engl 101 is not a hard class but he tried to make it fun and was also very helpful in improving everyone’s writing skills, being able to find and explain what was weak about some of my work. I’m happy with how I did in the class and it was in part thanks to Prof. G.", "rating": 5, "expected_grade": "A", "created": "2023-05-13T17:34:16.178775Z"}, {"professor": "Peter Grybauskas", "course": "ENGL101", "review": "Prof. G is one of the best professors I've ever heard had at my short time in UMD. Not because he's some genius at teaching or because he changed my life but because he understands the class that he's teaching and acts accordingly based on what his students want to get out of it. ENGL101 is a very easy class and most students in it only want to get their credits and be done. Prof. G understands this and makes the class suitably easy for the students on top of being a legitimately passionate and engaging lecturer when he does give lessons in class. He has a real love for Tolkien and medieval English literature and through his speeches on the material I was able to appreciate a little bit of it as well. He's not a very consistent teacher, quite a few classes are just free time to work, he was absent for 4 lectures over the course of a semester and is sometimes overly energetic when speaking. But this just serves to make the class less of a time sink for students with harder classes and makes it more fun when engaging subjects are actually covered.", "rating": 5, "expected_grade": "A", "created": "2023-08-12T21:38:25.981382Z"}, {"professor": "Peter Grybauskas", "course": "ENGL101", "review": "Prof G, really understand his students and is one of the best professors I had. He is a very understanding instructor when something comes up with his students. He is always reachable with email and loves what he teaches. I was kind go dreading having to take ENGL 101 as a gen ed but he made it a class that was very enjoyable. He also wants to connect with his students and makes sure we can bring out our best work. His lessons are engaging and his way of enthusiasm is never boring. He wants to make sure that his students excel in his class with quick meetings for the final project and tries his best to connect with all his students.", "rating": 5, "expected_grade": "A", "created": "2023-12-04T16:36:38.933313Z"}, {"professor": "Peter Grybauskas", "course": "ENGL375", "review": "He was an absolutely wonderful instructor! He knew so much about Tolkien and taught me so much. We had fun discussions and there was never a dull moment. A wonderful way to experience these books for the first time", "rating": 5, "expected_grade": "A", "created": "2023-12-07T15:38:46.806797Z"}, {"professor": "Peter Grybauskas", "course": "ENGL101", "review": "This class is very easy with Prof G, he makes the classroom fun and from what I've been told by friend's in other engl101 classes he makes you do much less work than normal, and grades very very fair. If you want a professor that will have an impact on you and make the class generally easy, Prof G is your best choice.", "rating": 5, "expected_grade": "A-", "created": "2023-12-13T02:09:28.742472Z"}, {"professor": "Peter Grybauskas", "course": "ENGL391", "review": "Prof G is easily the best professor I’ve had at UMD. Deeply passionate about what he’s teaching, very approachable & responsive when you contact him, and he’s understanding of personal circumstances. Classes themselves are always interesting too, really funny and engaging, and the work is challenging without being overwhelming.", "rating": 5, "expected_grade": "A", "created": "2023-12-22T23:56:02.876435Z"}, {"professor": "Peter Grybauskas", "course": "ENGL391", "review": "I took this course over the winter, so I went into it a bit concerned about the workload, but it ended up being very manageable for a 3-week course. This was a unique kind of professional writing course that was specifically held during the winter, where our writing assignments were based around the work of J. R. R. Tolkien. A good chunk of the workload was simply reading the Lord of the Rings, and our assigned writings were mostly creative assignments that were open-ended (no stressful research papers). Every assignment felt meaningful and relevant, and he was on top of responding to emails if we had questions about the assignments. We had a few zoom meetings where he enthusiastically talked about Tolkien's life and his writing, and where we also got a peak into a study abroad session in Oxford, U.K. I don't know if this course will be offered every year, but if it is being offered and you don't mind spending some extra money to knock out your professional writing requirement during the winter, I could not recommend it more. Even if you're not a book fan, you will definitely enjoy this course more than most other professional writing courses. He's also just a cool guy in general and would recommend him regardless of the class.", "rating": 5, "expected_grade": "", "created": "2024-01-26T05:30:45.861261Z"}], "name": "Peter Grybauskas", "slug": "grybauskas"}