{"courses": ["SOCY661", "SOCY699P", "SOCY443", "SOCY699V", "SOCY699D", "SOCY653", "SOCY699F", "SOCY858", "SOCY889", "SOCY623", "SOCY105", "SOCY498F", "SOCY380", "SOCY616", "SOCY243", "SOCY616", "SOCY889", "SOCY100", "SOCY243", "SOCY644", "SOCY243", "SOCY653", "SOCY245", "SOCY630", "SOCY105", "SOCY245"], "average_rating": 4.5714, "type": "professor", "reviews": [{"professor": "Philip Cohen", "course": "SOCY105", "review": "Prof Cohen is very nice and extremely knowledgeable, but he's very awkward and is so lenient that people in class take advantage of him by not doing homework and not coming to class. I was genuinely interested but the class was just not engaging enough to make me want to keep going. I ended up going to most of the lectures online. ", "rating": 4, "expected_grade": "A+", "created": "2021-12-02T18:05:09Z"}, {"professor": "Philip Cohen", "course": "SOCY243", "review": "Professor Cohen was the greatest professor I ever had. You have to take this course.", "rating": 5, "expected_grade": "A", "created": "2022-09-25T20:14:39.646259Z"}, {"professor": "Philip Cohen", "course": "SOCY243", "review": "Professor Cohen is fantastic. The course was very interesting; I learned a lot about society.", "rating": 5, "expected_grade": "A", "created": "2022-12-24T18:22:00.290677Z"}, {"professor": "Philip Cohen", "course": "SOCY243", "review": "Very nice guy, and really seems to be passionate about his work. He's very funny and has engaging participation. The only downside is participation is random every few days so you have to attend every class to ensure these points. \r\nOnce-a-week inquizative about the weekly chapter, semester-long reading, and lectures are pretty similar to the textbook since he wrote it. \r\nOne midterm, One Final, all multiple choice.", "rating": 4, "expected_grade": "A-", "created": "2023-11-12T21:57:47.848942Z"}, {"professor": "Philip Cohen", "course": "SOCY243", "review": "SOCY243 was a really chill class. Just do the reading (or pay attention during lecture...really no need to do both) and you're easily on track to get an A. Some lectures are really interesting. \r\n\r\nIn general, Professor Cohen is an amazing person who shows sympathy and understanding for his students.", "rating": 5, "expected_grade": "A", "created": "2023-12-21T23:05:58.517242Z"}, {"professor": "Philip Cohen", "course": "SOCY243", "review": "Professor Cohen seems like a nice guy! His lectures were engaging and the videos he chose for class were interesting. There are weekly InQuizitive assignments (13 total) that correlate with a chapter in the online book for the class (written by Prof Cohen). These are self-paced, so you could do them all at the end of the semester until you get 100% on each. There's no limit to the amount of questions you answer, you just have to get the accuracy point value to 100%. Attendance isn't mandatory, but he does randomly give out a simple written assignment in class responding to a video or filling out a survey to take attendance for the day. You never know when these are going to happen so that's an easy way to lose participation points. There is one midterm and a cumulative final which are all multiple-choice. There were some other books that he wanted us to read, but there were only ever like 2 questions on the exams about them.", "rating": 4, "expected_grade": "B+", "created": "2023-12-23T18:05:22.268528Z"}, {"professor": "Philip Cohen", "course": "SOCY243", "review": "Professor Cohen is really nice and straight to the point. He told us that he was available for us to talk to, even if we wanted to talk to him about things other than the course, like stressors happening in other areas or outside of school. This class was an hour and a half lecture twice a week, and not every lecture was super interesting because he goes over notes from each chapter of the textbook. It was boring at times because I had already read the chapter and taken the notes. That being said, this can be helpful if you miss a reading or don't finish one. There was just one midterm, and oftentimes he included a song or video in the lectures for us to think about and discuss if we wanted to. The content of this course was really interesting, and I learned a lot. It is kind of a lot of reading, but it was an easy A and taught valuable information, so I would recommend.", "rating": 5, "expected_grade": "A+", "created": "2024-01-27T00:10:33.786675Z"}], "name": "Philip Cohen", "slug": "cohen_philip"}