{"courses": ["PHIL414", "PHIL828A", "PHIL828B", "PHIL310", "PHIL412", "PHIL328W", "PHIL328L", "PHIL828D", "PHIL209E", "PHIL788", "PHIL688A", "PHIL828K", "PHIL828F", "PHPE408J", "PHIL310", "PHIL412", "PHPE408J", "PHIL328X", "PHPE308X", "PHIL310", "PHIL808K", "PHPE308Y", "PHPE308A", "PHIL310", "PHIL412", "PHPE308Y"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Rachel Singpurwalla", "course": "PHIL414", "review": "Dr. Singpurwalla is probably the best Philosophy lecturer in the department. She really knows Aristotle (and other Ancient Greek Philosophy) well and her lectures prove this. Does a fantastic job teaching material objectively while keeping the class engaged. \n\r\nShe may actually hold the most difficult teaching job on campus -- facilitating undergraduate students on their quest for 'eudaimonia.'\n\r\nDr. Singpurwalla genuinely wants to see students succeed. She is transparent with her grading system. If you want an A: attend all lectures, \r\nread the required text multiple times, review study guide questions, and start paper(s) early!", "rating": 5, "expected_grade": "", "created": "2015-01-29T09:54:00Z"}, {"professor": "Rachel Singpurwalla", "course": "PHIL414", "review": "Phenomenal teacher. Professor Singpurwalla knows her stuff. She explains everything very well and encourages a lot of discussion. I like that we focused on reading one text in great detail.\n\r\nI also visited her office hours and received helpful feedback on my paper topic and on the review sheet for the exam. \n\r\nDefinitely recommend her and Aristotle.", "rating": 5, "expected_grade": "", "created": "2014-05-25T16:05:00Z"}, {"professor": "Rachel Singpurwalla", "course": "PHIL414", "review": "Professor Singpurwalla is the nicest professor in the philosophy department- very approachable and understanding. When someone says something stupid in class, she doesn't mock them or move on, she tries to understand and incorporate it into her point. \r\nLogistics- we studied Nicomachean Ethics- two exams, each covered half of the work. One paper that she makes you do an in class peer review on which is actually extremely helpful. Random reading quizzes (I think 7 during the semester) but you can drop your worst one and they are really easy to answer. She reviews all the time and her exams are directly from what she emphasizes in class. She really knows what she's talking about but lectures in an accessible and easy manner. Refreshing for an upper level PHIL course.", "rating": 5, "expected_grade": "A", "created": "2011-05-17T12:13:00Z"}, {"professor": "Rachel Singpurwalla", "course": "PHIL310", "review": "Professor Singpurwalla was amazing. There are very few professors that not only know their stuff, but are actually good at teaching it. She is one of them. She explains the material in such a thorough way that there is no way NOT to understand. She also reviews at the beginning of the next class so if you're not there, you can know what you missed, but if you were there its a nice reminder. If any effort is put into the class, and you know how to write, you will get a good grade. ", "rating": 5, "expected_grade": "A", "created": "2009-02-02T00:14:00Z"}, {"professor": "Rachel Singpurwalla", "course": "PHIL209E", "review": "The course is discussion-based and attendance to discussions is mandatory. They have quizzes at the beginning of each discussion so if you are late, you miss the quiz, which is 20% of your grade. There are two exams, a midterm and a final, which are easy as long as you memorize the answer to the study guide they give you. There is one essay for the class and its graded somewhat easy because its graded for content and not how well you can write an English paper. Mostly an easy A as long as you take notes in class or get them from someone who went to class. You can get away with not reading the book if you show up to class.", "rating": 5, "expected_grade": "A", "created": "2019-01-20T02:14:10Z"}, {"professor": "Rachel Singpurwalla", "course": "PHIL310", "review": "You SHOULD take PHIL310 with Rachel.\r\n\r\nRachel is the best philosophy teacher I've had and one of the nicest and more understanding professors I've had. \r\n\r\nStructure - Every week you read a text and answer reading questions, write a 300 word discussion post, and respond to a discussion post. There were quizzes after each unit (Socrates/Plato/Aristotle, etc.) which you could find the answers in the slides if you just crt-f. No midterms and the final was just writing a paper that goes more in depth into a topic. The paper could be a podcase/Socratic method paper/or pretty much just anything you want and was really easy. You should be getting an A in this class and you can always asks for an extension if something comes up.\r\n\r\nLectures - The actual content of the class is really interesting and she does a really good job at explaining it. You really end up learning a lot. ", "rating": 5, "expected_grade": "A+", "created": "2022-01-28T19:14:36Z"}], "name": "Rachel Singpurwalla", "slug": "singpurwalla"}