{"courses": ["ENGL437", "ENGL748A", "ENGL373", "ENGL370", "ENGL358A", "ENGL428X", "ENGL327", "ENGL289M", "ENGL142", "ENGL658A", "AMST328Q", "USLT498G", "CMLT679F", "ENGL301", "HHUM329", "HHUM105", "HHUM206", "HHUM328", "HHUM329", "ENGL358F", "HHUM105", "HHUM329", "ENGL142", "HHUM206", "HHUM105", "HHUM329", "ENGL358F", "HHUM206", "HHUM105", "HHUM329"], "average_rating": 4.5161, "type": "professor", "reviews": [{"professor": "Randy Ontiveros", "course": "ENGL301", "review": "Great great teacher! I will admit at first I signed up for his class because he had the highest percentage of A's AND best reviews, but after the first essay, you find that he has made his engl301 class more difficult. It really is not an easy A. After my first submission, I was sorely tempted to drop the class, but he promised to teach us a lot, so I stuck with it. Best decision ever. He taught me so much in one semester and made it seem as though the grade really wasn't important. If a teacher can make students care more about learning than what they got in the class, then that's just amazing. I highly recommend this class! By the end, you will have improved your writing and come out still loving English. ", "rating": 5, "expected_grade": "", "created": "2011-08-15T15:27:00Z"}, {"professor": "Randy Ontiveros", "course": "ENGL301", "review": "Ontiveros is a fantastic teacher. Be warned, though, he has made his 301 class a bit more difficult, so don't expect an easy A (the grade breakdown is therefore inaccurate, as he will warn the students on the first day of this.) I still don't regret taking this class (even though I might not get an A) just because I have learned a great deal about writing from him. He's super knowledgeable and a great teacher. ", "rating": 5, "expected_grade": "", "created": "2011-05-13T03:47:00Z"}, {"professor": "Randy Ontiveros", "course": "ENGL437", "review": "I loved this class and LOVED Ontiveros.  He picked great texts, taught them incredibly well, and he is just an insanely intelligent, friendly, AWESOME guy.  One of my favorite classes I've taken at UMD.", "rating": 5, "expected_grade": "", "created": "2010-12-18T18:32:00Z"}, {"professor": "Randy Ontiveros", "course": "ENGL301", "review": "Professor Ontiveros is by far one of the best professors i have had at UMD. He seriously cares about his students, and LOVES when people come to office hours. In the Literary subculture, I have found that many people take themselves too seriously and would rather hide behind a facade of intelligence than actually explain the things they think and believe -- Ontiveros is everything BUT that. He never tries to intimidate students, and seems to really love what he teaches. That said, 301 being a gateway course, he couldn't take that much liberty with the curriculum... but when he could, he did (making literary comparisons to Eminem and The Hills... unheard of, but AWESOME). Take any class with him you can, I absolutely plan on it.", "rating": 5, "expected_grade": "A", "created": "2010-08-02T18:16:00Z"}, {"professor": "Randy Ontiveros", "course": "ENGL479F", "review": "No one's reviewed Dr. Ontiveros yet!? Wow, he's a really good professor. He does everything he can to make the course inclusive by refraining from use of jargon, making grades a secondary concern, and encouraging discussion. \"Literature of the Chicano Movement\" is definitely one of my favorite courses at UMD. It was a real eye-opener and shifted my English concentration from Shakespeare Studies to Latino/a Studies. Ontiveros is the man. ", "rating": 5, "expected_grade": "A", "created": "2010-05-20T19:51:00Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "Dr. Ontiveros is absolutely wonderful, and one of the nicest, most approachable, and most understanding professors you can get. This was his first semester as a part of Hohum, and I think he did a great job. Hhum105 can be a lot of work, but none of it is particularly difficult. Dr. Ontiveros actually restructured the course partway through the semester to make it easier on us, and occasionally would cancel/postpone readings or assignments to lessen our work load. The only downside to this class was the reading. The main textbook  is very dense and drags on a lot. There are also many supplemental readings throughout the semester, but as long as you just push through them you're good. Other than that, hhum105 was a lot of fun, and people were always willing to participate and discuss in class. There are a couple of smaller projects and then one big capstone at the end of the semester, which counts as the final, and they are only as hard as you make them. The grading was super easy, so as long as you turn things in on time, you'll probably get an A.", "rating": 5, "expected_grade": "A+", "created": "2020-12-16T21:18:56Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "The class was pretty easy. The material was pretty interesting, but there was very little order to it. He often just kinda had assignments that were pretty random and didn't have to do much with the course itself. It seemed a lot like just having an assignment so that we don't ever not have an assignment.", "rating": 4, "expected_grade": "A+", "created": "2020-12-18T17:27:28Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "Awesome professor! He obviously cares about his students and about the course material. He offered to take students out to lunch and just talk about life, which is a really cool way to make a connection especially during online learning. \r\nThe class itself is not too difficult, and as long as you do the work and keep up with the readings (so that you can speak up in class) you should be fine. Love Dr. Onitveros, and if you have a chance to take one of his classes before you graduate do it!", "rating": 5, "expected_grade": "A", "created": "2020-12-20T04:20:11Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "Professor Ontiveros is amazing! He really cares about his students and is just so open and honest that it's refreshing compared to other professors who act like their the only ones with busy lives. I also just loved the ENGL142 course but I definitely believe that it is Ontiveros who made it so interesting and engaging. I 100% recommend taking any course he teaches!", "rating": 5, "expected_grade": "A", "created": "2021-05-05T00:44:43Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "When I tell you that this guy is the goat I MEAN IT! Overall a wonderful Gen Ed to take if you are looking for an i-series. His class was really chill and I learned a lot more about maryland history and its iconic characters than I originally thought I would. He also includes a lot of discussion time in his class which makes it very easy to stay engaged. There is a pretty big capstone project at the end of the semester, however, he is very very lenient with what you do with it and he's very encouraging with that whole process. 10/10 Randy is the man.", "rating": 5, "expected_grade": "A+", "created": "2021-05-13T16:34:34Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "AMAZING PROFESSOR! SO FREAKING COOL! he is always so hip and vibey with his class. There are literally no words I could say to describe how chill this man is. Do yourself a favor, and TAKE HIS CLASSES. Although I only had him for my honors program class, I can just tell he is such a fantastic human being and would be a good professor in any course that he teachers. Randy, if you read this I just wanted to let you know that you have really nice hands. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-17T05:52:28Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "This man might be one of the most chill professors i've had. Although the class (ENGL142) wasn't that interesting, each lecture with Randy was like listening to a ted talk (which kind of grows old tbh). ", "rating": 5, "expected_grade": "A+", "created": "2022-04-23T21:05:21Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "(took class Fall 2021)\r\nDr. O is really an amazing professor. I took this as a part of my Honors Humanities program (so I didn't really have a choice), but I really encourage that anyone take his classes. He is one of the kindest professors I've had at UMD. Despite having over 100 people in the class, he took the time to speak to every student one-on-one just to get to know them. It is also a very easy class, I think I ended up with something like a 99.5%, but the material is very interesting, and he took time to draw relations with the humanities and other disciplines. He is a fun guy, jokes with his students, but also respects our needs (he made the final open book).", "rating": 5, "expected_grade": "A+", "created": "2022-04-27T18:09:30Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "You can tell he definitely is passionate about the class and gets really into the material. He's a nice and caring guy. Amazing professor\r\n\r\nThe class itself isn't too bad for 3 gen eds worth but compared to a normal 100 level class it is a lot of work. Mostly small assignment but a lot of them.", "rating": 5, "expected_grade": "", "created": "2022-05-11T19:39:24Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "Class is easy, if you do the work.\r\n\r\nWork every week, but it's easy.", "rating": 5, "expected_grade": "A", "created": "2022-05-18T03:47:57Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "Professor Ontiveros is a really nice professor who is definitely passionate about Maryland literature and history. Unfortunately, I was often bored in this class. We spent too much time analyzing and reanalyzing the same work of fiction until we all ran out of things to say. Then the silence dragged on. \r\n\r\nWe had a few long-term assignments, but they were not difficult. As long as you do the readings, take notes in class, and watch the videos, you'll do fine on the final exam. The final is composed of multiple choice questions and one long-essay question that focuses on an overarching theme in the class. ", "rating": 4, "expected_grade": "A+", "created": "2022-08-05T21:22:25Z"}, {"professor": "Randy Ontiveros", "course": "ENGL358F", "review": "Prof. Ontiveros is a great professor, he's really passionate about what he teaches and he gives you a good selection of material. Class isn't hard, work-wise, but make sure not to fall behind on readings.", "rating": 5, "expected_grade": "A", "created": "2022-11-16T00:50:46.968421Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "Quizzes are easy and you have unlimited time, to do 5 question quizzes where the answers are directly in the readings/videos. Everything else is just basic classwork, and discussions/lecture are mandatory. Had a 100 in the class before the final project brought my grade down. Final project isn't hard either", "rating": 5, "expected_grade": "A", "created": "2022-11-28T02:52:42.822315Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "Prof. Ontiveros is an enthusiastic lecturer and I could tell that a lot of care went into this class. The readings were interesting and wasn't too much work. However, I often found myself frustrated by the class' disorganization. Discussion boards were not graded according to any kind of rubric/varied across TAs in the beginning which was frustrating. Throughout the semester, I also had no idea what grade to expect on each project I turned in which was not something I've experienced with previous professors. The content was also not reinforced within assignments and much of it felt randomly assigned. \r\n\r\nIn saying this, also I appreciate Prof. O's openness to talk with students about the course. I'd consider taking another, smaller class with him.", "rating": 3, "expected_grade": "", "created": "2022-12-19T19:38:12.234529Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "I took this class fall 2022. He's a cool guy. the only criticism i have is that grading, especially with discussion boards, was a little bit inconsistent. but as long as you put effort in and really do your best with your responses, i don't think it's anything too wildly concerning. otherwise, he's a cool guy and he does make an effort to ease you into academic college life. just keep up in this class (the material is a little random; i don't necessarily agree with how it's formatted but it's possible to learn all the necessary content for the exam) and make sure you study, and im sure you'll do fine.", "rating": 5, "expected_grade": "A", "created": "2023-01-26T00:54:03.185523Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "Don’t get me wrong, he’s a nice professor and I was lucky enough to have a really good TA but the class structure itself was just way too much. There were timed quizzes every lecture about the most boring and confusing readings. I would not recommend this gen ed.", "rating": 2, "expected_grade": "B+", "created": "2023-05-01T04:56:13.336564Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "Class was abit fast in pacing and alittle scattered organizationally but otherwise was pretty fun.", "rating": 5, "expected_grade": "A", "created": "2023-05-03T21:48:29.699201Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "Great professor. Shows that he really cares about what he teaches and the students he is teaching. 10/10 would recommend.", "rating": 5, "expected_grade": "", "created": "2023-05-15T21:11:46.435969Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "Something switched up this semester. The other 2* review sums it up well. The workload for this class is just too much for a gened and yeah the readings and Kahoots every class are so annoying, but the content isn't hard. There's also a final for this class too which is very unnecessary. There are graded field trips for this class but done on your own time so you have to schedule those independently. Randy has a sense of humor but it's easy to just snooze throughout the lecture. I do not recommend taking this class because of the workload, but if you are to definitely do not take it alone.", "rating": 2, "expected_grade": "A", "created": "2023-05-16T00:50:09.661632Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "The class itself seemed like it was buffed from the previous one. There was a timed 5-question kahoot (30 seconds for each question) for the readings that you have to read prior to class. Some readings were bland, but some of them were good. We had two projects and a final exam which consisted of vocab, the readings you do for the class, and interpreting questions. Overall, Ontiveros is a good lecturer, but the content seems a bit dry to stay attentive.", "rating": 4, "expected_grade": "A", "created": "2023-05-18T14:12:41.285169Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "Fun class, learned a lot. Material can be a little mundane at times, but I really liked him as a lecturer and as a person. Would highly recommend.", "rating": 5, "expected_grade": "A", "created": "2023-05-22T01:32:14.774264Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "Ontiveros is pretty nice and understanding, and he will give you extensions if you ask for them. If you're not super into English or history, I might think twice about taking this class because you kinda have to read all the readings as there are weekly quizzes on them and they are also on the final exam. It seemed like a lot for a 100-level gened because there were also reading journals, field trip reflections, and 2 projects. The class itself is super easy, just might take some time. Its pretty easy to get an A in this class if you do the readings.", "rating": 4, "expected_grade": "A", "created": "2023-05-30T20:26:21.988672Z"}, {"professor": "Randy Ontiveros", "course": "ENGL142", "review": "I would not recommend taking this class if you do not like to read and really analyze historical texts/poems. If you do, then by all means, take it because you would really enjoy this class. There is a LOT of reading. And lots of the texts are really hard to read because it's old English. Lectures were usually the professor just talking the entire time with a powerpoint - he did explain concepts very well and was very passionate about the material, but since I wasn't passionate or that interested in Maryland history at all, it was very boring to me. In discussions, all we did was talk and analyze the texts, that's it. There were occasional discussion boards. Throughout the course, there were 2 larger projects - I think. Those required some research, but it was fairly easy. There's no exams or quizzes, but the final was HARD. Closed notes and it's material from the entire semester. For someone who didn't pay attention the entire semester, I crammed the night before, and did not do too well. So, do well throughout the semester so that if you take the hit on the final, you can still end with an A or A-. ALSO, you're required to go on 2 field trips on your own time (he gives you a list of places and you can even ask him if you want to go somewhere that's not on the list. Even though this wasn't ideal, I went to a museum in DC - it was actually really fun because I went with my friends who were in my class (yes, it's not a class field trip). Then you have to write a reflection about your trip and relate it to the class material. One more thing I want to add is that you're required to write 4 journal entries (500 words each) throughout the semester, so those also take up some time. Overall, great professor, but if you want to get an A, you have to read and understand the material.", "rating": 3, "expected_grade": "A", "created": "2023-06-21T15:10:50.580478Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "There's a lot of reading and their were reading quizzes every lecture. Honestly this class is pretty miserable, but it's doable and Dr. O is very chill and a nice guy.", "rating": 4, "expected_grade": "A", "created": "2023-09-18T15:38:12.221516Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "if you put in the effort, there is no way ur getting less than an A in this class. it's one of the most bare minimum classes i've ever taken. they are super understanding and lenient. the actual course content is fairly interesting (you should be expecting this content because you signed up for honors humanities... so don't expect to learn much outside of arts and humanities). the only complaint i have is the five minute quizzes but you get used to them after a while. there is regular reading but every year, they honestly lessen the courseload so don't even worry about it.", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T01:10:27.399304Z"}, {"professor": "Randy Ontiveros", "course": "HHUM105", "review": "Didn't love the class, but Dr. O was a good professor. Readings ran the gamut from downright silly to incredibly interesting to painfully boring. Dr. O was clearly passionate about what he was teaching, but I'm just not sure his and my interests were the same.......... guess you need to love the humanities for some of these things. Overall, friendly and approachable, readings almost every week and quizzes on all the readings, definitely needed a couple hours a week for homework but the exams are easy. I mean, it's humanities, you can always bs anything.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T03:11:35.381065Z"}], "name": "Randy Ontiveros", "slug": "ontiveros"}