{"courses": ["ENST200", "ENST411", "ENST441", "ENST611", "ENST472", "ENST499X", "ENST499Y", "ENST689X", "ENST689", "ENST472", "ENST499Y", "ENST689", "ENST200", "ENST411", "ENST441", "ENST472", "ENST499X", "ENST499Y", "ENST611", "ENST689", "ENST689X", "ENST388", "ENST472", "ENST499Y", "ENST689", "ENST200", "ENST411", "ENST472", "ENST499X", "ENST499Y", "ENST611", "ENST689", "ENST689X", "ENST472", "ENST499Y", "ENST689", "ENST200", "ENST411", "ENST441", "ENST472", "ENST499X", "ENST499Y", "ENST611", "ENST689", "ENST689X"], "average_rating": 3.4286, "type": "professor", "reviews": [{"professor": "Raymond Weil", "course": "ENST200", "review": "My favorite professor so far, and taught my favorite class so far. He has so much experience in the field, and he brings that into the classroom to help make it engaging. However, I think that you do have to think that studying soil is fun to have fun in his class (It's something I didn't expect to do, but I definitely do now!)", "rating": 5, "expected_grade": "A+", "created": "2017-12-30T20:33:47Z"}, {"professor": "Raymond Weil", "course": "ENST200", "review": "This is probably the most difficult class I have ever taken at this school. DO NOT TAKE THIS FOR A GED ED. I unfortunately made that mistake. Most people are in this class to meet a degree requirement. I foolishly took this as my lab. The professor only lectures, leaves very little time for questions (if he calls on you), and makes office hours unclear. He is nice and sometimes told interesting stories, but he is took distinguished in his field to actually care about our learning. He cares about sharing his knowledge, but not preparing us for the exams. There is no exam reviews or anything like that. He'll post an extremely long list of terminology to study, which is barely any help. There are no recent practice tests available. Luckily, he curves the tests a few points when everyone did bad and the class is EXTREMELY curved. For reference, my 68 was equivalent to a B. But it was a grind to say the least", "rating": 3, "expected_grade": "B", "created": "2023-05-17T23:03:32.920409Z"}, {"professor": "Raymond Weil", "course": "ENST200", "review": "DO NOT TAKE THIS CLASS AS A GENED! If you do have to take this class as a major requirement, try to get Eni Baballari as your lecture professor--she is much more helpful and responsive about questions. I had to take this class as a major requirement and it is one of the most difficult classes I've taken at UMD. Dr. Weil constantly gets off track during lecture (to the point that I stopped going and just read the textbook to learn the content) and does not provide any sort of support for office hours or exam reviews. He puts out a \"study guide\" which is really just a long list of general terms and concepts to know, but then the exams are really specific and detailed. Also if you miss an exam- even for an excused absence- they will NOT let you take a makeup exam, so be prepared to try your best on every exam. Overall not a great professor- he's accomplished and seems nice as a person but just doesn't know how to teach and needs to retire (I mean come on you've been teaching it for 10 years and still can't provide any support or structure for students?). \r\nIf you can't get Eni for your lecture professor just make sure to regularly read the textbook as it has all the lecture content without any of the drifting off topic that Dr. Weil constantly does.", "rating": 1, "expected_grade": "B", "created": "2023-11-30T01:22:33.383079Z"}, {"professor": "Raymond Weil", "course": "ENST200", "review": "He's a really great teacher who knows a TON about the subject. He is extremely knowledgeable and explains things REALLY well. However, he is not the most captivating teacher although his tangents and extra tidbits are pretty interesting. Tests are pretty hard but nice curve.", "rating": 4, "expected_grade": "B+", "created": "2023-11-30T04:16:05.539540Z"}, {"professor": "Raymond Weil", "course": "ENST200", "review": "This class is extremely hard and time consuming. The exams are the majority of your grade for the class and all other work you have to do is a very minimal percentage. Ray is very knowledgable in the content but does not know how to teach. He goes on rants about stuff that although might be interesting, it is not beneficial towards doing well on exams. There are 3 midterms and a final in the class which makes for a lot of studying. The class average on exams tends to be around 65% which is awful. He does curve the exams and the final grade but it does make it stressful right until the end. I would not recommend taking this class with him. I have heard Eni is a much better teacher so maybe take it with her if you have too.", "rating": 1, "expected_grade": "B", "created": "2023-12-14T15:08:20.932245Z"}, {"professor": "Raymond Weil", "course": "ENST411", "review": "Dr. Ray \"Money\" Weil is a blessing, however if you like a coherent class structure, rational exams, and As then ENST411 (Soil Fertility) with The Radish King is not for you. That said, if you desire to learn about micronutrient deficiencies and the Nitrogen cycle—with a heavy does of African soils and agriculture—this class is a MUST.", "rating": 5, "expected_grade": "B", "created": "2023-12-23T01:19:35.957526Z"}, {"professor": "Raymond Weil", "course": "ENST200", "review": "Honestly, I think the other negative reviews on here should be taken with a grain of salt, and are most likely people who don't really understand how to study properly for this class and/or didn't take advantage of the many resources provided by Dr. Weil and Eni. Pretty much every concept in this class all builds off each other, so all you really have to do is stay on top of your studying, and make sure you're studying in a way where you're actually applying and understanding the concepts rather than just memorizing terms. The textbook is written by Dr. Weil himself which is really helpful for studying, and he makes it clear what topics you should/shouldn't study before each exam. Overall I never spent more than a few hours a week studying for this class and ended with an A- and only a few points away from an A. \r\n\r\nThe class is also super interesting in general, and Dr. Weil is an incredibly knowledgeable and awesome guy with so many cool and unique experiences around the world, and he can be really funny during lectures. I went into this class thinking it was a bit silly to learn about soil, but soil science is definitely one of the most interesting classes I've taken at UMD. Both Dr. Weil and Eni are extremely kind and caring and you can tell they want their students to succeed. In fact, I was going through a pretty hard time during the semester especially after the first exam, and Dr. Weil noticed and went out of his way to reassure me of my academic abilities despite having never met me before (I am very quiet in class and never go to office hours) which I was extremely appreciative of. \r\n\r\nOverall this class gets a reputation for being pretty hard but really you don't have much to worry about. I'm not going to lie, the exams are very challenging, but Dr. Weil does this for a reason and always has a very big curve which he explains very well in the syllabus and is incorporated into ELMS grading throughout the semester, so I never worried about what my grade was. Lab was also pretty fun in my opinion but can be very messy at times so don't show up in white or any clothes you wouldn't want to get stained.", "rating": 5, "expected_grade": "A-", "created": "2024-02-09T16:36:00.517653Z"}], "name": "Raymond Weil", "slug": "weil_raymond"}