{"courses": ["ENGL390", "ENGL390", "ENGL390", "ENGL390", "ENGL390", "ENGL390"], "average_rating": 4.75, "type": "professor", "reviews": [{"professor": "Richard Reynnells", "course": "ENGL390", "review": "take him. that's the short answer. just take him. take him. take him. it will be the funniest and most comfortable class of your life. just look at the grade data. he is a great guy and will treat you with nothing but respect-- he got to know us all and made class seem like a get-together. you get out early if things move smoothly. take him. join his class. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-04T23:52:26Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "super duper lenient.. Just do the work and you'll end up with an A+", "rating": 4, "expected_grade": "", "created": "2021-07-10T20:34:49Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "Can't recommend him enough, super invested in teaching the class and very caring/understanding if you need any extensions...a bit eccentric but with all the extra credit opportunities he gives there's a reason that the majority of students get an A+ in his class, one of the most memorable professors I've had at UMD", "rating": 5, "expected_grade": "A+", "created": "2021-11-02T13:58:55Z"}, {"professor": "Richard Reynnells", "course": null, "review": "JUST TAKE HIM", "rating": 5, "expected_grade": "", "created": "2021-12-10T23:39:07Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "He's the sweetest person ever! You will love him. I don't regret taking the class with him. While he is great, the class is such a disrespect to to everyone's time. The class isn't hard but the assignments are so unhelpful and unnecessary. Not to mentioned, the class is about 3 hours long for no reason what so ever. Something that can be said in 5 minutes gets dragged for an hours. \r\n\r\nHate the content of the course but loveeeeeee the professor. He is the most understanding and compassionate person you will ever meet.", "rating": 4, "expected_grade": "A+", "created": "2023-10-28T23:45:05.182244Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "TAKE HIM PLEASE!! He is very nice and his class is very easy. It nearly impossible to get a B in this class. Just do the assignments and you will at least get a B. Only down side is that his class is long and just him talking about his slideshow. JUST TAKE HIM!!", "rating": 5, "expected_grade": "A+", "created": "2023-11-19T02:11:19.205736Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "Literally only 2 downsides to the class - you have to turn in everything hard copy, and the lectures are super long and dry. The content is also super pointless for any moderately competent writer, but that's not his fault, most of the assignments are mandated in some fashion by the department. \r\n\r\nBut, you will get an A. Pretty much impossible not to as long as you put in like 10% effort to the class.", "rating": 5, "expected_grade": "A+", "created": "2023-12-22T16:29:49.904225Z"}, {"professor": "Richard Reynnells", "course": "ENGL390", "review": "I've literally never written a review but I just had to for Dr. Reynnells. He is one of the most approachable, understanding, and chill professors I've ever had during my time at UMD. All his assignments are not only incredibly useful in advancing in your professional career (ex. resumes, cover letters, letters of recs, proposals, etc.) but he also allows you to resubmit your work after you receive a grade/ feedback to earn points back. He is also someone who is willing to sit and talk to anyone who may be going though a tough situation and is incredibly accommodating and understanding. He is one of the few professors at UMD that I have been able to develop a connection with and he truly wishes to see all his students succeed! HIGHLY RECOMMEND!", "rating": 5, "expected_grade": "A+", "created": "2024-02-18T06:49:42.093811Z"}], "name": "Richard Reynnells", "slug": "reynnells"}