{"courses": ["ENGL398B"], "average_rating": 1.7895, "type": "professor", "reviews": [{"professor": "Robert Harris", "course": "ENGL394", "review": "Overall, he is nice and understanding professor. However, it was his first semester teaching, so he was a little bit disorganized. He didn't give us his instructions for the assignment until a couple days before the assignment was due. This is an easy class as long as you keep up with assignments and turn them in on time. Make sure you complete your rough drafts also because he will grade it on completion. Also, don't waste money on the textbook you will not need it. ", "rating": 3, "expected_grade": "A", "created": "2022-05-17T00:44:36Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "Never take his class. His class is extremely tough. His lecture is so boring and he doesn't give us any examples of essay but he expects us to write exactly how he want. Because of his too high expectation, the average grade on final draft of an essay was 53!! Also, I was so shocked when he announced that there is an Exam in the class cuz I never had exam in English class before. Anyways, never take his class. it's better to eliminate him from the UMD!!", "rating": 1, "expected_grade": "", "created": "2022-10-29T17:33:20.757957Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "Just don't. Avoid his class at all costs.", "rating": 1, "expected_grade": "", "created": "2022-11-03T04:22:41.764363Z"}, {"professor": "Robert Harris", "course": "ENGL398B", "review": "This class is not hard if you keep up with the course but oh my god this man does not stop complaining. He once lectured the entire class for 30 minutes over how bad our writing was. Extremely tough grader. He seems like he would be really nice outside of a classroom setting but absolute horrible inside the class. He cannot take any criticism and just belittles and complains about students.", "rating": 2, "expected_grade": "B", "created": "2022-12-15T01:13:43.094680Z"}, {"professor": "Robert Harris", "course": "ENGL393", "review": "AVOID THIS PROFESSOR AT ALL COSTS\r\n\r\nDr. Harris seems like a cool guy outside of class, but DON'T LET THIS FOOL YOU. This class BOILS MY BLOOD every day. I am seriously considering taking a W just so I can take it with someone else. Easily the WORST professor I have had at UMD by far. \r\nHe will project a full slide of text and then just pause and make you take notes by WALKING AROUND AND CHECKING YOU LAPTOP SCREEN or else he will call you out for not taking notes. He will make you SIGN IN AND OUT of class every day and if you don't legibly put your name you won't get participation credit. He will take PERSONAL OFFENSE if you try to take a picture of the wall of text he has on the projector and CALL YOU OUT in front of the class every time you try it. He suddenly decided he wants to have a pop EXAM in an ENGLISH CLASS. Like what??? You will get no participation credit if you listen to music during class, use your phone, or don't pay attention. Literally would rather take the 10% grade hit to skip class than show up to HIGH SCHOOL again. \r\n\r\nIf you break the rules: (Copied from his Google Slide)\r\n\"Failure to comply with the above (and in the syllabus) classroom expectations will warrant a removal from the class that day.\r\nRepeated offenses will result in escalation.\"\r\n(The \"above\" he references is taking pictures of slides, having headphones in, or being on your phone)\r\n\r\nHe has no idea how to use ELMs (in his defense he is a new professor) and you will be eternally confused and have no idea what is due and when. This class gives me more anxiety than my major classes. He comes up with all sorts of assignments where the requirements are poorly documented or just plain wrong. \r\n\r\nOnly saving grace is so far he basically gives everyone 100% on stuff. Still not worth it in my opinion, at all.", "rating": 1, "expected_grade": "A-", "created": "2023-02-24T19:49:13.100623Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "Literally could be the worst professor I've ever had. Started the semester a fairly chill prof, and then idk what happened but he did a complete 180. Started lecturing us every day about how we aren't meeting his expectations and half the time it felt like he was bringing personal feelings into class. I seriously think he should pursue a different career bc it feels like he HATES teaching. \r\nHe came to the first day of class about 30 min late. This wasn't the only time he was late for class. He once said the only way late work will be excused is if you're in a coffin or if you're in a hospital bed. He once gave us what felt like a pop midterm where it was 3 pages front and back and handwritten. We had 30 min to do the MIDTERM. For the last 10 min, he goes ' I don't wanna be an asshole so you can use notes ' as if that was a saving grace. He would constantly talk about how he gets paid at the end of the week so he doesn't give a fuck. \r\nI really hope he quits or gets fired because I don't think he himself OR his students want him to be a professor.", "rating": 1, "expected_grade": "", "created": "2023-03-06T17:43:30.239227Z"}, {"professor": "Robert Harris", "course": "ENGL101", "review": "The worst teacher. The assignments make no sense and are unrealistic. He has a bad attitude which makes the overall course a dread.", "rating": 1, "expected_grade": "", "created": "2023-03-09T01:18:40.033890Z"}, {"professor": "Robert Harris", "course": "ENGL101", "review": "everything the one-star comments said is true.", "rating": 1, "expected_grade": "", "created": "2023-03-09T01:22:44.811977Z"}, {"professor": "Robert Harris", "course": "ENGL393", "review": "Exactly what the other review said for ENGL393. He seems like he'd be a cool guy, and it seems like he is outside of class or if you talk to him, but the way he treats you with such disrespect in class will make you hate him and yourself for ever signing up for this class. He very poorly communicates what's expected of you, and so consequentially his grading is just as arbitrary. Good luck learning anything from his \"death by powerpoint\" presentations and all-caps tirades either. DO NOT TAKE HIM. I know there are many bad teachers for 393, but there are other classes too for professional writing in the 39x courses... I wish I had known before this professor.", "rating": 1, "expected_grade": "B", "created": "2023-03-13T22:37:58.363385Z"}, {"professor": "Robert Harris", "course": "ENGL393", "review": "This professor is disorganized, petty, and downright disrespectful. He treats it like a high school class, fully expecting every single student to be present, gets pissy when there isn't a 100% attendance rate, and takes it out on the people who are actually in the class. Also, he has canceled class an hour before it begins multiple times, making it seem like he doesn't care about the class-- or our time-- at all. He also refused to let me make-up an assignment when I was sick, and I know I'm not the only one. Additionally, he'll walk through the aisles of students to make sure your computer screens are relevant to the course at hand... Which again, really feels like high school. And then there's his grading criteria, which is rarely clear, and often asks you to repeat yourself in different parts of the assignment. It's anyone's guess when the assignments are actually due, as the due dates change every class (though this might have been him trying to be nice?). He seems like a nice enough guy out of class hours and I honestly think he just hates teaching, and doesn't have the emotional maturity to keep that hatred in the right lanes.", "rating": 1, "expected_grade": "A", "created": "2023-04-24T17:15:25.846040Z"}, {"professor": "Robert Harris", "course": "ENGL393", "review": "This guy is by far the worst professor I've had at UMD. I was in his once a week section and while listening to him in class, it seems like there is nothing about him that makes him qualified to teach a classroom of college students. All he does is enforce deadlines and treat us like he deserves all the respect in the world. He would always walk up and down the aisle right next to me to make sure everyone was taking notes. If you weren't paying attention and taking notes, he would point it out to you in front of the whole class. On top of this, he would have us do things like sign in and out of class, pick people to read slides out loud, and even went so far as to have an exam for an English class (which he didn't tell us about). I'm almost certain that the \"exam\" (which was more of a quiz) was just an excuse to make sure people pay attention from that point on. Another thing is that there were no late deadlines on canvas, so you couldn't submit any assignment late without having to ask him. Even then he would only allow you to do this once and still penalize you. For assignments like first drafts, if you missed the deadline you would get a zero on the peer review as well. He has told us many times that he didn't care if something has gone wrong on our end that made us unable to submit on time and how we were just being irresponsible and lazy, despite him admitting that he doesn't want to grade our assignments because he's lazy. This guy is petty, egotistical, and lazy. Avoid him or else this class will be much harder than it needs to be.", "rating": 1, "expected_grade": "A", "created": "2023-05-10T20:46:14.009060Z"}, {"professor": "Robert Harris", "course": "ENGL393", "review": "Great professor. I see some complaints that I think are a bit off based, but I will admit, he's demanding and a hard professor. But he truly cares, so yes, he walks around, checks up on us, but he is very knowledgeable about the content and has taught on every level. So if you are not trying to work, then this is not the class for you. You will absolutely earn your grade with Dr. Rob. I appreciated his feedback and toughness because he truly taught Technical Writing and I learned.", "rating": 5, "expected_grade": "A", "created": "2023-06-14T21:02:09.309164Z"}, {"professor": "Robert Harris", "course": "ENGL101", "review": "Lots of demanding work for english 101 and put his mood on to the class almost like highschool. Just trying to get by, kinda dull class.", "rating": 2, "expected_grade": "A-", "created": "2023-11-10T18:59:36.357207Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "Class busy work activities are not tough but they are time consuming at times but thats to be expected as a writing class. However, on big writing assignments it is like he expects you to read his mind when it comes to grading. He gives draft assignments and gives little to no crucial feedback and you'll think you're fine and then you'll get your final grade back he'll give completely different feedback. He should work on his feedback and make it more valuable instead of it just being surface level. Overall a \"fine\" professor but with hindsight I'd probably take a different professor.", "rating": 2, "expected_grade": "A", "created": "2023-11-10T21:03:25.777049Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "I don't really understand the bad reviews. Granted, I took ENGL 394 in an asynchronous style, but he wasn't a bad professor. The only part of the class that I didn't like was how we were put into groups of 3 for each discussion post and part of the grade was replying to a peer, but the peers I was with would never complete the post in a timely manner, so I would often forget to reply and get points off. But that is my fault.", "rating": 5, "expected_grade": "A", "created": "2023-11-13T22:10:31.422586Z"}, {"professor": "Robert Harris", "course": "ENGL394", "review": "this man is a very poor communicator, especially for an asynchronous class.  he also accepts no late work, so 12:01 means that you could get a zero on an assignment. the grading is also very skewed, making some assignments worth significantly more than others, so be sure to keep an eye on that.  the discussion groups are also made of about 3 people, which makes it nearly impossible to get ahead on discussion assignments, as you are waiting for the same 2 people to make a post to comment on because if you don't do this you will also lose a lot of points.  Take this class for the easy A and Rob is making that a much harder-to-read goal. taking it fully asynchronous is also very hard to remember that it exists, especially because this is a junior-level writing class and quite literally everyone taking it has more important things to think about", "rating": 1, "expected_grade": "B+", "created": "2023-11-15T04:22:42.726648Z"}, {"professor": "Robert Harris", "course": "ENGL101", "review": "Extremely tough grader, but his comments or criticism are not helpful at all! So I consistently get the same grades, also it seems like this guy hates his job sometimes. The assignments aren't hard if you keep up with the work, but I wouldn't take this class with him he made it very frustrating with the copious amount of work and vague grading...", "rating": 1, "expected_grade": "B", "created": "2023-12-15T15:05:45.629769Z"}, {"professor": "Robert Harris", "course": "ENGL101", "review": "he is incredibly disrespectful, within the first week saying ‘there is a reason you all are here’ as if we are dumb. his feedback is incredibly poor on the drafts, he will tell u that u did a good job and then next thing you know you are a receiving a C. he does make u sign in and out which is incredibly stupid. Also he gets so mad when u don’t do the stupid textbook readings, if u have taken any english class ever u don’t need to. he’s decently nice and pretty understanding when it comes to work but those are his only good qualities and that’s only if u catch him in a good mood.", "rating": 2, "expected_grade": "B+", "created": "2023-12-19T19:50:47.846508Z"}, {"professor": "Robert Harris", "course": "ENGL101", "review": "The fact the class is ridiculously easy props up his honestly poor teaching.\r\n\r\nI don't think I learned a single thing from his teaching in class. If he assigned all of the writing assignments at the very start of the semester I think I would have largely produced the same essays.\r\nHis teaching style is hard to explain. He really doesn't teach concepts clearly at all and will ask very open-ended vague questions to the class and then be shocked when no one raises their hand. While I participated more than most of the class I often felt like I was taking a shot in the dark when answering questions and could be completely off base with my answer. \r\nFor an English professor, this is honestly quite a shocking problem to have as I would expect him to be the most clear and concise teacher however that is not the case at all. \r\nOverall turning the work in on time and not procrastinating to an insane degree on the writing assignments will get you a pretty decent grade in the class. \r\nOh and one more thing. The review about him putting his mood on the class like we are in high school is absolutely correct. If a lot of people are absent or we didn't read the textbook pages he would be in a mood and either assign bs busy work or just cancel class/end early.\r\nOh and another thing. He is extremely disorganized on canvas so knowing what reading we were supposed to have done was literally impossible. Like no matter how hard you looked the dates would all be conflicting due to him canceling and rescheduling things that you had no way to figure out what you were supposed to have read.", "rating": 2, "expected_grade": "A-", "created": "2024-01-04T04:33:24.831844Z"}], "name": "Robert Harris", "slug": "harris_robert"}