{"courses": ["INAG110", "INAG110S", "INAG110", "INAG110S", "INAG110", "INAG110S", "INAG110", "INAG110S", "INAG110", "INAG110S", "INAG110", "INAG110S", "INAG110", "INAG110S"], "average_rating": 4.8667, "type": "professor", "reviews": [{"professor": "Robert Ballenger", "course": "INAG110", "review": "Easy class. Good teacher. Fair grader", "rating": 5, "expected_grade": "A", "created": "2018-12-22T17:04:31Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Great guy and professor. I felt like I learned a lot from his class, and he made the class engaging and interactive. He's a bit tougher grader than some other OC professors (a.k.a. you're going to have to work a bit for your grade) but the payoff is a great speech learning experience. Would def recommend his course", "rating": 5, "expected_grade": "A", "created": "2021-01-12T17:21:14Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Prof. Ballenger handled online classes and teaching very well. He is very approachable during and outside of class. The speeches make up the majority of the grade with a few participation assignments. He grades pretty fairly and gives constructive comments for improvement. This class is one of the few ones I enjoyed during Zoom University. ", "rating": 5, "expected_grade": "A", "created": "2021-04-28T02:33:45Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Very easy class, but quite boring if I'm being honest. It was so formal for a public speaking class with very silly assignments. There was so much emphasis on outlines which is kinda weird I guess. Very easy but if you can take someone more exciting then I would.", "rating": 3, "expected_grade": "A", "created": "2021-06-01T16:54:26Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "No one wants to take INAG110, but since you have to make sure to take it with Mr. B. He is such a down to earth and caring professor. He wants everyone to do well and grades relatively easy. I do not like public speaking but Mr. B made lectures engaging and had a class environment that it was easy to make friends in. You have to do 4 speeches, but get notecards for all of them and the midterm/final is so incredibly easy it's not even funny.", "rating": 5, "expected_grade": "A", "created": "2022-06-08T01:32:38Z"}, {"professor": "Robert Ballenger", "course": "INAG110S", "review": "Mr. B is a really nice teacher and you can tell he's a professor who's really enthusiastic about what he teaches. Talking in front of a class is hard enough but he's a really non-judgemental guy. The only bad thing i would say is he doesn't give grace periods for the length of speeches so if you're over or under time even by a second you will get docked a good amount of points. other than that he is a pretty fair grader", "rating": 5, "expected_grade": "A", "created": "2023-05-11T03:34:35.788051Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Came to this class hating public speaking, still dont like it but I feel like my skills have improved thanks to the learning environment that Mr. Ballenger created.", "rating": 5, "expected_grade": "A+", "created": "2023-05-12T19:39:29.801301Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Great professor for INAG110. Highly recommend!", "rating": 5, "expected_grade": "A+", "created": "2023-05-21T19:52:42.408106Z"}, {"professor": "Robert Ballenger", "course": "INAG110S", "review": "Mr. Ballenger is great. Already took COMM107, so I decided to take this class as an elective and also to practice more with my speaking. He is very friendly and patient, and he is very encouraging and understanding of his students. He is also a very fair grader. Take this class with him.", "rating": 5, "expected_grade": "A", "created": "2023-09-19T17:07:44.434026Z"}, {"professor": "Robert Ballenger", "course": "INAG110S", "review": "My goat, W mans. Assignments are graded fairly, fun class,", "rating": 5, "expected_grade": "A+", "created": "2023-11-07T21:50:27.694728Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "The Goat. Funny with his dry humor, makes you feel better about speaking. Grades fair and understanding, nice guy. Makes you feel more motivational and his level of calmness makes you speak better.", "rating": 5, "expected_grade": "A", "created": "2023-12-04T17:09:45.692654Z"}, {"professor": "Robert Ballenger", "course": "INAG110S", "review": "I LOVED Mr. B. He was so chill and nice. I never missed a class because it never felt draining or annoying to go to. He creates an environment of encouraging comfortable vibes to help you with public speaking. He understands that many people do not enjoy public speaking and helps you figure out ways to succeed in his class. His little jokes make such a difference. I really enjoyed having him and 100% recommend taking him for this Gen Ed requirement.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T16:21:06.533749Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Very very nice professor who is understanding and very accommodating. I highly recommend taking him for this course because he does help teach motivation and get you prepared for public speaking. This class would not have been my first choice by any mean, but I am glad that I took it with Mr B because he did help a lot with my public speaking comfort.", "rating": 5, "expected_grade": "A", "created": "2023-12-10T22:27:14.283635Z"}, {"professor": "Robert Ballenger", "course": "INAG110", "review": "Just the best teacher. Didn't care that my presentation were obsessively about cars (240sx)", "rating": 5, "expected_grade": "A-", "created": "2023-12-13T04:23:30.295798Z"}, {"professor": "Robert Ballenger", "course": "INAG110S", "review": "The BEST professor I've ever had. He's funny, encouraging, understanding, and makes it clear he really cares about his students and wants them to succeed. He's a very lenient grader, offers great feedback on speeches, and offers plenty of opportunities to practice your speaking through impromptu speech activities.", "rating": 5, "expected_grade": "A+", "created": "2024-02-06T02:31:37.320784Z"}], "name": "Robert Ballenger", "slug": "ballenger"}