{"courses": ["KNES100O", "KNES131V", "KNES157O", "KNES289R", "KNES497", "KNES485", "KNES389D", "KNES225", "KNES346", "KNES287", "KNES612", "KNES225", "KNES497", "KNES225", "KNES287", "KNES225", "KNES346", "KNES485", "KNES497", "KNES225", "KNES287", "KNES346", "KNES225", "KNES287", "KNES346", "KNES497", "KNES287", "KNES346", "KNES497", "KNES225", "KNES346", "KNES485", "KNES186", "KNES225", "KNES287", "KNES225", "KNES346", "KNES485", "KNES498M"], "average_rating": 4.8571, "type": "professor", "reviews": [{"professor": "Ronald Mower", "course": "KNES289R", "review": "There weren't a lot of reviews for Dr.Mower so I was very hesitant to take this class at first but now I am very glad I did. Dr.Mower is a very engaging professor that will keep you listening the entire class. I am generally someone who does hw in my gen ed classes but I couldn't in this class because I didn't want to miss anything. He is also young and relatable and tries to connect with his students. The class is not very hard but it is essential to go to lecture to be able to write good essays. There were 2 essays, 2 projects and 2 quizzes which isn't bad at all and he's very helpful during office hours if you're having trouble with any of the assignments. Hands down the best class I've taken at UMD so far in terms of the topic and the professor.", "rating": 5, "expected_grade": "A", "created": "2019-11-21T16:34:45Z"}, {"professor": "Ronald Mower", "course": "KNES225", "review": "I took this class as a last-minute class because it satisfied a gen ed code for me and sounded interesting, and I'm really glad I did. Dr. Mower is so passionate about what he teaches and genuinely cares about each and every one of his students. He keeps his students engaged all class and doesn't just assign useless work. Each week he gave us interesting readings (sometimes videos) and we would have to do a discussion post and article annotation. At first, they took time, but once you get in the groove they are really easy. There are 3 mini-essays, which I found actually to be enjoyable which are accompanied by 3 quizzes. The quizzes are open notes but can still be challenging because they ask very specific questions about the readings and lectures. There is also 1 media-text project which I enjoyed but it was very time-consuming. I really enjoyed his class and would definitely take another one with him. His TA Emilio is also great, and grades really fairly. If you need an easy gen-ed I would definitely recommend this class.", "rating": 5, "expected_grade": "A-", "created": "2023-01-23T19:11:08.009334Z"}, {"professor": "Ronald Mower", "course": "KNES287", "review": "Dr. Mower is an amazing teacher. I go to all his lectures but have many friends who just looked over the slides and were fine. The quizzes aren't bad given they are the open note and all about the slides. He has such a great personality and connects so well with every student. He also relates these topics to us so we can better understand them. Brandon the TA was just as as amazing as Dr. Mower as well. Highly recommend having him as a professor.", "rating": 5, "expected_grade": "A", "created": "2023-04-18T20:28:40.986457Z"}, {"professor": "Ronald Mower", "course": "KNES287", "review": "I thought I wasn't going to like this class but once we got past the first few units it got really interesting. We talked about things in class that we all notice, but we spend more time investing the effects of how sport is influenced by social settings and cultural norms. Both TAs for the class are incredible and are super friendly. Mower himself is really interesting and he did a good job of keeping the class engaged in lecture. A lot of people stopped going to class so he started keeping track of the people who went to class. I don't know if he did anything with it, but it was sad to see people stop going because he really did enjoy the content he was talking about. \r\nThere were weekly quizzes and 300 word mini essays as well as a midterm and final exam which were 1500 and 2000 words respectively.", "rating": 5, "expected_grade": "A+", "created": "2023-05-31T21:56:45.212480Z"}, {"professor": "Ronald Mower", "course": "KNES225", "review": "A bit of reading, but very interesting class and on the easier side of classes.", "rating": 5, "expected_grade": "A", "created": "2023-12-07T03:29:55.173197Z"}, {"professor": "Ronald Mower", "course": "KNES485", "review": "You literally cannot find a cooler professor anywhere on campus. He is so raw and super interesting and clearly knowledgeable. The class is based on discussion posts and quizzes, one per topic. You have to go to class at least 6 times. Classes are discussion based since they are only once a week, so make sure you participate because if not it will be super awkward when no one talks. Also got to go on a field trip to the African American museum in DC for a private tour with the curator of the sport exhibits which was literally the highlight of my college learning. It was SO fun and interesting and an amazing opportunity! Could not recommend Mower more, for any class :)", "rating": 5, "expected_grade": "A-", "created": "2023-12-20T20:33:04.811889Z"}, {"professor": "Ronald Mower", "course": "KNES225", "review": "Good professor! You can tell he’s passionate about his work! He is understanding and doesn’t assign too much. Drops a good few assignments at the end of the semester and the content is really interesting! Class could get a bit dry at times but maybe it was the time of day (my class was later in the evening). I recommend! Had a media text project at the end that I found fun as well!", "rating": 4, "expected_grade": "A-", "created": "2023-12-30T19:04:38.601158Z"}], "name": "Ronald Mower", "slug": "mower"}