{"courses": ["ENGL398V", "ENGL398N", "ENGL398V", "ENGL398V", "ENGL398V", "ENGL393H", "ENGL398N"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Ruth Phillips", "course": "ENGL398V", "review": "Amazing instructor. Professor Phillips takes a huge amount of her personal time and energy to ensure that the class is run fairly and equitability, and aims to assist all students in getting the best grade possible. ", "rating": 5, "expected_grade": "A", "created": "2021-05-18T01:46:40Z"}, {"professor": "Ruth Phillips", "course": "ENGL398V", "review": "I really enjoyed taking this course. Professor Phillips attempts to get to know her students and encourages success in the class. She gives ample time to complete the different projects and will work with you to get the grade you would like.", "rating": 5, "expected_grade": "A", "created": "2021-12-08T21:26:22Z"}, {"professor": "Ruth Phillips", "course": "ENGL398V", "review": "I don't think she made this class necessarily the easiest, giving lots of busy work and activities, but never have I ever had a professor who genuinely probably put just as much (probably more) effort onto assignments as I have. This course doesn't really teach you writing (there are some snippets here and there) but is rather a broad class that sort of just lets you try and convince others to do a sustainable thing of your choice. It's an interesting class I don't mind going to every week and Dr. Phillips is always very nice and understanding. She does take the whole class time period though, which is my only peeve. She also does have a small assignment due each week but it's literally no stakes writing in which you just reflect for 20 minutes and you get a guaranteed 100%. ", "rating": 5, "expected_grade": "A", "created": "2022-04-05T06:03:23Z"}, {"professor": "Ruth Phillips", "course": "ENGL398V", "review": "Professor Phillips has been one of my favorite professors over my time here at UMD, she really cares for her students and is super understanding of your situation. the class consists of :\r\nFinal Cover Letter           \t \t15%\r\nFinal Resume \t                \t15%\r\nFinal ePortfolio\t\t\t\t10%\r\nPress Kit and White Paper\t\t15%\r\nOral Pitch         \t \t\t\t15%\r\nthe class can be a bit busy at times, with a lot of outlines/drafts and peer review, but go through the motions and you'll be good! the press kit and white paper are about an environmental problem of your choosing and a hands-on solution/mitigation of your choosing. I personally am not an environmentalist, but did fine! professor phillips is very sweet and can be rather funny! i couldn't imagine taking another class instead of this one for FSPW", "rating": 5, "expected_grade": "A", "created": "2022-12-13T04:54:35.451530Z"}], "name": "Ruth Phillips", "slug": "phillips_ruth"}