{"courses": ["SPAN363", "SPAN798E", "SPAN408E", "SPAN408T", "SPAN408C", "SPAN798K", "SPAN303", "FREN699T", "GERM689T", "SPAN798I", "SPAN798U", "SPAN798R", "SPAN408G", "SPAN361", "SPAN899", "SPAN798W", "SPAN408Q", "SPAN303", "SPAN798A", "SPAN303", "SPAN362", "SPAN442", "SPAN303", "SPAN798G", "SPAN363", "SPAN431", "SPAN303", "SPAN448V"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Ryan Long", "course": "SPAN303", "review": "Professor Long is an extremely caring person. He treats his students with a great amount of respect and patience. He is flexible with due dates (to a certain extent) and always provides constructive criticism when necessary. You can really tell he cares about teaching and providing an open space for discussion in class. If you do the homeworks and participate in class, it will be extremely difficult to fail. ", "rating": 5, "expected_grade": "", "created": "2021-12-21T04:50:33Z"}, {"professor": "Ryan Long", "course": null, "review": "I took Ryan for SPAN408Q and he is the best. He keeps class interesting and has a lot of stuff mixed in that is also in English which is pretty cool. He is really responsive to students needs and was so helpful with me this semester (I missed a lot of class time). He even gave a week extension on a paper for me. He is a great grader and cares about his students. Readings can be long but the class discussion is always really good so you can catch up if you didn't read it all. He is one of the best professors I've had in the Spanish program.", "rating": 5, "expected_grade": "B", "created": "2022-05-12T20:36:43Z"}, {"professor": "Ryan Long", "course": "SPAN363", "review": "Long is so caring, knowledgeable, and lenient with grading. All the good qualities make him one of the best professors in the Spanish department. ", "rating": 5, "expected_grade": "A", "created": "2022-05-18T05:08:19Z"}, {"professor": "Ryan Long", "course": "SPAN408Q", "review": "Ryan is one of the few professors on this campus who truly cares about you as a person. He is extremely sweet and doesn't want to give you a hard time. He will readily give extensions on assignments. As long as you actually do the readings, you'll be fine on the exams. That being said, be prepared to read 50-100+ pages a night. We had seven novels.", "rating": 5, "expected_grade": "A", "created": "2022-06-02T05:41:14Z"}, {"professor": "Ryan Long", "course": "SPAN442", "review": "He is such a great and caring professor. Always listens to students and is very understanding. He is such a nice professor and I'm glad I had him! Only complaint is there was a lot of reading that is difficult to keep up with if you have a heavy courseload. But it is still manageable.", "rating": 5, "expected_grade": "A-", "created": "2023-05-08T19:08:51.459394Z"}], "name": "Ryan Long", "slug": "long_ryan"}