{"courses": ["COMM107", "INAG110", "INAG110", "INAG110", "INAG110", "INAG110", "INAG110", "INAG110"], "average_rating": 4.8293, "type": "professor", "reviews": [{"professor": "Samuel Rubin", "course": "COMM107", "review": "One of the best teachers I have ever had period. Very easy A and the most fun you will have in a class at UMD. Take his class, you won't regret it", "rating": 5, "expected_grade": "A+", "created": "2018-01-03T05:45:50Z"}, {"professor": "Samuel Rubin", "course": "COMM107", "review": "Top tier, always go for him if you can get him.", "rating": 5, "expected_grade": "A", "created": "2018-03-16T14:10:28Z"}, {"professor": "Samuel Rubin", "course": "COMM107", "review": "Easy fun and entertaining. Take him if you want crazy in your life.", "rating": 5, "expected_grade": "A", "created": "2018-05-11T12:42:24Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is a treat. Possibly one of the best instructors that I have had. He is also very willing to help on his time if you need it. Definitely recommend him.\r\n\r\nThe course should be a fairly easy A as long as you prepare for the exams and rehearse your speeches. Remember eye contact! that gets a lot of people.", "rating": 5, "expected_grade": "A", "created": "2019-05-12T18:48:03Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "This course comes with an easy A and a little bit of insanity. I'd say Sam is sort of crazy.", "rating": 4, "expected_grade": "A-", "created": "2020-05-05T04:07:16Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam can be aggressive at times. But if you can handle that, this class should be an easy A assuming you're putting in the work.", "rating": 4, "expected_grade": "A-", "created": "2020-05-06T19:51:00Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is absolutely, without a doubt, the most amazing instructor I've ever had (and I'm a senior)!  You will NEVER be bored in his class and you'll learn things that will follow you through your whole life!  He's available to help 24/7 and wants everyone to succeed.  Take his class and have the time of your life!  You won't regret it!", "rating": 5, "expected_grade": "A", "created": "2020-10-25T15:52:27Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is amazing and one of the most caring teachers I have had. Warning: He has no filter and makes some off-colored jokes but they are all with good intention so if you can handle that then go for it. He invites his class every year to his house for thanksgiving in case they have nowhere to go. 100% Reccomend", "rating": 5, "expected_grade": "A", "created": "2020-11-11T13:46:32Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "He's pretty wild, but leads an extremely enjoyable class if you're able to handle his insanity. Everyone grew to love him and everyone in the class gets to know each other well. Unlike any other prof I've had!", "rating": 5, "expected_grade": "A+", "created": "2020-12-19T16:31:33Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Absolutely crazy dude, in the best way. Sam managed to give an online class the feel of an actual in-person class, proving that you don't need to be insanely tech-savvy to pull off online teaching if you care and are willing to put in the work. He does make some not so politically correct comments, though, so if that bothers you, maybe stay away.", "rating": 5, "expected_grade": "A+", "created": "2021-01-12T03:07:24Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Are you tired of boring professors that put you to sleep?  Do you finally want to get over your fear of public speaking?  If so, then fasten your seatbelt and get ready for the experience of a lifetime!  Sam is a one-of-a-kind instructor--he is energetic, engaging and over the top hilarious (he is also an easy A)!  Best of all, you will get to know everyone in the class!  100% recommended--take him! ", "rating": 5, "expected_grade": "A", "created": "2021-01-20T18:47:31Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Fantastic professor and a fantastic person. Super high energy and makes online zoom classes something to look forward to. I personally struggle with social anxiety and doing oral presentations and I feel much more confident and comfortable after taking INAG110 with Sam. Super funny and understanding and I can only imagine how much more fun his class would be in person compared to online. The class should be an easy A if you prepare well for the speeches. Absolutely recommend his class!", "rating": 5, "expected_grade": "A+", "created": "2021-05-04T17:33:43Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam's alright. He can be aggressive, and repeats the same jokes, which can get annoying. Final grade comprised of informative, persuasive, and professional speeches, three exams, and a bunch of reading quizzes that can be completed by skimming the text. Prepare for speeches and use feedback Sam and your classmates give, and you should be fine.", "rating": 4, "expected_grade": "A", "created": "2021-05-25T22:14:36Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "There is no way to describe a class this incredible!  You must go through it yourself to fully understand how engaging and unique it is.  Of all my courses, this is the one where I learned and grew the most.  I also finally got to know everyone in there.  If you want an unforgettable experience that will change your life, Sam is your man!  100% recommend!", "rating": 5, "expected_grade": "A", "created": "2021-05-27T03:31:31Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "simply the coolest. take him at all costs, take the course later if you have to. the only dull parts of his class are the ones that is explicitly shoved down his throat by the curriculum. he is the man!", "rating": 5, "expected_grade": "A", "created": "2021-12-15T20:19:39Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Take this class!! I was dreading taking a public speaking course and it turned out to be my favorite class. I don't usually write reviews but Sam deserves one. He cares so much about his students. The workload is extremely manageable and you get to pick your topic for the speeches. Although speeches can seem intimidating, Sam walks you through everything so you don't have to stress about it. I've made so many genuine friendships because of this class. Taking Sam's class is an experience that everyone reading this review should have. Go sign up for it!!", "rating": 5, "expected_grade": "A", "created": "2022-01-14T03:06:27Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "I took this class based on these reviews and I'm really glad I did. This was by far the most interesting and fun class I took in the fall semester and I'm glad for once that we have to take a comm gen ed. Similar sentiments as others where public speaking can be hard for me but this class was still my favorite. I saw a big improvement by the end of the course not only on my speaking but also with my pre-speech anxiety. I honestly spent a lot more time and stressed more for the first one than I did on my last one. A good amount of people seemed to not enjoy the lecture parts in the first half of the semester but I actually really liked them because I enjoy this content and its a break from what I learn as a STEM major elsewhere. He also tells us what to write down for notes which I enjoyed. He honestly is a great guy and you can tell he truly cares about his students. He's a little eccentric which can be annoying on days you feel tired but I wouldn't have had it any other way. Since class size is so small and we spend time learning about others, by the time class ended it really felt like a family (cheesy ik but I mean it) and I was actually kind of sad when it ended. His wife also makes baked goods for us the first week of each month.\r\n\r\nOnly \"complaint\" I have is that since he kind of teaches his own way you do have to look at the textbook for the midterm and final even though we never use it before then. We also got short take home quizzes that were things we didn't cover in class but the textbook had. I don't believe comm107 has exams so if that's a huge dealbreaker for you take comm instead but inag exams are fairly simple (I studied way more than I needed to and finished the midterm in 5 minutes and got a 98 on it) but comm107 will just be another gen ed you have to take and nothing like the experience inag gives you. Inag exams also are worth very little, mid term is 5%, final is 10%, speeches are the bulk, and he's a pretty lenient grader in my opinion. Some of my other friends took inag with other professors some of which seemed WAY harsher and another that I heard was maybe chiller than Sam (he has a few things he's strict on but they're very easy to follow and he reiterates them all the time), but none of them understood the connection we left the class with (and I say this as someone who didn't talk as much in class). ", "rating": 5, "expected_grade": "A", "created": "2022-01-18T01:30:42Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam's INAG class was a blast, and this is coming from a huge introvert who always gets nervous when it comes to public speaking. Boring parts are not what he chooses to do but what he has to by the curriculum and he makes it tolerable through stories and letting us introduce ourselves in this early part of the class. One slight downside is that he doesn't teach the difficult parts of the midterm + final exams very well, but the majority of questions are easy (4/5 easy questions, last fifth was strange questions) and these are a small part of the total grade anyway. He is a very lenient grader for speeches, giving as many opportunities as possible to give more points if he can, and as someone who had many issues with stuttering, he gave me more points than I think other instructors would have given. On days we don't present we get to sit back and review one other person's presentation for the day, which meant it was a nice time to chill but also learn from others. I got to know about other people, from their names to interests to ideas, which is more than I could say compared to basically all my other courses at this campus. In short, this class is amazing and Sam is one of the best instructors for the course! Try to get his class because the experience is unlike any other class.", "rating": 5, "expected_grade": "A", "created": "2022-05-16T13:28:16Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Pros:\r\n- Sam makes what is normally a boring Gen-Ed course much more interesting\r\n- You can tell he cares very, very much about his students and oral communication in general\r\n- Everyone sees a noticeable improvement in their public speaking skills after taking his class\r\n- Easy exams, extra credit, and some pass/fail speeches that are easy 100s\r\n\r\nCons:\r\n- Lectures can be kind of contrived, he likes things being done in a very specific way\r\n- Very easy to lose lots of points on speeches if you make small mistakes/don't read the directions (i.e. a 70 point deduction for being >5 seconds under the minimum time limit. I believe this is more strict than other INAG/COMM professors are but I may be wrong)", "rating": 4, "expected_grade": "A", "created": "2022-05-23T20:05:31Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Lets get right to the point.  Sam is the best INAG 110 instructor and professor at UM.  Passionate, hilarious, knowledgeable and super high energy.  He makes himself available 24/7 because he really cares and wants to see all his students succeed.  No matter how afraid you are of public speaking, he will make you alot better and feel more confident. \r\nThis is also the first time I got to know everyone in my class and learn something about them.  Sign up to meet the gen ed requirement but really take it for a once in a lifetime experience.  Trust me, you won't regret it and, most of all, you will never forget it!", "rating": 5, "expected_grade": "A", "created": "2022-05-27T14:43:13Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is by far the best INAG instructor out there. He really makes an effort to make lectures/classes enjoyable and he ensures that you can succeed at public speaking. This was the first gen ed that I truly enjoyed because Sam turned a boring subject into an interesting and fun class. The environment is different from the traditional classroom, so if you're someone who likes repetitive lectures or serious content don't take this class. Definitely take Sam's section if you want to grow as a speaker, learn something new about yourself, and are able to thrive in a creative atmosphere.", "rating": 5, "expected_grade": "A", "created": "2022-12-12T03:59:28.148226Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Great professor. Sam is entertaining and keeps you engaged. Speeches are not that hard, just make sure to practice them. Great guy. All assignments are easy and take home. You can get an A pretty easily in here while enjoying yourself.", "rating": 5, "expected_grade": "A", "created": "2022-12-16T07:42:03.998285Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Literally the best professor. He makes his class enjoyable and is extremely passionate about teaching. He turns public speaking into something pretty fun and he grades really fairly. His classes are about 19 people so you really get to know the people there. He creates the opportunity to let you improve as a speaker and is overall an amazing person\r\n\r\nTake his class", "rating": 5, "expected_grade": "A", "created": "2022-12-20T06:12:21.910960Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam's a really fun and entertaining guy. I had a really wonderful time in his class, and he obviously cares about his students and wants to see them succeed. He's really energetic and brings more \"fun uncle\" vibes than \"communication professor\" vibes. My only qualms with the course are that there's not much to learn - I don't feel like I learned anything from the course that isn't already obvious (\"meanings are in people, not words\", \"nonverbal communication can be more effective than verbal\", etc) and most of the feedback he gives for speeches are cookie-cutter; you hear the same feedback given to basically every single person and he speaks as if he's filling in the blanks of a premade template. Overall though, fun guy and easy class.", "rating": 4, "expected_grade": "A", "created": "2022-12-20T19:02:22.563169Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "I was skeptical at first, but this guy is the best INAG teacher there is. But I am going to list the cons first. He grades speeches probably the harshest out of the other inag professors. As someone mentioned being like 5 seconds under a 5-minute speech will result in 70 points off of on speech. But I dont believe he actually gave someone 70 points off on a speech as someone in my class was 10 seconds under, he just silently urged them to keep on talking. He is a strict grader when it comes to presenting in general. He also has strict harsh rules, but these rules are just there to make sure you are doing your presentation correctly. People rarely ever fall outside of his rules like they are just common sense with his own twists on it basically, it's meant to encourage us to do our best. Sam is so energetic when it comes to speaking it brightens my boring day. He is always telling jokes our forcing us to tell jokes as everyone in the class must say 1 joke. (I've said 3 jokes). He seriously doesn't want you to fail and its scary the length he'll go for you just so you dont fail. At first, I thought he was doing this so that we would have no excuses when it came to our assignments. But he really just wants us to pass the class as INAG should be an easy A. It is really the exams that may hit peoples scores. I honestly never studied for them cause the questions were common sense. And I scored like 80-82 which was fine since it was above average lol. He gives us so many extra credit opportunities its crazy. The environment in his class is very comforting. The way he sets up the seats brightens my day. We can present our speech topics on anything as Sam loves creativity. He really is \"Sam the Man\" as I cannot see any teacher that can have a bigger impact than he did. If you are looking for a fun class to actually better your speaking skills take Sam. If you are just looking for a class to just get a grade and dip, take anyone else. I hate public speaking, but I can definitely say I learned a lot from this class. I have seen improvements from my first speech to my last speech. INAG is not a hard class in general. So don't be afraid of taking Sam because he is a harsh grader.", "rating": 5, "expected_grade": "A", "created": "2022-12-20T23:48:18.519606Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Seriously just take his class for your communication gen ed. He genuinely is a great teacher and person and truly cares about everyone in his classes.", "rating": 5, "expected_grade": "A", "created": "2022-12-24T16:33:24.404007Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "At the beginning of his class, he makes it seem like it’ll be much harder than it is — especially if you’re on the quieter side like me. But don’t be intimidated by that, he’s much more encouraging than he comes off at first, and he’s a great teacher and person. His feedback gets a bit repetitive at times, but he’s always available for further instructions and help if you ask. Definitely take this class for a comm credit!", "rating": 5, "expected_grade": "A+", "created": "2022-12-25T03:48:20.029081Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is the GOAT (Greatest of All Time)!  If you need a communications class for the gen ed requirement, this is the guy to take it from.  It's like no class you've ever had and you'll never forget it.  He's a very fair grader and an easy A!  Also, you'll get to know everyone in there, learn so much and have a lot of fun.  100% recommend because Sam is the man!", "rating": 5, "expected_grade": "A", "created": "2022-12-26T14:50:50.305475Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Wrote me a cover letter in a super short notice for a scholarship. Went to a performance with him and his wife and a few classmates supporting a student in the class. Very nice & you'll learn a lot.", "rating": 5, "expected_grade": "A+", "created": "2023-05-08T22:21:39.244959Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Bombastic man. Pretty easy A, just do all the assignments and practice for your speeches. He really cares about everyone and is really charismatic, but that can be a little much for some people.", "rating": 5, "expected_grade": "A+", "created": "2023-05-16T04:40:35.149804Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam was the perfect professor for a INAG110 course. He kept us excited about learning, engaged, never bored, and was very motivating when speeches were looming on the horizon. He was honest yet Light-hearted and always willing to talk to you outside of class as well if you had any questions or needed extra guidance for a personal issue or the course itself. I definitely recommend to anyone willing to take him for this Gen Ed credit! :)", "rating": 5, "expected_grade": "A", "created": "2023-05-19T03:09:48.901645Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Super funny, really understanding, genuinely cares about you, and creates an atmosphere where you end up coming to class willingly because you don’t know what he’s going to do next.", "rating": 5, "expected_grade": "A", "created": "2023-05-19T12:29:37.682931Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "TAKE SAM RUBIN. Sam will turn a class that could be very boring into something amazing. He is the funniest prof I've ever had and has the most engaging lectures possible. He entertains you throughout all of his classes by sharing stories and telling jokes. His grading is also very fair, and he will help you out if you are struggling. He truly wants to see everyone succeed and have a great time. This man doesn't do this for the job, he does it because he loves it. He will take care of your grade and you will get an A provided you put in the effort. \r\nOverall, he gives you a FUN class and a good grade, so 100% recommend him.", "rating": 5, "expected_grade": "A", "created": "2023-06-02T17:17:02.158704Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam was an amazing professor. I’m really not a fan of public speaking so I went into the class thinking it was just one of those icky gen Ed’s I’d have to take to get my degree. I was so wrong. Sam made inag fun and exciting. I looked forward to his class every day and genuinely learned so much from him. He has a strict attendance policy but I didn’t have an issue with it because I wanted to go to his class. I highly recommend taking Sams class. It’ll be unlike any class you take in college in the best way possible.", "rating": 5, "expected_grade": "A", "created": "2023-07-03T04:53:41.324531Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "I hate public speaking. I was extremely anxious and scared but Sam makes the class so warm and welcoming that it felt easy to go up and present. He also brings baked goods on the first of every month that his wife makes!! (and if you have any dietary restrictions he makes sure to accommodate for those) He is honestly one of the best professors I’ve had and bumped me to an A when I was on the very edge because I lowkey failed the final lol. He loves his job and as long as you put in a little effort into the class you will have a great time!", "rating": 5, "expected_grade": "A", "created": "2023-07-19T15:36:35.545175Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is nice. Though the class can get tiring, he is a good person at heart who is willing to extend his kindness in many ways, like cookies or inviting us over for Thanksgiving if we have nowhere else to go. He is funny and lenient. You will get an A in this class.", "rating": 4, "expected_grade": "A", "created": "2023-11-17T00:18:28.367650Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is a very easygoing and interesting guy. He made the lectures engaging and would crack some jokes to lighten to mood. He is a relatively easy grader but can be picky about the introduction and closing of the speech. I would recommend him if you need to fulfill your communications gen ed.", "rating": 4, "expected_grade": "A", "created": "2023-11-30T18:25:21.175491Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam Rubin is THE MAN!  If you have to take an oral communications class, he is the one to take it from. You will not be disappointed.  The class is a total blast!  His love of teaching and care for the students is second to none.  Even if you are an introvert (like I am), he will make you feel so comfortable that you won’t even realize what’s happening.  This is the first class I actually knew all of my classmates and their first and last names!  I think all professors should learn how to teach from him.  He’s fair, compassionate, funny and always available (24 hours a day) for you to contact him either through email or by phone.  You can even contact him to discuss anything other than the class, if something’s on your mind.  Take Sam Rubin!  You won’t be sorry!", "rating": 5, "expected_grade": "A", "created": "2023-12-04T17:21:35.408633Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam is the absolute GOAT.", "rating": 5, "expected_grade": "A+", "created": "2023-12-08T02:46:00.366469Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "Sam the man is an absolute G. Class was a cakewalk and actually fun to go to. For one of the three speeches we did, I did not practice at all and managed to get an A on it somehow. The guy wants you to succeed and makes it impossible to fail. You just need to go to class and do all of the work the way that he tells you to do it. He even brought in his wife one day and she even made us treats for the beginning of every night.", "rating": 5, "expected_grade": "A", "created": "2023-12-18T05:48:41.744413Z"}, {"professor": "Samuel Rubin", "course": "INAG110", "review": "One of the best professors I've ever had. His teaching style can be a little quirky and he has a clear no-phone policy (you get extra credit at the end if nobody uses it though). Still very engaging!", "rating": 5, "expected_grade": "A", "created": "2023-12-20T02:36:59.855201Z"}], "name": "Samuel Rubin", "slug": "rubin_samuel"}