{"courses": ["ENGL398N", "ENGL293", "ENGL398A", "ENGL398C", "ENGL398N", "ENGL398N", "ENGL293", "ENGL101H"], "average_rating": 2.1667, "type": "professor", "reviews": [{"professor": "Sarah Goodson", "course": "ENGL293", "review": "Professor Goodson is one of the best profs I've ever had. You can tell she really cares about the course conduct and her students. Definitely take a class of hers before you graduate.", "rating": 5, "expected_grade": "A", "created": "2022-10-20T05:08:56.506540Z"}, {"professor": "Sarah Goodson", "course": "ENGL398C", "review": "Absolutely awful prof. All communication (anything from emails to major assignment guidelines) is wildly unclear and always ridiculously and unnecessarily wordy. She grades unfairly, picks favorites, and is rude to students in front of the entire class. This class has been the biggest waste of time and money - I really wish I'd seen the numerous negative reviews left about her from her previous school. If I wasn't applying to grad school I would've withdrawn, despite needing the FSPW credit.", "rating": 1, "expected_grade": "A", "created": "2022-11-08T21:39:43.101059Z"}, {"professor": "Sarah Goodson", "course": null, "review": "This course would be great if the prof wasn't so demanding. She takes a while to responds to emails, is very vague and unclear on assignments, making guidelines as wordy as possible and ridiculous. There are ABSOLUTELY RIDICULOUS amounts of readings required every week and so many busy work assignments. I am a STEM major, yet this is my most time consuming class and it is simply for the scholarship in practice credit. The course content is interesting and you learn a lot, however the workload is ridiculous with no reward. I wish I had done more research into her before signing up for this course.", "rating": 2, "expected_grade": "A-", "created": "2022-11-14T00:31:23.722398Z"}, {"professor": "Sarah Goodson", "course": null, "review": "If u need a professional writing credit avoid goodson at all costs. she is so unclear, unresponsive and just generally painful to be around. her assignment guidelines would be comical if they weren't so frustrating. it's like she purposefully uses a complex sentence structure and an unnecessarily advanced vocabulary to prove something, it's ridiculous. i have seriously never encountered a bigger waste of time, money, energy, and effort than this prof.", "rating": 1, "expected_grade": "B+", "created": "2022-11-16T15:00:00.294475Z"}, {"professor": "Sarah Goodson", "course": "ENGL398C", "review": "The course is fine, but listen to these reviews - Prof Goodson is insufferable. She's relentlessly unclear and demanding of students. Someone needs to remind her that she's teaching a professional writing course lol. I ended up reporting her to the PWP department for being unprofessional and rude to students, as well as just being a useless professor overall.", "rating": 1, "expected_grade": "A-", "created": "2022-11-28T18:42:47.183639Z"}, {"professor": "Sarah Goodson", "course": "ENGL398C", "review": "Professor Goodson is the worst. Directions are unclear for every paper and she takes over a month to grade papers. I am convinced she did not read my last paper (2 pages) because she did not give any feedback other than \"pay attention to APA citing\". We had a paper due before break that was over 30 pages and our final paper is very long as well (around 15-20). I did not learn a single thing and was confused the entire class. There is a lot of busy work and half of the work is figuring out when stuff is due since no real syllabus is provided and assignment guidelines are always 4 pages. She never responds to emails and is rude to students when they ask questions. She also has favorites and is very clear about it. She is a terrible professor and this class was a waste of time and money.", "rating": 1, "expected_grade": "A-", "created": "2022-12-08T02:44:56.345385Z"}, {"professor": "Sarah Goodson", "course": "ENGL293", "review": "Professor Goodson is not a bad professor, but she is not a particularly great one either. The assignments she provides are often times very unclear, and her explanations do not help either. She places heavy emphasis on telling us that there is no proper way to write the assigned papers, which is good in theory, but leads to a lot of unnecessary confusion that shows when she grades the papers and provides feedback. I will say that her lectures are generally very engaging and she seems very excited to interact with the students when it comes to discussing the assigned readings. She generally does not respond to emails though, which is very anxiety inducing. Taking this class with this professor is not the worst thing, but do expect plenty of confusion when it comes to writing the papers and reading the homework.", "rating": 3, "expected_grade": "B+", "created": "2022-12-12T01:42:58.363102Z"}, {"professor": "Sarah Goodson", "course": null, "review": "Not a very good professor. Communication is horrible, and make sure you send multiple emails to get her attention because she will not respond to the first or even the second email.", "rating": 1, "expected_grade": "A", "created": "2022-12-15T18:54:53.973418Z"}, {"professor": "Sarah Goodson", "course": "ENGL398N", "review": "Rating 2 stars only because this is Professor Goodson's first semester teaching at UMD and maybe once she settles in things will improve. Also, she is peppy and engaging during lectures which is helpful for a 5pm class. Otherwise pretty bad. \r\n\r\nPacing of assignments was way off. The semester started off with two class sessions dedicated to peer-editing and revising a single paragraph(!) and ended with three concurrent projects that accounted for 45% of the final grade. Instructions and deadlines for these assignments were not communicated until midway through the semester, well after the add/drop period. There was no semester calendar- instead we got sporadically updated handouts that covered about 3-4 weeks at a time. I also spent hours (plural!) simply locating assignment instructions and hand-in methods, since practically every one was housed somewhere different- terrible organization.\r\n\r\nCommunication was also bad. Echoing other commenters, Professor Goodson did not respond to emails or enter grades in a timely manner. There were assignments from the first month that were graded in mid-December with no feedback! The real kicker is that this professor presents early on as someone caring. She is quick to bring up the importance of self-care, checking in, and how she is always here for students. However, when other students and I came to her with legitimate grievances like illness or personal loss she was completely inflexible. She's not so much a wolf in sheep's clothing as a candy-coated pedant.", "rating": 2, "expected_grade": "", "created": "2022-12-18T05:17:45.244890Z"}, {"professor": "Sarah Goodson", "course": "ENGL101", "review": "Professor Goodson is chaotic and expects a ridiculous amount of work to be done for this course. Speaking with friends in other ENGL101 courses they all say that they do not do nearly as much work. She assigns three assignments due on every Friday (my asynchronous day). We never do NEARLY as much work on our in-class days. The work is due at different times of the day (sometimes in the morning, 8pm, and midnight). She never responds to emails even about personal matters and often takes forever to put in grades. The one good thing I can say is that she does engage with the class during in-class lectures. In the end I do not recommend taking her course if you want to be swarmed with homework and essay writing.", "rating": 1, "expected_grade": "A", "created": "2023-12-03T18:58:44.982941Z"}, {"professor": "Sarah Goodson", "course": "ENGL101H", "review": "Very nice woman, super understanding. Her directions on assignments weren't always clear, but the work was never egregiously hard. She learns the names of all her students and engages with them during every class.", "rating": 4, "expected_grade": "A+", "created": "2023-12-20T18:40:48.424125Z"}, {"professor": "Sarah Goodson", "course": "ENGL101H", "review": "Professor Goodson is a very kind and understanding, and the work for her class is never overwhelming. That being said, there were some moments where the class felt pretty disorganized with assignment instructions sometimes being pretty unclear, and for all the major writing assignments (except the first one), she didn't give the grades & rubric back until the end of the semester. However, considering how easy the class usually is, this really wasn't a problem, and she was always very approachable if you did have some genuine question or confusion about something. She is also a very passionate person who's always excited to teach, so the classes will never be boring if you take her.", "rating": 4, "expected_grade": "A", "created": "2024-02-22T19:13:57.388210Z"}], "name": "Sarah Goodson", "slug": "goodson_sarah"}