{"courses": ["PHYS270", "PHYS411", "PHYS441", "UNIV150", "PHYS115", "HONR268N", "PHYS442", "HONR269L", "PHYS275", "PHYS405", "PHYS444", "PHYS122", "PHYS121", "PHYS141", "PHYS410", "PHYS115", "PHYS260", "FIRE120", "FIRE298", "FIRE398", "PHYS410", "FIRE198", "FIRE398", "PHYS260", "FIRE199", "FIRE120", "FIRE298", "FIRE398", "FIRE398", "FIRE398"], "average_rating": 3.8333, "type": "professor", "reviews": [{"professor": "Shabnam Jabeen", "course": "HONR268N", "review": "Was super excited to take honors seminar about particle physics and programming. Ended up being extremely confused about equations, Linux, and the concepts. Lecture could have been executed much better. In fairness, I think she was teaching it like an upper level science course (there was no hand-holding and her instructions are super vague), but I wish someone told me I was supposed to look for resources outside of what she gave us. I figured out how to deal with this class eventually and I DO think it helped me get accustomed to scientific reading, but it could be done in a much gentler way, without letting me down for the course content.... I guess an auto-A seminar is the best way to do this, but it was still disappointing....\r\nRegarding the content, I do not recommend STEM honors seminars. Everyone in this class was at totally different levels for physics and programming, so you will either be bored or extremely frustrated.", "rating": 2, "expected_grade": "A", "created": "2018-12-15T15:14:15Z"}, {"professor": "Shabnam Jabeen", "course": "HONR268N", "review": "The seminar was very difficult in terms of understanding the material. In the end, I ended up learning a lot about particle physics, but I felt like I was drowning the entire semester. Overall, it's a class worth taking.", "rating": 4, "expected_grade": "A+", "created": "2018-12-31T08:14:34Z"}, {"professor": "Shabnam Jabeen", "course": "HONR269L", "review": "Very accommodating. The class is very loose, and if you can consistently get work done in a timely fashion, it'll be a breeze. Easier than HONR268N (it's a 2 semester sequence).", "rating": 5, "expected_grade": "A+", "created": "2020-05-15T13:31:07Z"}, {"professor": "Shabnam Jabeen", "course": "PHYS260", "review": "Prof Jabeen is not very good at lecturing, to the point that I would rather watch youtube videos instead of attending lectures because of how confusing the lectures can actually be (which I did). The saving grace is that the homeworks are graded very leniently (20 tries on each problem, even the multiple choice ones), and the quizzes are homework problems verbatim, and exams are also very similar to the homework problems and very fair, probably because they were often straight up lifted from the textbook. She is a very nice person, but if you want someone else to teach you choose another professor if you can. If you can get by with teaching yourself this course should be no problem because the assignments are very fair, but know that it is a LOT of content that keeps piling up so you should try your best not to fall behind. And as she will tell you, try to do a lot of practice problems.", "rating": 2, "expected_grade": "", "created": "2022-05-13T03:30:10Z"}, {"professor": "Shabnam Jabeen", "course": "FIRE120", "review": "Great professor, super kind", "rating": 5, "expected_grade": "A+", "created": "2022-12-20T04:44:16.781233Z"}, {"professor": "Shabnam Jabeen", "course": "PHYS260", "review": "I heard mixed opinions about Jabeen's lectures, but I found them informative and at times entertaining due to her animated teaching style. She was also very nice and wanted her students to succeed, and would give extensions and small curves if necessary. Great professor.", "rating": 5, "expected_grade": "A", "created": "2023-01-28T21:43:17.460794Z"}], "name": "Shabnam Jabeen", "slug": "jabeen"}