{"courses": ["KNES498A", "KNES600", "KNES400", "KNES497", "KNES789N", "KNES400H", "KNES785", "KNES786", "KNES778", "KNES293", "KNES898", "KNES285", "KNES285", "KNES778", "KNES786", "SPHL399", "KNES285", "KNES778", "KNES786", "KNES285", "KNES615", "KNES778", "KNES786", "SPHL399", "KNES285", "KNES778", "KNES786", "KNES898", "KNES285", "KNES778", "KNES786", "KNES898", "KNES285", "KNES778", "KNES786", "KNES778", "KNES786", "KNES285", "KNES778", "KNES786"], "average_rating": 3.8571, "type": "professor", "reviews": [{"professor": "Shannon Jette", "course": "KNES293", "review": "Super nice and helpful teacher! I think she made the class so interesting and genuinely put in the effort to make sure students understood the material and its importance outside of the classroom. The two papers really weren't that bad, and I was really fascinated with the topics so I liked doing them. Would definitely recommend. ", "rating": 5, "expected_grade": "A", "created": "2021-01-12T03:08:24Z"}, {"professor": "Shannon Jette", "course": "KNES293", "review": "A lot of information to process from a Zoom Distanced Learning environment.. Took this class Fall '20", "rating": 4, "expected_grade": "D+", "created": "2021-06-28T04:23:28Z"}, {"professor": "Shannon Jette", "course": "KNES285", "review": "Very interesting and helpful professor! She does a fantastic job outlining what is expected in the course and lectures are very intuitive. Weekly quizzes are easy and papers are super simple. Would love to take a course she teaches again!", "rating": 5, "expected_grade": "A+", "created": "2022-11-17T21:20:59.820660Z"}, {"professor": "Shannon Jette", "course": "KNES285", "review": "Dr. Jette is such a sweet professor. Sometimes lectures can be a lot as she tends to get side tracked on certain topics, but it’s all still very interesting. The online quizzes are so easy and directly from her lectures. The papers are kind of challenging (especially the final) but you can ask her tons of questions and she’ll help! Overall great professor and would recommend her!", "rating": 5, "expected_grade": "A", "created": "2022-12-14T00:02:53.588061Z"}, {"professor": "Shannon Jette", "course": "KNES285", "review": "She is an engaging lecturer. There are ~10 quizzes over the semester, 7 \"CHILs\" that are short writing assignments that help you write the 2 \"SEs\". These are the major graded assignments, between 1200-1800 words each about a historical topic of you choice from the modules. I found this course really interesting and most of the grading to be fair, although the TAs can be a bit harsh. Make sure you go to office hours for help writing your theses.", "rating": 5, "expected_grade": "A", "created": "2022-12-24T14:22:04.257445Z"}, {"professor": "Shannon Jette", "course": "KNES285", "review": "I enjoyed her lectures, very engaging and loved that she posted the slides beforehand. Can get a bit sidetracked but is very passionate about the topics of this course. The TA's were a bit strict but go to office hours and you will be fine. Overall, pretty easy class and the workload was very reasonable- weekly quiz (open-note with 25 minutes), CHILS almost every week (Took 15 minutes at the very most but usually took 5-10 minutes), two Summative Evaluations (at most 2000 words), and the final which you could incorporate one of the SE's. She also offered two extra credit opportunities which could raise you a total of 2% added to your overall grade.", "rating": 4, "expected_grade": "A", "created": "2023-01-07T05:11:38.461439Z"}, {"professor": "Shannon Jette", "course": "KNES285", "review": "Very enjoyable lectures. She posts weekly quizzes and they're relatively easy, mainly everything on the lecture slides and assigned readings that you can skim through. The CHILs were also very helpful towards the two summative evaluations throughout the semester. She incorporates Turning Point for attendance points and is a very sweet professor that is passionate about what she's teaching!", "rating": 5, "expected_grade": "A", "created": "2023-05-09T20:59:07.659962Z"}, {"professor": "Shannon Jette", "course": "KNES285", "review": "This class is a joke. It is only a level 200 class but feels like a graduate class. The quizzes are only doable if you read through every single document she posts and take detailed notes from lecture, if not you're guaranteed a 70% on every quiz. The TA's grade the CHILs like its a graduate paper. Getting an A is close to impossible. They take points off for just about no reason, and always has something to pick at. A minor citation error is not deep enough to lose a whole letter grade on. The final paper is also graded really harsh. I'm convinced they just rush through everyone's paper and assign grades based on how they feel. If there are better options for your gen ed, take those. stay away from this, unless you're a knes major then good luck", "rating": 1, "expected_grade": "B-", "created": "2023-10-18T00:59:24.346056Z"}, {"professor": "Shannon Jette", "course": "KNES285", "review": "weekly quiz were hard, the CHIL papers were graded very stricly for no reason. and the final paper is a guaranteed two letter grade drop", "rating": 1, "expected_grade": "C+", "created": "2023-10-18T01:00:30.015093Z"}, {"professor": "Shannon Jette", "course": "KNES285", "review": "This class is pretty fair overall. The weekly quizzes are completely based on the lecture slides and assigned readings and are totally fair, anyone that says they're too hard doesn't pay attention in class because I've gotten 8/8 points on almost every single one and it is not that difficult considering you can use your notes during the quiz! There is one quiz each week and a bunch of papers. My TA graded the papers very harshly and was extremely unhelpful in our discussion section and left everyone confused. Dr. Jette herself is very helpful, passionate about the topic, and approachable, but the TA's are the one who grade the written assignments so most of the time I went to him, even though he is not very helpful. It is a bit annoying considering it is a core class and has a good amount of work, but it is manageable. I have been sitting between an A- and an A for a while because of the written assignments.", "rating": 4, "expected_grade": "A", "created": "2023-11-28T22:32:51.673779Z"}, {"professor": "Shannon Jette", "course": "KNES285", "review": "Professor Jette is a very kind professor and tries to make the material engaging but the class is really boring. The lectures although only 50 minutes seem to drag on forever. Attendance is semi-mandatory as she uses point solutions but you drop your lowest two and she doesn't do it every class. Overall weekly most of the time the only assignment is a 25 minute, 8 question, open note quiz so the workload isn't too bad.  However some assignments near the end of the semester are incredibly time consuming. There is no final exam but the final paper is worth 30% of your grade. The good thing is that you kind of build up to it over the semester through four different CHILs but the feedback that you get is practically non existent. The TA's grade very harshly and don't elaborate on why you got off points. Jette wasn't a terrible professor but I would recommend another class if you can help it. Another point to add is that she offered two extra credit opportunities, each allowing for the potential of a one percent grade increase. You are also graded on discussion section participation which also in my opinion was graded harshly.", "rating": 3, "expected_grade": "A-", "created": "2023-12-01T05:49:53.207518Z"}, {"professor": "Shannon Jette", "course": "KNES285", "review": "This class was manageable, but your grade ultimately depends on your TA because they are the ones grading all your written work. There were 4 CHIL assignments which were like essays, but they all helped outline your final paper which made it very simple at the end of the semester. However the CHILs were a big percentage of our grades and unless you write at the graduate level, it is very hard to receive an A on them. We also had weekly 8-point quizzes which were not hard but the questions were also not clear. Very hard to get 100% on them also. Dr.Jette herself was very understanding and communicative, but this class is more difficult than it should be. No final exam, so yay.", "rating": 3, "expected_grade": "B", "created": "2023-12-06T16:33:34.148198Z"}, {"professor": "Shannon Jette", "course": "KNES285", "review": "Dr. Jette is very accommodating and kind professor. Her lectures can be a little slow sometimes, but she does her best to keep them interesting. The quizzes are usually very easy as long as you at least skim over the assigned readings. The CHIL’s are very heavy on your grade and not every TA grades the same, as some are extremely harsh on grading, however if you bring this up to her she is more than willing to go over grading and fix it.\r\nCertain days there are also mandatory attendance, however the requirements to fulfill attendance are not bad at all.", "rating": 4, "expected_grade": "A", "created": "2023-12-23T00:34:20.510795Z"}, {"professor": "Shannon Jette", "course": "KNES285", "review": "Liiisssten. Love Dr. Jette, 5/5 professor!! Great style of teaching, always willing to help bc SHE CARES, gives GREAT FEEDBACK on papers & listens to student criticism- however, overall class experience is 3/5. While the content is interesting & lectures enjoyable... the workload is very time consuming so plan accordingly- stressed me out more than Biomechanics. The weekly quizzes are not hard. It's literally open note so pull up the lecture slides while taking the quiz- answers are in the slides. The only thing that won’t be is the 2 assigned articles you’re given but majority of the time she talks about em in class so if ya pay attention can make an educated guess. Got a 100% on almost all. As far as the CHIL’s they are graded harsh & ur grade depends on who you get as a TA. Won't say names but depending on ur TA all I can do is pray for you… go on bow ya head. Mine was mostly unhelpful, made me cry/feel stupid, and when asked why something was wrong usually gave an abstract answer that didn’t make sense. Spoken with multiple people who all (which is crazzzy) verbatim said “I feel like no matter what I do it won’t be good enough”- that's a problem. So GO TO DR. JETTE FOR THE CHILS. You have 4 CHILS & use them to build your final paper. Go over the content/main points you want to discuss & make sure you understand WHAT you should be talking about (a lot of people get points off bc they aren’t answering the prompts correctly). Go over that outline with Dr. Jette or your TA (if they’re good), draft your paper, send it to ur TA to receive feedback, edit the paper accordingly, then if you're a religious person… pray. If you're still unhappy with the grade dispute it & Dr. Jette will grade it herself. If all else fails ur given 2 extra credit opportunities, each for a chance to raise your grade by 1%. Best advice I got, goodluck!", "rating": 5, "expected_grade": "A", "created": "2024-01-14T23:22:43.907074Z"}], "name": "Shannon Jette", "slug": "jette"}