{"courses": ["MATH140H", "MATH410", "MATH141H", "MATH463", "MATH140H", "MATH464", "MATH463", "MATH405", "MATH463", "MATH140H", "MATH464"], "average_rating": 3.3333, "type": "professor", "reviews": [{"professor": "Shiferaw Berhanu", "course": "MATH140H", "review": "Professor Berhanu made this course impossible to pass. Every Wednesday he would teach content and then immediately make you put away all of you notes and do a worksheet on content you had barely learned, unaided. He couldn't figure out how to put grades on canvas, so the Canvas grade only reflected your WebAssign scores, meaning you wouldn't know how much the \"worksheets\" (which were basically pop quizzes) and exams (that most people didn't pass but still weren't curved) affected your grade until midterm grades were released and you have 2 days to see if you need to withdraw from the course. I strongly recommend to not take the honors version of this course because if you have an unhelpful professor like I did then you have no TA to help where you are struggling. He seems like a nice man who really enjoys math but he was not a good teacher", "rating": 2, "expected_grade": "W", "created": "2022-12-05T18:26:00.279252Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH140H", "review": "Professor Berhanu (Shif) was awesome for Calc I. As far as basic course details go, he doesn't give too much work, the midterms were pretty easy, and there were very few times that we faced a problem that we were getting graded for and not have seen it/practiced for it before. Beyond that, He's very good at breaking down and explaining concepts and is clearly excited to be teaching. I don't think it would be that crazy to call his level of excitement \"cute\". He does have a non-american accent for speaking English, but once you hear him talk long enough you get used to it. If you can take him for MATH140H, or any math class that he teaches, I highly recommend choosing him.", "rating": 5, "expected_grade": "A", "created": "2022-12-05T19:53:52.807592Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH410", "review": "You will pass his course if you are able to master the topics and write solutions exactly how he says. This means working harder than you think you should. The only way you can pass is to study every single day, and practice problems everyday. I mean it - do not ever skip studying. He does not give partial credit. He is not a generous grader. So if you write a solution that is technically correct but somehow missing a minor point or two, he will give you a zero. He will accept only a perfect solution. He has a hard time connecting with students. He does not care about anything you tell him. He will only care about your perfect solutions on a test. If you are a genius and you enjoy a challenge, this is the right professor for you. He is very knowledgeable and enthusiastic about the topics in this class. But if you are not a genius and have to work hard for it, turn away. You will have a hard time in this class because he has no problem in giving out zeros. The exams are fair sometimes, and sometimes harder. Like I said, if you are naturally a gifted mathematician, you will do just fine. This professor is not for all types of students.", "rating": 1, "expected_grade": "", "created": "2022-12-22T15:57:23.496903Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH410", "review": "Tough, difficult, many students dropped", "rating": 1, "expected_grade": "F", "created": "2023-01-19T20:10:26.637190Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH140H", "review": "Professor Berhanu would talk poorly about students to other students in the same class behind their backs. He did seem enthusiastic about math, but was not understanding in many cases when it came to his students. Graded harshly, only accepted the exact right format and wording for tests and classwork. He didn't know how to use Gradescope so our final grades remained a mystery. Had closed note classwork on the topic you just learned up to twice a week. He went in depth in writing out proofs, for which we never used in actual classwork or exams. I don't recommend taking this class. I came in several times to his office hours but continued to struggle through the semester.", "rating": 1, "expected_grade": "", "created": "2023-01-25T01:48:14.931448Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH410", "review": "Too hard, bad grader. Take anyone else but him…", "rating": 1, "expected_grade": "F", "created": "2023-02-09T19:18:46.941140Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH410", "review": "A difficult professor. He deducts points for everything. For each question, you receive a score of 0 or 100%. He does not give partial credit for your good attempts. He is a very self-centered individual who simply wants you to know that he is knowledgeable about the subject. His teaching is so boring that he does not allow you to ask questions. He gets mad at students who ask a question and stops them while they are asking question. He will make you feel your question is silly. I highly recommend you to register for any professor other than him.", "rating": 1, "expected_grade": "", "created": "2023-02-09T19:23:01.750806Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH141H", "review": "I had Professor Berhanu for MATH140H and for 141H and he was excellent for both. His grading is strict but fair. His expectations of his students are very high, but not unreasonably so. The class moves quickly, but that is to be expected of an honors class. Professor Berhanu is always available during office hours and does his best to get to know his students and make sure they succeed. If you're not willing to work hard on the material outside of class time, don't waste your time or his. If you take one of his courses expect a challenge, but expect to learn a lot.", "rating": 5, "expected_grade": "A", "created": "2023-05-01T15:41:50.545788Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH141H", "review": "I'm not sure why there are negative reviews here for Prof. Berhanu. I had the pleasure of taking him for MATH140H and MATH141H. He is an excellent professor whose exams are very reasonable. Like any other class, if you put the time into practice and understanding the concepts, it should not be difficult to do well. Professor Berhanu himself is kind, willing to answer questions and explain things, and is very accommodating. Both of his calculus courses were very short of being \"impossible to pass\".", "rating": 5, "expected_grade": "A", "created": "2023-05-13T21:44:03.776687Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH463", "review": "Explains concepts very well, definitely learned a lot in lectures. Gave us an extra exam in order to replace the lowest test score.\r\n\r\nOverall, exams were fair and class was enjoyable", "rating": 5, "expected_grade": "", "created": "2023-05-15T19:23:44.147630Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH463", "review": "Prof. Berhanu is very knowledgeable and passionate about complex analysis, and it definitely enhanced the course a lot. The exams weren't too difficult, and they covered exactly what was taught in the course. His explanations were very clear, and he did a good job breaking down the thought process behind solving certain problems.", "rating": 5, "expected_grade": "A", "created": "2023-05-16T02:32:40.242660Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH463", "review": "Really enjoyed taking 463 with Professor Berhanu. He often uses a more simplified way to solve problems compared to the book, so make sure to attend classes. There was more focus on intuition than computation, which I really enjoyed. And he would often re-derive a theorem required by a problem, which helped with understanding the intuition behind them and ultimately avoid memorization", "rating": 5, "expected_grade": "B+", "created": "2023-05-16T12:45:01.927890Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH140H", "review": "Be prepared to get everything perfect if you want a good grade in this class. Berhanu loves math but he’s not very understanding if you don’t pick up quickly. He hardly gives partial credit and won’t hesitate to take off full points if your answer doesn’t match his preferred method, even if it’s technically right. Only take this if you’re really good at math and can put a lot of time into studying his methods.", "rating": 2, "expected_grade": "C-", "created": "2023-11-04T03:49:49.597437Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH463", "review": "He is very very good at explaining all the proofs in complex analysis and he is a very nice person and encourages all the students to participate inside his class. His exams and homeworks are all very very very fair and you definitely will be able to do them if you put in the work. Overall this course had very insightful theorems and results that make it definitely worth taking..", "rating": 5, "expected_grade": "A", "created": "2023-11-29T18:30:02.978569Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH463", "review": "02/09/23 review is accurate. He is self-centered and makes you feel stupid for asking questions. There are a few favorites he has in class who he clearly treats differently from other students. If two students try to answer a question in class, one of them being a favorite, he will pretty much disregard the answer of the other student, even if it is correct. He goes unnecessarily fast in class and covers the board while he is writing, with no intention to pause and explain what he has written while he was covering it. So you are always playing catchup in his class if you sit in a seat with a poor angle to the board. If you ask a question about a problem that was already done previously, he will not answer it and tell you to look back at your notes (but sometimes the whole point of the question is to clear up the misunderstandings you have about the problem which has been scribbled into your notes to keep up with the pace of the lecture). It almost seems like he wants you to struggle a bit in terms of following along with the lecture. Very conceited personality and reluctant to admit his mistakes when a student points them out in class. I have no idea why people like him sign up to become a professor. They show no care for whether students actually understand the material or not.", "rating": 1, "expected_grade": "", "created": "2023-12-09T19:07:31.213089Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH463", "review": "He is a very engaging lecturer! He did a really good job showing how important the theorems actually were and describing how you might apply Complex Analysis. \r\n\r\nHe does sometimes mumble a little, and the pace is really fast, but that's just because there's a lot of material to cover. The course is difficult, but I think the difficulty came entirely from the content, not from the professor. \r\n\r\nHe gives tons of in-class time to review. Make sure you try all the HWs and practice problems as soon as you get them so that you can ask questions before he covers new material. \r\n\r\nExam grading definitely isn't soft, but he drops your lowest exam (out of three) and the final course grade will get curved. \r\n\r\nIf you are the kind of person who likes to skip class or be late, don't take 463 with Berhanu. Attendance is mandatory in order to succeed.", "rating": 5, "expected_grade": "A+", "created": "2023-12-12T16:47:40.515369Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH140H", "review": "Professor Berhanu is a very good teacher, he just teaches through proofs and some simple examples. I was prepared for this kind of teaching as I had a similar teacher in high school. However, many people struggle with this kind of teaching. His exams are very easy and just a test on how well you know the concepts. I would recommend him to anyone who is a quick and deliberate learner.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T21:00:36.407528Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH463", "review": "Prof. Berhanu is a really good and passionate teacher. He takes the time to not only give proofs for theorems, but also gives motivation and intuition for everything covered in the class. He clearly knows the material really well, and answers all questions really well. He gives plenty of time for exam reviews (1-2 periods dedicated to review), and the exams are extremely fair. If you do any of the practice material he posts, you should expect at least a B+ to A- easily. Highly recommend, especially for anyone who is curious about complex analysis or calculus.", "rating": 5, "expected_grade": "A", "created": "2023-12-16T21:05:35.315110Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH140H", "review": "After reading other reviews, I do agree that Professor Berhanu is a bit of a harsh grader with not much partial credit, but compared to every other Math140 teacher, his tests are the easiest. I looked at friends' tests and they were much trickier, if you understand the concepts then you will get a decent grade in Berhanu's class. If you participate in class Berhanu will boost your grade at the end of the semester, sit in the front and answer the many basic questions he asks during class. But make sure you are right because he is a bit passive aggressive if you get the answer wrong. \r\n\r\nThe Webassign homeworks were only worth 3% which was very nice because they are the same for every section, they take a long time to do and usually do not have content that will even be on the test. If you do the practice exams, and can follow most of the lecture, you will do fine.\r\n\r\nMath140H vs Math140 is a hard choice because H is only 3 times a week, but the quizzes we have are more difficult, but I think it is best to take H unless math is a major sore spot. With H you get more time with the professor (smaller class) and the professors are usually better. Although with normal 140 there are discussions where you work problems out and do easy quizzes, you also get a TA which can be helpful.", "rating": 4, "expected_grade": "B-", "created": "2023-12-23T18:21:39.196570Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH463", "review": "If you want to take MATH463, I would really recommend doing so with Dr. Berhanu. I don't know what goes on in other sections, but based on their finals I believe Berhanu gave a more enriched complex analysis experience. It was pretty hard and the midterms have 50-65% averages (with no curve), but the final was very easy and most of the class did well. If you are a math major who wants a more rigorous approach to undergraduate complex analysis, Berhanu is your guy. One minor complaint I have is he moves quite fast, but to be fair he is always very willing to answer any questions.", "rating": 5, "expected_grade": "A", "created": "2023-12-25T21:22:29.570840Z"}, {"professor": "Shiferaw Berhanu", "course": "MATH463", "review": "He is a decent lecturer, and clearly knows the course materials but requires every student to go to all of his lectures although there are no participation points. He is a very bad grader, if you don't go to his lectures and he remembers you, he will grade your exams poorly even if your answers are correct but not the exact same solution he gives and then blame you for not going to every lecture.", "rating": 1, "expected_grade": "", "created": "2024-02-22T23:00:42.879462Z"}], "name": "Shiferaw Berhanu", "slug": "berhanu_shiferaw"}