{"courses": ["PLSC115", "PLSC489Q", "PLSC399", "PLSC689A", "PLSC689Q", "PLSC489E", "PLSC115", "PLSC489E", "PLSC689G", "PLSC689G", "PLSC215", "PLSC489E", "PLSC115", "PLSC489E"], "average_rating": 2.5, "type": "professor", "reviews": [{"professor": "Shirley Micallef", "course": "PLSC115", "review": "Let me say this class is an easy A in terms of work. She grades super weirdly though so other people may disagree with me. This isn't a hard class at all, but everything that went on in this class was obnoxious to say the least. There is clearly no communication between her and the TA. The TA we had when I took the course was terrible, she wouldn't follow the professors instructions and graded as she pleased even though it wasn't fair. An example of this is she took a point off of a classmates discussion for being on her phone, she said this was the first day of class after weeks of asking her what date she was on her phone and if she made a note of it. (The discussion is a huge part of our grade and there are always people on their phones and laptops who she never deducted points from.) The assignment on the first day of class was to use your phone and to text in your answers of questions and they would appear on the screen. She wouldn't let students sign in to attendance being 2 minutes late to a lab that was a 15 min walk away from our normal classroom. She told us we needed to talk once a day during the semester then that changed to not being enough and we had to talk more than once and sending in articles to not? It was so confusing and obnoxious, especially if you have other demanding classes and work going on. The professor is extremely hard to get in touch with, takes weeks for her to email you back because she's always out of the country. When I emailed her about the TA she had absolutely no idea what was happening. In all honestly it's not a hard class at all, and the material is interesting, but this was honestly the worst class I have ever taken here at UMD and I can't say I recommend it at all. This class is a huge waste of time, but if you're looking for an easy A and don't mind dealing with all this non-sense maybe take this class.", "rating": 1, "expected_grade": "A-", "created": "2019-03-27T17:48:59Z"}, {"professor": "Shirley Micallef", "course": "PLSC115", "review": "The class was an easy A (if you study for the tests). Dr. Micallef was interesting to listen to online (I put the lectures at 1.25 speed or it would have been a bit slow to focus) and did a great job of explaining things. The tests were very difficult. Also, the group project was terrible (just because she did not provide lots of details on what she wanted and then graded it super strictly.)", "rating": 4, "expected_grade": "A", "created": "2020-12-04T02:25:57Z"}], "name": "Shirley Micallef", "slug": "micallef"}