{"courses": ["ENGL101A", "ENGL101", "ENGL101S", "ENGL101H"], "average_rating": 4.0, "type": "professor", "reviews": [{"professor": "Stephanie Allen", "course": "ENGL101S", "review": "Ms. Allen is a very kind and thoughtful teacher who is willing to assist any students in need. Personally I struggle with writing, but Ms. Allen helps guide students in the class format and is happy to  answer any question thrown at her and guide her students on the right course. Highly recommend for any students taking this course.", "rating": 5, "expected_grade": "A", "created": "2020-12-14T16:40:38Z"}, {"professor": "Stephanie Allen", "course": "ENGL101", "review": "Fair grader, lets you skip class, very kind and thoughtful. She is a great professor and an easy A.", "rating": 5, "expected_grade": "A", "created": "2022-05-24T18:27:28Z"}, {"professor": "Stephanie Allen", "course": "ENGL101", "review": "Great professor. Class does get a bit boring but I think that's just English 101 for you. Extremely patient, listening, thoughtful, understanding. Grades fairly. Deadlines are nice and spaced apart. Under her, there is no final exam and you just have five major assignments to submit (I don't know if this is true for all English 101 classes or not). \r\n\r\nReally nothing bad to say about her, she's been great and English 101 has been smooth sailing under her with minimal effort and stress. \r\n\r\nHighly recommend 10/10", "rating": 5, "expected_grade": "A", "created": "2022-10-23T03:21:39.933387Z"}, {"professor": "Stephanie Allen", "course": "ENGL101", "review": "Great professor. Class does get a bit boring but I think that's just English 101 for you. Extremely patient, listening, thoughtful, understanding. Grades fairly. Deadlines are nice and spaced apart. Under her, there is no final exam and you just have five major assignments to submit (I don't know if this is true for all English 101 classes or not).\r\nReally nothing bad to say about her, she's been great and English 101 has been smooth sailing under her with minimal effort and stress.\r\nHighly recommend 10/10", "rating": 5, "expected_grade": "A", "created": "2022-10-28T11:20:10.004465Z"}, {"professor": "Stephanie Allen", "course": "ENGL101", "review": "I took this class in Fall 2022, and it was very boring and mostly useless.  However, I believe this to be the fault of the class, not the instructor.  Her lectures were not interesting, but the assignments were very clear, and the class wasn't much work.  I felt that she graded fairly, and I found her very willing to help with these assignments and answer any questions I had.  It definitely wasn't necessary to do the readings (or to pay attention to the lectures), so I found this class to be low-stress and requiring little effort.  I thought Ms. Allen did as good a job with this class as anyone could, and any failings in this course were with the material itself, and not the instructor.", "rating": 4, "expected_grade": "A+", "created": "2023-04-22T02:48:20.132672Z"}, {"professor": "Stephanie Allen", "course": "ENGL101", "review": "Boring class, but there isn’t much Ms. Allen can do about that. She’s nice and very understanding. That’s all you can ask for from an ENGL101 professor.", "rating": 4, "expected_grade": "A", "created": "2023-11-30T15:37:28.161057Z"}, {"professor": "Stephanie Allen", "course": "ENGL101", "review": "Its 1:36am, I literally just turned in the last assignment for this class, and over the course of this semester, i have learned this:\r\n\r\nif you are STEM major(i'm computer engineering), especially as a freshman, understand this:\r\n\r\n1. this isn't hard, its a LOT of busy work that's so time-consuming\r\n2. It's a lot of writing(duhh its english) so if ur not good at it... praying for you<3\r\n\r\nthe fact I'm even complaining abt an ENGLISH class as a STEM major goes to show how much i highly do NOT recommend you take it with this professor. Some of her grading is fair but she takes off points for NO reason. if you have no other choice but to take her, my tip for success for any assignment, especially major ones:\r\nFOLLOW THE RUBRIC DOWN TO THE LETTER!! You have to go to class for discussions and draft workshops cause those will kill ur grade if u miss them and u can't be late either cause they literally start as soon as class is scheduled to start\r\nYou can ask for an extension and she will give you one(if it's within valid reason obvi (literally 1/5th of the class had a CS project due the day one of the major assignments was due)), but she still took off points for turning it in after the original due date\r\nHer lecturers are so boring and it's sad when no one participates without her calling their name specifically...but then I remember how she will literally interrupt you if she thinks you aren't answering her question so karma ig?\r\nIdk anyway, choose peace, choose LITERALLY anyone but her\r\n\r\n(oh and the \"assigned readings\" have no relation to the class other than her referencing them in her lectures so if u read them or worse, buy the book, it is lowkey a waste of time cause u will not need any of the information from it unless she posts it on canvas)\r\n\r\nGodspeed to whoever is reading this <3", "rating": 1, "expected_grade": "B+", "created": "2023-12-06T06:40:53.877609Z"}, {"professor": "Stephanie Allen", "course": "ENGL101", "review": "She is VERY boring in class and shows literally no emotion during her lectures. If you ever want to speak to her about how she grades things she is NOT understanding about it. She also has some weird policies about when and how you can contact her and is also pretty slow with grading. I would not recommend taking her if you are able.", "rating": 2, "expected_grade": "A-", "created": "2023-12-21T06:36:53.935189Z"}, {"professor": "Stephanie Allen", "course": "ENGL101", "review": "The class can get a bit boring, and you might feel sleepy. The only piece of advice I can give you is to follow the rubric of the assignments very carefully and attend the draft workshops— other than that she is a fair grader and even grants extensions if you ask for them. I also feel that the courseload was less as compared to other classes.", "rating": 5, "expected_grade": "A", "created": "2024-01-23T22:32:28.527944Z"}], "name": "Stephanie Allen", "slug": "allen_stephanie"}