{"courses": ["CMSC425", "IMDM227", "IMDM101", "CMSC425", "CMSC425", "IMDM227", "CMSC425", "IMDM101", "CMSC398C", "CMSC425", "CMSC425", "CMSC425", "IMDM227", "CMSC425", "IMDM101", "CMSC425", "IMDM227"], "average_rating": 2.8889, "type": "professor", "reviews": [{"professor": "Stevens Miller", "course": "CMSC425", "review": "I really enjoyed this class. Stevens clearly put in the time for each lecture, and made the class interesting, with lots of live coding examples. Plenty of supplemental material to go along with the lectures as well, and VERY generous with how the class was graded. I'm talking getting a grade back, being permitted to fix the problems, and resubmitting for FULL POINTS. He did reverse curve at the end of the semester (which was scandalous and caused a huge conflict), but honestly, just doing the minimum on the assignments and the easy exams netted me a 97 in the class. I don't consider myself a genius either. The only reason he upcurved is because everyone was doing so well in the class. Highly recommend him as a professor, and I would definitely take him again.   ", "rating": 5, "expected_grade": "A", "created": "2021-01-25T21:11:45Z"}, {"professor": "Stevens Miller", "course": "CMSC425", "review": "Do not trust these IGNORANT 1-star reviews. He upcurved because this was the easiest class in all of existence. HE LETS YOU REDO PROJECTS FOR FULL CREDIT. If you get a bad grade on a project you can just resubmit a week after the deadline for full credit. All of his projects are super straight forward and he has great informative lectures. Rubrics were super straight forward and his exams were also very straight forward (one exam which is a 40 question online assignment with no time limit). He was super nice and down to Earth, not pretentious like some ignorant people say. The midterm wasn't even an exam it was just a project that he gave you 2 weeks to do. He also records all of his lectures. \r\n\r\nStevens was by far the best CS professor I have ever had. Anyone who tells you otherwise is just mad they didn't take advantage of his resubmit policy because they didn't think he would up curve even though resubmit policy is so BS and overly benefits the student. I didn't even need to use the resubmit policy because the projects were so straightforward and easy to understand and do.", "rating": 5, "expected_grade": "A+", "created": "2021-01-25T21:11:58Z"}, {"professor": "Stevens Miller", "course": "CMSC425", "review": "Curving backwards is unacceptable, a teacher should not move the goalpost and suddenly tell students the grade they've been working towards is now a different grade. A LOWER grade.\r\nAlso I'm 99% sure Miller wrote those good reviews himself:\r\n1) They're both posted on the same day\r\n2) Who writes a review the day before the next semester starts, and the class has been over for 4 weeks\r\n3) If you go to rate my professor there is another good review posted, what do you know, the same day as the good reviews here.\r\n\r\nMan has to write his own good reviews.", "rating": 1, "expected_grade": "", "created": "2021-05-28T16:21:25Z"}, {"professor": "Stevens Miller", "course": "CMSC425", "review": "This is the definition of a 2-star class. The material was original and the lectures were just interesting enough to keep me from withdrawing.\r\n\r\nThe class is terribly organized for the following reasons:\r\n1. Homework assignments are out of between 4 and 7 points, so when you lose half a point on a question, it turns out to be around 10% of the total grade for the assignment, even if your mistake isn't that big.\r\n2. Assignments are graded without any indication of what you lost points for (rubric not filled out and no comments), so for each assignment, you have to make a piazza post asking where you lost points. Archaic and pointless way of doing things. Also, they don't post solutions for most of the homework assignments.\r\n3. You have two days to request a regrade on assignments, which is unreasonably short when they don't post solutions and you have to ask what you lost points on.\r\n4. You're only allowed one submission per assignment, so if you submit and then realize you did something wrong you're out of luck, even though the deadline hasn't passed yet.\r\n5. You'll lose points on questions if your answers contain too much information. Whatever that means.\r\n6. During some of the synchronous lectures, he just played recordings of his previous lectures, which is fine, but why hold synchronous classes if you're barely going to interact with the students?\r\n7. While my class didn't seem to experience a downward curve (perhaps even a slight upward curve?), the possibility of having one is absolutely ridiculous. It really just exemplifies how poorly organized this class is. If the students do well on the assignments, they should get the grades they earned, and if the assignments are easy enough that everyone aces them, make them harder. Don't leave me guessing whether I'll be bumped down a grade because you're having a bad day.\r\n8. Somehow after all the assignment grades were in, it took them over a week to put in final grades, which was incredibly stressful given the lack of transparency regarding the curve.\r\n9. There was no mention of redoing assignments for full credit, so I'm not sure where the previous reviews got that from, but this was the summer session, so that could be part of it.\r\n\r\nNo single point is that bad on its own (except maybe curving down), but it's infuriating to deal with poor organization in every part of this class. Game programming is cool, and I learned a bunch, but it wasn't really worth the stress and poor organization.", "rating": 2, "expected_grade": "A", "created": "2021-07-23T02:40:23Z"}, {"professor": "Stevens Miller", "course": null, "review": "The dude really went and wrote 2 reviews on the same day and capitalized the exact same points. Poorly organized class", "rating": 1, "expected_grade": "", "created": "2021-08-02T02:44:39Z"}, {"professor": "Stevens Miller", "course": "IMDM101", "review": "If you're going to take this course and not do the major, do NOT take it with Stevens. While very VERY knowledgeable, he is really harsh and critical for a 101 level course. He grades really harshly and if you're new to programming you might struggle with class content. It is literally his goal to keep you from getting an A at all costs. While that's funny and all for upper level classes, in my opinion it is brutal considering its literally an an intro course. You have been warned.", "rating": 2, "expected_grade": "B", "created": "2023-05-15T05:02:20.437726Z"}, {"professor": "Stevens Miller", "course": "CMSC425", "review": "Course consisted of weekly/biweekly homework assignments in Unity covering all sorts of topics in class. Final project is the semester long creation of a game with your (5 person) group. There was also an exam the week before the final game is due of 30 multiple choice questions covering the class. \r\n\r\nI personally felt like the homeworks were tough and took a good bit of time but were definitely doable. Stevens clearly has a ton of knowledge about the field and is very passionate. Overall I felt like a lot of the lectures were slow and repetitive and not always relevant to things I needed for assignments like the final project. For someone interested in game programming and entering the field the lectures would likely be much more interesting. Had to do a lot of self research for assignments, especially the final game (Lot of Unity documentation) but the final project was fun and rewarding and  you can really do whatever you want. \r\n\r\nThe class is certainly not a walk in the park, but its not a bad class to take if you need a class.", "rating": 3, "expected_grade": "B+", "created": "2023-11-29T15:49:42.353535Z"}, {"professor": "Stevens Miller", "course": "IMDM227", "review": "average teacher. he underestimated how hard his assignments were, so he extended the due dates to almost all of them. if anything, it feels like he's still trying to get his footing with how to teach this class. lectures don't relate to the assignments as much as they should. if you don't understand the basics of coding (like logistically), the class will be a bit harder. i came in with little c# experience but the class was manageable.", "rating": 3, "expected_grade": "A-", "created": "2023-12-21T05:31:19.478624Z"}, {"professor": "Stevens Miller", "course": "CMSC425", "review": "This was a decent class. The lectures were somewhat dry, but I felt I learned a few interesting tricks about Unity Game Programming. There were HW's every two or three works, and they were tricky because we usually did not learn how to do them in class. They took maybe 4-5 hours each. The final project was making a full game, and I had fun with it. The final exam was reasonable. \r\nThis professor reminds me of Larry Herman--he is quite particular about rules and he is very specific about how he says things. He also has the same sort of monotone voice. If you don't follow his strict rules, then he gets angry with you, which I didn't appreciate.\r\nI'd suggest this class to anyone wanting to get into game programming.", "rating": 4, "expected_grade": "A", "created": "2023-12-28T04:26:43.657553Z"}], "name": "Stevens Miller", "slug": "miller_stevens"}