{"courses": ["BSST338B", "BSST338K", "BSST240", "BSST241", "PLCY752", "GEMS296", "GEMS297", "CCJS498P", "BSST338Q", "BSST638Q", "GEMS396", "GEMS397", "CCJS318F", "BSST240", "BSST241", "CCJS498P", "CCJS318D", "BSST240", "BSST241", "CCJS498P", "BSST650", "CCJS318F", "BSST240", "BSST241", "BSST650"], "average_rating": 5.0, "type": "professor", "reviews": [{"professor": "Steve Sin", "course": "BSST240", "review": "Loved Prof Sin- really smart dude who's hilarious and super engaging. I would definitely recommend taking the lab in conjunction with this class. I signed up for this class not super into terrorism studies or CBRN weapons, and ended up getting super into the material. Take BSST240 and 241!!", "rating": 5, "expected_grade": "A+", "created": "2022-10-21T18:13:46.485850Z"}, {"professor": "Steve Sin", "course": "BSST240", "review": "omg the easiest dsnl if u take it with bsst241. theres only 6 assignments, 3 are presentations and 3 are just reflections for each presentation where you say what each person did. the presentations are supposed to be 15-20 mins but he'll give you a 100% even if they are like 5 mins. you also dont have to physically present, you just take screenshots of the slides, add audio recordings in the background and that can be your presentation. hes never gave a group below a 100% on any presentation. funny guy", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T01:14:37.715967Z"}, {"professor": "Steve Sin", "course": "BSST241", "review": "insanely easy. you do minimum research about a weapon/agent and thats it. theres like 5 assignments. lab is 2.5 hrs but we always got out max 1.5 hrs after. most times it was only 45 mins. easiest dsnl ever", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T01:16:26.560631Z"}, {"professor": "Steve Sin", "course": "BSST240", "review": "I only took this course for the DSNS credit but I ended up really loving this class. Prof Sin is a very nice guy and he definitely knows what he is talking about. Your grade in the class is based on three group projects (two 10-15 minute topical projects and one 20 minute semester long project) that are very manageable. There is no homework, quizzes, or exams, just the group projects. There are readings but I didn't read any and passed with an A+. He does take attendance, but the classes are also recorded on zoom just in case you are not able to join in-person. Overall, if you need an easy DSNS credit (or DSNL if you take BSST241) this is definitely the class to take!", "rating": 5, "expected_grade": "A+", "created": "2022-12-13T22:26:04.981913Z"}, {"professor": "Steve Sin", "course": "BSST240", "review": "Really nice and funny teacher.  The content was very interesting and kept me engaged and the work load was very light.", "rating": 5, "expected_grade": "A+", "created": "2023-12-05T23:35:04.064403Z"}], "name": "Steve Sin", "slug": "sin"}