{"courses": ["BSCI171", "BSCI171S", "BSCI170", "CPSP218L", "BSCI171", "BSCI170", "BSCI171", "BSCI171", "BSCI171S", "BSCI171", "BSCI171", "BSCI170", "BSCI171", "BSCI171", "BSCI171S", "BSCI170", "BSCI171"], "average_rating": 2.7358, "type": "professor", "reviews": [{"professor": "Swarna Mohan", "course": "BSCI171", "review": "This professor did not care about the students while going through a rough time in S20", "rating": 1, "expected_grade": "B+", "created": "2020-05-13T01:50:56Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "During this Spring20 semester as bio171 lab has been online, this lady (as the head of the department) was a NIGHTMARE to deal with. She thought that by opening up a discussion thread she would be able to answer all questions students had in an efficient way. As students, we assumed she would be answering all our questions and trying to be as helpful as possible as moving a lab online is very difficult for students to manage as much as the TAs. But NO. She was of NO help when you asked a question in the discussion thread, and just tell you to refer to a different page, when we already didn't understand that page in the first place. Overall, I wish I never had the chance to have to work with this lady, as she was very bad with communicating and helping her students during this semester. Just horrible!", "rating": 1, "expected_grade": "A", "created": "2020-05-16T03:37:09Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "Professor Mohan is strict and straightforward. She is not very helpful herself, especially since this class is asynchronous, so if you need help you have to ask a TA. The lectures are not that long but do not provide adequate information for the weekly quizzes. Overall this class is a LOT of work (labs, quizzes, lab reports) all for just 1 credit.", "rating": 3, "expected_grade": "A", "created": "2020-12-04T17:45:10Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "The professor herself did not really engage at all especially in the virtual setting and she did not provide much clarification. On the flip side, the class itself was not too hard to get a decent grade although the workload for it was too much for a 1 credit class. The TAs I had this year was a lenient grader and gave good clarification on assignments.", "rating": 2, "expected_grade": "A", "created": "2020-12-09T21:15:13Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "171 was a very easy class to do online that requires very little effort. The lab simulations were kind of silly, and based on the lab manual, I imagine the labs would be pretty difficult to do in person. The quizzes were very easy, and you had to take them all twice, where the second attempt is worth more points (the questions are exactly the same though). Dr. Mohan didn't really make much of an effort to reach out to students; I don't even know what she looks like. Her pages on elms were also pretty cluttered, but they gave specific enough instructions.", "rating": 3, "expected_grade": "A+", "created": "2020-12-16T20:47:15Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "Professor Mohan is strict and straightforward. She is not very helpful herself, especially since this class is asynchronous, so if you need help you have to ask a TA. The lectures are not that long but do not provide adequate information for the weekly quizzes. Overall this class is a LOT of work (labs, quizzes, lab reports) all for just 1 credit.", "rating": 3, "expected_grade": "A", "created": "2020-12-18T23:13:02Z"}, {"professor": "Swarna Mohan", "course": null, "review": "Overall this class is a lot of work for just 1 credit. She herself is okay, but the TA is really who you interact with.", "rating": 3, "expected_grade": "A", "created": "2021-01-17T18:16:29Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "The absolute worst professor at the University of Maryland. Completely unhelpful and way too much of a workload for a single credit. I would not recommend this professor and I only hope that she is fired soon, so that other students will not have to endure her pathetic teaching style and this horrible class experience.", "rating": 1, "expected_grade": "A+", "created": "2021-02-04T21:03:29Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "Mohan straight up sucks. She gives way too much work for a 1 credit class and never really offers help to her students. Its so annoying how a 1 credit class has more work than some of my 3 credit courses. Do NOT take her class if you have the option to enroll in other professors' bsci171 courses.", "rating": 1, "expected_grade": "", "created": "2021-03-05T02:21:25Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "Excessive work and harsh grading, especially considering it's a one-credit class. She is very inflexible with due dates and other possible concerns; she's inconsiderate of student's time. In the online format, there is no direct interaction with her and she discourages it. Her lectures are somewhat helpful, but very dry and did not really elaborate much on the content found in the lab manual we are expected to read. In general, unhelpful and harsh. Would not recommend her class at all.", "rating": 2, "expected_grade": "", "created": "2021-05-07T17:46:31Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "I took this class online during Covid and I barely had any interactions with her. The TA's pretty much run the class, but an A is definitely possible. As long as you put in the work and actually take the time to watch the lectures, you'll do fine in the class. I ended the class with a 97% so it's very possible to get an A.", "rating": 4, "expected_grade": "A", "created": "2021-05-11T18:00:12Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "I didn't really have to interact with her much thankfully since it was mostly the TA's running the class but GODDAMN did this class suck. All Mohan is really good at doing is assigning large amounts of ridiculously stupid assignments and gives little to no leniency with them. I legit spent so much more time on this class than I did my 3 credit BSCI170 course. I swear sometimes it feels like she rambles on more about academic dishonesty rather than actually teaching useful shit in her lectures and explaining assignments well. She also talked a lot about how assignments were individual and you weren't allowed to work with people on them. And I think she should first start by teaching things properly so that students won't feel the need to collaborate in the first place LMAO. Thank god I had a super chill TA though. She was super kind, helpful and a fair grader.", "rating": 2, "expected_grade": "B+", "created": "2021-05-13T16:39:43Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "The class is very straightforward and most of the time all assignments for the week can be done in a day or 2. Going to the TAs if you need clarification is important. Overall not too challenging to get an A if you put in the work to get assignments done and get help from office hours.", "rating": 4, "expected_grade": "A+", "created": "2021-05-22T18:11:57Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "The workload was heavy for a one-credit class, however, that's kind of always how it is for lab classes, so it's nothing new. The assignments we not very difficult, just time-consuming. As long as you spent time and effort on the assignments you should do pretty well. ", "rating": 4, "expected_grade": "A", "created": "2021-05-28T01:40:54Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "The expectations were very clear for this course and the work load was fair. If you put in effort, you will get an A", "rating": 5, "expected_grade": "A+", "created": "2021-12-02T16:43:31Z"}, {"professor": "Swarna Mohan", "course": null, "review": "She's just straight up not a nice person.  she is stiffer than a brick.  ", "rating": 1, "expected_grade": "", "created": "2021-12-07T16:33:08Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "She's not that bad of a professor. Her lectures can get boring and I find it hard to stay focused. However, when she's lecturing she does point out if the information will be on the exam and how she would test us on it which was extremely helpful when rewatching lectures and studying. I think that if you put in the work, do the weekly quizzes and study at least a week before the exam you should have no problem getting an A. Her exams are straightforward and if you studied you should do well.", "rating": 4, "expected_grade": "A", "created": "2021-12-16T03:32:27Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "She makes students feel stupid and is honestly so rude. Avoid her at all costs. I went to her when I was struggling in the class and she told me to literally keep doing what I was doing. She goes way to fast and her exams are so hard. Her wording is the worst in the exams- note, they are not multiple choice. I regret signing up for her class and even going to her for help. I had an A until recently because her exams are so hard and 50 minutes is not enough. Also, having extreme anxiety for her final tomorrow. ", "rating": 1, "expected_grade": "B", "created": "2021-12-17T22:12:11Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "The TA ran the class so did not have much exposure to Dr. Mohan, but do not rely on her for questions. If your TA is not clear about what you are supposed to be doing (which mine is not) do not even try emailing Dr. Mohan because she will direct you back to your TA. Office hours are your best bet and usually clear all confusion. Hopefully you can understand your TA's accent (I couldn't) but if not, just go to office hours.", "rating": 3, "expected_grade": "", "created": "2022-04-26T16:10:15Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "This is a lab so you will not be seeing Mohan at all lol. TA's run the class. My ta was very helpful and knowledgeable so I think it depends on the TA you get. To be honest, this class is so easy. Compared to Chem132(hell), this class is a breeze. Her assignments are easy and if you have trouble with it just go to office hours, it's that simple. Her pre-labs are pretty easy the answers are in the book/pdf she uploaded. If you manage to do well on all of her post lab, then you are for sure getting an A. She doesn't curve. The hardest thing in this class was probably the lab practical, lab report, and poster project (which you have to present). I did below average on the lab practical (an 80). But I assume that most people thought it was easy. I believe the average is an 87. The lab report is probably the hardest assignment with the average being an 80. And the poster project is pretty easy so don't sweat it. Majority of the class did pass with a B+. Anyways you are forced to take her anyways so you can't run away lol.", "rating": 5, "expected_grade": "A", "created": "2022-05-18T13:21:23Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "The TA's run the entire class so you only will be able to see Dr. Mohan once or twice. This class really depends on your TA. The class is pretty straight forward with pre-lab assignments, post-lab assignments, lab practicals, and reports. Going to TA office hours is important, especially before the Lab practical, because they will go over everything to help you succeed. Make sure to show up to your labs (absences can be pretty rough because this class is solely based on you showing up). This class really depends on your TA, but overall just show up to labs and you should be ok. ", "rating": 3, "expected_grade": "A+", "created": "2022-05-21T13:20:59Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Dr. Mohan is extremely knowledgable about the subject and offers great resources to help prepare for exams. All of the exam material is consistent with what is taught in class, participation is key to ensure you do well on the exams. The only complaint is that there are 3 exams throughout the semester, with the final exam shortly following the third, with little time in between. Overall, BSCI170 with Dr. Mohan is a course I do not regret taking and would highly recommend her as an instructor", "rating": 4, "expected_grade": "A", "created": "2022-12-02T20:15:44.619092Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "I never tried to contact her, and I never saw her. This is a class entirely taught by a TA. Still, she designed the class and I thought it was a good lab. Some of the instructions in the lab manual were a little hard to follow or confusing, but other than that it was all good. The lab manuals, to my knowledge, are also updated every year... so make sure to get the current lab manual!", "rating": 3, "expected_grade": "B+", "created": "2022-12-09T17:05:16.767840Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "Literally had no interaction with her. This course entirely depends on your TA and I was lucky to get a really good one. The class itself isn't too difficult, but it was a bit time consuming, tedious, and boring.", "rating": 3, "expected_grade": "A+", "created": "2022-12-15T18:31:42.145543Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "I have never seen Dr. Mohan, as she is the lab coordinator. However, my TA (Householder), was awesome. I felt that the lab manual was well written and easy to follow, and that the assignments of the lab weren't overwhelming. A lot of the experience that someone has when taking a lab is due to the TA, but removing that factor, the guidelines, the manual, and the course structure created by Dr. Mohan were enough to make concepts stick in my mind (like DNA replication) but not too intense where I have to spend all of my time on a one-credit lab.", "rating": 5, "expected_grade": "A+", "created": "2022-12-15T22:59:39.556118Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Dr. Mohan is extremely knowledgeable about the subject, but she teaches very fast, it is hard to keep up. If I had not taken AP Bio in high school, I probably would have struggled immensely in this class. Her slides are very disorganized, often either containing a lot of words, or just screenshots of pictures from the textbook, making them hard to follow. She also does not give very much introduction to the topic and just starts lecturing, often going from one topic to another that have zero connection. She does clicker questions, and you have to answer 80% to get the full 50 points, so you do have to go to class most of the time. HOWEVER, she records lectures and posts those and the slides right after class which was helpful. Additionally, every week she does a problem set, and drops the lowest three grades, so you do have to be present for those. There are three exams plus a final and none are dropped. She provides a very loaded list of what you need to know, basically including every single thing we learned, as well as the problem sets with the answers. Overall, I did not enjoy her teaching style and I taught myself 90% of the topics through YouTube videos. You also have to study A LOT. Get ready to teach yourself. She does not curve the class at all, which I found unfair due to the amount of work I put into this class. She does not appear to care about her student's success, so please try and take a different professor who actually cares and does not make you dread class.", "rating": 2, "expected_grade": "B+", "created": "2022-12-20T00:33:52.462906Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "She definitely goes fast in lectures but she uploads them to canvas so you can rewatch anything you missed. Her study guides for the exams list (nearly in order of how they appear on the exam) exactly what you need to know. She will also tell you as she teaches what things will be important on the exam and what will not. Sometimes she jumps around but its really manageable with a bit of review. You definitely have to watch every single lecture (online or in person) and then go through and deeply review all of the terms on the study guides for the exams. The weekly quizzes are super easy as long as you took lecture notes. Although BSCI170 is a broad, difficult class, it is mainly memorization. Mohan teaches it very straightforward and there were never any trick questions/unclear questions on the exams.", "rating": 5, "expected_grade": "A+", "created": "2022-12-22T06:40:01.199319Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "She wasn't a bad professor, but she went over the lecture slides quickly, making it difficult actually to learn the material. I took this course during my first semester and since I'm a first-year student, I found the content of this class to be DIFFICULT. I felt more behind than everyone else since I didn't take any AP science classes like bio or chem in high school. For this class to be seen as a doable course for first-year students is a bit much. I felt like I wasn't learning anything cause the amount of content you go through in this class is face paced and a lot. If you don't have any prior background in Biology I think you may find this class difficult as it was for me. The lectures are somewhat mandatory since at the end she does give 50 points if you answered over 80% of the clicker questions. The weekly quizzes were online and fairly easy. The problem sets that happen in class aren't bad sometimes the problem sets were difficult it had the whole class confused but I think asking around and talking to people will get you to understand the problem sets more. The exams are NOT multiple choice. They consist of things like matching definitions and almost like word problems, so you have to study a lot to know the material cause when I studied I still struggled on the exams cause I felt like the wording is off. I don't know if I would suggest the professor cause I just struggled mainly with how the class was structured more than the actual professor. She does give you a lot of resources and practice problems and a list of all the content you need to learn for midterms and exams. There are 3 midterms and a final which is 2 weeks after the third mid-term. I would say find a better professor if possible but also be prepared to study a lot in class especially if you don't have any science background.", "rating": 2, "expected_grade": "C", "created": "2022-12-23T04:13:57.787591Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "This class was really stressful. The grading wasn't necessarily harsh, but I never knew what to include in my worksheets or writing because the instructions for assignments were really vague. Weeks 4-16 are basically two different group projects, and if you have a bad group you're going to be spending a lot of time on the assignments. My TA usually let us out early.", "rating": 3, "expected_grade": "A", "created": "2022-12-24T14:36:30.982145Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Honestly, she's not that bad. Before I took her class, the reviews scared me but after taking her, she's a great teacher . . . sometimes. When it comes to course material, she is very organized and has recorded lectures which is great because if you don't get the information down the first time, you can watch it as many times as you want. Although she does post the slides, some of them have the information written on them but some don't. So you actually have to take notes on what she says because sometimes she shows diagrams and the info she speaks is important for the quizzes or practice problem sets. NOT ONCE did I use the textbook so don't waste your money, it's useless. But that just shows how good of a lecturer she is. She also is awesome at creating reviews for exams. Her exams are similar in format to the practice problem sets that we do in class so it's a good thing to become comfortable with the format (not confusing at all). Her practice exams are also very helpful. Clicker questions are done during class but they are based on participation so it's not much of a hassle. One reason I didn't give her 5 stars is because of her manner. She sometimes comes off as passive-aggressive when answering questions for her students but I kind of understand, kinda. Like saying \"you can go over the recorded lecture after class, I will not repeat myself because of our limited time\" which I kinda get but she also gives standoffish vibes which might prevent students from asking questions.", "rating": 4, "expected_grade": "A+", "created": "2023-01-10T17:45:26.328785Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "Dr. Mohan does not directly teach us but she has multiple TAs to teach 1 section each. We've had multiple run-ins with Dr. Mohan and they've all been somewhat traumatic. By our 5th class, our TA got replaced by Dr. Mohan after an unrelated and unforeseen health emergency. Our lab section really loved that TA, but we expected that Dr. Mohan would fire her after that health emergency. Dr. Mohan swiftly replaced her with another TA. This TA was much, much worse than the other TAs. Our section overall had the lowest average score. Before our TA got replaced my grade in that class was an A+ and it ended up dropping to a C. Our lab section is always last to leave because she makes mistakes in the procedure, blames us for her mistakes, and for not correcting her. She never admits or acknowledges that anything is her fault. Our section is constantly anxious around her, partially due to how Dr. Mohan randomly drops into our lab section because our TA told her that we weren’t good students. Also, don't attempt to ask Dr. Mohan for help, she will not help you. Another thing, she has a very strict policy and won't sympathize with you and give you leniency. Avoid this class and her if you can.", "rating": 1, "expected_grade": "A-", "created": "2023-01-11T22:13:43.681584Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "I was scared going into her class due to past reviews but she was not as bad as the reviews make her out to be. She was very straightforward and went deep into her lectures. She records her lectures but has clicker questions so going to class is mandatory. However, you only need 80% of clicker questions to get an A, so if you can't go to class for any reason, it's not the end of the world. There were 3 midterms and a final with a 2-week break between the 3rd midterm and final. She was very understanding when I was sick and couldn't go to class and take her midterm. She was very accommodating and waited until I was better to give me the midterm. Her TAs grade everything and she gives many chances for regrades. There is a quiz each week, due at the same time each week. It is online and open note and she gives plenty of resources to help you. For all her midterms and the final, she provides all recordings, past exams, practice exams, past quizzes, and a list of everything that will be on the exam. It is a hard class but if you just listen to all the recordings, go to TA review sessions, utilize the GSS person and do all the assignments you'll get an A. One thing was she can be a bit condescending when people ask questions but is intrigued by other questions. Also make sure not to talk in class when she is talking or she will certainly embarrass you. She definitely has tricks in her exams so make sure you know the material throughly. I ended the class with a 89.7 and she rounded it to an A even though the syllabus marked 89% as a B. W teacher tbh", "rating": 5, "expected_grade": "A", "created": "2023-01-15T23:21:12.578689Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "i had her fall 2022 & didn't see her reviews until too late so i was scared. she ended up being fine, i think the reviews are a bit harsh. she has weekly quizzes online with 2 attempts, nothing too bad, weekly in class problem sets that are really helpful for the exams, and she records her lectures and posts all of the slideshows. there were 3 exams and the final, the spacing was really bad because the third exam and final were only a few weeks apart which left me cramming to learn the latest material. she also has clicker participation that's only graded on completion so don't miss too many classes or you won't get a full participation grade. as a professor she was fine, she was accommodating when i was sick and is definitely very passionate and knowledgeable. she does move fast but stops for questions, she does not appreciate talking in class so don't do that. as long as you understand her lectures and are doing the problem sets and asking questions you'll do fine", "rating": 4, "expected_grade": "A-", "created": "2023-01-26T20:36:55.487869Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "I never met professor Mohan, but this wasn't an issue at all. The pre-labs are fairly easy and you have two attempts, so you should be able to get 100 on most of them. There were no exams and instead were some projects interspersed throughout which I actually found quite fun and actually applicable to possible future research. None of them were too hard either. I had a fantastic TA (Elizabeth!!) who was super kind and helpful, so that always made lab go a lot smoother.", "rating": 5, "expected_grade": "A+", "created": "2023-05-02T01:14:05.336919Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "Supper rude and inconsiderate. She is opposite of helpful and you can tell she doesn't give a damn about her students.", "rating": 1, "expected_grade": "B", "created": "2023-05-05T00:40:44.549684Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "I am honestly shocked by this professor and her actions.  She has been beyond unprofessional, rude, and unhelpful in every interaction that I've had with her. She doesn't even teach the class directly week-to-week, but she's made it very clear that she assumes the worst in every student. She does her best to inconvenience students, especially when they ask her questions or ask for extensions due to extenuating circumstances. Furthermore, she has jumped to extreme conclusions and falsely reported dozens of students for 'plagiarism'. It's very unfortunate that she is the only professor for BSCI171, but her behavior needs to change.", "rating": 1, "expected_grade": "C", "created": "2023-05-08T19:17:07.637211Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "I never interacted with her, but her lab manual is a scam. You pay like $25 for a lab manual that is poorly written, confusing, and ridden with errors, and she has about 1000 or so students each semester all of which need to buy in order to succeed, so she is making bank scamming college students. She was super strict about small things. I turned in one assignment 3 minutes late, which is my fault, but I ended up getting 1/2 credit. Aside from her being super strict, your experience within the class will be reliant on your TA.", "rating": 2, "expected_grade": "A+", "created": "2023-05-14T18:17:25.973154Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "I never met Professor Mohan, but I've heard she is extremely scary even from my TA so it's ok. The pre-labs are pretty easy however you have to pay attention to small details, luckily you have two attempts on each one. There were no exams but was a poster project which was really easy as long as you have a good group. You kind of work out your lab groups on the first day so pick wisely. Having a good group is really beneficial not just for assignments, but for efficiency in class. Volunteer to go first for as much as you can because usually, you will get out earlier than other groups. READ EVERYTHING it is straightforward but they will take points off for the littlest of things. The major things in this class are completing the pre-lab quiz, lab manual, poster project, 1 lab report, and the lab practical. The lab practical is super easy. I would highly recommend going to office hours before the lab practical because the TAs literally walk you through it. They also post an example of the exam on canvas which makes it easy to see what you need to know. Overall this lab is easy but annoying.", "rating": 3, "expected_grade": "A", "created": "2023-05-25T23:07:22.333346Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "It's a Biolab: boring, too much work but it's whatever. All up to TA. 3 Stars.", "rating": 3, "expected_grade": "A+", "created": "2023-05-27T22:39:02.404320Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "never responded to my email regarding my final grade nor the follow ups but threatened to change an assignment grade to a 50% when i took more than 24hrs to respond to her email earlier in the semester", "rating": 1, "expected_grade": "A-", "created": "2023-06-01T20:18:00.255437Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Mohan's lectures were fast, overwhelming, and boring for me. If you can find the motivation and interest for the subject within yourself to review the material on your own, then you will be ok. She uploads slides to canvas. Weekly quizzes are easy, but exams need preparation. Took Mohan's BSCI course my first semester at UMD in Fall 2021, and I was a poor student in that class, so I did not succeed with her as a my professor. I did great in the lab (BSCI171), but the two are split, so the lab couldn't help my lecture grade.", "rating": 2, "expected_grade": "C", "created": "2023-06-09T00:11:45.210479Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "(review of LAB, not Mohan's lecture) It all depends on your TA because they run the lab. The content is easy, just stay on top of TopHat readings and pre-labs if that's what they still do.", "rating": 5, "expected_grade": "A", "created": "2023-06-14T21:44:27.195006Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "Horrible and extremely rude.", "rating": 1, "expected_grade": "A", "created": "2023-08-23T18:30:09.670421Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "The lab itself is not difficult at all. You complete a weekly pre-lab quiz before you go to the lab, then you answer some in-lab questions during class. Sometimes there are post-lab assignments but everything is fairly easy. Usually you'll finish the lab early and you can leave. Mohan did not teach my class and we were instead taught by a TA. The TA I had was very unprofessional and unhelpful. He barely teaches and gives little to no instructions (none that made sense at least) for any of the labs or assignments even if you directly ask him questions. However, the grading is not strict so you can expect to get an A in this expect.", "rating": 2, "expected_grade": "A+", "created": "2023-10-31T16:47:13.303717Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "The class itself isn't as bad as I expected. Just go to class and do the problem sets and weekly quizzes and you should be okay. Although Professor Mohan as a teacher is not great. She's rude and mean when you ask questions about something she already went over. Not helpful at all. Her lectures are also fast paced and she gets mad if you do the clicker questions without actually trying. TA's are super helpful so lean on them and other classmates!", "rating": 2, "expected_grade": "B-", "created": "2023-11-27T21:39:02.064737Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "She's literally fine. Talks alot and goes through slides fast but she records lectures and and post ALOT of helpful materials during exam time. Weekly quizzes that are open note are fine, problems sets are fine, just ask the TAs for help. Exams are pretty straightforward and like 80% identical to problem sets, so just review those and practice exams she post in canvas", "rating": 5, "expected_grade": "A-", "created": "2023-11-30T00:41:50.548597Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Mohan is a very strict person and seems unwelcoming/unforgiving at times. She seems rude to her TAs and doesn't like when people overstep her power in the slightest bit. Our class is generally quiet, but she gets mad when she sees side conversations, even if they are about her lecture. Her exams are purely memorization based so if you study her slides well you will do fine on the exams. The TAs, on the other hand, are very helpful and nice, so I would refer to them for help on practice worksheets and if you have questions before exams.", "rating": 1, "expected_grade": "A", "created": "2023-11-30T21:46:27.556280Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Mohan's exams are completely from her slideshows, and there's no conceptual application whatsoever. She expects us to know facts about biology rather than thinking about how this relates to real life. She's also very unforgiving, and borderline rude to the class and even her TAs. I always reach out to the TA when I have questions because they're super helpful, and make sure to utilize her weekly practice sets / TA review slides to help study for the exams.", "rating": 1, "expected_grade": "A-", "created": "2023-12-01T18:19:15.800199Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "Threatening and unaccomodating in the slightest of situations. She gets mad about small stuff like a bit of quiet side chatter in the class even if it's related to what she's lecturing about. She expects all of us to sit there and memorize everything on the slideshow without actually applying anything to the real world. She's even worse over email because she hates slow-responders and will take it out on you by threatening with your grade", "rating": 1, "expected_grade": "B+", "created": "2023-12-02T03:43:26.818471Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "The lab and workload is easy, but pray that you get a good TA because it will make your life easier. I never met Professor Mohan and the lab was solely led by a TA. My TA was very unhelpful and did not teach or guide us through the labs at all.", "rating": 2, "expected_grade": "A+", "created": "2023-12-05T15:58:49.225248Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "I actually loved having Dr. Mohan. As long as you paid attention in class and took notes you could easily ace all the quizzes and problem sets. The exams were also pretty easy as long as you put in effort and studied the material. I feel like overall the course load was not too bad because all of your graded work is open notes besides the exams. She can be snappy sometimes but just like be respectful while she's going through her slides.", "rating": 4, "expected_grade": "A-", "created": "2023-12-09T20:05:36.088599Z"}, {"professor": "Swarna Mohan", "course": "BSCI170", "review": "I actually really like her. You can learn all the stuff the day before the exam if you really needed to. Her exams are more than fair and pull directly from problem sets and weekly quizzes. She has tons of cushion points (weekly quizzes, participation clicker points, problem sets, syllabus quiz... like 250 easy A points) and no curve. She's a clear teacher and doesn't try to trick you. This class probably took up 4 hours of my week in total (including lecture, which is 3 hours a week!) and I'll end with an A.", "rating": 5, "expected_grade": "A", "created": "2023-12-14T22:25:27.908080Z"}, {"professor": "Swarna Mohan", "course": "BSCI171", "review": "She is just isn't an understanding person at all and all of her policies reflect this. For example someone in my group realized that they submitted the wrong assignment an hour after the deadline and she refused to accept the correct worksheet. She also sucks to get a hold of because when you do email her she puts a time restraint on when you can email her back or she assume \"your not being serious\" about what you emailed her about.", "rating": 1, "expected_grade": "A", "created": "2024-03-10T00:00:42.735942Z"}], "name": "Swarna Mohan", "slug": "mohan_swarna"}