{"courses": ["CMSC421", "CMSC828A", "CMSC421", "CMSC828A", "CMSC421"], "average_rating": 2.5, "type": "professor", "reviews": [{"professor": "Tianyi Zhou", "course": "CMSC421", "review": "Fine teacher, just this was the first class that I stopped attending the lecture about halfway through. This was not his fault as the course material was extremely simple and not all that exciting plus the whole course by its nature is almost completely off of a free Berkley course. All projects and most of the lectures seemed to be just directly from Berkley. Another reason I stopped attending was that students' questions would hold up the class to an extreme degree, and he would continue to discuss with them, but often there seemed to be some sort of difficulty in communicating ideas as we would be stuck on a topic from the previous lecture for the first half of the current lecture. I like that he really wanted to answer these questions, but I would imagine after 10+ minutes on the same topic with one or two students, you could just say \"maybe talk to me after class or during office hours.\"", "rating": 3, "expected_grade": "A", "created": "2022-12-16T16:35:15.569841Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "The entire course was taken from Berkley. The professor simply read from the slides and when questions were asked, he simply would give a response that does not answer the question. The midterm grade was given back a month and a half after taken the exam but was not given the physical exam back. Some grading on the exam did not seem fair and when brought to the attention of the professor, his response was that all the TA's agreed the grading was unfair but they didn't have \"the bandwidth\" to go and regrade them. In addition, many questions on piazza would go unanswered. This probably was one of the worst professors I have ever had in CS.", "rating": 1, "expected_grade": "B", "created": "2022-12-19T16:04:56.558013Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "First off, Tianyi is definitely a nice guy. He tries his best to help students (making accommodations for taking exams in certain situations) and it's clear that he makes an effort to make the concepts come across to us while teaching. That being said, I think there's a lot that he can improve on. He is, no doubt, a very smart person, but there were a lot of times when he wasn't able to really teach certain topics effectively. Sometimes, it just felt like he was kinda reading off the slides not being truly engaged in the material. Secondly, the logistics of this class weren't the best. It took a month to get midterm grades back and all students were just left wondering what was going on. I would also mention that HWs and Piazza question took quite sometime to get responses to, but that's up to the TAs\r\n\r\nWhat swayed me to give a 3/5 is that at the end of the semester, he definitely listened to the concern of the students and implemented a couple of changes for the final exam to help us (allowing the use of a cheat sheet, a shorter exam overall because midterm was too long, etc). He also released practice/old exams for both the midterm and final exams ALONG WITH SOLUTIONS which is something CS profs don't always do and I really appreciated.\r\n\r\nOverall, I think you can succeed in this class if you just go to OH early and attend lecture.", "rating": 3, "expected_grade": "A", "created": "2022-12-23T20:15:51.837287Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "Fair professor. Lectures are kinda dry so I stopped attending lectures after first week of school since I figured out his lectures is much better in 1.5x so I basically watched his recording to learn. Slides were actually helpful and his explanations are also helping understand the course content. Project are from Berkely and majority of the contents are from Berkely. Good thing with that is you can find many resources (and he did gave some resources) so you can learn after class. Bad thing is that it is kinda boring.\r\n\r\nExams are fair and similar to our HW. I did learn many stuffs from the course. Also the grading is fair to me. I find out the TA is tending to give more lenient grades due to the nature of some problems of the HW. \r\nHonestly he is pretty solid 3 star professor to me. Just give him 4 star because I think he desevers a little better than 2.33 stars.", "rating": 4, "expected_grade": "A+", "created": "2022-12-24T02:49:33.848368Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "I agreed with other comments saying that his lectures is basically reading from the slides and it took quite sometime for the questions from the piazza to be graded, and the last two HW are only graded like one week before the final. Midterm took one month to be graded.\r\nAnyway, I stopped attending to the lectures after one week because I figured out his lectures is much better in 1.5X speed. I do learn a lot of stuffs from the class and sometimes his explanation to the slides contents do help the understanding. Midterm and final are really similar to our HW problems which are fair to me. The grading to the HW, even though with some ambiguity, but I personally find out the TA is tending to be generous on the grading due to the nature of our HW (sometimes a lot of calculations, or give explanations, etc.) so even if you might have same answers as other but different from the correct answer, you might have different scores because different TA were grading. Answer keys were provided so you can always check back and forth. TA are also helpful during office if you need help. Also, there are practice exams from previous year for both MIDTERM and FINAL along with solutions so you can have sense of format.\r\nAlso one other thing I like is Project worth 40% of our grade and the grade is based on public test so as long as you put a lot of time you are guaranteed to get the 40%. Even though the projects are public berkeley projects but I personally don't mind that since I believe good projects and they do line up with what we have learned in class so helps my understanding. There are also many resources for you to explore the materials which I find nice.", "rating": 4, "expected_grade": "A+", "created": "2022-12-28T20:01:30.268938Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "He is a nice professor and tries to help us understand the material, though I agree that he doesn't explain the material well. The whole course was from Berkley so you could find a lot of helpful recourses on Berkley's website. 40% of the grades are from projects which are easy to get 100%. HWs are reasonable, if you go to OHs you can get good grades easily. Also, he had extra credit problems in the final exam. I think he also curved our final grades, so getting a very good grade in his class is super easy.", "rating": 4, "expected_grade": "A+", "created": "2023-01-04T02:26:51.509646Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "He is a nice guy and tries his best. The whole course was 70% of Berkeley's course. He was generous with grading and you could get an A if you learned a little bit. I almost always attended lecture and he got a bit better towards the end. He was pretty nice, he would always answer questions even if they were dumb. He's just learning how to teach so it's OK.", "rating": 5, "expected_grade": "A", "created": "2023-03-02T01:45:46.102072Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "I do not know how this mans average rating is a 3.43. Maybe cuz he seems nice? This class is terrible and he is the worst professor I have ever had at UMD. The class has no structure, the assignments are off things he has never taught us, and 20% of our grade is for attendance. I would never reccomend this class or Mr. Zhou to anyone. He is the worst professor I have ever witnessed in my academic career. He should be fired.", "rating": 1, "expected_grade": "C", "created": "2023-09-27T04:22:32.995836Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "yoterp69 clearly not had a chemistry course at UMD.", "rating": 4, "expected_grade": "", "created": "2023-10-02T19:50:43.330672Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "Professor Zhou is truly dedicated to the success of his students. I do know that this semester he has changed the layout of the course and its not like the Berkley course anymore. However, I think his reasoning behind is to equip his students with the most up-to-date knowledge in the rapidly evolving field of AI. Professor Zhou aims to ensure that his students not only grasp AI concepts but also witness their practical implementation. Granted, it would have been beneficial if he had started with the basics and gradually introduced programming aspects. Nevertheless, Professor Zhou is putting in a tremendous effort to simplify the material for his students. He has generously extended deadlines for assignments and even reduced the weightage of programming tasks. It would be unjust to undermine his abilities as a teacher.  I think he is just learning how to teach and wants his students to successfully understand the class concepts. In my opinion he is a really good teacher and an amazing person. All it takes is a bit of patience and open communication to make the most of his guidance.", "rating": 5, "expected_grade": "A", "created": "2023-10-03T00:10:23.193879Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "Simply put, this class has been nothing short of an absolute trainwreck. The class is completely disorganized from the way that the assignments are written to the way that TAs provide contradictory information which makes assignments take longer simply due to the fact that we do not know what the instructors are asking us to do. Attendance is required, which is questionable but tolerable because we only had to sign a piece of paper at first. Recently, the professor adopted an in-class quiz policy where we are required to take a quiz which is graded on accuracy as a way to show our attendance. This is acceptable but we are often given minimal instructions on how to solve the quiz problem and the class is usually confused on how to proceed with the provided information on the quiz. To top it all off, we are assigned a research project that we are already a few weeks behind schedule on because the staff was spending time putting out all of the fires that the first weeks have caused.", "rating": 1, "expected_grade": "", "created": "2023-10-21T03:16:39.668266Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "He changed the entire course curriculum from the previous semester. TAs were no help with the assignments on Piazza and gave contradictory advice. The first project wasn't released until the day after course lock in, so we were stuck in the class. He also made the first and only exam AFTER the withdrawal period. He never responded to any of my emails, and was extremely unhelpful with addressing ADS accommodations. He also required attendance which I believe is against the CS department policy, so he changed it to an attendance sheet + daily lecture quiz after finding out it was against policy. Overall horrible experience. Learned nothing going into lecture each day and now I'm scrambling to figure out how to graduate on time.", "rating": 1, "expected_grade": "W", "created": "2023-11-09T23:36:39.091752Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "Avoid. Even if you have a passion for the topic. The explanations given in class for topics is too brief and lacks clarity, anything I've taken away from this course has been reinforced through outside learning. Even though this is an Introductory course, there is a large amount of information they assume you already know. I'd say class time would be a 2/5, but the assignments and course structure deserve a 0/5. It has been nothing short of a nightmare, the course is structured so your group project grade or your individual assignments average is 60% of your overall grade. Which sounds nice, but if you're like me and your group decides to just focus on their individual assignments and stops doing the project mid-way through the semester, there is ZERO incentive to stop them from just leaving you high and dry. It encourages an environment where you have pre-existing friends that you trust to not just desert you. Also, I could spend forever explaining the failures of the assignments, but to keep this shorter, essentially the assignments are all new and not tested at all. For example, our first assignment has been extended 7 WEEKS because it was so difficult to comprehend and complete. Just do not take this course, self-teach if you really wish to learn, it's not worth the loss of sanity, time, and GPA.", "rating": 1, "expected_grade": "B", "created": "2023-11-13T00:54:39.469654Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "After a semester of this class, I can definitively say this is one of the most miserable courses I have taken. While it used to be the Berkley course, they have tried to 'update' it with new projects and a different order of the concepts we learn. Some of my main complaints with this class were: \r\n- Releasing the first assignment after the drop date for the class, this first assignment was new and was so bug-ridden it was extended for over a month. It seemed to have been designed primarily by 1 TA and when attending office hours or trying to get help the other ones would tell you to do something and the TA that made the project would be like why are you doing that\r\n- Deciding midway through the course to make attendance graded and surprise pop quizzes to force people to come to the lectures\r\n- Using piazza but the TAs and prof cherry-picking which questions to answer and leaving some unanswered for the entirety of the semester, regardless of whether multiple students ask the same question\r\n- Lack of coding examples in slides and lectures, throughout this class the only exposure to any code at all that we had was in the projects, and those were extremely vague and lacking documentation until the whole class was in anarchy and the profs and tas were forced to rewrite and clarify the project\r\n\r\nOverall I have thoroughly been frustrated and exhausted by this course in various ways. While I can tell that Prof. Zhou is extremely intelligent and passionate about the field of AI and his research, I would urge everyone to avoid this class with him as it has been nothing short of a complete and utter trainwreck. They did make some adjustments throughout the course to try and help out the students like re-releasing the projects with more documentation and a lot of extensions but it seemed to be too little too late as the class had already spiraled to the point of no return. do not take CMSC421 with prof zhou.", "rating": 1, "expected_grade": "B", "created": "2023-12-06T21:08:30.161200Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "This was an absolutely awful course. You can probably find a synopsis of what happened online on Reddit or Piazza, but in summary, Tianyi Zhou managed to run the most disorganized class I have ever seen or heard of in the CS department. His lectures were terrible; they over-complicated every topic beyond the point of understanding. Even as somebody who scored comfortably in the upper quartile in the only exam we had in the class (and also on every assignment), the little content I did learn was entirely on my own and from resources he did not provide, and studying for the exam was an unpleasant experience that felt like searching for a needle in the haystack in terms of what I had to learn.\r\n\r\nAdditionally, his projects/homework assignments were extremely vague and looked like they were put together in about 15 minutes. The first coding project he released had so many bugs and the code base was so unworkable that it was extended by 6-7 WEEKS. When we eventually did have to submit it, the average grade was around 75% because the write-up questions (which had extremely unclear instructions at best) were graded extremely harshly by the TAs. The other assignments, while not as bad, were also graded quite harshly even though the questions were unclear.\r\n\r\nThe one slightly redeeming part of this course was the group project, but him and the teaching assistants (my group's TA was Hongyu Zhao) managed to completely butcher that as well. I will spare you the details of our project, but in summary after working on it for the entire semester and submitting weekly reports outlining our progress and methodology (which Hongyu admitted to not have read at all in office hours during the last week of classes), several of our group members talked to Tianyi after class about our project (keep in mind this was after the final lecture), and he told us that a core component of our project was being done completely incorrectly the entire time. This project was quite advanced and was adapted from actual AI/ML research in the field, so there was no way for us to know that we were doing this wrong, especially considering this was our first exposure to almost all of the topics involved in the projects. I don't understand how we only got notified of the issue around finals week when we have been writing our methodology consistently and in-detail throughout the semester. Hongyu Zhou also completely ignored our messages to him in the CMSC421 discord server asking for advice on this group project, even though he was assigned to us specifically to help us with the project. This was completely unacceptable behavior. \r\n\r\nDon't get me wrong, Tianyi Zhou is a nice guy, very knowledgeable, and can provide good advice if you talk to him one-on-one. He would be a great research mentor. But to run a class where people actually learn, these are the minimum qualities you need to have, you also need to be able to prevent the things above from happening. He seemed to be completely oblivious to the chaos unfolding throughout the entire semester, I suspect he doesn't even realize at all the experience his students had in his class. He consistently acted like nothing was wrong.\r\n\r\nTianyi Zhou cannot be allowed to teach undergraduates anymore. I don't doubt he is very smart and valuable to the research department, but he is incapable of transferring that knowledge to his students. Just have any other professor teach this class and it will probably be ok. I have also heard the other section (taught by Yantian Zha) was not any better.", "rating": 1, "expected_grade": "A", "created": "2023-12-10T16:33:20.381846Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "I feel that as long as the project of this course get a bit more polished, this will be a very good course.", "rating": 5, "expected_grade": "A", "created": "2023-12-13T05:24:06.144967Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "Look...421 wasn't awful. The first few weeks were a crap shoot, and the first project was very confusing. But it wasn't for lack of caring...it was cause he wanted to make the course more suited to help students in interviews. He then proceeded to give a lot more time for the project and grade far more leniently.  And here's the kicker, I started early (like he said) and I finished by the first deadline. It wasn't easy at all, I wasn't going to get a great grade, but I'm routinely a B/B- student in CS anyway. I went to office hours and I worked a lot of hours. I don't think that project was \"fair\" but kids treated it like the man was trying to nuke their grades. Not so. Also, as he showed us in class, he really didn't diverge that far from the Berkeley course that these kids are angry about (but never took). Was this class good, eh, do I recommend, eh, will I get a decent grade...yes. As a kid who has been worried about his grade every semester I wasn't worried about this class...cause I believe (and as he showed) he didn't want to fail the class. He essentially curved every assignment, and basically asked that you show up to class. So no this wasn't the hell that people said. Now. Do you actually learn anything usefull...ish. The course description (including the berkely one) tells you that you can't get a job in AI with just this info. It's a starting point. And as it goes, lecture alone will not bring you there, and yeah it can be hard to follow, but I definitely feel more confident in having a conversation on the topic. And that's what the course is billed as...a starting point. Are there better lecturers, yes, was this class that time draining, not really, that first project was super stressful but otherwise I was done for the next 10 weeks. Do your work, put your head down, and if your smarter then me you'll probably get an A. Also, he seems like a nice guy. So to conclude, is he the worlds best lecturer...no, is he the worlds most organized....no, will you get a bad grade...I don't think so, is he a good guy...yes, will you accomplish the course description...I think we actually did. Should you take this class....over some classes for sure, but you decide.", "rating": 3, "expected_grade": "B+", "created": "2023-12-21T16:21:11.592325Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "This class was the biggest waste of time I have ever had at UMD. Not only was it extraordinarily difficult due to poor lectures and low quality assignments created by TA's, but the teaching methodology used in this class was just completely inappropriate and set everyone up for failure.\r\n\r\nThe class began by teaching how to create neural networks from scratch. The difficulty of understanding neural networks did not just come from the fact that neural networks can be a difficult subject, but that there was little to no introduction to the topic. In fact, the first assigned reading from the textbook required knowledge from previous chapters in the book. Simultaneously, an assignment was given out with a very low quality code base written by a TA. It was one thing to listen to lectures about neural networks and read about it in a book, but there was no guidance on how to implement them from scratch. When we asked for resources, Professor Zhou gave us Pytorch references which helped in no way to complete the assignment where we had to build neural networks FROM SCRATCH. No Tensor Flow, no Pytorch for the majority of the assignment, just use Numpy. The assignment was so bad that it was given about an 8 week extension because no one had any idea how to do it and the TA's were not helpful. If I actually wanted to learn how neural networks are created, I could have just read a book on it in my own time instead of stressing over an assignment and I would have learned more.\r\n\r\nFurthermore, the weights for the assignments in this class were pretty terrifying if you didn't have a grasp on some of the material. 60% of the grade was assignments (From 4 Assignments). We fell so far behind because of the mess from assignment 1 and the disorganization of the class instructors that assignment 4 was never released and the weights for assignments 1 2 and 3 became 12% 24% 24% respectively. So if you messed up on one of the assignments and didn't do well on the midterm, you were in some hot water for the class.\r\n\r\nThe only good thing I can say about this class is that we got a free 20% grade for attendance. However, this got taken away and replaced with in class quizzes because people complained it was a against department policy which sucked. Like come on, why do you all have to complain about the small good thing that this class provided. Would you have rather taken an exam for a class that where we barely learned anything?\r\n\r\nIt would be smarter to take the Machine Learning class instead of this. They did group projects for the neural network and it's a lot more organized than the mess we all had to deal with. Otherwise, avoid this class. Professor Zhou is nice but this was unfortunately a really low quality class that had so much potential.", "rating": 1, "expected_grade": "B", "created": "2023-12-22T20:56:52.576646Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "Do not take this class with him. This was one of, if not the worst classes I have ever taken here. First, it’s an intro class and it’s not handled like one an at all. He expects us to know a lot of things that we don’t, and never lays a good foundation for important topics before going into more complex concepts. This made it extremely difficult to grasp and apply things on assignments if you didn’t already have a background in AI. Second, the class structure is poor imo. The curriculum was changed ahead of the class starting and many of us were not aware of this ahead of time. Additionally your grade was mainly weighted towards your assignment grades or group project grades, both of which we lacked a lot of guidance for. The expectations were so ambiguous that it was an avalanche of regrade requests whenever grades were posted. There also seemed to be an extreme lack of communication from the professor and TAs, especially towards the end of the course. Overall I do not recommend this class with this professor at all.", "rating": 1, "expected_grade": "B", "created": "2023-12-23T08:43:37.639724Z"}, {"professor": "Tianyi Zhou", "course": "CMSC421", "review": "DO NOT TAKE\r\nThe course is very disorganized, there’s a lack of communication from the professors and TAs, the instructions for the assignments are very poor and ambiguous, the deadlines for the assignments are constantly shifting and the grading is inconsistent across the board. This class is way more stressful than it needs to be and needs to be overhauled.", "rating": 1, "expected_grade": "B", "created": "2024-01-05T15:27:18.601822Z"}], "name": "Tianyi Zhou", "slug": "zhou_tianyi"}