{"courses": ["KNES689W", "KNES689D", "KNES497", "KNES385", "KNES689M", "KNES289W", "KNES385H", "KNES370", "KNES370H", "KNES476", "KNES478", "KNES477", "KNES226", "KNES226", "KNES370", "KNES370H", "KNES478", "KNES226", "KNES370", "KNES370H", "KNES476", "KNES478", "KNES370", "KNES370H", "KNES477", "KNES478", "KNES370", "KNES370", "KNES370", "KNES226", "KNES370", "KNES370H", "KNES476", "KNES478", "KNES370", "KNES370H", "KNES477", "KNES478", "KNES226", "KNES370", "KNES476", "KNES478"], "average_rating": 3.9412, "type": "professor", "reviews": [{"professor": "Tim Kiemel", "course": "KNES289W", "review": "Easy class, if you do the bare minimum you're guaranteed a B+. Teaching style was boring however which is why I knocked a point off. But this is arguably the easiest gen ed I ever took.", "rating": 4, "expected_grade": "A-", "created": "2018-09-06T16:51:02Z"}, {"professor": "Tim Kiemel", "course": "KNES370", "review": "great professor, so sweet", "rating": 5, "expected_grade": "", "created": "2021-04-07T19:06:32Z"}, {"professor": "Tim Kiemel", "course": "KNES370", "review": "Human Motor and Development.\r\nGood learning about different aspects of human development.", "rating": 5, "expected_grade": "C+", "created": "2021-06-28T04:22:16Z"}, {"professor": "Tim Kiemel", "course": "KNES226", "review": "The class is pretty average. He reads right off the power points and goes through the slides so fast it's hard to write notes. But he posts the power points after class, which was helpful. The exercises are pretty easy, and we get to take our quizzes twice, which is nice. ", "rating": 3, "expected_grade": "A-", "created": "2021-12-19T00:45:47Z"}, {"professor": "Tim Kiemel", "course": "KNES226", "review": "The way that Dr. Kiemel grades the class makes it impossible to get lower than a B in the class if you just do the work. If you put a little effort into studying for the exams, an A is super attainable in this class. Overall, the lectures are boring, but I would highly recommend this class if you want an easy A.", "rating": 3, "expected_grade": "A", "created": "2021-12-23T03:26:27Z"}, {"professor": "Tim Kiemel", "course": "KNES370", "review": "The class is super boring and he goes over exactly what is on the slides. If you are a good test taker, then this class is an easy A for you, Quizzes are super easy and directly relate to the content you are learning in class. DO THE TURNING POINT AND EXTRA CREDIT!!! All exams and finals are multiple-choice, which is easier to prepare for. Really not hard to get a good grade in this class, but the hard work comes from discussions. My TA was terrible and was a tough grader and the assignments were difficult and oftentimes way too complex for what we were learning compared to lecture content. ", "rating": 4, "expected_grade": "B-", "created": "2022-04-18T13:43:30Z"}, {"professor": "Tim Kiemel", "course": null, "review": "Super easy exams. Lectures posted on panapto. Overall easy class and sometimes intersting. ", "rating": 5, "expected_grade": "", "created": "2022-04-27T16:34:45Z"}, {"professor": "Tim Kiemel", "course": "KNES226", "review": "He's a nice guy class is pretty straightforward. You can fail all the exams and still get a B in the class. I took this for the gen ed and didn't really put much effort into it and still pulled a B. If you put any effort into the class you can easily get an A. As a teacher, he's kinda boring since he basically reads off slides, which kinda made it hard to go to lectures. I would recommend this class though for easy an gen ed.", "rating": 3, "expected_grade": "B", "created": "2022-05-16T20:22:20Z"}, {"professor": "Tim Kiemel", "course": "KNES226", "review": "course is structured so you pass if you put little effort. It's challenging for an A or better. weekly discussions require you to present to the class biweekly which can be a hassle at times, the lectures can be really dry depending on the topic. For an A you must pass 10/12 quizzes, 5/6 present, and 90%+ avg on all 3 exams (2 exams being 25q and final being 50), finals cumulative and the final tries to trick you a good amount. The TA can be a bit harsh on grading weekly discussion assignments, but you'll still pass if you put in some effort, they're just nitpicky \r\n", "rating": 2, "expected_grade": "A-", "created": "2022-05-20T02:43:30Z"}, {"professor": "Tim Kiemel", "course": "KNES370", "review": "Professor Kiemel is a very dry lecturer BUT the information is very interesting. I personally found his exams to be pretty easy ESPECIALLY the weekly online ones. He exams are pretty straight forward as long as you study his lectures and PowerPoints. He also gives lots of opportunities for extra credit by participating in studies, writing a paper, and then coming to lecture and doing turning point. As long as you put time and effort into it you’ll get an A. As for the “lab” it’s literally a discussion and I got a 10/10 on every assignment. Would definitely recommend this course and professor!", "rating": 5, "expected_grade": "A", "created": "2022-12-14T00:06:30.702788Z"}, {"professor": "Tim Kiemel", "course": "KNES370", "review": "Very nice professor but has boring lectures. Taking this class made me realize the KNES major is not for me, but that is good! Not the professor. Just not interested in this type of stuff anymore. The discussion assignments are easy and time-consuming, but if you follow the rubric, you'll get a 10/10. The exams were very tricky, but that also could've been about I'm not interested in the content. The extra credit assignments help your grade so DO THEM. Do all the turning points and the study.", "rating": 4, "expected_grade": "C", "created": "2022-12-17T18:58:29.549007Z"}, {"professor": "Tim Kiemel", "course": "KNES370", "review": "Dr. Kiemel is a really nice professor who is understanding and easy to contact. This class is very straightforward with 3 exams, discussion assignments, and weekly online quizzes. Attendance for lecture is not necessary, but in order to do well I would recommend going. Attendance for discussion is mandatory and is where you do most of your work for the class. The class's grades are majority based off the exams, so studying and being prepared for these exams is extremely important. Dr. Kiemel makes this relatively easy as he provides practice quizzes and recording to help prepare. The exams are all MC as well. Overall I have nothing bad to say about this class. Dr. Kiemel's lectures can get boring, but overall this class is relatively easy. He provides some extra credit opportunities which can help as well. If you get lazy like I did, your grade can slip pretty easily.", "rating": 4, "expected_grade": "B+", "created": "2022-12-23T00:27:44.023154Z"}, {"professor": "Tim Kiemel", "course": "KNES226", "review": "Good professor, easy to understand and class is very structured, if you show up and do the work you should do well.", "rating": 5, "expected_grade": "A+", "created": "2023-01-23T18:17:24.112982Z"}, {"professor": "Tim Kiemel", "course": "KNES370", "review": "Kiemel is a great professor BUT extremely boring. Stopped attending his lectures the last month of the semester due to me falling asleep. Tests CAN be confusing but it's extremely easy to get an A or B.", "rating": 4, "expected_grade": "A+", "created": "2023-05-20T05:49:36.125536Z"}, {"professor": "Tim Kiemel", "course": "KNES370", "review": "Dr. Kiemel is a really nice and chill professor, however, his class is super boring. His lectures are so dry to trying to pay attention can be really hard. The class consists of 2 midterm exams, discussion assignments, weekly quizzes, and a final exam. The discussion assignments are tedious but easy. Some of them are useful but most of them are just used for a grade. The discussion never lasted more than 30 minutes, which was nice. He offers a few extra credit opportunities which I highly recommend doing. He also drops your two lowest quiz grades and allows 2 attempts on each quiz The exams can be challenging if you don't put the time in but I found making quizlets to be really helpful. Making friends with people in your discussion or the class is general is also really helpful for forming study groups.", "rating": 4, "expected_grade": "B+", "created": "2023-05-25T23:02:44.522878Z"}, {"professor": "Tim Kiemel", "course": "KNES370", "review": "Professor Kiemel was really nice but this class just isn't that interesting. The discussion was stressful because my TA would grade things really strictly but my friends in the other section had things graded very easily. There were 2 exams, 13 quizzes, and 9 discussion assignments plus a final exam. The exams and quizzes were all multiple choice. The quizzes were super easy, you got two tries on them, and the lowest 2 were dropped. \r\n\r\nThere were clicker questions in lecture but they were for extra credit. \r\n\r\nIf you want to pass the class, study for the exams by doing the practice quizzes until you have memorized the answers. I promise that is the best way to do well on the exams.", "rating": 2, "expected_grade": "A", "created": "2023-05-31T21:46:08.872884Z"}, {"professor": "Tim Kiemel", "course": "KNES226", "review": "Great prof, easy class. A nice guy and explains the content clearly. The class is very structured, being pretty much the same thing week after week. You can have fun with the homework exercises and the homework quizzes are easy, as well as the midterms. Both all multiple choice, covering the main topics of the course.", "rating": 5, "expected_grade": "A", "created": "2023-11-12T21:26:09.186855Z"}], "name": "Tim Kiemel", "slug": "kiemel"}