{"courses": ["MATH130", "MATH221", "STAT400", "MATH111", "MATH131", "MATH220", "MATH241H", "MATH140", "MATH214", "MATH241", "STAT430", "MATH141", "MATH120", "MATH115", "SPHL601", "SPHL602", "SPHL603", "SPHL610", "ENES107", "STAT430", "STAT401", "MATH140", "MATH140H", "STAT430", "STAT430", "STAT400", "STAT430", "STAT400", "MATH140", "STAT430", "STAT430", "MATH140", "STAT430"], "average_rating": 2.6379, "type": "professor", "reviews": [{"professor": "Timothy Pilachowski", "course": "MATH241", "review": "What can I say about this guy. I honestly think he belongs teaching at an elementary school. Very unprofessional. Shows up to class 10 minutes late, and he has to rush through his lectures because he's so late. Speaking of which, his lectures notes are pretty bad. And a lot of the time when we are doing example problems in the packet, he skips a lot of them because \"we should know how to do them.\" Hands down, the laziest and most apathetic math teacher I have ever come across. One day the projector wasn't working, and he legit spent the whole class trying to fix it instead of writing things on the board. It doesn't end there, if you dare ask him a question he will give you an attitude 4/5 times. Hey Tim, you are a teacher how about you freaking teach us??? He also refuses to answer any questions during DISCUSSION. The whole point of discussion is to get help and understand how to do problems but noooooooo We have to \"discuss among each other.\" How am I going to ask anyone else for help when the whole freaking class doesn't know whats going on! Oh yea, he also shows up late to his office hours! Good luck trying to get help from him... \n\r\nNow here is where things will take a turn for the worst. HIS TESTS. In 50 minutes, we take a test that's 8 QUESTIONS long, all of which are extremely hard. All the other sections have the same amount of time, but only 4-5 questions per test. Talk about an unfair douche. He also does this thing where he counts down to zero at the end of the test. If you dare turn in that test a millisecond after he says \"zero\" he will penalize you. \n\r\nSome final notes, He is really apathetic about his job, very lazy and could not give a damn about his students. I HIGHLY RECOMMEND NOT SIGNING UP FOR PILACHOWSKI, YOU HAVE BEEN WARNED. The only people that actually do good in his class are the geniuses that would get an A in the class no matter what teacher they had.  Seriously look for a better teacher. I honestly don't understand how this bum has good reviews. ", "rating": 1, "expected_grade": "C", "created": "2015-11-21T16:40:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH221", "review": "He is a great math professor. He makes notes you can print and bring which he goes through in class. I took MATH140 before I took him so that may have made it easier. I didn't out in as much work as I shouldmhave so I got a B but an A should be easily attainable if you study. ", "rating": 5, "expected_grade": "B", "created": "2015-01-29T15:11:00Z"}, {"professor": "Timothy Pilachowski", "course": "STAT400", "review": "Pilachowski is frequently late to class and never has time to answer questions during class time. Given that, it is not hard to get an A in his class. \n\r\nPrint out his lecture outlines and attend all his lectures. He holds reviews before exams which is really nice and use the testbank to study! He's exams always follow the same template, and for each exam he let us have a formula sheet - front and back- and for the final we got 3! And do the hand in homework. It was easy points especially since my TA graded easily and he drops your 2 lowest scores. \n\r\nI can't say I learned a lot of statistics, but it was a fairly easy A.", "rating": 4, "expected_grade": "A", "created": "2014-12-28T20:50:00Z"}, {"professor": "Timothy Pilachowski", "course": "STAT400", "review": "I took STAT400 after having not done any Calculus for a few years. The Calculus in the class was fairly simple as this isn't a Calculus class, you're simply using it to calculate certain values (Covariance, mean, etc.) Professor Pilachowski went through his PowerPoint slides each class and posted supplementary material on the course website. I thought he did an excellent job at explaining the material, and the students that didn't do well were simply not interested in putting the time. I had to relearn parts of Calculus and still managed to get an A (without minus) in his class.  The most annoying part of the class was his midterms. He often didn't print enough exams or answer sheets. He also doesn't give us enough time to complete the exam. I felt incredibly pressured to finish the exam on time, and rarely did anyone leave the class before the time was up. His TA Yiran Li was exceptional. I attended every discussion and never skipped, and working through sample problems was a tremendous help. For his midterms, he will post previous exams, and if you are lucky enough, your exam might look like one of them, but don't bank on it. I recommend doing the previous exams without looking at the answers, working through homework problems, and MOST IMPORTANTLY, look over material that was taught in class and not covered in the homework (Method of Moments, Maximum Likelihood, Probability Approximations). If you don't understand something, YouTube is a great help. Yes the below is true, he comes late, he doesn't notice the clock, and can be boring at times, but he is a phenomenal and lenient teacher, and if you TAKE NOTES and study hard, you can pass with an A. I didn't visit the tutors at all for this class either, so don't stress it, just do your part. I don't consider myself mathematically gifted, I just work hard enough to earn the A, and it is doable for this class. He also allows you to bring a calculator and a sheet of notes to the midterms, and the combined sheets of notes to the final. The final was far more relaxing because I was able to revise my answers multiple times and get a good grade. I often do better on the final due to having more time.", "rating": 5, "expected_grade": "A", "created": "2014-10-14T23:41:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "I honestly don't know how Professor Pilachowski received such good reviews from people. The class was a mix of those who had taken Calculus before and those who had not. I was a member of the latter group and suffered the consequences. He expected lecture outlines to be printed for every class (I didn't do it because I didn't want to use so much paper and ink). He moved extremely fast and only used a slideshow. The lessons seemed to be directed only at those who already had experience, and he responded rudely to anyone who asked questions. He was late to class multiple times and gave excuses like \"being in his office and not looking at the clock.\" He was even late to the final! In addition, I had to make up and exam during his office hours and had to do so in the office, making it difficult to concentrate because he loudly (and rudely) explained and assisted other students coming in the entire time. It was an awful experience and I'm so glad I managed a C- to pass (barely, and with a huge amount of tutoring).", "rating": 1, "expected_grade": "", "created": "2014-05-23T01:54:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH221", "review": "TAKE TIM'S CLASS. He is an EXCEPTIONAL calculus professor, ESPECIALLY compared with the other shitty calc teachers at this school. He is enthusiastic, easy to follow, hilarious, and very knowledgeable. He is very clear about what he expects you to know and doesn't want you to know. Plus he sometimes brings in his sugar gliders (they're like pet flying squirrels) to class! \n\r\nHow to get an A-\r\n- GO TO LECTURE. He has lecture outlines that you can follow along in.\r\n- USE THE TESTBANK! He posts past tests AND answer keys, and they look very similar year to year - he doesn't change much.\r\n- DO WEBASSIGN AND DISCUSSION WORKSHEETS.\n\r\nThe book is useful only for practice problems - the book explanations are useless compared to Tim's straightforward explanations. If you do buy it, you do NOT need the solutions manual that comes with it.", "rating": 5, "expected_grade": "A", "created": "2013-04-25T23:06:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "Pilachowski is crazy. Simply put. Not the good kind of crazy either. He teaches off of powerpoints, some of which are hard to follow. He will literally show up 10-15 minutes late for each class then take another 5 to start class. He rushes through his slides and will not usually take questions.\n\r\nWhen he does take questions, he uses a very rude tone and can be pretty sassy. Take Fouche if you have choice.\n\r\nPilachowski will teach you 1+1 but then will give you a test with crazy stuff on it.\n", "rating": 2, "expected_grade": "A", "created": "2013-04-23T15:37:00Z"}, {"professor": "Timothy Pilachowski", "course": null, "review": "I took MATH111 for my major/CORE requirement. Pilachowski is okay, nothing exceptional. However, my TA, Josh Schnieder, was phenomenal! He was always down to help with anything. \n\r\nAll you need to do to pass this class no matter who your professor is USE THE TESTBANK to take exams used in previous years in order to study for your exams. Also, I went to each exam review before the exams with the math coordinator, can't remember his name but he was a super enthusiastic gay guy. Such a great professor... If I could remember his name I would HIGHLY recommend him because his method of teaching was great. \n\r\nOverall, MATH111 isn't bad as long as you are repetitive with studying those previous exams and go to discussion for the quizzes every week.", "rating": 3, "expected_grade": "", "created": "2013-01-07T23:52:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH131", "review": "Math is normally a dreadful subject for me, but Prof. Pilachowski made my Calc II experience as painless as possible.  He would often come 10-15 minutes late to class, but he really cares about how well his students do so I wasn't bothered too much by the tardiness.  He posts outlines that help the lectures go more smoothly, and sometimes even prints them out for his class.  His exams are very fair.  The discussion sucked and were mandatory, but there was no way around it.  Try to get Yonathan Cwik as a TA if possible.", "rating": 4, "expected_grade": "B", "created": "2012-01-10T14:16:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH131", "review": "HOLY CRAP. \n\r\nSUCH AN EASY CLASS. The posts below were probably made by RETA***S. ahah honestly this class was easier than my Calc AP class. Pilachowski is amazing. His exams are identical to the ones he posts online. \n\r\nPlease just do the exams online, don't complain, because if you do, it probably means you're a dumb A**. \n\r\nHe is great! take him. I loved the TA Yonathan and Geeta. So helpful ", "rating": 5, "expected_grade": "", "created": "2011-12-21T05:35:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "AWESOME TEACHER- kinda corny but knows his math.\n\r\nUses a powerpoint and provides print outs on his website to follow along during class. Personally I followed along fine without the powerpoints infront of me, but a lot of people benefited from them.\n\r\nEasy to understand, sometimes go through slides quickly dependent on the time, but makes sure everyone comprehends the material and will stop to answer questions.\n\r\nProvides optional homework but you MUST DO THE WEBASSIGN! not only does it help understanding the material and review for the tests, it is an easy 10 points\n\r\nThe class prior to a test is a review session- he allows the students to bring in questions to go over that will be on the test.\n", "rating": 5, "expected_grade": "A", "created": "2011-08-24T00:50:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "Tim's a weird teacher. He uses powerpoints to teach class which is pretty unconventional for math if you ask me, but it seems to work. He does kinda rush through the material, and that sometimes meant that I was woefully underprepared for the WebAssigns. There are quizzes in discussion which are actually pretty helpful, and while Tim has a bit of a temper he's overall a reasonable professor and I have learned quite a bit.\n\r\nJust note that the final exam is not written by him, it's a fair bit harder than his exams.", "rating": 4, "expected_grade": "A", "created": "2011-05-19T20:44:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "Course taken: Fall 2010 semester.\n\r\nFor those of you who took AP Calculus in high school and despised calculus WITH A PASSION, congratulations! The class was an easy A.\n\r\nLooking down on recent reviews, I don't understand why people give him bad ratings, especially since...THE PAST EXAMS AND SOLUTIONS ARE ONLINE. Pilachowski is the ONLY MATH220 PROFESSOR who posts past exams AND the answer keys.\n\r\n#1 Tip: USE THE TEST BANK, PEOPLE.\n\r\nWhen I took the class, Pilachowski said that he had to make the tests harder because (surprise!) people were doing TOO WELL on the exams. Exam 3 came around, and the questions didn't get harder.\n\r\nListen to my advice please. The class is doable, and the teacher knows how to teach the material well. The homework felt harder than the exams that weren't so bad because of the Test Bank online.", "rating": 5, "expected_grade": "A", "created": "2011-05-18T20:49:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "This guy subbed for my calc 220 class, and boy am I glad I didn't take him.  He really rushes through the material and doesn't stop to explain things.  Seems like a nice guy, but spends so much time with his stupid jokes and referring to his office hours that he could probably just explain the problems better.  In the corresponding webassigns for the classes he subbed, I struggled to get B's.  Every other ones I get 100's or at least high 90's.  Can't imagine him for a whole semester.", "rating": 2, "expected_grade": "", "created": "2011-03-16T17:12:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "His lectures were easy to follow, and he communicates very directly about what you need to know and what you don't. As a result, you go into tests well aware of what is expected. The tests follow the quizzes and homework assignments, so if you understand those then you will be fine.", "rating": 5, "expected_grade": "A", "created": "2011-01-17T14:22:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "WORSE TEACHER TRY TO AVOID. DOES NOT HELP ANY STUDENTS AND TEST ARE HARDER THAN ALL OTHER MATH 220 CLASSES. HARD TO UNDERSTAND HIS TEACHING. ", "rating": 2, "expected_grade": "", "created": "2010-12-28T20:39:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "I hated this class. I had to drop it. I just could not learn from Tim's stupid powerpoints, and he went through them really fast without taking time to explain how he got the right answers. ", "rating": 1, "expected_grade": "F", "created": "2010-12-01T23:44:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "Makes the same jokes every day. I haven't seen a single thing that we have learned in class actually show up on webassign, and he has no problem referring students to office hours rather than actually teaching the information during class. Never shows up on time.", "rating": 1, "expected_grade": "", "created": "2010-11-17T03:43:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "Very enthusiastic and funny professor. He incorporates humor into his lectures which helped to ease the stress of the course material. He teaches from powerpoints and posts lecture outlines on his website which you can print off. There are several homework assignments each week on WebAssign, an online program (you have to pay about $15 to use). There are three tests before the final. The problems Pilachowski uses in his lectures are much simpler than the ones on WebAssign and on tests, but there are many opportunities for you to get help. You must complete a worksheet in discussion each week, worth ten points. But you are allowed to work in groups and help each other. Good professor, I enjoyed having him. ", "rating": 4, "expected_grade": "B", "created": "2010-01-08T17:47:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH221", "review": "I have no idea why people rate him this low; he's at least a 4/5 teacher. \n\r\nAs you probably know, Math 220/221 has the reputation of being the calculus for dummies. While that's generally true, it is less so in Pilachowski's class. He doesn't dumb down his teaching just because it's supposed to be an easy class. That said, he's definitely the hardest teacher for the subject. However, if you take him you'll be counting your blessings when taking the final exam, which is the product of a colaborative departmental effort. His class makes an otherwise frustrating final a fairly easy task. \n\r\nHis exams aren't as easy as you'd come to expect from a 220/221 class. They actually require knowledge of the subject. He offers 4 extra credit points on his exams, which can really mean a difference between an A and a B. \n\r\nTo do well in the class COME TO LECTURES! He uses powerpoint slides that he DOES NOT POST ONLINE. The only way to make up the information is by asking a friend for notes or reading the book. Absolutely do old practice exams from previous years (available on test bank). They're all in the same format and the questions tend to be very similar to one another. Answers are also available.  \n\r\nSome people mentioned that he appears to be condescending to students. He really isn't. There's a fine line between a condescending attitude and a person's quirks. In Pilachowski's case, he's just really quirky, something these commenters failed to realize. Just keep an open mind and you won't even notice his oddities after a while. \n\r\nOn the bad side, he is, like many mentioned, always late to class. This means he covers material somewhat superficially (not always) and goes over the 50 minutes alloted for class (always). He tends to make numerous mistakes, but they're rather minor arithmatic issues rather than calculus issues. He doesn't curve at all and doesn't allow any calculator use.    ", "rating": 4, "expected_grade": "A", "created": "2009-12-21T03:37:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "Timmy P is a great teacher.  Everything is straight forward, and he is extremely organized to the point of OCD-but thats not a bad thing! His exams are completely fair, and even though he doesn't scale, its usually not necessary. The only bad thing is he can be pretty condescending to anyone who asks a question, even in his office hours. But overall I definitely recommend him! He's engaging and even has his funny moments. And its fine if you're late, he always is too!", "rating": 4, "expected_grade": "A", "created": "2009-12-07T19:46:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "Pretty good professor. Explained things clearly and thoroughly, always well organized (uses powerpoints). I learned a lot, and his exams weren't too difficult. Be aware that at least for MATH 220 he doesn't allow any calculators at all on his exams (even scientific), which other professors usually allow. Be prepared for some good old mental math.", "rating": 4, "expected_grade": "", "created": "2009-08-21T00:34:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH221", "review": "Dr. Pilachowski was a great professor. I learned so much from him personally, I find calc2 much easier than calc1. Anyways so many people rate him low, and that's because lots of ppl do bad in his class.. the ones that do NOT do the webassign BY THEMSELVES (yes--we know you can do virtually all of the problems in the TI-89) will do poorly because if you are able to do the webassigns and some of the practice book problems, then you WILL GET AN A. I just so happen to not get an A because I did miss a couple of classes... The final exam will be a piece of cake to you, since he is the hardest prof to take for calc, and all the calc profs write the exam together. I had a 95% on the final exam, was happy, and i believe there was a curve on the class... \r\noverall... great teacher. avoid him if your a procrastinator, like to wait until 2-3 days before an exam to study, or just plain want everything to be easy...", "rating": 3, "expected_grade": "B", "created": "2009-07-07T18:43:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "Take Calc II with Denny Gulick.  Pilachowski sometimes can't even do the problems he assigns you.", "rating": 2, "expected_grade": "B", "created": "2009-06-17T15:30:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH221", "review": "He is a pretty good lecturer. One thing I liked about him that some other people did not appreciate was the fact that he uses powerpoints. I found that more useful than a chalkboard because it's easy to copy off of and keeps my notes organized. The discussions are nice because you have group worksheets that are always a guaranteed 100% because the TA goes over the answers at the end. Webassign can be a pain, especially if you have other exams to study for, but they are not that bad. It is important to do the webassign because they will count as an exam grade at the end. Overall, an easy class if you go to lecture and discussion.  ", "rating": 4, "expected_grade": "A-", "created": "2009-06-06T13:02:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "I don't know why everyone is rating him so low, because I felt like I learned a lot from this class. Maybe everyone just hates powerpoint, but I found it useful because it kept things organized and I could take notes really easily. Even if I didn't really understand what was going on during class, the notes were always easy to read and I could see exactly what he did, and apply that to the webassign problems. \n\r\nIt's pretty hard not to do well in this class, since there were plenty of points from the homework and discussion worksheets (which you HAVE to do in groups, so you almost always get 10/10). Tests are fair, though there's always one or two tricky questions.\n\r\nAnyway, I liked Pilachowski, even though he says weird things/tells weird jokes during class. He's a nice guy and a good math teacher. ", "rating": 4, "expected_grade": "", "created": "2009-05-22T03:11:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "The worst math teacher ever. While he's funny he is an awful math teacher, not worth going to class. He teaches off of powerpoints which are hard to follow and does not convey the information well. If you can take a different math teacher do it!", "rating": 2, "expected_grade": "C", "created": "2009-05-19T18:09:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "I did not like this professor. He obviously has a case of dyslexia which is evident when he attempts to do problems on the board. This does not happen often though since he presents lectures on powerpoint. (in my opinion I do not like learning math on powerpoint because I personally like to see the work done but he zips through all of that).\n\r\nHis exams are relatively hard without a calculus background. Many friends who even took calculus before still had C's on exams. He tries to have tricky questions.\n\r\nAs a professor I also did not appreciate him. He had a very matter-of-fact tone of voice and would make students feel stupid if they asked a question. Oh and if you ask to repeat a slide sometimes he might straight up say no.\n\r\nI would avoid this professor because he is not my ideal teacher. Perhaps he is for some but I heard there are much better professors.\n\r\nHope this review helps.", "rating": 2, "expected_grade": "C", "created": "2009-05-13T15:50:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "Average in all aspects...will arrive 5-10 minutes late to  every class, often looking quite disheveled. Decent lecturer, but will use corny phrases often. Will help you when asked, but doesn't really go out of his way. Sometimes will go off topic, which can actually be good- he once spent nearly half the class explaining his experience in ballroom dancing, which was hilarious.", "rating": 3, "expected_grade": "", "created": "2009-05-12T00:51:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "Listen, I've been to two lectures. The first one and the second one. Mr. Pilachowski is a standard professor. He isn't engaging, but how can you be, this is calculus. He is sort of rude when we people ask him questions or do something to upset him, but otherwise he is a straightforward person. Discussion quizzes are easy, the tests are always easier than web assign. Pretty much all you need to do is buy the text book and read anything that is in a gold box. Make sure to go to discussion, quizzes are easy but count for alot.\n", "rating": 3, "expected_grade": "A", "created": "2009-05-08T00:00:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH220", "review": "He was very boring and he would make sitting through class the most dreadful thing ever. He uses power point to teach the class and it works well. His tests are very fair. ", "rating": 3, "expected_grade": "B", "created": "2009-04-18T16:22:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH221", "review": "He was occasionally an entertaining guy. Yes he was late sometimes, but that was not a big deal and didn't affect learning. His powerpoint lectures were decent and I thought he did a good job explaining them. They include a lot of repetitive examples to drill the concept into your head. The exams are just 4 questions with multiple parts, and yes, there were tricky questions.\r\nThe online WebAssign homeworks were a hassle (especially the ones due Sunday mornings that you forget about until the middle of a party Saturday night). ...I was so close to having an A!", "rating": 3, "expected_grade": "B", "created": "2008-11-15T01:07:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH115", "review": "Awful professor. 5-10 minutes late to almost every class, and makes terrible excuses for his lateness. As a result of his lateness, he tries to rush through the lecture. He is also very rude. He makes students feel stupid when they ask a question. Most people ask questions because he teaches too fast, BECAUSE OF HIS CONSTANT LATENESS. He also puts tricky problems on the quizzes even though we only get about 5 minutes to do them. As a result, you feel pressured and get text anxiety easily because you feel rushed. Also, he will make a mistake while solving a problem in class, and then he will say, \"I was just testing you to see if you would catch me.\" HAHA! I don't think so. He needs to own up to his own mistakes. I do not recommend him. Look for another professor teaching that class.   ", "rating": 2, "expected_grade": "C", "created": "2008-01-13T19:35:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH221", "review": "His exams are fair, though he is habitually 5-10 minutes late for class and fails to make available lecture outlines sometimes until 10am the morning of class (2pm). However, he demands the (3-times-a-week) web assigns be completed by 8am regardless of your busy weds. schedule-no flexibility, ironic considering his very lax, comedic and entertaining lecturing-a of good-work-ethic hypocrisy. He is saving grace, is, that he is a good professor... organized, and has wonderful clarity.   ", "rating": 2, "expected_grade": "A", "created": "2007-12-05T00:42:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH221", "review": "His exams are are fair but theres always one or two tricky questions. He uses power point so his lectures are very organized. ", "rating": 4, "expected_grade": "A", "created": "2007-11-03T18:55:00Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "I had Pilachowski for Calc 1 and Calc 2. Pilachowski provides lecture outlines that you should print out and bring to class. These are so helpful and keeps the material organized!!! During class he makes sure to emphasize the things that are important for you to focus on during class. There's a lot of material he needs to cover in a 50 minute class so sometimes topics are rushed, but that's where the lecture outlines help a lot. Webassigns can be difficult sometimes but he drops the lowest couple of homeworks. He also doesn't give minus grades. No curves :( but he says that he will round up to the next letter grade if you're very close ex/ 89.1 to an A or 79.1 to a B. Regardless of what teacher you have you'll have to put a lot of time into this course and in my opinion taking Pilachowski is a safe choice. ", "rating": 5, "expected_grade": "A", "created": "2018-12-13T22:25:26Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Tim is the ABSOLUTE worst teacher I have ever had the displeasure of having. He is  the most rude and bitter man I have ever encountered. DURING our “review” he wouldn’t even turn the light off when a student nicely asked him too because nobody could actually SEE HIS notes for the exam. I put “review” in quotations because his idea of a review is not at all helpful in preparing for the exam. He refuses to give you the answers to the worksheet he hands out. You’ll spend the whole class trying to figure out the answers and he will not answer any questions. \r\nHe teaches calc on a PowerPoint which has proven to be the LEAST EFFECTIVE way to do this. Don’t bother trying to write anything down because you won’t have time & if you do you won’t be able to pay attention to how you actually do it. Although he does a terrible job of explaining the information anyway. \r\nIf you have the great misfortune of having him as your teacher you will have to listen to him go over stupid class rules nearly every class. ONE time he even spent 20 minutes in the beginning of class going over “bike safety”. Nobody else in the class understood why he was doing this or what was going on. However I knew exactly what happened because the day before I saw him screaming at some kid riding his bike because he almost got hit by him. So basically he wasted all of our time because of his own personal issues. He is the worst. \r\nThe TA’S even admit he makes exams 10x harder then necessary. My TA told my class that for teachers like Tim who make the exams harder than the worksheets and homework he gives you, you should research online other schools and their coursework to try and learn the information. Because it’s my job to teach myself right?! \r\nIf you take this class this will 100% be the case. Guaranteed you’ll be teaching yourself all of the information. If you have absolutely no background in calc then you are extremely screwed for his class. \r\nThere are also no curves in his class even though so many people argue how unfair his tests are. ALSO, his advice to go look at passed exams will not help you in the slightest. He claims that they are similar to the exams, but they’re not at all. \r\nI learned more WHEN THE TA sub’d for him for a day and actually wrote and explained the information on the board, then during the whole semester with him teaching. \r\nAnother thing is that you’ll have lecture quizzes all the time in this class. He says they’re only once a week but a lot of times they’re twice a week. If you leave lecture even 10 min early there’s a good chance you’ll miss one because sometimes he’ll give them in the last 5 min of class!! \r\nThere is also SO MUCH HW.. at least 5 assignments with 10-15 problems each w likelihood of having a-e parts as well due every week. \r\nIt is clear that he doesn’t understand the concept of actually teaching. I highly recommend you look elsewhere for teachers because unless you are amazing at calc you will spend the the full semester trying to learn on your own.\r\n 1 star is an overstatement for this man, he deserves 0. \r\n", "rating": 1, "expected_grade": "B-", "created": "2019-04-10T03:53:23Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "Pilachowski is an OK teacher. He teaches the concepts pretty well, but the biggest problem is that he just stands there and goes through his online lecture slides. He never does any practice problem in  lecture which is not helpful. Also, ALWAYS go to lecture. This dude will at some random day pull up a graded quiz. Expect him to pull up a quiz on every single day in the week. He doesn't curve at all in this class, but it's reasonable. His exams are FAIR in which if you really put in the work in this class (USE THE TEXTBOOK EVERY TIME), they are extremely easy.", "rating": 3, "expected_grade": "A-", "created": "2019-05-19T03:35:47Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "Tim tends to read off of the lecture slides instead of working through problems. I managed to do well on the quizzes but terrible on the final (hence the D). Tim does not curve so be sure to do well on every exam. \r\n The lowest exam score is counted as half which doesn't boost your grade up much. Quizzes, WebAssigns, and Discussion Worksheets can boost your grade up a few percentage points and he drops at least 3 of the lowest scores - this is the only grade booster you'll get.\r\nThe TAs are helpful during discussion and very accessible. Definitely retaking this course again for my major - keep in mind that I scored a 4 on the BC Calc exam and got a D on the course and 98% overall on the pop quizzes...", "rating": 3, "expected_grade": "D", "created": "2019-06-09T22:01:48Z"}, {"professor": "Timothy Pilachowski", "course": null, "review": "DOOOO NOT TAKE THIS TEACHER! Any good reviews that were written on this website were guaranteed to be written by him. AVOID IF U CAN.", "rating": 1, "expected_grade": "C", "created": "2019-11-21T05:59:22Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Decent teacher but he organizes his courses very well. Lectures are important to introduce you to the topic of whatever section of notes you are on, but you really learn material through the discussions and webassign problems. Attendance is a must! Some tips for his class are to make a group that you work with in your discussions and study out of class with them. We made a group this semester and honestly that's where I learned most of the course material. ", "rating": 4, "expected_grade": "A", "created": "2019-12-15T04:53:57Z"}, {"professor": "Timothy Pilachowski", "course": "STAT400", "review": "for each class, he won't cover a lot and most of them are easy to understand. We have quiz each week on discussion section and have webassign homework almost each week. He sometimes raised his voice suddenly during the class which scared me several times. He doesn't give any - so that for exmaple, you can only get A or B+.", "rating": 3, "expected_grade": "", "created": "2020-01-27T15:27:19Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Also known as \"The Anti-Bike Crusader,\" Tim is not a personable professor. I took MATH140 with him last semester, and my experience with him sucked. He spends all class clicking away through online lecture slides without really teaching (because corny jingles REALLY help), and he would sometimes go off-topic and tell us about his current status on the Anti-Bike Crusade. I went to discuss one of my exams with him during his office hours, but he was very condescending. However, his exams were similar to the discussion worksheets, which was a relief (though I had already taken the course in high school). I give him 2 stars because I thought his class was easy, but I would NOT recommend for those new to Calc 1. I'm sorry if you have to take him nevertheless.", "rating": 2, "expected_grade": "A", "created": "2020-01-29T17:58:37Z"}, {"professor": "Timothy Pilachowski", "course": "STAT400", "review": "DO NOT TAKE HIS STAT 400. It's boring. He just reads the slides. You don't have to take his class, Just stay at home, and do the test bank. ", "rating": 1, "expected_grade": "B", "created": "2020-02-16T20:41:21Z"}, {"professor": "Timothy Pilachowski", "course": "STAT400", "review": "Professor Pilachowski does a great job of teaching statistics. I took AP statistics in high school, and the two classes are almost identical in content. (The differences are that STAT400 includes a tiny bit of integration and some more specific named probability distributions, while AP statistics includes hypothesis testing and linear regressions.) In comparison, Pilachowski was a much better instructor who could teach the concepts in a clear and organized fashion. However, I did find that he was not very helpful with answering any questions if you were confused about the subject matter.", "rating": 4, "expected_grade": "A+", "created": "2020-08-15T00:40:50Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Prof Pilachowski himself seems like a nice person, but the way he teaches and converses with students just doesn’t work for me. Class is all online this semester and attendance isn’t required because he doesn’t do any in-class participation stuff (thank god), so the structure of things is that he has students watch lecture videos he posts on ELMS, then come to the live sessions with any questions. Personally I’m really not a math person, and his lecture videos are usually clear and organized, but the live sessions are just confusing because the way he explains things only complicated things more for a lot of students. In addition, he is TERRIBLE at responding to emails. It takes him weeks, and his office hours are by appointment this semester, so the only way to contact him is email, even just to set up an office hour appointment. He will drop a few low-scored homework and discussion worksheets at the end of the semester, which is a godsend because there are a lot of worksheets, and Prof Pilachowski never gives extensions on anything (deadlines are pre-set and definite). Overall, he knows his stuff, but tends to be very unhelpful with accommodating his student’s needs (where I’m coming from on this is I have accommodations, and it was incredibly and unreasonably difficult to meet with him to get that all sorted out).", "rating": 3, "expected_grade": "C", "created": "2020-11-18T19:17:51Z"}, {"professor": "Timothy Pilachowski", "course": "STAT400", "review": "He's an average professor. Not terrible but also not amazing. He isn't super helpful when people ask questions, but he isn't mean about it or anything-- he just doesn't explain super well on the spot. I never really watched the pre recorded lectures much, just read the textbook and skimmed his videos for help if I needed it. His two midterms were exactly like the old exams in the testbank, so definitely study those.", "rating": 4, "expected_grade": "A", "created": "2021-07-08T00:48:09Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "If you have taken AP Calculus BC, or AP Calculus AB, or lower-level calculus-related classes at UMD, then Pilachowski is probably an average or slightly below average professor at best. For people who have never taken calculus and this is the first course you will be taking, you want to AVOID PILACHOWSKI at all costs. His teaching method is quite possibly the worst fit for a math class. The way he teaches is by clicking \"Next\" on a 10-year-old PowerPoint. In lectures, he does not really explain anything or take any questions or do a real practice problem or show the steps or any of that. He does none of that at all. The way you learn math from a good teacher is by them showing you an example and giving you a step-by-step process on how to solve that specific problem in the future so that you would know what to do with that specific type of problem. Rather, he just reads word for word the complicated boring textbook definitions of terms in his powerpoints that never make sense to anybody. So to the general masses, unless reading word for word textbook definitions is how you learn math, his lectures are utterly useless. Now it would be unfair of me to critique the grading because all 140 classes have discussion worksheets and web assigns due each week graded on accuracy so even though that's a bit harsh, it is not his fault that's the way the coursework is given at UMD. What I can say however is that HE DOES NOT CURVE any of the tests even if the majority of the class fails or gets low grades. The most he does is drop a couple of the lowest discussion worksheets and hw assignments at the end of the semester which will not even impact your grade (1-2%maybe at most). What I can say is that when he is not clicking away at his PowerPoint, he constantly tries to make jokes throughout the lecture, as if to make up for the teaching method. He does organize things well and gives deadlines on the syllabus which I give him credit for. In order to succeed in this class, you would have either needed to A) have taken some form of calculus already so you have a thorough understanding already regardless or B) Have an amazing TA, prioritize all of your time onto this class and make the most out of every discussion session along with self-teaching yourself the entirety of the course. He is honestly fine as a person, just not the best teacher for someone new to calc.\r\n\r\nI am giving him a 1 star from the perspective that this was my first exposure to calculus ever and this was definitely not welcoming\r\nProbably a 2/3 star if you have taken the class before\r\n\r\nTl;DR\r\nBad choice if this is your first calculus class and you should drop it or choose another professor\r\nYou might do fine if you have a lot of exposure or have already taken calc", "rating": 1, "expected_grade": "B", "created": "2021-09-17T17:43:01Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Awful professor. The single upside is that he posted his COVID recordings to ELMS so I could do the lectures on my own and not have to come to his god-awful class. He goes over the syllabus EVERY class. All he does is talk about how much he hates bicycles. When he does decide to actually \"teach\" he just talks in the most robotic boring voice and clicks through slides. Doesn't write out a single equation. It's all on PowerPoint. Have to go to Math Success every night to survive this class. I took AP Calc in high school and got an A and this is a nightmare compared to that. My TA is also useless and I have to resort to using other discussion's TAs for help. Pilachowski also never responds to emails. Homework is assigned after every lecture that is due the next morning so if you need an extension or help, don't expect him to respond. I emailed him for my ADS accommodations nearly a week ago and still have no response. Worst professor on campus. Take Chadwick instead. He is significantly better. Everyone that was lucky enough to transfer out of Pilachowski's class into Chadwick's said it saved their grade and they're doing much better. The only other upside to this class is that he drops your lowest discussion and test grade, but that doesn't make much of a difference if he's not teaching the material clearly to begin with.", "rating": 1, "expected_grade": "", "created": "2021-10-25T14:34:54Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "If you are to take this course and get him as a teacher, don't waste your time going to the lectures. Watch them online as he tends to ramble in class and I got much more use out of watching the lecture videos online then being in class", "rating": 3, "expected_grade": "A", "created": "2021-11-29T23:38:53Z"}, {"professor": "Timothy Pilachowski", "course": null, "review": "tim is an okay teacher. his lectures are just him reading off of his old slides without doing any work which can be confusing. i do appreciate how you can choose if u go to class or not, but watching the lectures is necessary if you want to pass. i have an A in all my classes bc i am a generally good student but this wasn't it. only take if needed. also exams were soo hard", "rating": 2, "expected_grade": "B-", "created": "2021-12-09T22:19:04Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "AVOID THIS PROFESSOR! Professor Pilachowski was late for class most days which would cut into valuable lecture time. On top of this he could consistently go over the \"rules of his class\" every single day. Rather than the 50 minutes of lecture we should have had it was about 40. Since he was determined to get through all of his slides he would breeze through them so fast without answering most questions. Yes, he taught calculus through a slideshow every single day. He never wrote anything on the board. He would talk about bikes and scooters on the sidewalk some days while borderline harassing students for that outside of class. Once again, this would take up lecture time. The discussion worksheets were way harder than any examples he \"taught\" during lecture so everyone sat there having a way harder time than they should have. Homework was the same way, sometimes even putting material that we have not even learned on there. His exams were brutal, they were only 5 questions but 50 minutes was not enough time to finish with confidence for most students. Many trick questions on exams and would not curve exam grades or total grades at the end of the semester. When asking him a question via email, he would respond with very few words being vague with every answer sometimes ignoring the email completely. Horrible professor. Do not take his classes.", "rating": 1, "expected_grade": "C-", "created": "2021-12-21T03:39:05Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Pilachowski is an average professor. He is for sure not the best that you can get although I won't say he is absolutely terrible— he gets the job done. I took AP Calculus AB in high school which resulted in me getting significantly above the average on all the midterms and on the final exam but I can definitely say that if you have never taken a Calculus course before, you will have trouble in this class.\r\n\r\nPros:\r\n- The final exam is EXACTLY the same as the previous couple years' final exams. Like pretty much identical but different nambers. If you practice about 5 of them from the UMD math test bank, you should have no problem at all on the final. In my opinion (and reflected by the scores), the final exam is the easiest exam of the all the exams you will take in this class by far. This is important because the final is worth nearly 30% of your grade in this class.\r\n- Midterms are pretty easy and fair. There is always a topic or two for each unit that was never covered in AP Calculus though (ex: Newton-Raphson Method, and Delta Epsilon Proofs— in my experience at least), so you definitely need to study for this class, even if you've taken AP.\r\n- TAs for this class are generally helpful, even if they aren't necessarily yours. \r\n- With some classes, you can get away with not going to discussion, but not this class. During every discussion there is a worksheet that you do with your table that counts for a grade.\r\n- Homeworks are on WebAssign and they are pretty easy and are good practice.\r\n- There is a lecture outline for every lecture and makes it pretty easy and straight-forward to follow through.\r\n- Pilachowski ends up dropping your lowest couple homeworks and discussion worksheets to help your grade. He also cuts your lowest midterm exam score in half so it is worth fewer points in the final calculation. For example: if your lowest midterm is a 70/100, it will be changed to a 35/50 which helps your grade by about 1 or 2%, which is helpful if you are close to the next letter grade.\r\n\r\nCons:\r\n- My worst complaint about this professor: he spends SO MUCH TIME at the beginning of EVERY CLASS talking about absolute nonsense. Pilachowski is infamous for hating bikes and electric scooters and will come into class with a new anecdote about how he almost runs over someone EVERY. SINGLE. CLASS... He also has general messages that he repeats every. single. class. which were helpful for maybe the first few weeks but even during the last weeks of the semester, he was reminding us to \"mAke SuRe YoU PuT mAtH140 In ThE sUbJeCt LiNE of EaCh EmAiL oR eLSe I wILL nOT rEaD iT\" or \"mY CLocK iS SeT tO ThE tImE iN cOLorAdO\". Not to mention that at the beginning of every class, he states \"I think I will get through chapter ___ today\", but then he doesn't and tells us to read the textbook or watch the lecture video online... Maybe if he didn't talk about the most irrelevant nonsense during the beginning of lectures, then he would actually finish teaching.\r\n- Like every college course, exams are everything. In this class specifically, you will take one diagnostic test at the beginning of the year, 4 midterms, and one final which total to over 80% of your overall grade. Each midterm is 12.5% of your final grade. Study hard for these exams as they will make or break your grade. One bad exam can drop you letter grades.\r\n\r\nOverall, pick someone else please. Save yourself. Pilachowski is an option for MATH141 which I am taking after MATH140 but me, along with almost everyone that had him for MATH140, are making sure to pick someone else. Pilachowski can get you by but overall, that's not the only job of a professor. Pilachowski almost always has the most amount of seats open for his sections because people try and avoid having him has a professor, rightfully so. However, if you are just looking to get in and out of Calculus 1 and you are familiar with the material already, Pilachowski is fine.", "rating": 2, "expected_grade": "A", "created": "2021-12-22T20:43:58Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "People hated this guy and the class, but it really wasn't too bad AS LONG AS you attended all in-person lectures. It sucked, and he goes through the lectures super quick, but if you are sure to take notes the entire time and actually pay attention then you'll be okay. Be sure to do the past practice exams and know all the questions well because the exams are very similar to those. This guy isn't the nicest and he overcomplicates some concepts, but he is pretty generous when it comes to grading. No minuses for any letter grades, but still pluses, and he will round your grade up if you are borderline. He also does not like bike riders.", "rating": 4, "expected_grade": "A+", "created": "2021-12-26T00:46:03Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Everyone in the class GroupMe hated Tim and his class, but in my opinion, it wasn't bad. In regard to Tim's teaching style, he always uses PowerPoint slides from the previous decade. Because of his style, a majority of students didn't like him, but I think that his slides were well-structured and provided very good explanations of concepts and examples to help us understand those concepts. His lecture outlines were like guided readings and that helped me quite a bit. Also, he grades our exams quite leniently. I've heard that professors like Denny Gulick won't give partial credit, while Tim does, so I like that about his class. However, the main caveat is that you have to rely on the lecture videos he posts on ELMS. The issue with his in-person lecture is that he will start lecture late because he's quite adamant about keeping bikers off the sidewalk and he comes to the lecture hall late, so about 10-20 minutes have passed since the lecture should've started. He rushes through the slides in his in-person lecture, while his lecture videos allowed you to actually understand the concepts. I can't say much about him as a person, because, in his videos, he's like the nicest grandpa, while in-person, he's like Scrooge.", "rating": 5, "expected_grade": "A", "created": "2022-01-16T20:22:42Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "I thought I was not being a good student, but after taking math 141 with a real professor I have realized that he is awful. He is way too strict, and also doesn't even teach well. His PowerPoints do not explain how to do the problems, and then he asks questions on the exams that were barely covered in class. He makes his TAs grade the discussions harshly, which no one benefits from. Any other professor would be better. The TAs were good tho #Free Joe.", "rating": 1, "expected_grade": "A", "created": "2022-03-14T19:28:58Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Tim’s video lectures and lecture notes are amazing and I felt that I understand the material really well. (I only went to two lectures the whole semester because the videos were the exact same, if not better. In-person was not required.) My professor for 141 is a terrible lecturer so I’ve been teaching myself entirely with Tim’s notes for that class, which are on his website for anyone to see. His way of teaching made it very easy for me to understand calculus despite no prior experience beyond precalc in high school. \r\n\r\nOne star subtracted because he is rude in emails. \r\n\r\nDon’t tell him if you ride a scooter. ", "rating": 4, "expected_grade": "A", "created": "2022-04-21T02:00:53Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "I had Pilachowsi for MATH140 and 141, and I can say wholeheartedly I won't miss it. I thought he was fine when I took 140, but that was probably because I had already taken the class in high school so not much was new. Math141 is a different story. While I did pretty well in the classes, that is through no help of his. His lectures are him reading the textbook off of his PowerPoint slides to you. The only redeeming part is that he puts all the lecture videos online, so I haven't been to class since the first day. His exams are hard but not ridiculous if you study, and his TA's grade nicely (at least in my experience). There is no curve and his grade distribution will kick your butt in the end. If you can take someone else, I would recommend it. ", "rating": 1, "expected_grade": "", "created": "2022-04-28T12:32:48Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "I would like to personally thank myself for carrying myself in that class. The powerpoints go over the most simple examples of each unit which is irrelevant because he picks things that have not been covered in class or are the hardest to do for his exams. He should switch careers and be a rapper too because he goes through the PowerPoint at an astronomical speed. He posts lecture videos online which is more helpful than in-person lectures. He does drop a good amount of discussion ws and hw but the TAs are my favorite part of this class. #lovePhil #loveJoe #loveJosh", "rating": 1, "expected_grade": "B+", "created": "2022-05-03T22:42:02Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "His teaching style did not personally meet my learning style, and it seems that it did not meet others' styles as well. In his lectures, he basically just reads through examples and narrates what is happening. It becomes really unclear at times and I would've preferred if he worked out questions in front of us. For the entirety of the course, I pretty much had to learn everything via YouTube. His tests are not too bad, and there is a ton of partial credit to be earned. ", "rating": 3, "expected_grade": "A", "created": "2022-05-10T22:04:37Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "Not gonna lie, I genuinely thing that the majority of bad reviews this guy gets in 141 are from people who never bothered to print out the lecture notes that he has on his website. Those lecture notes are REALLY detailed and help you keep track of the countless formulas and techniques that you will have to memorize through the course. The notes were a godsend for me since I am a terrible note taker. I cannot emphasize enough how helpful these lecture notes were in helping me do very well in the course. Seriously, this guy literally has a resource that will make the course significantly easier for you and yet so many people are too lazy to bother printing them out for use. To be honest he should emphasize the importance of his lecture notes more, since his lectures become much more easy to be followed when you have them with you. He is a good teacher, but if you want to make the most out of his course, for the love of god, USE THE LECTURE NOTES. Almost no one I knew in the class used them and I consistently performed far better than them. ", "rating": 5, "expected_grade": "A", "created": "2022-05-12T22:10:41Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "If you want to do well in 141 and are willing the put in the work, then Pilachowski is your best bet. He provides lecture outlines for each class which are very detailed and helpful. I wrote on these notes for every class and it was very helpful to look back on when studying for tests and especially the final. Secondly, he also provides lecture videos which are just about the same as going to class. Taking advantage of the lecture outlines are the easiest and best way to do well in this class. If you are still struggling, he also provides additional textbook problems to help you understand concepts better. One of the things I liked most about Pilachowski teaching is that he points you in the exact place to go for help. When it came to 141 concepts that relied on information taught in 140 he points to the exact place in the textbook to go to if you need to review. He offers all the resources and material you would need to do well and it is clear that he cares about how well students do. This class is hard but if you put in the work for the class it is possible to do well and taking Pilachowski can give you a pretty fair shot at it. ", "rating": 5, "expected_grade": "A", "created": "2022-05-17T18:43:43Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Pilachowski is such a good lecturer, I don't know why he gets so much hate. He is very lenient in correction, lowest score is dropped by 50%, 3 worksheets are dropped and 8 homework assignments too! Other than all this he doesn't give a minus grade so if you have above an 89 in the course you get a 4.0 GPA. I would recommend taking him.", "rating": 5, "expected_grade": "A", "created": "2022-07-18T07:57:32Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "Had an amazing time in MATH141 with him. The course felt rather easy with his grading scheme. Recommend taking him if the schedules match. ", "rating": 5, "expected_grade": "A+", "created": "2022-07-18T07:58:48Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "MATH141 was an easy A+ with Pilachowski. Strongly recommend taking this course with him.", "rating": 5, "expected_grade": "A+", "created": "2022-08-18T12:56:48.144430Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "Stop believing the 5 star reviews he has been known for giving himself fake reviews to boost his average. Unless you dedicate 15+ hours a week or have years of previous calc experience he is not a good professor, he teaches off a 15 year old power point and has never picked up a marker and done an equation all semester. He has the highest D,F, and W rate among all popular calc teachers", "rating": 1, "expected_grade": "W", "created": "2022-09-15T05:57:05.490372Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "(Preface: I took calc AB and BC in high school, though I didn't do great in either). Prof. Pilachowski is a good professor in my opinion. I believe he is an okay lecturer for the most part, but sometimes I feel he overcomplicates things which can confuse people. What makes him a good professor is not his lectures themselves, but all the resources he gives you to succeed. The discussion sessions are great for the most part, and his website has a ton of practice problems on them. His lecture outlines are also very nice since his lectures can be fast paced. Also, his grading policy is quite generous. Personality wise, he can come off as demeaning sometimes. He is other than that an absolute character, informing us on Roy Rogers deals and protecting the  sidewalks from scooters.", "rating": 4, "expected_grade": "A", "created": "2022-10-19T21:59:45.153082Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Pilachowski is a pretty terrible lecturer; he just clicks through his Powerpoints at lightning speed without really explaining anything or going through steps to work out problems. He also wastes time during lecture by showing up late or spending the first ten minutes of class ranting about how much he hates bikes/scooters, giving condescending speeches, or reviewing basic information like his email address even well into October/November. This was very frustrating, especially since he did not actually respond when I *did* email him.\r\n\r\nThe only reason I did not give one star is because he lets you watch his recorded lectures instead of attending in person. The videos are identical to the in-class lectures but at least you can watch at your own pace at your convenience. The graded discussion worksheets are not super fun but since all of the MATH 140 professors use them they are pretty much unavoidable. Overall I would suggest trying to get a different professor if you can, especially if you are new to calculus.", "rating": 2, "expected_grade": "B", "created": "2022-11-30T01:27:33.623690Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "(Preface: I didn't take any calc or precalc in high school, I didn't even do trig) I feel intuitively that Pilachowski's lectures are good ones, and he makes lecture notes & study guides which also helped, but that does not translate to my test grades unfortunately. He also posts the video versions so you can review it whenever. He answers questions well enough and tries to emphasize when something will be on the exam. Homework is a reasonable length (~20 or 25 questions a week), and the textbook is also a free pdf online, so that's a plus.\r\nI absolutely hated that discussions were mandatory though. Its so hard to think in them because they're so loud, and I didn't feel like I learned much in them; I was so behind it felt like I was just writing what my group wrote and had to figure it out later. I really wish they posted the discussion worksheets in elms so I could look them over beforehand.", "rating": 3, "expected_grade": "F", "created": "2022-11-30T14:36:14.379420Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "DO NOT TAKE HIS CLASS IF YOU HAVE NEVER TAKEN CALC BEFORE. He teaches as though his class is an AP Clac review. Do not bother going to lecture, just watch lecture videos. 3 Midterms and 1 final. 3+ math labs each week. Expect to spend a lot of time on hw. The only thing good about this class was the sweet TA, Margot and that he posts his covid lectures so you don't have to actually go to his class.", "rating": 2, "expected_grade": "B", "created": "2022-12-06T14:35:59.142436Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "I took calc before, so either way this class was easy for me. The way it was structured was nice because there are no \"-\" grades, the discussions are helpful if you have a good TA (Margot <3), and the exams are straightforward if you study the tests from the test bank. The homework was a bit time consuming and I never paid attention in lectures/watched the videos since I already knew most of calculus. Attendance was also mandatory in lectures. Pilachowski himself wasted a lot of time talking about useless things like bicycles and the reviews for his exams in the lectures were not that helpful.", "rating": 3, "expected_grade": "A+", "created": "2022-12-06T21:34:27.983032Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "I highly recommend you not to take this class unless if you have taken Cal before. Pilachowski teaches through a powerpoint and talks like a robot. His exams tend to also be a bit harder than the practice exams we are given and he's very picky when it comes to grading them. The only good thing about him is that he doesn't give minus grades and has recorded lectures. If you stuck with him I highly recommend getting close with the TAs so you can understand what is being taught in better detail.", "rating": 2, "expected_grade": "C+", "created": "2022-12-07T18:19:42.766256Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "For the love of god try to get any other teacher. Especially if you have not taken calc before. Homework takes a century and tests are NOT easy.", "rating": 2, "expected_grade": "B+", "created": "2022-12-09T04:15:24.855229Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Tim is a professor who will either help you get through the class, or completely fail you. It all depends on how you learn. Basically, Tim doesn't teach MATH140 like the other professors where they work out problems on a chalkboard or whiteboard. Instead, he just scrolls through a slideshow. So if you can learn math through a slideshow or have taken calculus before, Tim is a good option. The one thing about Tim that is really great is his lecture outlines. For basically all his classes, he has a lecture outline for each unit and topic, allowing you to take notes on it digitally or print them out and take notes on them by hand. They have all the information you need, and all you need to do in work out the problems he goes over in lecture. His lectures are all recorded, so class attendance really isn't mandatory. I know a lot of other MATH140 professors aren't able to finish a topic completely in class, so having Tim's videos help a lot compared to a professor who doesn't record them and don't finish a topic completely. His exams are also on the easier side compared to other professors. He is a huge anti-bike person, so be prepared to get lectures on UMD bike laws and such. Your TA also plays a big role in your success with Tim, as my TA practically taught me the majority of the information. He applied a generous curve at the end as well.", "rating": 3, "expected_grade": "A", "created": "2022-12-10T22:50:44.359291Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Would like to preface this with the fact that he doesn't even know his TA's.... he only has two for my class.\r\n\r\nI have taken calc before, not AP or IB level, but I do have a good amount of calculus experience. If you have 0 calculus experience stop reading this and go change your teacher or drop the class. Nothing prepared me for this. I won't say the material is extremely hard, because that would be a lie. However, his teaching style is probably the worst I've ever seen in my entire life. He will skip examples during class to show funny pictures or a quote that is not relevant to lecture at all. He is extremely rude to students when they ask GOOD questions. Test day? Get ready for yelling and screaming up until the exact second your test starts. Homework takes FOREVER to do. \r\n\r\nSo much more I could say but really that should be enough to convince ANYONE to drop the class.", "rating": 1, "expected_grade": "B+", "created": "2022-12-11T18:29:51.354262Z"}, {"professor": "Timothy Pilachowski", "course": "STAT430", "review": "This is for the Spring 2022 Semester despite the review date posted. \r\n\r\nPros: Online Exams, Posts all slides, He doesn't believe in +/-, so it's A from 90-100, B, C, etc. , \r\nCons: Online assignments due every week and homework, Gives a sample review guide for exams but no answer key (also will not go over the guide unless you ask him for the answer) \r\n\r\nWhen you ask a question about the content or don't know, he's the type of professor to respond with, \"What do you think the answer is?\" so if that makes you anxious, avoid him. \r\nHe's a bit condescending when clarifying concepts as well.  If you ask for clarifications for online assignments/projects, he responds with \"read the directions.\" and that's it.  The class itself isn't hard so I was able to get an A but I did not like the style of the professor.", "rating": 3, "expected_grade": "A", "created": "2022-12-13T16:32:00.678586Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "if you haven’t taken calc before i don’t think he is the professor for you. he is very vague in his teaching style and does not actually write out any math problems physically in real time. he also i feel belittles people when you ask questions after class. also if you have any kind of test anxiety he makes testing environments so bad by yelling and screaming at people to follow his directions. if you end up\r\nwith him you’ll pay be fine as long as you talk to your TA anytime you need help. it’s also nice that he drops some of the lower grades but overall i would NOT recommend", "rating": 2, "expected_grade": "B", "created": "2022-12-13T17:58:36.726699Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "He was a terrible professor but the only reason I'm giving him such a high ranking is because you did not have to attend any of the lectures and could use the textbook or his recorded lectures as resources instead. The grade was VERY, VERY, VERY generous. There was an entire 10 point problem on the exam that I could not answer and still got an A on the final. Would take again if I needed another math credit", "rating": 4, "expected_grade": "A", "created": "2022-12-19T20:02:26.204662Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Gets easily distracted in class, doesn’t teach in-depth, and expects you to know a lot coming into the class without teaching or reviewing it. Does not provide any curve. Worse Freshman teacher I had by far this semester.", "rating": 1, "expected_grade": "C+", "created": "2022-12-19T22:18:02.409390Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "Took Calc 2 with Tim in Spring 2022. The guy is extremely rude when you email him for administrative issues (of which are his fault) or questions regarding concepts. Mans goes off of a 20-year old power point that's EXTREMELY vague and has never picked up a pencil to show us some examples. You will not learn JACK in his class, and will definitely have to spend hours watching Youtube videos/going off of the textbook.\r\n\r\nI would like to thank myself for excelling on the final. TAs were absolute legends.. shoutout to Joe!\r\n\r\nOne thing I gotta give him credit is his generous grading system with having no +/- grades -- strictly A, B, C, etc..", "rating": 2, "expected_grade": "A", "created": "2022-12-29T00:33:19.609122Z"}, {"professor": "Timothy Pilachowski", "course": "STAT430", "review": "Took him for STAT430. While this professor does understand the material very well, lectures were very boring. There were a lot of assignments, especially online assessments which were assigned and were expected to be completed the same day, which is unreasonable. Many assignment instructions are hard to understand and decipher, making assignments harder than they needed to be. He doesn’t really answer any questions and can be quite condescending.", "rating": 1, "expected_grade": "A", "created": "2023-01-11T04:25:01.545387Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "For the love of god, do not take this professor. He is not good at teaching at all. Even when approached outside of class, he is sarcastic and unforgiving. Take another professor if you can", "rating": 1, "expected_grade": "", "created": "2023-01-12T03:08:22.413256Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "I took him in Spring 2022, and he isn't as horrible as most students think.\r\n\r\nPros (great resources): online lecture videos, notes, grading policy, reviews, etc.\r\nCons: his in-person teaching style.\r\n\r\nAs long as you study diligently, you will pass the class!", "rating": 3, "expected_grade": "B", "created": "2023-02-20T00:36:52.677715Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "All he does is scroll through his presentation slides he most probably made decades ago. He does not work out any problems with the class and goes through the material rather quickly. Never go to him for a question, not only will he not answer it, whatever response he does come up with will be incredibly snide. The TA's are the best part about taking this class; they are very helpful. He is just not a good teacher. I can't vouch for his character but I can't imagine good things. If you like teaching yourself math, not asking questions, and taking notes at the speed of light; I would still implore you to consider taking someone else!", "rating": 1, "expected_grade": "", "created": "2023-03-02T16:16:42.353755Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "I'm late reviewing him as I took math 140 3 semesters ago, obviously. He is bad, JUST BAD. Don't take him, take gulick instead if you are willing to have an early schedule. His exams are rediculus and he reduces the lowest exam score by half and drops alot of assignments but that does not make up for how downright bad he is. AVOID HIM!", "rating": 1, "expected_grade": "B", "created": "2023-03-11T01:27:46.314745Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "If you have to take Tim just know you will be teaching yourself Calculus 1, which is doable but you’ll have to work hard. Go to discussion and go to your TA’s office hours they will help you way more than Tim. He only reads from his slides and those slides are the exact same as his covid recordings. The slides are not really representative of the difficulty of what you’ll have to learn, they only really expose you to what you need to go learn on your own. \r\n\r\nThe benefits of Tim have nothing to do with his teaching, but his system. The exams are generally pretty similar to the practice exams, he drops a few hws/discussions, Halves the effect of your worst exam, and tends to curve grades by a little bit at the end. Tim himself is a horrible teacher who doesn’t even try, but he has some resources and policies which are better than nothing.\r\n\r\nTldr if you are planning on teaching yourself calculus there are some benefits in taking Tim, if not you are in for a rude awakening.", "rating": 2, "expected_grade": "A", "created": "2023-04-20T23:48:51.475986Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "Tim does not teach, he reads off of slides. If you're anything like a normal person, you learn math when it is actually performed during lecture, not when it is an audiobook of the text. Studying alone and with others made this class bearable, but I would not wish having to take math with him on anyone else. Please choose a different professor for CALC II as this is difficult math and new material for those who did not take B/C in high school. Ishvak is the best TA, if you have discussion with him be grateful and ask him to explain concepts.", "rating": 1, "expected_grade": "B+", "created": "2023-04-28T21:56:37.531660Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "The pre-recorded lectures were such a life savior this semester. I did not go to a single lecture in person unless it was an exam which I found very beneficial in this class. His in person lectures are way too fast but having the lecture videos and being able to pause and re-watch while studying for exams was very helpful. However, you cannot fully depend on his lecture videos. I found myself having to go to the textbook and look up videos on certain topics. I strongly recommend Pilachowski for the sole purpose of his non mandatory lectures.", "rating": 4, "expected_grade": "A-", "created": "2023-05-02T12:26:26.315767Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "I took calc1 and calc2 with Tim and got an A both times without any prior experience with Calc/pre-Calc in High School. Tim has pre-recorded lectures from covid which are helpful when you don't want to go to lecture. The lecture themselves follow a format where he starts with theory and follows with example problems. The slides he provides are outdated and the actual lecture is like listening to a audiobook, however take good notes and you'll be able to somewhat understand the content. Tims exams are fair 80% of the time and he will always drop your lowest exam by 50% and does not do minus grades. This semester he curved the grade cutoffs by 2%. Overall, Tim is a decent professor and does not deserve all the hate he gets on his reviews. There are better first choices but don't be stressed if you get stuck with him. No one is stopping you from going to another lecture if you don't like how he teaches. Put in the extra work like actually doing the homework, going to GSS, exam review sessions, and group study sessions and you can get the grade you want. Your grade is reflected on how much time/effort you put in, not how good your professor is. Tim does not like electronic scooters.", "rating": 4, "expected_grade": "A", "created": "2023-05-08T15:27:31.485044Z"}, {"professor": "Timothy Pilachowski", "course": "STAT430", "review": "The class is easy, so you can do well, but he is not a good professor. Nothing was graded the first 7-8 weeks of the semester. Then there was a mistake on the Canvas exam where 2 of the questions he misspelled the correct answer, and instead of just changing the correct answer, he made each person go individually to office hours and would change just their score then.", "rating": 1, "expected_grade": "A", "created": "2023-05-08T16:52:59.672398Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "DO NOT I repeat DO NOT sign up for his classes! He teaches from a power point with math!! Bad at explaining and calculus is already hard. I am good at math but this class was a struggle. He would mess up dates on discussion sheets so we would be doing math that we \"had not even learned yet\".", "rating": 2, "expected_grade": "B+", "created": "2023-05-10T19:20:24.308014Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "I took this class spring 2023. I took math 113 in the fall and got a C in the class, so I was super worried about math 120 and had to take it for my major. This professor is actually a great teacher, and even if you don't agree, he is extremely organized. Probably the one the best advantages. He also doesn't give minus grades, so you only need a 90 for an A. It is however not curved. I recommend this professor. He will probably have all his lecture videos online in future semesters, but I personally learn better by going to class. As someone who was worried about math, effort and attending class/office hours got me through. He also prepares you extremely well for the finals. He gives word problems on mid terms that are extremely similar to the finals. The TAs were pretty good too.", "rating": 4, "expected_grade": "A", "created": "2023-05-17T20:49:00.079665Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Teaches from power points, never really explains much. It was a plus that his lectures are online so I didn't have to attend class in-person. I attended a few in-person classes and he was going through the slides so fast that I couldn't keep up so I opted for his online lectures. A couple friends went to his office hours and said he was personable, so there's that I guess. His review sessions for all exams suck, don't even waste your time because he spends soooo much time lecturing about stuff most of us already know. Not the worst professor in the world but certainly not the best.", "rating": 2, "expected_grade": "B+", "created": "2023-05-24T00:47:02.174128Z"}, {"professor": "Timothy Pilachowski", "course": "STAT400", "review": "Very straight-forward, his exams are basically identical to his previous ones (save for the numbers), and he teaches the material in a way that's pretty easy to understand. Would recommend taking him for STAT400 if you can.", "rating": 4, "expected_grade": "A", "created": "2023-07-25T21:50:11.118806Z"}, {"professor": "Timothy Pilachowski", "course": "MATH141", "review": "The great thing about Tim is that is he does not give ( - )grades, and he rounds all percentages up by one. However his lectures move extremely fast, especially towards the last units. If you go to his lectures, you will find yourself looking back at his videos to understand what he is saying. So most people avoid lectures altogether and watch his videos instead. Tim is a very convenient professor in that respect, since most students avoid going to lectures and manage to do well. First two exams are easy, last two were on the harder side, with a curve on the fourth. If you are looking for a professor that does more than teach from a PowerPoint, I do not recommend Tim. If you prefer studying on your own, Tim is a great pick. As of spring 2023, there were no quizzes.", "rating": 3, "expected_grade": "A", "created": "2023-08-26T22:50:49.539552Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Only uses powerpoints. Sings songs to teach, but they're not very helpful. He complains about scooters too much too. Biggest point is that he teaches with the expectation that you already know it. It feels more like he is reviewing it rather than teaching new material.", "rating": 1, "expected_grade": "W", "created": "2023-10-26T04:00:31.359059Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Honestly, if you know calculus and all previous maths then you should be fine. But if you don’t know pre calc or trig you’re screwed bc he doesn’t touch that at all in lecture. And if you need to see how a problem is done then Tim isn’t your man. This is because everything is taught of a pp and numbers come out of no where. He also goes EXTREMELY quick and doesn’t like to answer questions. Honestly if you have Tim you’re screwed so good luck. Thanks to tim I’m behind in my comp sci classes.", "rating": 1, "expected_grade": "W", "created": "2023-11-06T21:58:28.209802Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "DO NOT TAKE HIM! He doesn't teach you anything. Practice exams, textbook questions, and homework are nothing similar to his exams. He makes his exams harder than every other professor teaching MATH140. I basically taught myself using the textbook. Avoid at all cost. Almost impossible to get an A in his class. Half the class withdraws after the 3rd exam.", "rating": 1, "expected_grade": "B", "created": "2023-11-20T19:44:16.291230Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "He just uses a powerpoint, does no work by hand, and expects you to know almost everything before he even teaches it. You could study for his exams for hours and do all of the practices exams and then still fail the tests bc they are nothing like the examples he gives in class. Discussion worksheets are good for ur grade but useless otherwise bc he considers them \"too hard to put on exams\". Homework is easy but doesn't count for much. Doesn't give - grades tho and drops a few homework and worksheet grades. Overall if you want to do little homework and teach calc to yourself take him, otherwise steer clear.", "rating": 2, "expected_grade": "B", "created": "2023-11-23T20:40:24.367027Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "He is awful. He hasn't done any math this entire semester. Soley reads off of the slides. The homeworks are lengthy and much more difficult than the material review in class. If you have him I feel sorry for you.", "rating": 1, "expected_grade": "A", "created": "2023-11-29T05:02:39.949860Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "This guy blows so bad do not take his class please whatever you do", "rating": 1, "expected_grade": "B", "created": "2023-12-04T20:47:41.127443Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "He just reads off a PowerPoint and doesn't really put any effort at all into teaching you. He's not a particularly likable guy either. You essentially have to already know calc before you take the class. The good thing about the class is that all his lectures are posted online so you don't have to attend in person. Most of your learning will come from piecing together the homeworks and from the discussions.", "rating": 2, "expected_grade": "A", "created": "2023-12-06T00:42:05.546623Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "If you can do anything to avoid him, please do. I took precalc and ap calc in high school, and this class was a struggle. He shows up late to class every single day and barely teaches. He moves so fast and doesn't explain anything. Don't ask questions, you will probably be pitied. You will learn so much more watching the online videos and going to TA office hours. The homework takes over an hour each night. Test days are filled with screaming! 1000% do not recommend, but good luck if you do!", "rating": 1, "expected_grade": "B", "created": "2023-12-06T18:14:52.276666Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Literally avoid at all costs, you'll have to put in 3 times more work as all the other teacher because he thinks he's above teaching. He doesn't write anything and uses power points he made 10 years ago, all he does is click a button and the entire problem is solved so you have to try and go through it yourself and understand it. He gives homework twice a week that takes about an hour each time. His discussions are graded worksheets that are usually harder than the test material but are good practice. He says use the MATH140 testbank to get practice exams, which is a good piece of advice but he often throws curveballs to try and trip you up on exams. Don't try going to office hours as he usually just tells you what to learn to solve your problem and not how to solve it. The TAs I had were wonderful though, all three of them knew the material and were happy to help, but this is probably going to vary semester to semester. Overall the best thing you can do if you do have this guy is to make friends fast and study with them, going to lectures isn't necessary as he posts the videos online, but still go to try and pay attention. His class is manageable, but it is a LOT of work so don't be fooled.", "rating": 2, "expected_grade": "B", "created": "2023-12-06T19:25:40.803916Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Awful professor. Doesn't teach at all, exams way harder than other professors. Take if you like failing classes.", "rating": 1, "expected_grade": "B+", "created": "2023-12-07T19:23:15.280813Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Please find literally any other professor for MATH120 or other courses he may teach. Pilachowski makes succeeding in the course a lot harder than needed be. He is the laziest professor I have ever had. His lectures consist of at least 20 minutes of rambling before getting to any actual math, and even then, he'll still interrupt his own teaching and give you some anecdotal story that has absolutely no reason to be brought up and just wastes time. When the lecture is 50 minutes long, you shouldn't be wasting at least 20 minutes talking about past students or your disdain for scooters on campus, please teach. That's another thing, his teaching or the lack thereof. Pilachowski relies heavily on slides posted in the canvas classroom to \"teach\". They are very brief, with a few examples he works through in class. Occasionally he'll spend a slightly longer amount of time doing one to stress something, but usually he'll just blast through them as fast as he can and explains nothing. He wouldn't have to rush if he just shut up at the beginning of classes...He has his lectures from Covid times posted in the Canvas classroom so there is basically no point going in person, and those you can skip through his ramblings in. Still, they're the same as his in-person lectures, so there is very little difference between the two. He doesn't do any grading, thats all up to your TA, mine was kinda the only reason I wasn't failing throughout the semester. I'll admit, my grade was not entirely due to Pilachowski's horrible teaching style, I underestimated the amount of effort  needed for exams in this course. His exams are basically the same as the practice exams provided in the test bank, just study for them more than I did. His review sessions are pointless, unless you have bad TAs who don't do something outside of class (i.e. they don't have review sessions of their own). Once again, he wastes time sitting there talking, saying the same things he says before every class for at least 10 minutes, and then tells you to do it all yourself basically. With the remaining 5 minutes of time, he'll then give you useless comments on each question, displayed in the tiniest font possible, making it impossible to read or understand what he's explaining if you don't have his review sheet directly in front of you.Teach yourself the material and get help outside of the classroom if you need it, cause Pilachowski sure won't make this class easy. P.S. there are no answer keys for the numerous practice finals anywhere, so good luck with studying for that.", "rating": 1, "expected_grade": "C", "created": "2023-12-09T04:54:06.088330Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "IF YOU TOOK CALC BEFORE, you should be okay. I'm getting a B+ though, because I forgot about conic sections XD\r\nI think throughout all my math classes, they've all used PowerPoints so idk what everyone's talking about. Tim's PowerPoint goes step-by-step for each example problem, just like if you had written them out by hand. He doesn't WANT you to fail. He tries to teach you & gives advice (i.e. if you're feeling stressed tell a bad joke to yourself, songs to remember formulas, etc).\r\n\r\nPROS:\r\n- Doesn't give negative letter grades\r\n- Has videos that go over the material in class (if you wanna skip / miss a lecture)\r\n- TAs are very friendly & helpful (I love you Karthik xoxo <3)\r\n- Examples gone over in class are hard, so doing hw is slightly less difficult I guess...\r\n- Exams are structured similarly to what the final looks like (i.e. separate pieces of paper for each question, honor pledge, etc)\r\n\r\nCONS:\r\n- Uses PowerPoint if you don't like that (I'm fine with it) \r\n- Goes through slides quickly\r\n- Hw is on WebAssign. But Webassign is bad in general so yeah\r\n      - From other friends, the hw problems are the same across sections? So...\r\n- Tim's schedule is like this: Mon lecture, Mon hw due at 7:30am Tues. Wed lecture, Wed hw due at 7:30am Thur. Fri lecture, Fri hw due 7:30am Tues.\r\n- Exams are harder than exams in the math test bank", "rating": 3, "expected_grade": "B+", "created": "2023-12-14T04:04:32.273234Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Don't take Pilachowski if you have no prior calc experiences, he assumes a lot of prior experiences which makes it hard to follow along in certain lectures. His exams are also harder than average for the department and are unnecessarily difficult compared to the given practice exams, and often covers cases that were not covered through examples in lecture. He has a habit of rushing through steps in lecture and presents using a PowerPoint instead of actually writing out his math, which makes it hard for you to follow along if you don't have prior experience or are just less skilled in math in general. Please take someone else if you have no prior experience, but if you have prior experience, he's fine I guess.", "rating": 1, "expected_grade": "C", "created": "2023-12-14T18:34:51.805637Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Overhated. Sometimes his lectures are unclear and the class would benefit if he actually did math during class, but otherwise he's not that bad. If you're taking him though you have to be willing to teach calc 1 to yourself to some degree. He gives lots of personal freedom in the class, technically you don't have to go to lecture at all and you will be fine. Discussion sections help your grade and I had a good TA. Just do a practice exam or two before every test and you should be fine.", "rating": 4, "expected_grade": "A", "created": "2023-12-15T21:02:39.775951Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "He records all of his lectures so you never have to come to class which is nice. The discussions and math labs are really the only way you'll learn the content. He goes over lectures extremely fast during class, and often showed up 10 minutes late for a 50 minute class. You're exams are going to cover more content, and be significantly harder than other math 120 sections. However, this helps with the final exam because you would have been learning the content a month before the final, where as other sections only have 2 weeks to learn the new content. He also has at least 4 extra credit points per test, and will curve everyone's grades in the end if one version of a test scores significantly higher than the other version. It's not the end of the world if you take his class, but I would recommend trying to take another professor over him.", "rating": 2, "expected_grade": "A", "created": "2023-12-19T16:42:17.745174Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "TJP does not teach at all. During his lectures, he reads directly from the slideshows and he goes through them so fast. If you put the work in, you will do well. But, you definitely need a background in Calculus before taking this class.", "rating": 2, "expected_grade": "A", "created": "2023-12-21T19:36:05.346879Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "I have never taken calculus before this class. I stopped going to class after the second time because he really only teaches theorems and reads off slides. really all the learning comes from the homework but 3 sections of homework are generally assigned per week and each one took at least 2 hours (which he warns us about on syllabus day but is still shocking like why did math take up so much of my time). the TAs were great though.", "rating": 2, "expected_grade": "A", "created": "2023-12-24T07:52:51.297036Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "He's an awful professor, I took calc in high school but I knew it'd be harder in college. But his exams are probably the hardest out of any professor and he does an extremely poor job teaching you. I taught myself the whole semester.", "rating": 1, "expected_grade": "B", "created": "2024-01-03T21:29:32.150064Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "Pilachowski teaches this class like a robot, he didn't do a single problem on the board with a marker. He just goes through the slides he made twenty years ago by clicking through them while explaining them poorly. His redeeming qualities are the fact that the tests are fair, just do the practice tests from the test bank. Attendance is not mandatory as he records all lectures and posts them to the class. Not an awful person, but a poor teacher. Avoid if you can.", "rating": 2, "expected_grade": "C", "created": "2024-01-06T03:04:35.145332Z"}, {"professor": "Timothy Pilachowski", "course": "MATH120", "review": "Great professor if you already have taken Calculus in the past as lecture is completely optional and all his videos are recorded. His style of teaching can be very confusing, not in-depth, and dry so not great if you actually need to learn. However, his TA's are extremely helpful and the worksheets are great tools to prepare for Exams along with mathtestbank. Exams harder than final but they prepare you well.", "rating": 4, "expected_grade": "A", "created": "2024-01-10T23:49:45.301737Z"}, {"professor": "Timothy Pilachowski", "course": "MATH140", "review": "He doesn't understand the difference between teaching a subject and knowing about the subject you are teaching. I'm sure without his slides he isn't very useful. He had some good days though, but outside sources such as the TA's and videos helped me more throughout the course.", "rating": 1, "expected_grade": "", "created": "2024-01-26T21:40:02.833394Z"}], "name": "Timothy Pilachowski", "slug": "pilachowski"}