{"courses": ["CPSS240", "ENEE200", "ENES240", "ENEE200", "ENEE200", "PLCY240", "ENEE200", "ENES240", "PLCY240", "ENEE200", "ENES240", "PLCY240", "ENEE200", "ENES240", "PLCY240", "ENES289", "ENEE200", "ENES240", "ENES440", "PLCY240", "ENES200", "ENES240", "PLCY240"], "average_rating": 3.6667, "type": "professor", "reviews": [{"professor": "Timothy Reedy", "course": "ENEE200", "review": "He makes ENEE200 class easy as hell. Just do the assignment on time and you are good. Hopefully, your ta is chill.  You have readings but from my experience, you can skim the readings, or not read at all.", "rating": 5, "expected_grade": "A+", "created": "2022-09-21T18:28:52.589829Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "Easy. No Exams, or quizzes. Just some small written assignment. You can skim the readings. This class is basically pass fail, you do work you get an A+", "rating": 5, "expected_grade": "A+", "created": "2022-11-28T02:45:02.301836Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "Professor Reedy is a great professor, but ENEE200 is a terrible class. It’s organized in a way that prioritizes time management over quality work (grading contracts). It’s the busiest gened I’ve taken, so I can’t emphasize enough: Don’t take this class if it is not a requirement. There’s better geneds out there.", "rating": 2, "expected_grade": "B", "created": "2022-12-19T15:55:57.853926Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "The class doesn't really require that much thinking, kind of interesting, I guess. Lot of busy work in the class and the final project is a long paper. Reedy is great though, the grading contract system is super stupid in my opinion. There are better gen eds to take for sure unless this is a requirement.", "rating": 3, "expected_grade": "A", "created": "2023-01-22T00:31:06.305584Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "this class is very mid. theres no thinking, its not hard, its just a bunch of busy work. The problem is it a lot of busy work sometimes. take it over the winter if you can you will be very happy not taking it over a semester. The final project being a really long essay due right before actual finals was annoying. also the final exam being an essay which honestly wasnt needed to even be given in the middle of finals didnt help. overall an easy A if you have a good utf and keep up w all the busy work.", "rating": 3, "expected_grade": "A", "created": "2023-05-15T05:20:32.889685Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "Do the work you'll get an A+. Prof Reedy is super nice and a good guy. Class is interesting. There are a good amount of assignments which are a little annoying but not a bad class to take.", "rating": 4, "expected_grade": "A+", "created": "2023-12-03T18:55:44.671555Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "Class if fine, it's moderately interesting but nothing too crazy. Lectures are usually pretty fun, and the professor is an engaging person. HOWEVER, where this class really loses all of its points is the amount of work they assign - especially around finals. \r\nThere is just paper after paper after paper..... right when finals are happening.", "rating": 2, "expected_grade": "", "created": "2023-12-11T21:26:27.063151Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "Everything is basically just for completion, not much thinking required to get an A. Just show up and do the work. Also be prepared to be treated like a kindergartener in some of the discussion prompts, but at least Reedy seems pretty good compared to what I've heard about Mogul.", "rating": 4, "expected_grade": "A", "created": "2023-12-11T21:27:44.411876Z"}, {"professor": "Timothy Reedy", "course": "ENEE200", "review": "Reedy is goated. The labs can be hit or miss but if your TA is chill then you’re good. Lectures are pretty interesting and the professor is an engaging lecturer and very understanding on late assignments. You’re graded on a different system (grading contract) which I think is dumb as it is mostly pass/fail.", "rating": 5, "expected_grade": "A", "created": "2024-03-28T01:20:53.795193Z"}], "name": "Timothy Reedy", "slug": "reedy"}