{"courses": ["AOSC200", "AOSC493", "AOSC494", "AOSC658E", "AOSC652", "AOSC499", "AOSC798", "AOSC200C", "AOSC200", "AOSC200", "AOSC200C", "AOSC493", "AOSC499", "AOSC798", "AOSC499", "AOSC798", "AOSC200", "AOSC200C", "AOSC493", "AOSC200", "AOSC200C", "AOSC493"], "average_rating": 3.8966, "type": "professor", "reviews": [{"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim Canty is an awesome and geeky person, but I will admit the lectures were very boring and I found myself falling asleep.  That being said, he does post all the material online (lecture slides and recordings of the class) which is good for studying and catching up what you missed.  It was a pretty easy A class... that being said if you did the review guides and practice tests/quizzes he puts up you should be fine.  Also, an 85% was an A- and a 90% was an A.  I just wished the class was more engaging because I went to lectures for the \"topic of the day\"s which were like pop in-class activities that you had to be present to receive credit for.", "rating": 4, "expected_grade": "", "created": "2015-12-18T13:26:00Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "This is one of my favorite classes I have taken at UMD. Tim Canty made the class exciting, with lots of demonstrations and models about weather. The topics themselves can be boring, but the science itself is simple. You will have to do reading for short, 5 point quizzes, but the answers are out of the book. There are 2 quizzes, a midterm and a final, but he uploads plenty of old ones, and he prepares you more than well enough for those. The TAs are alright. Overall, I learned a lot from this class, and I would recommend it for both science and non-science majors. ", "rating": 5, "expected_grade": "A", "created": "2015-11-12T04:36:00Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "This class feels like a prison. Tim Canty is not an engaging teacher and has his TA's sitting in the back of the classroom watching over the class and watching our every move. I find it unnecessary and excessive. This is one of the classes where he forces and drags you to class. He records his lectures and posts them online which truly is helpful and I am thankful he does that, however, by default, he encourages students to not go to class because they can view the lectures later. However, he has surprise exit cards he calls topics of the days which in turn \"scares\" or \"stresses\" students out into going into class. Also, when we have discussions, rather than reviewing material we went in class, we end up doing group projects which are supposed to support our grade. But discussion is only 50 minutes, so there isn't enough time to explain group projects and do a thorough coverage of material that was went over in class so students are put at a disadvantage. This class seems to set you up to succeed with the way he grades but if anything, it makes the class more tedious than necessary and is setting you up to actually do worse. ", "rating": 2, "expected_grade": "A", "created": "2015-05-05T15:26:00Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Dr. Canty: Such a great professor who is really enthusiastic about the class and teaching you about weather and climate. He is really funny and he tries to keep the class engaging with demonstrations to help you visualize the concepts.\n\r\nExams: There are two exams and then the final (100 points each). Pretty easy, if you go to class and pay attention. Tim posts past exams on ELMS, but there aren't any answer keys, so you have to figure out the answers for yourself. Consists of about 10-15 multiple choice, and then 4-6 free response questions. Does not usually curve. \n\r\nQuizzes: 2 quizzes that are 40 points each. Same format as exams, just shorter.\n\r\nAdmission Tickets: 5 questions quizzes before every class. Answer are straight from the book.\n\r\nProjects: 2 group projects that take place in discussion, presentation format. Also easy, but the 1st project is easier than the second. \n\n\n", "rating": 5, "expected_grade": "A", "created": "2015-04-20T14:02:00Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Dr. Canty is a fantastic professor. Coming from someone who isn't even remotely close to being a science major, this class (and Dr. Canty) are perfect for those who need a lab/I-Series fulfilled. He does a great job. He uses good in-class models and keeps the material surprisingly interesting for a dry subject. \n\r\nHe does do five point quizzes due before every class on ELMS, but honestly the answers come straight from the textbook. There are also \"Topic of the Day\" sections on random class days where it's more or less a way to gauge attendance. (Both of these are worth 5% of your grade individually.) Projects are easy and are definitely a grade booster. In all, Canty is the man and this is a solid class.", "rating": 5, "expected_grade": "A-", "created": "2014-12-08T18:45:00Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim Canty is one of the funniest, cutest professors I've had at UMD.  He keeps the class engaged well by incorporating videos, graphics, jokes, and sidestories into his lectures.  The class itself isn't difficult and doesn't require a lot of studying if you go to all the lectures.  There are two projects over the course of the semester that take a bit of time, but are graded generously and are there to boost your grade.  Would 100% take this class again.", "rating": 5, "expected_grade": "A", "created": "2018-11-29T14:40:41Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Very engaging, down to earth teacher. I never had him test on anything he didn't cover or have in his notes. He truly wants his students to do will but also won't put up with bs in class. He answers every genuine question and is almost always available for a one to one in office hours. Great class and great teacher. Material could get boring but he tried to make clouds as exciting as they could be.", "rating": 5, "expected_grade": "A-", "created": "2019-01-30T20:11:31Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Extremely engaging lectures if you're interested in going. Absurdly self-aware of his nerdiness and lack of class-attendance. If you go to class, you will most likely get an A.", "rating": 5, "expected_grade": "A", "created": "2019-08-12T14:02:22Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim Canty was such a genuine professor and I thoroughly looked forward to his class. He really cares about his students and their well-being. This being my first semester at UMD, it was so nice to have a professor I knew cared about me. He makes his lectures very entertaining, even if the actual topic is not. Tim's passion on the class made it worthwhile and I definitely would take this class again.", "rating": 5, "expected_grade": "A", "created": "2019-12-16T02:57:55Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim is the cutest professor ever. If you go to class, you can get a good score.", "rating": 5, "expected_grade": "B+", "created": "2020-01-29T21:42:56Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim is an absolute LEGEND. Sign up for AOSC200 and thank your respective god for allowing you to learn from one of UMD's best professors. Kind, funny, down to earth... what more could you want? ", "rating": 5, "expected_grade": "A+", "created": "2021-06-21T21:01:14Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Professor Canty clearly cares about his students and loves the material he teachers. He works to make all the lectures engaging and interesting and he teaches with an energy that makes the lectures fun to watch. He is funny, kind, and down to earth and cares more that his students understand the material rather than what grade they get. If you have the chance to take him, please do", "rating": 5, "expected_grade": "A+", "created": "2021-12-07T17:09:01Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim is the GOAT he is such a nice, caring, and funny professor and you can tell that he definitely enjoys everything that he is teaching. Best of all he canceled our final for this semester and let us just keep whatever grade we had in the class, or take it online if we wanted. If you're able to take Tim for a class definitely do. AOSC200 in general was pretty good and interesting but the discussion section group projects were annoying.", "rating": 5, "expected_grade": "A", "created": "2021-12-17T02:48:28Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim is the GOAT he really cares for his students and is really hilarious during the lectures. The material is not that hard but you just need to read and understand the topics. take him if you can this guy deserves an award", "rating": 5, "expected_grade": "A-", "created": "2022-01-10T02:57:50Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim truly cares about his students' success in the class. He always emphasizes how he wants to help you and will follow through if you need it. Good class overall. Manageable workload. Just make sure to review the material and not fall behind. ", "rating": 5, "expected_grade": "A", "created": "2022-01-14T02:55:55Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Ill start with the positives: \r\nTim’s a super nice guy and pretty fair, he tries his best to keep the class interesting. He’s very understanding of students and their needs. He is never condescending towards students and understand that not everyone comes from the same background. Always answers questions from students in depth. \r\n\r\nNow the negatives:\r\nThe class is SO boring. It’s a class on weather, I’m not sure what you’d expect. If you’re not fascinated by weather, I don’t recommend this class. I took this class bc I thought it would be pretty cool but it is now interesting in the slightest. Tim tries his best to make things interesting but it’s just so boring. \r\nAnother thing is, this class is a lot more work than you’d expect, especially for a gen Ed. There are multiple group projects, 2 quizzes ( basically an online midterm - idk why he calls them quizzes), a midterm (in person) and a final (also in person). Oh and a TON of reading. If you read the textbook and do the admission tickets, you don’t need to go to lecture. Despite his fairness, he absolutely does try and “trap” you on the online quizzes. I think he takes his job far too seriously, especially for a gen ed. he tried to justify himself by saying things like “oh i told you not to cheat” It’s an online midterm, of course people are going to try and cheat - any logical person would. Personally I thought the midterms and Quizzes were more difficult than they should have been. \r\n\r\nOverall: \r\nTake this class if you’re super into weather, if you’re not do not take this class. \r\nTim’s a great guy but I do not like the way he structures his class. ", "rating": 3, "expected_grade": "B", "created": "2022-04-25T18:31:53Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Very easy grading system, great professor, if you go to class you will succeed!!!! However, DO NOT CHEAT!!!!! Tim purposely puts questions on quizzes that he knows are on the internet, and he will check for who googled the answers and report you to the honor council.", "rating": 4, "expected_grade": "B+", "created": "2022-04-27T15:33:28Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "He is not the best prof honestly and he doesn't care about his students at all  ", "rating": 2, "expected_grade": "A-", "created": "2022-05-09T22:51:21Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Lots of assignments and projects. Don’t cheat or else you will get caught. ", "rating": 3, "expected_grade": "A-", "created": "2022-07-21T02:54:37Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "He cares about what he's teaching but I feel that he has little compassion for his students.", "rating": 2, "expected_grade": "", "created": "2022-07-27T14:09:07Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Keep in mind this is a genEd and 99% of the people who take the class are only doing so because they have to. \r\n\r\nThis is how Tim runs his class,\r\nTells you to take an online exam, at your convenience, with open notes, and not proctored. That's just edging students to cheat. Any reasonable person who is taking this class, given these circumstances, will cheat - that's just a simple matter of fact. He traps you by asking very specifically worded questions, that when put into google, will give a certain response. If your answer is similar to what google has, he will accuse you of cheating. After \"realizing\" that 50ish kids have cheated, he will give the class two options:\r\n1) Admit to cheating. Get a 0 for that exam. No referral to student conduct\r\n2) Receive an XF from student conduct\r\n\r\nBut no matter what, you will be referred to student conduct, even if you admit to him that you cheated! That's the kind of man Tim is. He will pretend to be your friend, trap you, convince you to admit fault, then lie to you and report you regardless. \r\n\r\nDon't take this class... Tim is a dishonorable person who encourages cheating and does not keep his word. It's a class on WEATHER, he takes it far too seriously, especially for a genEd.", "rating": 1, "expected_grade": "B-", "created": "2022-07-28T19:40:36Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "This guy is a joke, don't take his class unless you want to be accused of cheating.", "rating": 1, "expected_grade": "A-", "created": "2022-09-15T01:26:05.787525Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "If you are expecting an easy class, do not take it. You will need to attend lectures and even do outside studying. Make sure to do your work on time as he doesnt allow late work. His class isnt hard persay, but you CANNOT CHEAT he will find out and is super strict on it. He posts recorded lectures and his slides are really informative. He does host reviews before quizzes and exams. Tim is a nice guy and is caring as long as you dont cheat which apparently a lot of people have judging by the reviews.", "rating": 4, "expected_grade": "B-", "created": "2022-12-20T06:16:39.336954Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Tim is very genuinely very passionate about the subject and lectures are very informative and are available on ELMS. If you attend lecture and put in effort into studying outside of lecture (including taking practice exams and attending review sessions in discussion), you’ll do fine on quizzes and exam.", "rating": 4, "expected_grade": "A-", "created": "2022-12-24T00:30:56.633962Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "this class is interesting and fun, and if you're gonna take this class, I would definitely take it with Tim. He's funny and a good lecturer. However, disclaimer: you have to do these projects in discussion with a group, and that can definitely take a toll on your grade especially if your TA is annoying about grading (and group projects suck in general). Also, you actually need to pay attention and study (not that much but like a tad), this is definitely an easy science class but not an easy gen ed if that makes sense. \r\nI did not do this, but taking notes in class may help you. This might be obvious for some people to do but I didn't think to in an \"easy class\" \r\n- also if you're planning to take this class for fun and not for gen ed reasons, make sure you have energy and room in your schedule to devote at least a little time to this class because it surprisingly requires some energy. \r\nThat said, it's super interesting and gives good general knowledge on our weather system, so I would still recommend taking it, just keep these things in mind :)", "rating": 4, "expected_grade": "", "created": "2022-12-26T00:18:40.841282Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "I thought this class was pretty easy I would have had an A+ if i didnt forget about one of the weekly summaries but thats beside the point. Lectures are recorded and I didnt go to many during the 2nd half of the semester but I still watched them as they were very informative and he explained the concepts in a way that made them very easy for me to understand. Discussion projects was what took up most time out of class but were relatively easy and my TA was pretty good and didnt grade hard at all. Besides that, every lecture an easy admission ticket is due before you get to class. The single midterm was very easy in my opinion. The final was even easier though and I got a good grade with very little studying. Overall I recommend Tim, he brings some humor to lecture and just know hot air rises.", "rating": 5, "expected_grade": "A", "created": "2023-01-13T04:37:53.699795Z"}, {"professor": "Timothy Canty", "course": "AOSC200C", "review": "Not the best lecturer or most organized professor in the world, but he's extremely nice and flexible; an example being how I had a complication the day of the final, so I wanted to take it early, and he let me do so. He was also a great carillon professor to have, as I was in the 200C section. I must admit that I may have slacked off in this class a tiny bit, so it should be very possible to get an A. Just make sure you're getting a good supply of notes and practice problems/exams.", "rating": 4, "expected_grade": "A-", "created": "2023-12-25T01:46:36.824487Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Honestly, he makes the class pretty interesting. If you are curious about weather and you need an elective its not that bad to take. You will want to go to class or watch the lecture videos because he doesn't post a ton to study off of. Tests were fair but you will definitely need to study for them.", "rating": 4, "expected_grade": "A", "created": "2023-12-26T04:41:41.341139Z"}, {"professor": "Timothy Canty", "course": "AOSC200", "review": "Most boring class ever. Tim is nice but kinda weird", "rating": 1, "expected_grade": "A", "created": "2024-02-20T21:04:39.937065Z"}], "name": "Timothy Canty", "slug": "canty"}