{"courses": ["ENGL391", "ENGL394", "ENGL398C", "ENGL101", "ENGL101H", "ENGL271", "ARHU158C", "ENGL273", "ENGL271"], "average_rating": 3.1304, "type": "professor", "reviews": [{"professor": "Tom Hatcher", "course": "ENGL101H", "review": "He was an extremely nice and fairly laid-back professor. He was always extremely understanding with everything that was going on because of the pandemic. He also seemed genuinely interested in our writing and the topics we were interested in and clearly wanted to see us improve throughout the semester. ", "rating": 5, "expected_grade": "A+", "created": "2021-04-30T21:14:28Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "This class was great! The course material was relevant and customized to each student. The class is based on a few discussion posts, minor assignments regarding thank you letters, and multiple drafts and discussions of the final paper. Our online class only met once a week, but perhaps class structure will change as we go in-person. The final paper regards a problem and solution of your choice and is easier to write because you get to choose the topic which can be based on your major. The class is also heavy on peer review. I highly recommend giving detailed and full responses to peer review as it helps your own writing and comprehension, but is also very important to the professor when grading. The professor was amazing and is genuinely interested in the topics he teaches. He is also available for discussions regarding assignments and is very understanding of any valid excuses that may arise. I recommend going to lecture as you'll most likely not be bored and group work is a priority for the professor. There is also no extra or \"busy\" work as in other English classes, only thoughtful reflection. Overall, I thoroughly enjoyed the class and strongly recommend this professor. ", "rating": 5, "expected_grade": "A+", "created": "2021-05-17T17:13:54Z"}, {"professor": "Tom Hatcher", "course": "ENGL271", "review": "Was super super excited to take this class but Hatcher really zaps it out of you. He isn't rude, but he is very pretentious and really likes to hear himself talk. Participation is VERY important, but I got points taken off for leaving to go to the bathroom... The class itself and curriculum is great but Hatcher makes it really hard to like him as a person.", "rating": 2, "expected_grade": "", "created": "2021-12-17T22:05:22Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "Prof. Hatcher genuinely wants his students to do well. It's a small class and he really tries to connect with everyone he definitely knew everyone's name by the end of the semester. Definitely participation heavy but he makes it enjoyable to come to class. Very focused on peer review but that is pretty much the only homework there will be besides long term papers that he give many opportunities for one on one feedback. if you ask him good questions during class time and follow all the steps on time for the assignments you should get a good grade in the class. ", "rating": 5, "expected_grade": "A+", "created": "2021-12-20T19:52:46Z"}, {"professor": "Tom Hatcher", "course": "ENGL271", "review": "This was an enjoyable class. Very peer feedback heavy. But the workload was not heavy at all -- unless you wanted to write extra poems and short stories on your own. Mr. Hatcher gave great feedback on all of my submissions and was pretty lenient about due dates. He definitely came off a little weird at times, but overall a lovely class.", "rating": 4, "expected_grade": "", "created": "2022-01-26T03:50:11Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "Professer Hatcher can be rude and a bit snarky. If your attendance is not perfect he will deduct points from your assignments even if you provide quality work. The overall workload is not heavy but your grade is pretty much completely dependent on attendance. I would recommend a different professor to fulfill PW requirements if possible. ", "rating": 1, "expected_grade": "", "created": "2022-05-19T20:30:52Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "Maybe the other comments on here were written by students who took the class online, but this class was by far the worst one I've taken at UMD. English has always been my favorite subject, but Hatcher changed my mind. Very rude in class and shows no understanding regarding other priorities students may have. Literally assigns dozens of peer review workshops to give himself less work when it comes to grading assignments. You'll receive little to no feedback from him, while your grade is basically based on your attendance. If you can't make it to every single class on time and do not get up to use the bathroom, good luck! There's no way to feel comfortable in the class, as he is weird. If possible, opt for another professor.", "rating": 1, "expected_grade": "", "created": "2022-05-19T20:34:34Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "Great professor for Professional Writing. Actually felt like I learned something from his class. Attendance is mandatory, but it is not taxing. Not too many assignments overall in the class; just a large focus on working on a semester-long proposal on a topic of your choice. Highly recommend. ", "rating": 5, "expected_grade": "A+", "created": "2022-05-20T11:46:00Z"}, {"professor": "Tom Hatcher", "course": "ENGL101", "review": "Is very annoying, talks just to talk", "rating": 2, "expected_grade": "", "created": "2022-10-10T13:45:16.704810Z"}, {"professor": "Tom Hatcher", "course": "ARHU158C", "review": "Hatcher is 100%, my favorite professor. He is very involved with his students which I love, but that means this class is very discussion and participation based. 20% of your grade goes into \"Class citizenship\" and basically every class we have a discussion about xyz (not graded just always having a discussion)... I found this class very interesting and fun! There was not too much work that went into it, definitely more of a chill class but you still need to put in the effort.", "rating": 5, "expected_grade": "A+", "created": "2022-12-05T17:55:28.999528Z"}, {"professor": "Tom Hatcher", "course": "ENGL101", "review": "He's a great professor! He is very lenient and will usually push back due dates when needed; he has no problem with giving extensions either. The class mainly includes student participation and discussions about readings at the beginning of the course and later on, switches to workshops, peer reviewing, and discussions about upcoming papers. I recommend taking his course!!", "rating": 5, "expected_grade": "", "created": "2022-12-11T03:36:15.288479Z"}, {"professor": "Tom Hatcher", "course": "ENGL271", "review": "this man is awful. he talks over you and only cares about what he has to say. if you say something he does not agree with he is genuinely condescending. was rude during class and picked favorites", "rating": 1, "expected_grade": "", "created": "2022-12-14T00:16:58.201366Z"}, {"professor": "Tom Hatcher", "course": "ENGL101S", "review": "Professor Hatcher truly cares about his students, he will take your feedback, listen, and follow through. He is extremely knowledgeable and passionate about this subject, so he prepares you very well for all the essays you write. He is a very fair grader and wants you to succeed. He is also willing to push back due dates if you need more time, or modify the assignment if it is too much. Much of his class is him talking at us and can get boring and sometimes hard to follow, but he will answer any questions you have. Additionally, there is a bunch of peer review and workshops as well as reflections on assignments in addition to 5ish main essays. Overall, a great professor who truly cares and wants everyone to do well.", "rating": 5, "expected_grade": "A-", "created": "2022-12-20T00:37:51.963822Z"}, {"professor": "Tom Hatcher", "course": "ENGL101", "review": "Overall, pretty mid, pushed back due dates and was flexible for students but had some questionable grading practices.", "rating": 3, "expected_grade": "A", "created": "2023-01-22T00:24:58.391084Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "This is quite literally the worst professor I have ever had. I try not to be dramatic when it comes to these thing's but he is genuinely horrible. Hatcher will treat you like you are in high school. He has told people to put phones away and AirPods away. He has no completion grades. He says he does, but he grades them based on quality as well. The most passive aggressive professor I have ever had. The harshest grader and overall, very unpleasant to be around. Take this class with one of the other thousands of professors who teach it.", "rating": 1, "expected_grade": "", "created": "2023-04-11T19:53:59.576779Z"}, {"professor": "Tom Hatcher", "course": "ENGL394", "review": "Overall the class was fairly easy and manageable. The biggest issue was with prof Hatcher whose lectures were boring and felt pointless. Most of the stuff he lectured about I already knew and he would lecture about readings from weeks before. Prof Hatcher means well but can be annoying to deal with, especially when class participation is slow he gets upset and makes snarky comments. Treats students like high schoolers.", "rating": 1, "expected_grade": "A", "created": "2023-05-10T16:37:38.984195Z"}, {"professor": "Tom Hatcher", "course": "ENGL101", "review": "I will say, when I was taking this class I was struggling HARD but Prof Hatcher didn't really care about that. He was mean and rude to me in front of my classmates, loudly telling everyone in the room how far behind I was in more than one occasion. It was embarrassing for me and uncomfortable for others nearby but Prof Hatcher did not seem to mind. Regarding his teaching style, he likes to hear himself talk and his lectures can be quite annoying. He is really big on attendance and does not like having to deal with students that skip lecture (even with a reasonable excuse).", "rating": 1, "expected_grade": "", "created": "2023-10-18T06:34:48.552458Z"}, {"professor": "Tom Hatcher", "course": "ENGL101S", "review": "Not a great class. He would grade very easily to start and then out of nowhere began to grade the essay as if every student were grad students. His measures of grading are unfair and the class energy is low. Take another professor if you can.", "rating": 2, "expected_grade": "B+", "created": "2023-11-15T14:49:08.846692Z"}, {"professor": "Tom Hatcher", "course": "ENGL101S", "review": "I don't know why his reviews have been so low lately, I think Professor Hatcher is pretty decent. Half of the essays in this class are graded on participation and the discussion boards are free 10/10s. Yeah, his grading gets a little harder later in the semester, but the last major assessment you do is very short and also based mainly on if you do it or not. Professor Hatcher is a kind guy who cares about all of his students. I had a relatively good time in this class.", "rating": 4, "expected_grade": "A-", "created": "2023-12-08T02:46:15.494227Z"}, {"professor": "Tom Hatcher", "course": "ENGL101S", "review": "Pretty terrible professor in my opinion. The class started off super easy, but he started to grade very harshly out of nowhere. He likes to hear himself talk and his classes are really boring, but you have to attend every lecture because he cares about attendance. He is very passive-aggressive and takes points off for the weirdest reasons. I've gotten points taken off for chewing gum in class and \"excessive yawning\". He does give you opportunities to extend deadlines, but it doesn't matter because he grades like a grad school professor. Take another professor if you can.", "rating": 1, "expected_grade": "B", "created": "2023-12-15T03:02:41.562354Z"}, {"professor": "Tom Hatcher", "course": "ENGL101", "review": "Professor Hatcher is a great professor who genuinely cares about his students, though his lectures can be a bit boring at times. He treats his class like a high school group, making sure everyone connects with each other. He's always available for help and listens attentively. Despite the lectures, I really enjoyed the other aspects of the class, like his flexibility with deadlines and how he encourages involvement in campus events. He even rewards you to use campus resources like the UMD Writing Center by giving you extensions.", "rating": 4, "expected_grade": "B", "created": "2023-12-15T21:03:00.163002Z"}, {"professor": "Tom Hatcher", "course": "ENGL101S", "review": "Professor Hatcher is passionate about the readings he gives and does truly care about improvement in writing. His grading is pretty fair and he is an understandable person but his lectures were the worst part of his class. He would take up most of the time in class repeating the same names and information in multiple lectures which made it extremely boring and honestly just wastes time. Other than the lectures, his class is decent and Prof Hatcher is a nice person who can help you better your writing.", "rating": 4, "expected_grade": "A-", "created": "2023-12-22T01:57:14.846256Z"}, {"professor": "Tom Hatcher", "course": "ENGL101", "review": "Took Professor Hatcher fall 2023. I procrastinated every writing assignment, and most of them are manageable in a 2-4 hour time frame if you pick the right topic. He was very understanding about missing a class or extending deadlines if you had a reason. As long as you participate in class (which can be asking a question or literally telling him how your weekend was at the beginning of class), you will probably get an A. One of his assignments was to post a selfie from a basketball game, and he took us to the UMD farm one class for a \"group bonding\" experience. Overall, he was a good professor.", "rating": 5, "expected_grade": "A+", "created": "2024-03-29T17:24:28.601438Z"}], "name": "Tom Hatcher", "slug": "hatcher"}