{"courses": ["ENGL101", "AAST233", "ENGL233", "ENGL222", "CMLT275", "ENGL101X", "WGSS275"], "average_rating": 3.8, "type": "professor", "reviews": [{"professor": "Xiaofang Huang", "course": "ENGL101", "review": "Dr. Huang is really nice, a fair grader, and actually provides helpful feedback.  She is more than willing to meet with you and give edits for major assignments, so make sure you utilize that.  Classes can be boring and often seem pointless, so you just kinda have to sit through it and hope it's over soon.  She takes attendance too.  Also, don't bother buying the textbook that she tells you to, you can still do well in the class without it. The course overall is very structured and organized, which I liked.  As long as you do all the assignments and put in effort, this class will be an easy A.  Dr. Huang is really accommodating and you can tell she actually cares about her students.", "rating": 4, "expected_grade": "A", "created": "2022-12-09T14:50:35.502545Z"}, {"professor": "Xiaofang Huang", "course": "ENGL101", "review": "Dr. Huang is passionate about the course, yet the students don't reciprocate her excitement as this is a required course and no one is too interested. Nevertheless, she is attentive and eager to better the writing skills of her students. I am already proficient in writing so I wasn't concerned about passing this class. However, for every assignment, Dr. Huang was willing to read my draft and gave very specific feedback, which I greatly appreciated. I do think she helped me improve and find better clarity in my writing. I recommend not wasting your money on the book since we only had a quiz about its content. I was expecting more quizzes that would justify paying so much for a book, but I believe we only had two at the beginning. If possible, share with friends since she does like the students to read example essays and certain topics from the book.", "rating": 5, "expected_grade": "A", "created": "2023-05-17T14:11:39.535234Z"}, {"professor": "Xiaofang Huang", "course": "ENGL222", "review": "Prof Huang is very nice and calm. Her class is packed with literature and the readings are long. You are expected to read different texts and be prepared to discuss the topics in class. As long as you know the main ideas and themes you'll be fine. She also likes to cold call on people during class. You will have discussion posts each week, one group presentation, and a final. The final can be a paper, video, podcast if you want. This class is pretty easy and chill as long as you turn in your work. She does take attendance so come to class for participation points.", "rating": 4, "expected_grade": "A+", "created": "2023-11-02T14:23:56.175270Z"}, {"professor": "Xiaofang Huang", "course": "ENGL222", "review": "Assigns way too much work", "rating": 1, "expected_grade": "A", "created": "2023-12-06T08:07:47.467650Z"}, {"professor": "Xiaofang Huang", "course": "ENGL101", "review": "Prof Huang is honestly one of the best English professors I've ever had. While the class itself wasn't that interesting, she kept us engaged and interested in our projects throughout the entire semester. She is one of the kindest, most accommodating, and most understanding professors I've ever met. She understands that there is life outside this class and that sometimes life gets in the way. She does take attendance and monitor participation, so do show up, and participate. The class is pretty small so it's not too intimidating.\r\n\r\nHonestly take her if you can, I really enjoyed this semester with her and I wish I could take another class with her in the future.", "rating": 5, "expected_grade": "A", "created": "2023-12-20T02:47:07.624516Z"}], "name": "Xiaofang Huang", "slug": "huang_xiaofang"}